{"first_name":"A.G.W.","last_name":"Biddle, III","permalink":"a-g-w-biddle-iii","crunchbase_url":"http://www.crunchbase.com/person/a-g-w-biddle-iii","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Nov 25 07:09:37 UTC 2008","updated_at":"Tue Nov 25 07:12:43 UTC 2008","overview":"<p>Prior to co-founding NBVP in 1996, Jack was President and CEO of InterCAP, a venture-backed computer software company. InterCAP was number 18 on the &#8220;Fast 50&#8221; list of the mid-Atlantic&#8217;s fastest growing companies and was acquired by Intergraph in 1995. From 1987 to 1990, Jack rose from Senior Associate to Partner at Vanguard Atlantic, Ltd., a merchant banking group focused on M&amp;A advisory work and control investments in software companies. At VAL, he served as turnaround CEO of a system software company and then as COO of an application software company. Earlier in his career he was an IT Industry Generalist, focused on Telecommunications Technology, at the Gartner Group, where he was also Executive Assistant to the CEO, Gideon Gartner. He began his career in 1983 in Austin, Texas at Business Development Partners, an early stage venture capital partnership. Jack holds a BA in Economics from the University of Virginia.</p>\n\n<p>Jack currently serves on the Boards of Vision Chain (Chairman), CorasWorks (Chairman), Triumfant, eMinor, Digital Sports, ObjectVideo, Ztar Mobile, Starfish Retention Solutions, Appian Corporation and CivicUS . Past Board or Observer seats include SafeView, Inc. (acquired by L3 Communications), Matrics (acquired by Symbol Technologies), Giga Information Group (Nasdaq: GIGX) (Lead Director), acquired by Forrester), Telogy Networks, (acquired by Texas Instruments), Tantivy (acquired by Interdigital), AnswerLogic (acquired by Primus Knowledge Systems), and Blackboard, Inc. (Nasdaq: BBBB).</p>\n\n<p>He is on the Investment Committee of the University of Maryland’ss New Markets Growth Fund, an SBA leveraged fund targeting development oriented private equity investments in disadvantaged areas. He is a frequent speaker on entrepreneurship for the U.S. Department of Commerce, and has made presentations for them in Russia, China and Japan. He also advises the Department of Defense on Technology and Innovation. Jack is on the Board of the Baltimore Symphony Orchestra where he has served as Vice Chairman, and on their Finance and Executive Committees, and is a Trustee, serving as Treasurer and Finance Committee Chair, of the Sibley Memorial Hospital Foundation.</p>","image":{"available_sizes":[[[122,145],"assets/images/resized/0002/9526/29526v1-max-150x150.jpg"],[[122,145],"assets/images/resized/0002/9526/29526v1-max-250x250.jpg"],[[122,145],"assets/images/resized/0002/9526/29526v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Novak Biddle Venture Partners","permalink":"novak-biddle-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,69],"assets/images/resized/0000/3475/3475v1-max-150x150.png"],[[200,93],"assets/images/resized/0000/3475/3475v1-max-250x250.png"],[[200,93],"assets/images/resized/0000/3475/3475v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}