{"first_name":"A","last_name":"J Hyland","permalink":"a-j-hyland","crunchbase_url":"http://www.crunchbase.com/person/a-j-hyland","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Aug 09 12:07:29 UTC 2009","updated_at":"Sun Aug 09 12:08:11 UTC 2009","overview":"<p>As President and CEO of Hyland Software, I am committed to remain accessible to all of our customers, solution providers, business partners and employees. To that end, you can call me at any time for any reason. That means 24 hours a day, 365 days a year. I want to make sure you are receiving the best possible service from Hyland Software&#8211; and being accessible is part of that equation.</p>\n\n<p>So, when I am not on the phone, I am working closely with the Hyland Software management team to ensure that we continue to provide great software and great service. I want you to be delighted (&#8220;satisfied&#8221; is not good enough!) about your experience with Hyland Software.</p>\n\n<p>If you are a current customer or solution provider, thank you for your continued support of Hyland Software. We are honored to work with you. If you are a potential customer or solution provider, we sincerely want the opportunity to prove to you that we have great people that continue to make great software and provide great service.</p>\n\n<p>Have a great day, and remember, you can call me at any time for any reason.</p>\n\n<p>A.J. Hyland is President and Chief Executive Officer for Hyland Software, Inc.  Hyland joined HSI in 1993 and has held various positions throughout the company since then.  He was part of the quality assurance team until 1995 and then moved into the sales department.  In 1997, A.J. was promoted to president of Hyland Software.  In 2001, he was promoted to CEO. \nA.J. serves on the Board of Directors for Hyland Software.  He served on the Board of Directors of the Association for Information and Image Management (AIIM) for 5 years and was Chair of the association in 2004.  He was welcomed into AIIM’s Company of Fellows in 2005.</p>\n\n<p>A.J. earned his Bachelors of Science in Business Administration from Georgetown University.</p>","image":{"available_sizes":[[[121,150],"assets/images/resized/0005/5721/55721v1-max-150x150.jpg"],[[135,166],"assets/images/resized/0005/5721/55721v1-max-250x250.jpg"],[[135,166],"assets/images/resized/0005/5721/55721v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Hyland Software","permalink":"hyland-software","type_of_entity":"company","image":{"available_sizes":[[[149,60],"assets/images/resized/0005/1590/51590v3-max-150x150.png"],[[149,60],"assets/images/resized/0005/1590/51590v3-max-250x250.png"],[[149,60],"assets/images/resized/0005/1590/51590v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}