{"first_name":"A. Pierre","last_name":"Yurow","permalink":"a-pierre-yurow","crunchbase_url":"http://www.crunchbase.com/person/a-pierre-yurow","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"developing-markets, brics, bric, mobile, silicon-valley, startup, analytics, retail, advertising, payments, banking, m-wallet, m-pesa, pesa, patents","alias_list":null,"created_at":"Fri Aug 03 01:07:59 UTC 2012","updated_at":"Sat Aug 04 14:45:04 UTC 2012","overview":"<p>A. Pierre Yurow is the Chief Executive Officer, Head of Innovation and Founder of Spectrum Mobile Ltd, a  patented multimedia relationship marketing, consumer loyalty, retention &amp; analytics company.</p>\n\n<p>He is responsible for the daily operations, new business development and the corporate strategy, product development, design and management of the global technical infrastructure. Like his compatriot Muhammad Yunus, former Managing Director of Grameen (Rural) Bank and Nobel Prize winner from Bangladesh, Pierre founded Spectrum on the mission of bringing commerce, microcredit and a better quality of life to all.</p>\n\n<p>Mr. Yurow is a mobile industry and Silicon Valley veteran with an extensive track record. He has worked with such venture-backed companies as Mobile Posse, Cellfire, Bling Software, uVuMobile, SmartVideo, 2ergo, Proteus, Virgin Mobile, Seven Networks and Wcities. Mr. Yurow&#8217;s previous roles include the VP of Business Development at Omnicom&#8217;s mobile division, India’s Tanla as Head of VP of Business Development-Americas and managed Product Development at the Associated Press&#8217; AP Mobile team. He began his career at Cellular One (now AT&amp;T).</p>\n\n<p>Mr. Yurow frequently speaks at mobile and digital media conferences and has successfully raised capital for numerous private and public companies.</p>\n\n<p>His personal time is spent recording and playing live for his electronic civil rights band CANOROUS, training and competing for the Ironman and ITU Olympic Triathlon world championships as well as other races around the globe, Krav Maga training, surfing, and spending time with his family. He has completed the Ironman (twice), Nice and the Olympic Trials Triathlon in 2000 (Europe) and 2004 (Asia) as well as podium finishes in over 100 other races. He was also sponsored triathlete for PowerBar Team Elite for over a dozen years as well as Brooks Running Shoes.</p>\n\n<p>Mr. Yurow has a Bachelor’s of Science, in Computer Science and Management from New York University&#8217;s Stern School of Business.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}