{"first_name":"AAA","last_name":"Online Teleshopping","permalink":"aaa-online-teleshopping","crunchbase_url":"http://www.crunchbase.com/person/aaa-online-teleshopping","homepage_url":"http://www.aaateleshoping.in","birthplace":"Delhi","twitter_username":"NeerajLavaniya","blog_url":"http://aaateleshopingpvtltd.blogspot.com/","blog_feed_url":"http://aaateleshopingpvtltd.blogspot.com/","affiliation_name":"Unaffiliated","born_year":1984,"born_month":2,"born_day":8,"tag_list":"online-shopping-website, teleshopping-india, teleshopping-products, health-and-fitness-products, online-shopping-in-india, religious-products, hindu-religious-products, health-care-products-","alias_list":null,"created_at":"Tue Mar 06 07:36:44 UTC 2012","updated_at":"Wed Mar 14 20:33:53 UTC 2012","overview":"<p>AAA TELESHOPING PVT. LTD. has very rapidly emerged as a trustworthy name in the teleshopping industry. In light of its incredible growth rate, the aaateleshoping.in is now counted amongst the best teleshopping website in India We provide the clientele with a wide range of astrology products, spiritual items and health related products. Situated in the Pitampura region of North Delhi, the company headquarter launches many useful and innovative products every now and then. Some of the most selling products which are extremely coveted amongst the common populace are Rudraksh Kavach, Hanuman Kavach Dakshina warti Shankh, Lakshya prapti pendant, swasthya wardhak pendant, bal raksha pendant, different sorts of gems (Blue Sapphire, ruby, pearl, Emerald) etc.\nAAA Teleshopping Pvt Ltd commenced its operation in the year of 2005. In merely 6 years, the company has developed as a cornerstone in the teleshopping market. The simple philosophy behind the unbelievable success of the organization is rendering quality products and eradicating the doubts and problems of shoppers with round the clock customer support. For AAA, client satisfaction is utmost important. We make it happen for in time delivery of your desired product. The television infomercials are dubbed as per the region they are to be telecasted which helps us to convey the actual message to the masses of respective areas.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0017/7189/177189v2-max-150x150.jpg"],[[170,170],"assets/images/resized/0017/7189/177189v2-max-250x250.jpg"],[[170,170],"assets/images/resized/0017/7189/177189v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}