{"first_name":"Aaron","last_name":"Franco","permalink":"aaron-franco","crunchbase_url":"http://www.crunchbase.com/person/aaron-franco","homepage_url":"http://www.nGrinder.com","birthplace":"New York","twitter_username":"nGrinderJP","blog_url":"http://blog.nothinggrinder.com","blog_feed_url":"http://blog.nothinggrinder.com/feed","affiliation_name":"nothingGrinder","born_year":1979,"born_month":2,"born_day":28,"tag_list":"flash, adobe-flash, nothinggrinder, founder","alias_list":null,"created_at":"Mon Dec 28 22:21:09 UTC 2009","updated_at":"Tue Dec 29 04:40:13 UTC 2009","overview":"<p>Adobe Flash Platform and Actionscript 3.0. Data driven Adobe Flash application design and development. Optimizing Adobe Flash for the web and mobile. I specialize in adapting Adobe Flash technology to the usability standards expected by users of the modern web.</p>\n\n<p>Aaron Franco had the good fortune to be exposed to computers, programming, and various forms of digital media at a young age. Entering university Aaron satisfied his creative urges by enrolling in a Cinema program at Binghamton University where he studied cinematography and cinematic technologies where he learned the ins and outs of various media softwares and mechanical processes. Being a tech junkie, he quickly worked his way through Pro Tools, Apple&#8217;s Final Cut Pro, and various Adobe softwares.  Aaron focused his time on learning the technical aspects of how software worked and became a technical resource for the student body. During his University career Aaron acted as a professor&#8217;s assistant in many of his cinema lectures which involved the use of cameras, computers, and other media tools. </p>\n\n<p>After graduating University Aaron decided to pursue his dream of becoming fluent in a second language. This brought him to Tokyo, Japan. Eight months after arriving he was building hybrid websites (Flash Websites that delivered HTML website alternatives in the absence of Flash) and speaking Japanese on a daily bases. Soon after he felt confident in Flash Programming he was presented the opportunity to create a website for Stone Deaf: a local band in Tokyo, who gave him the chance to test his knowledge of Flash and website development. After its completion he realized the drawbacks of Flash and many of the limits of the internet, he then set out to change this. His passion for building a better website was born from this experience. Beginning his research and development of automated process and various forms of AI. </p>\n\n<p>After dabbling in the automated processes provided by Apple computers with Gabriel, Aaron was hooked. Aaron continued to apply AI principles to workflows in PHP and dove into the learning of Object Oriented Programming (OOP) principles and design. Although he had no experience in computer science, he learned how to harness the power of OOP and started applying it to website design and development. This is when he first visualized &#8220;nGn&#8221;, an automated website development engine! This visualization came from a desire to cut months of development down to a few days. \nWorking with Gabriel Ortiz, who was developing a passion for business development and creating a home grown career through NESTA and EPIS in the UK.  Aaron was inspired! Giving him the motivation he needed to attempt this seemingly insurmountable project. Having a fair share of successes and failures he learned the ins and out of what was immediately possible and what was required to further develop and realize this dream.</p>\n\n<p>In 2008 Aaron took on a 20 page web development project for a local corporation in Tokyo. Using this project as a springboard to further his technology concept, He was able to develop a prototype of &#8216;nGn&#8217;. This first iteration was then transformed into a more simplified verison for another small business in Japan, Trend Right Japan. These two projects gave him the confidence he needed to start building the product in the form of an online service available to the public, giving Gabriel the leverage he needed to create a path to market for nGn. </p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0007/1374/71374v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0007/1374/71374v2-max-250x250.jpg"],[[450,300],"assets/images/resized/0007/1374/71374v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"Cinema","institution":"Binghamton University","graduated_year":2001,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder / CTO","firm":{"name":"nothingGrinder","permalink":"nothinggrinder","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0007/0494/70494v4-max-150x150.png"],[[200,200],"assets/images/resized/0007/0494/70494v4-max-250x250.png"],[[200,200],"assets/images/resized/0007/0494/70494v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.ngrinder.com","title":"website"},{"external_url":"http://blog.nothinggrinder.com","title":"blog"}],"web_presences":[{"external_url":"http://uk.linkedin.com/in/agfranco","title":"LinkedIn"},{"external_url":"http://twitter.com/nGrinderJP","title":"Twitter"}]}