{"first_name":"Aaron","last_name":"Cheatham","permalink":"aaron-cheatham","crunchbase_url":"http://www.crunchbase.com/person/aaron-cheatham","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 14 13:40:41 UTC 2008","updated_at":"Sun Nov 16 18:52:58 UTC 2008","overview":"<p>Aaron Cheatham joined JAFCO Ventures in 2006. He is a general partner of the firm and brings more than 15 years of venture capital, investment banking and operating experience to the firm. Given his deep technical background, Aaron enjoys assessing disruptive technologies and helping entrepreneurs build exciting, new companies. At JAFCO, Aaron has been involved with Attributor, Avnera, Calypto, Devicescape, GTronix, Quellan, SiTime and Symwave.</p>\n\n<p>Prior to joining JAFCO Ventures, Aaron spent six years at Mobius Venture Capital working with communications infrastructure, components and wireless technology companies. Earlier, he was in the investment banking business, as a vice president with Merrill Lynch&#8217;s Technology Investment Banking Group where he helped raise more than $5 billion for companies such as CyberSource,<br/>\nInternet Capital Group, Maxtor, PLX Technology, Pivotal and STMicroelectronics and as a founding employee of Epoch Partners, a technology-enabled investment bank formed through partnerships with Ameritrade, Charles Schwab and TD Waterhouse.</p>\n\n<p>Aaron began his career in Silicon Valley as a technical sales engineer at Advanced Micro Devices, where he gained valuable operating experience through his interaction with leading workstation manufacturers and their contract manufacturers.</p>\n\n<p>Aaron’s prior venture capital experience includes active involvement with Aprio Technologies (Blaze DFM), Danger, Dantz Development (EMC), HVVi Semiconductors, Impinj, PocketThis, SkyPilot Networks, Transilica (Microtune), United Devices (Univa) and XaQti (Vitesse).</p>\n\n<p>Aaron received his M.B.A. from the Anderson School at UCLA and his Bachelor of Science degree in electrical engineering from Cornell University. He is an avid fly fisherman and loves coaching soccer and fast pitch softball.</p>","image":{"available_sizes":[[[150,103],"assets/images/resized/0002/8687/28687v1-max-150x150.jpg"],[[160,110],"assets/images/resized/0002/8687/28687v1-max-250x250.jpg"],[[160,110],"assets/images/resized/0002/8687/28687v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Jafco Ventures","permalink":"jafco-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,30],"assets/images/resized/0000/3562/3562v1-max-150x150.png"],[[175,35],"assets/images/resized/0000/3562/3562v1-max-250x250.png"],[[175,35],"assets/images/resized/0000/3562/3562v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}