{"first_name":"Aaron","last_name":"McKee","permalink":"aaron-mckee","crunchbase_url":"http://www.crunchbase.com/person/aaron-mckee","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jan 25 22:27:07 UTC 2010","updated_at":"Mon Jan 25 22:35:26 UTC 2010","overview":"<p>In his current role, Aaron is responsible for managing Ground Truth’s business relationships with mobile operators and other partners. He came to Ground Truth from Motricity, where he was senior director, international sales and business development. There, he oversaw all international business development for the mobile data services company, working with operators, OEMs, media and entertainment brands and major Internet brands. Before this role at Motricity, Aaron served InfoSpace as director, partner development, where he was responsible for all facets of relationships and account development with mobile operator clients.</p>\n\n<p>Before joining InfoSpace, Aaron spent six years in various roles at Sprint, most recently as senior manager, business development, where he developed strategies to deliver business-facing products and services globally, including Sprint’s WLAN initiatives. He was also an integral part of the leadership team that led the strategy, development, launch and management of the first wireless Web service in North America, Sprint PCS Wireless Web, and the world’s first commercial mobile search service via Sprint PCS’ Wireless Web partnership with Google.</p>\n\n<p>Aaron earned an M.B.A. in International Management from the Thunderbird School of Global Management and a bachelor’s degree from the University of Kansas.</p>","image":{"available_sizes":[[[116,150],"assets/images/resized/0007/4802/74802v1-max-150x150.jpg"],[[140,180],"assets/images/resized/0007/4802/74802v1-max-250x250.jpg"],[[140,180],"assets/images/resized/0007/4802/74802v1-max-450x450.jpg"]],"attribution":"<p>Ground Truth</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"VP Partner Development","firm":{"name":"Ground Truth","permalink":"ground-truth","type_of_entity":"company","image":{"available_sizes":[[[150,51],"assets/images/resized/0007/4796/74796v2-max-150x150.jpg"],[[150,51],"assets/images/resized/0007/4796/74796v2-max-250x250.jpg"],[[150,51],"assets/images/resized/0007/4796/74796v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}