{"first_name":"Aaron","last_name":"Averbuch","permalink":"aaron-averbuch","crunchbase_url":"http://www.crunchbase.com/person/aaron-averbuch","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"AdReady","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Mar 13 15:41:11 UTC 2012","updated_at":"Mon Mar 19 00:59:51 UTC 2012","overview":"<p>Aaron leads all of AdReady’s operational and engineering initiatives. He has 10+ years of experience in the technology industry as architect, manager, and developer, with multiple patents (approved and pending) to his name. Prior to AdReady, Aaron led the work of the Seattle office of Cisco’s Home Network Business Unit (“Linksys”), which he joined via the 2008 acquisition of Pure Networks, across technology, product management, marketing and IT. He drove the technology work for all PC, Mac, and Mobile development for Linksys products, including the award-winning Cisco Connect management software, Network Magic networking suite, and Linksys Router Setup wizards. Prior to Pure Networks/Cisco, Aaron was a Lead Software Developer at Microsoft, focused on architecting major rewrites of Windows Update, and later, Online Safety (anti-spam and anti-phishing). For his work on anti-phishing, he was the sole winner of Microsoft’s 2005 Trustworthy Computing Excellence Award. Aaron holds BA and MS degrees from Washington University in St. Louis.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP of Technology","firm":{"name":"AdReady","permalink":"adready","type_of_entity":"company","image":{"available_sizes":[[[150,59],"assets/images/resized/0000/1303/1303v4-max-150x150.png"],[[200,79],"assets/images/resized/0000/1303/1303v4-max-250x250.png"],[[200,79],"assets/images/resized/0000/1303/1303v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}