{"first_name":"Aaron","last_name":"Holiday","permalink":"aaron-holiday","crunchbase_url":"http://www.crunchbase.com/person/aaron-holiday","homepage_url":"","birthplace":"New Orleans","twitter_username":"aholidayiii","blog_url":"http://www.aholidayiii.com/","blog_feed_url":"","affiliation_name":"BR Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Apr 15 04:49:43 UTC 2011","updated_at":"Wed May 11 22:49:48 UTC 2011","overview":"<p>Aaron Holiday, a native of New Orleans, is a MBA student at Cornell. After successfully starting and running a software consulting firm for two years as a student at Morehouse College, Aaron decided to begin his professional career at Goldman Sachs in 2004. At Goldman Sachs Aaron built and supported the Program Trading desk, which executed $4B in notional trades daily (including trades from the algorithmic trading desk). In 2008, Aaron decided to join the head of Product Development at GFI Group to redesign the firm’s Foreign Exchange Options trading technology platform. At GFI, Aaron led innovative advancements that changed a once voice brokerage business model to an award winning electronic derivative trading system that facilitated global trades with the world’s top financial institutions. While in New York City, Aaron served on three boards: iMentor, Harlem Independent Living Center (HILC), and DSJ Co-op Board of directors.  </p>\n\n<p>At Cornell, Aaron leads the eLab, an incubator that accelerates 9 start-ups in sales, strategy, commercialization, and financing.  Aaron is also a member of the Entrepreneurship@Cornell student board of directors and leads an initiative to create and launch a university wide mobile application that uses geo-networking technology to connect Cornell’s entrepreneurial, venture capital, and private equity communities, which includes alumni, current students, and faculty.   During the 2010 MBA winter break, Aaron developed an access to venture capital strategy and wrote a white paper on venture investing in bio-pharmaceutical start-ups for Ezra Pharmaceuticals, a start-up that leverages intellectual property from Weill Cornell Medical School.  The work for Ezra was an effort to help the start-up raise $10M for phase II clinical trials.  During the 2011 MBA spring break, Aaron led a team of 7 MBAs in the New Orleans IdeaVillage competition where he and his team created a sales pipeline and gained access to distribution in Asia for a local entrepreneur who sold high-end spa equipment.  This summer, Aaron will be working for a NYC venture capital backed start-up that closed a $10M Series C financing round funded by Bain Capital and Canaan Partners.   Aaron is a MLT Fellow and a Consortium for Graduate Study in Management Fellow.</p>","image":{"available_sizes":[[[96,150],"assets/images/resized/0013/0933/130933v2-max-150x150.jpg"],[[161,250],"assets/images/resized/0013/0933/130933v2-max-250x250.jpg"],[[213,330],"assets/images/resized/0013/0933/130933v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BS","subject":"Computer Science","institution":"Morehouse College","graduated_year":2004,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"Venture Capital","institution":"Cornell University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"COO & Fund Manager","firm":{"name":"BR Ventures","permalink":"br-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,91],"assets/images/resized/0009/9119/99119v2-max-150x150.jpg"],[[250,152],"assets/images/resized/0009/9119/99119v2-max-250x250.jpg"],[[450,274],"assets/images/resized/0009/9119/99119v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Business Analyst ","firm":{"name":"GFI Group","permalink":"gfi-group","type_of_entity":"company","image":{"available_sizes":[[[150,71],"assets/images/resized/0021/7692/217692v1-max-150x150.jpg"],[[190,91],"assets/images/resized/0021/7692/217692v1-max-250x250.jpg"],[[190,91],"assets/images/resized/0021/7692/217692v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}