{"first_name":"Aaron","last_name":"Cohen","permalink":"aaron-cohen","crunchbase_url":"http://www.crunchbase.com/person/aaron-cohen","homepage_url":"http://anyclip.com","birthplace":"Washington, DC","twitter_username":"aaroncohen","blog_url":"http://www.aarondelcohen.com","blog_feed_url":"","affiliation_name":"WikiYou","born_year":1967,"born_month":4,"born_day":11,"tag_list":"","alias_list":null,"created_at":"Wed Jul 25 05:16:20 UTC 2007","updated_at":"Fri Sep 17 15:49:35 UTC 2010","overview":"<p>Aaron Cohen is a co-founder and former CEO of AnyClip.</p>\n\n<p>Aaron Cohen has 12 years of Internet Media experience in consumer Internet as senior executive.   He has completed 13 transactions involving the buying, selling or capitalizing of early-stage Internet media companies.   He has founded or co-founded 4 startups, and served as CEO for two companies as a non-founder.  In the aggregate, Aaron’s companies have generated nearly $100mm for shareholders.</p>\n\n<p>Aaron became the CEO of MenuPages in February of 2008 As CEO, Aaron expanded relationships with MenuPages partners including CitySearch and Tribune Company, and completed a sale of the company to Wasserstein Media’s New York Magazine in July of 2008.</p>\n\n<p>Before MenuPages, Aaron was the CEO of Bolt Media and lead the company for 3 and half years during which he boosted revenue by 100% and repositioned the company as a leading video-based community.  During Aaron’s tenure at Bolt, unique visitors grew from 1mm to 6mm per month.  The company’s advertisers included the leading youth marketers in virtually every advertising category such as Verizon Wireless, Coca Cola, Nike, and Wendy’s. Aaron sold the company to the GOFISH corporation (GOFH), a youth advertising network in August of 2007.</p>\n\n<p>Prior to Bolt, Aaron was the VP of Advertising Sales, VP of Business Development and then CEO of Concrete Media a website development and media company.  In his capacity Aaron lead two companies– Concrete Media and its subsidiary Girls On (sold to Oxygen Media in 2000).  Concrete Media specialized in enabling large corporations to form Internet divisions or corporate carve-outs with their existing assets.   Concrete was a $20mm company and counted an eclectic group of large companies including Tommy Hilfiger, Bechtel Enterprises, McKesson, and the Avon corporations as customers, but fell victim the dotcom implosion of 2001.</p>\n\n<p>Aaron’s career began in 1990 working for Time Inc in Tokyo, Japan.  He lived in Tokyo for three years working in the marketing department for Time’s ESL business.  At that time Aaron helped to devise curriculum material and marketing initiatives for the hot new technology of the period – the CD-rom..</p>\n\n<p>In 1993, Aaron left the corporate sector for 2 years to work as a journalist at States News Service in Washington DC – his hometown.  He covered congress and wrote stories for the St. Petersburg Times, The Denver Post and numerous other publications.  He credits his time at States News with developing the experience to form productive relationships with the media.  Aaron has been quoted in the New York Times, Wall Street Journal, Finanical Times, TechCrunch, PaidContent, NewTeeVee, and BusinessWeek among others.</p>\n\n<p>Aaron has spoken at dozen of events, but he’s most proud of the summits he produced that brought together executives and intellectuals to discuss the future of the Internet industry He’s hosted summits with Fortune Magazine and most recently with McKinsey and Company at their global headquarters in New York City.  In addition, Aaron has contributed articles to several publications including Fast Company and Billboard.</p>\n\n<p>In December of 2008, Aaron began producing his first feature film — The Aaron Cohens.  It’s  a comedic documentary about 100 men named Aaron Cohen and their mothers.  Aaron conceived and will produce The Aaron Cohens a movie that explores issues of Jewish identity and the ability to form communities on the Internet.  Currently, Aaron has 100 friends on Facebook named Aaron Cohen and has met and filmed 16 Aaron Cohens in the United States and Israel.  The film recently was profiled in the New York Observer and has also been featured on National Public Radio.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0005/8014/58014v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0005/8014/58014v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0005/8014/58014v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CTO","firm":{"name":"Appeagle","permalink":"appeagle","type_of_entity":"company","image":{"available_sizes":[[[150,97],"assets/images/resized/0022/0213/220213v2-max-150x150.jpg"],[[250,161],"assets/images/resized/0022/0213/220213v2-max-250x250.jpg"],[[450,291],"assets/images/resized/0022/0213/220213v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"CEO","firm":{"name":"Bolt.com ","permalink":"bolt-com","type_of_entity":"company","image":{"available_sizes":[[[150,91],"assets/images/resized/0002/2593/22593v3-max-150x150.png"],[[250,152],"assets/images/resized/0002/2593/22593v3-max-250x250.png"],[[450,273],"assets/images/resized/0002/2593/22593v3-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"CEO","firm":{"name":"Menupages","permalink":"menupages","type_of_entity":"company","image":{"available_sizes":[[[150,35],"assets/images/resized/0005/5164/55164v1-max-150x150.jpg"],[[250,59],"assets/images/resized/0005/5164/55164v1-max-250x250.jpg"],[[337,80],"assets/images/resized/0005/5164/55164v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Co-founder","firm":{"name":"WikiYou","permalink":"wikiyou","type_of_entity":"company","image":{"available_sizes":[[[150,42],"assets/images/resized/0000/3748/3748v1-max-150x150.png"],[[250,70],"assets/images/resized/0000/3748/3748v1-max-250x250.png"],[[250,70],"assets/images/resized/0000/3748/3748v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"CEO, Co-Founder","firm":{"name":"AnyClip","permalink":"anyclip","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0005/7860/57860v7-max-150x150.png"],[[250,250],"assets/images/resized/0005/7860/57860v7-max-250x250.png"],[[450,450],"assets/images/resized/0005/7860/57860v7-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"CEO","firm":{"name":"Bolt","permalink":"bolt","type_of_entity":"company","image":{"available_sizes":[[[150,111],"assets/images/resized/0014/8910/148910v2-max-150x150.jpg"],[[162,120],"assets/images/resized/0014/8910/148910v2-max-250x250.jpg"],[[162,120],"assets/images/resized/0014/8910/148910v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}