{"first_name":"Aaron","last_name":"Grosky","permalink":"aaron-grosky","crunchbase_url":"http://www.crunchbase.com/person/aaron-grosky","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Control Room","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri May 21 00:35:19 UTC 2010","updated_at":"Thu Jun 10 22:07:40 UTC 2010","overview":"<p>As President of Control Room, Aaron Grosky guides the company’s long-term strategic direction across all aspects of the company’s business, including event production, television production, media architecture design, artist and celebrity relationships, sponsorship development, and creative vision.</p>\n\n<p>Grosky serves as executive producer for all Control Room productions across global event, branded event, and single artist event categories. Responsible for the creative vision, oversight of all production elements, and serving as chief liaison for Control Room constituents from artist, brand, and content partner communities, productions under Grosky’s direction have received high marks in production value, talent procurement, and audience viewership.</p>\n\n<p>In addition to his role at Control Room, Grosky is the Global Producer of Talent and Programming for Live Earth. He is responsible for identifying the creative vision for Live Earth entertainment programming and securing the world’s leading artist and celebrities to make the vision a reality. Leveraging the production and programming expertise of Control Room, Grosky oversees all on-the-ground production and content distribution deals for Live Earth events worldwide. In 2007, he was responsible for securing 150 top artists and identifying the programming strategy for the eight stages around the world, he was a key architect in making Live Earth the largest global entertainment event in history, touching nearly two billion people through the event’s massive media architecture (television, radio, web and mobile broadcasts), pervasive grass roots initiatives, and deep global news media penetration.</p>\n\n<p>Previously, as Executive Vice President of Music Programming and Production for Control Room, Grosky identified and executed the company’s long-term programming strategy and led all Control Room productions. Leveraging long-standing relationships with artists, managers and labels, Grosky identified key opportunities with the world’s leading artists, negotiated broadcast opportunities with management and labels to maximize the offering for a variety of distribution partners, and oversaw all aspects of production to ensure the highest quality end product for both artists and distribution partners.</p>\n\n<p>Prior to his role at Control Room and Live Earth, Grosky spent 10 plus years in the music industry developing an expertise in the burgeoning convergence with technology. He founded Shift Inc., a consumer-facing digital music conversion, training and consulting company, which he sold to Virgin Entertainment Group in 2005. Following the sale, Grosky joined Virgin Entertainment Group as the head of the Digital Division where he served as architect of the company’s digital music service including identifying the programming voice, securing the artist and label relationships, and implementing systems for penetration in the US and Europe.</p>\n\n<p>As a precursor to the founding of Shift Inc., Grosky held a position as chief of creative services for Almo Sounds, working closely with Jerry Moss and Herb Alpert. In addition to his role inside the label leading the company’s entre into the digital space, he served as chief strategic advisor to both partners in their efforts to enhance business units and assets outside of Almo Sounds.</p>\n\n<p>He started his career as a regional sales and marketing rep for Geffen Records and Sony Music in Boston.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President","firm":{"name":"Control Room","permalink":"control-room","type_of_entity":"company","image":{"available_sizes":[[[126,150],"assets/images/resized/0008/7983/87983v2-max-150x150.jpg"],[[150,178],"assets/images/resized/0008/7983/87983v2-max-250x250.jpg"],[[150,178],"assets/images/resized/0008/7983/87983v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}