{"first_name":"Abake","last_name":"Assongba","permalink":"abake-assongba","crunchbase_url":"http://www.crunchbase.com/person/abake-assongba","homepage_url":"","birthplace":"","twitter_username":"AbakeAs","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jul 13 10:07:49 UTC 2012","updated_at":"Sat Jul 14 10:08:12 UTC 2012","overview":"<p>Abake Assongba is a committed humanitarian dedicated to helping the children of Africa lead better lives. There are thousands of children in Africa living at the poverty level and in a constant state of hunger. In areas devastated by war and ravaged with disease, many of Africa’s children are left without parents. Some of these orphans are left to beg on the streets or work as servants just to survive. </p>\n\n<p>Many are also responsible for the care of their younger siblings. Without the ability for an education, these cruel circumstances are often lifelong. In order to rescue children from these unfortunate circumstances, Abake has created the Abake Foundation. The purpose of the foundation is to assist poverty families and children without parents. The foundation is committed to providing an environment that is hopeful, loving and protective of poor people.</p>\n\n<p>The foundation wants poor people to get an education to improve their quality of life. Many times, the foundation has assisted mothers with starting their own businesses or provided scholarships for advanced education. The foundation is a non-profit organization that is committed to helping poor people in Africa.</p>\n\n<p>The Foundation’s Programs</p>\n\n<p>The foundation has three programs: educational, micro-loans and feeding programs. Here is a brief overview of the foundation’s programs:</p>\n\n<p>-Educational program: The educational program has many facets. The foundation distributes school supplies for students who cannot afford them. Distribution takes place in Cotonou and supplies include pencils, pens, notebooks and much more. This relieves parents of the financial pressure to provide supplies. Supplies are also given to college students. </p>\n\n<p>The educational program makes it easy for students to attend classes, and classes are held locally. The foundation also plans to build a factory to produce school supplies. This will also provide more jobs to the citizens of Benin. </p>\n\n<p>-Micro-loan program: The foundation provides entrepreneurs with no-interest loans to start small businesses. There are also no-interest loans for advanced education. </p>\n\n<p>-Feeding programs: The foundation purchases staple foods at whole markets and delivers the food to rural villages. These feeding programs have helped save many lives while reducing disease. </p>\n\n<p>Abake Assongba is a lifesaver for the children in Africa. Through the many efforts of Abake Assongba, many children can now attend school and live healthy lives. </p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/0738/200738v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/0738/200738v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/0738/200738v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}