{"first_name":"Abram","last_name":"Reznikov","permalink":"abram-reznikov","crunchbase_url":"http://www.crunchbase.com/person/abram-reznikov","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Nov 05 15:08:55 UTC 2009","updated_at":"Thu Nov 19 22:16:17 UTC 2009","overview":"<p>Abram Reznikov is an expatriate Russian industrialist active in the fields of metal and plastic recycling and commercial real estate development.</p>\n\n<p>Trained originally as a metallurgist in the former Soviet Union, he worked initially for the State. In the early 1980s, he traveled to Western Europe where his skills were in demand in heavy industry and precious metal refineries.  After concluding work contracts in Germany and Switzerland, he began trading on his own account in the niche business of recovering precious metals from discarded computer mother boards. By the early 1990s, he had already acquired holding interests in multiple companies in Germany, Belgium and the United Kingdom which dealt with large scale recycling of ferrous and non ferrous metals and plastics.</p>\n\n<p>Considered by many to be both commercially and politically astute, Reznikov returned to his home country during the early days of the Russian Federation and secured lucrative government contracts in Russia and the Ukraine. It is thought that during this time, Reznikov accumulated much of the wealth and political associations he is known for today.\n \nAlong with his recycling businesses, Reznikov also buys landfills and industrial sites and develops them into commercial and residential complexes.</p>\n\n<p>Considered a very private individual, he shuns the media, rarely giving interviews.   He does have a reputation as a patron of the arts and opera while living in a relatively low key manner in comparison with other Russian oligarchs.</p>\n\n<p>in 2007, Reznikov bought a controlling interest in two large recycling enterprises in Western Europe, Makinnon Recycling and Alamak Espana Trade SL.</p>\n\n<p>He is married to Tatiana and has three grown children, all living in Western European cities.</p>\n\n<p>He maintains official residences in London , Monte Carlo and St Petersburg, and is know to enjoy sailing and is an avid fan of the Chelsea Football Club.</p>","image":null,"degrees":[],"relationships":[],"investments":[{"funding_round":{"round_code":"seed","source_url":"","source_description":"","raised_amount":2600000,"raised_currency_code":"USD","funded_year":2008,"funded_month":9,"funded_day":null,"company":{"name":"Devtap","permalink":"devtap","image":{"available_sizes":[[[150,71],"assets/images/resized/0006/5050/65050v1-max-150x150.png"],[[174,83],"assets/images/resized/0006/5050/65050v1-max-250x250.png"],[[174,83],"assets/images/resized/0006/5050/65050v1-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}