{"first_name":"Accolade","last_name":"Global","permalink":"accolade-global","crunchbase_url":"http://www.crunchbase.com/person/accolade-global","homepage_url":"http://www.accoladeglobal.com","birthplace":"Wilmington, Delaware","twitter_username":"AccoladeGlobal","blog_url":"http://accoladeglobal.blogspot.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1972,"born_month":1,"born_day":1,"tag_list":"accolade-global","alias_list":null,"created_at":"Thu Jun 07 22:44:00 UTC 2012","updated_at":"Sat Jun 09 20:48:21 UTC 2012","overview":"<p>Accolade Global&#8211;International (formerly Accolade International) was founded in 1972 in Charlestown, Nevis.  Our mission then was purchasing commercial real estate in various countries around the world.  Today we are a private equity and global media consolidation firm, focused on acquiring small-to-medium sized businesses in the following industry groups: online media, residential and commercial construction, logistics and consulting.</p>\n\n<p>In 2009 Accolade Global&#8211;USA purchased Accolade International (the worldwide real estate conglomerate) for 6.2 million U.S. Dollars and merged the two companies to form Accolade Global&#8211;International (which is located in Charlestown, Nevis&#8211;Saint Kitts) and Accolade Global&#8211;USA (which is located in Wilmington, Delaware).</p>\n\n<p>Accolade Global makes its acquisitions and investments employing both a majority investor &#8220;buyout&#8221; approach, as well as a venture capital/minority investment model, particularly in the online media sector.</p>\n\n<p>Over a decade of experience building brands has proven that a strategy based upon 3 key platforms advertising, media planning and buying and internet technology will succeed faster and easier than ever before, especially in these uncertain economic times.</p>","image":{"available_sizes":[[[137,150],"assets/images/resized/0019/4397/194397v2-max-150x150.jpg"],[[169,185],"assets/images/resized/0019/4397/194397v2-max-250x250.jpg"],[[169,185],"assets/images/resized/0019/4397/194397v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}