{"first_name":"Accusol","last_name":"Technologies","permalink":"accusol-technologies","crunchbase_url":"http://www.crunchbase.com/person/accusol-technologies","homepage_url":"http://www.accusol.com","birthplace":"","twitter_username":"","blog_url":"http://www.accusol.com/blog/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1999,"born_month":12,"born_day":25,"tag_list":"erp-software, enterprise-resource-planning-software, erp-software-india, erp-software-in-india, erp-ahmedabad, erp-india","alias_list":null,"created_at":"Wed May 16 10:47:49 UTC 2012","updated_at":"Wed May 23 19:38:51 UTC 2012","overview":"<p>Accusol Technologies is a global enterprise solutions company with a strong background in developing and implementing business softwares for clients across the globe. We take pride in providing a wide range of solutions and services catering to Small and Mid-sized Enterprises across diverse industry sectors.</p>\n\n<p>Our product portfolio includes Enterprise Solutions like ERP, CRM, Payroll, Retail , Point-Of-Sale (POS), Institute systems besides tailor-made solutions for different industry verticals like Manufacturing, Healthcare, Textiles, Food Processing, FMCG and Retail. Our ERP system is capable of integrating the information in an organization. It is automated using an ERP software application. Ultimately, ERP augments the business functions within and outside the boundaries of an organization as the ERP software facilitates the traffic and flow of information. Furthermore, our ERP software aims to augment business processes and raise efficiency. Employing out ERP systems eases compliance with requirements and even industry standards. Procedures can even be codified into the ERP software. In the long run, time-consuming tasks can be reduced through the convenience of ERP systems and software. We also provide a broad range of services from IT Roadmap and Process consulting to system design and implementation to help our clients build and maintain leadership positions in their individual verticals.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0019/0030/190030v2-max-150x150.png"],[[200,200],"assets/images/resized/0019/0030/190030v2-max-250x250.png"],[[200,200],"assets/images/resized/0019/0030/190030v2-max-450x450.png"]],"attribution":"<p>Accusol Technologies</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}