{"first_name":"Acharya","last_name":"Vikrmaditya","permalink":"acharya-vikrmaditya","crunchbase_url":"http://www.crunchbase.com/person/acharya-vikrmaditya","homepage_url":"http://yog-mudra.blogspot.com/","birthplace":"","twitter_username":"yogmudras1gmai","blog_url":"http://yog-mudra.blogspot.com/","blog_feed_url":"http://yog-mudra.blogspot.com/","affiliation_name":"Unaffiliated","born_year":1980,"born_month":3,"born_day":18,"tag_list":"mudras, mudra-for-hypertension, gyan-mudra, yog-mudras, mudra","alias_list":null,"created_at":"Tue Sep 28 07:21:16 UTC 2010","updated_at":"Fri Oct 08 19:00:20 UTC 2010","overview":"<p>Yog Mudras not only has positive effects on physical health, but it is a great way to improve mood and manage psychological stress. People with mild hypertension if practice these healing Mudras daily for two to three months will experience significant decreases in their blood pressure and can decrease the levels of stress hormones. These Yog Mudras in crease the stability of mind and mental activities are also controlled.</p>\n\n<p>Technique: (1)\nSit in comfortable asan with head and spine straight.\nClose the Right Nostril and inhale slowly and deeply through left nostril.\nAt the end close both nostril and retain the breath in stomach for few seconds.\nExhale slowly through right nostril by keeping left nostril closed. \nThis is one round.\nRepeat 5-6 times.</p>\n\n<p>Benefits:\nControls effetely high Blood Pressure.\nGood for Heart and mental peace.\nBest for Pith Dosh.\nHelp in controlling migraine.</p>\n\n<p>Precaution:\nNever practise after meal.\nInhale and exhale very slowly. </p>\n\n<p>Technique: (2)\n• Sit in any comfortable posture with head and spine straight and left hand in Gyan Mudra.\n• Hold your right hand up and Close the left nostril with your ring and little finger and inhale through the right nostril. The breath should be slow, steady and full.\n• Now close the right nostril by pressing gently against it with your thumb, and open your left nostril by relaxing your ring and little finger and exhale fully with a slow and steady breath.\n• Inhale though the left nostril, close it, and then exhale through the right nostril.\n(That&#8217;s one complete round—Inhale though the right nostril, Exhale through the left, Inhale through the left, Exhale through the right)\nBegin with 5-10 rounds and add more as you feel comfortable. Remember to keep your breathing slow, easy and full, without restraining the breath.</p>\n\n<p>Mudra for Hypertension</p>\n\n<p>As shown in figure this mudra is formed by crossing the hands in a way that the fingers of one hand should over lap each other with the fingers of other hand and thumb of one hand should touch the base of fore finger of other hand and the fore finger of right hand should be straight and the thumb of left should also be free.</p>\n\n<p>Practise this mudra daily for 45 min.</p>\n\n<p>Benefits:\nPractise of this mudra for hypertension helps in controlling the high Blood Pressure.\nThis Mudra increases the stability of mind and mental activities are also controlled.\nBest for controlling the imbalance of Vat Dosh.\nAlong with this mudra practise Gyan Mudra daily for around 45 Min.</p>\n\n<p>Gyan Mudra\n Simply by touching the tip of index finger with the tip of Thumb this Gyan Mudra is formed. This mudra\ncan be even performed while walking, sitting or doing any other work. Try to practice the Gyan Mudra as much as you can. \nPractise of this Gyan Mudra will control the high BP and prolong practise will increase the level of confidence and inner bliss.</p>\n\n<p>Water Therapy :\nNow even the modern doctor says that essential hypertension should primarily be treated with an increase in daily water intake. When we do not drink enough water to serve all the needs of the body, some cells become dehydrated and lose some of their water to the circulation. So Fill up a Big Jug of water and keep it on your desk so that you are reminded to drink it.\n• Drink at least 10-12 glasses of water daily.\n• Early morning, after you get up from bed, drink 1 liter of water i.e., 2 to 3 glasses.\n• Try to avoid drinking of water during the meal. </p>\n\n<p>Laughter Therapy :\nAll of us should laugh at least for three times a day. Each person should consider laughing a key to health and free from tension, restraints and worries. Our body, mind, brain and entire nervous system attains to the perfect natural situation and thus, deficiencies as also ailments all are removed. The persons maintain humorous atmosphere around them throughout the day simultaneous to routine and sometimes, laugh loudly; keep themselves free from the diseases and their mind, brain, the entire nervous system receive innovative smartness and the energy every moment. </p>\n\n<p>Healthy Tips:\nFollowing a healthy lifestyle is the best and safest way to control blood pressure. Such lifestyle practices are natural, pose little health risk and are cost-free.</p>\n\n<p>• Try to have fruits and vegetables that are rich in potassium, magnesium, and calcium like potatoes, tomatoes, bananas, dried apricots, orange, nuts, seeds, dried beans and peas\n• Reduce the salt in your diet Avoid adding salt at the table.\n• Also try to control Caffeine and sugar both can increase the amount of potassium that is excreted by the kidney. \n• Try to avoid canned food.\n• To remain healthy, stay happy. Those who take stress all the time tend to develop health problems fast. Happiness is very essential for remaining fit. Laugh out louder daily and release all the tensions.\n• Regular exercise for at least 30 to 45 min. daily will help to your blood pressure.\n• Control your Weight. \n• Remember old saying you are what you eat, so your meal can certainly effect your BP. Eat healthy diet.\n• Most important try to control your weight.\n• Totally avoid alcohol, caffeine and tobacco. To start with, reduce the numbers of cigarettes you smoke each day.\n• Most important is reduce stress level, for this first try to identify your stressors, then try to reduce them or at least try to cope them with a healthier way.\n• Exercise daily Yoga Asan and Pranayam to maintain a healthful body weight and improve muscle tone.\n• Try to put two drops of Almond Oil or Pure Cow Ghee in the both nostrils twice a week.\n• Try to maintain balance between mental and physical stress and work.\n• Maintain regular sleep patterns. Go to sleep and wake up at the same time each day. </p>\n\n<p>These are not the changes which you can’t incorporate in your life. These healthy changes will offer significant rewards in your life. When your blood pressure in under control your risk of life threatening complications will decrease and you may live a happier and longer life.</p>\n\n<p>For more information on Mudras, Gyan Mudra Or Mudra For Hypertension and many more mudras for curing other diseases please visit www.mudrasforhealing.com.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0010/3385/103385v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0010/3385/103385v2-max-250x250.jpg"],[[450,450],"assets/images/resized/0010/3385/103385v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}