{"first_name":"Acharya","last_name":"Vikrmaditya","permalink":"acharya-vikrmaditya-2","crunchbase_url":"http://www.crunchbase.com/person/acharya-vikrmaditya-2","homepage_url":"http://mudra-low-bp.blogspot.com/","birthplace":"","twitter_username":"yogmudras1gmai","blog_url":"http://mudra-low-bp.blogspot.com/","blog_feed_url":"http://mudra-low-bp.blogspot.com/feeds/posts/default","affiliation_name":"Unaffiliated","born_year":1980,"born_month":3,"born_day":18,"tag_list":"mudras, mudra-for-hypotension, yog-mudras, mudra","alias_list":null,"created_at":"Wed Sep 29 09:42:23 UTC 2010","updated_at":"Fri Oct 08 01:21:47 UTC 2010","overview":"<p>Mudra for Hypotension</p>\n\n<p>To form this mudra as shown in figure from top fold the fingers of one hand in such a way that they grip the fingers of other hand keeping the thumb and fore finger of one hand free. Keep in mind the thumb of right hand should touch the middle finger of left hand.</p>\n\n<p>Practise this mudra daily 45 min.</p>\n\n<p>Benefits:\nPractise of this mudra helps in controlling the low Blood Pressure.\nThis mudra for Hypotension helps in balancing the elements like water, earth and ether.</p>\n\n<p>Deep breathing is a great, positive aid to self-culture and helps in retaining health, youth and longevity. The habit of conscious deep breathing gives a good exercise to the respiratory organs and ensures a free circulation of blood.</p>\n\n<p>If mental strain increases the breathing rate is affected. Through Pranayama the breathing is controlled and the rate can be reduced, which reduces the strain on heart and also the rate. Special breathing techniques affect the functioning of nervous system, and controls the low BP. These techniques increase the stability of mind and mental activities are also controlled.</p>\n\n<p>Technique:\nSit in comfortable asan with head and spine straight.\nClose the left Nostril and inhale slowly and deeply through Right nostril.\nAt the end close both nostril and retain the breath in stomach for few seconds.\nPractise Moolband and Jallunder Band for few seconds.\nNow raise the neck and Exhale slowly through left nostril by keeping right nostril closed. \nThis is one round.\nRepeat 5-6 times.</p>\n\n<p>Benefits:\nControls effetely low Blood Pressure.\nGood for Heart and mental peace.\nBest for Vath Dosh.\nPrecaution:\nNever practise after meal.\nInhale and exhale very slowly. </p>\n\n<p>Healthy Tips:\nFollowing a healthy lifestyle is the best and safest way to control low blood pressure. Such lifestyle practices are natural, pose little health risk and are cost-free.</p>\n\n<p>• To remain healthy, stay happy. Those who take stress all the time tend to develop health problems fast. Happiness is very essential for remaining fit. Laugh out louder daily and release all the tensions.\n• Regular exercise for at least 30 to 45 min. daily will help to your blood pressure.\n• Control your Weight. \n• Remember old saying you are what you eat, so your meal can certainly affect your BP. Eat healthy diet. Reduce sodium i.e. salt intake in your diet.\n• Drink at least 10-12 glasses of water daily.\n• Totally avoid alcohol, caffeine and tobacco.\n• Most important is reduce stress level, for this first try to identify your stressors, then try to reduce them or at least try to cope them with a healthier way.</p>\n\n<p>For more information on Mudras, Yog Mudras Or Mudra for Hypotension and many more mudras for curing other diseases please visit www.mudrasforhealing.com.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0010/3548/103548v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0010/3548/103548v2-max-250x250.jpg"],[[450,450],"assets/images/resized/0010/3548/103548v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}