{"first_name":"Adam","last_name":"Bosworth","permalink":"adam-bosworth","crunchbase_url":"http://www.crunchbase.com/person/adam-bosworth","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Mar 15 21:35:00 UTC 2009","updated_at":"Sat Jun 18 03:47:35 UTC 2011","overview":"<p>Adam Bosworth is a technology leader and innovator who was instrumental in building numerous technology products, including Google Health, Microsoft Access, Microsoft Internet Explorer and BEA WebLogic Integration and Workshop.</p>\n\n<p>After facing serious family challenges with the health care system, Adam decided to transition from 25 years of building databases and software to apply this knowledge and pursue his passion for helping people become healthy and well. He founded Keas in 2008 to bring together the latest technology, medical information and wellness programs to inspire, motivate and reward consumers to better manage their own health care and live healthier lives.</p>\n\n<p>Prior to starting Keas, Adam, was vice president of engineering at Google, Inc., and was instrumental in the development of Google Calendar and Spreadsheets. He then headed Google Health, a personal health information centralization service. Previously, he was senior vice president of engineering and chief software architect at BEA Systems. Prior to joining BEA, Adam co-founded Crossgain, a software development firm acquired by BEA in 2001. Known as one of the pioneers of XML technology, Adam also held various senior management positions at Microsoft where he was responsible for creating the Microsoft Access PC database and led the team that developed Internet Explorer 4.0’s HTML engine. Prior to Microsoft, Adam worked for Borland where he developed the Quattro spreadsheet application following Borland&#8217;s acquisition of Analytica, Adam’s first company, which built a product called Reflex.</p>\n\n<p>Adam’s long, successful career in technology began during college, where his strong math skills and great interest in architecture lead him to summer jobs at various computer companies in New York. He attributes his unique ability to find simple solutions to complex problems to being dyslexic and having to learn, at a very early age, to read in patterns and create cognitive pictures to understand and process information. He believes this type of visualization allows him solve challenging problems others do not think can be solved.</p>\n\n<p>Adam received a bachelor’s degree in history from Harvard University.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0013/9838/139838v1-max-150x150.jpg"],[[250,154],"assets/images/resized/0013/9838/139838v1-max-250x250.jpg"],[[450,278],"assets/images/resized/0013/9838/139838v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder, CTO","firm":{"name":"Keas","permalink":"keas","type_of_entity":"company","image":{"available_sizes":[[[150,148],"assets/images/resized/0003/8161/38161v7-max-150x150.png"],[[176,174],"assets/images/resized/0003/8161/38161v7-max-250x250.png"],[[176,174],"assets/images/resized/0003/8161/38161v7-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}