{"first_name":"Adam","last_name":"Metz","permalink":"adam-metz","crunchbase_url":"http://www.crunchbase.com/person/adam-metz","homepage_url":"http://adammetz.com","birthplace":"","twitter_username":"theMetz","blog_url":"http://adammetz.com/metzmash","blog_feed_url":"http://feeds.feedburner.com/Metzmash","affiliation_name":"Metz Consulting","born_year":null,"born_month":null,"born_day":null,"tag_list":"social-web-strategy, management-consulting, social-crm, consumer-brand","alias_list":null,"created_at":"Fri Dec 04 01:38:00 UTC 2009","updated_at":"Sat Oct 23 00:40:55 UTC 2010","overview":"<p>Adam Metz is the premier consumer and lifestyle brand social web strategy consultant in the U.S. and is the first social web strategist to develop a holistic social media analytics model.</p>\n\n<p>Metz’s strategic methodology merges classic management consulting with top-tier social technology research, combining ‘70s and ‘80s consulting standards like Flawless Consulting and The Fifth Discipline, with best practices as recommended by tech analyst firms like Forrester and Gartner.</p>\n\n<p>Metz has consulted with over 50 consumer and tech brands, including Hershey’s Chocolate, Waggin’ Train Pet Food, Pirate’s Booty, MBT Shoes, Obama Girl (Barely Political), Passport Hotels, Hollywood Park Racetrack, The San Francisco Convention &amp; Visitor’s Bureau, Sonoma County, Mighty Leaf Tea, Timbuk2 and dozens of others.</p>\n\n<p>In 2008, he authored the eBook There Is No Secret Sauce, which has sold and downloaded over 2000 copies. The book is available for sale or download on social networks like Facebook and MySpace, as well as in stores and over Amazon and conventional digital booksellers.</p>\n\n<p>In June 2008, Metz founded the strategic consulting firm METZ, which now employs two strategy associates.</p>\n\n<p>Metz has lectured at UC-Berkeley, the University of Washington and UC-Santa Cruz and has given keynote talks at numerous conferences and associations including the San Francisco Chamber of Commerce, the Western Association of Convention &amp; Visitors Bureau Technology Conference, the Tri-Valley Convention &amp; Visitor’s Bureau Annual Marketing Conference, and the Hospitality Sales &amp; Marketing Association. He has also participated in dozens of technology conference panels on social web strategy and consumer and lifestyle brand strategy.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0006/8506/68506v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0006/8506/68506v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0006/8506/68506v2-max-450x450.jpg"]],"attribution":"<p>Adam Metz / <a href=\"http://adammetz.com\" title=\"Metz Consulting\" rel=\"nofollow\">Metz Consulting</a></p>"},"degrees":[{"degree_type":"BA","subject":"News-Editorial Journalism","institution":"University of Wisconsin-Madison","graduated_year":1999,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Principal","firm":{"name":"Metz Consulting","permalink":"metz-consulting","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/adammetz","title":"LinkedIn"}]}