{"first_name":"Adam","last_name":"Fridman","permalink":"adam-fridman","crunchbase_url":"http://www.crunchbase.com/person/adam-fridman","homepage_url":"http://www.idea2result.com","birthplace":"","twitter_username":"idea2result","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"lead-generation-services, inside-sales, outside-sales, telemarketing-services, call-center-services","alias_list":null,"created_at":"Tue Dec 21 21:27:27 UTC 2010","updated_at":"Wed Dec 22 00:58:03 UTC 2010","overview":"<p>View Edit Outline Track\nAppointment Setting Company - We are your premier outsourced, cost effective, business savvy appointment setting and sales agent staffing service that increases your sales campaign&#8217;s effectiveness and puts a smile on your face at the end of each day. Our Company has been around since 2003 to address various business development needs.</p>\n\n<p>We are a collegial team of highly ambitious, motivated, competent and educated Appointment Setters. We are excited at the mere prospect of generating appointments and increasing top line for our new and existing clients. We continually seek your feedback and we are here to make your dreams a reality. From small entrepreneurial start ups to well established mid size corporations and franchisors, we deliver 100% effort behind each sales campaign and stand behind our promise to achieve the greatest feasible results.</p>\n\n<p>Our Appointment Setters become an integral part of your sales force with a vested interest in delivering results for your business. Your prospects become our prospects and we possess the critical thinking, practical judgment, integrity, professionalism, perseverance, mental toughness and initiative needed to generate quality appointments. Also when requested, we will go the distance and assist in closing the sale.</p>\n\n<p>Our Appointment Setters are highly experienced individuals with excellent verbal and written communications skills and a demonstrated ability to communicate and relate to all levels within a perspective client’s organization. Our Appointment Setters are capable to work with or without a script in order to develop beneficial relationships with your prospects and generate sales quality appointments with the ultimate goal of saving you time and money. Our Appointment Setters genuinely care about the success of your business and frequently provide suggestions in order to increase your campaigns effectiveness.</p>\n\n<p>At the helm of I2R, is a highly experienced and successful entrepreneur Adam Fridman. Adam founded I2R after spending over 10 years starting, consulting, managing, and funding numerous entrepreneurial ventures across multiple sectors and industries.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}