{"first_name":"Adams","last_name":"Benitez","permalink":"adams-benitez-2","crunchbase_url":"http://www.crunchbase.com/person/adams-benitez-2","homepage_url":"http://www.myfreelancedesign.com/","birthplace":"Kolkata","twitter_username":"MyfreelancePaul","blog_url":"http://web-design-blog-paul-bank.blogspot.com/","blog_feed_url":"http://web-design-blog-paul-bank.blogspot.com/feeds/posts/default","affiliation_name":"Infoway LLC","born_year":1979,"born_month":1,"born_day":9,"tag_list":"template-shop, freelance-graphic-designer, website-designer-","alias_list":null,"created_at":"Mon Nov 08 12:54:07 UTC 2010","updated_at":"Fri Nov 12 00:50:19 UTC 2010","overview":"<p>Paul Design Template shop</p>\n\n<p>Myfreelancedesign.com is one of the fastest growing and popular template shops. It is another milestone venture of Mr. Paul Bank, experienced freelance graphic designer based in Kolkata India. It is a template shop that covers all sorts of templates; ranging from typical open source templates as Joomla, Drupal, Wordpress to excellent web 2.0 based layouts of different thoughts and perspectives.</p>\n\n<p>Paul design template shop has a huge range of categories that almost covers all the business, amateur or the individual needs. The layouts are suitable for simple website to complex ecommerce based sites. Mr. Paul always tries to present layouts that are designed on the basis of customer perspectives. He does extensive market research on the market trends during designing of the layouts.</p>\n\n<p>He believes that online presence is must for everybody. But it is fact that the popular template shops in the market are offering templates at a price that goes far beyond the affordability of small businesses. Keeping this situation in mind, he has kept the price of the templates as low as $15. And he provides the source files that are easily customizable.</p>\n\n<p>Besides selling templates, Mr. Paul is always with you to help in any type of web design and development related requirements. Be it designing a logo, banner, brochure, business card or power point presentation, Mr. Paul will satisfy with exceptional designs. Even if you are looking for PHP related development you may ask for his cooperation. That is why you will find that all his templates are programming friendly. And buying any template from myfreelancedesign.com frees you from all the tensions related to SEO compatibility. The templates are made to fit all the requirements that give a great start to your online business.</p>\n\n<p>Myfreelancedesign.com also has some templates that are for free downloading. It is a great opportunity to every individual or the business owners who want to give online business or presence a try. So if anybody has a hidden desire to build a website that you want not only to look beautiful but also great in terms of functionality, Paul design template shop is the ultimate destination. </p>","image":{"available_sizes":[[[150,37],"assets/images/resized/0010/9126/109126v2-max-150x150.jpg"],[[196,49],"assets/images/resized/0010/9126/109126v2-max-250x250.jpg"],[[196,49],"assets/images/resized/0010/9126/109126v2-max-450x450.jpg"]],"attribution":"<p>Freelance graphic design</p>"},"degrees":[],"relationships":[{"is_past":true,"title":"Web development Company","firm":{"name":"Infoway LLC","permalink":"infoway-llc","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/MyfreelancePaul","title":""}]}