{"first_name":"Adam","last_name":"Koopersmith","permalink":"adam-c-koopersmith","crunchbase_url":"http://www.crunchbase.com/person/adam-c-koopersmith","homepage_url":"http://www.newworldvc.com","birthplace":"","twitter_username":"akoopersmith","blog_url":"","blog_feed_url":"","affiliation_name":"New World Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Nov 23 14:37:58 UTC 2008","updated_at":"Mon Jul 09 22:18:20 UTC 2012","overview":"<p>Prior to joining New World Ventures in 2004, Adam held various operating and business development roles as VP of Business Development at Sportvision, Inc. (a New World Ventures portfolio company) helping the company grow from the &#8220;business plan&#8221; stage to eight figures in annual revenue. Prior to Sportvision, Adam worked at Berkshire Partners, a leading private equity investment firm with $11.0 billion of capital under management. His experience at Berkshire included investment evaluations and closed transactions in several industries, including business services, retail and manufacturing, in addition to significant work helping portfolio companies achieve their strategic objectives. Before joining Berkshire, Adam worked as an investment banker for Alex Brown (now Deutsche Bank) and participated in a broad range of merger and acquisition and public equity transactions for mid-sized companies.</p>\n\n<p>Adam currently serves on the boards of Advantage Optics, Alliance Health Networks, Firm58, HyperQuest, Kontiki, and Sittercity, and works closely with Alltuition, Pindrop Security and Retrofit.  Adam also serves on the Investment Committee for the Illinois Innovation Accelerator Fund (i2A) a seed-stage investment fund and on the Board of Excelerate Labs. Adam received his B.S. in economics with concentrations in finance and international management from the Wharton School at the University of Pennsylvania and his M.B.A. from the Kellogg School of Management with concentrations in organizational behavior and decision sciences.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"New World Ventures","permalink":"new-world-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,75],"assets/images/resized/0002/9260/29260v3-max-150x150.jpg"],[[250,125],"assets/images/resized/0002/9260/29260v3-max-250x250.jpg"],[[450,225],"assets/images/resized/0002/9260/29260v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}