{"first_name":"Adam","last_name":"Peterson","permalink":"adam-peterson-3","crunchbase_url":"http://www.crunchbase.com/person/adam-peterson-3","homepage_url":"http://www.desss.com","birthplace":"Houston","twitter_username":"desssinc","blog_url":"http://www.desss.com/blog","blog_feed_url":"http://desss.com/blog/?feed=rss2","affiliation_name":"Unaffiliated","born_year":1983,"born_month":1,"born_day":1,"tag_list":"desss, web-development-houston, mobile-application-development-houston, iphone-application-development, ipad-application-development, andriod-application-development","alias_list":null,"created_at":"Tue Nov 22 09:31:37 UTC 2011","updated_at":"Tue Dec 27 08:17:18 UTC 2011","overview":"<p>We are the leaders in outsourcing services in Houston, Austin, San Antonio and Dallas services in Web Development, Outsourcing Services, Mobile Application Development Services, Translation Services and Medical Transcription.</p>\n\n<p>DESSS is a Software Development, Application Development, Web Design, Web Development, Outsourcing Services, Search Engine Optimization, Search Engine Marketing, Translation, Medical Billing, Medical Coding, Litigation Coding and Medical Transcription Company based in Houston, and serving in Austin, Dallas, and San Antonio in TX. Our Houston developers use the latest software technology in application development to cater for the client’s requirements to the fullest extent. </p>\n\n<p>We are in the web design service industry; the aim of developing a website is to get more Business for our clients. Look out for those companies, which have engaging and attractive titles that will bind the attention of the website visitors. Our Web design Service gives a look that the client doesn&#8217;t feel bored reading the information.</p>\n\n<p>We do IT(Information Technology) development service worldwide, we work on website even off site operations too. Our services give the user friendly application software to our customers. We use latest Technologies to develop the web application.</p>\n\n<p>We are the best Business Process Outsourcing service company in Houston, Austin, San Antonio and Dallas. We deliver the data around shot span of time. We are working 24/7 support, hence our service will be flexible to our customers worldwide.</p>\n\n<p>Our service bulletin links to software Development, web Design, Search Engine Optimization, Search Engine Marketing, Application Development, Litigation Coding, Medical Transcription, Medical Billing, and Data Processing.</p>\n\n<p>Our Houston developers make through study of the requirements scenario before proceeding to develop client-specific web application solutions.</p>\n\n<p>Our Technical Experts:</p>\n\n<pre><code>1. Migration of applications to ASP.net\n2. Performance tuning\n3. ASP.net architecture and design evaluation\n4. ASP.net custom control development\n5. ASP.net desktop and Web application development\n6. ASP.net software product development\n7. Web services ASP.net application development\n</code></pre>\n\n<p>Our development team delivers comprehensive solutions utilizing the full range of ASP.net application development. We work with your business to understand your requirements and utilize the capabilities of Microsoft .net framework to develop the system to your need. We have a team of experienced Microsoft certified software architects, developers, and consultants as part of our ASP.net competency team. We also provide consulting in developing custom enterprise applications based on asp.net framework.</p>\n\n<p>We are in the name of DESSS, Inc and top 10 rankings in Google with several IT and BPO related keywords and expertise in Search Engine Optimization, Web Development, Web Design and Data Processing. Contact us any time at info@desss.com.</p>\n\n<p>DESSS Inc,\n2825, Wilcrest Dr. Suite 540 \nHouston, Texas – 77042.</p>\n\n<p>Phone: (713)589-6496\nFax: (832)201-7519\nEmail: info@desss.com\nWeb: www.desss.com</p>","image":{"available_sizes":[[[122,130],"assets/images/resized/0016/3460/163460v2-max-150x150.png"],[[122,130],"assets/images/resized/0016/3460/163460v2-max-250x250.png"],[[122,130],"assets/images/resized/0016/3460/163460v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.desss.com/it-services/mobile-application-development-houston.html","title":"Mobile Application Development Houston"},{"external_url":"http://www.desss.com/it-services/android-app-development-houston.html","title":"Android Application Development Houston"},{"external_url":"http://www.desss.com/it-services/blackberry-application-development-houston.html","title":"Blackberry Application Development Houston"}]}