{"first_name":"Adam","last_name":"Lashinsky","permalink":"adam-lashinsky","crunchbase_url":"http://www.crunchbase.com/person/adam-lashinsky","homepage_url":"","birthplace":"","twitter_username":"adamlashinsky","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Thu Jul 23 00:31:13 UTC 2009","updated_at":"Thu Jan 19 23:25:05 UTC 2012","overview":"<p>Adam Lashinsky covers Silicon Valley and Wall Street for FORTUNE and is the author of Inside Apple: How America’s Most Admired – and Secretive – Company Really Works (Hachette Book Group/Grand Central Publishing). He has been on the magazine’s staff since 2001, and for two years before that was a contributing columnist. In addition, Lashinsky is a contributor to the Fox News Channel, appearing weekly on the network’s “Cavuto on Business” program on Saturday mornings; co-chair of FORTUNE’s annual Brainstorm Tech conference; and a seasoned speaker and panel moderator.\nLashinsky’s cover-story subjects in FORTUNE have included Apple, Hewlett-Packard and Google. He also has written in-depth articles on Wells Fargo, Intel, Oracle, eBay, Twitter, and the venture-capital industry, as well as on topics ranging from San Francisco politics and oil-exploration technology to the post-Katrina economic recovery of New Orleans. \nPrior to joining FORTUNE, Lashinsky was a columnist for The San Jose Mercury News and TheStreet.com.  Before moving to California, he was a reporter and editor for Crain&#8217;s Chicago Business. As a Henry Luce Scholar, he worked for a year in Tokyo as a reporter for the Nikkei Weekly, the English-language version of Japan&#8217;s main economic daily. He began his career in the Washington, D.C., bureau of Crain Communications. </p>\n\n<p>A native of Chicago, Lashinsky earned a degree in history and political science from the University of Illinois at Urbana-Champaign. He lives in San Francisco with his wife and daughter. </p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0005/3907/53907v1-max-150x150.jpg"],[[180,240],"assets/images/resized/0005/3907/53907v1-max-250x250.jpg"],[[180,240],"assets/images/resized/0005/3907/53907v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}