{"first_name":"Adam","last_name":"Willhoeft","permalink":"adam-willhoeft","crunchbase_url":"http://www.crunchbase.com/person/adam-willhoeft","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"1UP Media","born_year":null,"born_month":null,"born_day":null,"tag_list":"adam-willhoeft, digital-strategist, digital-media-strategist, digital-media-marketing-consultant, social-media-consultant, online-reputation-consultant, online-marketing-consultant, digital-marketing-director","alias_list":null,"created_at":"Tue Feb 19 00:54:00 UTC 2008","updated_at":"Mon Apr 23 21:15:09 UTC 2012","overview":"<p>Adam Willhoeft is a digital media marketing consultant, social media strategist and an online reputation specialist. He works with C-level executives to plan, design, build and manage successful digital strategies. His outside-the-box approach delivers innovation and results to the clients he works for.</p>\n\n<p>Skills and Experience Summary (2012)</p>\n\n<p>• 7 yrs. experience, with specific to digital/social media strategies and digital media buying\n• 4 yrs. experience in a project manager role\n• Bought and optimized over $25,000,000+ in ad inventory for online campaigns \n• Managed annual advertising budgets over $12,000,000+\n• Performance Driven – it all comes down to ROI \n• Strong ability to influence key stakeholders and related decisions\n• Ability to lead, work autonomously and collaboratively in a fast-paced team environment delivering top quality results with a positive demeanor\n• Strong history in managing client relationships and expectations\n• Adapts to change quickly</p>\n\n<p>Project Management</p>\n\n<p>• Proficient in the direct management of cross-functional production teams\no   Managed a team of 8 (media buyers, designers, developers, and network engineers)\no   Managed up to 15 agencies/networks at one time to deliver against the same goal\n• Managed complex multi-disciplinary project teams through all phases of the project life cycle, providing leadership, coaching, and training to achieve aggressive targets\no   Evaluated deliverables to ensure the work met requirements and maintained a high level of quality\n• Fluent with the use of project management tools and methodologies.\no   Advanced skills in Microsoft Project, Microsoft Office, and Visio\n• Ability to think “outside the box” and contribute to the improvement of internal processes\n• Managed digital marketing budgets using ROI reporting/forecasting through monitoring, data and statistical analysis\no   Tracked and analyzed the performance of digital marketing campaigns in order to recommend ways to optimize programs that deliver value and surpass objectives.\n• Strong analytical and problem solving skills </p>\n\n<p>Digital Media Buying  (Web|Mobile|Social|Video|Email)</p>\n\n<p>• Google Adwords certified\n• I’ve personally bought and optimized over $25,000,000+ in online ad inventory for campaigns\no   P&amp;L accountability and competitive against KPI’s\no   Optimized and analyzed results of purchased media in order to maximize revenue opportunities, and reach campaign objectives\n Conducted A/B and multivariate testing to optimize landing pages\n• Expertise in performance branding and digital strategies in national and international markets\no   Developed online brand strategies and ensured consistent messaging across all customer/consumer touch points\n• Acquired web and mobile inventory in RTB from all the major DSPs and ad exchanges with the help of DMPs on a CPA, CPC and CPM basis\no   Ability to manage complex negotiations to successful closure and delivery\no   Handled the tasks of generating insertion orders, sending out creative, and confirming ad space and tracked the delivery of all purchased media\no   Increased client cookie pools up to 100x\n• Experience with ad serving platforms (Mediaplex, Zedo, Doubleclick, Sitescout, ADTech, Atlas)*\n• Relationships with all the media representatives within all the top advertising and mobile networks\n• High proficiency in Excel for reporting and analysis \n• Analyzed user behavior using web analytics tools (Google Analytics, Clicktale, Omniture, Prosper202)</p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0008/9177/89177v2-max-150x150.jpg"],[[80,80],"assets/images/resized/0008/9177/89177v2-max-250x250.jpg"],[[80,80],"assets/images/resized/0008/9177/89177v2-max-450x450.jpg"]],"attribution":"<p>adam willhoeft</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"1UP Media","permalink":"my-domain-idea","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"<object width=\"500\" height=\"405\"><param name=\"movie\" value=\"http://www.youtube.com/v/IM41rLMf6Lc&hl=en_US&fs=1&color1=0x006699&color2=0x54abd6&border=1\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://www.youtube.com/v/IM41rLMf6Lc&hl=en_US&fs=1&color1=0x006699&color2=0x54abd6&border=1\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"500\" height=\"405\"></embed></object>","description":"<p>Adam Willhoeft&#8217;s Profiles - Web Consultant - Media Buyer, SEM, PPC, SEO in Toronto</p>"}],"external_links":[],"web_presences":[]}