{"first_name":"Adam","last_name":"Benjamin","permalink":"adam-benjamin","crunchbase_url":"http://www.crunchbase.com/person/adam-benjamin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Vitrue","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Oct 14 20:27:26 UTC 2008","updated_at":"Tue Oct 21 01:00:35 UTC 2008","overview":"<p>Adam Benjamin joined Vitrue, upon the company&#8217;s merger with UGENmedia, as Chief Strategy Officer. Benjamin brings 15 years of global online multi-business experience. Benjamin co-founded UGENmedia in 2006, an opportunity for him to channel his online marketing expertise into a business that would deliver a new social media experience to its clients.</p>\n\n<p>Prior to founding UGENmedia, Benjamin was the Vice President and General Manager of the Email Solutions division for DoubleClick Inc., and was instrumental in growing the business to over $40 million in annual revenue. He joined DoubleClick in 1997 and built the customer support and sales engineering division from 10 to 130 people, expanding and opening offices in New York, Colorado, Dublin and Sydney. During his tenure at DoubleClick, Benjamin served as the Vice President of several technology divisions including Email Solutions, Tech Solutions Search and Tech Solutions Adserving.</p>\n\n<p>Prior to DoubleClick, Benjamin worked for Reuters of America in their Global Accounts division where he designed Internet-based research and trading applications for JP Morgan, Morgan Stanley and Merrill Lynch. He also worked for Prodigy Internet where he oversaw the development and daily operations of over 350 content properties.</p>\n\n<p>Benjamin started his professional career as a founding member of HeartBeat Corporation, a multimedia software company that partnered and co-developed hardware and software with Sega of America and Electronic Arts.</p>\n\n<p>Adam holds a Bachelor of Science degree in business from Providence College. </p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Chief Strategy Officer","firm":{"name":"Vitrue","permalink":"vitrue","type_of_entity":"company","image":{"available_sizes":[[[142,92],"assets/images/resized/0000/1795/1795v1-max-150x150.jpg"],[[142,92],"assets/images/resized/0000/1795/1795v1-max-250x250.jpg"],[[142,92],"assets/images/resized/0000/1795/1795v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}