{"first_name":"Adam","last_name":"Bernholz","permalink":"adam-bernholz","crunchbase_url":"http://www.crunchbase.com/person/adam-bernholz","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Nov 19 13:15:16 UTC 2012","updated_at":"Mon Nov 19 13:15:36 UTC 2012","overview":"<p>Adam Bernholz is a JD/MBA, LEED AP, and is the Founder, Chairman, and CEO of GreenWizard, based in Mt. Pleasant, SC. GreenWizard is the first data-driven analytical tool for the research, evaluation, and documentation of sustainable building products.</p>\n\n<p>Adam grew up in North Carolina with a deep love of our natural environment. After completing a BA at Emory in Philosophy and Liberal Studies, Adam worked at ClubMed as a Scuba instructor, before returning to the U.S. to complete a JD/MBA at UNC in 1995. Subsequent to passing the NC Bar, Adam worked in venture capital for several years at SABi Venture Capital, where he actively participated in the mechanics of private venture investment. In 1998 he left to form The Service Source, a B2B sales and marketing company dedicated to small business services. Over three years, Adam took the company from inception to profitability, raised outside equity investment, and sold the company in 2001.</p>\n\n<p>In 2003, Adam moved to Goat Island, SC where he began work on an environmentally sensitive real estate development project. In the course of his work on sustainable construction methods, certifications, and green building products, Adam realized the need for the cloud-based workflow solution that is today GreenWizard.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder and CEO","firm":{"name":"GreenWizard","permalink":"greenwizard","type_of_entity":"company","image":{"available_sizes":[[[150,57],"assets/images/resized/0008/4791/84791v1-max-150x150.png"],[[250,96],"assets/images/resized/0008/4791/84791v1-max-250x250.png"],[[339,131],"assets/images/resized/0008/4791/84791v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}