{"first_name":"Adam","last_name":"Paul","permalink":"adam-paul","crunchbase_url":"http://www.crunchbase.com/person/adam-paul","homepage_url":"http://www.2ddraftingindia.com","birthplace":"","twitter_username":"","blog_url":"http://2ddesigndraftingservices.blogspot.in/","blog_feed_url":"http://2ddesigndraftingservices.blogspot.in/rss.xml","affiliation_name":"2D Drafting India ","born_year":1980,"born_month":2,"born_day":20,"tag_list":"steel-detailing-services, shop-drawings-services, structural-steel-detailing, structural-shop-drawings, structural-design, structural-drawings, structural-engineering-drawings, fabrication-drawings, fabrication-shop-drawings","alias_list":null,"created_at":"Thu Aug 16 12:12:57 UTC 2012","updated_at":"Fri Aug 17 18:52:22 UTC 2012","overview":"<p>2D Drafting India offers precise, accurate and feasible structural steel detailing drawings to worldwide clients. Our large clientele are from engineering firms across the US, Canada, Europe and Australia. Join hands with us, we will remove your burdens and your company will be free to focus on its core values. Our unique group of the talented Structural engineers and detailer who are specialize in providing Steel detailing, miscellaneous steel detailing, AISC steel design, Steel beam design, composite steel beam design, 3D structural model, concrete steel connection design and shop drawings.</p>\n\n<p>2D Drafting India is expertise in providing the shop drawings and bill of material as per the international standards. Our team of drafter and designer are well expertise in providing miscellaneous detailing of beams, rafters, girders, single/double legged columns, bracings, trusses, staircases, pipe bridges, bunkers, chutes and variety of miscellaneous items.</p>\n\n<p>Get a free quotation: http://www.2ddraftingindia.com/2d-drafting-inquiry.php</p>\n\n<p>Our Steel Detailing Services include:\n    * Shop Drawings<br/>\n    * Fabrication Drawings\n    * Anchor Bolt PlansFraming Plans\n    * Erection Plan\n    * 3D Modeling\n    * Stair and Hand rail detailing</p>\n\n<p>2D Drafting India offer steel detailing services to Fabricators, Professional Engineers, and Joist Manufactures. Our steel detailing services includes Steel Design prepare by the structural engineers with the complete documents of shop drawings for the fabricators. Our detailer are specialize in providing detail drawing of each and every component of structure, Erection drawing, Member placement drawing, Anchor Bolt layout. Contact us or email us at info@2ddraftingIndia.com to outsource your structural steel detailing and shop drawings services requirements for greater quality outputs in lesser time at low costs.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"2D Drafting India ","permalink":"2d-drafting-india-2","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.2ddraftingindia.com","title":"steel detailing drawings"}],"web_presences":[]}