{"first_name":"Adam","last_name":"Cowan","permalink":"adam-cowan","crunchbase_url":"http://www.crunchbase.com/person/adam-cowan","homepage_url":"http://www.atshire.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Advanced Technology Search","born_year":1959,"born_month":1,"born_day":19,"tag_list":"","alias_list":null,"created_at":"Mon Apr 23 19:26:37 UTC 2012","updated_at":"Mon Apr 30 00:59:56 UTC 2012","overview":"<p>Since founding Advanced Technology Search, Adam Cowan has become one of the most successful executive recruiters in the RF/Wireless industry, building ATS into a leading recruiting firm in Smartphone technology, RF/Microwave products and Defense Electronics. </p>\n\n<p>One of Adam’s key roles is strategic business development; driving ATS’ expertise in numerous market segments, where our recruiting expertise can benefit clients and candidates in that space.  After graduating from New York Law School with a law degree in 1987, Adam has focused on building up the firm to its current group of 15 recruiters, while maintaining the same quality standards and drive to excel that have made him successful.   He has placed CEOs and senior management, as well as sales, marketing, and design professionals.</p>\n\n<p>Other key accomplishments:\n• Developed and managed key clients in the Wireless/Smartphone chipset  industry that have produced over 100 executive and technical placements for each client over a period of ten years or more.   These major clients include Avago Technologies, Skyworks Solutions and IBM Microelectronics. \n• Developed and managed key clients in the RF /Microwave IC and Component industry that have produced over 100 executive and technical placements for each client over a period of ten years or more.  These major clients include Hittite Microwave and M/A-Com Tech.\n• Developed and managed key accounts in the Defense Electronics industry that have produced over 50 executive and technical placements over a period of ten years or more.  These major clients include DRS Corporation and Cobham Electronics.\n• Placing the CEO and/or technical management teams with several RF/Wireless and Optical Networking startups. \n• Managed several hiring projects for Wireless IC and RF/Microwave component makers, where a large group of skilled engineers was successfully recruited within challenging time constraints. </p>\n\n<p>Adam’s passion is to continue to improve ATS’ service to clients, so that once an RF/Wireless company chooses to use our services, we get the first call whenever challenging hiring needs arise. The RF/Wireless industry is one of the fastest growing, dynamic and competitive industries in the global economy.   By hiring the most talented people for our clients, we have won their loyalty, and have had the opportunity to grow with them. </p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0018/5556/185556v2-max-150x150.jpg"],[[200,250],"assets/images/resized/0018/5556/185556v2-max-250x250.jpg"],[[336,420],"assets/images/resized/0018/5556/185556v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Law Degree","subject":"","institution":"New York Law School","graduated_year":1987,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President and Founder","firm":{"name":"Advanced Technology Search","permalink":"advanced-technology-search","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/profile/view?id=2173872&authType=OPENLINK&authToken=gcSM&locale=en_US&srchid=04842d76-1f91-43ce-a296-b1c4a527db4f-0&srchindex=1&srchtotal=169&goback=.fps_PBCK_adam+cowan_*1_*1_*1_*1_*1_*1_*2_*1_Y_*1_*1_*1_false_1_R_*1_*51_*1_*51_tr","title":""}]}