{"first_name":"Adel","last_name":"Al Shirawi","permalink":"adel-al-shirawi","crunchbase_url":"http://www.crunchbase.com/person/adel-al-shirawi","homepage_url":"","birthplace":"United Arab Emirates","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 04 11:46:47 UTC 2009","updated_at":"Thu Nov 05 02:55:38 UTC 2009","overview":"<p>Mr. Adel A. Aziz Al-Shirawi</p>\n\n<p>Education: </p>\n\n<p>Al Shirawi holds a Masters degree in Engineering (Mathematics and Computer Sciences Engineering) from the University of Louisville, Kentucky, United States. \nHe has also finished Executive education programs with IMD, Harvard Business School and London Business School.</p>\n\n<p>CV:\nAl Shirawi is the privious vice chairman of Dubai government-controlled Istithmar World and also was on Tamweel’s board of directors. </p>\n\n<p>Prior to his position in Istithmar, He was the Chief Executive Officer for Tamweel. \nPrior to being appointed as the Chief Executive Officer, he was a founding member of the Tamweel Board of Directors and an active member. \nBefore joining Tamweel Al Shirawi was with The Corporate Office group of companies which includes the Ports Customs and Free Zone Corp, Nakheel Properties, Dubai Multi &amp; Commodities Center-DMCC, Tejari and Istithmar. </p>\n\n<p>Al Shirawi brings with him an extensive proven track record as Executive Director of Shared Services, and an invaluable knowledge of the local market dynamics in his role as Secretary General of The Corporate Office group of companies. </p>\n\n<p>He was also a board member for the Ports, Customs and Free Zone Corporation (PCFC) and a member of the Dubai &#8216;e-Government&#8217; Executive Team.</p>\n\n<p>Awards: \nHe has received several leading industry awards including the Dubai Government Excellence Award for Best Employee in 1999.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}