{"first_name":"Aditya","last_name":"Mahesh","permalink":"aditya-mahesh","crunchbase_url":"http://www.crunchbase.com/person/aditya-mahesh","homepage_url":"http://www.adityamahesh.com","birthplace":"","twitter_username":"adityamahesh","blog_url":"http://www.ambeat.com","blog_feed_url":"","affiliation_name":"ZapPrep","born_year":1990,"born_month":5,"born_day":1,"tag_list":"","alias_list":null,"created_at":"Mon Mar 03 03:23:48 UTC 2008","updated_at":"Thu Apr 08 20:08:03 UTC 2010","overview":"<p>Aditya Mahesh is currently an undergraduate at UC Berkeley and is the co-founder and CEO of SnipBids, a web start-up focused on helping users find affordable gifts. He is also the founder of two other web start-ups, ZapPrep College Admissions Consulting, an online tutoring firm which helps high school students with the college application process, and BeatThatVerse, a web start-up which focuses on allowing upcoming hip-hop artists to create remixes to hit songs and showcase their talent. He has been featured in the New York Times, NBC, and on countless tech and business related blogs.</p>\n\n<p>As an undergraduate at UC Berkeley, Aditya Mahesh teaches an Introduction to Entrepreneurship course through which he has helped hundreds of UC Berkeley students create business plans and launch actual start-ups and is the founder and president of CEOB (College Entrepreneurship Organization at Berkeley), the largest undergraduate entrepreneurship club on campus. His blog can be found at AM Beat.</p>\n\n<p>Background</p>\n\n<p>Aditya Mahesh started his first business, a public relations firm targeted towards small business and web start-ups, in 2004 as a high school freshman. Throughout high school, he worked on a number of other web start-ups attracting millions of unique visitors to his web properties. In the Sping of 2008, Aditya Mahesh was recognized as one of the Top 100 High School Entrepreneurs in the World by Andrew McKelvey, the founder of Monster.com.</p>\n\n<p>He founded ZapPrep College Admissions Tutoring during his freshman year at UC Berkeley and after teaming up with fellow McKeley scholar Saleh Altayyar, the owner of a used car dealership in Modesto, CA, launched SnipBids and Beat That Verse.</p>\n\n<p>Aditya currently teaches at an entrepreneurship course at UC Berkeley, Econ 198 Entrepreneurship Crash Course: Starting a Business, and is the co-founder of the school’s largest undergraduate entrepreneur association.</p>","image":{"available_sizes":[[[132,150],"assets/images/resized/0004/7249/47249v2-max-150x150.jpg"],[[200,226],"assets/images/resized/0004/7249/47249v2-max-250x250.jpg"],[[200,226],"assets/images/resized/0004/7249/47249v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder/CEO","firm":{"name":"ZapPrep","permalink":"zapprep","type_of_entity":"company","image":{"available_sizes":[[[150,52],"assets/images/resized/0005/1069/51069v2-max-150x150.jpg"],[[150,52],"assets/images/resized/0005/1069/51069v2-max-250x250.jpg"],[[150,52],"assets/images/resized/0005/1069/51069v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Founder/CEO","firm":{"name":"SnipBids","permalink":"snipbids","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.ambeat.com","title":"Blog"},{"external_url":"http://www.twitter.com/adityamahesh","title":"Twitter"},{"external_url":"http://www.facebook.com/adityam","title":"FaceBook"}]}