{"first_name":"Adrian","last_name":"Moise","permalink":"adrian-moise","crunchbase_url":"http://www.crunchbase.com/person/adrian-moise","homepage_url":"http://re.vu/adrianmoise","birthplace":"","twitter_username":"cptmbl","blog_url":"","blog_feed_url":"","affiliation_name":"Aequilibrium","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 05 23:05:28 UTC 2012","updated_at":"Tue Jun 12 13:16:08 UTC 2012","overview":"<p>With over 2 decades of diverse and progressive experience working for top brands, along with a track record of delivering world class projects, Adrian knew he was well positioned to rally a team of experts and build a digital agency that would balance creativity with innovation, and deliver technology solutions to a global clientele. </p>\n\n<p>Adrian’s credentials in the technology industry are a testament to his experience, education and dedication to identifying solutions that provide clients with tangible results and competitive advantages.</p>\n\n<p>Prior to founding Aequlibrium, Adrian played a key role in building the team and establishing the delivery capabilities for UbiSoft Romania, Electronic Arts Mobile Division (Fusion), Blast Radius (Vancouver and Amsterdam), and iQmetrix. He also honed his talents in numerous roles, all for a roster of clients including Nintendo, Nike, Starbucks, Microsoft, Electronic Arts, Nivea, Bioware, Seagate and Michelin.  The experience gained placed him in the perfect position to envision, craft and execute an innovative business model in partnership with an A-team of seasoned professionals. </p>\n\n<p>Throughout his career, Adrian has dedicated himself to solving complex problems, establishing partnerships between Industry and Academia, and building great user experiences on web, desktop, gaming consoles or mobile devices.  He has devoted himself to continuous learning and development.  </p>\n\n<p>A former Lead Game Developer and Technical Architect converted to Program and Client Management, Adrian holds a Ph.D. in Computer Science (with a specialty in Human Computer Interaction and Usability) from Simon Fraser University, and a Masters in Computer Engineering from Politehnica University of Bucharest.</p>\n\n<p>His commitment to teaching, mentoring and coaching is evident in his involvement with We Day Vancouver, DICOM International Standards Committee, and the mentoring of students from SFU School of Interactive Arts and Technology. </p>\n\n<p>In his personal life, Adrian lives by the same values he applies to his career.  As a father, teacher, gamer, explorer and entrepreneur, he is constantly learning and trying new things, taking calculated risks and always landing on his feet.</p>","image":{"available_sizes":[[[150,50],"assets/images/resized/0019/4753/194753v2-max-150x150.png"],[[250,83],"assets/images/resized/0019/4753/194753v2-max-250x250.png"],[[450,150],"assets/images/resized/0019/4753/194753v2-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"Ph.D.","subject":"Computer Science, HCI","institution":"Simon Fraser University","graduated_year":2003,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Aequilibrium","permalink":"aequilibrium","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://www.facebook.com/Dr.Adrian.Moise","title":"Facebook"},{"external_url":"https://twitter.com/#!/cptmbl","title":"Twitter"},{"external_url":"http://ca.linkedin.com/in/amoise","title":"LinkedIn"}]}