{"first_name":"Adrian","last_name":"Gropper MD","permalink":"adrian-gropper-md","crunchbase_url":"http://www.crunchbase.com/person/adrian-gropper-md","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 07 19:52:59 UTC 2008","updated_at":"Fri Nov 07 20:01:35 UTC 2008","overview":"<p>Adrian has pioneered the use of computers and the Internet to deliver diagnostics to all physicians. For over 25 years, Adrian has used a combination of engineering and medicine to transition sophisticated diagnostics out of the specialist&#8217;s lab and into everyday practice. Today, he&#8217;s at the forefront of making diagnostics accessible directly to patients over the World Wide Web.</p>\n\n<p>Adrian&#8217;s career as a medical device developer began with undergraduate education in mechanical engineering and computer simulation at MIT, graduation from Harvard Medical School, and internship at the University of Oregon Health Sciences Center. Adrian served as Director of Biomedical Research at Orion Research, Inc, Adrian pioneered the field of &#8220;physician&#8217;s office&#8221; diagnostics with the first whole blood analyzer designed for use outside of a laboratory setting. Adrian was co-founder of Analytix, Inc. and developer of the first robotic blood analyzer.</p>\n\n<p>Adrian&#8217;s work on imaging and affiliation with Massachusetts General Hospital began in 1991 with early work on the Center for Innovative Minimally Invasive Therapy, a joint project of the MGH departments of radiology and surgery. As Chief Technology Officer of RSTAR, Inc,he ran pioneering telemedicine projects throughout the world that spawned first generation of commercial diagnostic Picture Archiving and Communications Systems (PACS).</p>\n\n<p>In 1995, Adrian Gropper and Sean Doyle founded AMICAS(NYSE:AMCS) Inc, to bring diagnostic quality images to physicians outside of the radiology department PACS by using Internet technology. AMICAS&#8217; 1997 FDA-clearance of its flagship product preceded the next Web-based image management system by some 18 months. Today, AMICAS&#8217; Web-based PACS technology is installed in over 400 facilities including such flagships as MGH, Boston Medical Center, New York Presbyterian and Cornell Medical Centers and The University of Chicago.</p>","image":{"available_sizes":[[[124,128],"assets/images/resized/0002/8034/28034v2-max-150x150.png"],[[124,128],"assets/images/resized/0002/8034/28034v2-max-250x250.png"],[[124,128],"assets/images/resized/0002/8034/28034v2-max-450x450.png"]],"attribution":"<p><a href=\"http://web.mac.com/medcommons/iWeb/Site/MedCommons%20Blog/MedCommons%20Blog.html\" title=\"Adrian Gropper blog\" rel=\"nofollow\">Adrian Gropper blog</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Science Officer","firm":{"name":"MedCommons","permalink":"medcommons","type_of_entity":"company","image":{"available_sizes":[[[150,36],"assets/images/resized/0002/8032/28032v1-max-150x150.png"],[[250,60],"assets/images/resized/0002/8032/28032v1-max-250x250.png"],[[268,65],"assets/images/resized/0002/8032/28032v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}