{"first_name":"Adrian","last_name":"Gluck","permalink":"adrian-gluck","crunchbase_url":"http://www.crunchbase.com/person/adrian-gluck","homepage_url":"","birthplace":"Bucharest, Romania","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Digital Interactive","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jul 23 16:04:16 UTC 2009","updated_at":"Sat Mar 10 06:25:46 UTC 2012","overview":"<p>Adrian Gluck, P.E., Ph.D.\nagluck@moriahpartners.com</p>\n\n<p>• Dr. Gluck was Founder and CEO of Fortrex Systems, leading provider of fleet management systems, with customers including Avis and Hertz. After selling Fortrex he began a career as investor and consultant to technology companies. He provided early funding and repositioned the CreditCard Key Company, a then recent startup showing $500,000 in annual losses, from being a manufacturer of plastic spare keys to becoming the largest manufacturer of metal keys in the U.S. He also helped secure patents for its robotic key-cutting system, now widely used by major retailers including Wal-Mart, Sears, Lowe&#8217;s and Home Depot. Dr. Gluck was also on the founding team of Upper Deck, where he served on the Board of Directors and helped fund the company&#8217;s launch. By the time he left, Upper Deck had become the largest sports collectibles company in the world, with a market value estimated at $I billion. Dr. Gluck led Rainbow Technologies&#8217; IPO. Rainbow is one of the leading computer security companies in the world with customers including the NSA, the Department of Defense, and NASA. Rainbow was acquired by SafeTNet for $475 million.\n• Dr. Gluck has been a founding member, director and advisor to several other companies who now dominate their respective markets, including Media Technologies (memorabilia cards and fan photo systems), MotorVac (automotive systems), Paige (power plugs), and Safety Syringes.\n• Dr. Gluck holds several patents and patents-pending for mapping systems, trading cards, imaging systems, web indexing systems, and e-commerce processes. It is estimated that his inventions have helped generate over $3 billion in retail sales and over $100 million in earned and accrued royalties to date. Dr. Gluck holds Industrial Engineering (Computer Science) and MBA (Marketing and Finance) degrees from the University of Toronto, a Ph.D. (Business Systems and Technology) from Breyer State University, and he is a Registered Professional Engineer.</p>","image":{"available_sizes":[[[106,150],"assets/images/resized/0005/4043/54043v1-max-150x150.jpg"],[[156,220],"assets/images/resized/0005/4043/54043v1-max-250x250.jpg"],[[156,220],"assets/images/resized/0005/4043/54043v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Executive Vice President","firm":{"name":"Digital Interactive","permalink":"digital-interactive","type_of_entity":"company","image":{"available_sizes":[[[150,127],"assets/images/resized/0005/3107/53107v1-max-150x150.jpg"],[[150,127],"assets/images/resized/0005/3107/53107v1-max-250x250.jpg"],[[150,127],"assets/images/resized/0005/3107/53107v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}