{"first_name":"Adrian","last_name":"Burke","permalink":"adrian-burke","crunchbase_url":"http://www.crunchbase.com/person/adrian-burke","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Aequilibrium","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 05 23:05:28 UTC 2012","updated_at":"Tue Jun 12 13:15:57 UTC 2012","overview":"<p>Adrian’s 17-year career in technology began in software project management, then developed into a broad expertise in webdesign and development, eCommerce, digital marketing and multi-channel marketing, including social media.</p>\n\n<p>Focused on working with clients to identify business goals, Adrian then builds and leads the skilled teams necessary to deliver impactful digital marketing solutions.</p>\n\n<p>Adrian has a vast range of experience directing successful, innovative projects in the academic, business-to-business and business-to-consumer arenas.</p>\n\n<p>Keeping an eye on the bottom line, Adrian has a passion for innovation, cutting-edge design and work that moves people. He has worked with an extensive list of world-class groups and brands, including L’Oreal USA, Yves Saint Laurent Beauty, Pearson Education, Palm, Proactiv, Starbucks, Nintendo of America, Electronic Arts, Blast Radius, the University of British Columbia, Kiwi Collection, Genome British Columbia and provincial health authorities in B.C., Alberta and Australia.</p>\n\n<p>Adrian holds a Masters Degree in Experimental Medicine and a Project Management (PMP) Certification. Outside the office, Adrian avidly pursues adventure travel, rock and ice climbing and mountaineering, and has a deep interest in all things automotive.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Director, Business Development","firm":{"name":"Aequilibrium","permalink":"aequilibrium","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}