{"first_name":"Ahmad","last_name":"Shaiful","permalink":"ahmad-shaiful-2","crunchbase_url":"http://www.crunchbase.com/person/ahmad-shaiful-2","homepage_url":"","birthplace":"Terengganu","twitter_username":"musangbijak","blog_url":"http://ahmadshaiful.blogspot.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1989,"born_month":3,"born_day":22,"tag_list":"ahmad, shaiful, amiruddin, taher","alias_list":null,"created_at":"Thu Nov 25 15:24:35 UTC 2010","updated_at":"Mon Mar 28 21:13:47 UTC 2011","overview":"<p>Ahmad Shaiful is currently a third year student at Multimedia University, Cyberjaya Campus, Cyberjaya Malaysia. He study Electrical Engineering sponsored by Malaysia&#8217;s largest telecommunication company, Telekom Malaysia. </p>\n\n<p>Recently, there is rumors saying that he is now recruiting students to join his new iphone applications developer company, the very first start up company of that kind from Multimedia University. </p>\n\n<p>An all rounder persons, in his second year of bachelor degree, he was elected as President of Students&#8217; Representative Council, non-profit, and the only body taking care of students&#8217; welfare in Multimedia University Cyberjaya Campus, and while becoming the youngest ever presidents, he is also performing really well in his studies, having an almost perfect CGPA. Not only that, he also represent his university in basketball playing in University College Basketball League as point guard, and an extreme athlete racing in  Eco-Challenge competition. He is also the only athlete representing Multimedia University in triathlon. Last two months, he raced at Desaru competing in  Long Distance International Triathlon. </p>\n\n<p>With four years of experience in the infamous and prestige Royal Military College, Kuala Lumpur, prior to joining Multimedia University, he was exceptionally gifted in leadership skills, academic and sports with top class disciplines in everything he do. </p>\n\n<p>Ahmad Shaiful is well known in the university for his thought provoking idea, his visions, his ambitions, good-looking personality, straight forward in throwing ideas and the ability to influence people around him. </p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0012/7924/127924v2-max-150x150.jpg"],[[250,167],"assets/images/resized/0012/7924/127924v2-max-250x250.jpg"],[[450,301],"assets/images/resized/0012/7924/127924v2-max-450x450.jpg"]],"attribution":"<p>Shaiful during TEDxMMU, Cyberjaya Malaysia. 10 Apr 2010. </p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/#!/musangbijak","title":"Ahmad Shaiful's Twitter"}]}