{"first_name":"Ahmed","last_name":"Moledina","permalink":"ahmed-moledina","crunchbase_url":"http://www.crunchbase.com/person/ahmed-moledina","homepage_url":"","birthplace":"","twitter_username":"amoledina","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"ibm, entrepreneur, coo, program-manager, staffing, consulting, it","alias_list":null,"created_at":"Sun Jul 31 01:04:27 UTC 2011","updated_at":"Mon Aug 01 23:30:16 UTC 2011","overview":"<p>Distinguished as a strong leader in the area of technology company financial management, Mr. Moledina has over 15 years of solid financial management, consulting and analysis experience, with particular focus in the area of high-tech start-up financial operations establishment and management.  In addition to his solid finance credentials, Ahmed also brings deep technical skills and expertise in the areas of software development, technical services, customer relationship management, vendor relations, business partner relations, cash management, credit management, and customer service, which further strengthen the significant foundation of seasoned business leadership and experience that he brings to Titan Solutions Group.  Most recently he was co-founder and principal of Titan Solutions Group, Inc., a Beacon Award winning IBM Premier Business Partner firm serving the custom software development, staffing and licensed software needs of Fortune 500 clients including: Federal Express (FDX), DR Horton, (DHI), American Express (AMEX), Progressive Insurance (PGR), Technical Olympic (TOUS), and others.  At Titan, Ahmed developed and directed the strategy of the Licensed Software Division related to IBM, Microsoft, Kofax, etc. software and software services.  Ahmed has consistently motivated and driven Titan’s sales force to exceed all Licensed Software Sales Goals set by vendors by over 300% for all previous years.  He serves on the IBM SMB Advisory Board as an advisor to IBM regarding its approach to the SMB market.  Ahmed holds a Bachelors Degree in Business Administration and a Masters of Business Administration Degree.  Prior to Titan Solutions, Ahmed founded two other start-up technology companies, and was Lead Technical Analyst for Lotus Development Corp/IBM.  Ahmed holds numerous industry and technical certifications and is certified by IBM as a Solutions Advisor.  </p>\n\n<p>In 2001, Ahmed also co-founded an IT Staffing company.  Despite the Dot Com bust, the staffing company has grown from 3 employees in 2001 to an average to 80 fulltime employees in the US.  This does not include any contractors or off-shore employees.  Ahmed has also been responsible for the overall day to day financials.  He has worked with several vendors to constantly maintain and increase the available line of credit and terms.  Ahmed also looks after the cash flow projections and the cash at hand for the company along with the profitability numbers as well.  Ahmed has also been a key person responsible for managing the sales operations of the company.  Recently the two companies, Titan Solutions Group for the software consulting projects and Titan Professional Services for the IT Staffing have been merged into one single company, Titan Solutions Group.  This merger was put in place to achieve economies of scale.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}