{"first_name":"Ahsan","last_name":"Gill","permalink":"ahsan-gill","crunchbase_url":"http://www.crunchbase.com/person/ahsan-gill","homepage_url":"http://www.armstrongsecurity.co.uk","birthplace":"london","twitter_username":"jamshaidayaz88","blog_url":"http://www.armstrongsecurity.co.uk","blog_feed_url":"http://www.armstrongsecurity.co.uk","affiliation_name":"Armstrong Security","born_year":1986,"born_month":2,"born_day":4,"tag_list":"event-security-london, event-security-services-london, event-security-companies-london, event-security, event-security-companies, event-security-services","alias_list":null,"created_at":"Thu Jun 14 11:18:48 UTC 2012","updated_at":"Tue Jun 19 13:03:33 UTC 2012","overview":"<p>Armstrong Security offers state of the art Site Security in London. We provide a mix of Manned and Electronic solutions to deliver cost effective building site security.\nOur 24 hour Operation Managers help ensure the safety of all our on duty staff, while helping us provide all our customers with an efficient and effective service. Health and Safety at work is a key priority for our service and even more so in the construction industry, therefore we are extremely committed to ensuring the safety and protection of our customers.\nOur services can be booked at short notice and you can contact us in an emergency, 24 hours per day, 7 days per week and even over the Christmas holidays.\nWe are specialist in Event Security in UK and you can count on us for your business Security. All our event security guards are SIA licensed, CRB checked and scrupulously vetted before being taken on. Each event security guard has ample experience and is therefore able to handle a variety of situations. We offer highly competitive rates with no minimum charge or long term contract. Our guards can be uniformed and kitted out with protective clothing such as high visibility jackets and hard hats.\nEach Site security guard carries a clocking on machine which records their patrol around key points of the construction site to prove the site is being fully monitored. We take into account all aspects of event security from manned gate personnel to on site patrol. Often, there are large numbers of temporary contractors on site and Armstrong Guards are on hand for both security and health &amp; safety purposes, ensuring that all new site visitors are correctly vetted and briefed. We also provide Concert Security services in UK, exhibition security and festival security in UK.Please feel free to contact Our contracts manager Mr. Gill at 00442084322236 to discuss your UK event security requirements.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"expert","firm":{"name":"Event Security","permalink":"event-security","type_of_entity":"company","image":null}},{"is_past":false,"title":"","firm":{"name":"Midlands Auos","permalink":"midlands-auos","type_of_entity":"company","image":null}},{"is_past":true,"title":"Manager","firm":{"name":"Armstrong Security","permalink":"armstrong-security","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.armstrongsecurity.co.uk","title":"Hire bodyguard in london"},{"external_url":"http://www.armstrongsecurity.co.uk","title":"Event Security London"},{"external_url":"http://www.armstrongsecurity.co.uk","title":"Security Companies London"}]}