{"first_name":"Aigars","last_name":"Sudmalis","permalink":"aigars-sudmalis","crunchbase_url":"http://www.crunchbase.com/person/aigars-sudmalis","homepage_url":"http://www.finansupartneri.lv/","birthplace":"Riga","twitter_username":"_gramatvediba_","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1977,"born_month":11,"born_day":1,"tag_list":"finansu-partneri, aigars-sudmalis, accounting","alias_list":null,"created_at":"Tue Oct 04 08:08:26 UTC 2011","updated_at":"Sat Nov 19 01:11:38 UTC 2011","overview":"<p>About Finansu Partneri</p>\n\n<p>Our Team - We are a group of experienced individuals possessing a shared eagerness to enhance own talents, knowledge and abilities and to help other people to realize their business dreams. Thus we came together many years ago in order to create a company you know now as Finansu Partneri.</p>\n\n<p>Each of us is trustful, open-minded, hardworking and interesting person which makes us enjoy our work together. We are united in what we do leading to the greatest quality for our customers, clients and business partners.</p>\n\n<p>We share common business goals, vision and principles. You may relax and be sure -your business is in good hands!</p>\n\n<p>Our Mission - The mission of Finansu Partneri project is to contribute to the development of global businesses by realising accounting and information technology functions and sharing our knowledge with our clients, thus providing efficiency and effectiveness in their daily operations as well as cost and quality advantage.</p>\n\n<p>Our Values - Our values are loyalty, trustworthiness, quality, expertise and individual approach. These are five cornerstones of our business that guide us when providing high-level services to our clients.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0015/6661/156661v2-max-150x150.jpg"],[[180,180],"assets/images/resized/0015/6661/156661v2-max-250x250.jpg"],[[180,180],"assets/images/resized/0015/6661/156661v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}