{"first_name":"Air","last_name":"Fill","permalink":"air-fill-2","crunchbase_url":"http://www.crunchbase.com/person/air-fill-2","homepage_url":"http://www.castingsourceindia.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Oct 06 08:16:40 UTC 2010","updated_at":"Thu Oct 07 21:56:30 UTC 2010","overview":"<p>Established in the year 1990, we, Air Fill, are a top notch manufacturer and exporter of ferrous and non ferrous components that include air compressors spares, general engineering spares and textile machinery spares. We make use of high grade raw material such as iron ore &amp; coal, alloys, refractories, rolls and paint to design quality and durable range of products. Due to precise engineering and dimensional accuracy, our range is in high demand with automobile manufacturers, valve manufacturers, heavy equipment manufacturers and railways &amp; aeronautic industries. </p>\n\n<p>We are backed by state-of-the-art infrastructure and team of efficient professionals, which assist us in meeting bulk and urgent requirements of our esteemed clients. Our infrastructure is equipped with all the modern machines such as aluminum making machine, processing machine and distributing machine that enable us to produce superior quality range of products. Proper knowledge of our professionals about these machines helps us in offering products as per the specifications provided by clients</p>\n\n<p>We offer to sell ferrous casting, non-ferrous casting, brake hubs, brake assemblies, brackets, exhaust bends, piston rods, turbo charger assembly, valves, air compressor spares, textile machinery spares, engineering spare parts.</p>\n\n<p>Contact us at:</p>\n\n<p>Air Fill\nMr. R. P. Mohan Raju\n1882, Trichy Road, Ramanathapuram\nCoimbatore, Tamil Nadu - 641045, India\nTelephone   :   +91-422-4395942\nMobile  :   +91-9843211112\nFax     :   +91-422-2322833</p>\n\n<p>Visit us at:    http://www.castingsourceindia.com/</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0010/4365/104365v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0010/4365/104365v2-max-250x250.jpg"],[[250,250],"assets/images/resized/0010/4365/104365v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}