{"first_name":"Aiyah","last_name":"Saihati","permalink":"aiyah-saihati","crunchbase_url":"http://www.crunchbase.com/person/aiyah-saihati","homepage_url":"http://www.aiyah-saihati.com/","birthplace":"Saudi Arabia","twitter_username":"","blog_url":"http://roarsandwhispers.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"aiyah-saihati, saudi-arabia, entrepreneurship, designer","alias_list":null,"created_at":"Wed Oct 31 10:04:29 UTC 2012","updated_at":"Sat Nov 03 22:59:19 UTC 2012","overview":"<p>Aiyah Saihati is an advocate for women’s rights and economic empowerment, an international entrepreneur and an intellectual. Her educational background involves studying engineering, design and business, and she is also highly involved in the non-profit sector and a design career to boot. She began studying in her home country of Saudi Arabia, but continued her education in both Europe and the U.S. Saihati is truly a student of the world. She is a citizen of both the U.S. and Saudi Arabia, currently residing in Washington D.C. While still service as her privately owned company&#8217;s president, she is also busy with a wide variety of other activities. </p>\n\n<p>Aiyah Saihati is dedicated to the defense and empowerment of women, especially in her home country Saudi Arabia. For example, she wrote an open letter to the Saudi government following an incident in which a woman was raped and then punished for her actions despite being the victim. This stunning letter was circulated throughout the international media, translated into more than ten languages. As a self-defined moderate Muslim, Saihati based her arguments on her extensive research and knowledge of both judicial precedents in international law, as well as Shari’a Islamic law. She wrote that although the Qur’an advises against a woman from meeting a man privately, it does not prescribe a punishment; the Saudi government sentenced the victim first to 90 lashes and then, following an appeal, increased it to half a year in prison and 200 lashes. Fortunately, due to the outcry, the sentence of the victim was dropped. Saihati calls on Saudis to unite in the defense of women in her home nation to repair systemic flaws that lead to a woman being punished for a crime that was carried out against her, rather than by her. </p>\n\n<p>Aiyah Saihati is involved in other regional projects to help advance the status of women in the Arab world. She has spoken out about the Arab Spring of the last year, and the potential it opens for the betterment of women’s lives. She is a frequent lecturer at various universities subjects pertaining to entrepreneurship and leadership, as well as the Middle East. For example, she was invited to give a lecture at the Wharton Business School MENA conference. She espoused the changes that have occurred already, with some Saudi women, such as herself, being able to progress in the business world and even hold executive roles in major international and local business enterprises. Saihati was also asked to participate in a U.S. Congress discussion on U.S.-Saudi relations, which she can shed a particular light on due to her own status as sitting on this cultural fence.</p>\n\n<p>Another twist in Aiyah Saihati’s engaging and fascinating career is her early project as a designer. Her interest began while in university when she worked in an art gallery where she began to learn about and appreciate modern art and some of its “classic” stars, such as Picasso and Renoir. She took an interest in design and embarked on a path of learning about functional design. Saihati’s first design outlet were her shoe collections, which are renowned for being feminine and elegant, yet making a statement. </p>","image":{"available_sizes":[[[150,107],"assets/images/resized/0021/8048/218048v2-max-150x150.jpg"],[[226,162],"assets/images/resized/0021/8048/218048v2-max-250x250.jpg"],[[226,162],"assets/images/resized/0021/8048/218048v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"Business Administration","institution":"European Institute of Business Administration, INSEAD","graduated_year":2006,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.aiyahsaihati.org","title":"Who is Aiyah Saihati"}],"web_presences":[{"external_url":"https://twitter.com/Aiyah1","title":"Aiyah's Twitter"},{"external_url":"http://www.linkedin.com/pub/aiyah-saihati/2/212/843","title":"Aiyah Saihati on Linkedin"}]}