{"first_name":"Ajay","last_name":"Chowdhury","permalink":"ajay-chowdhury","crunchbase_url":"http://www.crunchbase.com/person/ajay-chowdhury","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"ComQi","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Sep 01 15:41:23 UTC 2011","updated_at":"Tue Sep 20 15:42:16 UTC 2011","overview":"<p>Before joining ComQi, Ajay co-founded Acacia Capital Partners and IDG Ventures Europe, the European venture capital arm of IDG, the world&#8217;s leading IT media publisher. Prior to starting IDGVE, Ajay was European President and CEO of NBC Internet - a NASDAQ quoted integrated media company - and was responsible for setting up their European operations.</p>\n\n<p>Prior to joining NBCi he was Chief Executive of LineOne - a joint venture between United News and Media and British Telecom - which he helped grow into one of the UK&#8217;s largest portals and Internet Service Providers and which was subsequently sold to Tiscali.</p>\n\n<p>He joined United News and Media in 1991 and was founder and Managing Director of United Interactive - its new media division. United Interactive grew to encompass Anglia Multimedia, one of the UK&#8217;s leading educational publishers; Definition Digital Media, a UK web agency; and AngliaCampus, an online educational service for schools and homes, which were subsequently sold to Granada PLC.</p>\n\n<p>Before joining United, he was a manager at Bain &amp; Company, the international management consultants where he ran projects in Japan, Hong Kong, Korea, Germany and the UK.</p>\n\n<p>Ajay has an MBA from Wharton and a Bachelor of Commerce from Bombay University. He studied Theatre Directing at the Central School of Speech and Drama and Film Directing at the Metropolitan Film School at Ealing Studios.</p>\n\n<p>Ajay serves on the board of the Arts Council (London) - the national development agency for the arts in London, distributing public money from Government and the National Lottery. He is also Artistic Director of the Rented Space Theatre Company and an executive committee member of the British Screen Advisory Council. He has also served on the boards of Lionhead Studios (sold to Microsoft in April 2006), Shazam Entertainment, MLA (Museums, Libraries and Archives Commission), Index on Censorship and Virtual Internet PLC (sold to Register.com in February 2002).</p>\n\n<p>In 2005, Ajay was selected by the Institute of Asian Professionals to be part of the Asian Power 100 - the 100 most influential and powerful Asians in the UK.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"ComQi","permalink":"enqii","type_of_entity":"company","image":{"available_sizes":[[[150,76],"assets/images/resized/0005/3390/53390v3-max-150x150.png"],[[191,97],"assets/images/resized/0005/3390/53390v3-max-250x250.png"],[[191,97],"assets/images/resized/0005/3390/53390v3-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"General Partner","firm":{"name":"IDG Ventures Europe","permalink":"idg-ventures-europe","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}