{"first_name":"Akshay","last_name":"Hartalkar","permalink":"akshay-hartalkar","crunchbase_url":"http://www.crunchbase.com/person/akshay-hartalkar","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Orbis Media Technologies Pvt Ltd","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jun 25 09:46:44 UTC 2009","updated_at":"Sun Jul 12 22:56:06 UTC 2009","overview":"<p>As one of the founders of Orbis Media, Akshay plays an instrumental role in business planning and product formulation. Besides this, he also drives marketing, strategy, corporate relations, partnerships and alliances.</p>\n\n<p>Armed with a BE from Amaravati University, Akshay began his career in marketing and product development with textile, manufacturing and export organizations. After four years, he shifted to the software industry and has been crossing many professional milestones over the last nine years. From the beginning of his career, he worked on various leadership roles in marketing, product development, testing and managing engineering groups. While leading and managing software engineering teams, he has overseen all aspects of the software industry. His expertise in cross-functional areas has helped him scale up his vision. Prior to Orbis, he worked with Xora Software as a senior development manager, where he was responsible for managing the company’s flagship product.\nWith over 13 years’ experience in world-class organizations, Akshay plays a crucial role in Orbis’ success. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Orbis Media Technologies","permalink":"orbis-media-technologies","type_of_entity":"company","image":{"available_sizes":[[[150,85],"assets/images/resized/0005/0653/50653v2-max-150x150.jpg"],[[168,96],"assets/images/resized/0005/0653/50653v2-max-250x250.jpg"],[[168,96],"assets/images/resized/0005/0653/50653v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}