{"first_name":"Al","last_name":"Childers","permalink":"al-childers","crunchbase_url":"http://www.crunchbase.com/person/al-childers","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Dec 01 12:20:46 UTC 2008","updated_at":"Mon Dec 01 12:22:53 UTC 2008","overview":"<p>Al is the former president of administration for Cardinal Health Pharmaceutical Development. He co-founded Magellan Laboratories and engineered the sale of it to Cardinal Health, Inc. (NYSE:CAH), a Fortune 50 company. With a reported acquisition price in excess of $200 million, this was one of the largest acquisitions in North Carolina for the past few years. Magellan was recognized as one of the fastest growing, privately held companies in the Research Triangle area and received numerous regional and national awards for growth and entrepreneurial development. Magellan was awarded the Triangle Business Journal&#8217;s Fast 50 award for nine years and was in the Top 10 for six. In 1998, Childers was named Entrepreneur of the Year for North and South Carolina by Ernst and Young, The Kauffman Foundation, USA Today, and NASDAQ and was a Finalist for the 1998 National Entrepreneur of The Year.</p>\n\n<p>More recently, he received two awards from the Council for Entrepreneurial Development (CED), the 2002 Entrepreneurial Excellence Award and the 2002 Deal of the Year Award. Prior to starting Magellan Laboratories, Al developed and managed the Inhalation Analysis Department for Glaxo-SmithKline. Before joining Glaxo, Al was a principal investigator at the Upjohn Company, and was responsible for analytical development for Controlled released tablets, parenterals, and inhalation aerosols. Al received his Ph.D. in Analytical Chemistry from Indiana University under the direction of Dr. Gary H. Hieftje and his B.S. in chemistry from Furman University. Al has authored over 40 articles and presentations in the area of pharmaceutical and analytical science. Al is on the board and serves as an advisor to several early-stage life science companies.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Venture Partner","firm":{"name":"Southern Capitol Ventures","permalink":"southern-capitol-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,39],"assets/images/resized/0003/0447/30447v1-max-150x150.jpg"],[[250,65],"assets/images/resized/0003/0447/30447v1-max-250x250.jpg"],[[267,70],"assets/images/resized/0003/0447/30447v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}