{"first_name":"Alan","last_name":"Donenfeld","permalink":"alan-donenfeld","crunchbase_url":"http://www.crunchbase.com/person/alan-donenfeld","homepage_url":"http://www.ParagonLP.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Feb 01 22:08:10 UTC 2011","updated_at":"Wed Feb 02 01:54:14 UTC 2011","overview":"<p>Alan Donenfeld has over 25 years of experience investing in, advising and financing companies. He founded Paragon Capital in 2005 and invests growth capital in small cap public companies.  For over 10 years, Mr. Donenfeld has been  President of Bristol Investment Group, Inc., an SEC-registered broker-dealer and member of FINRA. Prior to establishing Bristol and its related entities in 1990, Mr. Donenfeld was a Vice President in the Mergers and Acquisitions Group at Bear, Stearns &amp; Co. Inc. in New York from 1987 to 1990, where he participated in numerous acquisitions, investments, valuations, fairness opinions and exclusive sale representations. Prior to working at Bear Stearns, Mr. Donenfeld was an Assistant Vice President in the Mergers and Acquisitions Group at E.F. Hutton, a predecessor of Lehman Bros., from 1985 to 1987. Prior to joining E.F. Hutton, Mr. Donenfeld helped establish Quadrex Securities Corporation, where he assisted in raising a leveraged buyout fund. Mr. Donenfeld started his career at SG Cowen and then at J. Henry Schroder Bank. Mr. Donenfeld graduated with Honors from Tufts University in 1979 with a B.A. in Economics and received his M.B.A. from the Fuqua School of Business at Duke University in 1981, where he was a member of the Investment Policy Committee.</p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0012/0024/120024v2-max-150x150.jpg"],[[187,250],"assets/images/resized/0012/0024/120024v2-max-250x250.jpg"],[[240,320],"assets/images/resized/0012/0024/120024v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}