{"first_name":"Alan","last_name":"Jeffers","permalink":"alan-jeffers","crunchbase_url":"http://www.crunchbase.com/person/alan-jeffers","homepage_url":"http://www.sackvillesolutions.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"LikeCube","born_year":1957,"born_month":10,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Oct 07 16:45:49 UTC 2009","updated_at":"Fri May 11 11:04:34 UTC 2012","overview":"<p>Alan works with both commercial and public sector organisations and in particular companies in the Hospitality &amp; Travel Business, providing organisational re-design, operational efficiency reviews, contact centre diagnostics, service delivery design, as well as start-up and relocation management. His work also includes business support and mentoring initiatives to groups and individuals during times of change and uncertainty.</p>\n\n<p>Jeffers started his career in the airline industry in 1975 and since then has enjoyed a high-profile career within the Travel &amp; Hospitality Industries. He joined Utell International in 1990 and soon assumed the role of General Manager and later Regional Director overseeing the operations, sales and hotel account management functions for Utell throughout the region. When Utell merged with Anasazi to form REZsolutions in 1997, he left the company to set up his own business Sackville Solutions which he still owns and runs today. In January 2000 he was asked to return to REZsolutions and assist with a due diligence process, while the company was being acquired by Pegasus Solutions. His core skills of assembling and leading effective start-up service based teams, implementing modern principals to manage and underpin change along with enabling business and process reviews in operations and customer facing environments have been widely acclaimed.</p>\n\n<p>A Fellow at The Royal Society for the encouragement of Arts, Manufactures and Commerce (RSA) Jeffers has collaborated with the National Endowment for Science, Technology and the Arts (NESTA) providing business support and mentoring to individuals as part of the Creative Pioneers Programme, supporting individuals in the early stages of their careers. He has recently served as Non-Executive Board member of LikeCube®, an innovative technology company that combines semantic web technologies with a state-of-the-art recommender system, now part of the TimeOut Group.</p>","image":{"available_sizes":[[[145,150],"assets/images/resized/0010/4456/104456v1-max-150x150.jpg"],[[242,250],"assets/images/resized/0010/4456/104456v1-max-250x250.jpg"],[[242,250],"assets/images/resized/0010/4456/104456v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Non Exec Director","firm":{"name":"LikeCube","permalink":"likecube","type_of_entity":"company","image":{"available_sizes":[[[150,58],"assets/images/resized/0004/2188/42188v2-max-150x150.jpg"],[[250,97],"assets/images/resized/0004/2188/42188v2-max-250x250.jpg"],[[450,174],"assets/images/resized/0004/2188/42188v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Principal Consultant","firm":{"name":"Sackville Solutions","permalink":"sackville-solutions","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}