{"first_name":"Alan","last_name":"Sukin","permalink":"alan-sukin-2","crunchbase_url":"http://www.crunchbase.com/person/alan-sukin-2","homepage_url":"http://sacdesignet.com/","birthplace":"Sacramento","twitter_username":"sacdesignet","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"sacramento-design, sacramento-web-development, sacramento-design-network, sacramento-graphic-design","alias_list":null,"created_at":"Tue Apr 10 20:11:02 UTC 2012","updated_at":"Sat Apr 14 19:26:42 UTC 2012","overview":"<p>The founder grew up in Montana and attended Tulane University in New Orleans, Louisiana, later to transfer to Tulane&#8217;s A.B. Freeman School of Business. He graduated with a B.S. in Business Management with a concentration in Accounting.  </p>\n\n<p>He was recruited prior to graduating to KPMG Peat Marwick, a public accounting firm in San Jose, California, at which time he became aware of his true interest when he took on a position with a custom accounting software development company in Foster City, CA.   </p>\n\n<p>Information Technology become his passion as he became one of the first Network Engineers in Silicon Valley with a strong background in Unix, Novell, Windows Server OS, OSX, with a profound understanding of the physical layer (e.g. Cisco, Firewalls, PC Support, Systems Integration, Web Application Development, Database Design and Implementation) for clients (e.g. Wells Fargo Bank, Visa International, Non-Profit, and Silicon Valley small companies).</p>\n\n<p>He is now a passionate entrepreneur and strives to improve the regional business environment in northern California. </p>\n\n<p>Established in 2011, Sacramento Design Network, Inc. is a full service web agency that can help you with website construction, custom web applications, digital marketing and online branding.</p>\n\n<p>Sacramento Design Network Team&#8217;s goal is to provide custom services, thoroughly planned, creative and effective. We plan for future growth using the latest technology and improve lead generation by creating very usable websites. </p>\n\n<p>Once your great site is completed, we help you get high rankings for your website on search engines, improve visibility in social media, etc. via our internet marketing services. </p>\n\n<p>Our goal is to get you new business leads and keep you above your competitors, so that you get the new business!</p>","image":{"available_sizes":[[[150,106],"assets/images/resized/0018/3537/183537v2-max-150x150.jpg"],[[250,177],"assets/images/resized/0018/3537/183537v2-max-250x250.jpg"],[[450,319],"assets/images/resized/0018/3537/183537v2-max-450x450.jpg"]],"attribution":"<p>Sacramento Design Network</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}