{"first_name":"Alana","last_name":"Troutt","permalink":"alana-troutt","crunchbase_url":"http://www.crunchbase.com/person/alana-troutt","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Lovetropolis.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jun 18 17:18:10 UTC 2009","updated_at":"Mon Aug 24 21:22:19 UTC 2009","overview":"<p>Ms. Troutt is the founder and President of The Troutt Group, LLC.  She is an experienced principal consultant who is well-versed in communications, technology and public policy.  Additionally, Ms. Troutt previously served as Chief Financial Officer for Turning Point Communications and TPC, Inc. and has sound knowledge of accounting and finance principles.  Ms. Troutt, a certified public accountant, holds a graduate degree in Accounting and an undergraduate degree in Business Administration from Universidad Metropolitana</p>\n\n<p>As Director of Planning, Strategy and Analysis, Ms. Troutt oversees the following corporate matters:  developing detailed competitive analysis on all major players in the online dating industry, as well as maintaining regular updates; developing long-range financial models for the online dating business and the components within the online dating business; working with product and finance teams to understand the impact of major business model levers, including pricing, key sales metrics and customer value; developing a point of view on new and future opportunities, both organic and inorganic in the online dating industry; and developing ad hoc financial and business analyses, as required.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Director of Planning, Strategy and Analysis","firm":{"name":"Lovetropolis.com","permalink":"lovetropolis-com","type_of_entity":"company","image":{"available_sizes":[[[150,22],"assets/images/resized/0004/9655/49655v2-max-150x150.png"],[[250,36],"assets/images/resized/0004/9655/49655v2-max-250x250.png"],[[450,66],"assets/images/resized/0004/9655/49655v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}