{"first_name":"Alan","last_name":"Shen","permalink":"alan-shen","crunchbase_url":"http://www.crunchbase.com/person/alan-shen","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unify²","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Oct 19 19:56:00 UTC 2012","updated_at":"Wed Nov 07 05:50:56 UTC 2012","overview":"<p>Alan leads the Unify2 Enterprise Voice practice, which includes enterprise deployments of all aspects of Microsoft Unified Communications Enterprise Voice, including bandwidth planning, voice quality, PBX interoperability, edge deployment, enterprise voice routing, and enterprise cellular telephony.</p>\n\n<p>Alan brings over 10 years of Microsoft experience as a Program Manager in the Mobility, Networking, and Office Communications Server groups. As a Senior Program Manager for Microsoft Office Communications Server, Alan designed the Audio/Video Conferencing Edge solution for OCS 2007. This firewall traversal technology has been adopted by the Microsoft Windows Live Messenger service, now connecting more than one billion voice minutes per month.</p>\n\n<p>Most recently, Alan was a Senior Program Manager for the OCS Technology Adoption Program (TAP), which enabled dozens of global enterprise customers and over 100 Partners with their OCS 2007 deployments. Alan led the Voice TAP for Microsoft, which focused on enterprise deployments of OCS Voice. Alan was a key approver for over 100 customer designs for interfacing with Gateways &amp; PBXs.</p>\n\n<p>Previously, as a Program Manager on the Microsoft Windows Mobile team, Alan designed the cellular middleware and driver layers currently used in all Windows Mobile devices. Alan is a regular speaker at Microsoft technical events, including Voice Ignite, TechReady, and TechEd. Alan has a B.S. in Computer Engineering and an M.S. in Computer Science and Engineering from the University of Washington. In his free time, Alan enjoys conducting the Puget Sound Symphony Orchestra, which he founded in 1999.</p>","image":{"available_sizes":[[[117,150],"assets/images/resized/0021/8925/218925v2-max-150x150.jpg"],[[196,250],"assets/images/resized/0021/8925/218925v2-max-250x250.jpg"],[[213,271],"assets/images/resized/0021/8925/218925v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Vice President Voice Practice ","firm":{"name":"Unify² (Unify Square) ","permalink":"unify-2","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0021/4911/214911v2-max-150x150.png"],[[250,74],"assets/images/resized/0021/4911/214911v2-max-250x250.png"],[[450,133],"assets/images/resized/0021/4911/214911v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}