{"first_name":"Alan","last_name":"B. Miller","permalink":"alan-b-miller","crunchbase_url":"http://www.crunchbase.com/person/alan-b-miller","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Mar 22 05:47:14 UTC 2011","updated_at":"Tue Mar 22 05:50:18 UTC 2011","overview":"<p>Alan B. Miller has over 14 years of knowledge and experience as a senior level executive in the orthopaedic industry, and with international, start-up and turnaround expertise. Alan’s possesses a wide range of knowledge in project management, product &amp; market development, strategic planning, sales, marketing, and finance has enabled him to bring unusual know-how into new business development, manufacturing, distribution, and business operations.\nBefore co-founding CE Ortho, Alan served as the Co-Founder, Vice President of Market Development of Small Bone Innovations, Inc., a leading Small Bone and Joint (SB&amp;J) company. While at SBI, Alan spearheaded the company’s effort to revitalize technology located in its Bourg-en-Bresse France facility resulting in the successful introduction of the first SBI lower extremity product to the U.S. orthopaedic market and the creation of a new franchise brand for the company’s uppermost product line in its portfolio.\nIn conjunction with a stellar start-up management team, SBI achieved critical mass in less than one year. The company is now recognized as a leading Small Bone &amp; Joint company.\nAlan was a Co-Founder and President of Envision Manufacturing, Inc. prior to its acquisition by Small Bone Innovations in November of 2004. From 1992 to its acquisition by SBI in November 2004, Envision Manufacturing Inc. was a premier orthopedic implant and surgical instrument supplier to leading orthopedic companies.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Co-Founder, Executive VP Market and Business Development","firm":{"name":"Core Essence Orthopaedics","permalink":"core-essence-orthopaedics","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0012/7170/127170v1-max-150x150.jpg"],[[250,76],"assets/images/resized/0012/7170/127170v1-max-250x250.jpg"],[[377,115],"assets/images/resized/0012/7170/127170v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}