{"first_name":"Alan","last_name":"Mendelson","permalink":"alan-mendelson","crunchbase_url":"http://www.crunchbase.com/person/alan-mendelson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jun 07 08:21:30 UTC 2009","updated_at":"Sun Jun 07 08:23:05 UTC 2009","overview":"<p>Prior to founding Axiom, Mr. Mendelson had a 24-year career in investments at Aetna Life &amp; Casualty in Hartford, Connecticut where he was involved in over $3.0 billion of private placement debt financings with estimated combined losses of under $10 million. For the last 10 years at Aetna, he was responsible for building its $135 million venture capital portfolio of direct and partnership investments. In his last six years at Aetna, he focused its venture investing on the medical/healthcare area, where he made a number of successful investments, including GMIS, Geron, Human Genome Sciences and SyStemix.  In several of these companies, he was a founding investor, and in the case of SyStemix also its de facto CEO. Overall the $65.0 million portfolio of direct investments generated approximately $265 million of proceeds.  In addition, he was a co-founder of Thermoscan, Inc., which became a $100 million subsidiary of Gillette. </p>\n\n<p>Mr. Mendelson is presently on the Investment Committee of Connecticut Innovations, Inc., the State of Connecticut’s venture fund with a portfolio in excess of $60 million.  He also serves on the Boards of the Connecticut Technology Council and the MIT Enterprise Forum.  Mr. Mendelson is on the Keck Institute Advisory Board and was on the Advisory Board of Battery Ventures and Syncom, two well-known venture capital firms.  </p>\n\n<p>Previously, he was the President and CEO of Aetna, Jacobs, and Ramo, where under his direction, ES Jacobs and Company realized approximately $200 million on $40 million of invested capital. He has also done extensive consulting on the entrepreneurial activities of several large companies including Glaxo, Texas Instrument, DuPont and IBM. \nMr. Mendelson concentrates on the biopharmaceutical sector, particularly therapeutics. Mr. Mendelson has an undergraduate degree in economics and a law degree.</p>","image":{"available_sizes":[[[108,150],"assets/images/resized/0004/7197/47197v1-max-150x150.jpg"],[[162,223],"assets/images/resized/0004/7197/47197v1-max-250x250.jpg"],[[162,223],"assets/images/resized/0004/7197/47197v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Axiom Ventures","permalink":"axiom-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,47],"assets/images/resized/0004/7195/47195v1-max-150x150.jpg"],[[193,61],"assets/images/resized/0004/7195/47195v1-max-250x250.jpg"],[[193,61],"assets/images/resized/0004/7195/47195v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}