{"first_name":"Alan","last_name":"McGlade","permalink":"alan-mcglade","crunchbase_url":"http://www.crunchbase.com/person/alan-mcglade","homepage_url":"http://alanmcglade.com","birthplace":"","twitter_username":"alan_mcglade","blog_url":"http://blog.devny.vc","blog_feed_url":"http://blog.devny.vc/rss","affiliation_name":"DEV","born_year":null,"born_month":null,"born_day":null,"tag_list":"early-stage-capital, digital-media, music, film, tv, publishing, gaming, social-media","alias_list":null,"created_at":"Sun Apr 22 23:04:03 UTC 2012","updated_at":"Thu May 17 04:00:03 UTC 2012","overview":"<p>Mr. McGlade is a founder and Managing Director of Digital Entertainment Ventures and a current advisor and investor in several media companies including Talking Media group, Disruptive Apps, RCRDCLUB and Mad Humans Mobile Games.  Mr. McGlade has over two decades of experience in taking companies from early conceptual stage to significant market player in television, and digital media with an emphasis on music.</p>\n\n<p>For the last nine years Mr. McGlade was the Chief Executive and a member of the Board of Directors of MediaNet. The Company was formed with three of the major record companies combining as the majority owner, to respond to the sudden explosion in music downloading. MediaNet powered music and media delivery in five territories in the US and Europe for many of the best known names in the business including AOL, Yahoo, HMV, Virgin, Samsung, Tesco, MTV, Microsoft&#8217;s Zune and Google.</p>\n\n<p>Prior to running MediaNet, Mr. McGlade worked at MTV Networks. He joined the company after selling them the interactive music video channel, Video Jukebox Network (The Box), where he served as CEO for five years. The Box was a cable music video channel but its unique feature was the ability of the audience to influence the programming by selecting, for a fee, the video that would play next.</p>\n\n<p>Prior to his tenure at The Box, Mr. McGlade was the president of StarNet, which provided targeted cable marketing using a national satellite delivery system tied to smart devices at cable systems. Before that McGlade was the founder and president of Adlink, the largest cable advertising interconnect in the country.</p>\n\n<p>Throughout his career Mr. McGlade has been a presenter and contributor to major news publications.  His commentaries have appeared in Billboard, Forbes and Multichannel News, among others, and he has appeared on CNBC, CNN Business and PBS.</p>","image":{"available_sizes":[[[106,150],"assets/images/resized/0018/7741/187741v2-max-150x150.jpg"],[[177,250],"assets/images/resized/0018/7741/187741v2-max-250x250.jpg"],[[320,450],"assets/images/resized/0018/7741/187741v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"DEV","permalink":"dev","type_of_entity":"financial_org","image":{"available_sizes":[[[150,150],"assets/images/resized/0018/5414/185414v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0018/5414/185414v2-max-250x250.jpg"],[[450,450],"assets/images/resized/0018/5414/185414v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://techcrunch.com/2012/05/02/dev-nycs-new-seed-fund-for-digital-media-startups-announces-first-investments/","title":"TechCrunch: DEV Announces First Investments"}],"web_presences":[{"external_url":"http://www.linkedin.com/pub/alan-mcglade/25/336/641","title":"LinkedIn"}]}