{"first_name":"Alan","last_name":"Attridge","permalink":"alan-attridge","crunchbase_url":"http://www.crunchbase.com/person/alan-attridge","homepage_url":"http://www.alanattridge.com","birthplace":"Olin, NC","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"alan-attridge","alias_list":null,"created_at":"Mon Dec 06 01:19:01 UTC 2010","updated_at":"Fri Nov 04 01:04:05 UTC 2011","overview":"<p>A mentor and coach of people, teams and companies.</p>\n\n<p>He can direct you in terms of things you need to think about, what you need to connect with and gives you a heads up about questions you wouldn&#8217;t even think about asking.</p>\n\n<p>Considered a visionary leader and has held various C level leadership positions for Consumer Products, Hospital, Medical Equipment, Retail, Energy, Fiber Optics, Software, Food and Beverage, and Research companies managing multi-million dollar budgets&#8230;</p>\n\n<p>He has an extensive background in technology transfer and the coaching of teams executing the commercialization, finance and compliance requirements.  Has a depth of experience in technology marketing and licensing.</p>\n\n<p>He is remarkably effective in mobilizing a companies resources to achieve the target results.</p>\n\n<p>Evaluated many technologies as to the commercialization potential.  He is an expert in helping teams understand, quantify and maximize the value derived from innovation and intellectual property.  Helping development teams to discover opportunities and risks in technology investment, business development and IP transactions. </p>\n\n<p>He has designed programs, lectured and instructed courses for the Small Business Development Centers at universities.  Provided business advisory services to over 100 companies including the US Army.</p>\n\n<p>He works in Europe, North, Central and South America.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}