{"first_name":"Alan","last_name":"Spoon","permalink":"alan-spoon","crunchbase_url":"http://www.crunchbase.com/person/alan-spoon","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"ice","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jan 04 12:46:33 UTC 2008","updated_at":"Sat Nov 15 06:31:11 UTC 2008","overview":"<p>Alan Spoon is a managing general partner in our Boston office. He joined Polaris in the spring of 2000 and has been part of our team since 1996 as an early advisor and initial investor.  Alan focuses on investments in information technology, with emphasis on revenue-stage companies, digital media, and e-commerce. </p>\n\n<p>Experience:\nAlan brings more than 20 years of operating, strategy, and investment experience to Polaris. He came to the firm from The Washington Post Company, where he worked for 18 years. During his career with The Post Company, he served as President, board member, Chief Financial Officer, President of Newsweek, head of newspaper marketing, and head of corporate business development. The Post Company has significant activities in newspapers, educational markets (Kaplan), television, cable, and magazines. At The Post Company, Alan also was responsible for early stage technology investments in cellular (Cellular One and digital PCS), distance learning and educational software, and information and e-commerce services (including Washingtonpost.com, Exchange.com, Junglee, BrassRing, Cars.com, and  WebTV). Prior to The Washington Post, Alan was an officer at The Boston Consulting Group, an international management consulting firm specializing in corporate strategy. </p>\n\n<p>Boards:\nAlan represents Polaris as a director of Art.com, Ice.com/Diamond.com, LegalZoom, LRN, Phreesia, Silicon Optix, Inc.,  The HealthCentral Network, and AWS Convergence Technologies, Inc. (Weatherbug).  Alan was a long-serving director of TechTarget, Inc. (TTGT, NASDAQ).  He led Polaris’ investment in Matrics, Inc. (RFID) which was sold to Symbol Technologies. Alan also served as director at Cushcraft Corporation (wireless antennae), which was sold to Laird Technologies.</p>\n\n<p>Current outside Board seats include Danaher Corporation (DHR)  and IAC/InterActive Corp (IACI).  In his not-for-profit activities, Alan is a member of the Smithsonian Institution Board of Regents, the Massachusetts Institute of Technology&#8217;s Corporation, and The Council on Foreign Relations. </p>\n\n<p>Alan&#8217;s prior business board service included ARPU, Getty Images, Human Genome Sciences, Inc., International Data Group (IDG), and American Management Systems, Inc.  Prior not-for-profit board service included WETA (Washington, DC public television and radio) and the Norwood School (Bethesda, MD), where Alan served as chairman.</p>\n\n<p>Education:\nAlan earned his B.S. at Massachusetts Institute of Technology, an M.S. at M.I.T.&#8217;s Sloan School of Management, and a J.D., with honors, from Harvard Law School.</p>","image":{"available_sizes":[[[91,150],"assets/images/resized/0001/1165/11165v1-max-150x150.jpg"],[[117,192],"assets/images/resized/0001/1165/11165v1-max-250x250.jpg"],[[117,192],"assets/images/resized/0001/1165/11165v1-max-450x450.jpg"]],"attribution":null},"degrees":[],"relationships":[{"is_past":false,"title":"Board","firm":{"name":"ice","permalink":"ice","type_of_entity":"company","image":{"available_sizes":[[[143,41],"assets/images/resized/0000/2998/2998v1-max-150x150.png"],[[143,41],"assets/images/resized/0000/2998/2998v1-max-250x250.png"],[[143,41],"assets/images/resized/0000/2998/2998v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Managing General Partner","firm":{"name":"Polaris Venture Partners","permalink":"polaris-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,36],"assets/images/resized/0001/1153/11153v1-max-150x150.png"],[[163,40],"assets/images/resized/0001/1153/11153v1-max-250x250.png"],[[163,40],"assets/images/resized/0001/1153/11153v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}