{"first_name":"Alan","last_name":"Trounson","permalink":"alan-trounson","crunchbase_url":"http://www.crunchbase.com/person/alan-trounson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 15 13:25:41 UTC 2009","updated_at":"Mon Jun 15 13:26:29 UTC 2009","overview":"<p>Alan Trounson, Ph.D., is President of the California Institute for Regenerative Medicine in San Francisco, California. Prior to joining CIRM in January 2008, Trounson was Professor of Stem Cell Sciences and Director of the Monash Immunology and Stem Cell Laboratories at Monash University, where he retains the title of Emeritus Professor. Dr. Trounson founded the National Biotechnology Centre of Excellence – ‘Australian Stem Cell Centre’..</p>\n\n<p>Trounson held various positions at Monash University beginning in 1977 and was appointed Director of the Centre for Early Human Development in 1985. He was awarded a Personal Chair in Obstetrics and Gynaecology/Paediatrics in 1991, and in 2003 was awarded a Personal Chair as Professor of Stem Cell Sciences. A Fellow of the Royal College of Obstetricians and Gynaecologists and an Honorary Fellow of the Australian and New Zealand College of Obstetricians and Gynaecologists, Trounson was awarded an honorary doctorate by the faculty of medicine at the University of Brussels.</p>\n\n<p>He has been a pioneer of human in vitro fertilisation (IVF) and associated reproductive technologies; the diagnosis of inherited genetic disease in pre-implantation embryos; the discovery and production of human embryonic stem cells and of their ability to be directed into neurones, prostate tissue and respiratory tissue.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President","firm":{"name":"California Institute for Regenerative Medicine","permalink":"california-institute-for-regenerative-medicine","type_of_entity":"financial_org","image":{"available_sizes":[[[150,50],"assets/images/resized/0004/8573/48573v1-max-150x150.jpg"],[[250,83],"assets/images/resized/0004/8573/48573v1-max-250x250.jpg"],[[399,134],"assets/images/resized/0004/8573/48573v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}