{"first_name":"Alan","last_name":"Gross","permalink":"alan-gross","crunchbase_url":"http://www.crunchbase.com/person/alan-gross","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Fundster","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Aug 08 18:26:41 UTC 2010","updated_at":"Fri Aug 13 18:33:41 UTC 2010","overview":"<p>Alan is a leader in marketing and sales in the social networking marketplace.</p>\n\n<p>Alan Gross has more than 20 years of leadership in sales, marketing and client training. Most recently, he established Gross Strategic Marketing LLC, providing innovative marketing and communications programs to B2B and B2C clients.  Prior to starting his own company, Alan was vice president of product marketing for SunGard, a global leader in technology software and services.  He led the company’s Benefit Administration marketing group with oversight of industry leading brands of retirement plan recordkeeping systems and services. He was responsible for strategic planning, market analysis, campaign development, and customer communications including the use of social media and social networking technologies.  Prior to his role in marketing leadership, Alan led the company’s development of innovative software training programs, including web-based multimedia learning programs for retirement professionals. Before joining SunGard, Alan held licenses as a securities and options principal and managed retail brokerage offices.  He holds a degree in finance from the University of Florida.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Fundster","permalink":"fundster","type_of_entity":"company","image":{"available_sizes":[[[150,81],"assets/images/resized/0009/6585/96585v2-max-150x150.jpg"],[[250,135],"assets/images/resized/0009/6585/96585v2-max-250x250.jpg"],[[450,243],"assets/images/resized/0009/6585/96585v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}