{"first_name":"Alan","last_name":"Braverman","permalink":"alan-braverman-2","crunchbase_url":"http://www.crunchbase.com/person/alan-braverman-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 21 02:33:57 UTC 2008","updated_at":"Wed May 21 02:47:08 UTC 2008","overview":"<p>Alan Braverman was named executive vice president and general counsel of The Walt Disney Company in January, 2003. Braverman serves as the chief legal officer of the company and oversees its team of attorneys responsible for all aspects of Disney&#8217;s legal affairs around the world.</p>\n\n<p>Previously, Braverman was executive vice president and general counsel, ABC, Inc. and deputy general counsel, The Walt Disney Company. In that capacity he oversaw the legal affairs of the ABC Broadcast Group, ESPN and Disney/ABC Cable, as well as labor relations. In August 1996, prior to Disney&#8217;s acquisition of ABC, Inc., Braverman was named senior vice president and general counsel, ABC, Inc. In October 1994, he was promoted to vice president and general counsel. He joined ABC, Inc. in November 1993, as vice president and deputy general counsel. In his positions with ABC, Inc. Braverman had broad responsibilities for the operation of the legal department, for government relations and for the Corporation&#8217;s legal affairs. During his tenure at ABC, Braverman guided the company through numerous lawsuits regarding news reporting and news gathering practices, supervised the company&#8217;s labor department, and oversaw the government relations function for Capital Cities/ABC, Inc. prior to its merger with Disney.</p>\n\n<p>Braverman joined Capital Cities/ABC, Inc. from the Washington, D.C. law firm of Wilmer, Cutler &amp; Pickering, where he started in 1976. He became a partner in 1983, specializing in complex commercial and administrative litigation. Before joining Wilmer, Cutler &amp; Pickering, Braverman was a law clerk to the Honorable Thomas W. Pomeroy, Jr., Justice, Pennsylvania Supreme Court.</p>\n\n<p>Braverman, a native of Boston, received a B.A. degree from Brandeis University in 1969 and subsequently worked for two years as a Vista volunteer in Gary, Indiana. In 1975, he received a J.D. degree summa cum laude from Duquesne University in Pittsburgh, where he was also editor-in-chief of the Law Review. </p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/8985/18985v1-max-150x150.jpg"],[[200,200],"assets/images/resized/0001/8985/18985v1-max-250x250.jpg"],[[200,200],"assets/images/resized/0001/8985/18985v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://corporate.disney.go.com/corporate/management_team.html\" title=\"Disney\" rel=\"nofollow\">Disney</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Senior Executive Vice President, General Counsel and Secretary, The Walt Disney Company","firm":{"name":"The Walt Disney Company","permalink":"the-walt-disney-company","type_of_entity":"company","image":{"available_sizes":[[[150,73],"assets/images/resized/0001/0929/10929v1-max-150x150.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-250x250.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}