{"first_name":"Alan","last_name":"Deutschman","permalink":"alan-deutschman","crunchbase_url":"http://www.crunchbase.com/person/alan-deutschman","homepage_url":"http://www.alandeutschman.com/","birthplace":"","twitter_username":"alan_deutschma","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Mon Oct 31 18:36:30 UTC 2011","updated_at":"Mon Oct 31 18:54:09 UTC 2011","overview":"<p>Alan Deutschman is one of America&#8217;s leading writers on change and innovation. His groundbreaking book, &#8220;Change or Die: The Three Keys to Change at Work and in Life,&#8221; debunks our myths about this crucial topic and reveals the surprising truths about what actually inspires and motivates real change.</p>\n\n<p>Alan Deutschman author of, Walk the Walk: The #1 Rule for Real Leaders, worked for 22 years as a journalist in Silicon Valley. Correspondent for Fortune, a senior writer at Fast Company, the &#8220;Profit Motive&#8221; columnist for GQ, and a contributing editor at Vanity Fair and New York Magazine. Also the author of The Second Coming of Steve Jobs, Change or Die and A Tale of Two Valleys.</p>\n\n<p>Deutschman is the former Executive Director of Unboundary, a strategy consulting firm whose clientele includes top executives at major companies such as FedEx and Charles Schwab.</p>\n\n<p>Deutschman has interviewed and profiled many of the most influential and innovative figures in global business, including Apple&#8217;s Steve Jobs, Microsoft&#8217;s Bill Gates, Amazon.com&#8217;s Jeff Bezos, Google&#8217;s Sergey Brin, and Virgin&#8217;s Richard Branson, and he has studied the successful turnarounds and change efforts at companies such as Apple, IBM, and Yahoo.</p>\n\n<p>Alan Deutschman&#8217;s latest book, &#8220;Change or Die,&#8221; inspired by his sensational cover story for Fast Company, was released in January 2007 and quickly became a San Francisco Chronicle bestseller. He is also the author of &#8220;The Second Coming of Steve Jobs,&#8221; which was both a Business Week and a Wall Street Journal bestseller, and &#8220;A Tale of Two Valleys: Wine, Wealth, and the Battle for the Good Life in Napa and Sonoma.&#8221;</p>\n\n<p>Deutschman paid his way through Princeton University largely by winning scholarships for public speaking and debate, an experience that inspired him to publish &#8220;Winning Money for College&#8221; while still a teenager.</p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0016/0259/160259v1-max-150x150.jpg"],[[250,166],"assets/images/resized/0016/0259/160259v1-max-250x250.jpg"],[[300,200],"assets/images/resized/0016/0259/160259v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"","subject":"","institution":"Princeton","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}