{"first_name":"Albert","last_name":"Fang","permalink":"albert-fang","crunchbase_url":"http://www.crunchbase.com/person/albert-fang","homepage_url":"http://www.mooladays.com","birthplace":"California","twitter_username":"albertfang","blog_url":"http://www.mooladays.com","blog_feed_url":"http://www.mooladays.com/rss","affiliation_name":"Unaffiliated","born_year":1987,"born_month":7,"born_day":31,"tag_list":"moola-days, blog, albert, fang","alias_list":null,"created_at":"Tue Aug 04 07:58:48 UTC 2009","updated_at":"Wed Dec 01 17:56:52 UTC 2010","overview":"<p>Albert Fang is both a blogger and an Internet marketer. His hometown is Albany, California, and he loves to explore all the new creative ways to make money.</p>\n\n<p>When he feels up to blog, he writes about money making, marketing, managing a business on his website, Moola Days. </p>\n\n<p>Moola Days is a blog that was created in 2009 and since then, Albert has continuously been adding informative, in-depth blog posts to his blog about all the great ways one can make money, whether it be online or offline. Albert is the original founder of the blog, Moola Days.</p>\n\n<p>Since then, Albert has been hooked onto the idea that one can make a living online and have been exploring non-stop. During his discoveries, when he feels up to it, he blogs about his findings on his blog for his fan base to benefit from. He strives to help publishers maximize their profits from their websites and much more, help people get appointed to jobs, regardless of age.</p>\n\n<p>Since the creation of his blog, he has been known to write mostly about effective ways to make money, save money, and how to utilize the web, mainly to profit from the wide-range of opportunities the web gives to everyone to this day.</p>\n\n<p>The Internet have revolutionized how businesses operate and will be the future of how businesses will conduct because it is flexible, quick, precise, and not to mention, efficient.</p>","image":{"available_sizes":[[[134,134],"assets/images/resized/0005/6525/56525v4-max-150x150.png"],[[134,134],"assets/images/resized/0005/6525/56525v4-max-250x250.png"],[[134,134],"assets/images/resized/0005/6525/56525v4-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[{"description":"Moola Days has been recognized as the 17th most influential Internet Marketing blog on the web by Junta42, a reputable blog network consisting of high quality Internet Marketing related blogs.","stoned_year":2010,"stoned_month":4,"stoned_day":9,"source_url":"http://blog.junta42.com/content_marketing_blog/2010/04/new-junta42-top-content-marketing-blogs-released-convince-and-convert-on-top.html","source_text":null,"source_description":"42 Top Marketing Blogs","stoneable_type":"Person","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"first_name":"Albert","last_name":"Fang","permalink":"albert-fang"}}],"video_embeds":[],"external_links":[],"web_presences":[]}