{"first_name":"Albert","last_name":"M. Rossini","permalink":"albert-m-rossini","crunchbase_url":"http://www.crunchbase.com/person/albert-m-rossini","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jun 13 04:47:08 UTC 2009","updated_at":"Sat Jun 13 04:58:57 UTC 2009","overview":"<p>Al has over twenty-five years of experience in multiple high technology sectors managing a diverse range of sales and marketing programs. Most recently, Al served as the Senior Vice President of Sales and Services for HSS, Inc., a healthcare software developer focused on coding, compliance, and reimbursement solutions. Al managed the revenue generation and customer retention teams to an accelerated growth period resulting in a successful company sale to the largest HMO in the U.S. Prior to HSS, Al served as SVP of Sales and Marketing for Elcom International, a software development company that launched the automated procurement market&#8217;s first remotely hosted solution. Other roles have included managing both national and international campaigns for significant industry names such as Nynex and Digital Equipment Corporation. Al has experience as a senior sales manager with several high technology startups including Axil, Inc., the designer of the industry&#8217;s first highly scalable Intel-based server. Al holds a variety of technical accreditations and numerous industry awards earned through strong sales performance.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Executive Vice President, Global Sales","firm":{"name":"Tangoe","permalink":"tangoe","type_of_entity":"company","image":{"available_sizes":[[[136,82],"assets/images/resized/0004/8337/48337v2-max-150x150.png"],[[136,82],"assets/images/resized/0004/8337/48337v2-max-250x250.png"],[[136,82],"assets/images/resized/0004/8337/48337v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}