{"first_name":"Albert","last_name":"T. Wong","permalink":"albert-t-wong","crunchbase_url":"http://www.crunchbase.com/person/albert-t-wong","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"VetAnyware","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Apr 14 05:54:24 UTC 2009","updated_at":"Fri Feb 05 20:43:00 UTC 2010","overview":"<p>Co-author of the IBM Redbook &#8220;SOA Retail Business Patterns&#8221; and co-author of several IBM DeveloperWorks best practices articles, Mr. Wong is a certified IT Architect with 10 years of experience working with Fortune 500 companies designing and implementing innovative business centric, technology focused solutions that consist of multiple hardware and software products in a technical leadership role. His background in enterprise IT solutions provides him with the ability to not only to design, implement and deploy, but also instruct, on the whole spectrum of the IT lifecycle. His ability to effectively realize proven design concepts has also furthered his experience in the procurement of customer requirements, managing relationships, project management, and technical mentorship. He has extensive knowledge and experience in 1) business process execution excellence using technology and programming language agnostic tools, 2) Java Enterprise Edition (JEE/J2EE) application development using open source frameworks and libraries 3) process/application/data integration using Service Oriented Architecture (SOA) techniques, 4) designing and deploying high volume, geographically dispersed SOA infrastructures and 5) IT architecture design, IT lifecycle management and IT Services Management using Rational Unified Process (RUP), IT Infrastructure Library (ITIL) and other industry-wide recognized methodologies. He is certified in ITIL, SOA and RUP.</p>\n\n<p>Not at work, Mr. Wong is an ACM Distinguished Speaker and was a past president of the University of California Irvine Alumni Association Information and Computer Science Chapter. He enjoys traveling all over the world, eating at local restaurants, shopping, learning about anything and everything, and donating time to worthy causes.</p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0004/9275/49275v2-max-150x150.jpg"],[[187,250],"assets/images/resized/0004/9275/49275v2-max-250x250.jpg"],[[337,450],"assets/images/resized/0004/9275/49275v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"VetAnyware","permalink":"vetanyware","type_of_entity":"company","image":{"available_sizes":[[[100,50],"assets/images/resized/0004/1096/41096v2-max-150x150.jpg"],[[100,50],"assets/images/resized/0004/1096/41096v2-max-250x250.jpg"],[[100,50],"assets/images/resized/0004/1096/41096v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"","firm":{"name":"Appliance Foundry","permalink":"appliance-foundry","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}