{"first_name":"Albert","last_name":"Subbloie","permalink":"albert-subbloie","crunchbase_url":"http://www.crunchbase.com/person/albert-subbloie","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jun 13 04:47:08 UTC 2009","updated_at":"Sat Jun 13 04:52:59 UTC 2009","overview":"<p>Recognized as a telecommunications technology and Internet pioneer, Al Subbloie brings a visionary approach to Tangoe. In 1984, after leaving Andersen Consulting, Al co-founded and served as CEO of Information Management Associates (IMA). Al was among the first to develop and market both call center voice and data solutions for integrated sales, marketing, telemarketing, and customer service activities. He guided the growth of this market leading company to more than $50M in sales, and more than 300 customers in seven offices worldwide.</p>\n\n<p>In 1997, Al co-founded Buyersedge.com, an Internet company in the field of reverse auction. Al is credited with one of the patents for reverse auction theory, the leading Internet paradigm in most shopping sites today (Ensera acquired Buyersedge.com.) Al also founded Freefire, a web enabled e-CRM customer interaction software, supporting email response, chat, and remote telephony in an ASP model involving complex data distribution requirements (Freefire was subsequently acquired by Teletech Holdings).</p>\n\n<p>Al served on the board for Acsis, Inc., the leading provider of RFID device management technology solutions (which, under Al’s leadership, was sold to Safeguard Scientific in Dec. 2005) and currently serves on the Board of NYC-based Operative Inc. Al has also served as Chairman of the Connecticut Technology Council (CTC) and now serves as a Board member for the CTC. As president and CEO of Tangoe, Al has led the vision of the company to become the leading software provider in the Telecom Expense Management (TEM) space. Prior to IMA, Al received a degree with honors in Economics from Trinity College.</p>","image":null,"degrees":[{"degree_type":"Graduate","subject":"Economics","institution":"Trinity College","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President & CEO, Founder","firm":{"name":"Tangoe","permalink":"tangoe","type_of_entity":"company","image":{"available_sizes":[[[136,82],"assets/images/resized/0004/8337/48337v2-max-150x150.png"],[[136,82],"assets/images/resized/0004/8337/48337v2-max-250x250.png"],[[136,82],"assets/images/resized/0004/8337/48337v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}