{"first_name":"Alessio","last_name":"Bonu","permalink":"alessio-bonu","crunchbase_url":"http://www.crunchbase.com/person/alessio-bonu","homepage_url":"http://it.linkedin.com/in/alessiobonu","birthplace":"Oristano","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1982,"born_month":4,"born_day":25,"tag_list":"iphone, ipad, android, gigwme, handcrafted-software, application","alias_list":null,"created_at":"Fri Feb 25 14:22:41 UTC 2011","updated_at":"Tue Mar 01 21:34:30 UTC 2011","overview":"<p>Alessio Bonu studied computer science at the University of Pisa. During his studies he learns to develop in java, c, c++ and he specialized himself in server side development using the Sun technology named Java EE.</p>\n\n<p>Thanks to this studies, Alessio Bonu began his career in Accenture S.p.a as Consultant where he works for 8 months on a Sap system(based on Oracle DBMS) that manages the business logic of a Big Services company quoted in New York. During this period, with the advent of the iPhone (the Apple&#8217;s smartphone) and with the help of some friends, he began to study mobile platforms as hobby and began to develop on this platform some application.\nAfter this experience he works for Navionics S.p.a., a company leader in marine charts, where he develops as External Consultant an iPhone application that show the cartography to the user and allow him to plan a route or take track of his travels on the boat. In the same period he began to study a new platform that was born some month before &#8220;Google Android&#8221; and try to develop some application for this platform.</p>\n\n<p>After this work ,he starts a new Experience and decided in the december of 2009 to build a startup company named HC Software S.r.l.. In the last year Alessio Bonu as HCS CEO works on the development of some applications as DraWords an iPad game and some utilities like iMetano a navigation application to find the gas station in Italy and he has planed the porting of all this applications on Android platform.</p>\n\n<p>In july 2010 Alessio Bonu attended to the apple WWDC in San Francisco where he studied the new features introduced by apple in its devices as iPhone 4 front camera, iOs Multitasking, and the new Apple advertising system named iAd.</p>\n\n<p>During the 2010 summer he began to study a new platform made by Samsung that represent a new competitor to the apple iOs.</p>\n\n<p>In june 2010 he began to work in San Francisco to Gig&amp;me project. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://it.linkedin.com/in/alessiobonu","title":"linkedin"}]}