{"first_name":"Alexander","last_name":"Olek","permalink":"alexander-olek","crunchbase_url":"http://www.crunchbase.com/person/alexander-olek","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 28 20:16:20 UTC 2009","updated_at":"Wed Jan 28 20:16:20 UTC 2009","overview":"<p>Alexander Olek is founder and also Chairman of the Advisory Board of PHORMS-Schools. Alexander&#8217;s experiences in German schools were rather frustrating. Since then he has dreamed about changing the system. He studied mathematics in Buenos Aires, Argentina, where he founded of one of South America&#8217;s first molecular diagnostics companies. He then earned his Bachelor of Science with Honours in biochemistry at the University of London and did his PhD at the Max-Planck Institute in Berlin, Germany. During 1997 and 1998, Alexander co-founded Genom Analytic GmbH in Bremen and Biopsytec in Berlin. Since founding the company in November 1998, Alexander has headed the Executive Board of Epigenomics, which he led through an IPO in 2004. Alexander was elected &#8220;Entrepeneur of the Year 2001&#8221; by Ernst &amp;Young. In 2002, he was named one of the world&#8217;s top one hundred young innovators by Technology Review, MIT&#8217;S Magazine of Innovation. Alexander is politically active, was a member of Chancellor Schroeder&#8217;s innovation council, serves on the board of directors of the German Biotechnology Association (DIB) and teaches entrepreneurship at the Humboldt University of Berlin.</p>","image":{"available_sizes":[[[96,150],"assets/images/resized/0003/5076/35076v1-max-150x150.jpg"],[[160,250],"assets/images/resized/0003/5076/35076v1-max-250x250.jpg"],[[240,373],"assets/images/resized/0003/5076/35076v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}