{"first_name":"Alex","last_name":"Berg","permalink":"alex-berg","crunchbase_url":"http://www.crunchbase.com/person/alex-berg","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue May 06 00:00:43 UTC 2008","updated_at":"Tue May 13 06:49:12 UTC 2008","overview":"<p>Alex has garnered rich experience in website design and user satisfaction throughout his career. He began at the Disney web portal Infoseek Corporation, where he held a number of key production roles. From 1996 to 1999, Alex worked on various high profile sites, such as ABC.com, NBA.com, and Oscar.com.</p>\n\n<p>In 1999, Alex moved to England where he worked at Sportal Ltd (formerly Pangolin Ltd), one of the UK’s leading sports web sites. While there, Alex hired, trained, and managed the production team for consumer content and online apparel.</p>\n\n<p>Alex then moved back to the States to work for Blue Nile, Inc, an online retailer of certified diamonds and fine jewelry. While overseeing creative services and website development, he had a considerable impact on the company. Alex was the driving force behind a dramatic increase in site conversion and sales. He also managed two major site redesigns that resulted in significant revenue gains for the company.</p>\n\n<p>Alex was then hired as Creative Director for Expedia.com. In this role, he managed the company’s editorial and design teams. After defining Expedia’s visual merchandizing strategy for a retail site experience, he led the first significant site redesign in five years.</p>\n\n<p>Alex holds a graduate certificate in Business Administration and Management from the University of Washington and a B.A. in History with an English Minor from Washington State University.</p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0001/8472/18472v1-max-150x150.jpg"],[[200,133],"assets/images/resized/0001/8472/18472v1-max-250x250.jpg"],[[200,133],"assets/images/resized/0001/8472/18472v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"VP User Experience","firm":{"name":"Wetpaint","permalink":"wetpaint","type_of_entity":"company","image":{"available_sizes":[[[150,20],"assets/images/resized/0000/3601/3601v1-max-150x150.png"],[[250,33],"assets/images/resized/0000/3601/3601v1-max-250x250.png"],[[401,54],"assets/images/resized/0000/3601/3601v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}