{"first_name":"Alexander","last_name":"Gray","permalink":"alexander-gray","crunchbase_url":"http://www.crunchbase.com/person/alexander-gray","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Feb 24 03:43:49 UTC 2012","updated_at":"Fri Feb 24 03:45:59 UTC 2012","overview":"<p>Alexander Gray received bachelor’s degrees in Applied Mathematics and Computer Science from the University of California, Berkeley and a PhD in Computer Science from Carnegie Mellon University, and is currently an Associate Professor in the College of Computing at Georgia Tech. His research group, the FASTlab, aims to comprehensively scale up all of the major practical methods of machine learning to massive datasets as well as develop new statistical methodology and theory, and has developed a number of the current fastest algorithms for several key problems.  He began working with massive scientific datasets in 1993 (long before the current fashionable talk of “big data”) at NASA’s Jet Propulsion Laboratory in its Machine Learning Systems Group.  High-profile applications of his large-scale ML algorithms have been described in staff written articles in Science and Nature, including contributions to work selected by Science as the Top Scientific Breakthrough of 2003. He has won or been nominated for a number of best paper awards in statistics and data mining and is a recipient of the National Science Foundation CAREER Award. He is a national authority on the topic of big-data machine learning, giving invited tutorial lectures on massive-scale data analysis at the top data analysis research conferences, government agencies, and corporations, and serving on the National Academy of Sciences Committee on the Analysis of Massive Data.</p>","image":null,"degrees":[{"degree_type":"Bachelor’s Degrees","subject":"Applied Mathematics and Computer Science","institution":"University of California","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CHIEF TECHNOLOGY OFFICER & CO-FOUNDER","firm":{"name":"Skytree","permalink":"skytree","type_of_entity":"company","image":{"available_sizes":[[[150,25],"assets/images/resized/0017/5675/175675v4-max-150x150.png"],[[250,42],"assets/images/resized/0017/5675/175675v4-max-250x250.png"],[[450,75],"assets/images/resized/0017/5675/175675v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}