{"first_name":"Alex","last_name":"Backer","permalink":"alex-backer","crunchbase_url":"http://www.crunchbase.com/person/alex-backer","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"QLess","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri May 14 05:44:32 UTC 2010","updated_at":"Thu Aug 30 15:29:03 UTC 2012","overview":"<p>Alex is Founder and CEO of ab|inventio, the award-winning invention factory behind QLess, Whozat and mynew.TV. ab|inventio was honored as Most Innovative Company of the Year in North America DISTINGUISHED HONOREE by the 2010 International Business Awards, alongside Salesforce.com and a handful of others.</p>\n\n<p>QLess is an award-winning wireless solution that has saved more than half a million users from more than 10 straight years standing in line at DMVs, restaurants, retail stores for Fortune 100 companies, shopping malls, doctors&#8217; offices, colleges and other locations across two continents, as featured in The New York Times, TechCrunch, CNET, Mashable, Killer Startups and many other publications  &#8211;QLess was named one of the Best Business Innovations of the year by the 2009 American Business Awards and one of the ten most promising new technology companies by Vator &amp; The Funded in a contest sponsored by Mashable, Microsoft, WSGR &amp; others, and the Best Overall Business Services Company of the Year Under 100 Employees by the American Business Awards in 2010. QLess was also featured in the first Vator.tv startup sessions video to focus on a company outside Silicon Valley.</p>\n\n<p>Whozat, The People Search Engine, was named one of the 100 hottest start-ups in the world by famed technology blog TechCrunch, a semantic search engine with machine vision that garnered tens of thousands of pageviews within a week of launch. Whozat beat Google and every other search engine tested 3 to 1 or more in results relevance in a blind people search comparison. Prof. Harry Lewis, endowed chair in CS at Harvard; former Dean of Harvard College, wrote in his blog: &#8220;Try whozat.com. I learned things about myself I didn&#8217;t know. Seriously. And now I&#8217;m checking on you.&#8221; Whozat has since launched SocialDiligence.com, pioneering the first search engine that can search based on a resume (or any document), capable of scouring the web for information related to any document, whose traffic has grown by a median 130% (average 483%) per month since launch.</p>\n\n<p>mynew.TV is still in stealth mode.</p>\n\n<p>Under Alex&#8217;s leadership, ab|inventio, the invention factory,&#8217;s companies have consistently grown their aggregate monthly revenues at a median year over year growth rate of over 500% since the launch of their first product, and count Fortune 500 companies such as Harrah&#8217;s and T-mobile as well as award-winning governments and universities among their customers.</p>\n\n<p>In 2008, Alex was appointed by the President to serve in the California Institute of Technology&#8217;s Information Sciences and Technology Board of Advisors together with a distinguished cadre of scientists, technologists and philantropists including Carver Mead and Phil Neches. In 2010, Alex was named one of &#8220;40 under 40&#8221;.</p>\n\n<p>He has held positions at McKinsey &amp; Co., the Department of Computational Biology and Evolutionary Computing at the Center for Computation, Computers, Information and Mathematics of Sandia National Labs, and the Biology Division of Caltech.</p>\n\n<p>A native of Argentina, he represented the country twice at the International Olympiads of Informatics (after being a sub for another year). Alex holds a degree in Biology and Economics from MIT, and a M.S. and Ph.D. in Computation and Neural Systems and Biologyfrom the California Institute of Technology, where he was awarded the Dean&#8217;s award for &#8220;great contributions and outstanding qualities of Leadership and Responsibility&#8221; while a Fellow at the Sloan-Swartz Center for Theoretical Neurobiology, and where he founded or co-founded the CNS Journal Club, the Da Vinci Club (including the Kitesurfing &#8216;subdivision&#8217;) and the Caltech Filmmaking Club.</p>\n\n<p>Alex speaks English, Spanish, German and French, and has been an invited speaker at numerous conferences on diverse science and technology topics around the world.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"QLess","permalink":"qless","type_of_entity":"company","image":{"available_sizes":[[[150,64],"assets/images/resized/0008/7060/87060v1-max-150x150.png"],[[231,100],"assets/images/resized/0008/7060/87060v1-max-250x250.png"],[[231,100],"assets/images/resized/0008/7060/87060v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"<iframe src=\"http://content.bitsontherun.com/players/NmUJXzm8-3qUDsq9e.html\" width=\"430\" height=\"242\" frameborder=\"0\" scrolling=\"auto\"></iframe> ","description":""}],"external_links":[],"web_presences":[]}