{"first_name":"Alexander","last_name":"Henschel","permalink":"alexander-henschel","crunchbase_url":"http://www.crunchbase.com/person/alexander-henschel","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 28 20:14:43 UTC 2009","updated_at":"Wed Jan 28 20:14:43 UTC 2009","overview":"<p>Dr Alexander Henschel is a managing director at goetzpartners Management Consultants. He is responsible for the cable, media and telecommunication industries within goetzpartners Management Consultants, as well as for the competence centers sales, marketing and customer management. He has essentially contributed to establishing goetzpartners as a leading management consultancy in this sector.</p>\n\n<p>Alexander Henschel has supported numerous large cap media companies in northern, eastern and central Europe in implementing efficient and sustainable sales and marketing strategies. He also advised and restructured a large cap German media company from near-insolvency to one of the most successful media IPOs in the German market. In addition, he has played a major role as advisor in the consolidation of the German cable market.</p>\n\n<p>Alexander Henschel is a member of the &#8220;Münchner Kreis&#8221;, a non-profit supra-national association dedicated to communications research. In particular, the organization studies human, social, economic and political problems associated with the introduction of new communication technologies.</p>","image":{"available_sizes":[[[108,150],"assets/images/resized/0003/5074/35074v1-max-150x150.jpg"],[[180,250],"assets/images/resized/0003/5074/35074v1-max-250x250.jpg"],[[240,332],"assets/images/resized/0003/5074/35074v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}