{"first_name":"Alexander","last_name":"Ervik Johnsen","permalink":"alexander-ervik-johnsen","crunchbase_url":"http://www.crunchbase.com/person/alexander-ervik-johnsen","homepage_url":"http://www.ervik.as","birthplace":"Oslo, Norway","twitter_username":"ervik","blog_url":"http://www.ervik.as","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1978,"born_month":11,"born_day":null,"tag_list":"application-virtualization, virtualization-news, citrix, vmware, microsoft, hypervisor, desktop-virtualization, virtual-desktop, vdi","alias_list":null,"created_at":"Tue Apr 07 10:52:40 UTC 2009","updated_at":"Sun Mar 28 23:37:55 UTC 2010","overview":"<p>Alexander Ervik Johnsen is a Senior Solution Architect, Technology Evangelist, Author and Speaker, based in Oslo - Norway. Alexander has been working with Microsoft and Citrix products since 1997 as a system administrator, consultant, and senior consultant. I now work as a pre-sales for the Citrix VAD Reseller, ArrowECS in Norway as a Product Manager Citrix / Senior Solution Architect. I primarily work as a pre-sale and travel around Norway evangelisting Citrix, Virtualization, Thin clients and 3 party solutions.</p>\n\n<p>In previous jobs he worked with both small and large scale Citrix and Application Delivery implementations, both in Norway and Europe.\nAlexander is also a speaker, speaking mostly at Norwegian events. Such as Virtualpower, Citrix User Group Norway and Roadshows across Norway. Alexander is also the author of The GiDWiM Guide, an in depth analysis of Application Packaging,Application Streaming and Distribution. Download it from www.ervik.as or www.dabcc.com</p>\n\n<p>The GIDWIM Guide all started out as a documentation on how to work with applications and re-package them in a Citrix/TS environment. The name GIDWIM appeared about 3 years ago, when I found out the Go In-Depth with Installation Manager &amp; Msi was to long a product name. So I switched it to something short and easy to remember.</p>\n\n<p>In May 2008, I was awarded Citrix Technology Professional (CTP), which is a true honor for me, since Citrix and Application Delivery is my big passion in this industry.\nHere is my CTP Awardee page.</p>","image":{"available_sizes":[[[100,137],"assets/images/resized/0004/0480/40480v2-max-150x150.jpg"],[[100,137],"assets/images/resized/0004/0480/40480v2-max-250x250.jpg"],[[100,137],"assets/images/resized/0004/0480/40480v2-max-450x450.jpg"]],"attribution":"<p>Alexander Ervik Johnsen / <a href=\"http://www.ervik.as\" title=\"Ervik.as\" rel=\"nofollow\">Ervik.as</a></p>"},"degrees":[{"degree_type":"Information Technology","subject":"Information Technology","institution":"NITH","graduated_year":1999,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.dabcc.com/downloadfile.aspx?id=250","title":"The GiDWiM Guide"}],"web_presences":[{"external_url":"http://www.twitter.com/ervik","title":""}]}