{"first_name":"Alex","last_name":"Isayko","permalink":"alex-isayko","crunchbase_url":"http://www.crunchbase.com/person/alex-isayko","homepage_url":"http://alex-isayko.name","birthplace":"","twitter_username":"aisayko","blog_url":"http://alex-isayko.name/blog/","blog_feed_url":"http://aisay.org/blog/feeds/latest/","affiliation_name":"Unaffiliated","born_year":1984,"born_month":11,"born_day":26,"tag_list":"web-development, portfolio, resume, create-site, personal-website, developer-blog, python-developer, django-developer, jquery-developer, nice-ui, user-interface, nice-site, useful-navigation, web-developer, freelance-developer, developer-services, web-pro","alias_list":null,"created_at":"Thu May 13 16:00:22 UTC 2010","updated_at":"Fri Jan 13 09:37:56 UTC 2012","overview":"<p>Experienced (more than 5 years old) developer in Python/Django. Have exelent skills in building UI with JQuery, Html and CSS.</p>\n\n<p>Competencies:\n1) Professionalism\nA professional approach to the stages of the development process. Precise adherence to coding standarts such as PEP8 and W3C. Supports all modern browsers. Analytical approach to problem solving.\n2) Creativity\nCreative ability in programming. Willingness to create a fundamentally new ideas. Flexibility, originality, ability to see the essence of the problem, the ability to resist stereotypes. Options for improving existing solutions. Brainstorming.\n3) Organized\nAbility to clearly define goals, set priorities and effectively use work time. Accounting for possible potential obstacles. Work performance in the planned terms. Using project management systems such as Trac and Unfuddle.\n4) Decency\nPerformance of the obligations. Tactfulness in communication. Politeness. Courtesy. Nondisclosure of the information on the project and not distribution of initial codes in mercenary or other purposes.</p>","image":{"available_sizes":[[[150,148],"assets/images/resized/0008/7045/87045v2-max-150x150.jpg"],[[250,246],"assets/images/resized/0008/7045/87045v2-max-250x250.jpg"],[[450,444],"assets/images/resized/0008/7045/87045v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://aisay.org","title":"Personal website"}],"web_presences":[]}