{"first_name":"Alex","last_name":"Kombos","permalink":"alex-kombos","crunchbase_url":"http://www.crunchbase.com/person/alex-kombos","homepage_url":"","birthplace":"New York, NY","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Mar 07 22:14:43 UTC 2010","updated_at":"Wed Sep 14 13:56:39 UTC 2011","overview":"<p>Alex Kombos is a serial entrepreneur of online businesses.</p>\n\n<p>Alex Kombos was born in NY but moved to Greece at a young age and grew up in Athens.  At 18 years old he went back to NY to attend college. While studying at NYU, Mr. Kombos started working in NYC with the then small start ups like Yahoo, AOL, Netnames (now part of Verisign), EuroRSCG, Grey Advertising  in the online marketing, business development and deal making for online services.</p>\n\n<p>In 1998 at 25 years old Mr. Kombos  started an internet company – Entropia  Inc. and Ideal Entropia SA serving the Greek online space as a search engine and portal for Greeks called iBoom Network. The company expanded very quickly within 1 year with location in NY, Chicago, Boston, Montreal, London and Athens. Entropia  was acquired by Ideal Group SA. a Technlogy Group part of a UK conglomerate.</p>\n\n<p>In 2001 and after 3 years of managing Entropia Mr. Kombos setup a marketing management company which was serving online marketing integration for fortune 500 companies in NYC. Client of Digital Republique included JP Morgan Chase, Wyeth Pharmaceuticals, Match.com amongst others. Parallel to that, In 2003 Alex founded in NYC , Greased Networks and mpGreek which was the first digital music downloads service for Greece.  With the biggest online catalog and the most digital services Greased Networks  signed contracts and affiliations with all major multinational and local record labels Europe  including SonyBMG, Universal, Warner Music, EMI. Soon after it expanded in 5 different countries for music and online gaming. Greased Networks was sold to Internet Q group in early 2009.</p>\n\n<p>In 2010 Mr. Kombos  is focused on his 4th startup which is EventNow an online services which will revolutionalize how people search and book local service providers for events and parties. It will be serving an industry that grosses more than 120 billion a year. EventNow is launched in early 2010.</p>","image":{"available_sizes":[[[110,150],"assets/images/resized/0007/9375/79375v4-max-150x150.jpg"],[[183,250],"assets/images/resized/0007/9375/79375v4-max-250x250.jpg"],[[330,450],"assets/images/resized/0007/9375/79375v4-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BS","subject":"Marketing Advertising and International Business","institution":"NYU","graduated_year":1997,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"International Business and Digital Economy Initiative ","institution":"NYU","graduated_year":2004,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"","firm":{"name":"EventNow","permalink":"eventnow","type_of_entity":"company","image":{"available_sizes":[[[150,86],"assets/images/resized/0009/2654/92654v2-max-150x150.jpg"],[[250,144],"assets/images/resized/0009/2654/92654v2-max-250x250.jpg"],[[300,173],"assets/images/resized/0009/2654/92654v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}