{"first_name":"Alex","last_name":"Eckelberry","permalink":"alex-eckelberry","crunchbase_url":"http://www.crunchbase.com/person/alex-eckelberry","homepage_url":"http://www.eckelberry.com","birthplace":"Paris, France","twitter_username":"alexeck","blog_url":"","blog_feed_url":"","affiliation_name":"Bulldog Capital Management","born_year":1966,"born_month":10,"born_day":22,"tag_list":"","alias_list":null,"created_at":"Fri Mar 27 15:26:18 UTC 2009","updated_at":"Sun Nov 13 00:17:24 UTC 2011","overview":"<p>Alex Eckelberry is an American entrepreneur and technology executive. Most recently, he was president of the security business unit for GFI Software. Previously he was CEO of Sunbelt Software for eight years up to the sale of Sunbelt Software to GFI. While at Sunbelt Software, he was responsible for the development and introduction of a number of security and IT infrastructure products targeted primarily at the business market, including iHateSpam, ServerVision, iHateSpam for Exchange, LanHound, Ninja Email Security, CounterSpy and CounterSpy Enterprise, and VIPRE antivirus. In addition, he also acquired the Kerio firewall technology from Kerio Technologies, Inc., incorporating parts of the technology into VIPRE Premium (now VIPRE Internet Security).</p>\n\n<p>Eckelberry worked in technology throughout the late 80s and 90s. He started his career at Borland International in 1987, and then went to Aegis Development (acquired by Oxxi). Later, he worked at Quarterdeck Corporation for nearly seven years, where he worked in a variety of roles, including VP of World Wide Marketing and VP and General Manager, Utilities Business Unit. While he was a business unit manager, he oversaw development of a number of well-known products, including CleanSweep, DESQview and QEMM.</p>\n\n<p>After Quarterdeck, he went to startup Mijenix, Inc., where he was executive vice president, up to its sale to Kroll Ontrack. While at Mijenix, he was responsible for the launch of a number of PC utility products, including Fix-It Utilities, ZipMagic and FreeSpace.</p>\n\n<p>Between 1999 and 2002, Eckelberry was a managing director at Bulldog Capital Management, an investment management firm, where he managed the firm&#8217;s private equity portfolio and investments. While at Bulldog, he invested in a wide range of companies, including YouCentric (acquired by JD Edwards), Vina Technologies (which subsequently went public), Acta Technology (acquired by Business Object), Yesmail.com (acquired by CMGI), VitalStream (acquired by Internap), Tsqware (acquired by Globespan), AuctionWatch (now Vendio), ACHEX (acquired by First Data), MessageClick (acquired by Verso Technologies), Webalo and Questia.</p>\n\n<p>Julie Amero Case: Eckelberry was instrumental in getting a major conviction overturned against a substitute school teacher in Connecticut. In January 5th, 2007, Julie Amero, a substitute school teacher in Norwich, CT, was sentenced to four felony counts for endangering the morals of a child. After Eckelberry learned of the case, he made it a national cause célèbre by writing extensively about it on his blog, resulting in press on Good Morning America, USA Today, FoxNews, National Public Radio, as well as a broad range of tech publications.</p>\n\n<p>Through a friendship with Ari Schwartz (then director of the Center for Democracy and Technology) and with the help of security research Eric Howes, pro bono legal assistance was ultimately found for Amero, and ultimately the case was overturned. In addition, Eckelberry led a team of forensic researchers to publish a forensic analysis of the trial transcript. Ultimately, Amero plead to a minor misdemeanor charge. His experience with the Amero case led him to found the Julie Group, a non-profit group dedicated to assisting in injustices at the intersection of technology and law.</p>\n\n<p>Eckelberry is extensively involved with the security industry and has been blogging and writing about the industry for a number of years. In 2006, he launched the first all-volunteer phishing takedown service, PIRT, with Paul Laudanski of CastleCops. In 2008, he gave the keynote address at the worldwide Virus Bulletin conference [29] and has written several articles for Virus Bulletin magazine – on ethics in the antivirus industry and on using Google to find vulnerabilities in websites. Google publicly recognized his efforts in 2006, along with a number of other security researchers for their assistance with Google security.</p>\n\n<p>Environmental Activism: Eckelberry founded the Tampa Bay Conservation League, which supports environmental causes in the southeastern United States. While his focus is in the US, he was recently responsible for documenting environmental hazards at Gatwick Airport in London, leading to a re-assessment of the storage of lead-acid batteries. In addition, he was instrumental in the recall of 1.5 million children&#8217;s toy fishing poles due to unacceptably high levels of lead paint.</p>\n\n<p>Miscellaneous</p>\n\n<p>Eckelberry was born in Paris, France to Tener Riggs Eckelberry, a recipient of the French Chevalier of the Légion d&#8217;Honneur, and artist Renee Duke. He is related to the actress Karen Black, through his brother, film director Stephen Eckelberry. Other brothers include Riggs Eckelberry,  CEO of publicly-traded Origin Oil; Marc Eckelberry, CEO of Aheadofthenews.com, a site for active equity traders; and the architect Anthony Eckelberry.  </p>","image":{"available_sizes":[[[115,131],"assets/images/resized/0006/7172/67172v2-max-150x150.jpg"],[[115,131],"assets/images/resized/0006/7172/67172v2-max-250x250.jpg"],[[115,131],"assets/images/resized/0006/7172/67172v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"","subject":"","institution":"Eckerd College","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"Sunbelt Software","permalink":"sunbelt-software","type_of_entity":"company","image":{"available_sizes":[[[150,35],"assets/images/resized/0009/3232/93232v1-max-150x150.png"],[[250,58],"assets/images/resized/0009/3232/93232v1-max-250x250.png"],[[311,73],"assets/images/resized/0009/3232/93232v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Executive Vice President","firm":{"name":"Mijenix","permalink":"mijenix","type_of_entity":"company","image":null}},{"is_past":true,"title":"Managing Director","firm":{"name":"Bulldog Capital Management","permalink":"bulldog-capital-management","type_of_entity":"company","image":null}},{"is_past":true,"title":"VP, Utilities Business Unit","firm":{"name":"Quarterdeck","permalink":"quarterdeck","type_of_entity":"company","image":null}},{"is_past":true,"title":"Channel development","firm":{"name":"Borland","permalink":"borland","type_of_entity":"company","image":{"available_sizes":[[[135,64],"assets/images/resized/0002/2599/22599v1-max-150x150.png"],[[135,64],"assets/images/resized/0002/2599/22599v1-max-250x250.png"],[[135,64],"assets/images/resized/0002/2599/22599v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"President, Security ","firm":{"name":"GFI Software","permalink":"gfi","type_of_entity":"company","image":{"available_sizes":[[[93,60],"assets/images/resized/0009/0493/90493v7-max-150x150.png"],[[93,60],"assets/images/resized/0009/0493/90493v7-max-250x250.png"],[[93,60],"assets/images/resized/0009/0493/90493v7-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Director of Sales","firm":{"name":"Aegis Development","permalink":"aegis-development","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.eckelberry.com","title":"Personal website"},{"external_url":"http://www.conservetampabay.org","title":""},{"external_url":"http://www.linkedin.com/in/alexeck","title":""},{"external_url":"http://www.twitter.com/alexeck","title":""},{"external_url":"https://plus.google.com/106842880916753966212/posts","title":"Google Plus"},{"external_url":"http://www.eckelberry.com","title":"Personal website"},{"external_url":"http://www.conservetampabay.org","title":""},{"external_url":"http://www.linkedin.com/in/alexeck","title":""},{"external_url":"http://www.twitter.com/alexeck","title":""},{"external_url":"https://plus.google.com/106842880916753966212/posts","title":"Google Plus"}]}