{"first_name":"Alex DJ","last_name":"Smith","permalink":"alex-dj-smith","crunchbase_url":"http://www.crunchbase.com/person/alex-dj-smith","homepage_url":"http://www.harrisonsfund.com/","birthplace":"","twitter_username":"smithadj","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Apr 24 09:59:05 UTC 2012","updated_at":"Mon Apr 30 01:33:23 UTC 2012","overview":"<p>I work for a breakfast company, am married with two kids and love golf and supporting my sports teams but my passion and what I’m really trying to do is save my son’s life. He has Duchenne Muscular Dystrophy, a 100% fatal genetic condition with no cure and no treatment. It is the biggest genetic killer of children on the planet&#8230; so I started and am CEO of Harrison’s fund. </p>\n\n<p>I’m trying to save the lives of boys with Duchenne by raising enough money to fund promising research. I’m not a doctor but what I really can do is raise a lot of money in the 10 years we have to fix this.</p>\n\n<p>If you’ve got Duchenne, you can’t produce dystrophin, a protein you need to build up your muscles and as a result every muscle in the body deteriorates. \nMost kids with it die in their late teens or early twenties, are usually in a wheelchair by the age of 12 and It leads to respiratory failure, heart failure, and other debilitating complications.</p>\n\n<p>One in 3,500 boys is born with it, and in the UK 2,500 kids has it at the moment. You can have it, no matter where you are or what your ethnic background is. A third of all cases start in the womb, with no warning before the baby is born.</p>\n\n<p>I’m going to raise a £1M this year and am asking foundations, companies and individuals to go on our website and press the big orange button and pledge their support. If you’re just interested in giving a helping hand please get in touch and If nothing else please ‘like’ our facebook  page and ‘share’ it with your friends.</p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0018/5656/185656v3-max-150x150.jpg"],[[250,166],"assets/images/resized/0018/5656/185656v3-max-250x250.jpg"],[[450,299],"assets/images/resized/0018/5656/185656v3-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}