{"first_name":"Alexander","last_name":"Berveno","permalink":"alexander-berveno","crunchbase_url":"http://www.crunchbase.com/person/alexander-berveno","homepage_url":"http://www.sorbkuz.ru/","birthplace":"Russia","twitter_username":"BERVENO","blog_url":"http://www.facebook.com/profile.php?id=1038904164","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1987,"born_month":11,"born_day":14,"tag_list":"","alias_list":null,"created_at":"Mon Dec 03 16:44:31 UTC 2012","updated_at":"Wed Dec 05 08:03:34 UTC 2012","overview":"<p>Education: \nKemerovo State University, Kemerovo, Russia, diploma chemist-researcher (2005-2010). Post-graduate training 2 years of the Institute of Coal Chemistry and Material Science Siberian Branch of Russian Academy of Sciences.</p>\n\n<p>Additional education:\nHigh School Innovators, business planning and marketing (2011)\nInternational Institute for Management of business associations, business planning (2011)\nMoscow Academy of Business, MBA, 1 semester, managment organization (2010)\nMoscow State University, «Correspondence school of Nanotechnology» (2010)\nTraining Community Innovators Russia «Futurussia» at the Foundation «Skolkovo» (2010)\nGraduate School of Business at Tomsk State University, management (2009) \nTraining Community Business Angels of Russia, managment (2009)\nTraining of the Russian Venture Company, Open Innovation University a Media Holding «Expert» (2009-2011)\nAlso I successfully passed an educational program in the field of innovative entrepreneurship of the International Youth Innovative Forum &#8220;Interra-2011&#8221; and &#8220;Interra-2009&#8221;, of the All-Russia youth educational forum «Seliger-2011», «Seliger-2010» and «Seliger-2009», All-Russia Innovative Convention (2009, 2010, 2011).</p>\n\n<p>Position: \nEngineer at the Laboratory of Carbon nanomaterials ICCM SB RAS \nFounder and CEO «Sorbents of Kuzbass» company \nFounder and CEO of the International Center for Carbon Technologies and New Materials\nInvestment adviser JSC «Kuzbass technopark»\nDuties and responsibilities: \nTotal project management – setting goals and objectives, the organization of research and production work on the project – recruitment and training. Drawing up and organizing the production plan and control the work. Promotion of the project, negotiations with potential customers and clients, working with investors and suppliers, investment consulting. To present innovations projects at the exhibitions and forums. Development presentations, business plans, marketing plans and development strategy for company «Sorbents of Kuzbass».</p>\n\n<p>Work Experience:\nExperience on the project for over 8 years. There is experience in managing R&amp;D:</p>\n\n<ol>\n<li>&#8220;Creating a scientific basis for obtaining the CMS from coal raw materials&#8221; the contract with the Foundation for the Advancement of the project № 7961,winner of the 2008 UMNIK.</li>\n<li>&#8220;Creating a carbon molecular sieve&#8221;, an agreement with the SC &#8220;RUSNANO&#8221; (№ 1404/1) 2010 2011.</li>\n<li>&#8220;Development of technology for manufacturing of sorbents from coals of Kuzbass&#8221; contract with the Foundation for Advancement, winner of the &#8220;START&#8221; in 2011 (№ 9130r/14904).</li>\n<li>Grant of &#8220;Technologies of Youth&#8221; for R &amp; D project &#8220;Development and introduction of carbon molecular sieve&#8221;, № agreement 2502, 2010</li>\n<li>&#8220;Carbon Sorbents&#8221;, grant the governor of the Kemerovo region of 15 million rubles.\nIn 2010 I founded my own company &#8220;Kuzbass Sorbents&#8221; for Fund program &#8220;START&#8221;.\nWith the participation of the applicant received a grant to conduct research on the project &#8220;Development of a method of generating new nanoporous carbon materials from coal for use as substrates for supercapacitors, batteries and fuel cells,&#8221; the contract with the Foundation for Promotion of Small Enterprises in Science and Technology, the program has U.M.N.I.K. - Project number 2105. Project Manager - Executive Director of &#8220;Sorbents Kuzbass&#8221; Kashirskich E.V.\nDuring 4 years of the project is presented at leading international conferences: Carbon (Korea, 2005; England, 2007; Japan, 2008; France, 2009; China, 2011, Poland 2012); CESEP, Poland, 2007; Nanotech Conferences, USA, 2010.</li>\n</ol>\n\n<p>Achievements: \nFinalist Competition of Russian Innovations 2010, finalist of BIT Siberia 2011 and BIT Soberia 2012, HSE-10 2011. Finalist Tehnovatsy Cup 2009, Formula of Success 2009, Award semifinalist Zvorykin 2009-2011, in the category &#8220;Energy efficiency&#8221;, the student open competition Russian Ministry of Education 2010. I am winner the All-Russia olympiad in nanotechnology in 2010, held at Moscow State University.</p>\n\n<p>Awards: Medal «65 years of the Kemerovo region», a letter of thanks Governor Kemerovo region; medal «Laureate of the Kuzbass», a medal «For the faith and goodness».\nProject work: I have met and presented my projects to Russian President Dmitry Medvedev and Russian Prime Minister Vladimir Putin in 2009 years. Also, I have presented my projects to the Minister of Education and Science Minister Andrei Fursenko, Minister of Communications Igor Shchegolev, Minister of Sport, Tourism and Youth Policy Vitaly Mutko, Russian presidential aide Arkady Dvorkovich. The &#8220;International Centre for Carbon Technology&#8221; approved by the governor of the Kemerovo region, and was presented to the management fund &#8220;Skolkovo&#8221; public corporation &#8220;RUSNANO&#8221; and the leadership of the largest corporations in Russia. A search for international investors and renowned scientists who are interested in the project.\nPolitics: In 2009 I was appointed head of the Staff of the Year of Youth in Kemerovo and head Zvorykinsky project in the Kemerovo region - a priority of the Federal Agency for Youth &#8220;Rosmolodezh.&#8221; In 2010 I was included in the Talent Pool Party &#8220;United Russia&#8221;.  In autumn 2010, I was trained in the &#8220;Russian School of  Politics&#8221; at the State Duma of the Russian Federation.\nSince 2011, I am a member of the Expert Council under the Plenipotentiary Representative of RF President in the Siberian Federal District Tolokonsky V.A. Also, I Chairman of Kemerovo branch of inter-regional public organization &#8220;Siberian Expert Center &#8220;Modernization&#8221;.\nIn 2011 on the orders of the governor, I was included in the Regional Personnel reserve managerial personnel of the Kemerovo region. Then I entered the United People&#8217;s Front, headed by Prime Minister Vladimir Putin. Later, I joined the party &#8220;United Russia&#8221;, which I put forward in the autumn as a candidate for the State Duma RF on the inner-vote, which I have successfully made (entered in the top 20).\nIn 2012 I was included in the regional headquarters to support a candidate for President of the Russian Federation Vladimir Putin, for the activity is thanked by the governor. I have the support of politicians in Moscow. Maybe I will plan to become a member of the Regional Council of People&#8217;s Deputies of the Kemerovo region in 2014 year.\nSkills Profile: </p>\n\n<ul>\n<li>Languages: Russian – native, English – intermediate.</li>\n<li>Computers: Internet, Microsoft Office (Word, Excel, Power Point, Project), Project Expert, Chemlab Cambrige soft – MOPAC, Chemdraw, Chem3D, Gaussian, Monte-Carlo, Hyperchem.</li>\n<li>Hobbies: Among my hobbies I can name dancing and reading. Also I like play the guitar, accordion and piano. I play soccer, basketball, jogging and skiing.</li>\n<li>Interests: New technologies, nanomaterials, nanotechnology, carbon molecular sieves, adsorption, pressure swing adsorption, porous carbons, carbon fiber, sorbents, computer modeling of chemical processes, coal, ecology. The funds, investments, analysis and examination of projects, analytical research, business planning, raising finance, marketing and patent research, search for business partners, project management, organization and of outputs and project competitions, PR and GR, preparing and making presentations, handouts at exhibitions, analysis of markets, business training. Interaction with Skolkovo, RUSNANO, technology parks and nanocenters, international cooperation.</li>\n</ul>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}