{"first_name":"Alex","last_name":"Crisses","permalink":"alex-crisses","crunchbase_url":"http://www.crunchbase.com/person/alex-crisses","homepage_url":"http://www.insightpartners.com/","birthplace":"USA","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Nov 19 07:04:41 UTC 2010","updated_at":"Tue Nov 23 14:50:35 UTC 2010","overview":"<p>Alex Crisses is a Principal at Insight Venture Partners which he joined in 2002. Prior to joining Insight, Alex was an Investment Banking Analyst with Credit Suisse First Boston’s Global Energy and Power Group based in New York. Alex graduated from the Wharton School of Business with a BS in Economic and  received the Dean’s Award For Excellence, The Wharton School’s Highest Honor. He received his MBA from The Harvard Business School where he graduated with High Distinction and was named a George F. Baker Scholar. </p>\n\n<p>Since joining Insight, Alex has led many of the firm’s investments in infrastructure software and online gaming companies, including the firm’s investment in Solarwinds (Nasdaq: SWI) which was one of the best performing technology IPOs of 2009. Alex has also participated in three investments which have been acquired (ScriptLogic Corporation, Aelita Software &amp; Imceda Software). </p>\n\n<p>Alex’s current investments include:</p>\n\n<ul>\n<li>6 Waves – a leading international publisher of gaming applications on the Facebook platform\n*Acronis – provider of storage management solutions that enable disaster recovery as well as backup and restore</li>\n<li>GFI – a leading provider of network security, content security, and messaging software</li>\n<li>Jagex – developer and publisher of online games include RuneScape one of the world’s largest Massive Multiplayer Online Games</li>\n<li>Parallels – provider of virtualization and automation software that optimizes computing for consumers and enterprises </li>\n<li>Teamviewer – provider of remote access software which allows IT Professionals to provide remote support over the web</li>\n<li>Ticket Monster – Korea’s largest provider of daily deals and strategic lead generation for local businesses</li>\n</ul>\n\n<p>Outside of his role at Insight Alex has participated in several charitable organizations. He was the Director of Fundraising and Financial Development for Minds Matter a New York Based Charity which provides tutoring and financial add for underprivileged High School Students in the New York area. Alex also served on the Young Professionals Development Committee for the New York City Police Foundation which is the only private organization authorized to raise funds for the benefit of the New York City Police Department. He has also been involved in fundraising for the Sergeant’s Benevolent Association of the New York City Police Department as well as the Make-A-Wish Foundation. Alex was also the Chairman of the Venture Capital &amp; Private Equity Conference at Harvard Business School where he was also a member of the Entrepreneurship Club.  </p>","image":{"available_sizes":[[[119,150],"assets/images/resized/0011/1175/111175v2-max-150x150.jpg"],[[119,150],"assets/images/resized/0011/1175/111175v2-max-250x250.jpg"],[[119,150],"assets/images/resized/0011/1175/111175v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/profile/view?id=319282&authType=NAME_SEARCH&authToken=ISYU&locale=en_US&srchid=1d81c9bf-61ff-4034-af59-f7c83f684a05-0&srchindex=1&srchtotal=3&pvs=ps&pohelp=&goback=.fps_*1_Alex_Crisses_*1_*1_*1_*1_*51_*1_Y_*1_*1_*1_false_1_R_true_G","title":"LinkedIn"}]}