{"first_name":"Alex","last_name":"Godelman","permalink":"alex-godelman","crunchbase_url":"http://www.crunchbase.com/person/alex-godelman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Evolve Media","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Oct 24 15:51:26 UTC 2011","updated_at":"Sat Oct 29 01:21:24 UTC 2011","overview":"<p>Alex Godelman is Chief Technology Officer of Evolve Media Corp, a unique media company unparalleled in its ability to offer brands a complete solution to online advertising. Evolve Media Corp is an integrated digital media company focused on vertical publishing, advertising sales and marketing services for its clients.  Evolve’s mission is to produce and monetize premium digital content, offering programs and technologies to online marketers that deliver Content, Context and Creative with Scale.  Evolve is comprised of three primary divisions - AtomicOnline (online publishing), Gorilla Nation Media (publisher related technology and vertical sales and marketing services) and SpringBoard Video (video CMS, analytics and player.)\nAlex first broke into the world of Internet technology over a decade ago when he joined, as Executive Director of Technology, Time Warner’s B3 Corp division - at the time, an industry-leading e-solutions business provider of a hosted, fully integrated end-to-end commerce platform featuring storebuilder, shopping cart, payments gateway and e-wallet capabilities.  Most recently, he was a part of the senior management team at Shopzilla, the world leader in comparison shopping search; CIO at Diskeeper Corporation, a leading software manufacturer; Senior Director of IS&amp;T for the Maxis division of Electronic Arts, makers of Sims Online. Prior to these, he also served as CIO of Otis College and Director of Technology for WoltersKluwers, responsible for delivery of their two largest online brands, GlobalFx and CompleTax.  Alex is very active in Internet technology and Agile communities and serves on the board of advisors of several technology companies.  He has recently been awarded the 2010 CIO Rock Star Award from Los Angeles chapter of TechExecs.  Alex is certified in Lean and Scrum (Certified Scrum Master, Professional and Product Owner) and holds a graduate degree in Computer Science and Applied Mathematics from Universitatea de Stat din Moldova.   Alex is happy to have called SoCal home for the past 23 years.  He currently resides in Los Angeles area with his wife and children.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0015/9944/159944v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0015/9944/159944v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0015/9944/159944v2-max-450x450.jpg"]],"attribution":"<p>Alex Godelman</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Technology Officer","firm":{"name":"Evolve Media Corp.","permalink":"evolve-media-corp","type_of_entity":"company","image":{"available_sizes":[[[150,22],"assets/images/resized/0010/8207/108207v5-max-150x150.jpg"],[[250,37],"assets/images/resized/0010/8207/108207v5-max-250x250.jpg"],[[450,66],"assets/images/resized/0010/8207/108207v5-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Chief Technology Officer","firm":{"name":"Gorilla Nation Media","permalink":"gorilla-nation-media","type_of_entity":"company","image":{"available_sizes":[[[125,38],"assets/images/resized/0001/2437/12437v1-max-150x150.png"],[[125,38],"assets/images/resized/0001/2437/12437v1-max-250x250.png"],[[125,38],"assets/images/resized/0001/2437/12437v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/alexanderjgodelman","title":"LinkedIn "},{"external_url":"http://www.scrumalliance.org/profiles/27381-alex-godelman","title":"Scrum Alliance "}]}