{"first_name":"Alex","last_name":"Barkas","permalink":"alex-barkas","crunchbase_url":"http://www.crunchbase.com/person/alex-barkas","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jun 03 09:48:54 UTC 2009","updated_at":"Wed Jun 03 09:55:46 UTC 2009","overview":"<p>Alex is a Managing Director of all the Prospect Venture Partners Funds beginning in 1997. Previously, Alex was a Partner at Kleiner Perkins Caufield &amp; Byers (KPCB) from 1991 to 1997 where he focused on health care product company investments in the drug, device, and diagnostic sectors. Additionally, during his tenure at KPCB, Alex served as the founding CEO of two pioneering biotechnology companies, Geron (NASDAQ:GERN) and Connective Therapeutics, which became Connetics, a NASDAQ listed specialty pharmaceutical company. For both of these companies, Alex worked with the scientific founders to develop the companies&#8217; initial business plans, in-license key enabling technology and products, recruit world class scientific talent and advisory board members, secure significant milestone-driven venture financing, and recruit experienced senior executive management teams.</p>\n\n<p>Prior to KPCB, Alex was a founder and CEO of BioBridge Associates, a health care industry consulting firm from 1989 to 1991. From 1987 to 1989, he served as the Director of Technology Development at Advanced Biosearch Associates, a regulatory affairs advisory firm where he focused on medical product commercialization and medical device regulatory strategy. Alex&#8217;s research experience was gained at Memorial Sloan Kettering Cancer Center, the Genetics Department at the Toronto Hospital for Sick Children, the Whitehead Institute at MIT, and Duke University.</p>\n\n<p>Alex is currently Chairman of the Board of Geron (NASDAQ: GERN) and serves or has served on the Board of Directors of Amicus (NASDAQ: FOLD), Archemix, Connetics (now Stiefel Laboratories, Inc.), Complete Genomics, Inc., NeoMend, Novacept (now NASDAQ: HOLX), SurgRx (now NYSE: JNJ), Tercica, (now Paris: IPN), Topica Pharmaceuticals, Transave, Verus Pharmaceuticals, Zelos Therapeutics and several other privately held companies.</p>","image":{"available_sizes":[[[121,150],"assets/images/resized/0004/6461/46461v1-max-150x150.jpg"],[[151,187],"assets/images/resized/0004/6461/46461v1-max-250x250.jpg"],[[151,187],"assets/images/resized/0004/6461/46461v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Ph.D.","subject":"Biology","institution":"New York University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Prospect Venture Partners","permalink":"prospect-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,81],"assets/images/resized/0003/4207/34207v1-max-150x150.png"],[[195,106],"assets/images/resized/0003/4207/34207v1-max-250x250.png"],[[195,106],"assets/images/resized/0003/4207/34207v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}