{"first_name":"Alex","last_name":"Godelman","permalink":"alex-godelman-2","crunchbase_url":"http://www.crunchbase.com/person/alex-godelman-2","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Oct 25 01:00:29 UTC 2011","updated_at":"Mon Oct 31 02:49:31 UTC 2011","overview":"<p>Alex Godelman serves as the Chief Technology Officer of Gorilla Nation Media and Evolve Media Corp. Alex provides nearly 20 years of executive management experience in ecommerce, commercial software development, and online media and entertainment. He has a proven track record in formulating and executing technology and service delivery plans for rapidly growing internet brands and other high tech companies. Alex joined Gorilla Nation / Evolve family from Shopzilla, the world leader in comparison shopping search, where he served in a variety of key leadership roles. Prior to that, Alex was a CIO at Diskeeper Corporation, a leading software manufacturer; Executive Director of Technology for the B3 division of Time Warner, responsible for numerous TW and WEA music labels; Senior Director of IS&amp;T for the Maxis division of Electronic Arts, makers of Sims Online. Prior to these, he also served as CIO of Otis College and Director of Technology for WoltersKluwers, responsible for delivery of their two largest online brands, GlobalFx and CompleTax. Alex is very active in Agile and web communities and serves on the board of advisors of several technology companies.  He also serves as CIO Chapter Co-Chair for the Los Angeles Chapter of Tech Execs organization.  He is a Certified Scrum Professional, Master and Product Owner and and holds a graduate degree in Computer Science and Applied Mathematics from Universitatea de Stat din Moldova.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0015/9433/159433v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0015/9433/159433v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0015/9433/159433v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}