{"first_name":"Alfredo","last_name":"Romeo","permalink":"alfredo-romeo","crunchbase_url":"http://www.crunchbase.com/person/alfredo-romeo","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Ciudad 2020","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jun 24 22:45:26 UTC 2011","updated_at":"Mon Jun 27 03:53:54 UTC 2011","overview":"<p>Between 1997 and 2000, I thought on financial terms, working in a mid-sized successful bank in Saint Louis.</p>\n\n<p>Back to Spain, I founded and leaded a digital music business aimed to offer a digital content platform mainly for venues and bars. We were probably 10 years ahead, as Spotify proved it in 2009.</p>\n\n<p>Since 2001, I have been studying the social and economical consecuences of IT implementation across all type of industries, seeing in the open source / free software communities the very first sample of an industry shaked by new social trends. This knowledge took me to write the first book written in Spanish on the digital revolution and free software coming up: La Pastilla Roja</p>\n\n<p>Since 2003, I have working on the Internet of things and its relation with industries like tourism, smart cities, content creation or poker, just to name a few, in topics like &#8220;everything is measurable&#8221;; &#8220;the power of many&#8221;; reputation systems and recommendations and so on, issues outlined in La Pastilla Roja.</p>\n\n<p>One of the milestones reached was to design and develop, a touristic electric rent-a-car business aimed to visit cities in a sustainable, comfortable and assisted way. We were awarded with quite a few prizes and mentions around the world</p>\n\n<p>I have also promoted, designed and developed local communities to generate local content in a collaborative way. Since 2005, those communities have created more than 80.000 local and free articles in less than 5 years in cities like Cordoba, Madrid or Andalucia</p>\n\n<p>Since 2006, I have been thinking, prototyping, designing and sometimes developing, business models around open data, such as City Analytics, a service which offers estimated people and their main profiles walking along streets in order to take the best decisions based on data, no intuitions. I promoted Open Data Córdoba</p>\n\n<p>In the last 3 years, I have learnt how the online poker industry works as a consultant to Los Pelayos, one of the Spanish gaming companies leaders</p>","image":{"available_sizes":[[[133,130],"assets/images/resized/0014/1017/141017v2-max-150x150.jpg"],[[133,130],"assets/images/resized/0014/1017/141017v2-max-250x250.jpg"],[[133,130],"assets/images/resized/0014/1017/141017v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO & Founder","firm":{"name":"Ciudad 2020","permalink":"ciudad-2020","type_of_entity":"company","image":{"available_sizes":[[[150,40],"assets/images/resized/0014/0957/140957v2-max-150x150.png"],[[250,67],"assets/images/resized/0014/0957/140957v2-max-250x250.png"],[[400,108],"assets/images/resized/0014/0957/140957v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"<iframe width=\"425\" height=\"349\" src=\"http://www.youtube.com/embed/-RWcNqyrEiA?rel=0\" frameborder=\"0\" allowfullscreen></iframe>","description":"<p>Entrevista a Alfredo Romeo (mayo 2010)</p>"}],"external_links":[],"web_presences":[{"external_url":"http://www.aromeo.net","title":"Blog"},{"external_url":"http://es.linkedin.com/in/alfredoromeo","title":"LinkedIn profile"}]}