{"first_name":"Ali","last_name":"Fattaey","permalink":"ali-fattaey","crunchbase_url":"http://www.crunchbase.com/person/ali-fattaey","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jun 06 14:27:11 UTC 2009","updated_at":"Sat Jun 06 14:52:10 UTC 2009","overview":"<p>Dr. Fattaey has been engaged in cancer research, drug discovery and development for the past 17 years. Most recently Dr. Fattaey served as Chief Scientific Officer of Sagres Discovery from 2002 through 2005 where he led the discovery and development of anti-cancer therapeutics using Sagres’ proprietary Oncogenome™ technology. Dr. Fattaey later joined Chiron Corporation upon its acquisition of Sagres Discovery in late 2004.  Prior to Sagres, Dr. Fattaey joined Onyx Pharmaceuticals in 1994 where he served as the Vice President of Discovery Research from 1998 to 2001. At Onyx, Dr. Fattaey was responsible for multiple programs in collaboration with Pfizer and Bayer pharmaceutical companies focused on the discovery of small molecule drugs directed at intracellular signaling enzymes in the Ras and cell cycle regulation pathways as cancer therapeutics. Products of these programs include Nexavar, an anti-cancer small molecule drug approved by the FDA for treatment of kidney and liver cancer patients and PD-0332991, a small molecule inhibitor of cyclin-dependent kinase 4, which has recently completed Phase 2 clinical testing in cancer patients. Dr. Fattaey also directed the discovery of a highly novel strategy for treatment of cancer using selectively replicating human adenoviruses. One of these viruses, H101 (ONYX-015) is now approved in China for the treatment of patients with head-and-neck cancer.  Dr. Fattaey received his Ph.D. in microbiology from Kansas State University in 1989 and was a Research Fellow in Medicine at Harvard Medical School, Massachusetts General Hospital Cancer Center.  </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Operating and Scientific Officer","firm":{"name":"ACT Biotech","permalink":"act-biotech","type_of_entity":"company","image":{"available_sizes":[[[100,25],"assets/images/resized/0004/7119/47119v1-max-150x150.png"],[[100,25],"assets/images/resized/0004/7119/47119v1-max-250x250.png"],[[100,25],"assets/images/resized/0004/7119/47119v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}