{"first_name":"Ali","last_name":"Syed","permalink":"ali-syed","crunchbase_url":"http://www.crunchbase.com/person/ali-syed","homepage_url":"http://www.synergygloballtd.com","birthplace":"Ilford","twitter_username":"ali_syed","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1976,"born_month":12,"born_day":6,"tag_list":"wi-max, wib, rodigrf-v3, 2g, 2-5g, 2-75g, 4g, 3g, 3gp, bss, core-networks, satellite, billings, bpr, bscs, bts, cdr, abc-costing, customer-care, dsl, broadband, in-consultant, etom, ran, transmission, fraud-analyst, wimax, icms-billing, mpls, marcom, mnp-","alias_list":null,"created_at":"Thu Oct 08 12:06:15 UTC 2009","updated_at":"Thu Oct 08 19:28:47 UTC 2009","overview":"<p>Spanning the last 10 years my core focus has been working with leading Telco operators, providing them with bespoke recruitment solutions for their permanent and contract resourcing needs internationally. Have wokred on several launch projects within the emerging markets placing C level staff within the leading mobile operators in Africa, Middle East and Asia. A Director with a hands on approach with experience of global sourcing (ICT and Emerging Markets/Technologies). Services include Contract and Permanent recruitment, Salary surveys, Benchmarking etc. Synergy Global is an international staffing/recruitment company and my specialism is placing people within Telecoms Operators (GSM and fixed line) in Africa , Middle East and across Europe. I have successfully placed candidates’ across all disciplines including marketing , finance, technical and engineering across all levels of seniority, up to C level.</p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0006/2089/62089v2-max-150x150.jpg"],[[80,80],"assets/images/resized/0006/2089/62089v2-max-250x250.jpg"],[[80,80],"assets/images/resized/0006/2089/62089v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}