{"first_name":"Ali","last_name":"Jawad","permalink":"ali-jawad","crunchbase_url":"http://www.crunchbase.com/person/ali-jawad","homepage_url":"","birthplace":"","twitter_username":"ali_jawad1","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1994,"born_month":4,"born_day":6,"tag_list":"","alias_list":null,"created_at":"Thu Sep 13 10:27:25 UTC 2012","updated_at":"Wed Sep 19 15:52:00 UTC 2012","overview":"<p>Ali Jawad</p>\n\n<p>Ali Jawad is a successful businessman and valued community supporter. He is the co-owner and CEO of Armada Oil and Gas Company, along with longtime friend, Allie Berry. He is also the founder of the Lebanese American Heritage Club. The group was founded on the same day as Lebanon’s Independence Day, giving even more cause to celebrate.</p>\n\n<p>Originally the club was intended to rally together Arabic men to play soccer or other sports, the group quickly broadened its interests. They began attending social events involving Lebanese music and singers. More importantly, Ali Jawad and the organization started non-profit youth programs. They wanted to build a strong community to support young Arab-Americans. </p>\n\n<p>They started teaching the youth to embrace both sides of their heritage. Living in American comes with a great number of benefits and opportunities. At the same time, they have a full Arabic ancestry, and come from a rich culture. This kind of support helps the youth become strong, independent, successful people. </p>\n\n<p>Ali Jawad found that there needed to be even greater support of the youth. Along with the heritage club, he started the Arab American Scholarship Foundation. Since its inception, it has provided over 1.5 million dollars of financial aid to students. Arab-American students who want to receive the scholarship must display drive, ability and promise. The money is given to promising students in need.</p>\n\n<p>Ali Jawad and the heritage club get together for a number of special events. They host dinners and banquets for community events, most often for Arabic oriented occasions. This includes a Ramadan dinner, Arab-American International Festival, Lebanese Independence Day celebration, and more. \nAll of these events and donations are what make Ali Jawad a valuable community member. His success with Armada Oil is testament to his business talents. He is well-rounded and professional, capable and guilty of giving more of himself than is needed.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0021/1146/211146v2-max-150x150.png"],[[250,153],"assets/images/resized/0021/1146/211146v2-max-250x250.png"],[[260,160],"assets/images/resized/0021/1146/211146v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}