{"first_name":"Alisa","last_name":"Chumachenko","permalink":"alisa-chumachenko","crunchbase_url":"http://www.crunchbase.com/person/alisa-chumachenko","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Game Insight","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Mar 18 13:40:25 UTC 2010","updated_at":"Sun Apr 17 23:19:21 UTC 2011","overview":"<p>Alisa Chumachenko is one of the most respected specialists in marketing, promotion and advertising of online games, casual games and games for social networks in Russia, Eastern and Central Europe.</p>\n\n<p>In 2007 Alisa Chumachenko took up a position of the Vice President for Marketing and Advertising in a holding company Astrum Online Entertainment. AOE is a recognized market leader, which runs tens of browser-based and client MMOG and casual games, was merged with Mail Ru Group in 2009. Alisa Chumachenko formed the best professional marketing team in Russia, the results of which were a steady growth of financial indicators of Astrum Online, a dozens of launched free to play MMOG projects, marketing, advertising and PR successful support of projects of the holding company.</p>\n\n<p>In January 2010 Alisa Chumachenko founded a company called Game Insight. Nowadays Game Insight Group  is a key player on the market of developing and publishing games for social networks and mobile games. There are more than a dozen projects of Game Insight Group running in the world&#8217;s largest social networks. For the just one year the user number of Game Insight&#8217;s games exceeded twenty million mark and continues to grow steadily. More recently Game Insight Group has announced the launch of another great project –game platform, club of the players called Funzay.com. </p>","image":{"available_sizes":[[[133,150],"assets/images/resized/0013/0740/130740v2-max-150x150.jpg"],[[222,250],"assets/images/resized/0013/0740/130740v2-max-250x250.jpg"],[[285,320],"assets/images/resized/0013/0740/130740v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}