{"first_name":"Alison","last_name":"C. Lynch","permalink":"alison-c-lynch","crunchbase_url":"http://www.crunchbase.com/person/alison-c-lynch","homepage_url":"http://www.driveway2driveway.net","birthplace":"","twitter_username":"theundealer","blog_url":"","blog_feed_url":"","affiliation_name":"Columbus Venture Capital","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Nov 29 21:28:52 UTC 2008","updated_at":"Tue Jan 19 21:59:21 UTC 2010","overview":"<p>Alison Lynch is an operations and marketing professional with over 15 years experience in venture development - helping start-up companies and established small businesses achieve profitable growth. Her multi-disciplinary background has enabled her to join a firm and make an immediate contribution whether in operations, administration, marketing, or businesses development. In her role as Director of Affiliate Programs, Alison is responsible for a wide variety of marketing and business activities that bring new customers to Driveway2Driveway. Prior to joining Driveway2Drvieway, Alison held sales and marketing positions at Capitol Catering and Design Cuisine. In addition to her sales and marketing experience, Alison has achieved success in the venture capital industry and as an entrepreneur. She was a Director at Columbus Ventures and IMS Ventures, both early stage venture capital firms, where she was responsible for identifying and qualifying potential investment opportunities. Alison got her entrepreneurial start as Operations Manager for Intelligent Interactions. Intelligent Interactions developed one of the first ad serving technologies for the Internet and was acquired by 24/7 Media and subsequently conducted a successful IPO in 1998. Alison earned a BA in Political Science from Longwood College</p>","image":{"available_sizes":[[[105,150],"assets/images/resized/0007/3989/73989v2-max-150x150.jpg"],[[176,250],"assets/images/resized/0007/3989/73989v2-max-250x250.jpg"],[[317,450],"assets/images/resized/0007/3989/73989v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Director","firm":{"name":"Columbus Venture Capital","permalink":"columbus-venture-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,10],"assets/images/resized/0003/0184/30184v1-max-150x150.jpg"],[[250,17],"assets/images/resized/0003/0184/30184v1-max-250x250.jpg"],[[450,31],"assets/images/resized/0003/0184/30184v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}