{"first_name":"Alistair","last_name":"Hirst","permalink":"alistair-hirst","crunchbase_url":"http://www.crunchbase.com/person/alistair-hirst","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"KineMotion Health","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Mar 30 21:51:47 UTC 2012","updated_at":"Thu Apr 05 04:01:06 UTC 2012","overview":"<p>Alistair Hirst is an entrepreneur and team leader.</p>\n\n<p>He is cofounder of KineMotion Health, a startup that is leveraging the disruptive nature of Microsoft&#8217;s Kinect and the internet to create a new market in the health care field.</p>\n\n<p>A 20 year veteran of the game industry who led audio teams during a 10 year career as Senior Audio Director at EA, going on to co-found OMNI Audio in 2002. As head of OMNI Audio Alistair is responsible for new business development, initiating and nurturing partnerships with clients, sales, marketing and branding the company. Clients include Microsoft, Electronic Arts, Ubisoft, Activision, SOE, SCEA and many independent studios. Prepare bids, negotiate and review contracts and then provide creative direction. Recruit, coach and mentor a team to build a culture that puts quality and client satisfaction first. Initiated, researched and implemented systems that optimized pipelines and communication with both the internal team and external clients. </p>\n\n<p>OMNI has shipped over 60 games with 30 different clients including creating and implementing all sound effects and speech for 4 versions of Guild Wars, which sold over 6.5 million copies. Contributed to Halo 2 cinematics. While at EA, Alistair was Audio Director on team that built original Need for Speed on 3DO, and shipped another 21 NFS SKU&#8217;s. Franchise has now sold over 100 billion copies, generated $3 Billion. </p>\n\n<p>Co-founded game company Ton-O-Fun in 2010. Responsible for game design, art, audio for 2 iOS games, as well as creating marketing campaign, including press releases, reaching out to blog and review sites, creating company website, promotional videos, YouTube channel and Facebook page.</p>\n\n<p>Cofounded Seattle Composers Alliance in 1999 and served as President, Vice-President and Secretary and board member. Has spoken at GDC almost annually since 1999, including conferences in San Jose, San Francisco, Seattle, Vancouver and Austin. On the advisory board of Digipen and Art Institute of Seattle, and AIAS Sound Design and Music panels for DICE Awards since 2008.</p>","image":{"available_sizes":[[[150,145],"assets/images/resized/0018/1988/181988v2-max-150x150.jpg"],[[250,241],"assets/images/resized/0018/1988/181988v2-max-250x250.jpg"],[[450,435],"assets/images/resized/0018/1988/181988v2-max-450x450.jpg"]],"attribution":"<p>Alistair Hirst</p>"},"degrees":[{"degree_type":"Bachelor of Arts in Applied Sciences","subject":"Communication, Fine and Performing Arts","institution":"Simon Fraser University","graduated_year":1989,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"KineMotion Health","permalink":"kinemotion-health","type_of_entity":"company","image":null}},{"is_past":false,"title":"CEO","firm":{"name":"OMNI Audio","permalink":"omni-audio","type_of_entity":"company","image":null}},{"is_past":true,"title":"Senior Audio Director","firm":{"name":"Electronic Arts","permalink":"electronicarts","type_of_entity":"company","image":{"available_sizes":[[[150,95],"assets/images/resized/0001/2250/12250v3-max-150x150.jpg"],[[250,158],"assets/images/resized/0001/2250/12250v3-max-250x250.jpg"],[[425,270],"assets/images/resized/0001/2250/12250v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}