{"first_name":"Alison","last_name":"Moore","permalink":"alison-moore","crunchbase_url":"http://www.crunchbase.com/person/alison-moore","homepage_url":"","birthplace":"","twitter_username":"amoorenyc","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Tue Nov 08 18:41:26 UTC 2011","updated_at":"Tue Aug 21 16:58:00 UTC 2012","overview":"<p>Alison Moore is senior vice president, Digital Products, for Home Box Office, responsible for overseeing the consumer experience, content development and operation of HBO’s multiplatform digital products: HBO/MAX GO, HBO.com, Cinemax.com, HBO Social Media platforms, HBO/MAX On Demand and Affiliate Products. Moore was named to this position in July 2010.</p>\n\n<p>Moore first joined HBO as a marketing manager in 1995, responsible for developing promotional marketing programs with affiliate partners. She left the company in 1999, returning to HBO in 2003 as director, Brand Development. She was promoted to vice president, Brand Strategy and Digital Platforms in May 2006, overseeing HBO’s consumer websites, online video, social and promotional platforms, as well as HBO’s brand advertising and promotional strategy.</p>\n\n<p>During her hiatus from HBO, Moore was instrumental in helping launch two internet start-ups: in 1999, as director, B2B Marketing, for Flooz.com, she created and launched Flooz B2B marketing and promotional strategies; and in 2000 she co-founded DatSat, where as vice president, Market Development, she was responsible for overseeing business development and marketing strategies. In 2001, she briefly consulted at JP Morgan Chase in the Small Business Financial Services division, creating business development plans for one of the division’s start-up investments. From 2001 to 2003, she was director, Product Strategy, at Cablevision, where she was responsible for product strategy, marketing and branding of Optimum Online, Cablevision’s award-winning consumer broadband service.</p>\n\n<p>She began her career at Turner Broadcasting, Inc. in Atlanta, GA, where she served as manager, Affiliate Relations and Marketing from 1992 to 1995.</p>\n\n<p>Moore holds a BA in Political Science from the University of Georgia.</p>","image":{"available_sizes":[[[119,150],"assets/images/resized/0016/1395/161395v2-max-150x150.jpg"],[[199,250],"assets/images/resized/0016/1395/161395v2-max-250x250.jpg"],[[359,450],"assets/images/resized/0016/1395/161395v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}