{"first_name":"Allan","last_name":"Will","permalink":"allan-will","crunchbase_url":"http://www.crunchbase.com/person/allan-will","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Dec 03 20:14:34 UTC 2008","updated_at":"Wed Dec 03 20:16:04 UTC 2008","overview":"<p>Allan Will is a founding Managing Director of Split Rock Partners. Based in the California office, he serves as a member of the firm&#8217;s healthcare investment team and focuses on opportunities in therapeutic medical devices.</p>\n\n<p>Prior to founding Split Rock Partners, Allan was a General Partner with St. Paul Venture Capital&#8217;s healthcare team. He joined St. Paul Venture Capital in November 2002 from The Foundry, an incubator that he founded in 1998. At The Foundry, Allan served as a founder, CEO, director and advisor for early stage medical device companies, providing expertise in commercializing medical device technology. Allan has founded or cofounded thirteen companies, including Adjacent Surgical, Ardian, Cabochon Aesthetics, Cierra, Concentric Medical, Emphasys Medical, Evalve, First to File, ForSight Vision3, Miramar Labs, Satiety, The Foundry and XTENT.</p>\n\n<p>Previously, Allan was president and CEO of AneuRx, Inc., a developer of stent grafts for aortic aneurysms acquired by Medtronic, Inc. in 1996. While at AneuRx, Allan and AneuRx founder Thomas Fogarty, M.D., co-founded Adjacent Surgical, Inc., which was sold to General Surgical Innovations, Inc. and subsequently acquired by Tyco International. Previously, as CEO of Devices for Vascular Intervention, Allan led the company from 16 employees to nearly $100 million in revenue and acquisition by Eli Lilly and Company.</p>\n\n<p>Allan is an inventor on 23 issued patents for medical devices. He holds a bachelor&#8217;s degree in zoology from the University of Maryland and a master&#8217;s degree in management from the Massachusetts Institute of Technology. </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0003/0925/30925v1-max-150x150.jpg"],[[148,222],"assets/images/resized/0003/0925/30925v1-max-250x250.jpg"],[[148,222],"assets/images/resized/0003/0925/30925v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Managing Director","firm":{"name":"Split Rock Partners","permalink":"split-rock-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,39],"assets/images/resized/0003/0922/30922v1-max-150x150.jpg"],[[189,50],"assets/images/resized/0003/0922/30922v1-max-250x250.jpg"],[[189,50],"assets/images/resized/0003/0922/30922v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}