{"first_name":"Allen","last_name":"Barnett","permalink":"allen-barnett","crunchbase_url":"http://www.crunchbase.com/person/allen-barnett","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 11 03:35:07 UTC 2011","updated_at":"Wed May 11 03:38:47 UTC 2011","overview":"<p>Dr. Allen Barnett is a successful drug development executive who brought four drugs to the marketplace during his tenure at Schering-Plough (SP), two of which are blockbusters. He led the effort that resulted in the discovery of Claritin (and Clarinex), a non-sedating antihistamine that is Schering-Plough’s leading product and was the fifth leading drug, based on sales, in the world.  He also managed the discovery program that led to Zetia, a novel cholesterol-lowering agent that was introduced to the market in November 2002. In 1994, Dr. Barnett assumed the duties of Vice President of Technology Acquisition and External Collaborations and was involved with the in-licensing of new technology and the structuring of academic collaborations for SP.  Collaborations included Cephalon, Pharmacopeia, Neurogen, Genome Therapeutics, Human Genome Sciences, Chiroscience, Synteni/Incyte, Navicyte, Terragen, Biosearch Italia, Transgene, Myriad Genetics and Genzyme.  Significant academic collaborations included The Whitehead Institute, Duke University, Stanford University, University of Toronto, Harvard University, Aaron Diamond Research Center, Vanderbilt University, Columbia University, Penn State University, SUNY at Buffalo and N.Y.U.  Dr. Barnett elected to retire from SP in 1998 and continued to provide consulting services to SPRI and other companies as a consultant until assuming his current role with Kinex Pharmaceuticals.</p>","image":{"available_sizes":[[[105,132],"assets/images/resized/0013/4107/134107v1-max-150x150.jpg"],[[105,132],"assets/images/resized/0013/4107/134107v1-max-250x250.jpg"],[[105,132],"assets/images/resized/0013/4107/134107v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Ph.D.","subject":"Pharmacology","institution":"University at Buffalo","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President Emeritus","firm":{"name":"Kinex Pharmaceuticals","permalink":"kinex-pharmaceuticals","type_of_entity":"company","image":{"available_sizes":[[[150,46],"assets/images/resized/0013/4104/134104v1-max-150x150.jpg"],[[250,76],"assets/images/resized/0013/4104/134104v1-max-250x250.jpg"],[[260,80],"assets/images/resized/0013/4104/134104v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}