{"first_name":"Allen","last_name":"DeBevoise","permalink":"allen-debevoise-2","crunchbase_url":"http://www.crunchbase.com/person/allen-debevoise-2","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Thu Aug 30 04:31:08 UTC 2012","updated_at":"Thu Aug 30 04:31:08 UTC 2012","overview":"<p>Allen DeBevoise is the Chairman, CEO and Co-Founder of Machinima, Inc. the dominant video entertainment network for serious gamers around the world. Machinima’s global content network features official content from game publishers, television networks and film studios, fan-created\ngameplay videos and original content, including over 20 original weekly shows and “prime time” live-action episodic series, all aimed at the coveted 18–34 year old male demographic. The number one entertainment channel on YouTube, Machinima reaches over 191 million viewers monthly, and delivers 2.1 billion video views a month, and growing.</p>\n\n<p>Under DeBevoise’s guidance, Machinima has become a major force in reaching core video gamers and young entertainment consumers, because the company is at the cutting edge of on-line video entertainment and the changing experience of gaming. It also enjoys a massive, global, and highly engaged audience.</p>\n\n<p>DeBevoise served on the board of directors of LowerMyBills.com and True/Slant through their respective acquisitions, and currently serves on the board of Dealer.com. He is also an active angel investor in several early stage technology and consumer internet companies.</p>\n\n<p>Before Machinima, DeBevoise was President and CEO of TCI Interactive and co-founded Creative Planet, an online resource for film and television production professionals. DeBevoise was featured on The Hollywood Reporter’s “Digital Power List” and was recognized as one of Digital Media Wire’s “25 Executives to Watch.”</p>","image":{"available_sizes":[[[118,150],"assets/images/resized/0020/8833/208833v1-max-150x150.jpg"],[[196,250],"assets/images/resized/0020/8833/208833v1-max-250x250.jpg"],[[354,450],"assets/images/resized/0020/8833/208833v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}