{"first_name":"Almitra","last_name":"Inocencio","permalink":"almitra-inocencio","crunchbase_url":"http://www.crunchbase.com/person/almitra-inocencio","homepage_url":"http://spokensocial.com","birthplace":"","twitter_username":"almitra","blog_url":"http://spokensocial.com","blog_feed_url":"http://www.spokensocial.com/feed","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"social-media, advertising, project-management, interactive-marketing, community-management, user-experience-design, ixd, interaction-design","alias_list":null,"created_at":"Fri Feb 12 23:47:32 UTC 2010","updated_at":"Thu Oct 28 15:44:27 UTC 2010","overview":"<p>Almitra&#8217;s social media career started out helping local Bay Area artists, bands and labels gain recognition and exposure by driving trafï¬c to live shows and boosting their online presence. Soon thereafter, Almitra expanded her credentials while working at popular music social network iMeem, on the music marketing team as a bonafide music snob. There she gained valuable experience managing an online community of over 25 million monthly visitors, while developing and executing promotional strategy for major and independent label artists. Currently, Almitra is dominating the digital ad-industry as a freelance Social Media Producer, whilst she continually sharpens her skill on methods of Social Media strategy and planning, user experience design, outreach, trafï¬c-driving, brand awareness, buzz creation, metrics reporting and analysis. </p>\n\n<p>She has worked on campaigns for CafePress, Summit Entertainment, Capitol Records, Dolby Laboratories, Blackhawk Network, and Apple iTunes to name a few. If you like numbers, she has also contributed a number of posts to buzzstudy.com, a blog dedicated to monitoring conversations and topics in social media for Infegy, Inc. Most recently, Almitra has been nominated as one of the Top 5 Social Media Mavens in the 2009 Mashable Open Web Awards. At any given moment she can be found lurking around on the internet in search of new topics, discussions, trends to reï¬‚ect upon.</p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0007/6924/76924v2-max-150x150.jpg"],[[187,250],"assets/images/resized/0007/6924/76924v2-max-250x250.jpg"],[[337,450],"assets/images/resized/0007/6924/76924v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/almitra","title":"Twitter"},{"external_url":"http://spokensocial.com","title":"Blog"},{"external_url":"http://linkedin.com/in/almitra","title":"LinkedIn"}]}