{"first_name":"Alon","last_name":"Alter","permalink":"alon-alter","crunchbase_url":"http://www.crunchbase.com/person/alon-alter","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Commtouch","born_year":1981,"born_month":5,"born_day":31,"tag_list":"","alias_list":null,"created_at":"Sun Nov 16 13:49:30 UTC 2008","updated_at":"Thu Feb 10 04:15:49 UTC 2011","overview":"<p>Alon is Director, Sales &amp; Business Development  at Commtouch Software (www.commtouch.com). Responsible for business development activities, driving revenue growth and winning market share. Building strong and sustainable partnerships with security vendors and service providers across segments and international borders</p>\n\n<p>Commtouch Software Ltd. (NASDAQ: CTCH) is NASDAQ listed and is the leading OEM player in the field of email and web security. </p>\n\n<p>Commtouch has over 20 years of experience developing messaging software, and is a global developer and provider of proprietary anti-spam, Zero-Hour virus protection and IP Reputation solutions.\nCommtouch solutions are based on patent-protected Recurrent Pattern Detection™ (RPD) technology. Analyzing over two billion email messages per day, RPD identifies new spam and malware outbreaks within minutes of their introduction into the Internet. RPD has been recognized by industry experts as a leading technology.\nCommtouch technology has been adopted and integrated by scores of key security players (including Check Point, Openwave, Mirapoint, Tumbleweed, F-Secure and AhnLab) and it protects thousands of organizations in over 100 countries.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Business Development Manager","firm":{"name":"Commtouch","permalink":"commtouch","type_of_entity":"company","image":{"available_sizes":[[[150,51],"assets/images/resized/0004/2879/42879v1-max-150x150.png"],[[185,64],"assets/images/resized/0004/2879/42879v1-max-250x250.png"],[[185,64],"assets/images/resized/0004/2879/42879v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}