{"first_name":"Alper","last_name":"Turgut","permalink":"alper-turgut","crunchbase_url":"http://www.crunchbase.com/person/alper-turgut","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jul 30 17:59:30 UTC 2008","updated_at":"Wed Jul 30 18:03:38 UTC 2008","overview":"<p>Alper is a serial technology entrepreneur and business development executive. In his most recent venture, Verkata LLC, Alper led the product vision and brought marquee customers (e.g., Motorola, British Telecom, AOL, Virgin Mobile) on board carrying company to profitability merely in two years. Previously he co-founded Aligo Inc., raised over $24 million from venture funds and strategic partners including Motorola, Inc., as a strategic investor. His venture was featured in Newsweek Special Edition, and received numerous prestigious awards such as Red Herring Magazine&#8217;s &#8220;Most Likely to Succeed&#8221; Award, &#8220;Wireless Ventures Awards&#8221; (two years in a row), Java Developers Journal &#8220;Blue Ribbon&#8221; and &#8220;Best Product&#8221; Awards.</p>\n\n<p>Alper led customer acquisition efforts focusing on multi-million strategic accounts and OEM deals. He closed flagship software licensing deals with Sun Microsystems, Motorola and Nextel. Alper pioneered international expansions and opened up offices in Japan closing major distribution deals with NTI (joint venture between NTT and Itochu), Kanematsu Communications, and Fuji Electric.</p>\n\n<p>Previously, Alper was a strategic management consultant with McKinsey and Company in New York focusing on e-business software strategy and financial services working with Fortune 500 companies. Alper received his MBA from MIT Sloan School of Management concentrating on strategic management and finance. He holds a Masters of Science in Electrical Engineering and Telecommunications from Northeastern University and graduated summa cum laude with a Bachelors of Science in Electrical Engineering from Bilkent University, Turkey. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Anvato","permalink":"anvato","type_of_entity":"company","image":{"available_sizes":[[[150,22],"assets/images/resized/0002/3026/23026v1-max-150x150.png"],[[250,37],"assets/images/resized/0002/3026/23026v1-max-250x250.png"],[[450,66],"assets/images/resized/0002/3026/23026v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}