{"first_name":"Amarendra","last_name":"bhushan","permalink":"amarendra-bhushan","crunchbase_url":"http://www.crunchbase.com/person/amarendra-bhushan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Zooors Interactive Yachting Society","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Mar 12 13:18:41 UTC 2008","updated_at":"Tue Jul 22 17:40:32 UTC 2008","overview":"<p>Chief Executive Officer and Director of European Research Centre for Excellence (a consulting and market research company). And also serving, as a Chief Executive Officer at CEOWORLD.BIZ (only magazine written strictly for CEOs and their peers)</p>\n\n<p>He is also serving, as a Chief Executive Officer at CEOWORLD.BIZ (only magazine written strictly for CEOs and their peers); and a consultant at Tetrain software solutions. Mr. Amarendra B. Dhiraj is a Partner in Mariners worldwide Inc. and associated with some of the worlds most media literate clients Cosmos Yachting, Pinkuin GmbH, Zitroone, Nomicos S.A, AB. Associates, etc. a frequent contributor to technology, business and financial industry publications and forums.</p>\n\n<p>He has been recognized by his peers as one of the most knowledgeable and innovative Management executives and is named as a Europe&#8217;s youngest management Guru.</p>\n\n<p>He specializes in advising clients on creating funding programs for a wide variety of e-commerce assets, structuring efficient asset disposition methods, valuing performing and non-performing portfolios, and the economic consequences of government policies and regulations impacting financial institutions and broker/dealers.</p>\n\n<p>He is an acknowledged authority on administrative, financial, and service departments, including marketing, communications, and strategic planning.</p>","image":null,"degrees":[],"relationships":[{"is_past":null,"title":"","firm":{"name":"Zooors Interactive Yachting Society","permalink":"zooors-interactive-yachting-society","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0001/5452/15452v1-max-150x150.png"],[[224,80],"assets/images/resized/0001/5452/15452v1-max-250x250.png"],[[224,80],"assets/images/resized/0001/5452/15452v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}