{"first_name":"Amber","last_name":"Paul","permalink":"amber-paul","crunchbase_url":"http://www.crunchbase.com/person/amber-paul","homepage_url":"http://www.akmg.com","birthplace":"Orange County, CA","twitter_username":"akmgalerts","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 29 22:36:10 UTC 2010","updated_at":"Wed Jun 30 19:50:20 UTC 2010","overview":"<p>Amber Paul, the oldest of two children from a family located in Orange County California, developed a passion for marketing and sales at a young age and decided to satiate that passion by majoring in communications and minoring in marketing and advertising. Amber serves as Vice President as well as a partner of AKMG, and brings tremendous value associated with over five years of groundbreaking experience in the online industry with a strong focus on publishing channels and relationship building.</p>\n\n<p>Amber&#8217;s previous successes include pioneering and building the network syndication department of Hydra Network, of which equated for 1/3 of the companies earnings for over three years. In 2008 Amber became a key member in the uprising of Bloosky Interactive, in which she formulated and established the Bloosky affiliate network and oversaw all distribution efforts of the company and increased online sales by over 300%. Amber&#8217;s diverse and well developed contact base, along with an eye for industry trends allows for AKMG&#8217;s continual success and expansive publisher basis. Amber is also the head organizer for Meetup202 events in Southern California including the Los Angeles, Orange County and San Diego groups which consists of over 2000 affiliate marketers.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/amber-paul/3/72a/5","title":"LinkedIn"}]}