{"first_name":"Amelie","last_name":"Gao","permalink":"amelie-gao","crunchbase_url":"http://www.crunchbase.com/person/amelie-gao","homepage_url":"http://www.mutrade.com","birthplace":"China","twitter_username":"Amelie","blog_url":"http://www.mutrade.com","blog_feed_url":"http://www.mutrade.com","affiliation_name":"Unaffiliated","born_year":1990,"born_month":5,"born_day":18,"tag_list":"how-many-roads-must-a-man-walk-down-before-you-call-him-a-man","alias_list":null,"created_at":"Fri Jun 03 03:16:50 UTC 2011","updated_at":"Tue Jun 07 14:22:29 UTC 2011","overview":"<p>Qingdao Mutrade is a leading parking solution provider in China. We are committed to provide the most suitable and cost efficient parking system solutions to our customers all over the world. \nWe manufacture, install, and support the different types of car parking system in order to meet different requirements from our customers. The business consists of parking equipment selling, parking solution consulting, parking project undertaking etc. Our value is based on the competitive price, quality product, reliable support and sincere customer service. \nOur parking system products include valet parking, automated parking, floor-to-floor car lift, etc. We are the one of only two companies which can manufacture high-end hydraulic lift sliding parking system in China. Our parking system adopts Kawasaki hydraulic technology which make the parking and retrieving speed three or more times faster than any other lift sliding parking system. \n26 national patents, 38 senior and associate engineers, 55 major project experience, 90 sophisticated technicians guarantee our products and services can fully satisfy the needs of our customers. </p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0013/7547/137547v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0013/7547/137547v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0013/7547/137547v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}