{"first_name":"Amir","last_name":"Zoufonoun","permalink":"amir-zoufonoun","crunchbase_url":"http://www.crunchbase.com/person/amir-zoufonoun","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jun 24 17:59:13 UTC 2009","updated_at":"Wed Jun 24 18:00:34 UTC 2009","overview":"<p>Amir Zoufonoun founded Exalt Communications in 2004 and has served as its President, Chief Executive Officer and Chairman of the Board since inception. Mr. Zoufonoun has over 29 years of experience in the wireless telecom and networking industry including 13 years at Western Multiplex, where he was the visionary executive champion and wireless founder responsible for the launch of numerous successful new wireless categories and extensions. Under his leadership, Western Multiplex amassed an installed base of over 150,000 carrier class systems worldwide, and these market successes led to significant periods of profitable growth, multiple mergers and acquisitions, and a successful IPO. Prior to Western Multiplex, Mr. Zoufonoun spent 10 years at Harris and Farinon in various management and engineering positions, focused on delivering carrier class, fixed and portable wireless systems for voice, data and video transmission. Mr. Zoufonoun holds a BSEE and an MSEE, and is a SEP graduate of the Stanford University Graduate School of Business. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder and CEO","firm":{"name":"Exalt Communications","permalink":"exalt-communications","type_of_entity":"company","image":{"available_sizes":[[[107,59],"assets/images/resized/0005/0568/50568v1-max-150x150.png"],[[107,59],"assets/images/resized/0005/0568/50568v1-max-250x250.png"],[[107,59],"assets/images/resized/0005/0568/50568v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}