{"first_name":"Amitabh","last_name":"Srivastava","permalink":"amitabh-srivastava","crunchbase_url":"http://www.crunchbase.com/person/amitabh-srivastava","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Oct 27 23:50:20 UTC 2008","updated_at":"Mon Oct 27 23:50:20 UTC 2008","overview":"<p>Amitabh Srivastava is a Corporate Vice President with responsibility for major components of the company&#8217;s next-generation services platform. He began working on the company’s services platform in November 2006, after playing a pivotal role in shipping Windows Vista.</p>\n\n<p>Srivastava joined Microsoft in 1997 as a Senior Researcher and led the Advanced Development Tools group in Microsoft Research that investigated new techniques to build innovative tools and technologies to improve performance and quality of Microsoft software. His vision and energy led to the creation of the Programmer Productivity Research Center (PPRC) in March 1999, which he has led since its inception. Srivastava&#8217;s PPRC group, now known as Center for Software Excellence (CSE), has produced several tools and technologies that are critical to Microsoft product groups. Srivastava and his team&#8217;s work was highlighted in the Forbes magazine in May, 2003.</p>\n\n<p>In January 2001, Srivastava became one of a select few to be named a Distinguished Engineer, now known as Technical Fellow.</p>\n\n<p>Srivastava joined Windows in December 2003 as Vice President of the Windows Core OS development to redefine the engineering process for Windows Vista. He was responsible for the development of core operating system components such as the kernel, operating system architecture, definition of development processes, and development of advanced tools to automate the development processes. Srivastava&#8217;s work in defining the Windows engineering process was discussed in the Wall Street Journal in September, 2005.</p>\n\n<p>Before working for Microsoft, Srivastava was the chief technical officer and vice president of engineering at TracePoint Technology Inc., a spin-off company from Digital Equipment Corp. He joined Digital&#8217;s Western Research Labs (DEC WRL) in Palo Alto, Calif. in 1991. Srivastava&#8217;s research on binary code modification at DEC WRL resulted in the creation of TracePoint. He started his career as a researcher at Texas Instruments Inc.&#8217;s Research Labs in Dallas, Texas in 1984 after graduating from Pennsylvania State University.</p>\n\n<p>Srivastava holds 13 patents and has published a variety of papers. His paper on ATOM with Alan Eustace in PLDI 1994 received the Most Influential PLDI Paper Award in June 2005. He is the author of OM, ATOM and SCOOPS software systems, which have resulted in products for Digital Equipment and Texas Instruments on the Alpha and PC platforms. He led the design and development of Vulcan, a second-generation binary transformation system, at Microsoft. Vulcan is the foundation of a wide variety of tools developed at PPRC.</p>\n\n<p>Srivastava delivered the commencement address titled Fourth and Goal in the College of Engineering graduation ceremonies at Pennsylvania State University, University Park on May 16, 2008. (transcript of the commencement address)</p>\n\n<p>Srivastava earned a bachelor&#8217;s degree in Electrical Engineering from the Indian Institute of Technology, Kanpur, India, and a master&#8217;s degree in Computer Science from Pennsylvania State University, University Park, PA. He received the 2003-2004 Distinguished Alumnus Award from the Indian Institute of Technology, Kanpur, and was selected the 2004 Outstanding Engineering Alumnus of the Pennsylvania State University.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0002/7441/27441v1-max-150x150.jpg"],[[178,250],"assets/images/resized/0002/7441/27441v1-max-250x250.jpg"],[[321,450],"assets/images/resized/0002/7441/27441v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}