{"first_name":"Amit","last_name":"Jain","permalink":"amit-jain-3","crunchbase_url":"http://www.crunchbase.com/person/amit-jain-3","homepage_url":"http://www.ksl.in","birthplace":"Rohtak","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"kesri steels limited","born_year":1979,"born_month":6,"born_day":3,"tag_list":"stainless-steel-rounds, rounds, stainless-steel-flats, steel-castings, stainless, alloy-steel-castings","alias_list":null,"created_at":"Fri Aug 27 11:19:31 UTC 2010","updated_at":"Fri Aug 27 18:29:10 UTC 2010","overview":"<p>Stainless Steel is a metal alloy popular as a surface for sinks and appliances. Stainless steel is a great surface that doesn’t corrode or rust easily. Stainless steel is easy to sanitize and clean. It actually isn’t stain-proof; it simply stains less than other steel. Chemical residues, dirty water, and even hard water can leave stains and spots on stainless steel. It can also be dented and scratched fairly easily. Manufacturers are now offering new types of finishes that diminish scratching and fingerprints.\nSteel casting is a specialized form of casting involving various types of steel. Steel castings are used when cast iron cannot deliver enough strength or shock resistance.\nExamples of items that are steel castings include: hydroelectric turbine wheels, forging presses, gears, railroad truck frames, valve bodies, pump casings, mining machinery, marine equipment, and engine casting.</p>\n\n<p>Steel is a metal alloy whose major component is iron, with carbon being the primary alloying material. Carbon acts as a hardening agent, preventing iron atoms, which are naturally arranged in a lattice, from sliding past one another. Varying the amount of carbon and its distribution in the alloy controls the qualities of the resulting steel. Steel with increased carbon content can be made harder and stronger than iron, but is also more brittle. One classical definition is that steels are iron-carbon alloys with up to 5.1 percent carbon; ironically, alloys with higher carbon content than this are known as iron.</p>\n\n<p>Kesri Steels Limited is a Manufacturer and Exporter of Carbon steel, Alloy steel, Manganese steel, Stainless steel and Special steel Castings, Ingots, Round Bars, Square Bars, Flat Bars and Forged Bars for diversified engineering applications. </p>\n\n<p>Kesri Steels Limited is customer focused, innovative and value-driven company, which manufactures, processes and delivers Steel products to their valuable customers worldwide.</p>\n\n<p>For more information on the  products manufactured at Kesri Steels Limited please contact us a following address</p>","image":{"available_sizes":[[[116,78],"assets/images/resized/0009/9637/99637v2-max-150x150.png"],[[116,78],"assets/images/resized/0009/9637/99637v2-max-250x250.png"],[[116,78],"assets/images/resized/0009/9637/99637v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Stainless steel casting manufacturer & Exporter.","firm":{"name":"kesri steels limited","permalink":"kesri-steels-limited","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}