{"first_name":"Amit","last_name":"Paunikar","permalink":"amit-paunikar","crunchbase_url":"http://www.crunchbase.com/person/amit-paunikar","homepage_url":"","birthplace":"","twitter_username":"paunikar","blog_url":"","blog_feed_url":"","affiliation_name":"Yahoo!","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jan 26 04:20:22 UTC 2010","updated_at":"Sat Mar 03 20:48:30 UTC 2012","overview":"<p>Amit is a seasoned product leader with proven experience delivering innovative and highly scalable products. He came to MarketShare with a comprehensive knowledge of online advertising, content analysis, search and matching technologies. At MarketShare, he is responsible for incubating new product ideas and developing innovative and scalable products.</p>\n\n<p>Amit joined MarketShare from Google, where he worked on search and advertising products. As lead product manager on Google Video, he spearheaded its transformation into a pure video search property. As an AdSense product manager, he led patented innovations to help automate the assessment of publisher quality that exponentially increased system capacity and accuracy, and reduced human support. He was awarded for his work in expanding publisher sign-ups in Asian markets. In AdWords, he launched a new bidding product that ramped up to over $300 million in annual run-rate and was acknowledged as a “Top 10” product launch, earning a mention during Google’s quarterly earnings call.</p>\n\n<p>Prior to Google, Amit held positions at Yahoo!, Nomadix, Bellcore and Citicorp. As Senior Product Manager at Yahoo!, he worked closely with Yahoo! Research to launch next-generation matching technologies for the Yahoo! Publisher Network. Amit was the resident technology evaluator for potential acquisition targets. He performed detailed due diligence to identify shortcomings in targets’ current systems and suggested enhancements that resulted in three key projects. In total, he led 12 initiatives that increased revenue by more than 17%.</p>\n\n<p>At Nomadix, a company started by Dr. Leonard Kleinrock, Distinguished Professor of Computer Science at UCLA, Amit worked in key product management, marketing and engineering roles. While there, he successfully delivered four major software releases for three products with more than 80 new features in four target markets. He also co-invented, designed and implemented iNAT, a patented way of performing network address translation, that vastly increases the reusability of public IP addresses required for VPN connections. He served on the editorial board of Hotel Business Review and wrote multiple articles on technology.</p>\n\n<p>Amit holds an M.S. in Computer Networks from University of Southern California and a B.S. in Computer Technology from VJTI, University of Mumbai.</p>","image":null,"degrees":[{"degree_type":"MS","subject":"Computer Science","institution":"University of Southern California","graduated_year":1999,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"VP, Product","firm":{"name":"MarketShare","permalink":"marketshare","type_of_entity":"company","image":{"available_sizes":[[[150,26],"assets/images/resized/0012/1584/121584v1-max-150x150.jpg"],[[182,32],"assets/images/resized/0012/1584/121584v1-max-250x250.jpg"],[[182,32],"assets/images/resized/0012/1584/121584v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Product Manager","firm":{"name":"Google","permalink":"google","type_of_entity":"company","image":{"available_sizes":[[[150,51],"assets/images/resized/0002/9578/29578v31-max-150x150.png"],[[250,85],"assets/images/resized/0002/9578/29578v31-max-250x250.png"],[[450,154],"assets/images/resized/0002/9578/29578v31-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Global Product Manager","firm":{"name":"Nomadix","permalink":"nomadix","type_of_entity":"company","image":null}},{"is_past":true,"title":"Senior Product Manager","firm":{"name":"Yahoo!","permalink":"yahoo","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0001/0836/10836v9-max-150x150.png"],[[226,81],"assets/images/resized/0001/0836/10836v9-max-250x250.png"],[[226,81],"assets/images/resized/0001/0836/10836v9-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}