{"first_name":"Ammar","last_name":"Hanafi","permalink":"ammar-hanafi-2","crunchbase_url":"http://www.crunchbase.com/person/ammar-hanafi-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Giga Omni Media","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Oct 06 12:24:14 UTC 2008","updated_at":"Thu Mar 26 20:34:54 UTC 2009","overview":"<p>Ammar H. Hanafi joined Alloy Ventures as a general partner in 2005. At Alloy, he focuses on investments in communications and IT infrastructure, as well as internet-enabled consumer and enterprise applications and services.</p>\n\n<p>Operating experience\nAmmar has over a decade of financial and operational management experience in the communications and technology industry. He previously served as vice president of new business ventures at Cisco Systems, where he led new product efforts in the enterprise datacenter market. From 2000 to 2002, he was vice president of corporate business development, and in that capacity, he was responsible for Cisco’s acquisitions, acquisition integration, investment, and joint venture activity on a global basis. He joined Cisco in 1997 as a member of the Corporate Business Development Group. During Ammar’s tenure at Cisco, he helped the company complete over 100 investment and M&amp;A transactions, including 50 successful acquisitions and over $750 million in venture capital investments. Leveraging his deep industry expertise, he helped lead Cisco into a number of major new businesses, including optical networking and integrated voice and data infrastructure and applications. Prior to Cisco, Ammar held leadership positions at PanAmSat Corp., a global satellite services provider, and the investment banking firms of Morgan Stanley and Donaldson, Lufkin &amp; Jenrette. Ammar received a BS in Applied and Engineering Physics from Cornell University (1988) and an MBA from Stanford University (1995). </p>\n\n<p>Current board seats\nAmmar serves on the board of directors of 3Leaf Systems, YouSENDit, Retrevo, Mavenir Systems, GigaOM, Qwaq, Infineta Systems and Moxsie. He also led Alloy’s investment in Cortina Systems. Ammar also serves on the board of the Silicon Valley Education Foundation, a non-profit. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Board of Directors","firm":{"name":"Giga Omni Media","permalink":"gigaomnimedia","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0001/1380/11380v3-max-150x150.png"],[[250,73],"assets/images/resized/0001/1380/11380v3-max-250x250.png"],[[281,83],"assets/images/resized/0001/1380/11380v3-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"General Partner","firm":{"name":"Alloy Ventures","permalink":"alloy-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[113,53],"assets/images/resized/0000/3916/3916v1-max-150x150.png"],[[113,53],"assets/images/resized/0000/3916/3916v1-max-250x250.png"],[[113,53],"assets/images/resized/0000/3916/3916v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}