{"first_name":"Amy","last_name":"Elkins","permalink":"amy-elkins","crunchbase_url":"http://www.crunchbase.com/person/amy-elkins","homepage_url":"http://www.socialvest.com","birthplace":"","twitter_username":"elkinssocvest","blog_url":"http://www.facebook.com/socialvest","blog_feed_url":"","affiliation_name":"SocialVest","born_year":null,"born_month":null,"born_day":null,"tag_list":"socialvest","alias_list":null,"created_at":"Wed Jul 28 21:17:16 UTC 2010","updated_at":"Wed Jul 28 21:57:18 UTC 2010","overview":"<p>Amy Elkins has recently been tapped to oversee marketing for SocialVest. Elkins is a  senior integrated marketing executive with over ten years experience in filmed entertainment &amp; brand management with an expertise in the interactive arena.  Most recently, Elkins held the post of SVP, Brand Marketing at Metro Goldwyn Mayer where she worked over ten years and participated in overall marketing initiatives in Theatrical, Consumer Products, Television and Home Entertainment Groups  During her tenure, she was integral at managing marketing strategy and execution for film&#8217;s like Rocky Balboa, Valkyrie, Die Another Day, the Legally Blonde franchise, the  Barbershop franchise and The Pink Panther brand.  Elkins also spent eight years overseeing digital strategy for Theatrical Marketing group, where she focused on creating engaging and immersive campaigns for moviegoers via the internet, mobile devices, gaming platforms and wireless. Elkins began her career at Grey Advertising in Los Angeles in Media Planning and Buying division working on telecommunications and consumer products brands.  Elkins holds a B.A. in English from UCLA.\nElkins recently adopted a girl from Ethiopia and is forever touched by the power of giving.  She&#8217;s passionate about taking her marketing savvy and applying it to conscious capitalism where everyone can benefit. </p>","image":{"available_sizes":[[[119,150],"assets/images/resized/0009/5275/95275v2-max-150x150.jpg"],[[199,250],"assets/images/resized/0009/5275/95275v2-max-250x250.jpg"],[[358,450],"assets/images/resized/0009/5275/95275v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"CMO","firm":{"name":"SocialVest","permalink":"socialvest","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0008/1808/81808v7-max-150x150.png"],[[205,47],"assets/images/resized/0008/1808/81808v7-max-250x250.png"],[[205,47],"assets/images/resized/0008/1808/81808v7-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}