{"first_name":"Amy","last_name":"Richards","permalink":"amy-richards","crunchbase_url":"http://www.crunchbase.com/person/amy-richards","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 01 18:16:54 UTC 2009","updated_at":"Mon Jun 28 17:40:21 UTC 2010","overview":"<p>Amy Richards joined Bunchball in May, 2009 as the Senior Vice President of Product Marketing.  She previously worked at <a href=\"http://www.crunchbase.com/company/google\" title=\"Google\">Google</a> serving as a VP of ad sales. \nAn expert in publisher monetization through her work at Google, Yahoo!, MatchLogic and Excite, Amy Richards has been instrumental in building businesses that have shaped the evolution of online advertising since its inception.  Amy’s work in crafting solutions for publishers and advertisers is exemplified by her leadership in introducing the DoubleClick Ad Exchange to the publisher market, achieving quick adoption of the first ever premium ad exchange and driving a shift in the way publishers manage their ad revenue streams.  Acquired by Google in 2008, the Ad Exchange is now a primary strategic focus for the company.  Prior to that, Amy led the development of advertising solutions for</p>\n\n<p>Yahoo!, positioning the company as the industry standard for connecting marketers with audiences during its most successful era in display media sales.  In years prior, Amy brought technologies and insights to publishers in strategic roles at MatchLogic and her own consulting practice.  Designing advertising and inventory programs at Excite, Amy was vital in scaling the ad sales business from three search engines to the single largest distributed content network on the Web.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"SVP Product Marketing","firm":{"name":"Bunchball","permalink":"bunchball","type_of_entity":"company","image":{"available_sizes":[[[150,36],"assets/images/resized/0000/2917/2917v8-max-150x150.jpg"],[[250,59],"assets/images/resized/0000/2917/2917v8-max-250x250.jpg"],[[450,107],"assets/images/resized/0000/2917/2917v8-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}