{"first_name":"Amy","last_name":"Nauiokas","permalink":"amy-nauiokas","crunchbase_url":"http://www.crunchbase.com/person/amy-nauiokas","homepage_url":"http://amynauiokas.com","birthplace":"","twitter_username":"AmyNauiokas","blog_url":"","blog_feed_url":"","affiliation_name":"Anthemis Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Mar 17 08:18:08 UTC 2009","updated_at":"Wed Nov 14 06:43:28 UTC 2012","overview":"<p>Amy Nauiokas is the Founder of Archer Gray Productions, an independent Theatre, Film and Television production company. Amy’s Broadway projects include the drama Dead Accounts, the musical Once, winner of 8 Tony Awards, and the smash hit play Seminar. Her film productions include  Greetings from Tim Buckley and the upcoming feature The Inevitable Defeat Of Mister And Pete, among other initiatives.</p>\n\n<p>Amy launched her career as a venture capitalist and entrepreneur in 2008 with the formation of My Dash Unlimited to manage her businesses in the media, entertainment, financial, technology, real estate and equestrian industries.  Through it, she established Archer Gray Productions, and under it, has served as Managing Partner at Smuggler Films, heading its production fund and as a creative and business advisor. Amy Co-Founded tech venture capital firm Nauiokas Park LLC, which was acquired in 2010 by Anthemis Group SA, where she continues to serve as a Venture Partner. Amy is owner of the Washington Equestrian Center in Litchfield County, CT, and a winery in Argentina. </p>\n\n<p>In 2010 she Co-Founded the Bubble Foundation, a 501(c)(3) organization partnering with New York City charter schools in underserved communities to provide  children with access to activities and food that help him or her to live a healthy life. Together, in partnership with charter schools that share this mission, Bubble designs free nutrition and fitness programs that complement and expand on the school’s current efforts, filling in gaps left by lack of funding, resources, or sometimes information. </p>\n\n<p>Previously, Amy was Managing Director and CEO of Barclays Stockbrokers, the UK’s largest retail broker with over £10 billion assets under management, and a founding Management Committee member of Barclays Wealth. She joined Barclays Group in 2004, as Head of Electronic Sales &amp; Trading at Barclays Capital. A recognized leader in electronic distribution of financial products, Amy drove both businesses to award-winning successes.</p>\n\n<p>Before joining Barclays, Amy was Senior Managing Director and Partner at Cantor Fitzgerald, where she was part of the management team that put Cantor’s brokerage business online. Amy proved critical to the company’s rebuild after the September 11th attacks destroyed Cantor’s headquarters in the World Trade Center when, in addition to running Global Marketing, Business Development and Investor Relations, she directed Human Resources for the firm.</p>\n\n<p>Amy is Board Chair of Make-A-Wish® International.  She received her master’s in International Business from Columbia University, and graduated from Dickinson College in 1994 with a bachelor’s in International Studies.  Amy is a member of the Dickinson College Board of Trustees. In 2007 and 2008 she was named one of the Financial News’ Top 100 Rising Stars, Forbes’ 40 Under Forty: Ones to Watch and Global Finance’s Top 20 Women in Wealth Management. </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0022/0266/220266v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0022/0266/220266v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0022/0266/220266v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Venture Partner","firm":{"name":"Anthemis Group","permalink":"anthemis-group","type_of_entity":"financial_org","image":{"available_sizes":[[[150,125],"assets/images/resized/0003/8316/38316v8-max-150x150.jpg"],[[250,209],"assets/images/resized/0003/8316/38316v8-max-250x250.jpg"],[[450,376],"assets/images/resized/0003/8316/38316v8-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}