{"first_name":"Anand","last_name":"Raman","permalink":"anand-raman","crunchbase_url":"http://www.crunchbase.com/person/anand-raman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Impetus Technologies, Inc.","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Oct 24 08:36:50 UTC 2008","updated_at":"Fri Nov 27 16:59:50 UTC 2009","overview":"<p>Anand Ramasubramanian has more than 12 years of experience in the software industry. He joined Impetus in the year 1995 as a Senior Sales Executive, and currently heads international marketing and business development.</p>\n\n<p>At Impetus, Anand has been responsible for increasing business for the company&#8217;s offshore product services. He has played a significant role in winning major accounts for the company, while also managing client relationships over long-term assignments. He has helped set up the business development team and its processes, works on the company&#8217;s marketing campaigns, and also serves as a mentor for new inductees in the US office.</p>\n\n<p>With over ten years of Impetus experience, Anand has been instrumental in developing and maintaining a steady stream of new clients to the organization. He not only provides the primary selling thrust in the western USA for Impetus, but also offers presales support for the US sales team spread all over North America. He also successfully manages client expectations, by providing the interface between the client and the offshore Impetus engineering team, all the while favorably influencing customer satisfaction. </p>\n\n<p>Anand has a Bachelors degree in Mathematics and an MBA in Marketing from the University of Indore, India.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP - Business Development","firm":{"name":"Impetus Technologies","permalink":"impetus-technologies-inc","type_of_entity":"company","image":{"available_sizes":[[[150,56],"assets/images/resized/0002/7274/27274v2-max-150x150.jpg"],[[250,93],"assets/images/resized/0002/7274/27274v2-max-250x250.jpg"],[[450,168],"assets/images/resized/0002/7274/27274v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}