{"first_name":"Anand","last_name":"Vardhan","permalink":"anand-vardhan","crunchbase_url":"http://www.crunchbase.com/person/anand-vardhan","homepage_url":"http://www.anandvardhan.com","birthplace":"Pune","twitter_username":"anandvardhan","blog_url":"http://www.anandvardhan.com","blog_feed_url":"http://www.anandvardhan.com/feed","affiliation_name":"Capgemini","born_year":1979,"born_month":4,"born_day":5,"tag_list":"anandvardhan, adobe-flex, planetria, ria, mobile-development, ceo","alias_list":null,"created_at":"Thu Sep 20 10:39:14 UTC 2012","updated_at":"Tue Oct 16 05:05:27 UTC 2012","overview":"<p>Anand is Co-Founder,CEO of Planet RIA. It offers high end  Application Development Services.\nAnand is a Flex guy who is passionate about the technology driving the RIA space. He is an Adobe Community Professional and an active contributor in various flex communities. He is Group manager cum founding member of Pune Flex User Group (a recognized Adobe user group running in Pune). He is one of the most active Adobe Community Leaders of India and working to formalize the user group communities as a legal society. He loves writing technical articles on new trends and technologies. </p>\n\n<p>By profession he is a RIA consultant and works on projects which he thinks worthy. He has worked with major clients like MorganStanley, HSBC, Citibank, Flagstar, Microsoft, McGrawHill, Pearsons, Lubrizol and CathayPacific. </p>\n\n<p>Anand is a Rich Internet Application expert his skills consist of a wide variety of today’s standards in web technology, including ASP.Net, Flex, ActionScript, Ajax, PHP, JavaScript, XML, XHTML, CSS, Database Design, SQL Server, OpenSource Databases. </p>\n\n<p>He started his career as a web developer in early 1998. He was awarded by Science and Technology minister for his contribution in computerization of a Rural Development authority. He graduated in 2000, as a Bachelor of Science in Electronics.</p>\n\n<p>He is extremely fascinated by today’s emerging bleeding edge technologies. He consistently stays up to date with the latest technological updates. Though he is cautious when it comes to using the latest and greatest in a production environment, he always looks forward to working with new technologies, programming platforms, and frameworks.</p>\n\n<p>As a RIA expert he feels comfortable in participating AJAX and Flex communities. He started sharing his views on www.anandvardhan.com. He is a true admirer of OpenSource and strongly believes in building a stronger developer community through the use and development of open source software.</p>\n\n<p>In free time he loves chatting with friends and family. He is a fun loving person and a good team member.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Delivery Lead","firm":{"name":"Capgemini","permalink":"cap-gemini","type_of_entity":"company","image":{"available_sizes":[[[150,47],"assets/images/resized/0002/2930/22930v1-max-150x150.png"],[[175,55],"assets/images/resized/0002/2930/22930v1-max-250x250.png"],[[175,55],"assets/images/resized/0002/2930/22930v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[{"description":"Co-Founder & CEO","stoned_year":2012,"stoned_month":9,"stoned_day":12,"source_url":"http://www.planetria.com/about-us.php","source_text":null,"source_description":"About Us- PlanetRIA","stoneable_type":"Person","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"first_name":"Anand","last_name":"Vardhan","permalink":"anand-vardhan"}}],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.Twitter.com/anandvardhan","title":"Twitter"},{"external_url":"http://www.linkedin.com/in/anandvardhan","title":"LinkedIn"}]}