{"first_name":"Anarbagh Encino","last_name":"Restaurant","permalink":"anarbagh-encino-restaurant","crunchbase_url":"http://www.crunchbase.com/person/anarbagh-encino-restaurant","homepage_url":"http://www.anarbaghindiancuisine.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1980,"born_month":1,"born_day":1,"tag_list":"","alias_list":null,"created_at":"Sun Aug 22 19:03:14 UTC 2010","updated_at":"Mon Aug 23 19:37:51 UTC 2010","overview":"<p>We have more than 20 years of experience in making delicious traditional dishes, with recipes from the North and the South of India. Our hard work has paid off by winning the recognition of LA Times &amp; Daily News as the best Indian restaurant in Southern California, and being critically acclaimed by AAA Magazine, LA Times and Daily News.</p>\n\n<p>Once you enter our doors, you can feel the cozy and warm environment that only a family owned restaurant can offer. In Anarbargh, each member is committed to put hard work and dedication in serving our customers in the best way.</p>\n\n<p>Our chef, with more than 17 years with us  in the art of preparing delicious dishes, is an expert on mixing the right spices and ingredients needed for the exquisite flavor and aroma that wrap our guests in a delicious and amazing experience that keeps them coming back for more.</p>\n\n<p>We have two clay ovens (Tandoori) to prepare and serve fresh food each time you order. We don’t cook anything before you request it. We cook in low cholesterol and oil free cooking is also available</p>\n\n<p>We have had the pleasure to serve famous Hollywood Stars, such as Martin Sheen and Nina Van Horn, who after trying our delicious creations have become our regular customers. This has helped us win the good reputation we have. We sincerely enjoy serving every guest entering our doors; for that reason, we are opening soon a new location in Encino where we will be offering the same amazing flavor for which Anarbargh is known.</p>","image":{"available_sizes":[[[150,61],"assets/images/resized/0009/8885/98885v2-max-150x150.jpg"],[[250,102],"assets/images/resized/0009/8885/98885v2-max-250x250.jpg"],[[450,184],"assets/images/resized/0009/8885/98885v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}