{"first_name":"andac","last_name":"ergun","permalink":"andac-ergun","crunchbase_url":"http://www.crunchbase.com/person/andac-ergun","homepage_url":"http://www.kopcha.com","birthplace":"izmir","twitter_username":"andacergun","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1976,"born_month":1,"born_day":26,"tag_list":"turkey, market-entry, subcontracting, concierge, trkiye, trkei, investment, buying, sourcing, planing, marketing, verkauf, tr","alias_list":null,"created_at":"Mon Sep 19 10:37:54 UTC 2011","updated_at":"Mon Nov 14 01:20:41 UTC 2011","overview":"<p>People know how to make or produce any product well, but they are not good at captialisation in foreign markets. \nOver the past 10 years, the world has become increasingly familiar with outsourcing. Many have discovered the need to hire professionals to deliver exceptional, private projects, work with investors, search for investors amongst other things. This is where we provide the best fit and have a track record to prove it.\nOne of the main problems of operating in foreign markets is finding and building trust. People want to do business in foreign markets but, after the theory, on the practical side, they need a man, an organization or a company that takes all the responsibility before, during and after the entry process. Real information and real know-how combined with localised knowledge is key to market entry. \nInformation and know-how is not what we sell as experts&#8230; we use it. For real success, we provide access to sources worldwide.\nAs part of our service, we promise to be discreet and non-disclosure is fundamental to every project we undertake.\nTo see what we can do for you please do not hesitate to contact us.</p>\n\n<p>andac@kopcha.com </p>\n\n<p>SpecialtiesOutsourced tasks\nEntry into new markets &amp; all related applications \nFinding &amp; arranging your local partner / distributor / agent \nMonitoring proceedings of your work in each market \nStart-ups and restructurings in the area \nInvestigation, research and development in all needed points \nManufacturing or sourcing needs, also tailored tasks \nSearch for a local ‘investor’ \nArranging teamwork in your industry &amp; branch \nBuying from Sources \nMerger Activities ( M&amp;A)</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}