{"first_name":"Anders","last_name":"Frisk","permalink":"anders-frisk","crunchbase_url":"http://www.crunchbase.com/person/anders-frisk","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 11 17:04:15 UTC 2009","updated_at":"Thu Jun 11 17:05:57 UTC 2009","overview":"<p>Anders Frisk (40) is co-founder and investment director of Sustainable Technologies Fund. Mr. Frisk has mainly been active in two business areas: sustainable development and early stage venture building and investing.  Since 1997 Mr. Frisk has worked in his own companies. After studying Business Administration at the University of Stockholm, Mr. Frisk joined the Swedish environmental NGO, The Natural Step.  Mr. Frisk worked as advisor in sustainable development and related areas, mainly with larger international companies and Swedish municipalities.  In 1994 Mr. Frisk was one of the initiators to the first Environmental Mutual Fund of its kind, Svensk Miljöfond, a partnership between The Natural Step and Swedish fund manager, Banco Fonder. </p>\n\n<p>In 1995 Mr. Frisk was appointed CEO of The Natural Step and served as such until the beginning of 1997 when he decided to start his own consultancy firm together with the former chairman of The Natural Step, Mr. Lars Bern.  Bern &amp; Partners focused on sustainable development and its implications to financial institutions such as banks and insurance companies. </p>\n\n<p>In 1998 Mr. Frisk co-founded Speed Ventures, a pan-European venture capital company. Mr. Frisk served as CEO of Speed Ventures from its inception until June 2001.  Speed Ventures became one of the leading companies of its kind and in early 2000 the company had 10 offices in 10 countries and 26 portfolio companies.  Speed Ventures was sold to Ledstiernan AB, a Swedish investment company, quoted on the Stockholm Stock Exchange.  In October 2001 Mr. Frisk started Jos &amp; Frisk Capital AB together with a former co-founder of Speed Ventures.  During the first 3 years Mr. Frisk mainly worked as temporary CEO for three companies in distress/turn around mode: Företagsfabriken, Global Responsibility and CFI Group.</p>\n\n<p>In early 2004 Jos &amp; Frisk Capital got several sourcing assignment in China on behalf of Scandinavian clients. This led to the set-up of a company in China, China Production Partner.  In November 2005 Mr. Frisk and his business partners decided to move headquarters from Stockholm to Shanghai. Mr. Frisk, however, decided to stay in Sweden and to set up the Sustainable Technologies Fund.</p>","image":{"available_sizes":[[[97,137],"assets/images/resized/0004/8055/48055v1-max-150x150.png"],[[97,137],"assets/images/resized/0004/8055/48055v1-max-250x250.png"],[[97,137],"assets/images/resized/0004/8055/48055v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founding Partner & Investment Director","firm":{"name":"Sustainable Technologies Fund","permalink":"sustainable-technologies-fund","type_of_entity":"financial_org","image":{"available_sizes":[[[150,32],"assets/images/resized/0004/8054/48054v1-max-150x150.png"],[[186,40],"assets/images/resized/0004/8054/48054v1-max-250x250.png"],[[186,40],"assets/images/resized/0004/8054/48054v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}