{"first_name":"Andreas","last_name":"Weigend","permalink":"andreas-weigend","crunchbase_url":"http://www.crunchbase.com/person/andreas-weigend","homepage_url":"http://www.weigend.com/","birthplace":"Freiburg, Germany","twitter_username":"aweigend","blog_url":"http://weigend.com/blog/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Wed Aug 13 23:37:08 UTC 2008","updated_at":"Tue Jul 07 23:33:40 UTC 2009","overview":"<p>FROM WWW.WEIGEND.COM</p>\n\n<p>Hi, I’m Andreas Weigend. I study people and the data they create. I was the Chief Scientist at Amazon.com, where I specialized in understanding how people behave online, helping Amazon build its customer-centric, measurement-focused culture.\nI now advise exciting startups and consult for established firms including Alibaba, Best Buy, Lufthansa, MySpace, and Nokia, helping some of the most brilliant entrepreneurs and executives around the world leverage user data to create innovative products and business models. I also teach at Stanford and UC Berkeley, and am often invited to speak at international events.</p>\n\n<p>CONSULTING\nIn the past few years, there has been a staggering increase across the board in the quantity and quality of data people contribute on the web and on mobile devices.\nI help my clients understand the principles underlying the social data revolution, and teach them how to transform these principles into measurable results. Together, we define user-centric metrics of engagement, and invent incentives that inspire users to participate. We create new products and business models, anchored in a solid data strategy. One way I engage with my clients is in a workshop setting, where we boil a specific problem down to its fundamentals — and solve it.</p>\n\n<p>ADVISING\nI work with carefully selected entrepreneurs as advisor or board member. In an economy where a single decision can make the difference between success and failure, my expertise and my contacts have helped more than a dozen startups to thrive.</p>\n\n<p>SPEAKING\nI regularly speak at conferences and corporate events. Recent international keynotes are Web 3.0 (Seoul), The 4 Myths of E-Commerce (Barcelona), and A River of Data — What Every Company Can Learn from Amazon.com (London). Further events in 2009 include several HSM conferences, where I will be appearing alongside notables such as Dan Ariely, Philip Kotler, Carly Fiorina and Bill Clinton.</p>\n\n<p>TEACHING\nIn my spare time, I enjoy sharing my insights and gaining new ones in my regular courses at Stanford (Data Mining and Electronic Business), UC Berkeley (Marketing 2.x), and Tsinghua/INSEAD (The Digital Networked Economy). </p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0005/2185/52185v1-max-150x150.jpg"],[[123,171],"assets/images/resized/0005/2185/52185v1-max-250x250.jpg"],[[123,171],"assets/images/resized/0005/2185/52185v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[{"funding_round":{"round_code":"angel","source_url":"http://mashable.com/2006/12/18/imagelooop-raises-cash-for-myspace-slideshows/","source_description":"ImageLooop Raises Cash for MySpace Slideshows","raised_amount":1000000,"raised_currency_code":"EUR","funded_year":2006,"funded_month":12,"funded_day":15,"company":{"name":"imageloop","permalink":"imagelooop-gmbh-2","image":{"available_sizes":[[[150,36],"assets/images/resized/0002/1460/21460v4-max-150x150.png"],[[250,59],"assets/images/resized/0002/1460/21460v4-max-250x250.png"],[[300,72],"assets/images/resized/0002/1460/21460v4-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}