{"first_name":"Andri Heidar","last_name":"Kristinsson","permalink":"andri-heiar-kristinsson","crunchbase_url":"http://www.crunchbase.com/person/andri-heiar-kristinsson","homepage_url":"http://www.plan2biz.com","birthplace":"Akureyri","twitter_username":"andriheidar","blog_url":"http://blog.plan2biz.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1982,"born_month":12,"born_day":4,"tag_list":"","alias_list":null,"created_at":"Sun Mar 27 13:47:24 UTC 2011","updated_at":"Sat Mar 03 07:58:17 UTC 2012","overview":"<p>Andri Heiðar Kristinsson is the founder and CEO of Innovit Entrepreneurship Center in Iceland and a co-founder and chairman of Plan2biz.com. </p>\n\n<p>Innovit is a catalyst for Iceland‘s entrepreneurial ecosystem which purpose is to encourage entrepreneurship amongst students and young professionals in Iceland. In 2007 Andri led a team of young people that founded Innovit in cooperation with two leading Icelandic Universities, the Association of Icelandic Industries and the New Business Venture Fund. During its existence Innovit has built up the largest business plan competition in Iceland involving all of the major universities in the country as well as becoming the national host for Global Entrepreneurship Week. With these and many more activities Andri and his team have helped and advised hundreds of entrepreneurs and startups in different sectors ranging from high tech to the creative industry. In addition to his work at Innovit, Andri serves as the chairman of the board in two Icelandic startup companies and teaches Entrepreneurship at both the University of Reykjavik and University of Iceland. Prior to founding Innovit Andri was a software engineer at an Icelandic bank, Landsbanki, for a couple of years after finishing his B.Sc. degree in computer and electronical engineering from the University of Iceland. In 2009, Andri earned a additional diploma for finishing the Entrepreneurship Development Program in the Executive Education at MIT‘s Sloan School of Management.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0012/7958/127958v2-max-150x150.jpg"],[[200,200],"assets/images/resized/0012/7958/127958v2-max-250x250.jpg"],[[200,200],"assets/images/resized/0012/7958/127958v2-max-450x450.jpg"]],"attribution":"<p>Andri Heiðar Kristinsson</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.facebook.com/andriheidar","title":""},{"external_url":"http://www.twitter.com/andriheidar","title":""},{"external_url":"http://www.plan2biz.com","title":""},{"external_url":"http://www.innovit.is","title":""}]}