{"first_name":"Andrew","last_name":"Norstrud","permalink":"andrew-norstrud","crunchbase_url":"http://www.crunchbase.com/person/andrew-norstrud","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Jagged Peak","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Aug 13 20:58:50 UTC 2009","updated_at":"Fri Aug 14 15:09:25 UTC 2009","overview":"<p>Andrew J. Norstrud is the Chief Financial Office for Jagged Peak. Andrew joined Jagged Peak in October of 2005 and has more than 10 years of management experience with rapidly growing, middle market companies. Mr. Norstrud is responsible for the Company’s accounting and finance functions, operational analysis and he plays an integral role in the development of the Company’s strategic initiatives. Mr. Norstrud oversees the company’s investor relations activities and ensures that Jagged Peak maintains the necessary infrastructure for a public entity. Prior to his role as CFO with Jagged Peak, Mr. Norstrud was the CFO of Segmentz, an asset light logistics company, which grew by more than 300% in two years, both organically and through the completion of five acquisitions. Before joining Segmentz, Mr. Norstrud worked for companies such as Grant Thornton LLP. and PricewaterhouseCoopers LLP. Mr. Norstrud’s area of experience includes consulting services, financial assurances services, logistic services, technology services and the retail industry. Mr. Norstrud earned a Bachelor’s degree in Business and Accounting from Western State College and he holds a Master of Accounting degree with a system emphasis from the University of Florida. He is a Florida-licensed Certified Public Accountant.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"CFO","firm":{"name":"Jagged Peak","permalink":"jagged-peak","type_of_entity":"company","image":{"available_sizes":[[[150,18],"assets/images/resized/0005/6393/56393v2-max-150x150.jpg"],[[250,31],"assets/images/resized/0005/6393/56393v2-max-250x250.jpg"],[[450,56],"assets/images/resized/0005/6393/56393v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}