{"first_name":"Andrew","last_name":"Jiranek","permalink":"andrew-jiranek","crunchbase_url":"http://www.crunchbase.com/person/andrew-jiranek","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"InnoCrowding","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Mar 16 15:14:28 UTC 2010","updated_at":"Wed Mar 17 22:57:34 UTC 2010","overview":"<p>Andrew Jiranek, General Corporate Counsel - InnoCrowding</p>\n\n<p>Mr. Jiranek is a founder and managing partner of the firm. His practice focuses on finance, corporate and real estate matters. He serves and has served as general counsel for a number of regional, national and international public and privately-held corporations, non-profit corporations and other business organizations. He has written numerous published articles and papers on corporate and commercial transactional topics and lectured extensively for public and private business development groups in the Baltimore area. Prior to forming the firm, Mr. Jiranek worked as General Counsel with a public high-technology company, an associate in the corporate and finance departments of several large and midsized law firms in Washington, DC and Baltimore, Maryland, an Honors Program attorney at the U.S. Department of Justice and a judicial law clerk to U.S. District Court Judge Truman Hobbs in Montgomery, Alabama. Mr. Jiranek graduated from William and Mary Law School with a J.D. in 1987, where he was an Editor of the Law Review, and from Princeton University with an A.B. in Economics in 1984. Mr. Jiranek is a member of the American Bar Association and the Maryland, D.C. and Virginia Bar Associations where he is active with several business and finance committees.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"General Corporate Counsel","firm":{"name":"InnoCrowding","permalink":"innocrowding","type_of_entity":"company","image":{"available_sizes":[[[150,32],"assets/images/resized/0007/9103/79103v2-max-150x150.jpg"],[[250,53],"assets/images/resized/0007/9103/79103v2-max-250x250.jpg"],[[450,97],"assets/images/resized/0007/9103/79103v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}