{"first_name":"Andrew","last_name":"Yu","permalink":"andrew-yu","crunchbase_url":"http://www.crunchbase.com/person/andrew-yu","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Modo Labs","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Oct 25 13:34:02 UTC 2011","updated_at":"Fri Oct 28 19:21:20 UTC 2011","overview":"<p>Andrew Yu is an expert on smartphones and mobile devices, with more than 16 years of Internet and mobile software experience in the U.S. and Asia. In addition to his role as Chief Executive Officer, Yu is also the co-founder of iMobileU, a community of educational institutions with a shared interest in mobile development with hundreds of members from some of the top universities in the world.</p>\n\n<p>Prior to his role with Modo Labs, Yu was the mobile platform manager, architect and instructor at the Massachusetts Institute of Technology (MIT), spearheading its mobility strategy, which included device recommendations, end-user support and application development, which produced the MIT Mobile Framework.</p>\n\n<p>Yu co-instructed with Prof. Hal Abelson MIT’s Developing Mobile Applications computer science class, where student teams developed innovative software for various smartphone platforms in partnership with Google, Nokia and Microsoft.</p>\n\n<p>He is a frequent speaker at industry conferences promoting mobile applications at universities and the author of the book The OS Wars: Smartphone systems battle for markets, published by CLSA.</p>\n\n<p>Yu graduated from Harvard University with a BA in physics and East Asian studies. He also studied electrical engineering and computer science at MIT.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Modo Labs","permalink":"modo-labs","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0008/6845/86845v1-max-150x150.png"],[[220,220],"assets/images/resized/0008/6845/86845v1-max-250x250.png"],[[220,220],"assets/images/resized/0008/6845/86845v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}