{"first_name":"Andrew","last_name":"Pearson","permalink":"andrew-pearson","crunchbase_url":"http://www.crunchbase.com/person/andrew-pearson","homepage_url":"http://www.qlx.com","birthplace":"Peshawar","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jun 15 21:04:41 UTC 2011","updated_at":"Fri Jun 17 23:56:31 UTC 2011","overview":"<p>Andrew Pearson was born in Pakistan, grew up in Singapore and was educated in England and America. With a degree in psychology from UCLA, Pearson has had a varied career in marketing, mobile technology, social media and entertainment. With producer Gwen Field, Pearson optioned and adapted the novels Open Water, The Sunday Macaroni Club, The Jukebox Queen of Malta, Scavenger Reef, Fugitive Moon and Snakes In The Garden, attaching such talented directors as Kevin Hooks, Fraser Heston, Mark Lester, Diane Ladd and Jorge Ramirez-Suarez. Companies such as Bridgeview Films, Agamemnon Films, American World Pictures, Magic Hour Media and Boldface Films have optioned his adaptations. Pearson has also been commissioned to write two spec scripts and his adaptation of Steve Lopez’s The Sunday Macaroni Club was a 2004 Zoetrope Screenwriting Quarterfinalist. Pearson&#8217;s latest script, The Fairer Sex, was a Finalist in the first screenwriting competition it was submitted to &#8211; the 4th Screenplay Search Competition (under its previous title THE FLIRTING GAME). Going against the grain, Pearson is adapting the screenplay into a novel.</p>\n\n<p>In 2005, Pearson founded Intelligentsia Films, a full-fledged interactive, multimedia and social media company, which develops websites and creates iPhone and mobile marketing applications. Pearson is now producing mobile apps and working in the social media realm. Pearson is extremely excited about the future of entertainment, a future where a filmmaker can actually make a living by shooting a movie on an iPhone, editing the footage on an iMac and releasing the final product to the world through mobile and social media outlets.</p>\n\n<p>In 2009, two books that Mr. Pearson edited appeared in print; the first in the Double Down On Your Data series, Clive Pearson’s How Analytics is Revolutionizing the Casino Industry and Santiago Maggi’s Investment Strategies for Uncertain Markets, a book about the financial markets that presciently predicted the 2007 global financial meltdown. In 2010, Pearson also wrote The Mobile Revolution and it was published by Qualex Publishing. It is currently available at Amazon.com.</p>\n\n<p>An avid traveler, Pearson is a sought-after speaker on such disparate topics as casino and mobile marketing, social media and interactivity. If he&#8217;s not pounding the pavements in LA, he&#8217;s probably wandering the labyrinthian streets of Hong Kong&#8217;s Lang Kwai Fong, or tearing up useless betting slips at Happy Valley (perhaps the most perfecty named racetrack in the world (for some)), or dining at a hawker center in Singapore, or doubling down at the gaming tables in Macau. Basically, Pearson&#8217;s trying to find the next great story that the world doesn&#8217;t yet know that it desperately wants to see. </p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0013/9386/139386v2-max-150x150.jpg"],[[250,165],"assets/images/resized/0013/9386/139386v2-max-250x250.jpg"],[[450,298],"assets/images/resized/0013/9386/139386v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"Psychology","institution":"UCLA","graduated_year":2009,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}