{"first_name":"Andrew","last_name":"Bates","permalink":"andrew-bates-2","crunchbase_url":"http://www.crunchbase.com/person/andrew-bates-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Mar 24 09:13:44 UTC 2011","updated_at":"Thu Mar 24 09:17:23 UTC 2011","overview":"<p>Andrew Bates is a strategic interactive marketing programs and technology subject matter expert with over a dozen years of web and business technology management and consulting experience.  At EyeTraffic, he is responsible for developing and managing client-specific interactive marketing strategies as well as evolving ETM’s new media services.  Prior to joining EyeTraffic, Andrew spent two years with internet leader, Network Solutions, developing infrastructure and services for search engine optimization (SEO) and social media, and preparing search marketing strategies for groups like XO Communications, Rosetta Stone, and the Environmental Protection Agency (EPA).  Earlier, he served as Director of Sales at Lore Internet Systems, where he managed sales, marketing, and branding efforts.  For the last 7 years, Andrew has been an avid member of the Northern Virginia Technology Council (NVTC.org) serving as a founding member of both the Tech Innovations and Social Media Committees.  Andrew attended the University of Virginia where he studied social statistics, and is a frequent speaker on the topics of Internet Marketing and Social Media for both businesses and nonprofits.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Client Services Manager","firm":{"name":"EyeTraffic Media","permalink":"eyetraffic-media","type_of_entity":"company","image":{"available_sizes":[[[150,72],"assets/images/resized/0012/7533/127533v1-max-150x150.jpg"],[[212,103],"assets/images/resized/0012/7533/127533v1-max-250x250.jpg"],[[212,103],"assets/images/resized/0012/7533/127533v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}