{"first_name":"Andrea","last_name":"Rosi","permalink":"andrea-rosi","crunchbase_url":"http://www.crunchbase.com/person/andrea-rosi","homepage_url":"","birthplace":"Brescia","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1957,"born_month":8,"born_day":5,"tag_list":"","alias_list":"","created_at":"Thu Jan 28 14:53:17 UTC 2010","updated_at":"Thu Jan 28 18:46:45 UTC 2010","overview":"<p>He&#8217;s one of the most experienced managers of the Italian Music Industry and he is seen as the point of reference for the Digital Music environment.\nDuring the eighties he was Marketing Director in Warner Music Italy, then during the nineties he was Managing Director at Polygram Italy where he had fantastic achievements in A&amp;R and Marketing.\nAfter the merger with Universal he left the company and became one of the founders of one of the very first Digital Music platforms called &#8220;Vitaminic&#8221;. He was the Coo of the company, becoming one of the pioneers of the European Digital  Music Industry overviewing the company operations in 9 countries in Europe. The company did the Ipo on the Italian Stock Exchange in 2000 and it was sold to Buongiorno in 2003. Right after having left Vitaminic he joined Bmg Italy  starting the very first Digital Business Unit of the Italian Music Industry.\nIn 2005, after the merger with Sony, he became member of the SonyBmg European Digital Board, being responsible for Digital Business Development in Southern Europe. In 2006 was also elected Member of the Global Board for MEF (Mobile Entertainment Forum). In 2007 he went back to Sonymusic Italy as Managing Director for RCA Records. In 2009 he left the Sonymusic  to start his own Music Consulting Company. He&#8217;s actually working for F&amp;P Group, the leading Italian Touring agency, as a consultant for Strategy and Business Development with particular focus on Digital Marketing and online Ticketing  .</p>","image":{"available_sizes":[[[116,150],"assets/images/resized/0007/5256/75256v2-max-150x150.jpg"],[[194,250],"assets/images/resized/0007/5256/75256v2-max-250x250.jpg"],[[349,450],"assets/images/resized/0007/5256/75256v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"","firm":{"name":"musiXmatch","permalink":"musixmatch","type_of_entity":"company","image":{"available_sizes":[[[143,59],"assets/images/resized/0008/3297/83297v12-max-150x150.png"],[[143,59],"assets/images/resized/0008/3297/83297v12-max-250x250.png"],[[143,59],"assets/images/resized/0008/3297/83297v12-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}