{"first_name":"Andrew","last_name":"Paulson","permalink":"andrew-paulson","crunchbase_url":"http://www.crunchbase.com/person/andrew-paulson","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 28 20:19:47 UTC 2009","updated_at":"Wed Jan 28 20:19:47 UTC 2009","overview":"<p>Andrew Paulson was born in 1958 and brought up in America and England. He graduated with a BA in French Literature and Literary Criticism from Yale Univer-sity in 1981 and attended the Yale School of Drama. From 1982-86 he lived in Berlin and Paris writing novels; from 1987-93 he lived in Paris, London and Milan shooting fashion and advertising photography. </p>\n\n<p>He moved to Moscow in 1993 where he developed several publishing projects and shortly after the Russian financial crisis of August, 1998, founded Afisha Publishing House (Afisha, Bolshoi Gorod, and Afisha MIR) which was sold to ProfMedia in 2005. To this day Afisha Publishing House sets the high water mark for independent magazine publishing in Russia &#8211; in design, content, corporate culture, transparency and profitability.</p>\n\n<p>In 2006, Paulson founded SUP which is now the largest online media company in Russia, consisting of LiveJournal (principal blogging platform/social network in Russia, with a monthly reach of one third of Russian internet users, with 30m unique visitors/month worldwide), Championat (#1 sports site in Russia), and Gazeta (#1 news site in Russia). Paulson is currently the Chairman of the Board of Directors.</p>","image":{"available_sizes":[[[96,150],"assets/images/resized/0003/5080/35080v1-max-150x150.jpg"],[[160,250],"assets/images/resized/0003/5080/35080v1-max-250x250.jpg"],[[240,373],"assets/images/resized/0003/5080/35080v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}