{"first_name":"Andrew","last_name":"J Filipowski","permalink":"andrew-j-filipowski-2","crunchbase_url":"http://www.crunchbase.com/person/andrew-j-filipowski-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Nov 30 20:55:40 UTC 2008","updated_at":"Sun Nov 30 20:58:45 UTC 2008","overview":"<p>Mr. Filipowski is chairman and chief executive officer of SilkRoad Equity, LLC, a private investment firm. Named one of the 100 most influential individuals in the technology field as recognized by Upside magazine and one of 2008&#8217;s 75 Most Influential People in the Triad by The Business Journal, Mr. Filipowski is one of the world&#8217;s most successful technology entrepreneurs, philanthropists, and industry visionaries. Mr. Filipowski built one of the top 10 global software companies in record time and now devotes all of his expertise, thought leadership and entrepreneurial talent to the portfolio companies of SilkRoad Equity.</p>\n\n<p>Prior to founding SilkRoad Equity, Mr. Filipowski founded divine, inc. in 1999, and served as its chief executive officer until May 2003. Mr. Filipowski founded PLATINUM technology, inc. in 1987, and amassed one of the most valuable technology and service offerings in the software industry. PLATINUM became one of the most recognized entrepreneurial success stories, growing from a startup to the eighth-largest software enterprise in the world, reaching $1 billion in revenue before its sale to Computer Associates International, Inc. in 1999, for nearly $4 billion - the largest acquisition of a software company at the time. In 1979, Mr. Filipowski founded DBMS, Inc., and served as its president and chief executive officer from 1979 until March of 1987. During this period, DBMS grew from a startup to a major international software enterprise with revenues of $25 million. DBMS ranked in the Inc. Magazine 500 list of the fastest-growing privately held companies in the United States.</p>\n\n<p>From May 1974 to March 1979, Mr. Filipowski served as executive vice president, chief operating officer, and in other executive capacities with Cullinet Software, Inc., the largest software company of that era, credited with pioneering many software business innovations. Before Cullinet, Mr. Filipowski served in various managerial and technical positions with A.B. Dick, Motorola, and Time, Inc. Mr. Filipowski founded PLATINUM Venture Partners in 1992, and funded a number of successful Internet and technology ventures including Whittman-Hart, an information technology consulting firm; StarMedia, a Latin American online network; Yesmail, an Internet marketing services provider; Blue Rhino, a retailer and innovator in propane distribution; and LiquidAudio, a provider of software uniting music and technology. As an advocate of humanitarian and Internet-related issues, Mr. Filipowski is often recognized as a mentor, leader and lecturer in the community. In addition to supporting a variety of charitable organizations, Mr. Filipowski is the founder and chairman of two not-for-profit foundations, the PLATINUM Wildlife Foundation, which is dedicated to the protection and preservation of endangered species, and the Filipowski Foundation. Mr. Filipowski is co-owner of the Winston-Salem Warthogs baseball team.</p>\n\n<p>Mr. Filipowski is a director of various companies, including: Cryo-Cell International, InterAct911 Corporation, HardMetrics, Inc., Mastro Auctions, MissionMode Solutions, Inc., onramp Branding, LLC, Pendulab, Inc., Primo Water Corporation, SilkRoad Realty Holdings, LLC, SilkRoad Technology, Inc., SolidSpace, LLC and TrueSentry, Inc.</p>","image":{"available_sizes":[[[118,150],"assets/images/resized/0003/0290/30290v1-max-150x150.jpg"],[[197,250],"assets/images/resized/0003/0290/30290v1-max-250x250.jpg"],[[355,450],"assets/images/resized/0003/0290/30290v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder & Chairman","firm":{"name":"SilkRoad Equity","permalink":"silkroad-equity","type_of_entity":"financial_org","image":{"available_sizes":[[[150,20],"assets/images/resized/0003/0288/30288v1-max-150x150.jpg"],[[197,27],"assets/images/resized/0003/0288/30288v1-max-250x250.jpg"],[[197,27],"assets/images/resized/0003/0288/30288v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Executive Chairman","firm":{"name":"MissionMode","permalink":"missionmode","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}