{"first_name":"Andrew","last_name":"Chung","permalink":"andrew-chung","crunchbase_url":"http://www.crunchbase.com/person/andrew-chung","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Khosla Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"vc, venture-capital, cleantech, bioenergy, biofuel, solar, storage, smart-grid, efficiency, led-lighting, clean-coal, greentech, china, mandarin, cantonese, education, nursing, genomics, bioinformatics, healthcare, software, internet, social-gaming","alias_list":null,"created_at":"Fri May 25 07:30:50 UTC 2012","updated_at":"Tue Oct 09 03:49:17 UTC 2012","overview":"<p>Andrew is a Partner at Khosla Ventures who is interested in developing leading companies in cleantech, Internet, mobility, education, and medtech and also leads the firm’s China activities. Andrew seeks to work with exceptional entrepreneurs in building the world’s most innovative companies and changing the world for the better. He is one of six Partners at Khosla, and is a director on the boards of Wattpad, Incredible Labs (mobile/Web); Lanzatech, LS9 (bioenergy); EcoMotors (efficiency); Pellion, Liquid Metal Battery Co. (storage); and Biodiscovery (agriculture).</p>\n\n<p>Prior to Khosla Ventures, Andrew was at Lightspeed Venture Partners and helped build the firm’s practice areas in cleantech, education, and genomics. During his tenure, he helped drive and manage Lightspeed’s investments in Solazyme (NASDAQ: SZYM), LS9 (bioenergy); Stion (solar); Coaltek (clean coal), Leyden Energy (storage); Orbis (nursing education); and Personalis (genome interpretation).</p>\n\n<p>In addition to assisting his portfolio companies, Andrew is a frequent speaker at industry events, was Founding Chair of the Cleantech Board for The Indus Entrepreneurs Group (TiE), and has been a long-time advisor to the Cleantech Open (CTO). Andrew has also advised various government officials, including the former Lieutenant Governor for California and the California Commission for Economic Development, on cleantech-related policy issues.</p>\n\n<p>Prior to joining Lightspeed, Andrew was an investor at Bain Capital and TL Ventures, where he supported buyout and venture investments in healthcare, software and semiconductors. Previously, Andrew was a management consultant with Bain &amp; Company in Greater China, where he serviced clients in energy, private equity, retail, and logistics. Earlier in his career, Andrew co-founded UberWorks, an e-commerce platform startup incubated at Trilogy, and led the company through a successful acquisition by a public company.</p>\n\n<p>Andrew is an avid musician and nearly pursued a singing career several times in his life, after winning a national Chinese singing contest in the U.S. and becoming a finalist in Hong Kong’s version of American Idol. He has performed as a vocalist and conductor at the Lincoln Center, the Kennedy Center, the Shanghai Conservatory and an off-Broadway musical theatre.</p>\n\n<p>Andrew graduated Phi Beta Kappa in Applied Mathematics from Harvard University and holds an MBA from The Wharton School of the University of Pennsylvania.</p>","image":{"available_sizes":[[[114,150],"assets/images/resized/0019/3895/193895v2-max-150x150.jpg"],[[191,250],"assets/images/resized/0019/3895/193895v2-max-250x250.jpg"],[[343,450],"assets/images/resized/0019/3895/193895v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"Applied Mathematics","institution":"Harvard University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"Venture Capital","institution":"The Wharton School, University of Pennsylvania","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Khosla Ventures","permalink":"khosla-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,36],"assets/images/resized/0000/1507/1507v1-max-150x150.jpg"],[[250,60],"assets/images/resized/0000/1507/1507v1-max-250x250.jpg"],[[300,73],"assets/images/resized/0000/1507/1507v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Board Member","firm":{"name":"Incredible Labs","permalink":"incredible-labs","type_of_entity":"company","image":null}},{"is_past":false,"title":"Board Member","firm":{"name":"Wattpad","permalink":"wattpad","type_of_entity":"company","image":{"available_sizes":[[[150,47],"assets/images/resized/0019/3464/193464v2-max-150x150.png"],[[250,79],"assets/images/resized/0019/3464/193464v2-max-250x250.png"],[[450,142],"assets/images/resized/0019/3464/193464v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Board Member","firm":{"name":"Jetpac","permalink":"jetpac","type_of_entity":"company","image":{"available_sizes":[[[150,55],"assets/images/resized/0018/3515/183515v1-max-150x150.png"],[[250,91],"assets/images/resized/0018/3515/183515v1-max-250x250.png"],[[318,117],"assets/images/resized/0018/3515/183515v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/achung","title":"Linkedin"}]}