{"first_name":"Andrew","last_name":"R. Garman","permalink":"andrew-r-garman","crunchbase_url":"http://www.crunchbase.com/person/andrew-r-garman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri May 15 19:41:04 UTC 2009","updated_at":"Fri May 15 19:42:42 UTC 2009","overview":"<p>Andrew R. Garman, Managing Partner, was a founder of New Venture Partners. Today, he attends to the needs of the firm’s limited partners and investors, developing partnerships with major technology corporations, collaborating with the team on creating and investing in new ventures, and overseeing strategy and operations with his fellow managing partners.<br/>\nAndy has twenty years of investment and management experience in the formation of new ventures and the commercialization of technology from corporations and institutional labs. He has worked closely with senior R&amp;D management at many of the world&#8217;s top technology companies, including IBM, Philips, British Telecom, Siemens, Lucent,SRI, and Xerox.\nPreviously he was a Vice President at Lucent Technologies, charged with developing ventures from Bell Labs; the Managing Director of BT Ventures at Bankers Trust Company, where he managed a portfolio of internally generated spin-outs in information technology; and Vice President of Strategy and Business Development for Xerox’s New Enterprise Group, commercializing the technology of Xerox, including that of the Palo Alto Research Center (PARC). \nAndy has served on the boards of companies in the U.S. such as Vallent Corp. (acquired by IBM), Celiant Corporation (acquired by Andrew Corporation), Lucent Public Safety Systems (acquired by Intrado), Placeware (acquired by Microsoft), InXight Software, Inc. (acquired by Business Objects), SiPort, ColoRep Inc., Amati Communications Corp. (acquired by Texas Instruments), dpiX Inc., AcuPrint Inc., Document Forum (acquired by TheLaw.com), Chrystal Software (now Astoria) and  iBiquity Digital Corporation (as an observer); in the U.K. including Azure Solutions Ltd. (acquired by Subex), Psytechnics Ltd., and Vidus Ltd. (acquired by @Road); and in India: Subex Limited (SUBEX.NS). \nHe began his career doing research and development in alternative energy systems, combustion and air pollution, authoring or co-authoring 23 technical publications. \nAndy holds an AB in Engineering and Applied Physics from Harvard College, an MS in Mechanical Engineering from Stanford University, and an MBA from Stanford University, where he was named an Arjay Miller Scholar. He is a past president of the Stanford Business School Alumni Association and member of the Board of Advisors and a member of the Dean&#8217;s Advisory Council of the Harvard School of Engineering and Applied Sciences. \nNew Venture Partners, the global venture capital firm dedicated to corporate technology spin-outs, has over $700 million under management. New Venture Partners provides a bridge between technology corporations and traditional venture capital. Starting in 1997 as Lucent Technologies New Ventures Group and operating as an independent firm since 2001, the New V enture Partners team has launched dozens of companies built upon innovati ons from Bell Labs, British Telecom, Philips, and other major technology companies.</p>","image":{"available_sizes":[[[150,79],"assets/images/resized/0004/4290/44290v1-max-150x150.jpg"],[[250,132],"assets/images/resized/0004/4290/44290v1-max-250x250.jpg"],[[327,173],"assets/images/resized/0004/4290/44290v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Partner","firm":{"name":"New Venture Partners","permalink":"new-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,44],"assets/images/resized/0003/4307/34307v1-max-150x150.png"],[[221,66],"assets/images/resized/0003/4307/34307v1-max-250x250.png"],[[221,66],"assets/images/resized/0003/4307/34307v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}