{"first_name":"Andrea","last_name":"S. Kaufman","permalink":"andrea-s-kaufman","crunchbase_url":"http://www.crunchbase.com/person/andrea-s-kaufman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Nov 25 07:09:37 UTC 2008","updated_at":"Tue Nov 25 07:13:57 UTC 2008","overview":"<p>Andrea is a general partner at Novak Biddle Venture Partners. Since joining the fund in 1999 she has invested in companies across a broad range of technologies. Andrea has an interest in software, video and television, as well as information and physical security. Andrea led Novak Biddle’s investment in Matrics (acquired by Symbol Technologies), ObjectVideo, Avail Media, Intelliworks, CounterStorm and Centrifuge Systems. She has also been actively involved in the fund’s investments in Trusted Computer Solutions and Trusted Edge (acquired by Filetek).</p>\n\n<p>Andrea served as a judge for Ernst &amp; Young’s Entrepreneur of the Year Award in 2007. She has also been a member of the Steering Committee for the Mid-Atlantic Venture Association’s Capital Connection since 2005. In 2005 Andrea served as the co-chair for Early Stage East. In 2004, Washington Business Forward Magazine named Andrea to The Next Network, its list of 40 Rising Stars.</p>\n\n<p>Prior to joining Novak Biddle, Andrea was a corporate finance attorney for 5 years representing technology companies, underwriters, and private equity funds.</p>\n\n<p>Andrea received a Bachelor of Arts in political science from the Johns Hopkins University. She also earned a Juris Doctor from Fordham University and a Masters of Law in Taxation from Georgetown University. She is admitted to the bar in New York and Washington, D.C.</p>","image":{"available_sizes":[[[122,145],"assets/images/resized/0002/9527/29527v1-max-150x150.jpg"],[[122,145],"assets/images/resized/0002/9527/29527v1-max-250x250.jpg"],[[122,145],"assets/images/resized/0002/9527/29527v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Novak Biddle Venture Partners","permalink":"novak-biddle-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,69],"assets/images/resized/0000/3475/3475v1-max-150x150.png"],[[200,93],"assets/images/resized/0000/3475/3475v1-max-250x250.png"],[[200,93],"assets/images/resized/0000/3475/3475v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}