{"first_name":"Andreas","last_name":"Roell","permalink":"andreas-roell","crunchbase_url":"http://www.crunchbase.com/person/andreas-roell","homepage_url":"http://www.gearyi.com","birthplace":"","twitter_username":"andreasceo","blog_url":"http://www.gearyi.com/fresh","blog_feed_url":"","affiliation_name":"Geary Interactive","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Apr 28 18:16:54 UTC 2009","updated_at":"Mon Jun 15 22:13:48 UTC 2009","overview":"<p>Andreas Roell is co-founder, board chairman and CEO of Geary Interactive. </p>\n\n<p>Roell co-founded Geary Interactive in 2000, since then has built it into a successful enterprise with more than 60 employees specializing in website design, online media planning and buying, search engine marketing, data analytics and e-mail marketing.  Leading the long-term corporate planning, Roell’s strategic vision and leadership has organically grown Geary Interactive into one of the nation’s largest independent digital marketing agencies. </p>\n\n<p>Recently appointed to the American Advertising Federation’s (AAF) board of directors, Roell is one of the youngest AAF Silver Medal recipients for his contributions to the advertising community. Before his role on the board of directors, Roell served as a governor of the AAF’s Southwestern Region, and he is a member of the IAB’s (Interactive Advertising Bureau) online lead generation board.  Named twice in a row as one of San Diego’s most admired CEOs, Roell was also ranked as one of the Top 40 Entrepreneurs under 40. He is a frequent industry expert with national media outlets such as Fox News and NBC.  In addition, Roell is an industry columnist with influential publications, such as ClickZ and iMedia Connection, and he regularly contributes to other national publications. Roell is an active angel investor who functions as an advisor to early stage technology companies and actively pursues his charitable interests through active involvements in organizations like Mainly Mozart and Make-a-wish Foundation.</p>","image":{"available_sizes":[[[150,124],"assets/images/resized/0004/8594/48594v2-max-150x150.jpg"],[[250,207],"assets/images/resized/0004/8594/48594v2-max-250x250.jpg"],[[450,373],"assets/images/resized/0004/8594/48594v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Board Chairman & CEO","firm":{"name":"Geary Interactive","permalink":"geary-interactive","type_of_entity":"company","image":{"available_sizes":[[[150,35],"assets/images/resized/0004/2668/42668v4-max-150x150.jpg"],[[158,37],"assets/images/resized/0004/2668/42668v4-max-250x250.jpg"],[[158,37],"assets/images/resized/0004/2668/42668v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.linkedin.com/pub/andreas-roell/0/55/38","title":"Andreas on LinkedIn"}],"web_presences":[{"external_url":"http://www.twitter.com/andreaceo","title":"Andreas on Twitter"}]}