{"first_name":"Andrew","last_name":"Hsu","permalink":"andrew-hsu","crunchbase_url":"http://www.crunchbase.com/person/andrew-hsu","homepage_url":"http://www.andrewhsu.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Airy Labs","born_year":1991,"born_month":null,"born_day":null,"tag_list":"andrew-hsu, airy-labs, knowledge, education, learning, neuroscience, gaming","alias_list":null,"created_at":"Sun Apr 17 08:19:35 UTC 2011","updated_at":"Sun Oct 21 07:02:42 UTC 2012","overview":"<p>Andrew Hsu was a 19-year-old 4th year Ph.D. candidate in the Stanford University Neuroscience Program when he left in early 2011 to found Airy Labs, a startup dedicated to building the next generation of social learning games for young kids around the world. </p>\n\n<p>Airy Labs builds iOS games on mobile and tablet, social games for the browser, and casual massively multiplayer online games (MMOs), all with educational missions that will teach kids both school courses and real life skills that they need to be successful in their lives.</p>\n\n<p>In addition to running his startup, Andrew designs transmedia games that integrate alternate reality and storytelling for businesses, nonprofits, conferences, festivals, and sports and other events. He is currently creating a science fiction-based game for an international film festival that will be held in late 2011. </p>\n\n<p>Another of his great passions is to make the world a better place through nonprofit volunteering. He cofounded the World Children&#8217;s Organization (WCO) with his brother Patrick in 2002 to address education and health issues for underprivileged children around the world. The WCO&#8217;s most recent project is Hepatitis B vaccinations in China. </p>\n\n<p>In 2011, Andrew cofounded the nonprofit Learn by Play Foundation, dedicated to using gamification, neuroscience, and technology to change education. Learn by Play is creating programs for young students in inner-city schools with the goal of reigniting their passion for and engaging them fully in learning. It is the mission and ultimate goal of Learn by Play to create a global network of public charter schools that use game mechanics and strategies to transform how our next generation learns.</p>\n\n<p>Andrew believes in harnessing the incredible power of games to change the world, specifically to change education and raise awareness, influence mindsets and behavior, and bring large-scale changes to such global social issues as poverty, human rights, child abuse, child prostitution, and genocide.</p>\n\n<p>He is also a writer, and is currently working on a book on his blueprints to change the world through changing education using gamification, technology, and neuroscience. Andrew also speaks around the world on these topics along with his personal story.</p>\n\n<p>When Andrew was 10, he started to conduct molecular biology research at a pathology lab at the University of Washington. A year afterward, at 11, he became the youngest person to ever win a grand prize at the Washington State Science and Engineering Fair. He was also the youngest finalist in the history of the Intel International Science Fair. He matriculated at the University of Washington at age 12 and graduated with three honors B.S. degrees in Neurobiology, Biochemistry, and Chemistry, and a minor in mathematics.</p>\n\n<p>At the Stanford Neuroscience Ph.D. Program, he was a Frances B. Nelson Fellow and a Smith Stanford Graduate Fellow. He is the author of several books, including A Life of Science. He was also a competitive swimmer before he went to college, posting the fastest 100 butterfly time on the West Coast of the US among 12-year-olds.</p>\n\n<p>Andrew has also appeared on NBC, ABC, CBS, Time magazine for kids, and the National Geographic magazine for kids.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0013/0892/130892v6-max-150x150.jpg"],[[150,150],"assets/images/resized/0013/0892/130892v6-max-250x250.jpg"],[[150,150],"assets/images/resized/0013/0892/130892v6-max-450x450.jpg"]],"attribution":"<p>Andrew Hsu</p>"},"degrees":[{"degree_type":"MS","subject":"Neuroscience","institution":"Stanford University","graduated_year":2011,"graduated_month":null,"graduated_day":null},{"degree_type":"BS","subject":"Neurobiology","institution":"University of Washington","graduated_year":2007,"graduated_month":null,"graduated_day":null},{"degree_type":"BS","subject":"Biochemistry","institution":"University of Washington","graduated_year":2007,"graduated_month":null,"graduated_day":null},{"degree_type":"BS","subject":"Chemistry","institution":"University of Washington","graduated_year":2007,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Airy Labs","permalink":"airy-labs","type_of_entity":"company","image":{"available_sizes":[[[150,69],"assets/images/resized/0013/1518/131518v5-max-150x150.png"],[[214,99],"assets/images/resized/0013/1518/131518v5-max-250x250.png"],[[214,99],"assets/images/resized/0013/1518/131518v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://stanmed.stanford.edu/2008spring/restless_minds.html","title":"Stanford University Report"},{"external_url":"http://www.youtube.com/watch?v=_OntiXRsuOY","title":"NBC Today Show: Today's American Story"},{"external_url":"http://seattletimes.nwsource.com/html/localnews/2003752165_andrewhsu18m.html","title":"Seattle Times: 3 degrees aren't enough for 16-year-old UW grad"},{"external_url":"http://community.seattletimes.nwsource.com/archive/?date=20030411&slug=smart11m","title":"Seattle Times: Issaquah 11-year-old wows state science fair"}],"web_presences":[{"external_url":"http://www.linkedin.com/in/andrewdhsu","title":"Andrew's Linkedin"}]}