{"first_name":"Andrew","last_name":"Abouchar","permalink":"andrew-abouchar","crunchbase_url":"http://www.crunchbase.com/person/andrew-abouchar","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Feb 17 20:23:57 UTC 2008","updated_at":"Tue Feb 19 02:24:41 UTC 2008","overview":"<p>Andrew brings over 12 years of venture capital experience to his role at Tech Capital. Portfolio companies benefit from his solid understanding of the commercialization opportunities in high-tech markets, extensive transactional experience and network of industry contacts.</p>\n\n<p>Previously, Andrew was Vice President of Working Ventures Canadian Fund, one of Canada&#8217;s largest venture capital funds and worked as a Chartered Accountant for Coopers and Lybrand. He has successfully structured financing transactions, acquisitions and Initial Public Offerings for numerous early-stage ventures and draws on his financial expertise to help portfolio companies develop effective business strategies and financing solutions.</p>\n\n<p>Andrew is also a committed advocate of technological innovation and serves as a board member for several initiatives that foster the commercialization of ground-breaking technologies, including:</p>\n\n<ul>\n<li>the Natural Sciences and Engineering Research Council (NSERC), Idea to Innovation Program - fast-tracks the development and transfer of promising technologies</li>\n<li>the Ontario Centres of Excellence - supports the development and commercialization of new technologies</li>\n<li>QuantumWorks - a network of researchers committed to furthering quantum research in Canada</li>\n</ul>\n\n<p>Andrew has held executive positions and served on the boards of numerous technology companies, including Covarity Inc., Sirific Wireless Corp. and VideoLocus Inc. He also sits on the Council for Examiners for the CFA Institute and is frequently asked to lecture on early stage technology business and financing.</p>","image":null,"degrees":[],"relationships":[{"is_past":null,"title":"Partner","firm":{"name":"Tech Capital Partners","permalink":"tech-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,43],"assets/images/resized/0003/0285/30285v1-max-150x150.png"],[[250,72],"assets/images/resized/0003/0285/30285v1-max-250x250.png"],[[266,77],"assets/images/resized/0003/0285/30285v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}