{"first_name":"Andrew","last_name":"Skeene","permalink":"andrew-skeene-2","crunchbase_url":"http://www.crunchbase.com/person/andrew-skeene-2","homepage_url":"http://www.andrewskeene.org","birthplace":"","twitter_username":"andrewskeene","blog_url":"http://www.andrewskeene.com","blog_feed_url":"","affiliation_name":"Global Forestry Investments","born_year":1977,"born_month":1,"born_day":11,"tag_list":"andrew-skeene, businessman, entrepreneur, co-founder, director","alias_list":null,"created_at":"Thu Jul 05 07:27:52 UTC 2012","updated_at":"Thu Jul 05 17:21:24 UTC 2012","overview":"<p>Andrew Skeene is an innovative businessman with clear and distinct commercial instincts that have helped him succeed throughout numerous sectors and job descriptions. With fifteen years of business experience to rely on, he makes exceptionally keen analyses of business situations and creates the solutions that best fit the situation. His business history shows that he is consistent in his strategic skills and, with his strong leadership abilities, he is able to develop cohesive teams of professionals who work together to achieve positive results in every project. His professional business skills and extensive experience in the field help him identify and evaluate potential business opportunities, handle business negotiations and follow through any job to a successful completion.</p>\n\n<p>Current Positions Providing Ethical Investments in the Forest Industry</p>\n\n<p>Working from a deep concern for the world&#8217;s forestry, Andrew Skeene helped co-found Global Forestry Investments in 2008. With offices in London, Brazil and Dubai, the company invests in forestry projects around the world. The investments are ethical perks of tax credits and meet the requirements for green benefits. He has varied tasks that include responsibility for developing and putting a strategic plan in place while implementing the defined strategies for investment. He oversees client services such as supervising and managing the investments in Brazil and he assists in identifying and evaluating new local investment opportunities. He conducts careful and in-depth analysis of the international forestry industry that includes the agricultural product industry and puts together analytical and technical support in the process of preparing detailed reports that accurately portray his findings. While searching out new avenues of investment for the company, he also conducts a financial analysis and prepares a model of the investments with valuation tracking trends. He also maintains constant oversight and development of the company&#8217;s branding and positioning in the market. Investment successes at the company include Belem Sky Plantation Phase One, which covered about 100 hectares of land, Belem Sky Plantation Phase Two, with some 70 hectares and Belem Sky Plantation Phase Three, which added another 600 hectares. Other successes with the company include partnering with a Scandinavian retail distributor and creating an IFA distribution unit that reaches 10,000 IFAs. He also created a working partnership with Self Invested Pension Producers and a bond provider working offshore.</p>\n\n<p>Since 2009 Andrew Skeene  has established and co-owned MÃOS SEGURAS, where he manages the client relationships as well as business development. He manages everything from small woodland projects to community deals and large forestry endeavours. He offers advice to clients pertaining to good forestry practices and he helps the owners of the woodlands in choosing tree species that will regenerate and are appropriate for the land.</p>\n\n<p>Goals in Sustainable Forestry</p>\n\n<p>Along with protecting the forest, Andrew Skeene has seen first hand how the investments in sustainable forestry help the local communities. Through these investments in regional forestry, projects that provide general schools as well as those with an emphasis on sports and performing arts will be provided for the children.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0019/8931/198931v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0019/8931/198931v2-max-250x250.jpg"],[[183,275],"assets/images/resized/0019/8931/198931v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder & Director","firm":{"name":"Global Forestry Investments","permalink":"global-forestry-investments","type_of_entity":"company","image":{"available_sizes":[[[150,108],"assets/images/resized/0019/7083/197083v2-max-150x150.jpg"],[[250,180],"assets/images/resized/0019/7083/197083v2-max-250x250.jpg"],[[450,324],"assets/images/resized/0019/7083/197083v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}