{"first_name":"Andre","last_name":"Allen","permalink":"andre-allen","crunchbase_url":"http://www.crunchbase.com/person/andre-allen","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1973,"born_month":11,"born_day":16,"tag_list":"","alias_list":null,"created_at":"Tue Jul 17 14:16:17 UTC 2012","updated_at":"Wed Jul 18 03:08:32 UTC 2012","overview":"<p>Rev. Allen Allen </p>\n\n<p>Andre Allen, minister of the Bible</p>\n\n<p>From 1990 to today, Andre Allen has been diligently serving as a shepherd of God’s flock. To Rev. Allen this calling means much more than just working within the four walls of the church. In fact, you’ll only find him there when the community gathers for service, and then he’s back out in the community. Andre is a born leader and teacher.</p>\n\n<p>Since 2008, Rev. Allen has been the pastor at New Beginnings Ministries Worldwide in Illinois. From college, he had a strong passion to share the Gospel. He has worked at several other churches before this, but he always prefers to minister among the people. If you read the Bible, you know that Andre is in good company because Jesus spent the majority of His day talking to people on the streets and eating with tax collectors. </p>\n\n<p>Education</p>\n\n<p>Rev. Allen received an excellent education throughout his life. Lane Technical High School prepared him with solid work ethics and at Northwestern University, one of the top universities in the country, and received a B.S. in Education. </p>\n\n<p>Rev. Allen was called into the ministry as a college student, and he attended Garrett Evangelistic Theological Seminary where he received his Masters of Divinity. He was prepared to follow his calling a as a pastoral minister, so he could follow his passion and love of people. He was prepared to teach the faith that he so dearly loved.</p>\n\n<p>Serving in His Calling</p>\n\n<p>Rev. Allen served as co-president in the Wheaten Ministerial Association, which brought leading ministers together. He served as chairman of the Wheaton Community Relation Commission where he won a prestigious award for promoting good relations within the community. Wheaton Affordable Housing Group worked with the poor and needy to provide housing. Andre also taught in the school system and coached the boy’s wrestling team.</p>\n\n<p>Rev. Allen Andre was very interested in serving the Afro-American community and has been since the riots in 1960’ and 70’s. He served in the NAACP, on the Board of the Dupage County Chapter and he fought continually for social and racial justice in the communities. Rev. Allen also spent time working with the Dupage County Celebration for Dr. Martin Luther King. Serving a leader like Dr. MLK considerably influenced his life and strengthened the message of peace and equality to all people. Rev. Allen Andre continues to share the Word in every area of his life.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}