{"first_name":"Andrew","last_name":"Page","permalink":"andrew-page","crunchbase_url":"http://www.crunchbase.com/person/andrew-page","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun May 16 03:31:33 UTC 2010","updated_at":"Thu Jul 21 23:05:53 UTC 2011","overview":"<p>Andy Page brings more than 20 years of experience to his role at Gilt Groupe. As Chief Financial Officer and Head of Operations, Andy oversees all of the company&#8217;s financial operations, distribution, corporate strategic planning and Gilt City.</p>\n\n<p>Prior to joining Gilt, Andy was COO and CFO at PlayPhone Inc., where he was GM of North America and responsible for managing the company&#8217;s financial and engineering organizations across 15 countries. Before PlayPhone, Andy was CFO and SVP of Business Strategy at StubHub Inc., where he managed the company&#8217;s financial operations, business strategy and administrative functions. He also led the company&#8217;s sale to eBay in 2007. Andy has held senior executive positions at Panasas Inc., ONI Systems Corp. and Robertson Stephens &amp; Company.</p>\n\n<p>Andy holds a bachelor of arts from Princeton University and an MBA from Harvard Business School. He is an advisor to several private e-commerce companies and serves on the board of directors of My New Red Shoes, a nonprofit organization that provides back-to-school clothes for homeless and low-income children in the San Francisco Bay Area.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President","firm":{"name":"Gilt Groupe","permalink":"gilt-groupe","type_of_entity":"company","image":{"available_sizes":[[[150,74],"assets/images/resized/0003/8077/38077v1-max-150x150.png"],[[194,96],"assets/images/resized/0003/8077/38077v1-max-250x250.png"],[[194,96],"assets/images/resized/0003/8077/38077v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}