{"first_name":"Andre","last_name":"Brown","permalink":"andre-brown","crunchbase_url":"http://www.crunchbase.com/person/andre-brown","homepage_url":"http://www.locayta.com","birthplace":"Kitwe","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1962,"born_month":2,"born_day":12,"tag_list":"","alias_list":null,"created_at":"Tue Sep 08 08:41:27 UTC 2009","updated_at":"Wed Sep 30 22:04:00 UTC 2009","overview":"<p>André has spent more than 20 years in the technology industry, and has held a variety of business development and senior corporate roles in UK, European and US companies. A British National, André has travelled extensively in Europe, the US, Scandinavia and Japan. André holds an Economics degree from the London School of Economics. He is also a Corporate Finance alumni of the London Business School and more recently completed the Executive Management training programme at Harvard Business School. </p>\n\n<p>Andre has been CEO of several companies and brings strong commercial and business development skills to his role at Locayta. He is experienced in bringing new technologies to market; having worked at Dialog (£13m P&amp;L with 75 staff), Nettec, Adobe and Financial Objects in creating new ventures; strategic alliances; partnerships and joint-ventures. He has also had experience of cross-border merger and acquisitions and disposal of business assets. He is a strategic thinker with the ability to identify and plan strategic opportunities, and has had the commercial experience of putting these plans into practice.</p>\n\n<p>In 2002 he started Locayta Limited as a Software as a service (SaaS) business on an initial investment of £20,000. After putting in 2.5 years sweat equity, he built the company into a profitable business. Locayta’s clients include BT Directories, Nectar and De Beers.</p>\n\n<p>Locayta is now focused on providing behavioural merchandising and in-site search solutions for retailers and publishers.</p>","image":null,"degrees":[{"degree_type":"Bsc.","subject":"Economics (Govt & Politics)","institution":"London School of Economics","graduated_year":1983,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Locayta","permalink":"locayta","type_of_entity":"company","image":{"available_sizes":[[[150,75],"assets/images/resized/0008/8295/88295v1-max-150x150.png"],[[194,97],"assets/images/resized/0008/8295/88295v1-max-250x250.png"],[[194,97],"assets/images/resized/0008/8295/88295v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}