{"first_name":"Andrei","last_name":"Zimiles","permalink":"andrei-zimiles","crunchbase_url":"http://www.crunchbase.com/person/andrei-zimiles","homepage_url":"http://www.doctor.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Doctor.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"andrei, zimiles, doctor-com, health-platforms, practice-brain, ceo, cto, president, founder, executive, leader","alias_list":null,"created_at":"Tue Jun 05 06:41:37 UTC 2012","updated_at":"Thu Jun 14 19:36:57 UTC 2012","overview":"<p>Andrei Zimiles is Founder and President of Doctor.com (a brand of Health Platforms, Inc.), a leading online consumer health platform that helps people find, evaluate, and connect with more than 2 million US-based healthcare professionals. </p>\n\n<p>Doctor.com launched in 2008 and has experienced dramatic organic growth since its inception, and is actively used by millions of patients and thousands of healthcare professionals. In 2011, Zimiles lead negotiations with PracticeBrain, Inc. to be wholly acquired by Health Platforms, Inc., a transaction which closed at the start of January 2012.  As a result of this acquisition, PracticeBrain&#8217;s practice management and secure patient message technology were incorporated into the core Doctor.com platform.</p>\n\n<p>Prior to founding Doctor.com, Zimiles was a founding team member of KN Dimestore, a market research company acquired by Knowledge Networks (now part of Gfk, a €1.3B publicly traded German company) in 2009, and an early employee of Game Trust, which was acquired by Real Networks (NASDAQ: RNWK) in 2007.</p>\n\n<p>Prior to joining Game Trust, Zimiles founded Anziom, a strategic consulting and development firm that created web-based user experiences for organizations like Accenture, Cisco, Microsoft, The National Education Association, and the United States Government.</p>\n\n<p>Throughout his career, Zimiles has held leadership roles at the nexus of business, technology, and product design. He has an extensive technical background in design, product management, and web development, and lead teams large and small through successful business lifecycles. </p>\n\n<p>Zimiles holds a BS degree in New Media, from SUNY Purchase College.</p>","image":{"available_sizes":[[[105,150],"assets/images/resized/0019/3943/193943v2-max-150x150.jpg"],[[176,250],"assets/images/resized/0019/3943/193943v2-max-250x250.jpg"],[[317,450],"assets/images/resized/0019/3943/193943v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor of Science","subject":"New Media","institution":"Purchase College","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder & President","firm":{"name":"Doctor.com","permalink":"doctor-com","type_of_entity":"company","image":{"available_sizes":[[[150,47],"assets/images/resized/0019/5168/195168v2-max-150x150.png"],[[250,79],"assets/images/resized/0019/5168/195168v2-max-250x250.png"],[[450,143],"assets/images/resized/0019/5168/195168v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Investor","firm":{"name":"PracticeBrain","permalink":"practicebrain","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}