{"first_name":"Andrew","last_name":"Deal","permalink":"andrew-deal","crunchbase_url":"http://www.crunchbase.com/person/andrew-deal","homepage_url":"http://cellecast.com","birthplace":"Santa Monica, CA","twitter_username":null,"blog_url":"http://fourthspeaker.com","blog_feed_url":"http://fourthspeaker.com/feed/","affiliation_name":"Unaffiliated","born_year":1962,"born_month":4,"born_day":22,"tag_list":"mobile, radio, cellecast, on-demand, podcasting, webcasting, interactive-advertising, ad-networks","alias_list":null,"created_at":"Sun May 04 01:22:12 UTC 2008","updated_at":"Sat May 10 10:38:01 UTC 2008","overview":"<p>Andrew Deal. Founder and CEO of CelleCast Inc.</p>\n\n<p>Since 2000, Andrew Deal has been President of CGI Productions LLC, a company he created out of his own Web application freelancing business. He has been in the Internet industry since late 1995, just as the world wide web was getting its first taste of commercial viability.</p>\n\n<p>In 2001, Andrew began an overseas operation for CGI Productions in India, living there with his family for two years. This branch office handles much of the business processing operations of Andrew&#8217;s business and those of his clients. After returning to the United States, Andrew was named Technology Director for AdsForFree Inc./Coracle Inc. in June 2003 and for Flyer Plus Inc. in May 2004. He continued in these roles until September 2006, while continuing to grow CGI Productions to present. </p>\n\n<p>In 2004, the idea for CelleCast emerged, and it has been the driving force for Andrew and the CGI Team through the Nov 2007 launch and beyond as new programs and partners are being added each month.</p>","image":{"available_sizes":[[[122,150],"assets/images/resized/0001/7979/17979v1-max-150x150.jpg"],[[203,250],"assets/images/resized/0001/7979/17979v1-max-250x250.jpg"],[[366,450],"assets/images/resized/0001/7979/17979v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}