{"first_name":"Andrew","last_name":"Gallopo","permalink":"andrew-gallopo","crunchbase_url":"http://www.crunchbase.com/person/andrew-gallopo","homepage_url":"http://www.andrewgallopo.net/","birthplace":"","twitter_username":"","blog_url":"http://andrewgallopo.wordpress.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"innovator, andrew-gallopo, chemist, inventor","alias_list":null,"created_at":"Tue Oct 02 09:12:45 UTC 2012","updated_at":"Fri Oct 19 21:48:55 UTC 2012","overview":"<p>The innovator Andrew Gallopo, was born in 1940 but is still surprising the world with his inventions in the 21st century.  His most recent developments were approved by the United States Patent Office (USPO) in October 2008 and in December 2006 relating to the patents for compositions created including the use of an active potassium salt ingredient in order to help in the reduction of sensitivity in dental nerves.  Together with sodium alkyl sulfate, an amount of potassium salt is effective in the removal and loosening of debris which aids in stain removal on teeth.  A polar surfactant is also included and the mint flavor in the composition does not consist of menthol but rather a dementholated mint extract or synthetic blend. </p>\n\n<p>In the 1990&#8217;s a large number of Gallopo&#8217;s innovations were registered with the USPO and in April 1997 the patent for the quaternary ammonium antibacterial dentifrices with selected calcium abrasives was approved.  This patent registered with the USPO under number 5,616,314, relates to the provision of a dentifrice in paste, powder, liquid or solid form in the treatment of gingivitis on teeth and tissue and in the reduction of plaque formation. \nIn 1993 the patent for the reduction of plaque formation and in gingivitis treatment was approved.  In 1991 the patent for the sustained release of active agents from bio-adhesive microcapsules was approved.  This patent relates to the release of active agents for dental care. In 1990 the patent for tablets having improved bio-adhesion to mucous membranes was approved.</p>\n\n<p>Andrew Gallopo is a qualified chemist receiving his A.B. in chemistry from Rutgers University.  He followed up with his studies by earning his Ph.D. in chemistry at Brown University.  Today, Gallopo has made his home in Florida, in the southeastern region of the USA.  </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.highbeam.com/doc/1P3-1579226101.html","title":"New Jersey Inventors Develop Detergent Composition - US Fed News Service"},{"external_url":"http://www.google.com/patents/US4915948","title":"Patent US4915948 - Tablets having improved bioadhesion to mucous membranes - Google Patents"},{"external_url":"http://pubs.acs.org/doi/abs/10.1021/jo00321a032","title":"Kinetics and mechanism of the oxidation of pyridine by Caro's acid catalyzed by ketones - The Journal of Organic Chemistry (ACS Publications)"},{"external_url":"http://patents.justia.com/inventor/ANDREWRGALLOPO.html","title":"Patents By Inventor Andrew R Gallopo"},{"external_url":"http://www.patentmaps.com/inventor/Andrew_R_Gallopo_1.html","title":"Andrew R Gallopo - Inventor Patent Directory"}],"web_presences":[{"external_url":"http://www.andrewgallopo.org/","title":"Andrew Gallopo"},{"external_url":"http://andrewgallopo.tumblr.com/","title":"Andrew Gallopo Tumblr"}]}