{"first_name":"Andrew","last_name":"Craissati","permalink":"andrew-craissati","crunchbase_url":"http://www.crunchbase.com/person/andrew-craissati","homepage_url":"","birthplace":"London, UK","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1963,"born_month":7,"born_day":15,"tag_list":"","alias_list":null,"created_at":"Sat Oct 24 19:47:49 UTC 2009","updated_at":"Sat Oct 24 22:19:17 UTC 2009","overview":"<p>Andrew has had experiences in media throughout North America and Asia, having advised such clients as Universal Studios, Media Asia Entertainment, filmmaker Chen Kaige, Beijing Film Studios, National Geographic, Capital Radio Group Plc (re-named to GCap Media PLC), Carlton Communications PLC, DBS Bank, Pritish Nandy Communications and many others</p>\n\n<p>Andrew Craissati was the Chairman and Chief Executive Officer of Sir Richard Branson&#8217;s Virgin Group across the Asia Pacific region, 2000 - 2004. During this time, he served as a director of numerous Virgin companies, such as Virgin Radio Asia, Virgin Mobile Asia, Virgin Mobile Australia. Through his regional oversight, he also had involvement in Virgin Cinemas Japan, Virgin Money, Virgin Megastores, Virgin Blue, Virgin Active, Virgin Cosmetics, Virgin Drinks and other regional initiatives. He developed and managed a China-focused telecom investment joint venture with Japan&#8217;s NTT DoCoMo. In addition, he successfully raised more than $500m of external financing and led over $1.5bn of transactions for the Group.</p>\n\n<p>Since then, he has been Chief Executive of Transpac Media Ltd, a boutique investment banking firm, specializing in the global media and leisure industries. Clients are diversely located in India, China, the USA and the UK and covering industry sectors such as recorded music, music publishing, broadcasting, software, games, filmed entertainment, advertising and a range of &#8220;new media&#8221; and internet initiatives. In 2007, he published the first ever comprehensive guide to and profile of all 110 media companies then listed on the London Stock Exchange&#8217;s AIM.</p>\n\n<p>Andrew currently serves on the International Advisery Board of both the Singapore Government&#8217;s Media Development Authority and the UK&#8217;s Open University Business School. Andrew is Chairman of the Singapore MDA Mentorship Programme, supervising a number of mentors. He is a member of the Turnaround Management Association. Andrew has been a frequent speaker at conferences around the world and has regularly appeared on Reuters, BBC-TV, CNN and CNBC</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0006/3624/63624v2-max-150x150.jpg"],[[120,180],"assets/images/resized/0006/3624/63624v2-max-250x250.jpg"],[[120,180],"assets/images/resized/0006/3624/63624v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.travelweeklyweb.com/article/the_asian_virgin.html","title":"The Asian Virgin"}],"web_presences":[{"external_url":"http://www.linkedin.com/pub/andrew-craissati/0/a82/7a","title":"Andrew's LinkedIn page"}]}