{"first_name":"Andrea","last_name":"Calcagno","permalink":"andrea-calcagno-2","crunchbase_url":"http://www.crunchbase.com/person/andrea-calcagno-2","homepage_url":"","birthplace":"castrovillari","twitter_username":"andreacalcagno","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1978,"born_month":5,"born_day":1,"tag_list":"","alias_list":null,"created_at":"Sat Jan 07 15:08:13 UTC 2012","updated_at":"Tue Aug 07 22:46:19 UTC 2012","overview":"<p>Andrea is CEO &amp; EVP and founder of WiTech. He has a strong technical and economic background in the Telecommunication Sector with a focus on broadband field (WiFi, WiMAX, 3G/HSPA, LTE, xDSL and FFTH).\nHe started his career at Telecom Italia Labs in Turin, where he performed advanced Research &amp; Development activities in mobile access networks, gaining some international patents on mobile broadband architectures.  Andrea was  Chairman of the Personal Broadband Observatory of ANFoV and is today a well-known and respected expert on technical and economic analyses for 3G/4G technologies; he has authored several articles and reports on the subject. \nAndrea is also CEO and EVP of Lagaria S.r.l.,WiTech&#8217;s majority shareholder, President of Family Fund 4Gi S.r.l, and Board member in some start-up initiatives.\nHe thanks as his technical and technological background implements a leadership for products development and consulting and engineering services related of key customers.\nAndrea was the leader for more than 50 projects about wireless next generation networks and services (WiFi, 3G/HSPA, WiMAX, LTE, Smart Metering) for different Telco Operators, System Integrators, Vendors and Consulting Firms in Inside Market and International Arena.\nAndrea earned a Degree in Telecommunications Engineering (Summa Cum Laude) from the University of Pisa, Italy. </p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0016/9237/169237v6-max-150x150.jpg"],[[187,250],"assets/images/resized/0016/9237/169237v6-max-250x250.jpg"],[[337,450],"assets/images/resized/0016/9237/169237v6-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://it.linkedin.com/in/andreacalcagno","title":"linkedin profile"}]}