{"first_name":"Andy","last_name":"Yasutake","permalink":"andy-yasutake","crunchbase_url":"http://www.crunchbase.com/person/andy-yasutake","homepage_url":"http://www.linkedin.com/yasusasu","birthplace":"Los Angeles, CA","twitter_username":"yasusasu","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1978,"born_month":1,"born_day":15,"tag_list":"","alias_list":null,"created_at":"Tue Aug 02 05:17:02 UTC 2011","updated_at":"Tue May 22 04:13:45 UTC 2012","overview":"<p>Andy Yasutake joined eBay Marketplaces in June 2010 after leading a consulting engagement for their global Customer Support Technology Solution organization for over a year.  After a year of providing expertise in Customer Relationship Management (CRM) Solution Architecture, Andy joined eBay as their Director of Enterprise CRM Architecture.</p>\n\n<p>As the Director of Enterprise CRM Architecture, Andy had responsibility for creating and developing a Customer-centric Technology Strategy with an outlook projection of the next few years.  Leveraging industry trends shaping the online commerce and Fortune 500 space, Andy&#8217;s strategy encompassed key technologies that helped provide a foundational roadmap for the future based on strategic capabilities that helped eBay to differentiate itself in the Customer Service space.</p>\n\n<p>After less then a year in the company, Andy was asked to assume the role of Director of CS Product Management and CRM Architecture.  Leveraging his broad experience in advancing Products with a Customer focus and technology foundation, Andy&#8217;s responsibility included ownership of all agent facing tools, platforms, and technologies.</p>\n\n<p>Prior to eBay, Andy spent more then 10 years at Accenture PLC., a worldwide management consulting firm with international headquarters based in Dublin, Ireland and offices in over 48 countries, and with 190,000 employees.  At Accenture, Andy led the North America Master Data Management (MDM) practice and was an advanced expert in CRM systems implementations and technologies, highly respected around the world.</p>\n\n<p>During Andy&#8217;s tenure with Accenture, he worked and led consulting engagements across the US and in countries such as Australia, Belgium, Canada, and Taiwan.</p>\n\n<p>Andy Yasutake received a Bachelor of Arts in Psychology from the University of Southern California and ended his studies with an emphasis in Management Information Systems from USC&#8217;s Marshall School of Business. </p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0014/7395/147395v2-max-150x150.jpg"],[[155,217],"assets/images/resized/0014/7395/147395v2-max-250x250.jpg"],[[155,217],"assets/images/resized/0014/7395/147395v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor of Arts","subject":"Psychology / Information Systems","institution":"University of Southern California","graduated_year":2000,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}