{"first_name":"Andy","last_name":"Jedynak","permalink":"andy-jedynak","crunchbase_url":"http://www.crunchbase.com/person/andy-jedynak","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Poptent","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Apr 10 16:29:50 UTC 2008","updated_at":"Fri Jul 15 17:55:34 UTC 2011","overview":"<p>Andy Jedynak is an Internet and media business executive based in Southern California, with extensive C-level operational leadership, corporate development, and board level experience. Jedynak is currently CEO of Poptent, a company and online community which crowdsources television commercials for many of the largest brands in the world. </p>\n\n<p>An Internet product and marketing expert, Jedynak has led the growth of digital media businesses with tens of millions of web and mobile monthly uniques, and hundreds of millions of monthly page views. He is noted for his ability to scale businesses built on both subscription and advertising revenues. </p>\n\n<p>Previously, Andy was president and chief marketing officer at KidZui, the Internet for Kids.  Jedynak was responsible for driving business growth and building the KidZui brand. </p>\n\n<p>Prior to joining KidZui, Jedynak was chief marketing officer of WeatherBug (Earth Networks, Inc.). During his nine years at the company, he led the growth of WeatherBug from a concept to one of the top digital properties worldwide.</p>\n\n<p>He spent nine years at NBC working within a number of disciplines, including sales, marketing and television production. In the mid 1990s, as manager of new media at NBC San Diego, he proposed, developed and directed what was considered NBC’s most profitable local Internet business, and launched MSNBC.com’s San Diego news initiative. </p>\n\n<p>Jedynak is also co-chairman emeritus of the Interactive Advertising Bureau (IAB) Mobile committee. He has both written and spoken regularly about the evolution of Internet at industry events, such as Internet World, IAB, ANA, OPA, Digital Hollywood, OMMA, iMedia and others. </p>\n\n<p>Jedynak graduated from the University of California with emphasis in communication and computer science. Before beginning his career in broadcast and digital media, Jedynak played professional basketball in Europe.</p>\n\n<p>Source:<a href=\"www.kidzui.com/\" title=\"KidZui\" rel=\"nofollow\">KidZui</a></p>","image":{"available_sizes":[[[131,150],"assets/images/resized/0001/7124/17124v2-max-150x150.jpg"],[[219,250],"assets/images/resized/0001/7124/17124v2-max-250x250.jpg"],[[395,450],"assets/images/resized/0001/7124/17124v2-max-450x450.jpg"]],"attribution":"<p>KidZui</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Poptent","permalink":"poptent","type_of_entity":"company","image":{"available_sizes":[[[150,62],"assets/images/resized/0002/6412/26412v7-max-150x150.png"],[[250,103],"assets/images/resized/0002/6412/26412v7-max-250x250.png"],[[450,187],"assets/images/resized/0002/6412/26412v7-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}