{"first_name":"Andy","last_name":"Kaufman","permalink":"andy-kaufman","crunchbase_url":"http://www.crunchbase.com/person/andy-kaufman","homepage_url":"http://www.i-leadonline.com","birthplace":"","twitter_username":"andy_kaufman","blog_url":"http://www.PeopleAndProjectsPodcast.com","blog_feed_url":"http://feeds.feedburner.com/PeopleAndProjectsPodcastBlog","affiliation_name":"Institute for Leadership Excellence & Development Inc.","born_year":null,"born_month":null,"born_day":null,"tag_list":"project-management-speaker, project-management-podcast","alias_list":null,"created_at":"Thu Jul 15 18:35:23 UTC 2010","updated_at":"Mon Jul 19 19:18:16 UTC 2010","overview":"<p>Andy Kaufman, PMP is an international speaker, author, and executive coach, and President of the Institute for Leadership Excellence &amp; Development Inc. Andy works with organizations around the world, helping them improve their ability to deliver projects and lead teams.</p>\n\n<p>Andy’s leadership and project management keynotes, workshops, and executive coaching services have reached tens of thousands of people from hundreds of companies over the years, helping them deliver their projects, become more confident leaders, take focused action, and deliver results. He brings a rich background of over 25 years of experience in executive management, technology, team leadership, project management, consulting, and coaching.</p>\n\n<p>Andy is a certified trainer and author of Navigating the Winds of Change: Staying on Course in Business &amp; in Life, Shining the Light on The Secret, and an e-book entitled How to Organize Your Inbox &amp; Get Rid of E-Mail Clutter, all published by Zurich Press. He is a certified Project Management Professional (PMP®) and a member of the Project Management Institute (PMI®).</p>\n\n<p>Andy is the publisher of the Horizon Time newsletter which is read by professionals around the world. He is also the host of the project management podcast entitled The People and Projects Podcast which provides interviews and insights to help listeners lead people and deliver projects. The podcast focuses on the intersection of People and Projects–where work gets done in the real world.</p>\n\n<p>Andy is a recognized expert on topics related to leadership, project management, managing conflict, networking, relationships, time management, teambuilding, and delivering results.</p>\n\n<p>Learn more at the Institute’s website at http://www.i-leadonline.com.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0009/3692/93692v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0009/3692/93692v2-max-250x250.jpg"],[[300,300],"assets/images/resized/0009/3692/93692v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.LeadershipInTheRealWorldBlog.com","title":"Blog"}],"web_presences":[{"external_url":"http://www.linkedin.com/in/buildleaders","title":"LinkedIn"},{"external_url":"http://www.twitter.com/andy_kaufman","title":"Twitter"}]}