{"first_name":"Andy","last_name":"Fairclough","permalink":"andy-fairclough","crunchbase_url":"http://www.crunchbase.com/person/andy-fairclough","homepage_url":"http://vcpubcompany.co.uk/","birthplace":"England","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"vc-pubs, vc-pub-company","alias_list":null,"created_at":"Sun Nov 25 21:15:12 UTC 2012","updated_at":"Mon Nov 26 00:03:00 UTC 2012","overview":"<p>VC Pub Company was established in 2010 with the aim of creating a quality pub company that would put the traditional local pub back at the heart of communities in South Wales. Many pubs in the region have suffered from a lack of investment over many years. As a result the quality of their facilities has deteriorated and they are no longer the focal point of the communities that they serve.</p>\n\n<p>Our mission at VC Pubs is to change this and to bring people back to their local pub. We do this by investing in our facilities to provide the very best experience, based on high quality surroundings, great service and value for money. Whether it is enjoying a drink with friends, a family meal or watching a live sporting event, a VC Pub offers a warm welcome and good food and drink.</p>\n\n<p>We currently operate three pubs, all of which have recently been substantially refurbished and their facilities upgraded. We are actively seeking to expand our portfolio further and welcome enquiries from free house owners who are considering selling their pubs. We offer experienced pub operators and new entrants to the hospitality business the opportunity to join a growing and dynamic company. VC Pubs include directly managed outlets and also tenanted opportunities. Our standard tenancy agreement is a low cost entry opportunity for business-minded pub operators and offers attractive discounts with a highly flexible agreement.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}