{"first_name":"Andy","last_name":"Bird","permalink":"andy-bird","crunchbase_url":"http://www.crunchbase.com/person/andy-bird","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 21 02:33:57 UTC 2008","updated_at":"Wed May 21 02:46:42 UTC 2008","overview":"<p>As chairman of Walt Disney International Andy Bird is responsible for targeting new businesses, growing and increasing penetration of Disney&#8217;s existing businesses in developed markets such as Western Europe and Japan, and leading the development of business and operations in emerging markets, including India, China, Russia, South Korea and Latin America. Reporting to Disney President and CEO Bob Iger, Mr. Bird works with all of Disney&#8217;s business unit leaders around the world, coordinating and overseeing growth opportunities for The Walt Disney Company outside the United States.</p>\n\n<p>Since he joined The Walt Disney Company in 2004, Mr. Bird has overseen Disney&#8217;s acquisition of Hungama TV in India and investment in India&#8217;s UTV, led the drive to localize content through TV and film ventures, and reorganized Disney&#8217;s international structure and leadership ranks as Disney transforms itself into a truly global enterprise.</p>\n\n<p>Prior to joining Disney, Mr. Bird spent nearly a decade with Time Warner, joining in 1994 as senior vice president and general manager of Turner Entertainment Networks Limited. He rose to president of TBS International in 2000, and became responsible for all TBS broadcasting outside of the continental U.S.</p>\n\n<p>Bird started his career with Piccadilly Radio in Manchester, England, as breakfast show producer. After that, Bird moved to London to join the Virgin Broadcasting Company working at Music Box, a Pan-European music channel. Later, Virgin asked Bird to help launch and program a satellite-delivered national radio service called &#8220;Radio Radio.&#8221; Bird became head of programming for the service, producing radio shows for leading comedians and television presenters.</p>\n\n<p>Between 1989 and 1994, Bird held a number of positions in radio and television in Europe, including helping to start a music channel, producing and directing a popular London-based morning TV program, and producing a Saturday morning children&#8217;s TV show. In 1992, Bird was tapped by Unique Broadcasting, the largest independent radio production company in the United Kingdom, to start up and operate Unique Television.</p>\n\n<p>A native of the United Kingdom, Bird earned a Bachelor of Arts degree in English language and literature from the University of Newcastle Upon Tyne in 1985. He is based in Burbank, California and lives in Los Angeles with his wife and two sons.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/8984/18984v1-max-150x150.jpg"],[[200,200],"assets/images/resized/0001/8984/18984v1-max-250x250.jpg"],[[200,200],"assets/images/resized/0001/8984/18984v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://corporate.disney.go.com/corporate/management_team.html\" title=\"Disney\" rel=\"nofollow\">Disney</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Chairman, Walt Disney International","firm":{"name":"The Walt Disney Company","permalink":"the-walt-disney-company","type_of_entity":"company","image":{"available_sizes":[[[150,73],"assets/images/resized/0001/0929/10929v1-max-150x150.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-250x250.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}