{"first_name":"Andy","last_name":"Coan","permalink":"andy-coan","crunchbase_url":"http://www.crunchbase.com/person/andy-coan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon May 19 17:44:56 UTC 2008","updated_at":"Mon May 19 17:46:03 UTC 2008","overview":"<p>Andy Coan co-founded Splice Communications in 2002 with the vision of creating a company that would deliver viable solutions for customers that depend on E-Commerce, Voice, Video and other applications driven by a fast paced internet economy. Focusing on providing customers with choice, Mr. Coan built a strategic company that provides multiple options where customers are positioned for growth in changing environments. Through steady leadership, a process driven approach and a keen focus on fiscal responsibility, Mr. Coan has developed a company-wide atmosphere of integrity, loyalty, and professionalism, and has positioned Splice as one of the fastest growing companies in Northern California. Mr. Coan has over 15 years of proven success in the telecommunications industry. Prior to Splice, Mr. Coan served in an executive management role for 3 years at Telseon IP Services, which was acquired by OnFiber Communications Inc. Mr. Coan was responsible for some of the largest Carrier and Strategic accounts at OnFiber. Prior to Telseon/OnFiber, Mr. Coan worked for eight years, in various sales and management roles at MCI/WorldCom. He was consistently promoted and recognized as one of the company’s top performers. Mr. Coan also serves on the Advisory Boards of Pacific Business Centers and Bridge Works, Inc. in San Mateo, California. He holds a BS degree in Psychology and Business from San Jose State University.</p>","image":{"available_sizes":[[[108,150],"assets/images/resized/0001/8813/18813v1-max-150x150.jpg"],[[181,250],"assets/images/resized/0001/8813/18813v1-max-250x250.jpg"],[[231,319],"assets/images/resized/0001/8813/18813v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.splicetelecom.com/About/MgmtTeam.php\" title=\"Splice Communications\" rel=\"nofollow\">Splice Communications</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder, President and CEO","firm":{"name":"Splice Communications","permalink":"splice-communications-2","type_of_entity":"company","image":{"available_sizes":[[[150,57],"assets/images/resized/0001/8812/18812v1-max-150x150.png"],[[219,84],"assets/images/resized/0001/8812/18812v1-max-250x250.png"],[[219,84],"assets/images/resized/0001/8812/18812v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}