{"first_name":"Andy","last_name":"Decosta","permalink":"andy-decosta","crunchbase_url":"http://www.crunchbase.com/person/andy-decosta","homepage_url":"http://www.kamagrarx.co/","birthplace":"Sydney","twitter_username":"andydecosta","blog_url":"http://www.kamagrarx.co/blog/","blog_feed_url":"","affiliation_name":"kamagra","born_year":1972,"born_month":1,"born_day":13,"tag_list":"health-drug-store, generic-health, kamagra, kamagra-soft-tabs, kamagra-jelly, kamagra-polo, kamagra-fizz","alias_list":null,"created_at":"Tue Dec 20 09:03:35 UTC 2011","updated_at":"Wed Dec 21 11:00:44 UTC 2011","overview":"<p>Kamagrarx.co is a generic online pharmacy sells the generic as well as the branded medicines. They have established the company in since 2008, and it’s providing medication for men’s health, and women’s health. Kamagrarx.co also features the deal regarding the product and its information that they sell, and the conditions. They also sell the medicine in jelly, soft tabs, and tablets form with including flavors and dosage whichever you want. </p>\n\n<p>Kamagrarx.co offers the coupon code in the main page only. You can receive discount code when you buy any product from this website. They provide the code for new and returning customers when they buy first time or reorder. They offer the discount up to 10% to 20% when you placed the order in weekend, or on holidays and in any festivals. This online store provides the 24x7 online customer support and they can contact with the toll free number or by mail.</p>\n\n<p>Kamagrarx.co is process your order within 24 hour, if some holiday or weekends are there then they try to process your order next or as soon as possible. Once your order dispatch you will get an email regarding your order status.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Buy Kamagra Fizz Online","firm":{"name":"kamagra","permalink":"kamagra","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.kamagrarx.co/","title":"Buy Cheap kamagra online"}]}