{"first_name":"Andy","last_name":"Vogel","permalink":"andy-vogel","crunchbase_url":"http://www.crunchbase.com/person/andy-vogel","homepage_url":"http://www.andyvogel.com","birthplace":"Detroit","twitter_username":"andyvogel","blog_url":"http://www.andyvogel.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"andy-vogel, mobile, social, local, advertising, sales, tribune, los-angeles-times","alias_list":null,"created_at":"Tue Jul 24 21:39:38 UTC 2012","updated_at":"Wed Jul 25 22:16:51 UTC 2012","overview":"<p>Andy Vogel is the Senior Vice President of Digital &amp; Mobile for Tribune Company. In his role, he is responsible for all digital, mobile, branded and converged media executions across the Tribune portfolio that includes 8 major daily newspapers including the Los Angeles Times and Chicago Tribune and 23 broadcast television stations, including WGN America on national cable and KTLA.</p>\n\n<p>Andy is a leader in developing revenue strategies for new and emerging businesses. He has held senior level business development, technology marketing and sales positions in the software, digital media, automotive retailing and newspaper industries. He created the first group online sales function for Gannett Company, and ran digital strategy and sales for Journal Communications and the paid subscription website PackerInsider.com (at the time the second largest paid subscriber base after ESPN Insider).</p>\n\n<p>As General Manager of hyper-local media pioneer Backfence.com, he grew multiple city sites with zero marketing spend utilizing early social media and grassroots marketing. He was part of the start-up team at cars.com launching over 100 affiliate sites, and ran business development for Nextron, a Silicon Valley based software developer for the Telco industry.</p>\n\n<p>He sits on the North American Board of the Mobile Marketing Assoc. and Chairs its Mobile Publishing Committee, as well as serving on the Board of the IAB’s Mobile Center of Excellence.</p>","image":{"available_sizes":[[[100,117],"assets/images/resized/0020/2627/202627v2-max-150x150.png"],[[100,117],"assets/images/resized/0020/2627/202627v2-max-250x250.png"],[[100,117],"assets/images/resized/0020/2627/202627v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}