{"first_name":"Andy","last_name":"Dale","permalink":"andy-dale","crunchbase_url":"http://www.crunchbase.com/person/andy-dale","homepage_url":"http://www.montlakecapital.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Montlake Capital ","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Jul 28 04:16:23 UTC 2007","updated_at":"Mon Sep 12 21:31:58 UTC 2011","overview":"<p>Andy joined Buerk Dale Victor as Managing General Partner in 2000, and shortly thereafter co-founded the firm’s fund management business.  For more than fifteen years, he has been involved with building and growing companies as an entrepreneur, venture capitalist and investment banker.  Andy currently serves as a board member for BDV portfolio companies Door to Door Storage, ClearMedical, ReliOn, Intrepid, PayScale, HaloSource, ClearAcces and Veriwave.  He was formerly a board observer for Performant, Inc., successfully exited through sale to Mercury Interactive in 2003.  Andy was also a successful investor in Priority Call (Sold to LHS Group), Linktone (LTON) and Acme Packet (APKT).  He is former Vice Chair of the Board of Trustees for the Gates/NIH funded Seattle Biomedical Research Institute, and current President of the Evergreen Venture Capital Association.</p>\n\n<p>Early in his career, Andy served in the Mergers &amp; Acquisitions group of Smith Barney in New York, where he worked on reorganizations for Revco Drugstores, Sunbeam and Eastern Airlines. He also worked with Smith Barney’s venture capital group – First Century Partners.</p>\n\n<p>As an executive manager he helped build Priority Call Management in Boston, prior to its acquisition for approximately $200 million through a sale to LHS Group in 1999.  At Priority Call, Andy assisted in raising $15 million of angel and venture capital and grew the company from $0 to $60 million in annualized revenues within six years.  Andy served as Vice President of Corporate Development at LHS Group, a telecommunications billing company, prior to its $4.7 billion merger with Sema Group.</p>\n\n<p>Andy holds an A.B. from Harvard College, where he was a member of the 1987 Ivy League champion soccer team, and received his MBA from Harvard Business School.  He and his wife are Seattle natives, both graduates of Roosevelt High School in Seattle, and they have three young children. </p>","image":{"available_sizes":[[[115,150],"assets/images/resized/0003/5248/35248v2-max-150x150.jpg"],[[154,200],"assets/images/resized/0003/5248/35248v2-max-250x250.jpg"],[[154,200],"assets/images/resized/0003/5248/35248v2-max-450x450.jpg"]],"attribution":"<p>http://www.bdvllc.com/BDV/teambios.php?TID=1&amp;PoID=1</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Board","firm":{"name":"PayScale","permalink":"payscale","type_of_entity":"company","image":{"available_sizes":[[[150,63],"assets/images/resized/0000/3859/3859v1-max-150x150.png"],[[150,63],"assets/images/resized/0000/3859/3859v1-max-250x250.png"],[[150,63],"assets/images/resized/0000/3859/3859v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Managing General Partner ","firm":{"name":"Montlake Capital ","permalink":"buerk-dale-victor","type_of_entity":"financial_org","image":{"available_sizes":[[[150,27],"assets/images/resized/0002/8952/28952v3-max-150x150.jpg"],[[250,45],"assets/images/resized/0002/8952/28952v3-max-250x250.jpg"],[[450,81],"assets/images/resized/0002/8952/28952v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}