{"first_name":"Aneel","last_name":"Ranadive","permalink":"aneel-ranadive","crunchbase_url":"http://www.crunchbase.com/person/aneel-ranadive","homepage_url":"","birthplace":"usa","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1984,"born_month":5,"born_day":9,"tag_list":"","alias_list":null,"created_at":"Tue Jul 10 04:52:59 UTC 2012","updated_at":"Tue Jul 10 08:32:16 UTC 2012","overview":"<p>Aneel Ranadive is 28 yrs old, born and raised in the Bay Area. After graduating from Columbia University w/ a degree in Mathematics in 2006 Aneel did investment banking at Bank of America in New York in the TMT group.</p>\n\n<p>Aneel left Bank of America to found BoredAt in early 2007, an SF-based startup backed by Redpoint and various angel investors. BoredAt was an anonymous social network for people to post their thoughts and vote up popular ideas. The vision of BoredAt was to compile the collective consciousness of the world. BoredAt created anonymous social networks for schools, companies, interest groups and locations.</p>\n\n<p>After BoredAt, Aneel led sales at GlanceGuide, a video analytics company that created a video engagement score and partnered with advertisers and social networks including Facebook. GlanceGuide was acquired by Nielsen in mid 2010.</p>\n\n<p>At Nielsen, Aneel worked with former OpenTable Cofounder Sid Gorham to found Nielsen Media Sync and led development of mobile apps for TV shows, creating synchronous mobile viewing experiences with polls and trivia questions. Nielsen Media Sync partnered with ABC and created apps for shows like My Generation and Grey&#8217;s Anatomy.</p>\n\n<p>After Nielsen, Aneel founded Pinchit. Pinchit is an online scrapbook for your city to share and discover new experiences with your friends. The company is backed by top tier angel investors including Tim Draper and Facebook Cofounder Eduardo Saverin. Others include Intuit Cofounder Eric Dunn and Tibco founder Vivek Ranadive.</p>","image":{"available_sizes":[[[79,150],"assets/images/resized/0019/9800/199800v2-max-150x150.jpg"],[[132,250],"assets/images/resized/0019/9800/199800v2-max-250x250.jpg"],[[239,450],"assets/images/resized/0019/9800/199800v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.pinchit.com","title":""}]}