{"first_name":"Angela","last_name":"Orebaugh","permalink":"angela-orebaugh","crunchbase_url":"http://www.crunchbase.com/person/angela-orebaugh","homepage_url":"http://www.angelaorebaugh.com","birthplace":"Virginia","twitter_username":"AngelaOrebaugh","blog_url":"http://www.angelaorebaugh.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"security, infosec, cybersecurity, author, fellow","alias_list":null,"created_at":"Thu Jan 12 23:58:52 UTC 2012","updated_at":"Mon Jan 16 23:20:40 UTC 2012","overview":"<p>Angela Orebaugh is a technology futurist and thought leader with a focus in cybersecurity.  She synergizes her 18 years of strategic and technical experience within commercial, academic, and government environments to advise clients on next generation technologies and disruptive innovation.  Ms. Orebaugh’s executive leadership experience includes proven ability to lead and grow multi-million dollar technology business in diverse organizations ranging from Internet startups to Fortune 500 companies.  Ms. Orebaugh evangelizes social media and mobile technologies by highlighting the powerful ways in which these technologies are changing business, communications, and information sharing.  She is passionate about helping clients embrace tomorrow’s technology today.</p>\n\n<p>Ms. Orebaugh is an internationally recognized author of best selling technology books including, Wireshark and Ethereal Network Protocol Analyzer Toolkit, Ethereal Packet Sniffing, and Nmap in the Enterprise.  She has also co-authored the Snort Cookbook, Intrusion Prevention and Active Response, and How to Cheat at Configuring Open Source Security Tools.  She is an invited speaker at a variety of cybersecurity conferences and technology events including the SANS Institute and The Institute for Applied Network Security.</p>\n\n<p>In 2011, Ms. Orebaugh was selected as Booz Allen Hamilton&#8217;s first Cyber Fellow, a distinction reserved reserved for an elite group of industry-recognized thought leaders.  She is involved with cybersecurity strategy at the National Institute of Standards and Technology (NIST). She co-authored several technical Special Publications on cybersecurity topics and leads emerging technologies and specifications for the National Vulnerability Database (NVD) and Security Automation Program.</p>\n\n<p>Ms. Orebaugh is also the Director of Research and Academic Integration for the Information Assurance Technical Analysis Center (IATAC), where she bridges research and collaboration across academia, government, and industry.  As an Adjunct Professor at George Mason University, Ms. Orebaugh teaches intrusion detection and performs research in cyber forensics and cybercrime in the Department of Electrical and Computer Engineering.  In 2011, she was named one of Femmonomics Top 50 Women in Tech.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0016/9949/169949v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0016/9949/169949v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0016/9949/169949v2-max-450x450.jpg"]],"attribution":"<p>Angela Orebaugh</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://twitter.com/AngelaOrebaugh","title":"Angela Orebaugh Twitter"}]}