{"first_name":"Angel","last_name":"Cabrera","permalink":"angel-cabrera","crunchbase_url":"http://www.crunchbase.com/person/angel-cabrera","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Vurv Technology","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed May 07 21:25:40 UTC 2008","updated_at":"Sun Jul 15 09:42:48 UTC 2012","overview":"<p>Angel is the founder of Prodesio and a highly-respected technology executive with deep expertise in architecting elegant technical solutions that are intuitive and simple by design.  Cabrera has spent two decades cutting through the latest fads and delivering extreme technology that works.  One of the world’s early adopters of Software-as-a-Service (SaaS) as a business paradigm, Angel is an expert both in deploying SaaS applications and in utilizing rapid development methodologies across large teams of architects, engineers, and developers to successfully bring new products to market.  Named a HITEC 100 technology executive, Angel was most recently the Chief Technology Officer (CTO) of Vurv Technology, a global provider of on-demand enterprise software for strategic HR—recruiting, performance, succession, compensation and workforce planning.</p>\n\n<p>After joining the company as its first employee in 1996, Angel executed on the founder’s vision for creating applications that would be game-changing in the war for talent.  Together, Angel and the company’s founder built the business from an idea on a cocktail napkin to a multi-national powerhouse that boasted nearly $60 million in annual revenue.  Obsessed with usability, Angel built a team of more than 100 technology professionals who were passionate about ensuring that their software would have rapid adoption through intuitive design that invited its use.  Working side-by-side with Amy, the pair transformed the company’s business model from customized, license-based model to standard-release software, upgraded nearly two-thirds of custom clients to the higher margin model and decreased license sales to less than 5% of revenue. </p>\n\n<p>With technology fueling the company’s growth, a variety of designations reflected the success of the company’s business strategy. Under Angel’s leadership, Vurv was recognized by Inc. 500 as one of the fastest growing private companies several years in a row (2005-2008).  In 2004-2007, Vurv was named to the Deloitte Technology Fast 500, proud to be in the company of Google, Salesforce.com, and Yahoo! in earning such distinction.  And in a technologist’s dream scenario, Vurv went on to global recognition by Gartner who granted the its applications a highly-coveted Magic Quadrant designation, earning the highest marks for both completeness of vision and ability to execute—the only private company in the industry to receive such an honor.  In the ultimate endorsement of the company Angel helped create, Vurv’s success culminated in its July 2008 acquisition by its largest competitor and the world’s 2nd largest SaaS company, Taleo, for a multiple of nearly 5x recurring revenue.</p>","image":{"available_sizes":[[[150,136],"assets/images/resized/0020/0888/200888v2-max-150x150.jpg"],[[206,187],"assets/images/resized/0020/0888/200888v2-max-250x250.jpg"],[[206,187],"assets/images/resized/0020/0888/200888v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Technology Officer","firm":{"name":"Vurv Technology","permalink":"vurv-technology","type_of_entity":"company","image":{"available_sizes":[[[125,62],"assets/images/resized/0001/8142/18142v1-max-150x150.jpg"],[[125,62],"assets/images/resized/0001/8142/18142v1-max-250x250.jpg"],[[125,62],"assets/images/resized/0001/8142/18142v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Advisor","firm":{"name":"SixIntel","permalink":"sixintel","type_of_entity":"company","image":{"available_sizes":[[[150,25],"assets/images/resized/0018/3441/183441v2-max-150x150.png"],[[250,41],"assets/images/resized/0018/3441/183441v2-max-250x250.png"],[[384,64],"assets/images/resized/0018/3441/183441v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}