{"first_name":"Angela","last_name":"Courtin","permalink":"angela-courtin","crunchbase_url":"http://www.crunchbase.com/person/angela-courtin","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"MTV Networks","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jul 30 09:15:30 UTC 2008","updated_at":"Sat Apr 07 18:34:26 UTC 2012","overview":"<p>Angela works across all of Aegis Media&#8217;s agencies, including Carat, Isobar, Vizeum, Posterscope, Epic and iProspect, to extend the group&#8217;s leadership in using branded entertainment and content to forge closer connections between brands and consumers.  </p>\n\n<p>Recognized for her groundbreaking work at MTV and MySpace, Courtin has developed key relationships with Fortune 500 companies and premium content creators to execute game-changing marketing strategies. Her entertainment background, combined with her understanding of advertisers&#8217; need to deepen brand engagement, enable her to merge audience, narrative and brand into new, compelling forms of marketing communications.</p>\n\n<p>Courtin was most recently with MTV as co-head of Integrated Marketing where she oversaw all marketing across MTV&#8217;s suite of brands, including the flagship channels and related websites, as well as MTVu and MTV Mobile. Before MTV, she headed up Marketing, Entertainment and Content at MySpace. She led the marketing, entertainment, content, branding, promotions and events teams with the objective of increasing growth, public awareness and revenue for the company. Courtin is a recognized expert and frequent speaker on the role of social media in branding today.</p>\n\n<p>Prior to her executive roles with MTV and MySpace, Courtin also served as associate producer on HBO&#8217;s Big Love and worked for Knollwood Productions in development. Before HBO, she served as MTV&#8217;s Vice President of Rock the Vote. Courtin brought civic participation and voter empowerment to young people across the country by creating a successful marriage between MTV&#8217;s Choose or Lose campaign and corporate America. Her work in politics spans the beltway, from the Human Rights Campaign to the Democratic National Committee.  Since 2007, Courtin has served as President of the Board of Outfest, Los Angeles&#8217; Gay &amp; Lesbian Film Festival. Her work was recognized in 2004&#8217;s Out Magazine&#8217;s OUT 100, the annual list of the year&#8217;s most interesting, influential and newsworthy LGBT people. She has been a guest lecturer at Harvard Business School and the USC School of Media Studies. Courtin was named one of Power Up&#8217;s 10 Amazing Gay Women in Showbiz and selected as the recipient of the Spears School of Business Outstanding Young Alumni Award and named one of Oklahoma State University&#8217;s top 50 MBA alumni of the past 50 years.  Courtin earned her B.S in Civil Engineering and an MBA from Oklahoma State University.</p>\n\n<p>Source: http://www.prnewswire.com/news-releases/aegis-media-appoints-angela-courtin-evp-content&#8211;convergence-125409048.html</p>","image":{"available_sizes":[[[108,150],"assets/images/resized/0002/3011/23011v3-max-150x150.jpg"],[[180,250],"assets/images/resized/0002/3011/23011v3-max-250x250.jpg"],[[318,441],"assets/images/resized/0002/3011/23011v3-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"EVP, Content and Convergence","firm":{"name":"Aegis Media","permalink":"aegis-media","type_of_entity":"company","image":null}},{"is_past":true,"title":"Vice President, Integrated Marketing","firm":{"name":"MTV Networks","permalink":"mtv-networks","type_of_entity":"company","image":{"available_sizes":[[[136,24],"assets/images/resized/0002/0494/20494v2-max-150x150.png"],[[136,24],"assets/images/resized/0002/0494/20494v2-max-250x250.png"],[[136,24],"assets/images/resized/0002/0494/20494v2-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Senior Vice President Marketing","firm":{"name":"MySpace","permalink":"myspace","type_of_entity":"company","image":{"available_sizes":[[[150,31],"assets/images/resized/0000/4414/4414v80-max-150x150.jpg"],[[250,52],"assets/images/resized/0000/4414/4414v80-max-250x250.jpg"],[[450,94],"assets/images/resized/0000/4414/4414v80-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"<embed src=\"http://blip.tv/play/hRbPmhDUSQ\" type=\"application/x-shockwave-flash\" width=\"370\" height=\"308\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed> ","description":""}],"external_links":[],"web_presences":[{"external_url":"http://www.myspace.com/acourtin","title":"MySapce Page"}]}