{"first_name":"Anil","last_name":"Dash","permalink":"anil-dash-2","crunchbase_url":"http://www.crunchbase.com/person/anil-dash-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"ACTIVATE","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Apr 04 21:32:11 UTC 2011","updated_at":"Tue Dec 27 20:28:21 UTC 2011","overview":"<p>Anil Dash is an entrepreneur, technologist and writer acknolwedged as a &#8220;blogging pioneer&#8221; by the New Yorker for having started his site Dashes.com in 1999 as one of the earliest and most influential blogs on the Internet. Today his work focuses on applying the pioneering techniques and technologies of the startup world in order to transform major institutions in government, media and culture. To achieve these goals, Dash founding Expert Labs in 2009 to enable citizens to connect with government policy makers through social networks, and co-founded Activate in 2009 to help the world&#8217;s major media and technology companies reinvent their business strategies. In addition, Dash is an active advisor to many of the most prominent technology startups and non-profit organizations.</p>\n\n<p>Dash is a member of the board of the popular question-and-answer site Stack Exchange and sits on the board of the New York Tech Meetup which serves as the hub for the New York technology community. Dash is also an advisor to the Web 2.0 conference in New York City, to the reading startup Readability, to the popular upstart hip hop label Greedhead Records and to the noted education non-profit DonorsChoose.</p>\n\n<p>Dash has also been recognized for his role in popularizing web culture and advocating for social and civic responsibility within the technology industry. In addition to his frequent public speaking engagements, his digital works have been showcased in museums including the New Museum of Contemporary Art. In 2010, Dashes.com was named a Webby honoree in the Personal Blog category and Dash was named second most media-connected person in technology by Forbes, and in 2008 Dash was named one of the top ten most influential people in New York City by NowPublic. </p>\n\n<p>Dash&#8217;s earlier career involved a seminal role as Chief Evangelist at Six Apart Ltd. (now SAY Media), where he joined as the first employee at the world&#8217;s leading blogging company, and that work was proceeded by roles in the newspaper and music industries.</p>\n\n<p>Dash lives in New York City with his wife Alaina Browne, general manager of Serious Eats, the James Beard Award winner for Best Food Blog; They have a new son Malcolm. Dash can be found online at dashes.com and on nearly every social network as &#8220;anildash&#8221;.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Activate","permalink":"activate-2","type_of_entity":"company","image":{"available_sizes":[[[150,113],"assets/images/resized/0010/7644/107644v3-max-150x150.png"],[[250,188],"assets/images/resized/0010/7644/107644v3-max-250x250.png"],[[337,254],"assets/images/resized/0010/7644/107644v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}