{"first_name":"Anil","last_name":"Ambani","permalink":"anil-ambani","crunchbase_url":"http://www.crunchbase.com/person/anil-ambani","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 12 06:18:00 UTC 2008","updated_at":"Sat Mar 31 04:21:47 UTC 2012","overview":"<p>Anil Dhirubhai Ambani (born 4 June 1959) is an Indian industrialist and chairman of Reliance Anil Dhirubhai Ambani Group, one of the largest private conglomerates. Anil&#8217;s elder brother Mukesh Ambani, who heads as the chairman of Reliance Industries.[3] The Ambani family is the richest families in India and one of the richest in the world, their wealth inherited from Dhirubhai Ambani, founder of largest Indian conglomerate Reliance Group.</p>\n\n<p>Ambani joined Reliance Industries, the company founded by his late father Dhirubhai Ambani, in 1983 as Co-Chief Executive Officer and is credited with having pioneered many financial innovations in the Indian capital markets For example, he led India&#8217;s first forays into overseas capital markets with international public offerings of global depositary receipts, convertibles and bonds. He directed Reliance in its efforts to raise, since 1991, around US$2 billion from overseas financial markets; with a 100-year Yankee bond issue in January 1997 being the high point, after which people regarded him as a financial wizard. He along with his brother, Mukesh Ambani, has steered the Reliance Group to its current status as India&#8217;s leading textiles, petroleum, petrochemicals, power, and telecom company.</p>\n\n<p>He is a close friend of movie star Amitabh Bachchan and Subrata Roy. One of his major achievements in the entertainment industry is the takeover of Adlabs, the movie production to distribution to multiplex company that owns India&#8217;s only dome theatre and the recently announced joint venture worth US$ 825 million with Steven Spielberg.</p>\n\n<p>He has been embroiled in a dispute with his brother, Mukesh Ambani, over the supply of gas from the latter&#8217;s KG basin.</p>\n\n<p>He recently topped Business Sheet&#8217;s &#8220;world&#8217;s biggest loser&#8221; list of business leaders who lost money in the late 2000s recession, losing $32.5 billion in 2008, which brought him out of the top ten list to number 34 in 2009.</p>","image":{"available_sizes":[[[140,150],"assets/images/resized/0018/1292/181292v2-max-150x150.jpg"],[[233,250],"assets/images/resized/0018/1292/181292v2-max-250x250.jpg"],[[300,321],"assets/images/resized/0018/1292/181292v2-max-450x450.jpg"]],"attribution":"<p>Anil Ambani</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[{"description":"Ambani joined Reliance Industries, the company founded by his late father Dhirubhai Ambani, in 1983 as Co-Chief Executive Officer","stoned_year":1983,"stoned_month":null,"stoned_day":null,"source_url":"","source_text":null,"source_description":"Co-Chief Executive Officer","stoneable_type":"Person","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"first_name":"Anil","last_name":"Ambani","permalink":"anil-ambani"}}],"video_embeds":[],"external_links":[],"web_presences":[]}