{"first_name":"Anil","last_name":"R. Diwan","permalink":"anil-r-diwan","crunchbase_url":"http://www.crunchbase.com/person/anil-r-diwan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Apr 21 04:07:52 UTC 2011","updated_at":"Thu Apr 21 04:09:45 UTC 2011","overview":"<p>Dr. Anil R. Diwan has extensive product development experience while raising financing from collaborations, SBIR grants, other revenues. He has extensive experience in a number of bio-pharmaceutical, biosciences, and biomedical fields and technologies that leads to his novel, integrative approach in solving problems with low costs, high innovation, and world-leading feature sets. Dr. Diwan is the inventor, developer, and principal investor of TheraCour technologies. The nanomaterials based on these technologies form the basis of nanoviricides drugs. \nAnil holds a US patent on his older polymeric micelle technologies, with his colleagues at University of Massachusetts. He has continued to work further in the field, to develop nanomaterials that are capable of multi-specific multi-targeting of viruses, and at the same time capable of encapsulating active pharmaceutical ingredients (API) in industry-leading payload capacities. This new work has resulted in nanomaterials called &#8220;TheraCour&#8221; (therapeutic courier), and the underlying technology is subject of a new patent application. Multi-targeting allows binding to the virus particle like a Velcro tape, and Multi-specificity allows highly selective binding to a specific type of virus. The encapsulated API can get injected into the virus particle. \nAnil holds a Ph.D. from Rice University, TX, a B.Tech. from Indian Institute of Technology, Bombay (IIT-B), India, and has consistently held high scholastic ranks and honors. Anil has over 18 years of Bio-Pharmaceuticals R&amp;D experience with 12 years as an entrepreneur.</p>","image":null,"degrees":[{"degree_type":"B.Tech.","subject":"","institution":"Indian Institute of Technology","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chairman and President","firm":{"name":"NanoViricides","permalink":"nanoviricides","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0013/1440/131440v1-max-150x150.jpg"],[[231,70],"assets/images/resized/0013/1440/131440v1-max-250x250.jpg"],[[231,70],"assets/images/resized/0013/1440/131440v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}