{"first_name":"Anindya","last_name":"Datta","permalink":"anindya-datta","crunchbase_url":"http://www.crunchbase.com/person/anindya-datta","homepage_url":"","birthplace":"Kolkata, India","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Mobilewalla","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Mar 28 10:31:10 UTC 2011","updated_at":"Tue Apr 05 21:35:53 UTC 2011","overview":"<p>Anindya Datta is currently the Chairman of Mobilewalla and a faculty in the School of Computing at the National University of Singapore.</p>\n\n<p>Anindya has more than two decades of experience as an executive entrepreneur, academic leader and IT innovator with core contributions in the area of internet and high performance database systems.  In 1999, Anindya founded Chutney Technologies and led all development and operational aspects of the company, providing both technology and corporate vision. Under his leadership, Chutney was backed by leading venture firms (including Kleiner Perkins Caulfield and Byars) and evolved from an application performance company into one of the earliest entrants in the application virtualization area, pioneering the area of application layer object storage and virtualization, which is now widely recognized as a core functionality of any object-oriented application. The company was acquired by Cisco Systems in 2005.  </p>\n\n<p>Anindya&#8217;s academic career started at the University of Arizona in 1994, and continued at Georgia Tech where he moved with an Associate Professorship in 1998. At Georgia Tech, he was the founding director of the Georgia Tech Center for Electronic Commerce. He acquired a $1M grant from iXL Corporation to start and fund the Center. </p>\n\n<p>Anindya is recognized as having contributed fundamentally to a few of the key ideas in database and application systems. In database systems, his work has been partly responsible for the creation of many of the access structures commonly in use today in commercial data warehousing systems (a class of indexes known as bitmap indexes). He is also a major contributor to the area of internet infrastructure – his work (patented in Chutney) resulted in the creation of dynamic internet caches, used in virtually every web application today.  </p>\n\n<p>Anindya earned his PhD and his M.S. degrees from the University of Maryland, College Park, and his Bachelor of Technology degree from the Indian Institute of Technology, Kharagpur, India.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0012/8044/128044v2-max-150x150.jpg"],[[200,200],"assets/images/resized/0012/8044/128044v2-max-250x250.jpg"],[[200,200],"assets/images/resized/0012/8044/128044v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B. Tech","subject":"","institution":"IIT","graduated_year":1986,"graduated_month":null,"graduated_day":null},{"degree_type":"MS, Ph.D.","subject":"Computer Science","institution":"University of Maryland, College Park","graduated_year":1994,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Executive Chairman","firm":{"name":"Mobilewalla","permalink":"mobilewalla","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}