{"first_name":"Anne","last_name":"Zehren","permalink":"ann-zehren","crunchbase_url":"http://www.crunchbase.com/person/ann-zehren","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":"","created_at":"Mon Aug 02 20:15:18 UTC 2010","updated_at":"Mon Aug 02 20:27:48 UTC 2010","overview":"<p>Anne Zehren is CEO of social shopping website Kaboodle. Previously, she served as the President and Chief Operating Officer of Common Sense Media, Inc. Before that, Ms. Zehren served as President of Sales and Marketing of Current TV. </p>\n\n<p>Ms. Zehren runs her own consulting company advising clients, including The Wet Seal, Inc., on innovative strategies to drive profitable performance. She is a national authority on women and teens.  She has worked in various roles at major magazine publishing and media companies including Conde Nast&#8217;s Glamour, Newsweek and NBC. </p>\n\n<p>Ms. Zehren is a board member of the National Campaign Against Youth Violence and was named to President Clinton&#8217;s Executive Advisory Board on Youth Violence. She served as Member of Board of Advisors of Common Sense Media, Inc. She served as a Director of The Wet Seal Inc. from August 2004 to November 9, 2004. Ms. Zehren was inducted into the prestigious Advertising Hall of Achievement and a D.A.R.E. American Award winner. She appeared frequently in media outlets including The Wall Street Journal, The New York Times, Business Week, The New Yorker, USA Today, Los Angeles Times, NBC, CBS, CNN, Fox, NPR, Entertainment Tonight, Extra, and E!.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Kaboodle","permalink":"kaboodle","type_of_entity":"company","image":{"available_sizes":[[[150,42],"assets/images/resized/0001/6674/16674v1-max-150x150.png"],[[181,51],"assets/images/resized/0001/6674/16674v1-max-250x250.png"],[[181,51],"assets/images/resized/0001/6674/16674v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}