{"first_name":"Anna","last_name":"Dvornikova","permalink":"anna-dvornikova","crunchbase_url":"http://www.crunchbase.com/person/anna-dvornikova","homepage_url":"","birthplace":"Moscow, Russia","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1977,"born_month":10,"born_day":30,"tag_list":"","alias_list":null,"created_at":"Fri Aug 12 01:55:41 UTC 2011","updated_at":"Mon Jul 16 06:35:25 UTC 2012","overview":"<p>Anna is a Managing Partner at TEC Ventures, a seed-stage venture capital fund, and a Managing Director of TEC (The Entrepreneurs’ Club, www.tecglobal.org) – an international network of 5,000+ high-tech entrepreneurs, executives, investors, and other professionals based in Silicon Valley.</p>\n\n<p>For many years Anna was an angel investor with some of her portfolio companies rating as top 10 Russian high-tech startups. She also served as the President of the Russian-speaking network abroad, growing it from a small local gathering to the largest organization worldwide, and was the Founder of several premier high-tech conferences in Silicon Valley. She is the author of many articles on entrepreneurship, angel and venture financing.</p>\n\n<p>In 2010, in partnership with Rusnano, Anna organized the first ever delegation of 20 Managing Partners representing top Silicon Valley VC firms with more than $60 bln under management to Moscow to meet with Russian business, investment and government elite, including President Medvedev. She also was the organizer and a host of the Russian President and his delegation&#8217;s visit in the Silicon Valley in June 2010.</p>\n\n<p>Anna is a frequent speaker at international and executive conferences. She was featured on CNN, in Wall Street Journal, San Jose Mercury News, Silicon Valley/San Jose Business Journal, as well as major Russian TV channels and newspapers.</p>\n\n<p>Anna holds her J.D. from the Moscow State Institute of International Relations (MGIMO) and her Master of Laws degree from Boalt Hall School of Law, University of California, Berkeley.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0014/9087/149087v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0014/9087/149087v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0014/9087/149087v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}