{"first_name":"Anne","last_name":"Dixon","permalink":"anne-m-dixon","crunchbase_url":"http://www.crunchbase.com/person/anne-m-dixon","homepage_url":"","birthplace":"","twitter_username":"annemdixon","blog_url":"http://theminervablog.com/","blog_feed_url":"","affiliation_name":"Amgen","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Sep 28 17:44:58 UTC 2009","updated_at":"Fri Mar 11 04:20:28 UTC 2011","overview":"<p>Anne Dixon has led transformational strategy and organizational change initiatives across many industries, sectors and cultures. Her industry experience spans technology, biopharma and life sciences, aerospace and defense and management consulting. She has consulted for several US Federal Agencies and non-profit organizations including the World Bank, the World Economic Forum and the Smithsonian Institution. She has led teams across North America, Asia, Latin America and Europe and has worked as an expatriate in Japan, the Philippines, France and the United Kingdom.</p>\n\n<p>Dixon is co-founder and Managing Partner of Oulixeus Ltd. Her recent engagements have included working with the CEO, CFO and Board of an eClinical company to develop a strategic business plan and define market positioning for a mobile, cloud-based technology. She is also working pro bono for the Chinook Nation to develop a strategic plan and seek funding for key preservation grants.</p>\n\n<p>She was previously Director, Enterprise Risk Management (ERM) at Amgen, where she integrated enterprise-level risk processes across the global sales and marketing, government affairs, human resources and information systems organizations. In her previous role as Director, Corporate Change Management, Dixon led a team of change management and process improvement experts supporting initiatives including international business expansion. Dixon also led red teaming and business continuity planning efforts for the company’s global Enterprise Resource Planning (ERP) system implementation.</p>\n\n<p>Prior to Amgen, Dixon was Senior Director at Science Applications International Corporation (SAIC) Policy and Analysis Consulting, then Hicks &amp; Associates. Dixon led biodefense strategy efforts for the Department of Defense, including development of new approaches to doctrine and battlefield detection and personal protection tactics. Dixon also developed a concept for using infrared sensors to detect disease outbreak, which was validated by the Air Force Institute of Operational Health. At SAIC and Defense Group Inc. (DGI), Dixon developed scenarios for WMD defense and hazardous materials accidents war games to test US force readiness and improve cooperation with foreign militaries.</p>\n\n<p>At Booz | Allen | Hamilton, Dixon led organizational redesign efforts for Federal clients, including redesign of the headquarters and the research function of an 110,000-person agency to make it more customer oriented. She also developed strategic plans and led process improvement programs for several Department of Defense clients.</p>\n\n<p>Prior to this, Dixon’s career was internationally focused. At the Center for Naval Analyses (CNA) Regional Studies Program, Dixon advised regional Naval Commanders on options to increase security cooperation in Europe, the Middle East, Northeast Asia and Southeast Asia. She designed a lecture series commemorating the 50th Anniversary of the Marshall Plan for the Smithsonian Institution, where she also taught a course on Hong Kong’s reversion to Chinese sovereignty.</p>\n\n<p>Dixon began her career in international development. She was a field task lead for a World Bank microfinance program in the Philippines and worked as a researcher and writer at the Overseas Development Council (ODC). She also taught English and French in Japan.</p>\n\n<p>Dixon is a Certified Compliance and Ethics Professional (CCEP) and a certified facilitator. She speaks fluent French; proficient Italian and Spanish; and intermediate Japanese.</p>\n\n<p>Dixon holds a master of arts in international relations, international economics and European studies from The Johns Hopkins University Paul H. Nitze School of Advanced International Studies (SAIS), studying at the Washington, DC and Bologna, Italy campuses. She earned a bachelors of arts in English, international relations and French from Beloit College, with study at L’Université de Haute Bretagne (University of Upper Brittany) in Rennes, France.</p>","image":{"available_sizes":[[[106,150],"assets/images/resized/0006/1179/61179v2-max-150x150.jpg"],[[120,169],"assets/images/resized/0006/1179/61179v2-max-250x250.jpg"],[[120,169],"assets/images/resized/0006/1179/61179v2-max-450x450.jpg"]],"attribution":"<p>Oulixeus Ltd.</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Partner","firm":{"name":"Oulixeus Ltd","permalink":"oulixeus-ltd","type_of_entity":"company","image":{"available_sizes":[[[150,35],"assets/images/resized/0006/1022/61022v2-max-150x150.png"],[[250,59],"assets/images/resized/0006/1022/61022v2-max-250x250.png"],[[389,93],"assets/images/resized/0006/1022/61022v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"","firm":{"name":"Amgen","permalink":"amgen","type_of_entity":"company","image":{"available_sizes":[[[97,28],"assets/images/resized/0005/9904/59904v1-max-150x150.jpg"],[[97,28],"assets/images/resized/0005/9904/59904v1-max-250x250.jpg"],[[97,28],"assets/images/resized/0005/9904/59904v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"","firm":{"name":"Hick's and Associates","permalink":"hicks-and-associates","type_of_entity":"company","image":null}},{"is_past":true,"title":"","firm":{"name":"CNA","permalink":"cna","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0011/1374/111374v1-max-150x150.png"],[[155,62],"assets/images/resized/0011/1374/111374v1-max-250x250.png"],[[155,62],"assets/images/resized/0011/1374/111374v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"","firm":{"name":"Booz Allen Hamilton","permalink":"booz-allen-hamilton","type_of_entity":"company","image":{"available_sizes":[[[150,22],"assets/images/resized/0010/9453/109453v1-max-150x150.jpg"],[[250,36],"assets/images/resized/0010/9453/109453v1-max-250x250.jpg"],[[259,38],"assets/images/resized/0010/9453/109453v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"","firm":{"name":"World Bank","permalink":"world-bank","type_of_entity":"company","image":{"available_sizes":[[[33,29],"assets/images/resized/0006/5600/65600v1-max-150x150.png"],[[33,29],"assets/images/resized/0006/5600/65600v1-max-250x250.png"],[[33,29],"assets/images/resized/0006/5600/65600v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}