{"first_name":"Anne","last_name":"Frisbie","permalink":"anne-frisbie","crunchbase_url":"http://www.crunchbase.com/person/anne-frisbie","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"InMobi","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 05 06:52:45 UTC 2009","updated_at":"Fri Jul 22 17:26:13 UTC 2011","overview":"<p>Anne joined InMobi in 2008 as Head of North America. She most recently served as Vice President of Category and Sales Intelligence at Yahoo! where she worked from 2003 to 2008. At Yahoo, she was charged with managing Yahoo’s most important categories that accounted for a majority of the company’s revenue. She and her team provided leading branded advertisers and top-tier agencies, strategic insights and digital media solutions. Anne has been working in the digital media industry for the past eleven years. Most recently she was selected as one of Mobile Entertainment Magazine’s Top 10 Women in Mobile. </p>\n\n<p>She helped found an online shopping service in 1996 that was ultimately funded by CMP Media, and then she focused on local search in 1997 at Zip2 Corporation where she served as a Director of Publisher Development. Zip2 was acquired by AltaVista in 1998. Anne worked at AltaVista as a Director of Strategic Alliances, and then later ran sales and business development for the company until it was sold to Overture in early 2003.</p>\n\n<p>Prior to her work in digital media, Anne was an investment analyst at Goldman Sachs. Anne holds a Bachelors Degree in Economics from Georgetown University. Anne is a thorough professional and believes that good management is the art of making problems so interesting and their solutions so constructive that everyone wants to get to work and deal with them. She is an avid wine collector, loves playing duplicate Bridge and is the proud mother of three children. Anne was drawn to InMobi because of the talented management team combined with the attraction of helping to build the mobile ecosystem from the ground up in countries where mobile is not only a first screen but a truly passionate and personal device.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP and GM Global Supply","firm":{"name":"InMobi","permalink":"inmobi","type_of_entity":"company","image":{"available_sizes":[[[150,21],"assets/images/resized/0001/7406/17406v11-max-150x150.jpg"],[[250,35],"assets/images/resized/0001/7406/17406v11-max-250x250.jpg"],[[450,63],"assets/images/resized/0001/7406/17406v11-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}