{"first_name":"Anne","last_name":"Claire Broughton","permalink":"anne-claire-broughton","crunchbase_url":"http://www.crunchbase.com/person/anne-claire-broughton","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 08 08:02:25 UTC 2009","updated_at":"Mon Jun 08 08:04:31 UTC 2009","overview":"<p>Anne Claire Broughton is Co-Founder and Senior Director of SJF Advisory Services. Broughton has been with SJF since 1999 and served as the Founding Executive Director of SJF Advisory Services from 2001-2007.  She manages SJF’s Cleantech CEO Panels, Winning Workforce CEO Panel, and webinar series. Broughton has helped raise more than $3 million in grant funds, co-authored three national research reports and numerous articles for national and international publications, led seven years of mission impact assessment and reporting, and spoken at numerous conferences on behalf of SJF. She serves as SJF thought leader on employee engagement topics and directs SJF’s workforce engagement-related technical assistance, including matching SJF portfolio companies with recruitment, training, asset-building, and benefit programs; leads SJF&#8217;s mission impacts assessment work; and also heads up SJF marketing and outreach initiatives.  She is a founding member and serves on the Board of the North Carolina Sustainable Business Council and also serves on the Advisory Board of Rebirth Capital, a CDE based in New Orleans with a focus on financing renewable energy projects.\nPrior to joining SJF, Broughton was Editor-in-Chief of Recycling Today, a premier national business magazine for the industrial and municipal recycling sectors. She has also served as the founding Recycling Coordinator for Richmond Heights, Ohio and as a Recycling Analyst for the Institute for Local Self-Reliance, where she co-authored a leading industry report. Broughton holds a BA from Oberlin College and a Certificate in Nonprofit Management from Duke University. She is an active classical violinist, singer, and mom. </p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0004/7299/47299v1-max-150x150.jpg"],[[123,164],"assets/images/resized/0004/7299/47299v1-max-250x250.jpg"],[[123,164],"assets/images/resized/0004/7299/47299v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"","institution":"Oberlin College","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder and Senior Director","firm":{"name":"SJF Ventures","permalink":"sjf-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[89,150],"assets/images/resized/0004/7297/47297v3-max-150x150.jpg"],[[132,222],"assets/images/resized/0004/7297/47297v3-max-250x250.jpg"],[[132,222],"assets/images/resized/0004/7297/47297v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}