{"first_name":"Anne","last_name":"Sweeney","permalink":"anne-sweeney","crunchbase_url":"http://www.crunchbase.com/person/anne-sweeney","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 21 02:33:59 UTC 2008","updated_at":"Wed May 21 03:03:08 UTC 2008","overview":"<p>Anne Sweeney serves as co-chair, Disney Media Networks and president, Disney-ABC Television Group, where she is responsible for The Walt Disney Company&#8217;s entertainment and news television properties globally. She was promoted to this role in April 2004.</p>\n\n<p>Ms. Sweeney oversees the ABC Television Network, which provides entertainment, news and kids programming to viewers via 228 affiliated stations across the U.S. in addition to other technological platforms. ABC series, many of which are produced by ABC Studios, are distributed to more than 200 territories across the globe by Disney-ABC Worldwide Television. Disney-ABC Television Group also comprises Disney Channels Worldwide, which includes 27 Disney Channels, 10 Playhouse Disney Channels, nine Toon Disney Channels and 19 Jetix/GXT Channels, as well as Radio Disney and Walt Disney Television Animation, a TV animation studio. Today Disney Channel programming reaches more than 500 million individuals in 127 countries. Ms. Sweeney also manages cable networks ABC Family and SOAPnet, as well as Disney&#8217;s publishing imprint, Hyperion, and the company&#8217;s equity interest in Lifetime Entertainment Services and A&amp;E Television Network.</p>\n\n<p>During her tenure, Disney-ABC Television Group&#8217;s properties have experienced tremendous growth. With the help of hit series &#8220;Grey&#8217;s Anatomy,&#8221; &#8220;Desperate Housewives&#8221; and &#8220;Dancing with the Stars,&#8221; ABC&#8217;s primetime audience has grown consistently from the 2003-04 TV season to present. ABC Studios has expanded its creative product output from 11 series in 2004 to more than 20 currently across broadcast and cable television. Popular series such as &#8220;Lost&#8221; have found new audiences across a variety of platforms, including VOD, broadband and mobile, in addition to the internet. ABC News&#8217; &#8220;World News with Charles Gibson&#8221; has also moved into a lead position among the nightly newscasts, while forging into the 24-hour digital space, with content available throughout the day on ABCNews.com and an afternoon webcast that is downloaded by millions.</p>\n\n<p>Consistently ranked as basic cable&#8217;s No. 1 network in primetime among Kids 6-11 and Tweens 9-14, Disney Channel has continued to develop branded programming and franchises with worldwide appeal, utilizing popular series like &#8220;Hannah Montana,&#8221; the CG animated &#8220;My Friends Tigger &amp; Pooh&#8221; and Disney Channel Original Movies like the smash hit &#8220;High School Musical 2&#8221; to continue its ratings momentum and expand into additional markets around the world. ABC Family, available in more than 95 million U.S. homes, also continues to grow its core audience with exciting, hip programming like &#8220;Greek&#8221; and &#8220;Kyle XY.&#8221;</p>\n\n<p>With more than 100 general-interest fiction and non-fiction titles introduced in 2007, Hyperion is home to numerous bestsellers, including David Halberstam&#8217;s The Coldest Winter, Gary Troup&#8217;s Bad Twin and the New York Times No. 1 Bestseller, Mitch Albom&#8217;s For One More Day. From October 2000 to April 2004, Ms. Sweeney served as president of ABC Cable Networks Group and Disney Channels Worldwide. Under her leadership, Disney Channel more than quintupled its subscriber base with its mix of original series and movies and acquired programming. It is now available on basic cable in more than 95 million homes in the United States.</p>\n\n<p>Ms. Sweeney also oversaw the successful launch of the 24-hour animation channel Toon Disney in April 1998, and built it to its current reach of more than 67 million homes in the United States. Less than two years later, in January 2000, she oversaw the launch of SOAPnet, the 24-hour soap opera network now available in more than 68 million U.S. homes.</p>\n\n<p>Ms. Sweeney joined The Walt Disney Company in February 1996 as president of Disney Channel and executive vice president of Disney/ABC Cable Networks. Previously she was chairman and CEO of FX Networks, Inc., since 1993. During her tenure there, she presided over the launch of two basic cable networks, FX, an entertainment network representing the most successful basic cable launch in history, and FXM: Movies from Fox, Hollywood&#8217;s first studio-based movie network.</p>\n\n<p>Before joining Fox, Ms. Sweeney spent 12 years at Nickelodeon/Nick at Nite in various executive positions, most recently as senior vice president of Program Enterprises. Among many accomplishments, she oversaw Nickelodeon&#8217;s international expansion, including launching the channel in the United Kingdom, resulting in a joint venture with British Sky Broadcasting.</p>\n\n<p>Active in organizations both within and outside the television industry, Ms. Sweeney is a board member of Lifetime Television, the Paley Center for Media (formerly the Museum of TV &amp; Radio), the American Film Institute, the Special Olympics and an honorary chair of Cable Positive.</p>\n\n<p>Since assuming her current role as co-chair of Disney Media Networks and president, Disney-ABC Television Group, Ms. Sweeney has repeatedly been named the &#8220;Most Powerful Woman in Entertainment&#8221; by The Hollywood Reporter, one of the &#8220;50 Most Powerful Women in Business&#8221; by Fortune and one of &#8220;The World&#8217;s 100 Most Powerful Women&#8221; by Forbes. She was honored with the Golden Mike Award for Outstanding Contributions to Broadcasting by the Broadcasters Foundation of America in February of this year and the Matrix Award for television from New York Women in Communications, Inc. in April. In May, Ms. Sweeney will receive the Distinguished Vanguard Award for Leadership from the National Cable &amp; Telecommunications Association. Ms. Sweeney was inducted into the Cable Center&#8217;s Hall of Fame in October 2007 and recognized by the Producers Guild of America in 2006 with the President&#8217;s Citation for her efforts on behalf of diversity across the Disney-ABC Television Group. In 2005 she was inducted into the Broadcasting &amp; Cable &#8220;Hall of Fame,&#8221; and in 2004 received the Muse Award from New York Women in Film &amp; Television. She has been honored repeatedly by Women in Cable &amp; Telecommunications &#8211; as Executive of the Year in 1994, Woman of the Year in 1997, and in 1998 as the recipient of the Advocate Leader Award from WICT&#8217;s Southern California chapter. In 1995 she received the prestigious STAR Award from American Women in Radio and Television. She was inducted into the American Advertising Federation&#8217;s Advertising Hall of Achievement in 1996. In 2002 she received Women in Film&#8217;s esteemed Lucy Award and has been awarded the Cable Television Public Affairs Association&#8217;s President&#8217;s Award.</p>\n\n<p>Ms. Sweeney earned a BA degree from The College of New Rochelle and an Ed. M. degree from Harvard University. She resides in Los Angeles with her husband, attorney Philip Miller, and their two children.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/8998/18998v1-max-150x150.jpg"],[[200,200],"assets/images/resized/0001/8998/18998v1-max-250x250.jpg"],[[200,200],"assets/images/resized/0001/8998/18998v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://corporate.disney.go.com/corporate/management_team.html\" title=\"Disney\" rel=\"nofollow\">Disney</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Co-Chair Disney Media Networks and President, Disney-ABC Television Group","firm":{"name":"The Walt Disney Company","permalink":"the-walt-disney-company","type_of_entity":"company","image":{"available_sizes":[[[150,73],"assets/images/resized/0001/0929/10929v1-max-150x150.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-250x250.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}