{"first_name":"Anoop","last_name":"Prasanna","permalink":"anoop-prasanna","crunchbase_url":"http://www.crunchbase.com/person/anoop-prasanna","homepage_url":"http://www.orangelab.in","birthplace":"Chennai","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1987,"born_month":12,"born_day":14,"tag_list":"","alias_list":null,"created_at":"Tue May 01 11:22:07 UTC 2012","updated_at":"Wed May 09 05:32:01 UTC 2012","overview":"<p>Hi There,</p>\n\n<p>Greetings!</p>\n\n<p>We are an India based offshore web design &amp; development company having more than five years of experience. We are both versatile and experience to assist any company with its Web Site Design, Graphics, Search Engine Marketing, Database Application Development, ecommerce, Search Engine Optimization Project Requirements.</p>\n\n<p>We have a highly capable team of web consultants, creative designers, programmers and web marketing professionals.</p>\n\n<p>Our Developers are Multi skilled and have great expertize on:\nXHTML | CSS | JavaScript | PHP/ MY SQL | codeigniter | JQuery | AJAX |Joomla | Drupal | WordPress | OsCommerce | VirtueMart | Zen Cart | Flash | Photoshop | Illustrator | CorelDraw .</p>\n\n<p>Our partners can expect cost savings upwards of 40%-50% in their project cost through the use of our resources and ready solutions. We guarantee the quality of our work, timely delivery and above all confidentiality.</p>\n\n<p>Orange believes in providing the highest quality of service to our clients by dedicating ourselves to each and every project, large or small. We would like to request you for an opportunity to work and AMAZE you with our service.</p>\n\n<p>We wish you the best of luck and looking forward to a long and healthy business relationship with you and your company. If you have any query, we will be more than happy to provide you our quick assistance.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}