{"first_name":"Anouchka","last_name":"Bala","permalink":"anouchka-bala","crunchbase_url":"http://www.crunchbase.com/person/anouchka-bala","homepage_url":"http://www.LuxxLab.com","birthplace":"","twitter_username":"LuxxLab","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"www-luxxlab-com, luxxlab, luxx-lab, luxlab, lux-lab, online, e-commerce, marketplace, fashion, luxury, emerging-designer, contemporary-fashion, platform, start-up, entrepreneur, technology, fashion-technology, music, entertainment","alias_list":null,"created_at":"Tue Nov 13 08:52:53 UTC 2012","updated_at":"Mon Nov 19 07:41:58 UTC 2012","overview":"<p>Anouchka started her career at Universal Music International, working within Marketing in London and Paris. She later joined Extreme Music, a division of Sony Music where she launched and headed up divisions in France and Benelux, in addition to responsibilities in the UK. Three years later she was headhunted to work within Strategic Brand Partnerships at Havas Worldwide where she worked on the 360 degree deal between Bacardi Global Brand and Groove Armada. Her most recent position was as Managing Director of The:Hours Entertainment, also part of Havas Worldwide and included launching the London office. Her clients included Cartier, Estée Lauder and Tommy Hilfiger amongst others. Anouchka is the forth generation in her family to work in the luxury industry.</p>\n\n<p>Anouchka has a BA in International Business from Bristol Business School, including an exchange at EDHEC Business School. She grew up in London, Paris and Mauritius, and has also lived in Nice, Cannes, Monaco and the Middle East. Anouchka is bilingual in English and French and has studied Spanish. </p>\n\n<p>Recognising that emerging designers face difficulties with growth, Anouchka co-founded Luxx Lab to provide an economically viable platform to increase the designers’ exposure before they hit the mainstream.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://twitter.com/AnouchkaBala","title":"Twitter @AnouchkaBala"},{"external_url":"https://twitter.com/LuxxLab","title":"Twitter @LuxxLab"},{"external_url":"http://www.linkedin.com/profile/edit?trk=hb_tab_pro_top","title":"LinkedIn"}]}