{"first_name":"Anthony","last_name":"Uzzo","permalink":"anthony-uzzo","crunchbase_url":"http://www.crunchbase.com/person/anthony-uzzo","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Core Informatics","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Oct 09 00:23:57 UTC 2010","updated_at":"Mon Oct 11 18:36:50 UTC 2010","overview":"<p>Anthony Uzzo is President of Core Informatics. He brings over 12 years of experience in delivering custom Laboratory Information Management Systems to the biotechnology, pharmaceutical and academic communities. He has extensive experience in software engineering, informatics, laboratory automation, project management and science.</p>\n\n<p>Anthony’s LIMS projects have focused on a wide range of research needs including Electronic Document Management Systems built to comply with 21-CFR-11, High Throughput Screening (HTS), Animal Facility Management, In-vivo Study Management, Laboratory Automation and Integration, High Throughput Analog Chemistry, Inventory Management, Gene Expression, Proteomics, and Project Management.</p>\n\n<p>Prior to joining Core Informatics, Anthony was the Associate Director of Research Informatics at CGI Pharmaceuticals where he was instrumental in the delivery of a fully integrated drug discovery LIMS. This system is responsible for managing all aspects of CGI’s drug discovery process and was part of the drug discovery foundation that helped CGI raise $34.9M in Series C capital. In addition, the LIMS at CGI has enabled scientists to identify drug candidates in each of CGI’s discovery programs, both of which are nearing clinical development. Anthony’s work experience reflects positions of increasing responsibility at CGI Pharmaceuticals, Verification Technologies, 3rd Millennium and Neurogen Corporation. He holds a degree in Biomedical Engineering from Boston University.</p>","image":null,"degrees":[{"degree_type":"Bachelor of Science","subject":"BioMedical Engineering","institution":"Boston University","graduated_year":1997,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President","firm":{"name":"Core Informatics","permalink":"core-informatics","type_of_entity":"company","image":{"available_sizes":[[[150,36],"assets/images/resized/0010/4867/104867v2-max-150x150.png"],[[250,61],"assets/images/resized/0010/4867/104867v2-max-250x250.png"],[[450,110],"assets/images/resized/0010/4867/104867v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/anthonyuzzo","title":"LinkedIn"}]}