{"first_name":"anthony","last_name":"Rolon","permalink":"anthony-rolon","crunchbase_url":"http://www.crunchbase.com/person/anthony-rolon","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1969,"born_month":3,"born_day":8,"tag_list":"","alias_list":null,"created_at":"Thu Mar 31 06:48:45 UTC 2011","updated_at":"Wed Apr 06 00:50:41 UTC 2011","overview":"<p>Anthony Rolon has over twenty years of marketing and sales experience and an extensive background in the private post-secondary education sector.</p>\n\n<p>Anthony Rolon began his career as an Admissions Representative in 1989. Since then, he has held a wide variety of admissions and marketing management positions in both single-location and multi-location environments. His career includes positions at Berkeley College, ATI Enterprises, Florida Career College, the American Institute of Massage Therapy, and the American Institute of Cosmetology—of which he was an owner.</p>\n\n<p>He served as Vice President of Interactive Media for EdExperts, an advertising agency servicing companies both inside and outside the education sector. In addition to being responsible for lead generation, management, and performance of the entire interactive division, Rolon also controlled millions of internet ad dollars annually.</p>\n\n<p>Rolon prides himself on his dedication to the innovative field of internet marketing. It was this dedication that led to the creation of World Web Partners in 2008 and the development of its education portal, Americolleges.com.  Anthony Rolon is currently the CEO at World Web Partners, Inc.</p>","image":{"available_sizes":[[[123,150],"assets/images/resized/0012/8554/128554v2-max-150x150.jpg"],[[200,243],"assets/images/resized/0012/8554/128554v2-max-250x250.jpg"],[[200,243],"assets/images/resized/0012/8554/128554v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}