{"first_name":"Anthony","last_name":"Carrabino","permalink":"anthony-carrabino","crunchbase_url":"http://www.crunchbase.com/person/anthony-carrabino","homepage_url":"http://www.carrabino.com","birthplace":"MI","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Microsoft","born_year":1969,"born_month":8,"born_day":1,"tag_list":"carrabino, microsoft, product-management, startups, web, digital-marketing, apollo, vistadb","alias_list":null,"created_at":"Wed Oct 07 06:02:37 UTC 2009","updated_at":"Mon Oct 08 10:21:29 UTC 2012","overview":"<p>I&#8217;m a digital marketing professional. I specialize in applying neuromarketing techniques and my own proven marketing know-how to generate excitement and interest in the products that I manage.</p>\n\n<p>My Background</p>\n\n<p>I was a Sr. Product Manager at Microsoft, where I received several Microsoft marketing awards as the Digital Marketing Lead for SQL Server and BizTalk. I was personally responsible for influencing millions of web visitors annually and affecting over $4B of Microsoft revenue. This amazing experience allowed me to directly manage Microsoft&#8217;s worldwide marketing muscles.</p>\n\n<p>Before joining Microsoft, I owned Vista Software where I managed the software development and marketing efforts for two award-winning database products. During this time, I also served as VP of Marketing for CyberSage, where my efforts directly helped us get acquired by Macromedia (now Adobe).</p>\n\n<p>These diverse experiences have exposed me to a wide range of difficult and exciting marketing challenges. From managing all marketing efforts on a shoe string budget, to driving global marketing efforts across dozens of products and cross-functional teams worldwide with multimillion dollar budgets at Microsoft.\nSpecialties</p>\n\n<p>advertising, branding, creative, digital marketing, graphics design, information architecture, interaction design, marketing, mobile web, neuro web design, neuromarketing, new product development, product management, software design and development, start-ups, user experience design, video editing, web design, web development</p>","image":{"available_sizes":[[[111,150],"assets/images/resized/0006/1896/61896v2-max-150x150.jpg"],[[186,250],"assets/images/resized/0006/1896/61896v2-max-250x250.jpg"],[[334,450],"assets/images/resized/0006/1896/61896v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Sr. Product Manager","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.carrabino.com","title":"Bio"},{"external_url":"http://www.linkedin.com/in/carrabino","title":"LinkedIn"}]}