{"first_name":"Anthony","last_name":"K. Tjan","permalink":"anthony-k-tjan","crunchbase_url":"http://www.crunchbase.com/person/anthony-k-tjan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Cue Ball","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Mar 19 19:05:51 UTC 2009","updated_at":"Sat Jun 18 13:34:10 UTC 2011","overview":"<p>Anthony (Tony) Tjan is CEO and Managing Partner of Cue Ball. Tony brings a successful track record as an entrepreneur, principal investor, and strategic advisor to Cue Ball. Tony leads the firm’s overall direction and is involved across deal development activities, including on-going guidance and mentorship to the leadership of Cue Ball’s portfolio companies. Tony is one of the World Economic Forum&#8217;s Global Leaders for Tomorrow and has been a speaker at the TED conference. He sits on the boards of Cyberplex, Knovel, Shape Up the Nation, Epic Burger, and MiniLuxe.</p>\n\n<p>Background\nTony’s most recent position was as Senior Partner (youngest elected) at The Parthenon Group, a leading strategic advisory and investment firm where he continues to serve as Vice Chairman. At Parthenon, he led digital media and information client relationships – a natural extension of his heritage as an Internet entrepreneur and as a longstanding senior advisor to Thomson Corporation (now Thomson Reuters). At Thomson, he served as the chief strategic counselor reporting to his now Cue Ball partner Dick Harrington who was CEO of Thomson at the time. Beginning in 2001 the pair worked together on the growth and transformation strategy that led to a four-fold increase in cash flow, the acquisition of Reuters, and ultimately the creation of the world’s largest information media company. Tony was a pioneer in the Internet’s commercialization, and in 1996 he founded and was CEO of the Internet services firm, ZEFER (now an NEC subsidiary), which grew to more than $100MM in annual revenues and more than 700 professionals. Tony started his career with McKinsey &amp; Company where he focused on consumer and media clients.</p>\n\n<p>Tony lives in Brookline, Massachusetts with his wife, Laura, and their three children.</p>\n\n<p>Education\nHarvard College, A.B.\nHarvard Business School, M.B.A\nHarvard Kennedy School of Government, Fellow</p>\n\n<p>Recent Publication\nHarvard Business Review (March 2008): Transforming Strategy One Customer at a Time\nA seminal approach on how to get maniacal about customers in a B2B setting. </p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0013/9737/139737v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0013/9737/139737v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0013/9737/139737v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO and General Partner","firm":{"name":"Cue Ball","permalink":"cue-ball","type_of_entity":"financial_org","image":{"available_sizes":[[[150,35],"assets/images/resized/0003/8948/38948v1-max-150x150.png"],[[230,54],"assets/images/resized/0003/8948/38948v1-max-250x250.png"],[[230,54],"assets/images/resized/0003/8948/38948v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}