{"first_name":"Anthony","last_name":"Browne","permalink":"anthony-browne","crunchbase_url":"http://www.crunchbase.com/person/anthony-browne","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Sun Mar 06 11:13:03 UTC 2011","updated_at":"Sun Mar 06 11:13:03 UTC 2011","overview":"<p>Anthony Browne started working for the Mayor of London in October 2008. As well as giving general policy advice to the Mayor, he leads on economic and business policy. He has responsibility in the Mayor&#8217;s office for the London Development Agency, is an LDA Board member and represents London on the Regional Economic Council, co- chaired by the Chancellor and the Business Secretary. He is also an observer on theCityUK, a new body established to represent financial services in the UK. He was previously director of Policy Exchange, the largest free market think tank in Europe. He was an award winning national journalist for nearly twenty years, having been economics correspondent of the BBC and Observer, health editor of the Observer, and Europe correspondent and chief political correspondent of the Times. He has written reports on issues ranging from the NHS to housing, the European single currency, environment and welfare reform for several think tanks. Before being lured into the media, he worked briefly for the management consultants Booz.Allen and Hamilton. Anthony has a degree in mathematics from Cambridge University, and lives with his wife and two children in North London.</p>","image":{"available_sizes":[[[150,98],"assets/images/resized/0012/5212/125212v1-max-150x150.png"],[[232,152],"assets/images/resized/0012/5212/125212v1-max-250x250.png"],[[232,152],"assets/images/resized/0012/5212/125212v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}