{"first_name":"Anthony","last_name":"Toma","permalink":"anthony-toma","crunchbase_url":"http://www.crunchbase.com/person/anthony-toma","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"One Source Talent","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Nov 19 19:23:16 UTC 2009","updated_at":"Mon Jan 25 23:02:54 UTC 2010","overview":"<p>At the early age of 18 yrs old, Anthony founded and managed a small valet company which upon selling serviced more than six businesses. Shortly after, he ventured into the grocery business and soon became President of K. Toma Enterprises Inc., DBA Wonder Foods. After 12 years of steady growth with K. Toma Enterprises, Anthony sought out the entertainment industry. Within two short years, he rejuvenated downtown Detroit&#8217;s nightlife by opening three successful nightclubs. While his evening businesses prospered, he began seeking alternate ventures in the industry to fill his days. During his plight, Anthony discovered a franchise opportunity that aided aspiring models and actors connect with professionals in the industry. Anthony purchased his first franchise in December of 2000 and soon after purchased an additional 25 franchise markets across the country as well as the rights to develop in Canada.</p>\n\n<p>After three short years with the company, the corporation closed. With the knowledge he attained, Anthony opened his own company called One Source Talent in 2003. Today, One Source Talent has revolutionized the entertainment industry by connecting models and actors with casting directors across the nation. With seven offices across the country and over 30,000 clients, One Source Talent has received national attention from various industry heads and was featured on INC&#8217;s 5,000 list as one of the fastest growing companies in the United States.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"One Source Talent","permalink":"one-source-talent","type_of_entity":"company","image":{"available_sizes":[[[150,57],"assets/images/resized/0006/6863/66863v4-max-150x150.jpg"],[[250,95],"assets/images/resized/0006/6863/66863v4-max-250x250.jpg"],[[396,151],"assets/images/resized/0006/6863/66863v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}