{"first_name":"Anthony","last_name":"Clavien","permalink":"anthony-clavien","crunchbase_url":"http://www.crunchbase.com/person/anthony-clavien","homepage_url":"http://www.anthonyclavien.com","birthplace":"Sweden","twitter_username":"anthonyclavien","blog_url":"http://www.anthonyclavien.org","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 23 19:45:03 UTC 2011","updated_at":"Sun Nov 27 16:32:25 UTC 2011","overview":"<p>More important than the financial contributions Anthony has made is the time he invests in notable charities such as Save The Redwoods League, Westside Food Bank, MADD, the Nature Conservancy, Legal Ace for the Troops and St. Jude Children’s Research Hospital. He has served as General Manager for the Scottsdale League for the Arts, which is responsible for the incredibly popular Scottsdale Culinary Festival. Additionally, Anthony funded and helped to build the charity America’s Mighty Warriors, an organization dedicated to raising money and support for United States troops and their families. </p>\n\n<p>Anthony is a Managing Director for Franklin AAA Holdings, LLC, which holds a portfolio featuring assets in California, Georgia and Texas. He has also cofounded projects such as LegalAce.com, which provides discounted legal services and document preparation. Drawing on his knowledge, education and experience in the finance sector, Anthony cofounded the notably successful incubator company Venture Serve, where he manages all aspects of consulting and strategic planning as the CEO. He also applies these skills in his role as Chief Financial Officer at Veritas, a wholesale/retail company in the marketing and advertising industry. </p>\n\n<p>Other noteworthy projects from Anthony’s career include Nutra Cleanse, Spectrum Sports and Peak Restaurant Group. He is also Managing Director of Mission Consulting, LTD, a London-based firm and, until late 2008, served as President of Mission E-Commerce, a full-service interactive marketing and business solutions company and first-tier, nationally recognized Web development firm. </p>\n\n<p>When Anthony is not dedicating his time to business ventures or his charity contributions, he tries to enjoy his personal interests, which include equestrian, cooking, history, golf, politics, global economics and fine art.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.facebook.com/aclavien","title":"Facebook"}]}