{"first_name":"Antonella","last_name":"Stellacci","permalink":"antonella-stellacci","crunchbase_url":"http://www.crunchbase.com/person/antonella-stellacci","homepage_url":"http://dada-ent.com/about.php","birthplace":"Italy","twitter_username":"_antonella_","blog_url":"http://snowcrashing.com","blog_feed_url":"http://snowcrashing.com/feed","affiliation_name":"Dada Entertainment","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Aug 25 18:50:42 UTC 2008","updated_at":"Mon Jun 08 22:36:13 UTC 2009","overview":"<p>Antonella spent the past 10 years building mobile and digital strategies on behalf of brands and media &amp; entertainment companies in key European and North American markets.</p>\n\n<p>In 2000 at HiuGO, an Italian start-up, she contributed in her product and marketing role to the launch of the first &#8220;twit-like&#8221; community, with SMS-Mobile and Web real-time messaging capabilities. The service was licensed to the then incumbent Italian carrier, Blu. \nIn 2001/2002 always at HiuGO she was pioneering the first mobile marketing campaigns for brands such as Sony Ericsson and Pringles \nIn 2003 at zed- at the time owned by Sonera and Yahoo! (http://yhoo.client.shareholder.com/releasedetail.cfm?ReleaseID=96774)- she was responsible for the first mass-market mobile campaign with 6mln Pringles cans promoting the first &#8220;Txt to win&#8221; giveaway.\nIn 2004 she participated to the launch of the first mobile music subscription, which was promoted with a multi-million mass-market TV&amp;Print campaign.\nWhile at zed, Antonella worked at the launch of the Shazam application in the Italian market.</p>\n\n<p>Since 2005, she&#8217;s been in charge of the marketing and product marketing for the US branch of Dada (Dada USA), which in 2007 formed a JV with Sony Music Entertainment (Dada Entertainmnet, http://www.dada-ent.com).\nSince 2006, when Nielsen Mobile started its quarterly survey of the mobile off-deck market, Dada has always ranked in the top 5.\nIn 2008 Billboard Magazine named Dada one of the top 5 mobile music stories of the year (December issue).</p>\n\n<p>Antonella has an education in classics (philology), loves reading, anything from ancient Greek drama to sci-fi, and can be often spotted on the Acela with her 4 devices (a BlackBerry, laptop, Kindle, iPod Touch), commuting between NewYork and Boston.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"VP, Marketing","firm":{"name":"Dada Entertainment","permalink":"dada-entertainment","type_of_entity":"company","image":{"available_sizes":[[[150,64],"assets/images/resized/0002/4119/24119v2-max-150x150.jpg"],[[250,107],"assets/images/resized/0002/4119/24119v2-max-250x250.jpg"],[[450,192],"assets/images/resized/0002/4119/24119v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}