{"first_name":"Antoine","last_name":"Paquin","permalink":"antoine-paquin","crunchbase_url":"http://www.crunchbase.com/person/antoine-paquin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Rho Canada","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 12 06:58:31 UTC 2008","updated_at":"Fri Nov 14 09:00:39 UTC 2008","overview":"<p>Antoine has 12 years of experience as an entrepreneur in the field of communications systems and semiconductors. He was most recently President and CEO of Axiom Microdevices, a startup, venture-backed company based in Orange County, CA with breakthrough power RF semiconductor technology that was spun-off from the California Institute of Technology (CalTech). Prior to joining Axiom Microdevices, from 2001 to 2002, Antoine was the CEO of BitFlash, a publishing platform vendor for small integrated devices such as cellular phones and PDAs. Among other applications, BitFlash provided the software graphics engine used by Texas Instruments for its OMAP platform. Bitflash&#8217;s assets were acquired by OpenText. Previously, from 1998 to 2000, Antoine was the CEO of Philsar Semiconductor, a wireless IC venture-backed startup that specialized in wireless integrated ICs (synthesizers, transceivers). Antoine was recruited by Philsar&#8217;s venture backers in 1998, after serving on the company&#8217;s board, to turn around the company&#8217;s operations. During his tenure as CEO, he rebuilt the company&#8217;s executive team, refocused the product lines, locked in the first customer design wins and ultimately orchestrated a substantial liquidity event when Philsar was acquired by Conexant Systems in 2000 in a stock deal worth approximately CDN$250mm at signing. From 1996 to 1997, Antoine was the CEO of Skystone Systems, a fiber-optic data transmission IC startup that was co-founded by Antoine and spun-off from Aurigor. During his tenure at Skystone, Antoine led the original venture funding, recruited the management team, and generated key customer wins until the company was acquired by its largest customer, Cisco Systems in 1997 for approximately CDN$120 million in cash and stock. Prior to joining Skystone Systems, from 1993 to 1995, Antoine was the cofounder and CEO of Aurigor Engineering, an engineering consultancy that custom designed entire communications systems and sub-systems (ICs and Software) for fiber optics systems.</p>\n\n<p>Antoine holds a few awards from his entrepreneurial career, including Entrepreneur of the Year (1997) for the Canadian Capital, recipient of the National Research Council&#8217;s Innovator of the Year Award, and recipient of the IWAY awards for exceptional entrepreneurial achievements (Canada&#8217;s Information Highway Initiative). He also serves on the board of GMP Capital, one of Canada&#8217;s most successful investment banks for small- to mid-size equity companies (TSE: GMP) and remains an active angel investor in a number of technology companies. He holds a Computer Systems Engineering degree from Carleton University and a Masters in Project Management from the Universite du Québec.</p>","image":{"available_sizes":[[[150,46],"assets/images/resized/0002/8506/28506v2-max-150x150.jpg"],[[250,77],"assets/images/resized/0002/8506/28506v2-max-250x250.jpg"],[[425,132],"assets/images/resized/0002/8506/28506v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"EIR","firm":{"name":"Rho Canada","permalink":"rho-canada","type_of_entity":"financial_org","image":{"available_sizes":[[[145,58],"assets/images/resized/0002/8349/28349v2-max-150x150.jpg"],[[145,58],"assets/images/resized/0002/8349/28349v2-max-250x250.jpg"],[[145,58],"assets/images/resized/0002/8349/28349v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}