{"first_name":"Antonio Carlos","last_name":"Soares","permalink":"antonio-carlos-soares","crunchbase_url":"http://www.crunchbase.com/person/antonio-carlos-soares","homepage_url":"","birthplace":"São Paulo, Brazil","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Aug 14 20:09:48 UTC 2012","updated_at":"Sat Aug 18 00:59:28 UTC 2012","overview":"<p>Antonio Carlos Soares (AC) is an internet entrepreneur. </p>\n\n<p>He started his career as a business consultant at The Monitor Company, and worked in strategy and corporate finance projects in Brazil and the USA. After that, he acted as a Director and partner at Trip Editora, and co-created the Custom Publishing division, which eventually reached 85% of the company´s revenues and its major source of growth, profits and prestige. He was also responsible for the New Media division, developing projects for internet and mobile.</p>\n\n<p>In 2007, AC joined Aorta Entretenimento as CEO and partner, being responsible for pivoting the company from mobile content to mobile development. Over the next 4 years, the company published 250 Apps for 80 of the most admired Brazilian and Multinational companies (such as AB Inbev, Claro, Bradesco, Petrobras, McDonalds, MTV and Globo), reached 100 employees, was granted with the TelaViva Award (Best Mobile Developer, Best Mobile Marketing Case and Best Music-related Case) and consolidated its leadership in the Brazilian Mobile Application Development market. In January 2012, AC concluded the sale of 100% of Aorta shares to the Brazilian Media Conglomerate Grupo RBS through its .Mobi subsidiary.</p>\n\n<p>AC is an “Endeavor® Entrepreneur” and a mentor to start-up incubator TreeLabs companies. His newest company is Runrun.it, a Team and Project Management Software in the cloud.</p>","image":{"available_sizes":[[[149,150],"assets/images/resized/0020/6685/206685v2-max-150x150.jpg"],[[249,250],"assets/images/resized/0020/6685/206685v2-max-250x250.jpg"],[[449,450],"assets/images/resized/0020/6685/206685v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.endeavor.org.br/empreendedor/antonio-carlos-soares","title":""}],"web_presences":[{"external_url":"http://br.linkedin.com/in/acsoares","title":""}]}