{"first_name":"Anunpas","last_name":"Polnara","permalink":"anunpas-polnara","crunchbase_url":"http://www.crunchbase.com/person/anunpas-polnara","homepage_url":"http://www.weddinginvitationbox.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"invitation-box, wedding-invitations","alias_list":null,"created_at":"Tue Apr 17 00:16:18 UTC 2012","updated_at":"Thu Apr 19 01:54:29 UTC 2012","overview":"<p>WeddingInvitationBox.com represents the very best in unique wedding invitation designs. From the lovingly made, handcrafted silk’s box designs and embellishments, WeddingInvitationBox.com add a touch of high class to your once in a lifetime event. For your wedding, only a unique wedding invitation will do, and when you are looking for the perfect wedding invitation for your special day.</p>\n\n<p>Ordering unique wedding invitations are a way for you to compliment your wedding’s theme, down to the very last detail. More than that custom-made for your wedding invitations can capture your personality, your tastes, and even your hopes, so that you can share them with your closest friends and family on your wedding day. Not only will unique wedding invitations from WeddingInvitationBox.com provide an exact-match for your wedding’s theme, they are wonderful keepsakes for your loved ones for years to come.</p>\n\n<p>Along with our WeddingInvitationBox.com designs, we offer silk folding for invitations, silk pouches, pocket fold and more. WeddingInvitationBox.com helps you meet all of your pre-and-post wedding invitation needs, as well as invitations for other momentous occasions</p>","image":{"available_sizes":[[[75,75],"assets/images/resized/0018/4510/184510v2-max-150x150.jpg"],[[75,75],"assets/images/resized/0018/4510/184510v2-max-250x250.jpg"],[[75,75],"assets/images/resized/0018/4510/184510v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.weddinginvitationbox.com/Wedding-Invitation-Box.html","title":"Wedding Invitation box"}]}