{"first_name":"Anya","last_name":"Cheng","permalink":"anya-cheng","crunchbase_url":"http://www.crunchbase.com/person/anya-cheng","homepage_url":"http://www.linkedin.com/in/anyacheng","birthplace":"Taiwan","twitter_username":"AnyaCheng","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"anya-cheng, marketing, digital, media","alias_list":null,"created_at":"Wed Mar 02 18:21:17 UTC 2011","updated_at":"Mon Mar 07 16:09:09 UTC 2011","overview":"<p>Anya Cheng \nAnya Cheng is a professional in the digital, media and marketing areas. She was the Digital Product and Marketing Manager of Vance Publishing, a B2B media company that is publishing 65+ websites, 7 mobile sites, 100+ eNewsletters and 25+ print publications in Lincolnshire, IL. She holds a Master of Science degree in Integrated Marketing Communications from Northwestern University with both Media Management and Branding concentrations from the Kellogg School of Management and the Medill School of Journalism. As part of her early career, she was an award-nominated reporter of Apple Daily, a brand of Next Media/a leading media company in Asia.</p>\n\n<p>In Vance Publishing, Anya was responsible for managing all aspects of digital advertising and providing metric and insights of Vance’s 100+ eNewsletters. She also involved in digital product management for Vance’s websites, WAP and eNewsletters. She was the head of Vance’s marketing service division Vance Marketing Solutions, where she developed marketing strategies and tactics for clients in the B2B salon, woodworking and agricultural industries. </p>\n\n<p>Prior to joining Vance, Anya spent seven years in brand development, digital marketing and product marketing with Excellence＆Black Lian, an outsoucing partner of Ogilvy &amp; Mather. Her clients included Avon, Nokia, Motorola, EA Games, Pepsi and Taiwan Vice President candidate. Anya has also worked for KFC in creating global marketing plans to increase market share in China. Her expertise is in media management, brand management, international marketing and digital marketing, including search engine marketing, email marketing, social media marketing, event marketing and website development. She has planed/executed 50+ marketing projects for Fortune 500 companies.</p>\n\n<p>Anya Cheng is the founder Northwestern University Alumni Club in Taiwan. Anya has been elected as leadership positions of Medill School Alum Club in Chicago, Taiwanese American Junior Chamber of Commerce in North America and Taiwanese American Junior Chamber of Commerce Chicago. She is a member of Search Engine Marketing Professional Organization and several digital/marketing professional groups. Anya was elected as Taiwan Young Ambassador and represented Taiwan in United Nation’s World Peace Festival in Seoul, Korea. She was also elected as the only World Peace Fellowship candidate to represent Rotary International, Taiwan. She loves helping people, traveling the world, golf, yoga and cooking. You can see more details at http://www.linkedin.com/in/anyacheng </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}