{"first_name":"April","last_name":"Downing","permalink":"april-downing","crunchbase_url":"http://www.crunchbase.com/person/april-downing","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Dachis Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jul 23 14:58:52 UTC 2009","updated_at":"Sat Apr 24 03:17:55 UTC 2010","overview":"<p>April is a seasoned financial and operational executive with over 15 years of experience working with publicly and privately held companies. Consistently recognized as a change agent capable of building focused teams, responding to changes in the market, and creating a foundation for high-growth companies to build upon, April is often sought out for providing consulting and advisory services for companies experiencing high-growth be it organically or through M&amp;A.</p>\n\n<p>Most recently, April has been providing consulting and advisory services to several high-growth Austin Ventures portfolio companies.  Prior to that, she was the Chief Financial Officer for Alterpoint, Inc., a venture-backed network change and configuration management software company, until the successful sale of the company to Versata, Inc., a global IT solutions provider.  Before AlterPoint, April was Chief Accounting Officer and acting CFO of Motive, Inc., a publicly traded provider of broadband management software with over $100 million in revenues. Over her six years at Motive, April served in several key financial roles at the company, including leading Investor Relations through the company’s IPO in 2004 which raised $50 Million. She began her career with Price Waterhouse’s Audit and Business Advisory Services, where she specialized in technology start-ups and early growth companies.</p>\n\n<p>April is an Advisory Board Member for Women’s Sake (an organization focused on Career and Lifestyle Resources for Women) and has been recognized by the Austin Business Journal’s Profiles in Power. She was also nominated for Austin’s 2008 Best CFO Award.</p>\n\n<p>April has a master’s degree in accounting from The University of Texas and is a certified public accountant.</p>\n\n<p>Follow April on Twitter @aprildowning1</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0008/4771/84771v1-max-150x150.jpg"],[[120,150],"assets/images/resized/0008/4771/84771v1-max-250x250.jpg"],[[120,150],"assets/images/resized/0008/4771/84771v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"CFO","firm":{"name":"AlterPoint","permalink":"alterpoint","type_of_entity":"company","image":{"available_sizes":[[[150,31],"assets/images/resized/0005/4010/54010v1-max-150x150.jpg"],[[202,42],"assets/images/resized/0005/4010/54010v1-max-250x250.jpg"],[[202,42],"assets/images/resized/0005/4010/54010v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Chief Financial Officer","firm":{"name":"Dachis Group","permalink":"dachis-group","type_of_entity":"company","image":{"available_sizes":[[[150,39],"assets/images/resized/0006/2108/62108v2-max-150x150.jpg"],[[250,65],"assets/images/resized/0006/2108/62108v2-max-250x250.jpg"],[[309,81],"assets/images/resized/0006/2108/62108v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}