{"first_name":"Archie","last_name":"Pugh-O'Connor","permalink":"archie-pugh-oconnor","crunchbase_url":"http://www.crunchbase.com/person/archie-pugh-oconnor","homepage_url":"http://www.powered.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jul 21 18:15:45 UTC 2010","updated_at":"Tue May 31 05:38:10 UTC 2011","overview":"<p>Online advertising, technology and media innovator. Is currently, Head of Business Development, North America for InMobi. Digital media consultant for several Private Equity groups, VC&#8217;s, Brands, Media Publishers and Start-ups. \nPreviously was Executive Vice President for Corporate and Business Development at Mixercast  where he helped develop a rich-media publishing platform that generated over a Billion monthly engagements. He created Master Service Agreements for top-tier Creative and Digital Agencies including; BBH, DDB, Digitas, Deutsch, DraftFCB and Universal McCann among others.\nHe has partnered with top 100 brands and media companies including; Nike, Puma, McDonalds, Intel, Best Buy, Universal, CBS, and Nokia among others, to innovate their digital strategies and increase their consumer engagement.</p>\n\n<p>He was Co-founder and CEO of Digital Citizen, where he developed the technology and royalty licenses for the first legal, free, on-demand ad-supported digital music service sanctioned by the top four music-label groups and publishers, helping create the structure that is now the industry standard for online ad-supported music services. </p>\n\n<p>He has generated over $150MM in revenue and fund raising for the various companies he has worked with and founded. Has also developed and holds several patents for numerous web-based technologies.</p>\n\n<p>Archie advises on several Boards and is a regular lecturer at universities and industry panels.  He was an A&amp;R Director for PolyGram Music Publishing; a producer of both multi-platinum major-label and independent artists; was a voting member of the National Academy of Recording Arts and Sciences (the Grammy’s). </p>\n\n<p>He is the Publisher of the literary arts journal, Unsaid. </p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0009/9326/99326v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0009/9326/99326v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0009/9326/99326v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}