{"first_name":"Arkady","last_name":"Frekhtman","permalink":"arkady-frekhtman","crunchbase_url":"http://www.crunchbase.com/person/arkady-frekhtman","homepage_url":"http://www.866attylaw.com","birthplace":"","twitter_username":"","blog_url":"http://www.866attylaw.com/blog","blog_feed_url":"http://www.866attylaw.com/blog/feed","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"legal, law, new-york, usa, attorney, lawyer, business","alias_list":null,"created_at":"Mon May 10 11:46:56 UTC 2010","updated_at":"Mon May 10 16:02:30 UTC 2010","overview":"<p>New York Personal Injury Attorney representing victims of personal injury, accident injury and medical malpractice within New York State.</p>\n\n<p>A personal injury is any physical injury that a victim suffers due to the recklessness of any individual or authority. Personal injury laws give compensation to victims of personal injuries and as such, it is tough to get justice and compensation for injuries from negligent individuals or authority. A personal injury lawsuit has to be followed through to get justice and monetary compensation.</p>\n\n<p>There are many accidents that are reported every month from across the US; and, on several occasions, it is seen that the accident resulted from negligence of any individual or authority. Thus, the New York personal injury law covers all major injuries, which includes workers’ compensation, medical malpractice, construction accidents and others.</p>\n\n<p>The NY personal injury law gives compensation and justice for different personal injuries that a victim has suffered. But, to get a personal injury compensation claim you will have to prove that your injuries resulted from negligence of any individual or authority. This could be due to some individual, authority, hospital or even the New York State authorities. The role of the personal injury law is to offer financial compensation.</p>\n\n<p>Thus, if you or your loved ones have suffered serious injuries owing to negligence by any individual or medical authority then you are entitled for compensation.</p>\n\n<p>Contact New York Personal Injury Lawyer at: &lt;strong&gt;The Woolworth Building, 233 Broadway, New York, New York - 10007, Phone : (212) 766-5656&lt;/strong&gt;</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}