{"first_name":"Arkadiusz","last_name":"Hajduk","permalink":"arkadiusz-hajduk","crunchbase_url":"http://www.crunchbase.com/person/arkadiusz-hajduk","homepage_url":"http://aha.jduk.org","birthplace":"Poland","twitter_username":"ahajduk","blog_url":"","blog_feed_url":"","affiliation_name":"Smava Poland","born_year":1977,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Nov 20 12:06:47 UTC 2010","updated_at":"Fri Oct 05 19:19:09 UTC 2012","overview":"<p>Arkadiusz has an extensive experience in concept and product development, project management, human resources management, customer support, business development, operations management and many other aspects of running a business.\nCurrently, Arkadiusz is running Huge Thing – a business acceleration program for high potential teams with global ambitions. Simultaneously, he serves as an investment manager at Speed Up Venture Capital Group where he works with potential investments and portfolio startups.\nArkadiusz is actively involved in a number of entrepreneurial initiatives like Poznan Startup Weekend, Startup Sprint and P-Team.\nPreviously Arkadiusz spent few years in a number of web startups, including one of the leading European social lending platforms smava, where he was serving a number of different roles, also co-founder.\nArkadiusz was blessed with opportunity to work within multinational teams of great people, while living in Denmark, Hungary, Sweden, Canada and Poland. Arkadiusz earned his M.Sc. degree at Technical University of Denmark (DTU).</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0021/2618/212618v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0021/2618/212618v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0021/2618/212618v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"M.Sc.","subject":"","institution":"Technical University of Denmark","graduated_year":2005,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}