{"first_name":"Armen","last_name":"Markarian","permalink":"armen-markarian","crunchbase_url":"http://www.crunchbase.com/person/armen-markarian","homepage_url":"http://www.bosley.com/about_bosley/leadership_team.php#LT_2","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Sep 27 13:51:05 UTC 2012","updated_at":"Fri Oct 26 05:01:05 UTC 2012","overview":"<p>Armen Markarian serves as the President and Chief Executive Officer at Bosley Medical. His association with Bosley began in 1991, when he joined as the Vice President of Operations. He was later promoted to the position of Chief Operating Officer, in 2001, and further moved on to become President and CEO, in December 2010. \nHis 15 years of hands-on experience,  with a number of leading health care centers, in operations, marketing, administrative management, and finance, has enabled him to spearhead the company‘s activities, with competence. Armen has been the brain behind the company’s expansion into Mexico City and Shanghai. He believes that high quality patient-care must be at the heart of Bosley‘s activities, and considers marketing strategies, operational expertise, and prudent financial management services, as a means to achieve this end. He deems his team - physicians, clinical staff, counselors, and administrative support, as Bosley’s most critical asset. \nArmen Markarian’s tenure at the top through the last 2 years have been the most successful &amp; profitable terms for Bosley’s business.</p>","image":{"available_sizes":[[[106,150],"assets/images/resized/0021/6831/216831v2-max-150x150.jpg"],[[177,250],"assets/images/resized/0021/6831/216831v2-max-250x250.jpg"],[[320,450],"assets/images/resized/0021/6831/216831v2-max-450x450.jpg"]],"attribution":"<p>Bosley Medical</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}