{"first_name":"Arnd","last_name":"Herrmann","permalink":"arnd-herrmann","crunchbase_url":"http://www.crunchbase.com/person/arnd-herrmann","homepage_url":"http://www.deals4you.co.za","birthplace":"Cologne (Germany)","twitter_username":"ArndH","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1963,"born_month":4,"born_day":11,"tag_list":"","alias_list":null,"created_at":"Sat Jun 05 18:56:05 UTC 2010","updated_at":"Wed Dec 29 15:41:00 UTC 2010","overview":"<p>Arnd Herrmann is the founder of brands4you Pty Ltd, trading as &#8216;deals4you&#8217;, a specialised sourcing service for online communities like Incentive Houses, Loyalty Service Providers and other specialised Online Communities. Through his previous experience in the merchandise- and travel industry, Arnd was able to build a comprehensive supplier network for premium-brand products and -services and is offering those catalogues and campaigns to companies wanting to offer their respective members, clients,staff or other target groups exciting options and alternatives as part of their service offerings.</p>\n\n<p>Before starting off with this venture, Arnd was the Managing Director and Co-founder of more4bucks Pty Ltd, the company having started South Africa&#8217;s first Private Shopping Club &#8216;Luxury4Less&#8217;. From its launch in May 2009 until its closing in July 2010, Luxury4Less grew its database from 0 to over 130,000 members , had run over 300 campaigns with more than 150 different suppliers, was ranked as one of the Top 1000 websites in South Africa, and had been featured all over the local press from radio and TV like CNBC Africa, Highveld Stereo, SAFM, Classic FM, over magazines like FHM, GQ, Garden &amp; Home, to newspapers like Sunday Times and Business Report.</p>\n\n<p>Before Arnd started more4bucks, he was Managing Director of Uwin Iwin Incentives, leading this organisation in his four years of tenure to be elected as one of the Top 300 performing companies in South Africa.</p>\n\n<p>During his career within the Blue Chip Corporate World, Arnd worked for Siemens Telecom in Germany and South Africa, for General Electrics and Commerce One in Switzerland, as well as for SAP Southern Africa, predominantly in roles involving Business Development, Programme Management and Customer Service.</p>\n\n<p>Arnd is happily married with his wife Petra, is proud father of two children and an active deacon of his Christian community north of Fourways, Johannesburg</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.deals4you.co.za","title":"SA's specialised sourcing service"}]}