{"first_name":"Aron","last_name":"Placencia","permalink":"aron-placencia","crunchbase_url":"http://www.crunchbase.com/person/aron-placencia","homepage_url":"http://shoopzy.com","birthplace":"","twitter_username":"Aronado","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"startups, vc, social-business, sem, business-development, facebook-marketing, facebook-advertising","alias_list":null,"created_at":"Sun Apr 29 18:48:52 UTC 2012","updated_at":"Sat Jul 21 09:58:14 UTC 2012","overview":"<p>Aron is the Co-founder and CEO of Shoopzy.com, a breakthrough SaaS application engineered and proven to increase ecommerce conversions and decrease shopping cart abandonment rates. </p>\n\n<p>Aron has had the wonderful opportunity as a digital and social media strategist to work with some of the most amazing and dynamic brands / companies in our space such as: Microsoft, Zappos.com, Rackspace, Entrepreneur Magazine, Tungle, Ustream and many more. His professional career was launched at JP Morgan where he quickly became one of the highest producing salespeople in southern California. Aron has worked as a consultant for dozens of startups helping them refine (and in many cases create) their business model, raise capital, craft and execute digital marketing / social media campaigns and business development. Also, he&#8217;s created and managed Daddio&#8217;s Superior Bar &amp; Grill and Xponential Exclusive Properties (as a co-founder)  </p>\n\n<p>Aron is extremely active within the social media space as a startup advocate and host.  He&#8217;s interviewed over (400) startup CEO&#8217;s, best selling book authors, VC&#8217;s and industry leaders such as: Guy Kawasaki, Tony Hsieh, Alex Bogusky, Chris Brogan, Amy Cosper, and Brad Feld. *See more over at startupLUCKY (dot) com.</p>","image":{"available_sizes":[[[128,150],"assets/images/resized/0018/7058/187058v2-max-150x150.jpg"],[[213,250],"assets/images/resized/0018/7058/187058v2-max-250x250.jpg"],[[384,450],"assets/images/resized/0018/7058/187058v2-max-450x450.jpg"]],"attribution":"<p>Daniel Placencia</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}