{"first_name":"Art","last_name":"Hennessey","permalink":"art-hennessey","crunchbase_url":"http://www.crunchbase.com/person/art-hennessey","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Apr 25 13:55:05 UTC 2011","updated_at":"Mon Apr 25 14:02:42 UTC 2011","overview":"<p>In September of 2004 Art Hennessey, along with Tom Hunton, started American Capital Energy with the vision of becoming one of America’s leading solar integration companies. Over the past six years ACE has grown from a small start-up firm with an idea, into one of the largest commercial integrators in the United States. Art has extensive experience in top financial positions at leading high-tech, high growth companies such as Computer Vision and Data General. Prior to starting American Capital Energy, Art served as the controller for Schott Solar in Billerica, MA, U.S.A. where his strategic financial advice and decisions helped grow the company to be one of the top five PV module manufacturers when he left. Prior to that, he was controller for Anheuser Busch’s Northeast Region. Earlier, as CFO for George W. Moore, Inc., he and a small team turned the company around and re-sold it. Art had his start in finance at Coopers &amp; Lybrand (now Price Waterhouse Coopers). Art is a graduate of Boston College. Art is a decorated Viet Nam War Veteran. He has four children and currently lives in Massachusetts.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Financial Officer","firm":{"name":"American Capital Energy","permalink":"american-capital-energy","type_of_entity":"company","image":{"available_sizes":[[[150,37],"assets/images/resized/0013/1905/131905v1-max-150x150.jpg"],[[228,57],"assets/images/resized/0013/1905/131905v1-max-250x250.jpg"],[[228,57],"assets/images/resized/0013/1905/131905v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}