{"first_name":"Art","last_name":"Pappas","permalink":"art-pappas","crunchbase_url":"http://www.crunchbase.com/person/art-pappas","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jun 17 22:37:13 UTC 2009","updated_at":"Wed Jun 17 22:38:07 UTC 2009","overview":"<p>Art has over 30 years of operating experience as a pharmaceutical and biotechnology industry executive and venture capital investor in life science companies. He has assembled a team of investment, biotechnology and medical experts who manage over $350 million and oversee investments in more than 40 portfolio companies. Prior to founding Pappas Ventures in 1994, Art held senior level leadership positions at several multinational pharmaceutical companies. He was an executive member of the board of directors of Glaxo Holdings plc, for which he was the chief executive responsible for international operations including research, development and manufacturing. Art previously was Vice President of Commercial Operations for Abbott International Ltd., and he held various executive and general management positions with Merrell Dow Pharmaceuticals and the Dow Chemical Company, in the United States and internationally. Among the companies for which he currently serves as a director are: CeNeRx BioPharma, Genstruct, LEAD Therapeutics and TyRx Pharma. He was the founding CEO and is currently the chairman of CoLucid Pharmaceuticals.</p>\n\n<p>Some of the firm&#8217;s representative investments include Cerexa Pharmaceuticals (acquired by Forest Laboratories); Syntonix Pharmaceuticals (acquired by Biogen Idec); Peninsula Pharmaceuticals (acquired by Johnson &amp; Johnson); Panacos Pharmaceuticals (Nasdaq: PANC); NuVasive (Nasdaq: NUVA); Gene Logic (Nasdaq: GLGC); Nuvelo (Nasdaq: NUVO; previously Variagenics); and Arena Pharmaceuticals (Nasdaq: ARNA).</p>\n\n<p>Art is chairman of the North Carolina Biotechnology Center&#8217;s Board of Directors and is a member of the National Venture Capital Association (NVCA) Medical Industry Group Advisory Board. He previously served on the boards of AtheroGenics (Nasdaq: AGIX), Embrex (Nasdaq: EMBX), Quintiles Transnational (Nasdaq: QTRN) and Valentis (Nasdaq: VLTS). Art is a decorated Vietnam veteran, having served as an officer in the US Army 101st Airborne Division and the Special Forces.</p>","image":{"available_sizes":[[[132,132],"assets/images/resized/0004/9247/49247v1-max-150x150.jpg"],[[132,132],"assets/images/resized/0004/9247/49247v1-max-250x250.jpg"],[[132,132],"assets/images/resized/0004/9247/49247v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Partner","firm":{"name":"Pappas Ventures","permalink":"pappas-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,131],"assets/images/resized/0004/9245/49245v1-max-150x150.png"],[[164,144],"assets/images/resized/0004/9245/49245v1-max-250x250.png"],[[164,144],"assets/images/resized/0004/9245/49245v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}