{"first_name":"Arthur","last_name":"J Lowery","permalink":"arthur-j-lowery","crunchbase_url":"http://www.crunchbase.com/person/arthur-j-lowery","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jul 18 20:39:53 UTC 2009","updated_at":"Sat Jul 18 20:41:31 UTC 2009","overview":"<p>Professor Arthur J Lowery, PhD, FIEEE, FIET\nFounder and Chief Technology Officer\nArthur Lowery is an engineer, innovator and educator with a proven success record transforming ground breaking technical innovations into successful international businesses. Arthur built the global Photonic Design Automation (PDA) industry from his fundamental research in semiconductor laser modeling and today is also internationally recognized as a pioneer of optical OFDM and its applications for telecommunications. In 1996 Arthur founded Virtual Photonics (now VPI Virtual Photonics Inc), developing a world-leading software tool for designing optical communications devices and circuits. VPI has grown to be the leading supplier of design tools for optical communication components, systems and networks. Arthur was appointed Chair of Electrical and Computer Systems Engineering at Monash University in September 2004. Arthur’s research at Monash has focused on the application of orthogonal frequency-division multiplexing (OFDM) to optical fiber transmission. Arthur and his Monash colleagues invented optical OFDM, and their work has been so widely recognized that the most recent international optical communications conference included two complete sessions on optical OFDM. The work of Arthur and his colleagues at Monash represents the technology foundation of Ofidium.</p>","image":{"available_sizes":[[[113,150],"assets/images/resized/0005/3413/53413v1-max-150x150.jpg"],[[118,156],"assets/images/resized/0005/3413/53413v1-max-250x250.jpg"],[[118,156],"assets/images/resized/0005/3413/53413v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder and CTO","firm":{"name":"Ofidium","permalink":"ofidium","type_of_entity":"company","image":{"available_sizes":[[[150,31],"assets/images/resized/0005/3411/53411v1-max-150x150.png"],[[250,53],"assets/images/resized/0005/3411/53411v1-max-250x250.png"],[[381,81],"assets/images/resized/0005/3411/53411v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}