{"first_name":"Artie","last_name":"Buerk","permalink":"artie-buerk","crunchbase_url":"http://www.crunchbase.com/person/artie-buerk","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Buerk Dale Victor","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 19 15:41:26 UTC 2008","updated_at":"Mon Feb 02 22:46:45 UTC 2009","overview":"<p>Artie is a founding partner of Buerk Dale Victor, and has served as General Partner since 1999.  He has provided strategic advice and capital to growth companies for over thirty years.  Artie currently serves on the board of Davidson Trust Company.   </p>\n\n<p>Prior to BDV, Artie served as President of Northwestern Trust from 1993-1995 and co-chairman from 1995-2001.  Northwestern Trust was then sold to the Bank of Montreal in 2002.  Artie was President and board member for Shurgard Storage Centers from 1977-1992.  Under his direction, Shurgard grew from a small regional mini-storage developer to a national player in the industry.  During his tenure at Shurgard, Artie managed $100 million in institutional commitments and assisted in taking the company public in 1994.  Prior to its 2006 sale to Public Storage, Shurgard owned and managed more than 500 storage operations worldwide.  Artie was also founder and director of Intermation, a records storage management service that was sold to Iron Mountain in 1998.  From 1968 to 1977, he served as Director of Development at the University of Washington.</p>\n\n<p>Artie’s current civic involvement includes serving as Chairman of the University of Washington Foster School of Business advisory board and as an advisory board member for the UW School of Information Science.  He also serves as the Harvard Business School’s lifetime class secretary for his graduating class.  Artie is currently a member of the Downtown Seattle Rotary Club and is a past trustee of the Greater Seattle Chamber of Commerce and past president of the Seattle Public School Foundation Fund for Excellence.  Artie is also a past board chair and president of the UW Alumni Association, past chair of the UW Development Fund, and past president of the Harvard Business School Club of Puget Sound.</p>\n\n<p>Artie has a B.A. in finance and banking from the University of Washington and an MBA from Harvard Business School. He is an avid traveler and has visited nearly 130 countries around the world. </p>","image":{"available_sizes":[[[115,150],"assets/images/resized/0003/5250/35250v2-max-150x150.jpg"],[[154,200],"assets/images/resized/0003/5250/35250v2-max-250x250.jpg"],[[154,200],"assets/images/resized/0003/5250/35250v2-max-450x450.jpg"]],"attribution":"<p>http://www.bdvllc.com/BDV/teambios.php?TID=2&amp;PoID=1</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"General Partners","firm":{"name":"Montlake Capital ","permalink":"buerk-dale-victor","type_of_entity":"financial_org","image":{"available_sizes":[[[150,27],"assets/images/resized/0002/8952/28952v3-max-150x150.jpg"],[[250,45],"assets/images/resized/0002/8952/28952v3-max-250x250.jpg"],[[450,81],"assets/images/resized/0002/8952/28952v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}