{"first_name":"Artria","last_name":"ArtriaGlobal","permalink":"artria-artriaglobal","crunchbase_url":"http://www.crunchbase.com/person/artria-artriaglobal","homepage_url":"","birthplace":"us","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Oct 01 09:54:40 UTC 2010","updated_at":"Sat Mar 03 20:45:20 UTC 2012","overview":"<p>Our integrated services and solutions are meant to empower your business and the management to focus on business growth, productive activites and improvement in an integrated enterprise resource planning system and reliable support to manage your business processes at all phases. Our clients lists includes small businesses, start-ups, medium and large sized companies from diverse industries such as:</p>\n\n<p>Energy<br/>\nEducation\nMarketing<br/>\nFinancial Sectors (i.e. Banks)\nConstruction<br/>\nInsurance\nSecurity<br/>\nTravel Agency and Aviation\nEntertainment<br/>\nHotels and Resorts\nLogistic<br/>\nTelecommunication, Engineering &amp; Information Technology</p>\n\n<p>ArtriaGlobal provides IT consultancy and development to render SHaaS solution needed by clients to innovate solutions to upgrade our client&#8217;s operation efficiency by using state-of-the-art information technology tools for information design and processing which is our core activity that we render to clients across the globe.</p>\n\n<p>ArtriaGlobal has been proven to be a backup system and serve as a back bone to our clients in enhancing and upgrading, increasing client&#8217;s retention, building strong relationships and encouraging customization. we continue to strive in delivering many kinds of customized solutions and requirements with the solution our clients needs to be succesful with.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.artriaglobal.net","title":"Artria"}]}