{"first_name":"Arun","last_name":"Verma","permalink":"arun-verma","crunchbase_url":"http://www.crunchbase.com/person/arun-verma","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"DATA Incorporated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jun 08 15:12:54 UTC 2012","updated_at":"Mon Jul 02 22:13:17 UTC 2012","overview":"<p>Mr. Arun Verma currently serves as the President, Founder and CEO of DATA Inc., a privately owned organization headquartered in the United States, with offices and presences globally.  </p>\n\n<p>Mr. Verma was educated at Mayo College, Ajmer (www.mayocollege.com). He received his School Certificate award from the University of Cambridge (UK).</p>\n\n<p>Upon graduation, Mr. Verma was selected to join the prestigious National Defense Academy (www.nda.nic.in), where he was enrolled in a 3 year study in academics and military training,. Per curriculum, he received another year of training at the renowned Indian Military Academy, and thereafter was commissioned into the Indian Army in 1965 (indianarmy.nic.in). This qualified him for a Bachelor&#8217;s of Science Degree. Later, he obtained a Bachelor&#8217;s degree in Mechanical Engineering.</p>\n\n<p>During his 12 years as a commissioned officer in the Indian Army, Mr. Verma commanded units in active formations on the borders in Nagaland, Assam and Kashmir. In 1971, his unit was engaged in active battle as part of the Strike Corps&#8217; successful assault into West Pakistan.</p>\n\n<p>In 1977, Mr. Verma, having already attained the rank of Major, elected to retire prematurely from the Indian Army so that he could emigrate to the United States and apply the lessons he learned in the military (including during battle) to the growing computer technology industry.</p>\n\n<p>Upon arriving in the U.S., Mr. Verma enrolled at New York University, where he acquired more knowledge in higher technology. Thereafter, for many years, he was responsible for analyzing, designing and implementing several mainframe applications in consulting assignments at a number of Fortune 500 companies.</p>\n\n<p>In 1983, Mr. Verma founded DATA Inc., where he has served as its President, and has been devoted to its growth, ever since.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President and CEO","firm":{"name":"DATA Incorporated","permalink":"data-incorporated","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.datainc.biz/our-team.asp","title":"DATA Inc. Our Team"}]}