{"first_name":"Ash","last_name":"Ashutosh","permalink":"ash-ashutosh","crunchbase_url":"http://www.crunchbase.com/person/ash-ashutosh","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue May 19 06:12:42 UTC 2009","updated_at":"Tue May 26 09:02:16 UTC 2009","overview":"<p>Ash joined Greylock in 2008. While being a recognized leader in the storage industry, Ash’s areas of interests include semiconductors, systems, storage, software and utility and cloud computing.</p>\n\n<p>As a serial entrepreneur, Ash has over two decades of operational and strategy experience in founding, building and advising companies. Ash was the founder of three companies in technologies ranging from semiconductors, systems and enterprise software, each of which led their respective markets and had successful exits. He also worked for and has been a member of the board or the advisory board of several large and small technology companies.</p>\n\n<p>Prior to joining Greylock, Ash was Vice President and the Chief Technologist at the storage business unit at HP, responsible for strategy and development of next-generation data center technologies. He joined HP as a result of the acquisition of AppIQ, a company he founded in 2001 that became a leader in standards-built Storage Resource Management (SRM) software.</p>\n\n<p>Ash currently serves on the board of Delphix, a company developing radically innovative database management solutions. He is also a charter member of TiE Boston.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0004/5478/45478v1-max-150x150.jpg"],[[148,207],"assets/images/resized/0004/5478/45478v1-max-250x250.jpg"],[[148,207],"assets/images/resized/0004/5478/45478v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}