{"first_name":"Ashish","last_name":"Kachru, MBA","permalink":"ashish-kachru-mba","crunchbase_url":"http://www.crunchbase.com/person/ashish-kachru-mba","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Altruista Health","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue May 04 15:27:28 UTC 2010","updated_at":"Tue May 04 23:49:27 UTC 2010","overview":"<p>Ashish Kachru is the President and co-founder of Altruista Health, a health services and technology company. In his current role, Ashish focuses on innovating and implementing sustainable disease prevention programs and technologies that can effectively addresses many of the challenges presented by rapidly escalating costs associated with healthcare.</p>\n\n<p>Prior to co-founding Altruista Health, Ashish served as the National Director for United Health Group’s Business Risk Management (BRM) unit for its AmeriChoice division – dedicated to the management of 1.3 million Medicaid members in 12 states across the United States. In this capacity, Ashish assembled the BRM team at Americhoice which was charged with identifying and managing risk exposure for key business initiatives that could significantly impact the overall profitability of United Health Group.</p>\n\n<p>Ashish’s management and process improvement expertise is drawn from a wide range of industries including manufacturing, consumer product goods and venture capital allowing him to bring best practice from each to improving the delivery of healthcare. As a Six Sigma Subject Matter Expert and Quality leader at Cummins – the leading diesel engine manufacturer, Ashish has been recognized with two Chairman’s Awards for engineering application of cutting edge nanotechnology solutions to enhance product performance standards. His work in the area of application of nanotechnology to process improvement has been published widely in leading national journals.</p>\n\n<p>In addition, at Proctor and Gamble Ashish conceptualized and implemented automated models that analyze the impact of advertizing programs on consumers’ behavior including the advertizing programs for its healthcare division. Furthermore, his experience at Dunrath Capital in developing financial viability models for start-up companies allows him to critically evaluate the market feasibility of new solutions/programs for the healthcare space.</p>\n\n<p>Ashish earned his Masters of Business Administration from The University of Chicago, Graduate School of Business and completed his Masters in Engineering with a focus on Nanotechnology from The University of North Carolina at Charlotte. In addition, Ashish completed his Bachelor in Mechanical engineering degree from NIIT in India.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Executive Officer and Co-Founder","firm":{"name":"Altruista Health","permalink":"altruista-health","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0008/5914/85914v2-max-150x150.png"],[[237,55],"assets/images/resized/0008/5914/85914v2-max-250x250.png"],[[237,55],"assets/images/resized/0008/5914/85914v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/ashish-kachru/1/6b8/913","title":"LinkedIn"},{"external_url":"http://www.altruistahealth.com/ashish-kachru.aspx","title":"AltruistaHealth.com"}]}