{"first_name":"Ashish","last_name":"Abraham, MD, MBA","permalink":"ashish-abraham-md-mba","crunchbase_url":"http://www.crunchbase.com/person/ashish-abraham-md-mba","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Altruista Health","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue May 04 15:27:28 UTC 2010","updated_at":"Tue May 04 23:49:12 UTC 2010","overview":"<p>Dr. Ashish Abraham is a primary care physician and healthcare management executive with more than 12 years of diversified experience in direct clinical care, health management operations and strategic consulting for government and commercial clients. His experience and expertise extends across a wide range of areas including, disease management, health program/benefits design, health service rate development and performance measurement and improvement.</p>\n\n<p>At present, Dr. Ashish Abraham is the Chief Executive Officer of Altruista Health, a health and wellness services and technology company that he helped cofound in June 2007. Besides providing strategic leadership to a team of clinical and technology staff across two continents, Dr Abraham is also a consultant to State governments and other organizations in the area of health reform and quality improvement initiatives.</p>\n\n<p>Before cofounding Altruista Health, Dr. Abraham served as the Chief Medical Officer and then as the Senior Vice President of AmeriChoice-United Health’s Medicaid Management Services Organization (MSO). As the leader of this division, he successfully implemented new contracts for care management services in four states, including the hiring of 175 new staff, increasing annual revenues for his division by 200% in a 3-year period. He was also instrumental in obtaining CMS PRO-Like Entity Certification and NCQA accreditation in disease management for the MSO division within United.</p>\n\n<p>Prior to his work at United Health Group, Dr. Abraham was a Principal and Physician-Leader at Mercer Consulting where he led consulting projects for commercial clients and for 15 state and county governments, and was nationally recognized for his work in developing innovative care management solutions for aged, disabled, HIV/AIDS clients and other vulnerable populations with long-term care needs.</p>\n\n<p>Dr. Abraham completed his medical training from Christian Medical College in India and also earned dual degrees in business administration and health administration from Arizona State University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President and Co-Founder","firm":{"name":"Altruista Health","permalink":"altruista-health","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0008/5914/85914v2-max-150x150.png"],[[237,55],"assets/images/resized/0008/5914/85914v2-max-250x250.png"],[[237,55],"assets/images/resized/0008/5914/85914v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.altruistahealth.com/ashish-abraham.aspx","title":"Chief Executive Officer and Co-Founder"},{"external_url":"http://www.linkedin.com/pub/ashish-abraham/3/444/289","title":"Linkedin"}]}