{"first_name":"Ashraf","last_name":"Lotfi, Ph.D.","permalink":"ashraf-lotfi-ph-d","crunchbase_url":"http://www.crunchbase.com/person/ashraf-lotfi-ph-d","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jun 24 16:29:58 UTC 2009","updated_at":"Wed Jun 24 16:31:14 UTC 2009","overview":"<p>Ashraf is a world renowned leader and expert in power electronics, power management and power technologies. Having been continuously involved in research, design and commercial development in the power field for over 20 years, he brings many technical, managerial and leadership qualities to his role.</p>\n\n<p>Prior to founding Enpirion, he led the power management R&amp;D effort at Bell Laboratories as Director of Power Management Research (Lucent/Agere). During this period he laid the vision for a research effort with the ambitious goal of creating the technology pieces needed to create, for the first time, true power management on a single chip. These efforts combined multiple disciplines from power semiconductors, RF circuits, high-speed power topologies, magnetic design to package technology in a highly coordinated development to achieve a commercially viable yet breakthrough technology enabling high performance in a single chip in an economical manner. Prior to that as Department Head, Power Systems Research, his development efforts in power systems applications ranged from high-density dc/dc power modules to planar high density magnetics to custom dc/dc converters to high power rectifiers and battery plants for telecommunications energy supplies. These technologies and others formed the cornerstone for many product lines delivered by Lucent&#8217;s (previously AT&amp;T&#8217;s) Power Systems Division driving highly differentiated products in the market place commanding leadership market share and revenues. He also held various engineering and instructor positions at Virginia Tech and Cairo University.</p>\n\n<p>Dr. Lotfi has authored a very large number of publications in the field of power in leading journals and specialized meetings and is inventor on 39 U.S. patents with 25 pending directly related to power technologies and products. He received the BS degree with honors from Cairo Univ. in 1984, the PhD degree from Virginia Tech in 1993 and an executive MBA from Northeastern Univ. in 2001.</p>","image":{"available_sizes":[[[105,150],"assets/images/resized/0005/0546/50546v1-max-150x150.jpg"],[[140,200],"assets/images/resized/0005/0546/50546v1-max-250x250.jpg"],[[140,200],"assets/images/resized/0005/0546/50546v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President CTO and Founder","firm":{"name":"Enpirion","permalink":"enpirion","type_of_entity":"company","image":{"available_sizes":[[[127,63],"assets/images/resized/0005/0544/50544v1-max-150x150.png"],[[127,63],"assets/images/resized/0005/0544/50544v1-max-250x250.png"],[[127,63],"assets/images/resized/0005/0544/50544v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}