{"first_name":"Ashraf","last_name":"Sheikh","permalink":"ashraf-sheikh","crunchbase_url":"http://www.crunchbase.com/person/ashraf-sheikh","homepage_url":"http://www.ashrafsheikh.com","birthplace":"India","twitter_username":"ashrafonline","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1976,"born_month":2,"born_day":5,"tag_list":"","alias_list":null,"created_at":"Mon Feb 21 18:12:00 UTC 2011","updated_at":"Tue Feb 22 03:16:02 UTC 2011","overview":"<p>Ashraf started his career at 20 in the year 1997 as the co-founder of an technology Startup company called Brightel technologies in India with customers such as Bennett, Coleman &amp; Co and TATA</p>\n\n<p>At 24 after completing his MBA in Marketing, he went on to work for a Silicon Valley funded company with customers such as Philips, Cadbury, Ingersoll Rand, Hutchison etc</p>\n\n<p>His work Includes (but not limited to) establishing a Joint venture between a large Saudi conglomerate and US based NASDAQ listed Multinational Supply chain management company, Investment Feasibility for the Government, Strategic Consulting assigments for project value exceeding $1million.</p>\n\n<p>Ashraf is currently based in the UAE and works for a leading Regional Telecom company. </p>\n\n<p>He Holds a Bachelors degree in Science and Master in Business Administration. His Hobbies include technology, reading and Listening to Ted style talks. </p>\n\n<p>SpecialtiesOver the past 10 years, Ashraf has gained considerable experience and insights in specialist areas of Regional Strategic Sales and Marketing, Regional Channel Management strategies, Business Development, Franchise Development and Consulting.\nemail: ashrafonline@gmail.com</p>","image":null,"degrees":[{"degree_type":"MBA","subject":"Marketing","institution":"University of Mumbai","graduated_year":2000,"graduated_month":null,"graduated_day":null},{"degree_type":"Bachelors of Science","subject":"","institution":"St. Xavier's College Mumbai","graduated_year":1997,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}