{"first_name":"Ashwani","last_name":"K. Dhar","permalink":"ashwani-k-dhar","crunchbase_url":"http://www.crunchbase.com/person/ashwani-k-dhar","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon May 18 12:31:33 UTC 2009","updated_at":"Mon May 18 12:34:53 UTC 2009","overview":"<p>Ashwani Dhar is a Managing Partner at Venio Capital Partners with complete deal management responsibilities from sourcing through due diligence to capital placement and finally actively managing investments. Currently, he is a board member on three portfolio companies; Bigfoot Networks, Robot Genius, &amp; Perception Software. Ashwani has particular expertise in financial services, enterprise software and entertainment specifically gaming.</p>\n\n<p>As a founding member of Venio, Ashwani has been analyzing and investing in early stage companies for several years and has developed and refined Venio’s business model to fully take advantage of the market opportunity between Angel and VC investing. ‘Filling the Gap’ in early stage investments has been a particular interest area for Ashwani especially with regard to the growing focus on ‘bootstrapped venture capital’.</p>\n\n<p>Ashwani also brings significant sales, marketing, and business development experience and has been responsible for revenue generation, market positioning and the ultimate business success for companies like Iconixx, Agea and Trilogy. Specifically, at Trilogy, Ashwani played several leadership roles in launching and building the financial services business unit that grew to over $50m in three years.</p>\n\n<p>Ashwani also founded and managed DC International, an international consulting company that focused on the emerging markets of Latin America emphasizing the strategic management of information technology for clients like BankBoston, Andersen Consulting and YPF. Ashwani began his career in strategic consulting for Healthcare clients with APM and delivering high value technology solutions with Andersen Consulting (now Accenture).</p>","image":null,"degrees":[{"degree_type":"Graduated","subject":"Management & Technology","institution":"University of Pennsylvania","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Partner","firm":{"name":"Venio Capital Partners","permalink":"venio-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,65],"assets/images/resized/0004/4414/44414v1-max-150x150.png"],[[196,85],"assets/images/resized/0004/4414/44414v1-max-250x250.png"],[[196,85],"assets/images/resized/0004/4414/44414v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}