{"first_name":"Assen","last_name":"Vassilev","permalink":"assen-vassilev","crunchbase_url":"http://www.crunchbase.com/person/assen-vassilev","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Everbread","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Mar 23 18:21:33 UTC 2010","updated_at":"Wed Dec 22 18:03:16 UTC 2010","overview":"<p>Assen Vassilev is VP Strategy and Business Development and co-founder of EVERBREAD. Assen has over five years of experience in the travel industry as a founder and CEO of an online travel portal and a travel technology company. He started his career at Monitor Group, where he worked on strategy, marketing, and SG&amp;A optimization projects for a number of clients, including a Fortune 15 company in the energy industry, a large mining client in South Africa, and a telecom conglomerate in Russia. In addition to business consulting, Assen has been involved in teaching economic policy at Sofia University as part of the Economic and Business Administration Department (the program is affiliated with the Microeconomics of Competitiveness Network headed by Prof. Michael Porter at the Institute of Strategy and Competitiveness, Harvard Business School). Assen has also engaged in government consulting, including travel policy consulting for the European Commission. \nAssen holds a BA in Economics from Harvard College, and is taking a break from the JD/MBA program at Harvard Law School and Harvard Business School in order to help develop Everbread. </p>","image":null,"degrees":[{"degree_type":"BA","subject":"Economics","institution":"Harvard College","graduated_year":2000,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President and Co-Founder","firm":{"name":"Everbread","permalink":"everbread","type_of_entity":"company","image":{"available_sizes":[[[150,27],"assets/images/resized/0008/1425/81425v6-max-150x150.png"],[[213,39],"assets/images/resized/0008/1425/81425v6-max-250x250.png"],[[213,39],"assets/images/resized/0008/1425/81425v6-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}