{"first_name":"Atakan","last_name":"Cetinsoy","permalink":"atakan-cetinsoy","crunchbase_url":"http://www.crunchbase.com/person/atakan-cetinsoy","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"MyStrands","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jun 17 08:18:53 UTC 2007","updated_at":"Mon Jul 14 23:47:34 UTC 2008","overview":"<p>Recently Atakan served 5 years with Apple Computer where he led the first fully personalized application of music recommendations on the iTunes Music Store serving millions of users in 21 countries. MBA from The University of Georgia.</p>\n\n<p>Atakan has more than 10 years of customer and product marketing experience with some of the most admired global brands in the computer hardware and software, Internet/e-Commerce and transportation industries.</p>\n\n<p>Most recently Atakan served 5 years with Apple Computer, where he led the effort to model customer value as driven by the adoption of digital media services offered through the market leading iTunes Music Store platform covering both desktop and mobile use cases. His ability to recognize emerging consumer trends in this fast growing segment of the media market led to the first fully personalized application of music recommendations on the iTunes platform serving millions of users in 21 countries. Prior to iTunes Music Store, Atakan spent 3 years developing the global enterprise marketing infrastructure and processes for Apple&#8217;s US$1 billion plus online direct sales channel.</p>\n\n<p>Before joining Apple in 2001, Atakan was part of Yahoo&#8217;s loyalty marketing team crafting online methods to increase user retention while leveraging key marketing partnerships with consumer brands to bring more value to the 6 million plus member base.</p>\n\n<p>Atakan also has tenure with FedEx during which he managed the company&#8217;s award winning online near real time package tracking services and oversaw the effort to launch vertical applications in the same category. As part of FedEx Corporate Marketing team his work fueled the repositioning of the marketing strategies for the hotly contested multi-modal, dual carrier shipping segment.</p>\n\n<p>Atakan holds a B.S. degree in Electrical and Electronics Engineering from Bogazici University in Istanbul and an M.B.A. from The University of Georgia as a fully sponsored International Student scholar of the Terry College of Business.</p>","image":{"available_sizes":[[[49,66],"assets/images/resized/0001/9391/19391v1-max-150x150.jpg"],[[49,66],"assets/images/resized/0001/9391/19391v1-max-250x250.jpg"],[[49,66],"assets/images/resized/0001/9391/19391v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.strands.com/corp/team.vm\" title=\"Strands\" rel=\"nofollow\">Strands</a></p>"},"degrees":[],"relationships":[{"is_past":true,"title":"General Manager - Personal Finance Products","firm":{"name":"Strands Labs","permalink":"strands","type_of_entity":"company","image":{"available_sizes":[[[150,22],"assets/images/resized/0000/4489/4489v2-max-150x150.png"],[[217,33],"assets/images/resized/0000/4489/4489v2-max-250x250.png"],[[217,33],"assets/images/resized/0000/4489/4489v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}