{"first_name":"Athan","last_name":"Stephanopoulos","permalink":"athan-stephanopoulos","crunchbase_url":"http://www.crunchbase.com/person/athan-stephanopoulos","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"GorillaSpot Media","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 15 16:59:10 UTC 2012","updated_at":"Fri Aug 17 09:58:40 UTC 2012","overview":"<p>Athan E. Stephanopoulos is the founder and chief executive officer of GorillaSpot Media, a New York City-based video technology company that builds clip driven applications for media and entertainment companies to engage and interact with their audiences across the social web. </p>\n\n<p>Stephanopoulos launched the company in 2007 as a response to the effects he saw digital technologies having on the traditional media industry - something he witnessed first-hand while working for a prominent entertainment advertising agency. </p>\n\n<p>Today, GorillaSpot boasts an impressive list of companies that utilize its technologies to manage their marketing campaigns across the social web. Clients include Paramount Pictures, HBO, ABC, South Park, AMC, FX Networks, CBS Sports, MTV, Starz, MLB and Saturday Night Live. Led by Stephanopoulos, GorillaSpot has developed cutting edge campaigns for top shows like Entourage, The Walking Dead, It’s Always Sunny in Philadelphia, Spartacus, Modern Family and South Park.</p>\n\n<p>Aside from running day-to-day management of GorillaSpot, Stephanopoulos also serves as an adjunct professor at Fordham University’s Graduate School of Business in New York City where he teaches courses on Media Entrepreneurship and Social Media. In this capacity, he also chairs a Media Lecture Series that interviews top media executives and examines the effects that digital disruption is having on the industry today. </p>\n\n<p>Stephanopoulos is a graduate of Fordham University’s Graduate School of Business and Willamette University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO/Founder","firm":{"name":"GorillaSpot Media","permalink":"gorillaspot","type_of_entity":"company","image":{"available_sizes":[[[150,24],"assets/images/resized/0020/5507/205507v4-max-150x150.png"],[[250,40],"assets/images/resized/0020/5507/205507v4-max-250x250.png"],[[378,61],"assets/images/resized/0020/5507/205507v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}