{"first_name":"Atif","last_name":"Yousuf","permalink":"atif-yousuf","crunchbase_url":"http://www.crunchbase.com/person/atif-yousuf","homepage_url":"","birthplace":"Karachi","twitter_username":"syedatifyousuf","blog_url":"http://syedatifyousuf.blogspot.com/","blog_feed_url":"","affiliation_name":"MediaRedirect.com","born_year":1988,"born_month":1,"born_day":14,"tag_list":"atif-yousuf","alias_list":null,"created_at":"Fri Sep 16 12:03:17 UTC 2011","updated_at":"Mon Apr 02 02:09:11 UTC 2012","overview":"<p>My name is Atif Yousuf I have completed my Inter Commerce and I am in B.com part 2.\nI have a proven track record of obtaining top places on the web more competitive keywords, with successful experience with the performance of the algorithms of search engines with extremely high rates of concrete placement for specific keywords phrases. I have introduced an approach for incorporating social media to enhance the traditional optimization SEO existing offerings. \nThe ability to use information to solve business problems, identifying opportunities for innovation, recognition of problem areas and implementing solutions, the selection of critical information from masses of data Specialties \nSEO / SMO Business Consulting Search Engine Optimization Social Media Optimization Online Branding and Reputation Management Keyword Research and Competitive Intelligence Analysis Strategy Webmaster SEO Social Media Strategic Planning People Management Web Analytics Blogging Project Management and Monitoring Development Wordpress Performance Tools - The Web competitor tracking performance and analyze market .\n4 years of industry experience, with extensive hands on experience in Internet marketing / web with SEO (Search Engine Optimization) and other online marketing channels such as Pay per Click, Pay per Lead, Social Media Marketing E-Mail Marketing. \nThe following are some of the basics of Atif Yousuf Knowledge, Skills and Abilities:\n 4 years of hands on practice with Search Engine Optimization / Marketing Understanding of the major search engines and algorithms. The likes of search engine algorithm and dislikes. Expert in optimizing the page with the following: Meta Tags or in writing and optimizing the selection or keywords and optimization of management structures and the definition and optimization or H1, H2 and H3 use or write unique content or definition of the internal structure of link or bread crumbs or implementing content management and CMS Using specialized optimization Off page with the following: management or ranking keywords and keyword optimization. (Google, Yahoo and Bing) or presentations (Directories, Forums and Classifieds) or Formulation of a strategy and link building partnerships and Link Building APIs for integration or link exchange or a relevant link partnerships or blogs and comment or Blog RSS Presentation and Integration Expert in using SEO and Web Master Tools Analytics: Google Analytics or Google or Web Master and Yahoo Site Explorer and Bing Integration or Urchin Web Master Expert Pay Per Click (PPC) and E-Marketing with the following:  Google Ad words Advertising and Management. Yahoo and MSN Ad Center or publicity or advertising and PPC Management and Social Media Marketing Expert with the following:  Design of social media marketing campaigns, implementation and monitoring or FaceBook, Twitter, LinkedIn and stumble or markers and their integration or integration of Facebook and Twitter with the tools available. Or automated SEO blogs developing related skills and knowledge: Robots. Txt or folder definition and management of the site and structures or HTML / XML / CSS / PHP / RSS / or Do-Follow, follow, never met and control of caterpillars on the servers. Familiar with content management systems and their use or load the pages through the optimization of query optimization time and image optimization. Sub domains or management and control of development or sitemap.xml.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0016/2185/162185v2-max-150x150.jpg"],[[165,250],"assets/images/resized/0016/2185/162185v2-max-250x250.jpg"],[[298,450],"assets/images/resized/0016/2185/162185v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.COM","subject":"COMMERCE","institution":"KARACHI UNIVERSITY ","graduated_year":2011,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"MEDIA REDIRECT","firm":{"name":"MediaRedirect.com","permalink":"mediaredirect-com","type_of_entity":"company","image":{"available_sizes":[[[150,52],"assets/images/resized/0013/5357/135357v2-max-150x150.png"],[[199,69],"assets/images/resized/0013/5357/135357v2-max-250x250.png"],[[199,69],"assets/images/resized/0013/5357/135357v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"MEDIA REDIRECT","firm":{"name":"Media Redirect","permalink":"media-redirect","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.mediaredirect.com/","title":"Media Redirect"}]}