{"first_name":"Aude","last_name":"Zieseniss de Thuin","permalink":"aude-zieseniss-de-thuin","crunchbase_url":"http://www.crunchbase.com/person/aude-zieseniss-de-thuin","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 28 20:24:42 UTC 2009","updated_at":"Wed Jan 28 20:24:42 UTC 2009","overview":"<p>In 2004, Ms. Zieseniss de Thuin created the WEFCOS company to manage the Women&#8217;s Forum for the Economy and Society, whose inaugural session took place in Deauville in October 2005. Rated among the top five global forums in 2007 by the Financial Times, in just four years the Women&#8217;s Forum has become a major event bringing together over one thousand key political, economic, scientific, artistic and media figures of 90 different nationalities.</p>\n\n<p>The Women&#8217;s Forum is a place of debate, reflection and action. Representing and promoting the vision and impact of women on the major economic and societal issues of our time, the Forum&#8217;s wish is to contribute to building a more balanced world for the future. The Women&#8217;s Forum took on an greater international dimension with the creation of Women&#8217;s Forum Asia and the organization of the Women&#8217;s Forum Day in Madrid.</p>\n\n<p>Aude Zieseniss de Thuin is Honorary President of the non-profit organization Force Femmes and member of the Femmes Forum association. She has been awarded the Legion of Honor and the Agricultural Merit award. </p>","image":{"available_sizes":[[[96,150],"assets/images/resized/0003/5084/35084v1-max-150x150.jpg"],[[160,250],"assets/images/resized/0003/5084/35084v1-max-250x250.jpg"],[[240,373],"assets/images/resized/0003/5084/35084v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}