{"first_name":"Auto","last_name":"Clicker","permalink":"auto-clicker","crunchbase_url":"http://www.crunchbase.com/person/auto-clicker","homepage_url":"http://autokeybot.com/","birthplace":"","twitter_username":"","blog_url":"http://autokeybot.com/","blog_feed_url":"http://autokeybot.com/","affiliation_name":"Unaffiliated","born_year":1949,"born_month":2,"born_day":4,"tag_list":"auto-mouse-clicker, auto-keyboard-clicker, automouse, autokeyboard","alias_list":null,"created_at":"Fri Aug 19 17:34:22 UTC 2011","updated_at":"Fri Aug 26 21:10:30 UTC 2011","overview":"<p>Auto clicker - Auto mouse clicker - Auto keyboard clicker - Auto Keybot\nThe main window of Auto Keybot allows to configure the script for the auto clicker/auto mouse/auto keyboard.\nYou can configure delay or interval between mouse clicks, you can define the number of mouse clicks or keyboard clicks to be automated.\nAuto Clicker also allows to configure Interval / Delay in Mouse Clicks in values of Milli Seconds.\nAuto Clicker Auto Keybot also shows the timer and script progress in the progress bars.\nThe Auto Clicker Software Download is offered on a free to try basis. You can try it for free unlimited or buy the full version for only $9.\nYou can buy the full version securely via Paypal using Credit Cards.\nDo Contact us in case you have any questions about the Software Utility!\nMake your own auto clicker/auto typer scripts and test all the functions to see if this is a useful application for you. You get full control of auto mouse clicks and the ability to send auto keyboard commands to any application running in the Windows operating system.\nDownload the FREE trial now!\nThe full auto clicker version gives you the possibility to make very long scripts and comes with a Save / Load feature to store them for easy access.It also features more functions for intelligent and more complicated automation of your Windows PC.\nFor only $9 (7 Euro) get the FULL version and support via E-mail &#8211;&gt; Support\nhttp://autokeybot.com/</p>","image":{"available_sizes":[[[100,100],"assets/images/resized/0015/0223/150223v2-max-150x150.jpg"],[[100,100],"assets/images/resized/0015/0223/150223v2-max-250x250.jpg"],[[100,100],"assets/images/resized/0015/0223/150223v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}