{"first_name":"Avery","last_name":"Malate","permalink":"avery-malate-2","crunchbase_url":"http://www.crunchbase.com/person/avery-malate-2","homepage_url":"http://www.averymalate.com/","birthplace":"Manila","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1972,"born_month":11,"born_day":20,"tag_list":"management, avery-malate, medicare, clinical-compliance, emilio-aguinaldo-college","alias_list":null,"created_at":"Mon Nov 12 10:35:09 UTC 2012","updated_at":"Wed Nov 14 06:29:16 UTC 2012","overview":"<p>Avery Malate is an expert professional nurse. He has dedicated his career to Medicare management.</p>\n\n<p>Medicare Case Management</p>\n\n<p>At the forefront of his responsibilities is Medicare case management. Malate is versed in the overall profitability and clinical reimbursement aspect of every aspect involved in Medicare management.  At his latest position he is responsible for the overall profitability of all facilities managed in relation to clinical reimbursement and Medicare management and utilization.\nThis position includes clinical and financial case management of Medicare Part A residents. Avery Malate interacts with, trains, and coordinates with all personnel in these Medicare.  The personnel include administrators, Directors of Nursing Services, Business Office personnel and finance managers.   Additional staff can include nurses, nursing educators. \nOne of Avery’s main activities is to create, develop, review and approve policies and procedures related to clinical compliance, continuous improvement process (CQI), clinical reimbursement and other training and resource related manuals.</p>\n\n<p>Malate also participates in the hiring process and assessment of nurses. His expertise and education in nursing give him an added edge in assessing and choosing the best personnel possible for these facilities. </p>\n\n<p>Education and Degrees </p>\n\n<p>Avery Malate studied at Emilio Aguinaldo College.  He received his Bachelor’s degree in Nursing from the college in 1993. During his studies he was an outstanding student and received the high honor of a BSN Recipient of Clinical Excellence award. \nThe Emilio Aguinaldo College is a private school in Manila, Philippines. It runs under the management of the Marian Clinics Incorporated. Today the school has approximately 5000 students. \nMalate went on to receive his masters from Walden University in Minneapolis, Minnesota.  His master’s degree is in in Nursing.  Walden University is a private for-profit institution of higher education. </p>\n\n<p>Fighting for a worthy cause</p>\n\n<p>Avery Malate is an active member for a cause dear to his heart- awareness of downs syndrome. He is a true advocate in every sense of the word especially because he has two kids that have downs syndrome. He has fully dedicated himself to the cause in terms of raising awareness, educating and getting people involved.  </p>\n\n<p>Camp Velles – Caring for Children with Down syndrome</p>\n\n<p>Avery founded the organization Camp Vellese as part of their dedication to the cause of Down syndrome. The organization is named after malate’s first born Alvolle.  Alvolle was born with Down syndrome and this drover her parents to be dedicated activists towards the cause. Camp Velles is a great example of their dedication to the cause of Down syndrome. \nCamp Velles Philippines is a special education school that caters to children with special needs, specifically Downs syndrome.  The center was established to care for children with special needs from less fortunate homes. \nAt Camp Velles, most of the students attend the early intervention therapy at no cost to their families. This unbelievable cause shows how dedicated Avery Malate is to providing for those less fortunate who are in need of special care for their special needs children. </p>\n\n<p>Avery Malate Hobbies </p>\n\n<p>Avery has a range of hobbies from mountain biking to hiking and trekking.  He also enjoys target shooting and snorkeling. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}