{"first_name":"Avie","last_name":"Tevanian","permalink":"avie-tevanian","crunchbase_url":"http://www.crunchbase.com/person/avie-tevanian","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jan 13 00:18:58 UTC 2010","updated_at":"Wed Jan 13 00:31:15 UTC 2010","overview":"<p>Avie Tevanian is a Managing Director at Elevation Partners, which he joined in January 2010.  </p>\n\n<p>Most recently, Tevanian was Chief Software Technology Officer at Apple, Inc., and a member of the company’s senior management team, where he led Apple’s software strategy and development.</p>\n\n<p>Tevanian spent nearly 10 years at Apple. Prior to serving as Chief Software Technology Officer, he was Senior Vice President of Software Engineering, where he led the software engineering team that developed OS X, the operating system that today powers many Apple products including desktops, notebooks, servers, the iPhone and the iPod Touch. While at Apple, he served as a member of the executive team that led the company’s turnaround.</p>\n\n<p>Earlier in his career, Tevanian was Vice President of Software Engineering at NeXT Computer and was responsible for managing NeXT&#8217;s software engineering department and the NeXTSTEP operating system.</p>\n\n<p>Tevanian holds a B.A. in mathematics from University of Rochester and earned his M.S. and Ph.D. degrees in computer science from Carnegie Mellon University. While at Carnegie Mellon, Tevanian was a principal designer and engineer of the Mach operating system, which OS X is based upon.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director ","firm":{"name":"Elevation Partners","permalink":"elevation-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,28],"assets/images/resized/0004/1053/41053v1-max-150x150.jpg"],[[250,47],"assets/images/resized/0004/1053/41053v1-max-250x250.jpg"],[[400,76],"assets/images/resized/0004/1053/41053v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}