{"first_name":"Avner","last_name":"Schneur","permalink":"avner-schneur-2-2","crunchbase_url":"http://www.crunchbase.com/person/avner-schneur-2-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Kormeli","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Mar 02 20:51:21 UTC 2012","updated_at":"Sat Mar 10 03:51:15 UTC 2012","overview":"<p>Avner Schneur  led a number of companies from early stage to IPO or other exits. Schneur is currently managing private holding and management company and is the Founder and Managing General Partner of Kormeli, LLC www.kormeli.com  an investment Group dedicated to funding and guiding early-stage technology entrepreneurs and enterprises. Schneur is a board member in number of security and enterprise software companies.\n In late 1999 Schneur founded Emptoris, leading Supply and Contract mgt Software Company and served as the company’s Chairman, President and CEO. On December 2011 Emptoris was sold to IBM.  Prior to founding Emptoris, Schneur was the senior vice president of operations for Vectis Corporation, a leading software vendor of electronic medical records,  Before Vectis, Schneur served as vice president and chief technology officer for Astea International, a leading developer of customer interaction software, and helped lead the company to a successful IPO. Prior to Astea Schneur was director of Software development at Elscint, Inc., a manufacturer of high-end medical imaging systems.\nSchneur Graduated Cum Laude in Industrial Engineering, with a specialty in Information Systems, from the Technion (Israel Institute of Technology).</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder and Managing General Partner of Kormeli","firm":{"name":"Kormeli","permalink":"kormeli","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}