{"first_name":"Axel","last_name":"Schmiegelow","permalink":"axel-schmiegelow-2","crunchbase_url":"http://www.crunchbase.com/person/axel-schmiegelow-2","homepage_url":"http://www.axelschmiegelow.com","birthplace":"","twitter_username":"AxlS","blog_url":"http://www.axelschmiegelow.com","blog_feed_url":"","affiliation_name":"sevenload","born_year":null,"born_month":null,"born_day":null,"tag_list":"serial-entrepreneur, angel, angel-investor, investor, venture-capital, sevenload, oneview, qype, itravel, armedangels, social-bookmarking, mit, ken-morse, hulu, entrepreneurship, social-media, web-2-0, denkwerk, iptv, webtv, seed-investor, ceo","alias_list":null,"created_at":"Tue Jun 17 11:48:16 UTC 2008","updated_at":"Mon Jul 09 02:39:24 UTC 2012","overview":"<p>Axel Schmiegelow is a serial entrepreneur from Europe, focused on the web, social media, and software. He is also a Chairman representative of several tech and media Associations in Germany. </p>\n\n<p>He is currently the CEO of itravel, an experience-based online and mobile tour operator that offers leisure travelers a platform to customize trips including hotel, experiences, and transportation and allows users to compare destinations on more criteria than pricing. </p>\n\n<p>Axel was the first co-founding Angel investor of review and comparison service Qype, the European counterpart of Yelp, and is still a member of Qype&#8217;s Board. Partech, Advent, Wellington, and Vodafone are investors in Qype. </p>\n\n<p>Axel has more than 15 years of experience as a serial entrepreneur, and is considered an expert in marketing, social media and entrepreneurship. He is a regular keynote speaker at leading industry events, including CEBIT, LeWeb, Web 2.0, DLD, next, Supernova, and SIME. </p>\n\n<p>Prior to itravel, Axel was co-founder and CEO of sevenload, a platform for licensed online video content operating in most European countries, the US, Turkey, and Russia. sevenload is comparable to hulu in its licensing approach and is distributed on most connected TV devices (Sony, Panasonic, Netgear and many others)  and in social media (including Facebook). The service includes content from leading Hollywood studios and more than 1400 licensed content partners. sevenload was acquired by Hubert Burda Media in late 2010. After his role as CEO, Axel was one of three Board members at the company until it was fully integrated as a vertical video channel operator within Burda. </p>\n\n<p>Having studied Law with majors in Business and Copyright Law at the Sorbonne and Cologne Universities, Axel established, at sevenload in 2006, the revenure share licensing model that today is the standard in premium online video. Under his leadership, sevenload also established an advertising model that secured net CPMs higher than on traditional TV. As Chairman of the Social Media Group within Germany&#8217;s IAB equivalent, Axel helped broker with the leading TV Broadcasters and establish a new advertising metric for online video in the German advertising industry&#8217;s online advertising association, the AGOF. Similarly, under Axel&#8217;s guidance sevenload played a significant role in the EU antitrust efforts of the major online video industry players to prevent the creation of a joint platform of the two major German private TV Broadcasters.  </p>\n\n<p>As the Chairman of the IPTV Division of the Tech industry association Bitkom, Axel spearheaded efforts to negotiate a viable revenue share licensing model from European copyright agencies.  Axel is also a member of the Broadcasting Council of WDR Group, Germany&#8217;s public TV.  </p>\n\n<p>Axel&#8217;s investment firm dw capital was also the founding investor of the social fashion company armedangels, social event platform popula (acquired by Dumont Schauberg), and mobile couponing startup Coupies. Prior to this, Axel co-founded retail travel software company webtravel (sold to Amadeus competitor Bewotech), B2B wap and SMS gateway provider mobileview (sold to DTMS in 2005), and streaming media startup broadview.tv (sold in 2000). </p>\n\n<p>The MIT is a shareholder in dw group. Axel completed an executive entrepeneurship program at MIT in 2000. 3Com and AspenTech Co-Founder Kenneth P. Morse and Bertelsmann Chairman Prof. Dieter H. Vogel are also shareholders. </p>\n\n<p>dw group was founded as a multimedia consulting firm and interactive agency in 1995. A number of talented founders of the European venture scene started their careers at denkwerk, including Oliver Samwer (Jamba, European Founders Fund, Rocket Internet), denkwerk Co-Founder Jörg Rheinbold (Co-founder of ebay copycat alando and M10), Michael Stephanblome (Co-Founder of Adjug), Gereon Frahling and Leo Fink (Founders of Linguee), and his brother Erik Schmiegelow (Co-Founder of oneview, itellity, and itravel). </p>\n\n<p>In 1999, Axel, his brother Erik and Felix Hildebrand founded the world&#8217;s first social bookmarking and tagging start-up, oneview, which he rolled out in 16 countries and 10 languages. It was based in San Francisco and integrated in Lycos and Altavista. Its IPO was scheduled for late Fall 2000, called off in the .com crash. After the accidental death of Felix in late 2000 and the meltdown of online advertising markets, Axel and Erik refocused oneview on a B2B offering, integrated it into denkwerk group, and by 2005 grew denkwerk into the largest independent interactive agency Group in Europe, with clients such as Nokia, Thomas Cook, and BMW. He withdrew from his operational role to concentrate on Angel investments in 2005 and co-found sevenload in early 2006. Axel has exited the agency business in an equity-backed MBO but remains a minority shareholder. </p>\n\n<p>Axel studied law with an emphasis on Business and International Law at Sorbonne (Paris) and the University of Cologne. During his studies he was awarded a scholarship from the elite German Scholarship Foundation (&#8220;Studienstiftung des deutschen Volkes&#8221;).</p>","image":{"available_sizes":[[[96,150],"assets/images/resized/0003/5086/35086v1-max-150x150.jpg"],[[160,250],"assets/images/resized/0003/5086/35086v1-max-250x250.jpg"],[[240,373],"assets/images/resized/0003/5086/35086v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Founding Partner","firm":{"name":"dw Capital GmbH","permalink":"dw-capital","type_of_entity":"financial_org","image":null}},{"is_past":true,"title":"CEO","firm":{"name":"sevenload","permalink":"sevenload","type_of_entity":"company","image":{"available_sizes":[[[150,22],"assets/images/resized/0001/8193/18193v5-max-150x150.png"],[[250,37],"assets/images/resized/0001/8193/18193v5-max-250x250.png"],[[450,66],"assets/images/resized/0001/8193/18193v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.axelschmiegelow.com","title":"Blog"},{"external_url":"http://twitter.com/axls","title":"Twitter"}]}