{"first_name":"Axvoice","last_name":"Inc","permalink":"axvoice-inc","crunchbase_url":"http://www.crunchbase.com/person/axvoice-inc","homepage_url":"http://www.axvoice.com/","birthplace":"USA","twitter_username":"axvoiceinc","blog_url":"http://blog.axvoice.com/","blog_feed_url":"http://www.axvoice.com/blog/feed/rss/","affiliation_name":"Unaffiliated","born_year":1979,"born_month":12,"born_day":2,"tag_list":"voip-phone-service, voip-provider, internet-phone-service, voip-provider-usa","alias_list":null,"created_at":"Mon Jan 02 15:47:06 UTC 2012","updated_at":"Tue Jan 03 13:32:33 UTC 2012","overview":"<p>Axvoice is a voice over internet protocol service provider, which is based in USA. The company offers internet telephone services primarily in the US and Canada, whereas its coverage is expanded to over 40 global destinations. A customer just needs a reliable high speed internet connection to get Axvoice phone service.  The call plans have been divided into three broad categories; residential, business and international, where a customer can select one according to his needs and requirements.\nThe residential unlimited US/Canada plan can be signed up for as little $8.25 per month. Moreover, there is an option of pay as you. While the residential international and international plus plans are available at $16.58 and $29.99 respectively. In business category, it offers SOHO (home) business plan at $14.99 monthly, while in another subscription, the services are offered at $29.99 per month. This is just a brief synopsis of calling packages, and details can be obtained from the website. \nThe company also offers many value-added services with every package. Some of these are caller ID, call blocking, anonymous call rejection, call forwarding, emergency call services, music on hold, alternate caller ID, virtual number and number portability. A customer can sign up for the phone service on the website, and if one is not satisfied with the service, there is a 15 days money back guarantee.\nAdditionally, the company also offers its VoIP apps for Smartphone devices, so customers can download them and enjoy VoIP services on Blackberry, Android, and IPhone etc. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}