{"first_name":"B. Bonin","last_name":"Bough","permalink":"b-bonin-bough","crunchbase_url":"http://www.crunchbase.com/person/b-bonin-bough","homepage_url":"http://www.bboninbough.com","birthplace":"New York, NY","twitter_username":"boughb","blog_url":"http://blogs.forbes.com/boninbough/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Apr 11 21:38:52 UTC 2011","updated_at":"Thu Feb 16 04:51:08 UTC 2012","overview":"<p>B. Bonin Bough is Vice President of Global Digital and Consumer Engagement at Kraft Foods. In this role, Bough oversees all of Kraft’s digital communications, establishes new partnerships with online platforms, manages internal capabilities and develops strategies across the firm’s product portfolio. Most recently, Bough was recognized as one of business’ hottest rising stars in Fortune’s 2011 “40 under 40” list, as well as Fast Company’s 2011 100 Most Creative People in Business and Ebony’s Power 100 list.</p>\n\n<p>Prior to joining Kraft Foods, Bonin spent three and a half years at PepsiCo where he oversaw company-wide digital strategy and the implementation of social media tools across PepsiCo’s portfolio of food and beverage brands. Bough was instrumental in integrating digital media into PepsiCo&#8217;s overall brand vision and growth strategy, helping to make them one of the most innovative companies in the world as recognized by Fast Company in their 2011 “Most Innovative Companies” issue. He is credited with bringing PepsiCo to SXSW and helping launch the groundbreaking PepsiCo10 and Pepsi Refresh programs, as well as spearheading Gatorade Mission Control and the Women’s Inspiration Network.</p>\n\n<p>Previous to his work with PepsiCo, Bough was the Executive Vice President and Director of Weber Shandwick’s global interactive, social and emerging media practice, leading a global team of over one hundred people. He led strategic programming for the agency’s top clients, including MasterCard, Federation of Colombian Coffee Growers, BestBuy, Electrolux, Ambien, MAC Aids Fund, and Honeywell. Prior to this, Bough was a founding member and Senior Vice President at Ruder Finn Interactive (RFI) where he ran the interactive strategy unit and led the roll-out of the Europe and Asia digital practices.</p>\n\n<p>Bough’s achievements in the world of interactive marketing have won him numerous awards, including a Webby, Stevie, Golden Pencil, Sabre, Big Apple, Com Arts, and SXSW Viewer&#8217;s Choice for MrPicassoHead.com. Bough also taught for five years at NYU’s Center for Publishing, leading courses on the principles and applications of online publishing. He is the co-author of the 2010 book Perspectives on Social Media Marketing, and is the co-chair of the Digital Collective and a member of the board of the Social Media Advisory Council. Bough attended Hartwick College, earning degrees in Physics and Political Science.</p>","image":{"available_sizes":[[[139,150],"assets/images/resized/0013/0101/130101v2-max-150x150.jpg"],[[233,250],"assets/images/resized/0013/0101/130101v2-max-250x250.jpg"],[[419,450],"assets/images/resized/0013/0101/130101v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}