{"first_name":"B","last_name":"Gopkumar","permalink":"b-gopkumar","crunchbase_url":"http://www.crunchbase.com/person/b-gopkumar","homepage_url":"http://www.kotaksecurities.com/home/index.html","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Kotak Securities","born_year":null,"born_month":null,"born_day":null,"tag_list":"b-gopkumar, kotak-securities","alias_list":null,"created_at":"Fri Oct 14 08:03:48 UTC 2011","updated_at":"Fri Dec 02 00:34:26 UTC 2011","overview":"<p>B Gopkumar is the Executive Vice President and Head of Broking at Kotak Securities Ltd. - India’s leading stock brokerage firm from the Kotak Mahindra Group. </p>\n\n<p>Kotak Securities is an industry leader in Retail Broking (Equities and other financial products) and Depository Services business.</p>\n\n<p>Throughout his tenure at Kotak Securities, B Gopkumar has taken charge of many significant areas of business functions. He started as the Senior Vice President and was instrumental in setting up the company’s Financial Planning Group. Two years later, he moved to Kotak Mahindra Bank for a brief stint as the Executive Vice President and Head of Priority Banking. Most recently, he has been responsible for the Marketing function, Corporate Relations, Currency Derivatives, NRI Businesses, Alternate Channels and Online Businesses of Kotak Securities in his capacity as the EVP. \nBefore joining Kotak Securities, B Gopkumar served as a Marketing &amp; Communications professional at Hinditron Informatics Ltd. – a pioneer in IT products and services – from the year 1994 to 1996. His next stint saw him in the Sales function with Crompton Greaves Ltd. – a leading engineering corporation - between 1996 and 1997. Gopkumar came to be a part of the Kotak Mahindra Group via Ford Credit Kotak Mahindra Ltd. joint venture and initially served as the Dealer Account Manager from the year 1997 to 1998; following which he became the Area Manager for Kerala, Karnataka &amp; Andhra Pradesh regions. This role was closely followed by that of a Regional Manager for Ford Credit Kotak Mahindra Ltd. – South and West regions – till 2002, subsequent to which he went on to become its Brand &amp; Marketing Manager in Chennai till the year 2004. From then on, Gopkumar has played an integral role in the functioning of Kotak Securities, taking on many significant roles and positions at the firm. At large, B Gopkumar has dedicated 14 year of his servitude to the Kotak family. \nB Gopkumar received a Bachelor’s degree in Commerce, followed by an MBA degree; both from the Mangalore University, India. So far, he has accumulated over 17 years of experience in the fields of Sales, Marketing and Relationship management.  </p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0015/8102/158102v2-max-150x150.jpg"],[[80,80],"assets/images/resized/0015/8102/158102v2-max-250x250.jpg"],[[80,80],"assets/images/resized/0015/8102/158102v2-max-450x450.jpg"]],"attribution":"<p>Muzzammil Bambot</p>"},"degrees":[{"degree_type":"MBA","subject":"","institution":"Mangalore University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Executive Vice President and Head of Broking","firm":{"name":"Kotak Securities","permalink":"kotak-securities","type_of_entity":"company","image":{"available_sizes":[[[150,62],"assets/images/resized/0011/4911/114911v4-max-150x150.jpg"],[[250,103],"assets/images/resized/0011/4911/114911v4-max-250x250.jpg"],[[397,165],"assets/images/resized/0011/4911/114911v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.financialexpress.com/news/a-structured-product-is-a-product-in-which-you-know-the-end-result-before-you-buy-it/380381/0","title":"Interview with B Gopkumar"}],"web_presences":[{"external_url":"http://in.linkedin.com/pub/b-gopkumar-kotak-securities/22/aa/151","title":"B GopKumar on Linkedin"}]}