{"first_name":"Bahram","last_name":"Nour-Omid","permalink":"bahram-nour-omid","crunchbase_url":"http://www.crunchbase.com/person/bahram-nour-omid","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Nov 30 17:19:15 UTC 2008","updated_at":"Sun Nov 30 17:21:45 UTC 2008","overview":"<p>From 1999 until joining Shelter, Dr. Nour-Omid was the founding Chairman and Chief Executive Officer of StudioXchange, Inc., a provider of production site, labor and equipment procurement services for the entertainment industry. StudioXchange was acquired by IFILM in 2000. From 1997 to 1999, he was Executive Vice President and a Director of Essentus, Inc., a provider of supply chain software for the apparel industry. From March 1991 through 1997, he was the founding Chief Technology Officer and a Director of Scopus Technology, Inc., a provider of front-office applications software. Scopus went public in 1995 and was sold to Siebel Systems, Inc., in 1998. From 1981 to 1990 Dr. Nour-Omid was a consulting scientist at the Lockheed Palo Alto Research Laboratory.</p>\n\n<p>Dr. Nour-Omid is currently a director of Roamware, Inc. a leading provider of software solutions designed to power the global wireless market, Integrated Decision Systems, an industry leader in portfolio management solutions, Isensix, a provider of wireless monitoring systems, and Kryptiq, a leading provider of workflow connectivity and contract management solutions for the healthcare industry.</p>\n\n<p>Dr. Nour-Omid earned a B.S. from the University of London&#8217;s Imperial College, and an M.S. in Structural Engineering, M.A. in Mathematics and Ph.D. in Computer Simulation from the University of California, Berkeley. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Shelter Capital Partners","permalink":"shelter-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,55],"assets/images/resized/0003/0251/30251v1-max-150x150.jpg"],[[157,58],"assets/images/resized/0003/0251/30251v1-max-250x250.jpg"],[[157,58],"assets/images/resized/0003/0251/30251v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}