{"first_name":"BALDEV","last_name":"MERKEL","permalink":"baldev-merkel","crunchbase_url":"http://www.crunchbase.com/person/baldev-merkel","homepage_url":"","birthplace":"frankfurt germany","twitter_username":"baldevmerkel","blog_url":"http://www.baldevmerkel-group.blogspot.com","blog_feed_url":"http://www.baldevmerkel-group.blogspot.com","affiliation_name":"Unaffiliated","born_year":1940,"born_month":8,"born_day":17,"tag_list":"","alias_list":null,"created_at":"Wed Mar 28 15:04:58 UTC 2012","updated_at":"Fri Mar 30 15:41:49 UTC 2012","overview":"<p>Baldev Merkel is the chairman  and founder of Baldev Merkel group of Companies.\n                            BIOGRAPHY\nBaldev Casey Merkel is a German business magnate, investor and philanthropist born on 17 Aug 1940 in Frankfurt Germany  to a middle class family of Stevenson Adolf merkel  and Caroline hauls who were both lawyers and influential business people in Germany, baldev merkel is estimated to be 8 billion US  dollars and is ranched as among the most richest personalities in Germany listed in top 10 of richest people in germ any. he attended international bilingual Montessori primary school and later joined Frankfurt high school which he completed in 1958. baldev merkel family and ancestors are sed to have blood relations with now German chancellor Angela merkel as baldev and angel are sed to be distant cousins. after completing high school  he didn&#8217;t fulfill his parents wishes of attending university to study law or business administration the thy had planned for him in order for him to be able to mange the family business which involved mines, oil and gas which was estimated to be 85million us dollars at that time. after declining to head to the university his parent placed him as a temporary supervisor in the family business, and when still in the management of the business, he was approached by a friend with an idea of starting up a tourism and hotel organization in late 1959.\n        In1960 he approached  his parents with the idea but thy bade him down in which  the young baldev decided to put his idea in to action where by in 1960 he  established a small company in Frankfurt Germany, and upon his parents seeing his determination they supported him financially and encouraged him to venture into the business as his heart desired. within a period of one year in late 1961 the business had flourished  and still in that year baldev was placed in the annals of history in Germany as the youngest 21years enterprenuer to venture int a flourishing, tourism and hotel business within a short period of  time in Frankfurt where by he received an ward of Berliner kunstrpress, entrepreneur award of the year.\nin 1963 baldev enrolled in  university of Heidelberg  where he studied a bachelors degree in business administration and upon completion he enrolled for an MBA in 1969 in university of Leipzig which later in 1973his distant cousin Angela enrolled from 1973- 1978 to study physics, while still in the university like most students baldev was a member of the official socialist led youth movement free Germany youth,, he also participated in the construction  of the ruin of moritzbastel a project students started to create their own club and recreation facility in the university, such a project was unprecedented in the GDR of that period  and when it was commencing it was first resisted by the senate board of Leipzig but upon students pressure it was later accepted. when in the university he had left his business under the care of his parents, and his distant cousin Marcus who had previously shown interest and thy had joined hands and become partners.\nafter completion of his MBA in 1971 Baldev married his long time university girlfriend Margaret pederseen. in 1972 thy were blessed with their first born boy whom  thy named Adolf fuschin merkel. in late 1973 there arose conflicts of interests between baldev and Marcus on the thriving org,and after several attempts Marcus sold up his shares to baldev in 1973, following a law suit and polices baldev become the full owner of the organization in 1975.\nstill in 1973 the business mogul enrolled to California university in los angels California where he pursued a PHD in economics  which he completed in 1974. in 1976 his father left him in charge of the family business to mange besides his org, but his father was to be rendering his management at a far distance, at the time the business was estimated to be worth a  fortune of 7.5 billion us dollars. in late 1976 baldev opened his org outside Germany in one of the believed  country to be oldest in hospitality in the world, Switzerland, it was one of his major challenge  expansions of his org beyond boarders.  in 1977 baldev family was blessed with a baby girl Mellisa who latter succumbed to death in a fatal road accident in Frankfurt together with his father and some few friends while going on vacation in summer of 1984. in early 1978he was quoted by deutsche zeitungen newspaper as one of the youngest enterprenuer to take his org beyond boarders far away from home. in 1978 he was approached by the senate board of Leipzig where he was a former student to be a lecturer  where his cousin Angela merkel was completing his final fourth year degree in physics in 1978 but he declined the offer to concentrate in the management of his family business and his growing org too, but the senate board of Leipzig  understood the ground for baldev turning  down the offer. in 1982 he enrolled to Roosevelt university as a distant student where he pursued a bachelors degree in Internationale travel, tourism and management, while studying in the university he Learn to speak and write fluent Spanish and french, where by he completed  his degree in 1986. in late 1983 the org that he had opened  in Switzerland was doing perfectly well in which he was approached by the senate board and director of studies from Swiss hotel management school, for the student to be offered attachment as trainees in the org where by a 5 years agreement was signed between both parties an incident that boosted the org  to greater heights. in 1989 he enrolled in Roosevelt university to pursue an MBA in international travel and tourism management, which he completed in 1991. \nfrom 1983-1991 baldev merkel extended his org branches in several countries inclusive of new Zealand, Mexico and France (for more info see www.baldevmerkelgroup.org/organization profile) in 1989 in  the era of the falling of Berlin wall merkel mother his brothers and some other family members decide to sell the family business to a California investor billionaire Sir Row Rajolla as a going concern where by he purchased 48% shares of the business. in 1992 he was awarded honorary degree from university of Leipzig this come after his cousin Angela merkel was elected at his first post reunification general elections in December 1990 to the Bundestag from the constituency Streisand nordvorpommern- rugen. in 1994 he expanded his org to Edinburgh great Britain and on the same year baldev merkel was invited by the Italian presidency of the councils of ministers where he was honored with the recognition of damadi gran crose ordine almerito repubblica italiana for extensive org expansion. \nbetween 1997-2008 baldev had extended his org to Moscow Russia, Brazil, and Argentina, (for reference visit www.baldevmerekelgroup.org/org profile) in 2002 he received the Karl sprees(charlemgne prize) for the expansion effort strategies and services his org was the countries in Europe and America. New  statesman named baldev merkel as the worlds 50 most influential figure in 2006. in 2009he received the European hotel design awards in Europe, in 2009 still baldev received b&#8217;nal b&#8217;rith Europe award of merit due to the management of his org.\nin 2009 baldev introduced his first org on the African soil in south Africa in isando gauteng in which in late 2010 the org recorded a 58% increase in revenues which made him to extend his org to the 2nd African country Kenya in which the full operations are set to start in January 2012.\nwhen free baldev merkel who is currently 71years old loves traveling  exploring and adventuring new places with his wife Margaret merkel who have been a real inspiration behind him and his org. he was once quoted in by Atlantic times newspaper in Germany on 16th February 2011 saying, &#8221; despite my age of 71years i love playing golf my all times favorite game,i also love clubbing sometimes and discussing businesses with friends, am always so gland in making differences in peoples lives by providing them with what they will always remember me of, jobs with good remunerations and benefit packages this alone makes me feel at ease and peace with myself &#8221; baldev merkel lives in Frankfurt but he mostly loves spending time in California los angels mansions where his wife lives and their son Adolf. his guest is to see the org opening branches in different countries in the world</p>","image":{"available_sizes":[[[150,131],"assets/images/resized/0018/1556/181556v2-max-150x150.jpg"],[[200,175],"assets/images/resized/0018/1556/181556v2-max-250x250.jpg"],[[200,175],"assets/images/resized/0018/1556/181556v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"business administration","subject":"BA in business adminstration","institution":"university of heildberg","graduated_year":1967,"graduated_month":null,"graduated_day":null},{"degree_type":"business adminstration","subject":"MBA","institution":"university of leipzig","graduated_year":1969,"graduated_month":null,"graduated_day":null},{"degree_type":"ECONOMICS","subject":"pHD","institution":"California university","graduated_year":1974,"graduated_month":null,"graduated_day":null},{"degree_type":"international travel tourism and management","subject":"BA","institution":"Roosevelt university","graduated_year":1986,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}