{"first_name":"Barbara","last_name":"Lancaster","permalink":"barbara-lancaster","crunchbase_url":"http://www.crunchbase.com/person/barbara-lancaster","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri May 20 03:56:06 UTC 2011","updated_at":"Fri May 20 04:01:15 UTC 2011","overview":"<p>Barbara Lancaster is a widely recognized expert in the billing and Business Support Systems (BSS) industry, having played key roles on both the client and vendor sides of the market. As Vice President of Sales, Americas, Barbara will apply her extensive sales management experience to driving new account acquisition and revenue growth for MetraTech.  Prior to joining MetraTech, Barbara was President of LTC International, a company providing specialist consulting and advisory services to service providers, the investment community and suppliers of hardware and software to the information and communications industries. Under her leadership, Barbara led multi-year consulting engagements with Nortel Networks, Cisco Systems, and Electronic Data Systems.  Prior to LTC, Barbara served as General Manager of Billing and Customer Care Systems at Bell Sygma and as Director and VP of Sales, Asia Pacific, for Bell Canada International.  Throughout her career, Barbara has been an active contributor in the Technology, Media and Telecommunications industry, contributing to the Telemanagement Forum, IIRAssociation, conducting investor briefings and serving on the Executive Council and Chair of the Innovation Team of the MetroPlex Technology Business Council, the largest high tech trade group in Texas.  Barbara has an advanced diploma in Business Administration from Algonquin College of Applied Arts and Technology, and is a member of IEEE.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Vice President, Sales, Americas","firm":{"name":"MetraTech","permalink":"metratech","type_of_entity":"company","image":{"available_sizes":[[[150,42],"assets/images/resized/0013/5527/135527v1-max-150x150.jpg"],[[227,65],"assets/images/resized/0013/5527/135527v1-max-250x250.jpg"],[[227,65],"assets/images/resized/0013/5527/135527v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}