{"first_name":"Barbara","last_name":"Jones","permalink":"barbara-jones-2","crunchbase_url":"http://www.crunchbase.com/person/barbara-jones-2","homepage_url":"http://blissfulmediagroup.net","birthplace":"","twitter_username":"BarbaraJones","blog_url":"","blog_feed_url":"","affiliation_name":"Blissful Media Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"social-media-marketing, marketing-strategy, digital-marketing, product-marketing, social-media, word-of-mouth-marketing, public-relations, digital-photography, digital-media, digital-strategy, digital-video, internet-entrepreneur, entrepreneurship, music-","alias_list":null,"created_at":"Sun Aug 19 00:36:03 UTC 2012","updated_at":"Tue Aug 21 11:32:15 UTC 2012","overview":"<p>Barbara is the CEO and Founder of profitable start-ups targeting women and moms utilizing social media including Blissful Media Group, One2One Network, BlissDom Events and Blissfully Domestic. Her companies effectively educate, consult and liaise with both big brands and women online publishers/content creators to develop mutually beneficial relationships and implement effective brand campaigns. Key categories include Food and Beverage, Home Care, Laundry Care, Fashion, Beauty, Entertainment, Technology, Mobile, Frugal Living and more.</p>\n\n<p>Prior to founding her companies, she was a senior marketing executive with 20+ years of brand marketing, strategic planning, sales and distribution experience at major entertainment media companies directing large, high profile projects and global product launches.</p>\n\n<p>Barbara is a well-rounded manager with a firm grasp of the financials complemented with solid creative capabilities. Responsible for overseeing multi-million dollar project and department budgets.</p>\n\n<p>She manages big picture objectives with the knowledge and understanding of the necessary details to accomplish goals.</p>\n\n<p>She has strong leadership and interpersonal skills dealing with every department and division of the company as well as with external business relationships.</p>\n\n<p>Barbara is a level-headed executive who is able to multi-task and meet deadlines in a fast-paced environment with the ability to prioritize and manage several tasks and individuals at once.</p>\n\n<p>She is also an energetic, passionate leader with entrepreneurial spirit and outstanding integrity.\nSpecialties</p>\n\n<p>Word of Mouth Marketing, Buzz Marketing, Marketing to Women, Marketing to Moms, Blogger PR, Social Media, Twitter, Facebook, Sponsorships, Event Planning, Music/Entertainment Business Liason, Blog Networks, Talent Management</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0020/6816/206816v2-max-150x150.jpg"],[[178,250],"assets/images/resized/0020/6816/206816v2-max-250x250.jpg"],[[321,450],"assets/images/resized/0020/6816/206816v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor of Arts","subject":"Communications","institution":"Southern Methodist University","graduated_year":1988,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Co-Founder/CEO","firm":{"name":"BlissDom Events","permalink":"blissdom-events","type_of_entity":"company","image":null}},{"is_past":false,"title":"Founder/CEO","firm":{"name":"Blissful Media Group","permalink":"blissful-media-group","type_of_entity":"company","image":null}},{"is_past":false,"title":"Founder/CEO","firm":{"name":"One2One Network","permalink":"one2one-network","type_of_entity":"company","image":null}},{"is_past":false,"title":"Co-Founder/Strategic Advisor","firm":{"name":"Picha Global","permalink":"picha-global","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/barbarajones","title":"@BarbaraJones"},{"external_url":"http://linkedin.com/in/barbarajones","title":"Barbara Jones on LinkedIn"}]}