{"first_name":"Barbara","last_name":"Huang","permalink":"barbara-huang","crunchbase_url":"http://www.crunchbase.com/person/barbara-huang","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Avidian Technologies","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Apr 08 23:18:12 UTC 2009","updated_at":"Wed Aug 19 16:58:54 UTC 2009","overview":"<p>Barbara Huang is a graduate of Georgia State University with a Bachelor in Business Administration, with concentration in accounting. She started her accounting career in public accounting in Atlanta, and has worked in Houston and Seattle since 1980 in various industries, such as real estate, insurance, financial services, educational broadcasting, travel, retail, multimedia/high-tech and software. </p>\n\n<p>Barbara has been an independent consultant since 1997 for small and medium-sized business entities performing controllership responsibilities, business start-ups, financial reporting, tax preparation, bookkeeping services and special projects (business plan development, policy and procedure documentation, computerization of manual bookkeeping systems).</p>\n\n<p>As an active member of the Washington Society of CPAs, she has served on the Board of Directors and volunteered on the Accounting Career Advisory Committee, the Financial Literacy Task Force and also on other committees. Barbara has been a speaker in various high schools and colleges, addressing accounting as a career choice and financial literacy. Currently, Barbara serves as Chair of the General Advisory Council of Mukilteo School District’s Career and Technical Education.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CFO","firm":{"name":"Avidian Technologies","permalink":"avidian-technologies","type_of_entity":"company","image":{"available_sizes":[[[62,43],"assets/images/resized/0002/2478/22478v2-max-150x150.png"],[[62,43],"assets/images/resized/0002/2478/22478v2-max-250x250.png"],[[62,43],"assets/images/resized/0002/2478/22478v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}