{"first_name":"Barry","last_name":"X Lynn","permalink":"barry-x-lynn","crunchbase_url":"http://www.crunchbase.com/person/barry-x-lynn","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"3Tera","born_year":null,"born_month":null,"born_day":null,"tag_list":"cloud-computing, utility-computing, 3tera","alias_list":null,"created_at":"Sun Mar 30 00:39:34 UTC 2008","updated_at":"Mon Aug 04 20:49:06 UTC 2008","overview":"<p>Barry has over 35 years of executive experience in the IT and financial services sectors in Fortune 100 companies and as an entrepreneur.</p>\n\n<p>Early in his career, Barry was with Wells Fargo, where he was executive vice president and head of Investment Operations before becoming chief information officer (CIO) of Wells Fargo and Company and President of Wells Fargo Technology Services. In 1995, while at Wells Fargo, he built the world&#8217;s first Internet online banking system. Barry was also president of Wells Fargo Securities Clearance Corp. and founder and president of Wells Fargo Securities, Inc.</p>\n\n<p>Barry also is a general partner of SVP II, a fully invested venture fund managed by Shoreline Venture Management LLC, and currently serves on the Boards of Directors of Alacritech, Attune Systems and Layer 7 Technologies. He founded Be eXceL Management, Inc., a management consulting firm, which incubated early stage technology companies, served as Chairman and CEO of PRIVACI, a provider of anonymous purchasing and personalized services for consumers on the Internet, and was a director of Merant PLC, a public software company.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chairman and CEO","firm":{"name":"3Tera","permalink":"3tera","type_of_entity":"company","image":{"available_sizes":[[[150,51],"assets/images/resized/0001/6543/16543v3-max-150x150.png"],[[150,51],"assets/images/resized/0001/6543/16543v3-max-250x250.png"],[[150,51],"assets/images/resized/0001/6543/16543v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}