{"first_name":"Barry","last_name":"Houlihan","permalink":"barry-houlihan","crunchbase_url":"http://www.crunchbase.com/person/barry-houlihan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Mobile Interactive Group ","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 30 16:30:26 UTC 2009","updated_at":"Mon Jul 20 21:36:41 UTC 2009","overview":"<p>Barry has been a rising figure in the mobile industry since 1999, when he left his position as Group Advertising Manager at publishing giant EMAP MacClaren to join the emerging mobile internet company Genie Mobile.</p>\n\n<p>Responsible for business development, Barry made an impression at Genie by spearheading various ground breaking contracts including the first ever mobile content and voicemail services in the UK. It was the significant mobile data revenues delivered by Barry that were instrumental in establishing Genie as a leading mobile internet portal and later an MVNO target for BT Cellnet.</p>\n\n<p>Barry moved from BT Genie in 2001 to set up 02&#8217;s Mobile Interactive Division, with the responsibility for utilising his vast content partnership experience to develop the business by targeting global media brands and major corporate companies capable of generating high volume data traffic.</p>\n\n<p>At O2, Barry initiated some of the biggest mobile interactive partnerships to date, for landmark interactive broadcast events such as Big Brother, I&#8217;m A Celebrity: Get Me out of Here, Pop Idol, The national lottery mobile service and Master foods &#8216;chocollect&#8217; campaign. It was whilst working as General Sales Manager at O2 that Barry shared a close working relationship with the founding management team of MIG - Anthony Nelson and Nick Aldridge, which launched in May 2004.</p>\n\n<p>Since MIG launched in May 2004, Barry has been the driving and strategic force behind the launch of five subsidiary companies - Mobile advertising agency 4th Screen Advertising, cross platform digital solutions agency, Jigsaw, experiential design agency New Toy, technology development business Mobile Interactive Technology and most recently a mobile internet publishing business, Kilrush - With all businesses designing, developing and building their own proprietary technology.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO and Founder","firm":{"name":"Mobile Interactive Group ","permalink":"mobile-interactive-group","type_of_entity":"company","image":{"available_sizes":[[[150,148],"assets/images/resized/0005/2123/52123v2-max-150x150.png"],[[250,247],"assets/images/resized/0005/2123/52123v2-max-250x250.png"],[[450,445],"assets/images/resized/0005/2123/52123v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}