{"first_name":"Barry","last_name":"Shepard","permalink":"barry-shepard","crunchbase_url":"http://www.crunchbase.com/person/barry-shepard","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Feb 15 22:40:35 UTC 2008","updated_at":"Fri Apr 04 14:37:35 UTC 2008","overview":"<p>As CEO of QponDirect, Barry Shepard brings over 17 years experience with a track record of generating outstanding sales and profit growth for highly competitive consumer package goods businesses. Prior to joining QponDirect, Mr. Shepard was an Executive Officer and Senior Vice President, Marketing &amp; Innovation for Del Monte Foods, a San Francisco based Food and Beverage Company. Mr. Shepard was responsible for leading Del Monte’s New Venture Group as well as delivering Marketing Excellence across Consumer Insights, Market Research, Advertising and Promotions, and Package Design. Mr. Shepard began his career with Del Monte in 2002 as the Vice President of Pet Food Marketing following the acquisition of businesses from the H. J. Heinz Company. At Del Monte, Mr. Shepard assumed the title of Managing Director of Pet Products in August of 2004. In July of 2006, Mr. Shepard became Senior Vice President, Marketing &amp; Innovation. At Heinz, Mr. Shepard held the positions of Director of Marketing, Ketchup &amp; Condiments followed by Vice President of Marketing for StarKist Seafood. Prior to going to Heinz, Mr. Shepard spent eight years with Procter &amp; Gamble&#8217;s Laundry &amp; Cleaning Products Division in progressively responsible brand management assignments. Mr. Shepard graduated from Duke University and earned his MBA from The University of Michigan.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"QponDirect","permalink":"qpondirect","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0001/2413/12413v1-max-150x150.jpg"],[[176,59],"assets/images/resized/0001/2413/12413v1-max-250x250.jpg"],[[176,59],"assets/images/resized/0001/2413/12413v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}