{"first_name":"Barry","last_name":"Cottle","permalink":"barry-cottle","crunchbase_url":"http://www.crunchbase.com/person/barry-cottle","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon May 05 23:15:44 UTC 2008","updated_at":"Thu Jan 12 23:19:39 UTC 2012","overview":"<p>Cottle joined Zynga as EVP of business and corporate development in January 2012. </p>\n\n<p>Barry joined EA in 2007 and leads EA Interactive (EAi), the leading worldwide publisher of mobile, social and online games. EAi encompasses EA Mobile (including Chillingo), Pogo, Playfish, as well as, Hasbro and continues to demonstrate impressive market leadership and success through the launch of great new products, expansion of brands onto new platforms and unprecedented partnerships. EA is the #1 games provider in mobile, smartphones and tablets, the #2 social game provider, and #1 online gaming site in time spent. With critically acclaimed titles that leverage EA’s unmatched content portfolio, EAi is executing in new growth areas critical to EA’s strategic transformation into a leader in digital goods and services.</p>\n\n<p>Cottle has more than 20 years experience working in the entertainment, cable TV, high-tech, wireless, mobile content and business software sectors. He has spent his career building successful businesses that leverage content, technology and distribution to create compelling consumer products and services. Prior to his current position, Cottle served as the founder and CEO of Quickoffice Inc, a spin-out of Palm, Inc in 2002, the leading developer of mobile business software applications and content rendering technology for multiple handset manufacturers.</p>\n\n<p>Barry also served as COO and Chief Internet Officer for the Mobile Content and Wireless Service business of Palm Computing Inc. After joining Palm as an Executive Officer to help lead Palm’s IPO, the largest in NASDAQ history at the time, Cottle built and oversaw Palm’s wireless and Internet division and set the company’s worldwide strategic direction for mobile content and services. Prior to Palm, Cottle spent nine years with The Walt Disney Company, where he served most recently as Senior Vice President of Marketing of Disney TeleVentures and CMO of Americast, the Disney division leading the $500M joint venture with SBC, Ameritech, GTE, BellSouth, and SNET to develop digital TV and broadband Internet applications and services. Cottle led Disney’s efforts in marketing, content development and distribution for innovative services such as video-on-demand, web-TV, and TV navigation. Prior to Disney, Cottle worked at Hallmark Cards, Andersen Consulting, Apple Computer, and Trammell Crow. </p>\n\n<p>Cottle received his BS Degree in Information Services and Mathematics from Missouri State University, Summa Cum Laude, and his MBA with honors from the Kellogg School of Management at Northwestern University.</p>","image":{"available_sizes":[[[142,150],"assets/images/resized/0016/9938/169938v1-max-150x150.png"],[[237,250],"assets/images/resized/0016/9938/169938v1-max-250x250.png"],[[324,341],"assets/images/resized/0016/9938/169938v1-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"BS","subject":"Information Services and Mathematics","institution":"Missouri State University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"Kellogg School of Management","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"EVP Business and Corporate Development","firm":{"name":"Zynga","permalink":"zynga","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0000/3187/3187v10-max-150x150.jpg"],[[250,83],"assets/images/resized/0000/3187/3187v10-max-250x250.jpg"],[[275,92],"assets/images/resized/0000/3187/3187v10-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Board","firm":{"name":"Quickoffice","permalink":"quickoffice","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0001/8011/18011v4-max-150x150.jpg"],[[199,59],"assets/images/resized/0001/8011/18011v4-max-250x250.jpg"],[[199,59],"assets/images/resized/0001/8011/18011v4-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"EVP General Manager","firm":{"name":"Electronic Arts","permalink":"electronicarts","type_of_entity":"company","image":{"available_sizes":[[[150,95],"assets/images/resized/0001/2250/12250v3-max-150x150.jpg"],[[250,158],"assets/images/resized/0001/2250/12250v3-max-250x250.jpg"],[[425,270],"assets/images/resized/0001/2250/12250v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}