{"first_name":"Barry","last_name":"S. Sternlight","permalink":"barry-s-sternlight","crunchbase_url":"http://www.crunchbase.com/person/barry-s-sternlight","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jun 13 17:59:02 UTC 2009","updated_at":"Sat Jun 13 17:59:47 UTC 2009","overview":"<p>BARRY S. STERNLICHT is Chairman &amp; CEO of Starwood Capital, a private real estate investment firm he formed in 1991, and the Chairman of Starwood Energy which he formed in 2005. For the past 14 years, he has structured more than 300 separate investment transactions with a cost basis of more than $15.9 billion. Today, his firm manages more than $5 billion on behalf of its high net worth and institutional partners and recently completed the investments for its sixth commingled fund.\nFrom 1995 through 2004, Mr. Sternlicht was Chairman &amp; CEO of Starwood Hotels &amp; Resorts Worldwide, Inc., a company he founded in 1995. Mr. Sternlicht is a trustee of Brown University. He serves on the Board of Directors of The Estée Lauder Companies, the National Advisory Board of JP Morgan Chase, and the Advisory Board of Eurohypo Bank. He serves on the boards of the Juvenile Diabetes Research Foundation’s National Leadership Advocacy Program, Channel 13/WNET, Kids in Crisis, The Harvard Club, the Business Committee for the Arts, and the Center for Christian-Jewish Understanding. He is a member of the Committee to Encourage Corporate Philanthropy, the Presidential Tourism &amp; Travel Advisory Board, the Young Presidents Organization, the World Travel &amp; Tourism Council, the Council for the United States and Italy, and the Urban Land Institute.\nHe received his BA, magna cum laude, with honors from Brown University. He later earned an MBA with distinction from Harvard Business School.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chairman","firm":{"name":"Starwood","permalink":"starwood","type_of_entity":"financial_org","image":{"available_sizes":[[[124,97],"assets/images/resized/0004/8391/48391v1-max-150x150.png"],[[124,97],"assets/images/resized/0004/8391/48391v1-max-250x250.png"],[[124,97],"assets/images/resized/0004/8391/48391v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}