{"first_name":"Bart","last_name":"van der Horst","permalink":"bart-van-der-horst","crunchbase_url":"http://www.crunchbase.com/person/bart-van-der-horst","homepage_url":"","birthplace":"Turnhout, Belgium","twitter_username":"bartvanderhorst","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Feb 01 21:51:26 UTC 2010","updated_at":"Sat Dec 18 01:06:21 UTC 2010","overview":"<p>Bart van der Horst successfully establishes and starts-up companies arround the world. Bart’s particular areas of expertise include corporate strategy, go-to-market analysis, the execution of international expansion and new market development. For most of his career, Bart has been involved in the software market and is recognized for his breadth of expertise and experience.</p>\n\n<p>Bart began his professional life as a part-time Systems Engineer supporting SAP and UNIX systems. He then joined a Windows NT and electronic messaging start-up and helped grow this pioneering company in the pre-Internet era. After this successful first venture Bart joined a second-phase software company in enterprise resource planning. In 1997 he joined Corporate Software in the Netherlands, where he was responsible for corporate sales.</p>\n\n<p>From 1997 to 1999 Corporate Software grew its business dramatically to become the Netherlands’ leading software reseller. Bart was subsequently assigned to replicate this success around the world as Director of Global Business Development from Corporate Software’s worldwide headquarters in Geneva. In this role he implemented a global Software Asset Management offering, and was closely involved in Corporate Software’s European expansion.</p>\n\n<p>In 2002 Bart was appointed Country Manager for the UK and Ireland for Corporate Software. In the same year he successfully merged the company with Software Spectrum, to form Software Spectrum UK Ltd. The new company quickly became the UK market leader for licensing and asset management services, with revenue exceeding €140 million in 2005.</p>\n\n<p>In 2005 Software Spectrum appointed Bart as Director for EMEA. Bart led the EMEA organisation into the mid-market, an area not previously covered by Software Spectrum.</p>\n\n<p>In September 2006 Bart left Software Spectrum after the company’s successful sale to Insight Enterprises. Shortly afterwards establishes Software Channels Ltd. a startegy consulting firm. Software Channels was acquired by Canalys in 2008. Bart relocated to the US in early 2008 to establish Canalys.com Inc and currently resides in California with his wife and three children.</p>\n\n<p>Bart has a degree in Industrial Engineering and attended the Accelerated International Growth Programme at IMD and the General Management Programme at Henley Management College. He is fluent in both English and Dutch and proficient in German and French.</p>","image":{"available_sizes":[[[139,150],"assets/images/resized/0007/5677/75677v2-max-150x150.jpg"],[[232,250],"assets/images/resized/0007/5677/75677v2-max-250x250.jpg"],[[378,406],"assets/images/resized/0007/5677/75677v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}