{"first_name":"Bart","last_name":"Gray","permalink":"bart-gray","crunchbase_url":"http://www.crunchbase.com/person/bart-gray","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 05 11:26:01 UTC 2009","updated_at":"Fri Jun 05 11:39:02 UTC 2009","overview":"<p>Mr. Gray joined WWC Capital as Partner in January, 2006 with over nine years of investment banking experience advising technology companies in strategic transactions, private and public capital raising, and opportunity assessment. Previously, Bart was an investment banker with a Wall Street bulge bracket investment bank&#8217;s global technology group focused on storage and enterprise software. A technology banker for most of his career, he has also advised and executed transactions for companies focused on data networking, IT services, network security. Bart has been a key member of banking teams that have closed over $10 billion in transactions, including some $500 million in private equity-related assignments over his banking career.</p>\n\n<p>At Lehman Brothers, Bart was a technology banker focused originally on enterprise software (including Sequoia Software) and hardware clients. He later worked in the firm&#8217;s storage practice where he was focused on vertically extending the business into networking, services, and software with companies such as Dot Hill, EMC, McDATA, Network Appliance, and others.</p>\n\n<p>At UBS, Mr. Gray worked with a variety of information technology companies, including those focused on network and data communications security, software, and services. There he raised capital, including public equity for CrossKeys, Galileo International, Perot Systems, and the Titan Corporation, and private capital for high growth companies such as Candescent Technologies, Curl, and Tessera.</p>\n\n<p>Previously, Mr. Gray was a U.S. Air Force officer in the information operations and special technical operations communities, including assignments for various U.S. government agencies in positions pertaining to information warfare, strategic communications, satellite operations, and network warfare. He currently is a reservist assigned as a Joint Staff liaison officer within the directorate of global information operations. His military experience offers clients a unique perspective and in-depth understanding of the government market, especially in defense technologies, from which to advise them.</p>\n\n<p>Mr. Gray holds a BS from the United States Air Force Academy in Colorado Springs, and an MBA from the University of Chicago&#8217;s Graduate School of Business.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0004/6915/46915v1-max-150x150.jpg"],[[125,175],"assets/images/resized/0004/6915/46915v1-max-250x250.jpg"],[[125,175],"assets/images/resized/0004/6915/46915v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BS","subject":"","institution":"United States Air Force Academy","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}