{"first_name":"Basit","last_name":"Mustafa","permalink":"basit-mustafa","crunchbase_url":"http://www.crunchbase.com/person/basit-mustafa","homepage_url":"","birthplace":"Minneapolis, MN","twitter_username":"basitmustafa","blog_url":"","blog_feed_url":"","affiliation_name":"40 North LLC","born_year":1981,"born_month":12,"born_day":31,"tag_list":"","alias_list":null,"created_at":"Thu Jan 06 10:20:55 UTC 2011","updated_at":"Fri Oct 28 00:01:22 UTC 2011","overview":"<p>Basit Mustafa is currently Founder &amp; CEO of wu-way, inc., a Boulder-based technology startup focused on automation &amp; data integration of web and cloud services. </p>\n\n<p>Mr. Mustafa has previously held several positions at IBM. </p>\n\n<p>Beginning his career as a Software Engineer at IBM at 18 years old, Mr. Mustafa simultaneously attended the University of Colorado in Boulder, CO. Mr. Mustafa architected and implemented several key internal IT projects for process automation, improvement, and contributed to several hardware and software products, including the first XML-aware search engine/database for software automation before accepting a position within IBM consulting for the Federal Reserve Bank&#8217;s Check 21/IRD project. </p>\n\n<p>Upon completion of his work with the Federal Reserve Bank, Mr. Mustafa was appointed as leader of Worldwide Sales Operations for the IBM Printing Systems Division with responsibility for managing CRM, Analytics, Business Intelligence, and reporting processes for the General Manager and CFO of the division. Reporting directly to the division CFO, Mr. Mustafa was also simultaneously tasked with leading the due diligence and divestiture planning for the CRM and Business Intelligence processes/platforms for then-confidential divestiture negotiations of the IBM Printing Systems division into an IBM-Ricoh Joint Venture.</p>\n\n<p>During this 12 month period, Mr. Mustafa led a cross-functional team to define, triage, and recommend how the division&#8217;s CRM &amp; BI processes &amp; platforms would be separated most effectively.</p>\n\n<p>Upon approval of the divestiture, Mr. Mustafa assumed responsibility for defining, developing, and deploying the new Joint Venture&#8217;s sales process, reporting, and CRM system. Under his leadership, the CRM, sales process, and reporting teams all delivered ready-for-production business processes and supporting systems ahead of schedule and within all applicable budgets. </p>\n\n<p>Shortly after the launch of the Joint Venture, branded as the Ricoh|IBM InfoPrint Solutions Company, Mr. Mustafa was selected to drive business development &amp; displace entrenched competitors in high-end production printing in the Mountain States territory, where IBM Printing Systems had not had a direct sales management team in over a decade (Colorado, Utah, Wyoming, Idaho, New Mexico, Oklahoma, and Montana). </p>\n\n<p>In March of 2010, Mr. Mustafa left the InfoPrint Solutions Company and soon founded wu-way, inc. to focus on his vision of a world where technology functions &amp; relates to people, businesses, and teams in a more natural, goal-oriented fashion. He is currently busy launching wu-way&#8217;s first product.</p>\n\n<p>Mr. Mustafa currently resides in Boulder, CO. When he isn&#8217;t engaged with professional pursuits, he enjoys ultra-running and is highly involved in the community through his non-profit advocacy at the ACLU, KGNU Community Radio, and the local fire/rescue/EMS community.</p>\n\n<p>In 2011, Mr. Mustafa was elected to the ACLU of Boulder County&#8217;s Board of Directors. He also serves on the Finance, Audit, and Budget committee for the ACLU of Colorado. </p>\n\n<p>In 2007, Mr. Mustafa was appointed to the Board of Directors of KGNU Radio 88.5FM and 1390AM. With his previous experience in consulting with KGNU on pro-bono business development, strategic planning, and analytics work, Mr. Mustafa took an interest in strategic leadership at the organization and was elected executive treasurer in late 2007 and has brought his professional experience to KGNU as a transformational leader, manager, and financial officer. He is currently serving through his second term on the board through 2013.</p>\n\n<p>From 2004-2008 Mr. Mustafa served as a firefighter on the Louisville Fire Protection District and was certified to the National Fire Protection Association/IFSTA Firefighter II, Fire Instructor, and Fire Officer I levels. As a volunteer firefighter &amp; company officer in charge on an all-volunteer department serving over 1600 incidents a year, Mr. Mustafa worked on or commanded the first-due engine company to all emergency calls during his scheduled shift hours. He also holds or previously held and maintained various industry certifications including: HazMat Operations, Emergency Medical Technician, Public Safety Diver, Technical Rope Rescue Technician III, National Incident Command System (NIMS), and Scott Self-Contained Breathing Apparatus Repair Technician. </p>\n\n<p>Despite having a passion for his work at wu-way and his volunteerism in the community, he enjoys finding the time to travel, ski, and run ultra-marathon distances throughout the Colorado and Utah high country.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0011/6357/116357v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0011/6357/116357v2-max-250x250.jpg"],[[450,450],"assets/images/resized/0011/6357/116357v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder & CEO","firm":{"name":"wu-way, inc.","permalink":"wu-way-inc","type_of_entity":"company","image":null}},{"is_past":true,"title":"Founder","firm":{"name":"40 North LLC","permalink":"40-north-llc","type_of_entity":"company","image":null}},{"is_past":true,"title":"Territory Manager","firm":{"name":"InfoPrint Solutions Company","permalink":"infoprint-solutions-company","type_of_entity":"company","image":null}},{"is_past":true,"title":"Software Architect","firm":{"name":"IBM","permalink":"ibm","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0002/1370/21370v1-max-150x150.png"],[[170,68],"assets/images/resized/0002/1370/21370v1-max-250x250.png"],[[170,68],"assets/images/resized/0002/1370/21370v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Worldwide Sales Operations Leader","firm":{"name":"IBM","permalink":"ibm","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0002/1370/21370v1-max-150x150.png"],[[170,68],"assets/images/resized/0002/1370/21370v1-max-250x250.png"],[[170,68],"assets/images/resized/0002/1370/21370v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/basitmustafa","title":"Twitter"}]}