{"first_name":"Bassam","last_name":"Tabbara","permalink":"bassam-tabbara","crunchbase_url":"http://www.crunchbase.com/person/bassam-tabbara","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue May 05 05:18:08 UTC 2009","updated_at":"Thu Oct 08 00:45:38 UTC 2009","overview":"<p>Bassam developed his first software game at the age of 11 and sold his first software product (a utility that removed the first generation of computer viruses) at the age of 16. An avid technologist, he has worked on many diverse projects relating to web platforms, databases, semantic web, operating systems, distributed systems and systems management. Bassam has always sought out startup opportunities where he can develop new technology and transition it to a successful release.</p>\n\n<p>Bassam joined Microsoft Research in 1995 where he co-invented a web platform for Microsoft&#8217;s early foray into the web. He successfully transitioned the technology into Sidewalk.com where he developed and shipped multiple versions of the popular local search and advertising web service which eventually was sold to CitySearch.com. The underlying web platform continues to be used today by msn, msnbc and microsoft.com among others. Applying lessons from running such mega services, Bassam returned to Microsoft Research where he co-founded a small team passionate about reducing the complexity and cost of operating large-scale IT systems. After a successful prototype and senior executive endorsement, the project was transitioned into the Windows division where it became the Dynamic Systems Initiative (DSI) spanning three flagship products (Windows, Visual Studio and System Center). Bassam served as a lead architect where he was responsible for implementing the model-based technology (SML) at the core of DSI, consulting with executives on strategy, and garnering industry support. Bassam was the original author of the SML spec that, along with 11 major industry players, was submitted to the W3C for standardization. He co-developed technology that shipped as part of Windows Server 2003, Windows Vista, Visual Studio 2005, and System Center.</p>\n\n<p>Bassam is a co-inventor of 22 US and international patents. He received his B.S in Computer Engineering from the University of Florida.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Technology Officer & Co-founder","firm":{"name":"Symform","permalink":"symform","type_of_entity":"company","image":{"available_sizes":[[[150,35],"assets/images/resized/0004/3195/43195v1-max-150x150.png"],[[217,51],"assets/images/resized/0004/3195/43195v1-max-250x250.png"],[[217,51],"assets/images/resized/0004/3195/43195v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}