{"first_name":"Beau","last_name":"Laskey","permalink":"beau-laskey","crunchbase_url":"http://www.crunchbase.com/person/beau-laskey","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Feb 07 13:30:14 UTC 2008","updated_at":"Fri Oct 16 21:51:05 UTC 2009","overview":"<p>Beau Laskey is a Managing Director of Steamboat Ventures. Beau has spent the last 15 years in technology, finance and operational leadership roles. Prior to joining Steamboat, Beau was a Managing Director of EDF Ventures in San Diego, an early stage venture capital fund. He focused on media, entertainment and consumer infrastructure technologies. As a board member and early stage venture investor, Beau led numerous investments in these areas. In the consumer and entertainment infrastructure sector, Beau invested in Zyray Wireless, the leading provider of 3G WCDMA baseband chipsets, acquired by Broadcom (NASDAQ: BRCM); Clarity Technologies, the key provider of Bluetooth noise cancellation technology, acquired by Cambridge Silicon Radio (LSE: CSR); RockeTalk, a consumer mobile handset social media platform; and Greenplum, an open source-powered data warehousing platform for the Web. In the media infrastructure sector, Beau invested in Arbor Networks, the top provider of DDoS mitigation solutions and anomaly detection for large media networks; Arxan Technologies, the premier solution against digital piracy, software reverse engineering, and any manner of code theft; Alfalight, high-power diode lasers that drive the Web, acquired by Arasor (ASX: ASR); VoEx, provider of VoIP-based enhanced media telephony services; and Xtera Communications, an all-Raman amplification system for video distribution, live video production and digital cinema. Early in his career, Beau was an officer in the SEAL Teams and completed deployments with SEAL Team One and Eight to Southeast Asia, the Middle East and the Mediterranean. He has received numerous leadership, academic, and service awards throughout his career. Beau received a BS in Economics and General Engineering with Merit as a graduate of the US Naval Academy in 1992, and received an MBA with Distinction in Entrepreneurship and Corporate Strategy from The University of Michigan Business School in 1999.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chairman","firm":{"name":"Photobucket, Corp.","permalink":"ontela","type_of_entity":"company","image":{"available_sizes":[[[150,25],"assets/images/resized/0002/1122/21122v4-max-150x150.png"],[[250,41],"assets/images/resized/0002/1122/21122v4-max-250x250.png"],[[450,75],"assets/images/resized/0002/1122/21122v4-max-450x450.png"]],"attribution":null}}},{"is_past":null,"title":"Managing Director","firm":{"name":"Steamboat Ventures","permalink":"steamboat-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,42],"assets/images/resized/0001/0582/10582v1-max-150x150.png"],[[224,64],"assets/images/resized/0001/0582/10582v1-max-250x250.png"],[[224,64],"assets/images/resized/0001/0582/10582v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Director","firm":{"name":"Ground Truth","permalink":"ground-truth","type_of_entity":"company","image":{"available_sizes":[[[150,51],"assets/images/resized/0007/4796/74796v2-max-150x150.jpg"],[[150,51],"assets/images/resized/0007/4796/74796v2-max-250x250.jpg"],[[150,51],"assets/images/resized/0007/4796/74796v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}