{"first_name":"Bechir","last_name":"BenSaid","permalink":"bechir-bensaid","crunchbase_url":"http://www.crunchbase.com/person/bechir-bensaid","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"eCoast Sales Solutions","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Aug 04 17:12:20 UTC 2008","updated_at":"Sun Aug 24 23:36:42 UTC 2008","overview":"<p>Prior to joining eCoast Bechir spent three years at Pannaway Technologies as Vice President of Operations. Before that, Bechir was with Cabletron Systems for six years, both in Rochester, NH and Beijing, China. In the home office Bechir served in several management positions in Finance and Operations, most recently as Director of Operations and Planning for Enterasys Networks, one of Cabletron&#8217;s spin-off companies. While in Beijing, Bechir was the Managing Director for Cabletron, China.</p>\n\n<p>Before joining Cabletron, Bechir spent five years in Software Engineering and led the design of the Vermont State Lottery database and security systems. After that, Bechir spent two years as IT Director overseeing the lottery&#8217;s system development, network management, and real-time transaction systems.</p>\n\n<p>Bechir holds a MBA with honors from Thunderbird and a MS in Computer Science from UVM. Bechir received his BE in Computer Engineering from Tsinghua University in Beijing, China. He also holds a Diploma in Advanced Chinese Studies from the Beijing Foreign Studies Institute and is fluent in Chinese, French, and Arabic.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Vice President of Operations","firm":{"name":"eCoast","permalink":"ecoast-sales-solutions","type_of_entity":"company","image":{"available_sizes":[[[150,35],"assets/images/resized/0002/3267/23267v4-max-150x150.png"],[[250,59],"assets/images/resized/0002/3267/23267v4-max-250x250.png"],[[422,100],"assets/images/resized/0002/3267/23267v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}