{"first_name":"Becki","last_name":"Burrows","permalink":"becki-burrows","crunchbase_url":"http://www.crunchbase.com/person/becki-burrows","homepage_url":"http://www.ohdearyme.com","birthplace":"Midlands","twitter_username":"ohdearyme","blog_url":"http://www.myspace.com/ohdearyme","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1980,"born_month":12,"born_day":12,"tag_list":"becki-burrows, ohdearyme","alias_list":null,"created_at":"Fri Jan 22 13:23:28 UTC 2010","updated_at":"Mon Aug 15 21:35:12 UTC 2011","overview":"<p>www.OhDearyMe.com is a video blog created out of anger, passion, fun, pain and the craving for excitement. A response to being told NO. You can’t.</p>\n\n<p>In the year 2007 Becki found herself frustrated.. working in a temp job.. bored with the 9 til 5. So decided to create a video blog. To go to festivals, blag it backstage.. interview musicians and make her own music show. What an idea. What an adventure. It will never work. With no budget… with help from friends and encouragement from virtual festivals she produced/directed/edited and presented an online music show that was online within 24 hours of the festival finishing. The only requirement: to be back at her desk by 9am Monday morning…</p>\n\n<p>During 2007 and 2008 she managed to blag it backstage at 20 festivals. She has gone on to be shortlisted for a CH4 Talent Award two years in a row and to win the prize for the Pepsi Maxcast Competition (www.pepsimaxcast.net) and the Vodafone Myspace Reporter prize where she got through three rounds of voting for her short film and won the ultimate prize to fly to New York to interview Usher. She also came 2nd in a Global youtube competition for young filmmakers for England.</p>\n\n<p>Since these competitions she has been further commissioned by Vodafone and Sony Ericsson to promote their brand online.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}