{"first_name":"Ben","last_name":"Shih","permalink":"ben-shih","crunchbase_url":"http://www.crunchbase.com/person/ben-shih","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 14 13:40:41 UTC 2008","updated_at":"Sun Nov 16 18:59:39 UTC 2008","overview":"<p>Ben Shih is a principal of JAFCO Ventures. He joined our firm in 2003 as an associate, bringing eight years of technology operations and private equity investing experience. Ben enjoys thinking very broadly about technology markets and then diving into the details of a business plan or product road map to develop a rich understanding of investment opportunities. He has been instrumental in providing our firm with the highest levels of both deal and operational support. Portfolio companies for which Ben has been actively involved include The 41st Parameter, ClairMail, DATAllegro (acquired by Microsoft), Infinera (INFN) and Symwave.</p>\n\n<p>Prior to joining JAFCO, Ben first began his venture capital career as an associate with Crystal Ventures. Before that, he was an analyst for MDT Advisers, a quantitative asset management firm with $6.7 billion under management. At MDT, Ben was a key member of the team that developed and managed a quantitative hedge fund strategy. Earlier in his career, Ben worked in software development at Lotus.</p>\n\n<p>Ben earned an MBA from the Stanford Graduate School of Business, where he was an Arjay Miller Scholar. He received Master of Engineering and Bachelor of Science degrees in electrical engineering and computer science, along with a Bachelor of Science degree in management science, at the Massachusetts Institute of Technology.</p>","image":{"available_sizes":[[[150,105],"assets/images/resized/0002/8689/28689v1-max-150x150.jpg"],[[157,110],"assets/images/resized/0002/8689/28689v1-max-250x250.jpg"],[[157,110],"assets/images/resized/0002/8689/28689v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Principal","firm":{"name":"Jafco Ventures","permalink":"jafco-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,30],"assets/images/resized/0000/3562/3562v1-max-150x150.png"],[[175,35],"assets/images/resized/0000/3562/3562v1-max-250x250.png"],[[175,35],"assets/images/resized/0000/3562/3562v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}