{"first_name":"Ben","last_name":"Brooks","permalink":"ben-brooks","crunchbase_url":"http://www.crunchbase.com/person/ben-brooks","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Dec 01 12:20:46 UTC 2008","updated_at":"Mon Dec 01 12:21:48 UTC 2008","overview":"<p>Ben Brooks is one of the leading Research Triangle area investment executives and brings over 20 years of experience in working with entrepreneurial companies. Ben is the Founding Partner of Southern Capitol Ventures and also serves as Director of Strategy for Capital Investment Group. He formerly served as a Senior Vice President for Josephthal &amp; Co., a New York based investment banking and brokerage firm, which is now Oppenheimer (NYSE:OPY). Before joining Josephthal, Ben was Chief Executive Officer for Marion Bass Securities where he orchestrated the sale of Marion Bass&#8217; retail business to Josephthal. Prior to his position as CEO, he was Director of Investment Banking where he successfully completed numerous acquisition and capital placement transactions with companies like SciQuest.</p>\n\n<p>Ben currently serves on the executive board of The Atlantis Group and the steering committee for exeCConnect. He also served as a board observer for ChannelAdvisor and as a board member for FullSeven Technologies, which was acquired by Research Triangle Software in early 2004. Ben is active in the community and is on the venture capital board for Elon University and served on the advisory board for the Raleigh Rescue Mission. He received his undergraduate degree from the University of North Carolina at Chapel Hill and graduated from the Fuqua School of Business at Duke University with a Masters in Business Administration.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founding Partner","firm":{"name":"Southern Capitol Ventures","permalink":"southern-capitol-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,39],"assets/images/resized/0003/0447/30447v1-max-150x150.jpg"],[[250,65],"assets/images/resized/0003/0447/30447v1-max-250x250.jpg"],[[267,70],"assets/images/resized/0003/0447/30447v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}