{"first_name":"Ben","last_name":"Choi","permalink":"ben-choi","crunchbase_url":"http://www.crunchbase.com/person/ben-choi","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Storm Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Dec 03 13:26:23 UTC 2008","updated_at":"Thu Oct 28 15:52:57 UTC 2010","overview":"<p>Ben focuses on information technology investments at Storm Ventures with a specific interest in the mobile, Internet, and software sectors. </p>\n\n<p>He is actively involved with Storm portfolio companies including Ad Infuse, Adgregate Markets, DeviceVM, Marketo, and YieldBuild.</p>\n\n<p>Prior to Storm, Ben served as VP Strategy at Greystripe, an ad-supported mobile game distribution company. He began his career in venture capital at RRE Ventures, where he helped source and lead their investment in Massive Incorporated,and in-game ad network purchased by Microsoft in 2006. He later joined the venture capital arm of the CIA, In-Q-Tel, where he focused on investments strategic to the US intelligence community.</p>\n\n<p>Prior to venture capital, Ben held operating roles in several technology startups. As a product manager at Yahoo, he directed the Southeast Asia mobile strategy and launched several groundbreaking mobile services. Ben was also an Engagement Manager and early employee at ZEFER, an Internet consulting firm (acquired by NEC), which raised over $150M in venture capital financing and grew to over $100M in annual revenue. Prior to ZEFER, Ben was a product manager at DESoFT, an online brokerage ASP (acquired by Merrill Lynch).</p>\n\n<p>Ben received his B.A. in Computer Science with honors from Harvard University, and his M.B.A. from Columbia Business School, with Dean&#8217;s List and Beta Gamma Sigma distinctions. Ben is also a graduate of the Kauffman Fellows Program, an exclusive professional organization for the venture capital industry.</p>\n\n<p>When not geeking out on the latest technology, Ben is an avid traveler and a published amateur digital photographer. If you want to reach Ben, try his profile on LinkedIn to get a warm introduction from someone he already knows and trusts. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Principal","firm":{"name":"Maveron","permalink":"maveron","type_of_entity":"financial_org","image":{"available_sizes":[[[150,62],"assets/images/resized/0000/3055/3055v11-max-150x150.png"],[[231,96],"assets/images/resized/0000/3055/3055v11-max-250x250.png"],[[231,96],"assets/images/resized/0000/3055/3055v11-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Principal","firm":{"name":"Storm Ventures","permalink":"storm-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,64],"assets/images/resized/0001/5089/15089v1-max-150x150.png"],[[250,107],"assets/images/resized/0001/5089/15089v1-max-250x250.png"],[[301,129],"assets/images/resized/0001/5089/15089v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/bchoi","title":""}]}