{"first_name":"Ben","last_name":"Edmond","permalink":"ben-edmond","crunchbase_url":"http://www.crunchbase.com/person/ben-edmond","homepage_url":"http://www.fiberlight.com","birthplace":"New York","twitter_username":"edmondb1","blog_url":"","blog_feed_url":"","affiliation_name":"FiberLight","born_year":1974,"born_month":3,"born_day":14,"tag_list":"fiberlight, dark-fiber, optical-networks, networking, fiber, ethernet, wavelengths, sonet","alias_list":null,"created_at":"Fri Feb 04 18:30:58 UTC 2011","updated_at":"Wed Feb 09 18:21:43 UTC 2011","overview":"<p>Mr. Edmond was named Executive Vice President of Sales and Marketing at FiberLight in December 2008 after joining the company in March 2008 as Senior Vice President of Sales and Marketing. Mr. Edmond manages a national carrier and enterprise sales team in 15 metro markets and conducts daily operations in customer and account development and service as well as managing all customer proposals, and pre- and post-sales activities. In addition, Mr. Edmond is responsible for the implementation of all marketing activities as well as new product development including applications, packaging and promotional efforts.</p>\n\n<p>Prior to joining FiberLight, Mr. Edmond owned Telecom Inventory, a consulting firm focusing on services for large enterprises requiring better access and use of telecommunications information. Mr. Edmond’s telecom experience includes eight years experience with FiberLight’s predecessor company, Xspedius Communications (formerly ACSI), where he held several leadership positions. Mr. Edmond has more than 13 years experience in the telecommunications industry with a progression of sales, marketing and managerial experiences. He has a Master of Science degree in Business from St. Louis University and a Bachelor of Science degree in International Business from Northeastern University.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0012/0559/120559v2-max-150x150.jpg"],[[200,250],"assets/images/resized/0012/0559/120559v2-max-250x250.jpg"],[[360,450],"assets/images/resized/0012/0559/120559v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"EVP of Sales & Marketing","firm":{"name":"FiberLight","permalink":"fiberlight","type_of_entity":"company","image":{"available_sizes":[[[150,37],"assets/images/resized/0016/2247/162247v1-max-150x150.jpg"],[[250,63],"assets/images/resized/0016/2247/162247v1-max-250x250.jpg"],[[301,76],"assets/images/resized/0016/2247/162247v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}