{"first_name":"Ben","last_name":"Kortlang","permalink":"ben-kortlang","crunchbase_url":"http://www.crunchbase.com/person/ben-kortlang","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 28 17:13:44 UTC 2008","updated_at":"Thu May 29 00:10:20 UTC 2008","overview":"<p>Ben Kortlang is a Partner with Kleiner Perkins Caufield &amp; Byers where he focuses on growth-stage greentech investing.</p>\n\n<p>Prior to KPCB, Ben worked at Goldman Sachs for 8 years, most recently co-heading Goldman&#8217;s Alternative Energy Investing business. In this capacity Ben managed Goldman&#8217;s multi-billion dollar portfolio of alternative energy investments including Horizon Wind Energy, SunEdison, First Solar and Iogen.</p>\n\n<p>Prior to this, Ben led the private equity investing business within Goldman&#8217;s Special Situations Group, before which he was a Vice President in Goldman&#8217;s investment banking group focusing on Industrials and Natural Resources.</p>\n\n<p>Prior to joining Goldman Sachs, Ben was an Associate with A.T. Kearney where he focused on strategic and operations consulting in the energy, manufacturing, packaging, transportation and communications industries. Before A.T. Kearney, Ben was a Business Analyst at National Australia Bank in strategic planning and macroeconomic forecasting.</p>\n\n<p>Ben holds a Bachelor of Business (Economics &amp; Finance) from RMIT University, a Bachelor of Commerce and an Honors degree in Econometrics from University of Melbourne and an MBA from the University of Michigan.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Kleiner Perkins Caufield & Byers","permalink":"kleiner-perkins-caufield-byers","type_of_entity":"financial_org","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/0998/10998v8-max-150x150.jpg"],[[250,250],"assets/images/resized/0001/0998/10998v8-max-250x250.jpg"],[[450,450],"assets/images/resized/0001/0998/10998v8-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}