{"first_name":"Benjamin","last_name":"Chen","permalink":"benjamin-chen","crunchbase_url":"http://www.crunchbase.com/person/benjamin-chen","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Mochila","born_year":null,"born_month":null,"born_day":null,"tag_list":"startup, entrepreneur, technology, media, online-advertising, martial-artist","alias_list":null,"created_at":"Tue Feb 26 17:32:22 UTC 2008","updated_at":"Mon Sep 19 03:04:23 UTC 2011","overview":"<p>Benjamin Chen is a leader in business and technology management, with over 25 years of experience in working with both startups and fortune companies, focused on media, online advertising, interactive agency, enterprise software, accounting, content management systems, networking and data centers.</p>\n\n<p>Mr. Chen is the Founder and CEO of Mochila, a leading content and syndication platform for delivering customized solutions for brand advertisers and premium publishers.</p>\n\n<p>Mr. Chen has worked as an external entrepreneur in residence for both JP Morgan and Mission Ventures as well as acted as an advisor conducting due diligence on many new business models and technologies for GE Capital. At iXL, a strategic interactive agency (now part of Publicis Groupe), Mr. Chen was the global CTO and CIO responsible for all internal and external technology initiatives, as well as leading the due diligence in the acquisition and integration of over 30 companies, helping grow the company in three years from 60 to 3,000 people, with offices in the US, Europe and Asia. Client engagements included work for AT&amp;T, Delta Airlines, Federal Express, GE and Sony. He was part of the management team that took iXL public in 1999, with a market capitalization of over 4 billion.</p>\n\n<p>Mr. Chen was Founder and CEO of AppGenesys, CTO for Boxtop Interactive and Founder and CTO of Ironlight Digital (bought by Publicis Groupe). Mr. Chen also worked at CBS Studio Center, as a technologist working on some of the first convergence of prime time television content and the internet. Mr. Chen produced the 1996 Emmy Awards Cybercast.</p>\n\n<p>Mr. Chen is on the board of Function (X) Inc. (FNCX).</p>\n\n<p>Mr. Chen is frequently invited as a speaker and panelist to new media, technology and venture conferences.</p>\n\n<p>Mr. Chen is a graduate from the University of Southern California and is an avid martial artist with a Black Belt in Tae Kwon Do and Hapkido</p>","image":{"available_sizes":[[[150,93],"assets/images/resized/0015/4242/154242v2-max-150x150.jpg"],[[250,156],"assets/images/resized/0015/4242/154242v2-max-250x250.jpg"],[[450,281],"assets/images/resized/0015/4242/154242v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder, Chairman & CEO","firm":{"name":"Mochila","permalink":"mochila","type_of_entity":"company","image":{"available_sizes":[[[150,39],"assets/images/resized/0001/3783/13783v1-max-150x150.png"],[[196,51],"assets/images/resized/0001/3783/13783v1-max-250x250.png"],[[196,51],"assets/images/resized/0001/3783/13783v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"http://www.beet.tv/2009/09/mochilla-defines-new-approach-to-video-syndication-.html","description":"<p>Benjamin Chen talks about Mochila</p>"}],"external_links":[],"web_presences":[{"external_url":"http://www.TheLawofPhysics.net","title":"The Law of Physics"},{"external_url":"http://www.linkedin.com/in/benjaminchen88","title":"Linkedin"},{"external_url":"http://about.me/benjaminchen","title":"About.me"},{"external_url":"http://twitter.com/BenjaminChen88","title":"Twitter"}]}