{"first_name":"Benjamin","last_name":"Belinka","permalink":"benjamin-belinka","crunchbase_url":"http://www.crunchbase.com/person/benjamin-belinka","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 23 07:30:08 UTC 2009","updated_at":"Tue Jun 23 07:30:59 UTC 2009","overview":"<p>The President and CEO of Actinobac Biomed is Dr. Benjamin Belinka.  Dr. Belinka obtained his Ph.D. in chemistry from State University of NY at Binghamton and has over 25 years of experience in the pharmaceutical and biotechnology industry as both a scientist and executive. .Beginning his career at Sandoz Pharmaceuticals (now Novartis) in 1981, where he supervised process research and development laboratories in both the United States and Switzerland, Dr. Belinka extensively participated in all aspects of the preclinical development of a number of drug candidates designed to combat a variety of disease indications. After moving to Cytogen Corporation six years later, Dr. Belinka, as Assistant Director of Preclinical Research &amp; Chemistry, managed research laboratories and supported the advancement of the company’s diagnostic and bone pain agents through  preclinical and clinical development. Joining VectraMed, Inc. in 1998 as its Director of Chemistry and later as Vice President, Dr. Belinka was responsible for designing the company’s proprietary drug delivery technology, organizing and setting up its research facilities, and negotiating cooperative research programs with major pharmaceutical organizations such as  (Elan, Pfizer, Ethicon, &amp; Aventis) providing over $7 million in revenue.  In 2005, Dr. Belinka established Ben Belinka, LLC to provide consulting services to the academic, pharmaceutical, biotechnology, and chemical industries working at Fisher Scientific, UMDNJ, and Virium Pharmaceuticals..Dr. Belinka has more than a dozen scientific publications and abstracts and 13 patents.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Actinobac Biomed","permalink":"actinobac-biomed","type_of_entity":"company","image":{"available_sizes":[[[150,72],"assets/images/resized/0005/0275/50275v1-max-150x150.jpg"],[[250,121],"assets/images/resized/0005/0275/50275v1-max-250x250.jpg"],[[450,217],"assets/images/resized/0005/0275/50275v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}