{"first_name":"Benjamin","last_name":"Black","permalink":"benjamin-black","crunchbase_url":"http://www.crunchbase.com/person/benjamin-black","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"CloudCrowd","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 27 21:12:52 UTC 2010","updated_at":"Mon Sep 13 17:50:56 UTC 2010","overview":"<p>Ben Black has been investing across sectors and stages for the last decade.  Most recently, Ben is purchasing secondary shares in growing technology companies under the banner of Akkadian Ventures (www.akkadianventures.com).  </p>\n\n<p>Ben Black is also the co-founder and General Partner of New Cycle Capital, an early stage venture capital fund in San Francisco. Ben has a decade of venture capital experience on the investment teams at Maveron, a consumer-focused venture capital firm founded by Howard Schultz, the Chairman of Starbucks, and Rosewood Capital, a consumer-focused private equity firm. As an entrepreneur, Ben was VP of Corporate Development for a team that transformed Harris Interactive into the leading internet-based market research firm, culminating into a successful IPO and currently generating more than $250M in revenue. He is currently on the Board of Directors of Citizenhawk, The Villa, Debtgoal.com, and People Power.   His other investments include oPower, Allconnect, Cloudmark, and Telephia.  </p>\n\n<p>By training, Ben is an attorney and worked at Latham &amp; Watkins after clerking on the Federal Court of Appeals for the First Circuit in 1997. Black earned both his Bachelors of Arts and his Juris Doctor degrees at Cornell University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Board of Directors","firm":{"name":"CloudCrowd","permalink":"cloudcrowd","type_of_entity":"company","image":{"available_sizes":[[[150,47],"assets/images/resized/0006/2869/62869v3-max-150x150.png"],[[150,47],"assets/images/resized/0006/2869/62869v3-max-250x250.png"],[[150,47],"assets/images/resized/0006/2869/62869v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}