{"first_name":"Bennett","last_name":"Freeman","permalink":"bennett-freeman","crunchbase_url":"http://www.crunchbase.com/person/bennett-freeman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 08 08:49:15 UTC 2009","updated_at":"Mon Jun 08 08:59:38 UTC 2009","overview":"<p>Mr. Freeman leads Calvert&#8217;s Social Research Department and directs its company research and analysis as well as its policy and advocacy work. From 2003 until early 2006, he led Burson-Marsteller&#8217;s Global Corporate Responsibility practice advising multinationals on policy development, stakeholder engagement and communications strategies related to human rights, labor rights and sustainable development. During the Clinton Administration he served in three positions as a political appointee in the State Department, most recently as Deputy Assistant Secretary for Democracy, Human Rights and Labor from 1999 to early 2001. In that capacity, he led the development of the Voluntary Principles on Security and Human Rights, the first human rights standard forged by governments, companies and NGOs for the extractive sectors. Previously he was Senior Advisor to Under Secretary of State for Economic and Business Affairs Stuart Eizenstat, and Deputy Assistant Secretary of State for Public Affairs and Chief Speechwriter for Secretary of State Warren Christopher. Earlier in his career he was Manager-Corporate Affairs for General Electric and a presidential campaign aide to former Vice President Walter Mondale. He currently serves on the Board of Directors of Oxfam America, the Board of the Extractive Industry Transparency Initiative, and on the Steering Committee of Amnesty International USA&#8217;s Business and Human Rights program. A member of the Council on Foreign Relations, Mr. Freeman earned an MA in Modern History from Oxford and an AB in History from Berkeley.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0004/7308/47308v1-max-150x150.jpg"],[[125,175],"assets/images/resized/0004/7308/47308v1-max-250x250.jpg"],[[125,175],"assets/images/resized/0004/7308/47308v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MA","subject":"Modern History","institution":"Oxford","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Senior Vice President","firm":{"name":"Calvert Social Venture Partners","permalink":"calvert-social-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,47],"assets/images/resized/0004/7304/47304v1-max-150x150.jpg"],[[183,58],"assets/images/resized/0004/7304/47304v1-max-250x250.jpg"],[[183,58],"assets/images/resized/0004/7304/47304v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}