{"first_name":"Benny","last_name":"Klepach","permalink":"benny-klepach","crunchbase_url":"http://www.crunchbase.com/person/benny-klepach","homepage_url":"","birthplace":"","twitter_username":"BennyKlepach","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Aug 21 15:07:13 UTC 2012","updated_at":"Thu Aug 23 19:04:36 UTC 2012","overview":"<p>A Man Of Great Ambition</p>\n\n<p>If you have every bought anything mid-flight, chances are good that Benny Klepach is to thank for your comfort in one way or the other. There is so much more to Benny that meets the eye however. </p>\n\n<p>Mr. Klepach is a business man whose traits have brought him success as a business man and an unsung hero to many. Benny is the founder of DFASS which stands for Duty Free Air and Ship Supply. Benny&#8217;s company provides shopping and concessions at airports and items during flight. </p>\n\n<p>DFASS and Benny Klepach Provide A Much Needed Service</p>\n\n<p>The in-flight services that are offered by DFASS is something that was and still is much needed in the flight industry. Providing a service that allows passengers to buy things from their seat has improved the airline experience greatly. Benny and his employees understand the needs and wants of passengers and strive to provide them with the highest quality products and services. </p>\n\n<p>A Charitable Business Man</p>\n\n<p>When it comes to charitable activity Benny Klepach is a giver. Labeled as a charitable man by both his industry and peers, Benny gives to many charitable organizations. Children are close to his heart as are their charities. Benny supports St. Jude’s Children&#8217;s Hospital, Hand in Hand for Haiti and many other charities which help to give children a good start to life. </p>\n\n<p>Benny is a firm believer in giving and makes it a point to give often. He investigates his charity and wants to make sure that they measure up to what he feels a charity should. That being said, once he starts to give, his flow is ongoing. </p>\n\n<p>The Sky&#8217;s The Limit</p>\n\n<p>As the leader of the world&#8217;s largest in-flight retailer Benny knows that the sky is the limit and shows it in his work ethic and service. Benny is an industry leader because he understands the needs of the customer. Keeping passengers happy is Benny&#8217;s number one goal.</p>\n\n<p>Six Hundred Plus Employees Can&#8217;t Be Wrong</p>\n\n<p>Benny Klepach has over six hundred full time employees who follow his passion with as much gusto as himself. His unmatched reputation and years of hard work have made him a true leader in his industry worldwide.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/7247/207247v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/7247/207247v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/7247/207247v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}