{"first_name":"Bernie","last_name":"Slome","permalink":"bernie-slome","crunchbase_url":"http://www.crunchbase.com/person/bernie-slome","homepage_url":"http://www.sales-and-marketing.net","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Sep 27 20:47:10 UTC 2010","updated_at":"Fri Oct 08 19:07:58 UTC 2010","overview":"<p>I am a sales executive and my passion is helping companies grow. I do this by thinking outside the box, recognizing the right opportunities, being an innovator, developing talent, exceeding goals, presenting value and using a Golden Rolodex. My track record shows consistent double digit sales and profit increases.</p>\n\n<p>Named one of the 50 most powerful people in the multimedia industry, I am a leader, a builder, a problem-solver and a motivator who has built sales forces and companies.</p>\n\n<p>I built a company from the ground up. From start to finish, I oversaw its transformation from an idea into a profitable $100M business.</p>\n\n<p>Over the course of my career, I have consulted and raised millions of dollars for companies in the US and the UK, with a particular emphasis on the IT and biotechnology sectors.</p>\n\n<p>I have worked with Fortune 500 companies to measure, manage, analyze and improve their customer service, customer satisfaction and customer loyalty.</p>\n\n<p>I have been a frequent speaker and panelist at the Software Publishers Association (SPA) conferences, have hosted a weekly radio talkshow and have also authored several trade publication articles.\nSpecialties</p>\n\n<p>Strategic thinker, leader and planner who has developed multi-million dollar sales programs with national retailers, brands and government entities. A proactive executive with a consistent record for developing and implementing proven business strategies while increasing bottom-line revenue and achieving profit-driven goals. A golden rolodex has led to many successes.</p>","image":{"available_sizes":[[[96,150],"assets/images/resized/0010/3308/103308v2-max-150x150.jpg"],[[161,250],"assets/images/resized/0010/3308/103308v2-max-250x250.jpg"],[[290,450],"assets/images/resized/0010/3308/103308v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}