{"first_name":"Bernhard","last_name":"Hoetzl","permalink":"bernhard-hoetzl","crunchbase_url":"http://www.crunchbase.com/person/bernhard-hoetzl","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"kompany","born_year":null,"born_month":null,"born_day":null,"tag_list":"marketing, communication, sales, customer-service, entrepreneur, innovation, business","alias_list":null,"created_at":"Thu May 12 20:31:47 UTC 2011","updated_at":"Wed Jul 11 19:11:48 UTC 2012","overview":"<p>Bernhard brings more than 12 years of extensive senior management experience in start-up, strategic planning &amp; consulting, business development and product management in international Internet &amp; new media, telecommunication, gaming &amp; gambling and energy markets.</p>\n\n<p>Bernhard is co-founder and partner in four companies providing consulting, management training, deep-web search, facility management and remote monitoring services to a global market.</p>\n\n<p>In February 2012 Bernhard, together with close friends and business partners, founded kompany, an Internet start-up that defined it’s mission to empower professionals with an easy access to international corporate background information.</p>\n\n<p>In November 2011 Bernhard co-founded Calypso12, a consulting network providing Internet and new media services where “no one else can help”.</p>\n\n<p>From November 2009 to October 2011 Bernhard served as Chief Marketing Officer and Interim-CEO of an online people-search service responsible for global Marketing, PR, Sales, Customer Service and Country Management, helping to grow the company to global leadership in people search within it’s first three years, serving up to 50 Mln unique visitors per month operating in 13 countries in 11 languages.</p>\n\n<p>In 2006 Bernhard together with two partners founded smartspaces.at, a service that is operating two Vienna based CoWorking Spaces.</p>\n\n<p>He previously worked at cablecom (Switzerland) where he headed the B2B marketing department.</p>\n\n<p>Prior positions include Head of Applications Product Management at Telefonica‘s 3G Mobile AG (Switzerland), a start-up-venture, responsible for establishing a fully staffed department and developing a full mobile data launch portfolio.</p>\n\n<p>Previously Bernhard succeeded as Interim Head of Marketing, Sales and Customer Care for eWave (now Yesss!/Orange), evaluating strategic opportunities in the wireless access business and as Senior Manager Mobile Entertainment at the mobile telecom start-up ONE (acquired by Orange in 2007) in Austria.</p>\n\n<p>In 2003 Bernhard, together with Russell E. Perry and Peter Bainbridge-Clayton, was awarded “Idea of the year 2003 of young entrepreneurs” by the largest Austrian business magazine „Gewinn“ for a remote asset monitoring solution.</p>\n\n<p>Bernhard holds a Master’s degree in Business, International Marketing Management and Management of Information Systems from the Vienna University of Economics and Business Administration. Bernhard enjoys coaching and training management teams and MBA students on Internet &amp; new media, innovation, strategy, leadership and organisational development. Bernhard has a strong interest in international travel; in the past 20 years, he has lived, visited or worked in more than 40 countries in all continents except Antarctica. In his spare time he enjoys reading, triathlon (Ironman 2010 Finisher), ski touring, playing guitar and painting. In 2011 Bernhard was member of the Race Across Australia team setting a new world record for charity.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0020/0186/200186v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0020/0186/200186v2-max-250x250.jpg"],[[300,300],"assets/images/resized/0020/0186/200186v2-max-450x450.jpg"]],"attribution":"<p>Bernhard Hoetzl <a href=\"http://www.kompany.com/\" title=\"kompany\" rel=\"nofollow\">kompany</a></p>"},"degrees":[{"degree_type":"Master","subject":"Business Administration","institution":"Vienna University of Economics and Business","graduated_year":2002,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder & Co-CEO","firm":{"name":"kompany","permalink":"kompany","type_of_entity":"company","image":{"available_sizes":[[[150,57],"assets/images/resized/0020/0134/200134v2-max-150x150.jpg"],[[250,96],"assets/images/resized/0020/0134/200134v2-max-250x250.jpg"],[[450,173],"assets/images/resized/0020/0134/200134v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"CMO","firm":{"name":"123people","permalink":"123people","type_of_entity":"company","image":{"available_sizes":[[[150,112],"assets/images/resized/0003/1135/31135v3-max-150x150.jpg"],[[250,187],"assets/images/resized/0003/1135/31135v3-max-250x250.jpg"],[[450,337],"assets/images/resized/0003/1135/31135v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.calypso12.com/","title":"Calypso12"}],"web_presences":[{"external_url":"http://www.twitter.com/bernhardhoetzl","title":"Twitter"},{"external_url":"http://www.linkedin.com/pub/bernhard-hoetzl/0/180/200","title":"Linkedin"}]}