{"first_name":"Bertram","last_name":"Michel","permalink":"bertram-michel","crunchbase_url":"http://www.crunchbase.com/person/bertram-michel","homepage_url":"http://www.stonningtongroup.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jul 09 23:10:52 UTC 2008","updated_at":"Tue Oct 09 16:35:03 UTC 2012","overview":"<p>Bertram Michel has over 20 years of experience in investment banking and corporate finance in the United States and in Europe. Prior to focusing on middle-market investment banking, Mr. Michel was a Director in investment banking at Merrill Lynch in New York where he worked for 11 years. During that time he executed close to 50 transactions for corporations in various industries, including telecommunications, media, and technology companies in North and South America, Europe and Australia. Clients ranged from early stage enterprises to Fortune 500 companies. His experience spans mergers &amp; acquisitions, leveraged buyouts and financing transactions, including public and private offerings of debt and equity securities. </p>\n\n<p>Prior to Merrill Lynch, Mr. Michel worked at Dresdner Bank in Germany for two years. During that time, Mr. Michel rotated through key departments of the bank, including the credit department and the arbitrage trading desk for international equity securities. </p>\n\n<p>Mr. Michel has lectured on various corporate finance topics at the annual TMANE Conference. In addition, Mr. Michel has been quoted in the press and is a frequent guest speaker at the Marshall School of Business at the University of Southern California.</p>\n\n<p>Mr. Michel holds an MBA from the University of Southern California where he graduated with Beta Gamma Sigma business honors and holds a BA in Business from the Richard Ivey School of Business at The University of Western Ontario. In addition, Mr. Michel is a registered representative of the Financial Industry Regulatory Authority (FINRA).</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0002/1769/21769v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0002/1769/21769v2-max-250x250.jpg"],[[196,294],"assets/images/resized/0002/1769/21769v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}