{"first_name":"Beth","last_name":"Seidenberg","permalink":"beth-seidenberg","crunchbase_url":"http://www.crunchbase.com/person/beth-seidenberg","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 28 17:13:52 UTC 2008","updated_at":"Thu May 29 02:28:27 UTC 2008","overview":"<p>Beth joined Kleiner Perkins Caufield &amp; Byers in May 2005 to work in the life sciences area.</p>\n\n<p>For the past 20 years, she has focused her career on introducing new innovative treatments for AIDS, arthritis, asthma, cancer, psoriasis, cardiovascular, metabolic, neurological and renal disorders. She introduced 10 innovative products to market and achieved over 40 regulatory approvals (including new indications and formulations) on a worldwide basis. These products have been successfully commercialized and have provided benefits to millions of patients with grievous illnesses and have generated several billion dollars of revenue.</p>\n\n<p>Prior to joining KPCB, Beth was Senior Vice President, Global Development, and Chief Medical Officer at Amgen, Inc., the world’s largest biotechnology company. During Beth’s three years there, her responsibilities included: all stages of clinical research, regulatory affairs, safety, health economics/reimbursement and medical affairs. During her tenure, five innovative products were approved for commercial use. Prior to joining Amgen, Beth was a senior executive in research and development at Bristol-Myers Squibb Company and Merck &amp; Co., Inc. She began her career in basic and clinical research at the National Institutes of Health specializing in immunology and infectious diseases.</p>\n\n<p>Beth received her BS from Barnard College magna cum laude, Phi Beta Kappa; and her medical degree from the University Of Miami School Of Medicine, alpha omega alpha. Her post-graduate training was completed at Johns Hopkins, George Washington School of Medicine and the National Institutes of Health. She is a member of the Johns Hopkins Bloomberg School of Public Health Advisory Board and Barnard College Science Advisory Board.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Kleiner Perkins Caufield & Byers","permalink":"kleiner-perkins-caufield-byers","type_of_entity":"financial_org","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/0998/10998v8-max-150x150.jpg"],[[250,250],"assets/images/resized/0001/0998/10998v8-max-250x250.jpg"],[[450,450],"assets/images/resized/0001/0998/10998v8-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}