{"first_name":"Beth","last_name":"Hahn","permalink":"beth-hahn","crunchbase_url":"http://www.crunchbase.com/person/beth-hahn","homepage_url":"http://www.buzzhaus.com","birthplace":"Perth Amboy NJ","twitter_username":"buzzhaus","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1973,"born_month":1,"born_day":23,"tag_list":"","alias_list":null,"created_at":"Sat Oct 09 05:29:16 UTC 2010","updated_at":"Wed Oct 20 05:42:22 UTC 2010","overview":"<p>Beth is a care-driven Entrepreneur.  She has a solid background in Concierge Client Building and Interactions as well as Financial and Business Management, having worked in the Healthcare Industry for over 14 years.  She conceptualized and realized a &#8220;Traveling Boutique&#8221;, providing a Big-Band feeling Shopping experience in-house for Nursing Home residents.  This combined her Socially interactive and giving drive.  She worked for Volvo Rents Construction Equipment in finance and relations, and is now re-entering the Construction Equipment Rental Industry with the goal of synergistically mainlining the benefits of the Techno-Social Web and it&#8217;s gadgets.  Her mission is to build brighter daily ops and interactions by integrating cutting-edge technology and exponential social outreach.  Beth is passionate about increasing personal presence, streamlining process to build business, expanding networks, and enriching communities.</p>\n\n<p>Buzzhaus.com will be a Virtual Toolbox of open source information, relevant links, free apps, programs, templates and Industry appropriate blog for teh Construction and Heavy Equipment Rental Industry.  Hahn will provide consulting services in Concierge Outreach, dynamic and innovative mobile applications, focus-specific Social Media and socially-conscious philanthropic ideation.  </p>\n\n<p>Hahn is  freshly completing a dual-focus degree in Marketing and  Entrepreneurship.  Family comes first, and she feels that her clients become part of her family.  She says &#8220;Sharing joy and building a better world light me up. Vaynerchuk&#8217;s 3 from Crush It work for me: &#8220;I love my family, I work really hard and I am living my passion!&#8221; I adore technology, run enthusiastic, am inspired by genuine passion of purpose, inspire through connected interaction and believe deeply in the power of the positive.  We can all win, every time&#8230;perspective is key.</p>\n\n<p>Currently a full-time single Mom, full-time Student, active in the Community, building Buzzhaus.com and working on industry-appropriate emergent technology.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0010/4890/104890v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0010/4890/104890v2-max-250x250.jpg"],[[419,315],"assets/images/resized/0010/4890/104890v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/buzzhaus","title":""},{"external_url":"http://www.facebook.com/pages/Hendersonville-NC/Buzzhaus/113080665420436","title":""},{"external_url":"http://www.youtube.com/buzzhaus","title":""}]}