{"first_name":"Bhavik","last_name":"Shah","permalink":"bhavik-shah","crunchbase_url":"http://www.crunchbase.com/person/bhavik-shah","homepage_url":"http://www.abacusinfotech.info/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"analog-camera, ip-camera, standalone-dvr, face-recognition-systems, proximity-systems, abacus-infotech, mumbai, india","alias_list":null,"created_at":"Sat May 12 06:14:13 UTC 2012","updated_at":"Tue May 22 23:38:37 UTC 2012","overview":"<p>Abacus Infotech</p>\n\n<p>Established in the year 2002, we, “Abacus Infotech”, are engaged in distributing and supplying Access &amp; Attendance Systems for Hardware and Software to many industries. Our firm is promoted by &#8216;Mr. Jatin Mehta&#8217;, who possesses more than two decades of experience in IT sector. We have also accomplished several products in past for many overseas customers. Besides, we also have an office in UK for catering the needs of our foreign customers.</p>\n\n<p>We are termed as one of the leading distributors and suppliers of Access &amp; Attendance Systems for Hardware and Software. Designed with superior quality components at vendor&#8217;s end, these products are widely used in different industries. Our procurement agents also keep a tab on the entire production process at vendors&#8217; site and obtain only quality assured products. After that product reach our plant where quality controllers recheck the entire gamut on defined parameters. </p>\n\n<p>We are offering an excellent collection of products to the customers. In addition to this, we also offer total technical support for these products at our plant or clients&#8217; site. We believe in ethical business practices and offer complete transparency in our business dealings. Many other factors that are responsible for our commendable position in the industry are given below:</p>\n\n<pre><code>Excellent quality products\nPrompt, reliable and effective services\nWidely distributed sales network\nCapacious warehousing facilities\n</code></pre>\n\n<p>Telephone:+(91)-(22)-65263486/ 28626305 </p>","image":{"available_sizes":[[[125,125],"assets/images/resized/0018/9409/189409v2-max-150x150.jpg"],[[125,125],"assets/images/resized/0018/9409/189409v2-max-250x250.jpg"],[[125,125],"assets/images/resized/0018/9409/189409v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}