{"first_name":"Bilawal","last_name":"Hameed","permalink":"bilawal-hameed","crunchbase_url":"http://www.crunchbase.com/person/bilawal-hameed","homepage_url":"http://www.bilawal.co.uk/","birthplace":"Manchester, United Kingdom","twitter_username":"bilawalhameed","blog_url":"http://www.bilawal.biz/","blog_feed_url":"http://www.bilawal.biz/feed/","affiliation_name":"Torrentfreak","born_year":1993,"born_month":5,"born_day":19,"tag_list":"","alias_list":null,"created_at":"Thu Aug 20 02:23:51 UTC 2009","updated_at":"Thu Aug 20 16:57:28 UTC 2009","overview":"<p>Bilawal Hameed is a young, inspirational entrepreneur who develops web applications and small startups that turn into large, profitable corporations.</p>\n\n<p>As a web developer who has been in the online industry for over 7 years, and starting at only 9 years old, he has become a web developer who quickly moved onto the entrepreneurial industry and building web apps motivated him to work with big names.</p>\n\n<p>Running businesses, and eventually failing them, for every one that did fail, he eventually ran a business that went successful through experience, and then went on to get bigger fish to fry. From such a young, mindless child he has built himself a range of companies and contacts, and one of the most powerful young minds in the United Kingdom.</p>\n\n<p>He has worked for companies such as TorrentFreak, Money Industries, Security Companies, Anti-Fraud, to even building the most powerful web apps on the market. As a home-based web developer who does it for fun, and is able to still do so, he is one of the youngest and most powerful entrepreneurs online today and still leverages his businesses to success and evolve into companies that will make impact and usefulness to today&#8217;s global society.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Torrentfreak","permalink":"torrentfreak","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/bilawalhameed","title":"@bilawalhameed"},{"external_url":"http://www.facebook.com/billawal","title":"Facebook Profile"},{"external_url":"http://www.youtube.com/musicchasemedia","title":"Bilawal on YouTube"}]}