{"first_name":"Billy","last_name":"Beane","permalink":"billy-beane","crunchbase_url":"http://www.crunchbase.com/person/billy-beane","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"NetSuite","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 24 12:24:25 UTC 2007","updated_at":"Sun Dec 04 01:41:05 UTC 2011","overview":"<p>Mr. Beane is the general manager of Major League Baseball, Oakland A&#8217;s. Known for taking one of the most traditional businesses in America — professional baseball — and redefining its most basic tenets, Mr. Beane has leveraged the power of mathematics to manage his team by using sophisticated statistical analysis in addition to traditional &#8220;gut instinct.&#8221; Mr. Beane&#8217;s executive talents and the organization&#8217;s baseball philosophy were the subject of Michael Lewis&#8217; best-selling book &#8220;Moneyball: The Art of Winning an Unfair Game,&#8221; which opened the eyes of many of the top sports executives and business CEOs from any industry or profession in the nation.</p>\n\n<p>The Oakland Athletics have been a perennial postseason contender since Mr. Beane took over the general manager&#8217;s duties in 1998, and in 2006 the team continued its winning ways by advancing to the American League Championship Series. The A&#8217;s have compiled a 825-632- (.573) record over the last nine seasons, which is the second-best record in the American League and third best in all of baseball during that time frame, won three American League West titles (2000; 2002-03) and secured one AL Wild Card spot (2001). And they have done this all while having one of the lowest payrolls in Major League Baseball.</p>\n\n<p>In addition, Oakland A&#8217;s players have won numerous individual accolades over the last eight seasons, including two American League Most Valuable Player awards, a pair of AL Rookie of the Year honors and one AL Cy Young Award. The organization&#8217;s farm system has also flourished under Mr. Beane. The A&#8217;s have earned Organization of the Year honors three times under Mr. Beane (1998 Topps; 1999 Baseball America, Topps, Howe Sports Data; 2004 Topps).</p>\n\n<p>Mr. Beane joined the A&#8217;s front office staff in 1990 as the club&#8217;s major league advance scout. In 1993, he was promoted to the assistant general manager&#8217;s position. And in late 1997 he assumed the general manager&#8217;s duties.</p>\n\n<p>Earlier in his career, he was a first round draft pick (23rd overall) of the New York Mets in the 1980 June Free Agent Draft. He played six major league seasons as an infielder, outfielder and catcher for the Mets, Minnesota Twins, Detroit Tigers and Oakland A&#8217;s. His final season in uniform was 1989 when he was a utility player on the A&#8217;s World Championship team. Mr. Beane retired as an active player in the spring of 1990.</p>\n\n<p>Mr. Beane is a frequent speaker before some of the top companies in the nation. He also sits on the Board of Directors for a number of companies such as Riddell, the official helmet company of the NFL and PROTRADE, a sports entertainment company.</p>\n\n<p>billy beane sucked</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Board","firm":{"name":"NetSuite","permalink":"netsuite","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0000/3736/3736v1-max-150x150.png"],[[250,76],"assets/images/resized/0000/3736/3736v1-max-250x250.png"],[[250,76],"assets/images/resized/0000/3736/3736v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}