{"first_name":"Bill","last_name":"Gates","permalink":"bill-gates","crunchbase_url":"http://www.crunchbase.com/person/bill-gates","homepage_url":"","birthplace":"","twitter_username":"billgates","blog_url":"","blog_feed_url":"","affiliation_name":"bgC3","born_year":1955,"born_month":10,"born_day":28,"tag_list":"microsoft-windows-microsoft","alias_list":"","created_at":"Thu Apr 17 15:38:31 UTC 2008","updated_at":"Tue Jul 03 23:27:08 UTC 2012","overview":"<p>William (Bill) H. Gates was  chairman of Microsoft Corporation, the worldwide leader in software, services and solutions that help people and businesses realize their full potential. Microsoft had revenues of US$55.12 billion for the fiscal year ending June 2007, and employs more than 78,000 people in 105 countries and regions.</p>\n\n<p>On June 15, 2006, Microsoft announced that effective July 2008 Gates will transition out of a day-to-day role in the company to spend more time on his global health and education work at the Bill &amp; Melinda Gates Foundation. After July 2008 Gates will continue to serve as Microsoft&#8217;s chairman and an advisor on key development projects. The two-year transition process is to ensure that there is a smooth and orderly transfer of Gates&#8217; daily responsibilities. Effective June 2006, Ray Ozzie has assumed Gates&#8217; previous title as chief software architect and is working side by side with Gates on all technical architecture and product oversight responsibilities at Microsoft. Craig Mundie has assumed the new title of chief research and strategy officer at Microsoft and is working closely with Gates to assume his responsibility for the company&#8217;s research and incubation efforts.</p>\n\n<p>Born on Oct. 28, 1955, Gates grew up in Seattle with his two sisters. Their father, William H. Gates II, is a Seattle attorney. Their late mother, Mary Gates, was a schoolteacher, University of Washington regent, and chairwoman of United Way International.</p>\n\n<p>Gates attended public elementary school and the private Lakeside School. There, he discovered his interest in software and began programming computers at age 13.</p>\n\n<p>In 1973, Gates entered Harvard University as a freshman, where he lived down the hall from Steve Ballmer, now Microsoft&#8217;s chief executive officer. While at Harvard, Gates developed a version of the programming language BASIC for the first microcomputer - the MITS Altair.</p>\n\n<p>In his junior year, Gates left Harvard to devote his energies to Microsoft, a company he had begun in 1975 with his childhood friend Paul Allen. Guided by a belief that the computer would be a valuable tool on every office desktop and in every home, they began developing software for personal computers. Gates&#8217; foresight and his vision for personal computing have been central to the success of Microsoft and the software industry.</p>\n\n<p>Under Gates&#8217; leadership, Microsoft&#8217;s mission has been to continually advance and improve software technology, and to make it easier, more cost-effective and more enjoyable for people to use computers. The company is committed to a long-term view, reflected in its investment of approximately $7.1 billion on research and development in the 2007 fiscal year.</p>\n\n<p>In 1999, Gates wrote Business @ the Speed of Thought, a book that shows how computer technology can solve business problems in fundamentally new ways. The book was published in 25 languages and is available in more than 60 countries. Business @ the Speed of Thought has received wide critical acclaim, and was listed on the best-seller lists of the New York Times, USA Today, the Wall Street Journal and Amazon.com. Gates&#8217; previous book, The Road Ahead, published in 1995, held the No. 1 spot on the New York Times&#8217; bestseller list for seven weeks.\nTop row: Steve Wood (left), Bob Wallace, Jim Lane. Middle row: Bob O&#8217;Rear, Bob Greenberg, Marc McDonald, Gordon Letwin. Bottom row: Bill Gates, Andrea Lewis, Marla Wood, Paul Allen. December 7, 1978.\nTop row: Steve Wood (left), Bob Wallace, Jim Lane. Middle row: Bob O&#8217;Rear, Bob Greenberg, Marc McDonald, Gordon Letwin. Bottom row: Bill Gates, Andrea Lewis, Marla Wood, Paul Allen. December 7, 1978.</p>\n\n<p>Gates has donated the proceeds of both books to non-profit organizations that support the use of technology in education and skills development.</p>\n\n<p>In addition to his love of computers and software, Gates founded Corbis, which is developing one of the world&#8217;s largest resources of visual information - a comprehensive digital archive of art and photography from public and private collections around the globe. He is also a member of the board of directors of Berkshire Hathaway Inc., which invests in companies engaged in diverse business activities.</p>\n\n<p>Philanthropy is also important to Gates. He and his wife, Melinda, have endowed a foundation with more than $28.8 billion (as of January 2005) to support philanthropic initiatives in the areas of global health and learning, with the hope that in the 21st century, advances in these critical areas will be available for all people. The Bill and Melinda Gates Foundation has committed more than $3.6 billion to organizations working in global health; more than $2 billion to improve learning opportunities, including the Gates Library Initiative to bring computers, Internet Access and training to public libraries in low-income communities in the United States and Canada; more than $477 million to community projects in the Pacific Northwest; and more than $488 million to special projects and annual giving campaigns.</p>\n\n<p>Gates was married on Jan. 1, 1994, to Melinda French Gates. They have three children. Gates is an avid reader, and enjoys playing golf and bridge.</p>","image":{"available_sizes":[[[105,150],"assets/images/resized/0001/7609/17609v1-max-150x150.jpg"],[[175,250],"assets/images/resized/0001/7609/17609v1-max-250x250.jpg"],[[200,285],"assets/images/resized/0001/7609/17609v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder, Chairman","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Founder","firm":{"name":"bgC3","permalink":"bgc3","type_of_entity":"company","image":{"available_sizes":[[[150,149],"assets/images/resized/0002/7189/27189v1-max-150x150.jpg"],[[200,199],"assets/images/resized/0002/7189/27189v1-max-250x250.jpg"],[[200,199],"assets/images/resized/0002/7189/27189v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Co-Chair","firm":{"name":"Gates Foundation","permalink":"gates-foundation","type_of_entity":"financial_org","image":{"available_sizes":[[[150,30],"assets/images/resized/0008/4159/84159v1-max-150x150.png"],[[250,50],"assets/images/resized/0008/4159/84159v1-max-250x250.png"],[[259,52],"assets/images/resized/0008/4159/84159v1-max-450x450.png"]],"attribution":null}}}],"investments":[{"funding_round":{"round_code":"b","source_url":"http://techcrunch.com/2010/07/12/ecomotors-revs-engine-to-23-5-million-series-b-funding/","source_description":"EcoMotors Revs Its Engine With $23.5 Million Series B Funding From Bill Gates And Khosla Ventures","raised_amount":23500000,"raised_currency_code":"USD","funded_year":2010,"funded_month":7,"funded_day":12,"company":{"name":"EcoMotors","permalink":"ecomotors","image":{"available_sizes":[[[150,40],"assets/images/resized/0005/4743/54743v1-max-150x150.png"],[[250,68],"assets/images/resized/0005/4743/54743v1-max-250x250.png"],[[260,71],"assets/images/resized/0005/4743/54743v1-max-450x450.png"]],"attribution":null}}}},{"funding_round":{"round_code":"unattributed","source_url":"http://www.finsmes.com/2012/08/kymeta-closes-12m-funding.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+finsmes%2FcNHu+%28FinSMEs%29","source_description":"Kymeta Closes $12M Funding","raised_amount":12000000,"raised_currency_code":"USD","funded_year":2012,"funded_month":8,"funded_day":21,"company":{"name":"Kymeta","permalink":"kymeta","image":{"available_sizes":[[[150,27],"assets/images/resized/0020/7342/207342v1-max-150x150.png"],[[232,43],"assets/images/resized/0020/7342/207342v1-max-250x250.png"],[[232,43],"assets/images/resized/0020/7342/207342v1-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://en.wikipedia.org/wiki/Bill_Gates","title":"Wikipedia profile"}],"web_presences":[]}