{"first_name":"Bill","last_name":"Sams","permalink":"bill-sams","crunchbase_url":"http://www.crunchbase.com/person/bill-sams","homepage_url":"http://billsams.wordpress.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"network-weaver, mindletics","alias_list":null,"created_at":"Tue Nov 01 15:03:30 UTC 2011","updated_at":"Sat Nov 05 01:09:17 UTC 2011","overview":"<p>Bill is a Network Weaver.</p>\n\n<pre><code>    Bill has two primary passions: As a network weaver connecting people and ideas, as a change agent transforming education.\n    The concept of network weaving was created by a friend of Bill&amp;amp;#8217;s, June Holley and with the growth of social network technology is now becoming an international movement. http://www.networkweaver.blogspot.com/ Bill is working with a half dozen young entrepreneurs providing advice and connections to help their start up efforts.\n    Through his position as a Commissioner on the eTech Ohio Commission, a state agency that works with the Board of Regents and the Ohio Department of Education with the legislative mandate to &amp;amp;#8220;connect the citizens of Ohio to education through technology&amp;amp;#8221; Bill has a platform at the state level to influence the application of academic technology. The commission provides support for the intranet that connects Ohio&amp;amp;#8217;s 613 school districts and the programming feeds to all ten PBS stations. Additionally Bill is published on a national basis with his most recent Op Ed in the Chronicle of Higher Education with a vision piece on the University of the Customer: http://www.futureofeducation.com/forum/topics/the-university-of-the-customer\n    Bill is currently working on developing the concept of a Knol, a unit of learning which would allow well understood industry continuous improvement processes to be applied to education.\n    Over the next year Bill will be developing a Mindletics program that will create a platform for academic competition similar to youth sports programs.\n    Additionally Bill serves as Chief Scientist for Pillar Mobile a start up spin off from Pillar Technology.\nBill received a BBA and MBA from Ohio University and a JD from the Santa Clara University.  Bill’s career includes four years in the Air Force where he received the Bronze Star, and 25 years in management positions in Silicon Valley.\nBill started his business career in the early 70s at Fairchild Semiconductor and was literally at ground zero during the early years of the computer revolution. Bill has been involved in several start up operations and one turn around. Bill’s positions included VP of Marketing and Sales, VP of Operations and General Manager of a key division of a Fortune 500 company, LSI Logic.\nUpon returning to Ohio in 2001Bill worked for two years as the Associate Provost for Information Technology and Chief Information Officer of Ohio University.  Next Bill served as the Program Director for a $5 million U.S. Department of Labor WIRED grant that he wrote that focused on work force development in Interactive Digital Technology in Appalachian Ohio. Bill has also facilitated corporate training programs for the Ohio University Without Boundaries program and has taught senior and graduate level e-business management classes for the colleges of business and engineering. \nIn addition to academic pursuits Bill is a member of the eTech Ohio Commission a state agency that oversees the K-12 IT infrastructure as well as the Public Broadcasting System in connecting technology and education for the benefit of the citizens of Ohio. Bill is also a member of the Ohio TechAngel Fund that is the largest and best organized angel investment fund in the country.\nBetween his management and academic careers Bill and his wife spent two years sailing their 46-foot boat, Camelot, across the South Pacific.\n</code></pre>","image":{"available_sizes":[[[121,150],"assets/images/resized/0016/0388/160388v2-max-150x150.jpg"],[[203,250],"assets/images/resized/0016/0388/160388v2-max-250x250.jpg"],[[365,450],"assets/images/resized/0016/0388/160388v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BBA","subject":"Management","institution":"Ohio University","graduated_year":1968,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"Finance","institution":"Ohio University","graduated_year":1972,"graduated_month":null,"graduated_day":null},{"degree_type":"JD","subject":"Law","institution":"Santa Clara University","graduated_year":1976,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.futureofeducation.com/forum/topics/the-university-of-the-customer","title":"The University of the Customer"},{"external_url":"http://www.networkweaver.blogspot.com/","title":"Network Weaver Blog"}],"web_presences":[]}