{"first_name":"Bill","last_name":"Bowes","permalink":"bill-bowes","crunchbase_url":"http://www.crunchbase.com/person/bill-bowes","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 05 18:02:54 UTC 2009","updated_at":"Fri Jun 05 18:03:57 UTC 2009","overview":"<p>Founding partner Bill Bowes has seen a lot of change since USVP&#8217;s inception in 1981 - in the venture community, in the Valley, in the world. But some important things remain the same; namely, the passion of entrepreneurs: &#8220;It&#8217;s the entrepreneurs that keep this business new and fresh, every day,&#8221; says Bill. </p>\n\n<p>A venture capitalist in the Bay Area for nearly 50 years, Bill founded and helped to build USVP to what it is today. His belief that venture capitalists should guide companies based on real-world experience continues to set the tone at USVP: &#8220;We&#8217;ve always put our emphasis on the operational experience of our team,&#8221; notes Bill. &#8220;The partners here can say to entrepreneurs &#8216;we&#8217;ve been where you&#8217;re going&#8217; and really mean it.&#8221; </p>\n\n<p>Bill was the founding shareholder of Amgen and was its first Chairman and Treasurer. Prior to founding USVP, he&#8217;d already had success as a venture capitalist with companies like Cetus, Raychem (where he served on the board from 1961 until the late 1970s), and Dymo Industries. Bill had previously been Senior Vice President and Director of Blyth Eastman Dillon &amp; Company, where he worked from 1953 to 1978 and was a consultant to Blyth Eastman Paine Webber from 1978 to 1980. </p>\n\n<p>At USVP, Bill led the firm&#8217;s investments in Advanced Cardiovascular Systems, Applied Biosystems, Devices for Vascular Intervention, Glycomed, Sun Microsystems and Ventritex. Currently Bill is on the board of Xoma Corporation. </p>\n\n<p>Today Bill devotes much of his time to education and medical research. He is on the executive committee of the San Francisco Conservatory of Music and recently retired as Board Chairman of The Exploratorium, San Francisco&#8217;s exemplary interactive museum of the sciences. He also serves on the Board of the Asian Art Museum, Grace Cathedral and the Hoover Institution. </p>\n\n<p>Having focused his investment career largely in the medical industry, Bill remains involved through some of his nonprofit work. He is on the Board of Directors of the UCSF Foundation and was Chairman of the Mission Bay Capital Campaign. He serves on the Advisory Committees of Bio-X, the Institute for Systems Biology, QB3 and Harvard Partners Center for Genetics and Genomics - each dedicated to furthering interdisciplinary medical research. He is on the visiting committee at the Harvard Business School. </p>\n\n<p>Bill holds a B.A. in Economics from Stanford University, an M.B.A. from Harvard University and served in the U.S. Army infantry in the South Pacific and Japan during and after World War II.</p>","image":{"available_sizes":[[[125,125],"assets/images/resized/0004/6984/46984v1-max-150x150.jpg"],[[125,125],"assets/images/resized/0004/6984/46984v1-max-250x250.jpg"],[[125,125],"assets/images/resized/0004/6984/46984v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"U.S. Venture Partners","permalink":"u-s-venture-partners-2","type_of_entity":"financial_org","image":{"available_sizes":[[[95,42],"assets/images/resized/0004/6983/46983v1-max-150x150.png"],[[95,42],"assets/images/resized/0004/6983/46983v1-max-250x250.png"],[[95,42],"assets/images/resized/0004/6983/46983v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}