{"first_name":"Bill","last_name":"Elmore","permalink":"bill-elmore","crunchbase_url":"http://www.crunchbase.com/person/bill-elmore","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Feb 02 20:49:02 UTC 2010","updated_at":"Tue Feb 02 20:49:42 UTC 2010","overview":"<p>With a combinationof venture and operating experience that cultivated a deep understanding about the challenges an organization faces on a daily basis, Bill founded Foundation Capital in 1995 with the purpose of helping entrepreneurs build strong organizations from the ground up. He has always operated on the belief that substantial, sustainable companies are the result of matching insight—whether about technology or market opportunity—with the right entrepreneurand management team.\nPrior to Foundation, Bill spent eight years as a General Partner at Inman &amp; Bowman. Previous roles include president of Visual Engineering, as well as a variety of marketing management positions, at Hewlett-Packard.\nAs former director and past presidentof the Western Association for Venture Capitalists, and past director of the National Venture Capital Association, Bill continues to be actively involved in defining, serving, and representing the interests of the venture capital and private equity industries. Equally passionate about his philanthropy work, Bill serves on the Advisory Council at Stanford Business School and is a board member of the Eastside College Preparatory School.\nBill currently sits on the board ofdirectors of Biz360, CloudShield, Helpstream, Quartics, SpringCM, TeaLeaf Technology, Venafi, and XMOS Semiconductor, and was previously on the boards of Atheros Communications and WindRiver Systems.\nBill holds a BSEEand MSEE from Purdue University and an MBA from the Stanford Graduate School of Business.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0007/5825/75825v1-max-150x150.jpg"],[[250,250],"assets/images/resized/0007/5825/75825v1-max-250x250.jpg"],[[294,294],"assets/images/resized/0007/5825/75825v1-max-450x450.jpg"]],"attribution":"<p>Foundation Capital</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner, Founder","firm":{"name":"Foundation Capital","permalink":"foundation-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[59,68],"assets/images/resized/0001/0986/10986v3-max-150x150.png"],[[59,68],"assets/images/resized/0001/0986/10986v3-max-250x250.png"],[[59,68],"assets/images/resized/0001/0986/10986v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}