{"first_name":"Bill","last_name":"Rebozo","permalink":"bill-rebozo","crunchbase_url":"http://www.crunchbase.com/person/bill-rebozo","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Feb 14 10:35:13 UTC 2012","updated_at":"Tue Feb 14 11:22:32 UTC 2012","overview":"<p>Mr. Bill Rebozo combines extensive technical experience in software development with a long history of business acumen to make new technologies relevant and profitable across a wide range of industries. Mr. Bill Rebozo founded several startup companies before joining Microsoft in central product development roles across: consumer portals, office productivity and software development tools. In these positions Mr. Rebozo worked within massive worldwide partner networks, defined and managed feature sets for one of the most trafficked websites in the world and worked directly with Fortune 500 companies to effectively position the business value of technology.</p>\n\n<p>With a passion for startup companies, Mr. Rebozo left Microsoft to lead product and business development for a disruptive communication technology at Twisted Pair Solutions called WAVE. In this position Mr. Rebozo defined market/product requirements while simultaneously orchestrating complex partner models with multi-billion corporations and government agencies. Mr. Rebozo later joined GridPoint where he directed product development to deliver SaaS based energy efficiency and metering solutions working closely with Sales and Marketing to define, position and sell the solution to fortune 500 corporations and federal organizations.</p>\n\n<p>Mr. Rebozo has over twenty years of experience introducing new technologies successfully to the market with extensive experience in sales and marketing across diverse customer segments. Mr. Rebozo holds an MBA from the University of Washington.</p>","image":{"available_sizes":[[[125,150],"assets/images/resized/0017/4194/174194v1-max-150x150.jpg"],[[125,150],"assets/images/resized/0017/4194/174194v1-max-250x250.jpg"],[[125,150],"assets/images/resized/0017/4194/174194v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"VP Sales & Marketing","firm":{"name":"Energy Points","permalink":"energy-points","type_of_entity":"company","image":{"available_sizes":[[[150,28],"assets/images/resized/0017/4026/174026v6-max-150x150.png"],[[250,47],"assets/images/resized/0017/4026/174026v6-max-250x250.png"],[[300,57],"assets/images/resized/0017/4026/174026v6-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}