{"first_name":"Bill","last_name":"Wooster","permalink":"bill-wooster","crunchbase_url":"http://www.crunchbase.com/person/bill-wooster","homepage_url":"http://www.fitnessexpostores.com","birthplace":"","twitter_username":"","blog_url":"http://www.fitnessexpostores.com/blog/","blog_feed_url":"http://www.fitnessexpostores.com/categories/Cardio/","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"exercise-fitness-equipment--treadmills, elliptical, bikes","alias_list":null,"created_at":"Wed Aug 22 16:17:12 UTC 2012","updated_at":"Thu Aug 23 18:08:34 UTC 2012","overview":"<p>Welcome to Fitness Expo showroom, one of the most reputable and oldest fitness retailers in the country. We have all the fitness equipment you would need to stay in shape. Whatever your goals may be, to lose weight, to increase your strength, maintaining health or anything different, you can get all the gym equipment of your choice available from different brands at a single place.</p>\n\n<p>In 1980, when the fitness industry was still in its infancy, the Rice family opened the first Fitness Expo showroom. Now, over 30 years later, and one of the most reputable and oldest fitness retailers in the country, they continue to offer the best brands and largest selection of exercise equipment for the home or commercial facility. When a customer visits a Fitness Expo showroom, they can expect to see a variety of not only brands, but prices too. The no-pressure sales staff is knowledgeable and will work with each individual to find out which machine fits their needs best. If exercise equipment is what someone is looking for, Fitness Expo is definitely the place to go. Delivery and installation are two very important services offered. The crews are trained, professional, and will make your life easier by delivering and installing in your home. Another valuable service, often overlooked, is IHS- In Home Service. Fitness Expo has certified technicians that will come to your home, if the need ever arises, to get you back in your workout routine as quickly as possible. Not only does Fitness Expo sell to the consumer for their home, they also outfit commercial facilities of all types. For these clients, consultation and room layouts are extremely important and part of the Fitness Expo package. Regardless of if you are an individual, an apartment complex, hospital, wellness facility, gym, University, etc., Fitness Expo will meet your fitness needs. With three generations now working in the family business, The Rice family and Fitness Expo will continue to offer the best to their customers.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0020/7482/207482v2-max-150x150.jpg"],[[150,150],"assets/images/resized/0020/7482/207482v2-max-250x250.jpg"],[[150,150],"assets/images/resized/0020/7482/207482v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.fitnessexpostores.com","title":"Gym Elliptical Exercise Machine"},{"external_url":"http://www.fitnessexpostores.com/blog/","title":"Offering the Best Exercise Equipments"},{"external_url":"http://www.fitnessexpostores.com/categories/Cardio/","title":"Cardio Fitness Equipment"},{"external_url":"http://www.fitnessexpostores.com/search.php?mode=advanced","title":"Fitness Expo Stores - Advanced Search"},{"external_url":"http://www.fitnessexpostores.com/pages/Contact-Us.html","title":"Fitness Equipment Wholesale"}]}