{"first_name":"Bill","last_name":"Townsend","permalink":"bill-townsend","crunchbase_url":"http://www.crunchbase.com/person/bill-townsend","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Pay By Touch","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Oct 23 02:26:17 UTC 2009","updated_at":"Wed Jul 06 18:14:11 UTC 2011","overview":"<p>Bill Townsend is an entrepreneur who helped launch several leading Internet properties, most notably search engine Lycos, social networking pioneer sixdegrees.com, and GeoCities (now Yahoo!). He is a published author on entrepreneurship, most recently appearing in the Harvard Business Review. He is founder of The Amati Foundation, serves on the Board of Directors at Newegg.com and YourOffers and is past Chairman of Powered Outcomes.</p>\n\n<p>He was a cofounder of sports marketing firm Corvosi, which represents clients Rahal Letterman Racing, Michael Jordan Motorsports, Carey Hart and Suzuki.</p>\n\n<p>He was formerly Executive Vice President, Office of the CEO at biometric authentication, payment and loyalty firm, Pay By Touch and a partner at strategic consulting and incubation firm Interminds. He served as VP Business Development at Deja News (now Google and eBay), and assisted in the launch of GeoCities (now Yahoo!) and turnaround of NewsAlert, now Dow Jones MarketWatch. </p>\n\n<p>Townsend is the codeveloper of The Predictive Mind, along with Beryl Huang, PsyD, a training method to modify behavior, emotional content, and attitudes that was an offshoot from studies of successful business executives, sub-conscious learnings, motivational behaviors, and psychology-based case studies. Predictive Mental Programming is billed as an evolutionary process that takes the mystery out of self-actualization so anyone can develop the positive mental tendencies needed to succeed.</p>\n\n<p>Townsend earned an MBA from Baylor University&#8217;s Hankamer School of Business where he holds the John Schoen Enterpreneur-in-Residence chair. </p>\n\n<p>In 2000, Townsend founded The Amati Foundation, to help expand the stringed arts, specifically education in playing, making, and preserving the violin. In 2006, he released a seminal study on consumer attitudes toward classical music events and how those attitudes affect attendance at orchestras in the United States and Europe. The study was featured in The Strad magazine. </p>\n\n<p>Townsend began studying violin making under the tutelage of Ziang Mei then continued learning techniques from William Hilton (a student of Vhakn Nigogosian), and Alberti Genduso (who has studied with the famed German master Horst Kloss and Karl Roy, director of the Bavarian State School of Violin Making in Mittenwald, Germany). In 2005 he introduced a wood treatment system to increase sonority and harmonics in instrument making. This system, Il Cremonese Violin Treatments, creates a base from which to apply varnish and protect wood. Additional source: Los Angeles Times Magazine, December 2004 print edition. His instruments are owned by Martie Maguire of Dixie Chicks, Brian Beken of South Austin Jug Band, and Edward Caner, violin clinician at the Rock and Roll Hall of Fame.</p>\n\n<p>Townsend was the 1992 Republican candidate for United States Congress in Pennsylvania&#8217;s 20th Congressional District, narrowly losing by 1 1/2% to 16-year Democrat incumbent Austin J. Murphy. </p>\n\n<p>He wrote the Internet industry&#8217;s first &#8220;Children&#8217;s Advertising Guidelines&#8221; in 1986, outlining methods for the delivery of online advertising to underage consumers and establishing advertising standards for firms marketing to minors. He was active in early Internet privacy initiatives. Served on the Internet Advertising Bureau and as Vice Chairman of Audit Bureau of Circulation&#8217;s Internet Standards and Measurement Committee.</p>\n\n<p>He lives in Southern California.</p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0006/5387/65387v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0006/5387/65387v2-max-250x250.jpg"],[[450,300],"assets/images/resized/0006/5387/65387v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"Global Business","institution":"Baylor University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"BA","subject":"Art","institution":"College of Wooster","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chairman","firm":{"name":"Powered Outcomes","permalink":"powered-outcomes","type_of_entity":"company","image":null}},{"is_past":true,"title":"EVP, Office of the CEO","firm":{"name":"Pay By Touch","permalink":"pay-by-touch","type_of_entity":"company","image":null}},{"is_past":true,"title":"VP Advertising","firm":{"name":"Lycos","permalink":"lycos","type_of_entity":"company","image":{"available_sizes":[[[150,49],"assets/images/resized/0001/7988/17988v2-max-150x150.png"],[[250,81],"assets/images/resized/0001/7988/17988v2-max-250x250.png"],[[260,85],"assets/images/resized/0001/7988/17988v2-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"VP Online","firm":{"name":"Product Partners","permalink":"product-partners","type_of_entity":"company","image":null}},{"is_past":true,"title":"Managing Director","firm":{"name":"Interminds, LLC","permalink":"interminds-llc","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://en.wikipedia.org/wiki/Bill_Townsend","title":"Wikipedia"}]}