{"first_name":"Bill","last_name":"Nussey","permalink":"bill-nussey","crunchbase_url":"http://www.crunchbase.com/person/bill-nussey","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Mar 03 13:03:23 UTC 2011","updated_at":"Thu Mar 03 13:04:34 UTC 2011","overview":"<p>Bill Nussey has 20 years of experience as a chief executive for technology companies. Previously, Nussey was president and CEO of iXL Inc., a publicly traded e-business consulting firm. During his tenure, iXL executed its initial public offering, grew revenues from $10 million to $120 million per quarter and served multiple Fortune 500 customers including General Electric, JP Morgan and Delta.</p>\n\n<p>Prior to iXL, Nussey was an investment professional with Greylock, where he worked on investments including DoubleClick, MediaMetrix and iXL. Before Greylock, Nussey was the co-founder and CEO of Da Vinci Systems. When he sold the company to ON Technologies in 1994, Da Vinci was the third most widely used email product in the world with more than 3 million customers in 45 countries.</p>\n\n<p>Over the years and under Nussey&#8217;s guidance, Silverpop has been the originator of many industry best practices and innovations. As CEO, he has consulted with numerous marketing executives on the use of email as a strategic communications channel and uncovered solutions to many of the challenges marketers are facing. Nussey shares these insights in his groundbreaking book, &#8220;The Quiet Revolution in Email Marketing.&#8221;</p>\n\n<p>In 2004, Nussey received the Direct Marketing Association&#8217;s Marketing Technology and Internet Council Annual Award of Excellence, and was named Marketer of the Year by the Atlanta Interactive Marketing Association. Nussey holds a Bachelor of Science degree in electrical engineering from North Carolina State University and an M.B.A. from Harvard Business School.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President and Chief Executive Officer","firm":{"name":"Silverpop","permalink":"silverpop","type_of_entity":"company","image":{"available_sizes":[[[150,35],"assets/images/resized/0003/2860/32860v6-max-150x150.png"],[[250,59],"assets/images/resized/0003/2860/32860v6-max-250x250.png"],[[303,72],"assets/images/resized/0003/2860/32860v6-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}