{"first_name":"Bindi","last_name":"Karia","permalink":"bindi-karia","crunchbase_url":"http://www.crunchbase.com/person/bindi-karia","homepage_url":"","birthplace":"","twitter_username":"bindik","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"microsoft, bizspark","alias_list":"","created_at":"Tue Mar 15 10:55:19 UTC 2011","updated_at":"Mon Nov 19 07:43:01 UTC 2012","overview":"<p>Bindi is the VC/Emerging Business lead for Microsoft UK and is the UK member of the Silicon Valley Emerging Business Team. She leads BizSpark and BizSpark One in the UK, where she focuses on how Microsoft can drive success for leading edge and early-stage technology companies. She is also responsible for managing the relationships with the UK Investor Community, including Venture Capitalist, Angels and other Investor Organisations. In addition, Bindi sits on many Advisory Boards, including Seedcamp, Astia UK, The Cambridge Phenomenon and TechMediaInvest.</p>\n\n<p>Her previous role at Microsoft was as a Business Productivity Advisor, where she was responsible for managing relationships with the most influential business decision-makers in the UK Financial Services Sector. She worked closely with them to deliver on the benefits and business value of investing in the latest Information Worker technologies by highlighting the importance of ‘worker productivity’, from the CEO to the call centre, as critical to ongoing business success. Prior to Microsoft, Bindi worked as an Associate Director in Interregnum, a UK-based Technology Merchant Bank; as Business Development Manager at Trayport Ltd, a successful commodities trading technology start-up; as a Strategy Management Consultant at PwC Consulting; and as a Senior Business Analyst at Datamonitor. </p>\n\n<p>Bindi was named to the Wired UK 2010 Top 100 Digital Power Broker list (Position #42), and was recently shortlisted as a finalist for Asian Business Woman of the Year in the 2010 Asian Women of Achievement Awards. </p>\n\n<p>Having grown up in Western Canada , Bindi now lives in London, and her hobbies include competing in Adventure Races such as the Microsoft UK Challenge, running marathons/duathlons, and skiing. She also enjoys the vibrant life of a Londoner, and can be seen checking out the latest restaurants or live gigs which make this city a great place to live. </p>","image":{"available_sizes":[[[150,93],"assets/images/resized/0012/6316/126316v1-max-150x150.jpg"],[[250,156],"assets/images/resized/0012/6316/126316v1-max-250x250.jpg"],[[450,281],"assets/images/resized/0012/6316/126316v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"http://www.youtube.com/watch?v=qr2TXmQvOvA","description":"<p>Grosir baju murah Tanah abang www.bajumurah-tanahabang.com kami menyediakan aneka baju murah wanita muslim modern masa seperti baju murah, pakaian murah, dress murah, gamis murah, blouse murah, tunik murah, jilbab murah, kerudung murah, pasmina murah, rok</p>"}],"external_links":[],"web_presences":[]}