{"first_name":"Blake","last_name":"Squires","permalink":"blake-squires","crunchbase_url":"http://www.crunchbase.com/person/blake-squires","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Hatch Partners, LLC","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Aug 19 16:16:22 UTC 2012","updated_at":"Mon Aug 27 23:43:31 UTC 2012","overview":"<p>Blake Squires is a media and technology entrepreneur with an appetite for what’s next.</p>\n\n<p>Early in his career Blake produced concerts and started an artist management company. It was in Los Angeles in the mid-90′s where he witnessed first-hand the convergence of technology &amp; media – in this case record companies awakened by the internet. Capitalizing on this “disruption”, Blake moved back to his home town of Cleveland to co-found and become Chief Operating Officer of Everstream Inc., a streaming media and digital cable analytics company which sold to Concurrent Computer Corp (NASDAQ: CCUR). Blake then co-founded Adcoda Inc., a digital music download company. From there he became a founding partner and was Chief Strategy Officer for Findaway, makers of Playaway (www.playaway.com), preloaded devices. He again has teamed up with Christopher Celeste, a partner in both Adcoda and Findaway, to harness their combined experience to found Hatch, helping entrepreneurs maximize their ideas.</p>\n\n<p>Blake has been awarded “40 Most Influential People Under 40″ by Crain’s Magazine and was named an E&amp;Y Entrepreneur of the Year finalist in 2010.  He is a member of The Entrepreneur’s Club of America (TECA), is on the Advisory Board of the Entrepreneurial Learning Initiative and serves as an entrepreneur-in-residence for Lake Erie College.  A graduate of The Ohio State University and fascinated by media and technology, Blake earned a degree from the prestigious School of Journalism with a focus on Telecommunications.</p>\n\n<p>Blake loves to tinker, dine-out and is inspired daily by his wife &amp; four kids under seven years old.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Principal","firm":{"name":"Hatch Partners, LLC","permalink":"hatch-partners-llc","type_of_entity":"financial_org","image":{"available_sizes":[[[108,29],"assets/images/resized/0020/7334/207334v2-max-150x150.png"],[[108,29],"assets/images/resized/0020/7334/207334v2-max-250x250.png"],[[108,29],"assets/images/resized/0020/7334/207334v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}