{"first_name":"Bo","last_name":"Ferger","permalink":"bo-ferger","crunchbase_url":"http://www.crunchbase.com/person/bo-ferger","homepage_url":"http://www.quickcue.com","birthplace":"Chattanooga, TN","twitter_username":"quickcue","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Sep 12 01:25:13 UTC 2012","updated_at":"Tue Oct 02 15:28:11 UTC 2012","overview":"<p>Bo Ferger is an executive with 24 years of experience in start-up and technology businesses. </p>\n\n<p>Bo specializes in planning, building, marketing and executing technology businesses with a focused expertise in early stage oppurtunities.</p>\n\n<p>Bo is currently the CEO of Quickcue, LLC., a customer engagement platform serving the restaurant industry. </p>\n\n<p>Bo&#8217;s career started as a co-founder of Light Visions, a 3D digital graphics house in Atlanta, Georgia where he animated the first computer animated trailers for national theatre chains.  His experience at Light Visions eventually led him to Burbank, California where in 1993 he was instrumental in developing what would become Warner Digital for Warner Bros. Animation Studio. During his tenure, he supervised a staff of artists and engineers in animation and special effects for a variety of movies, TV shows and commercials.  </p>\n\n<p>In 1994, Bo entered the technology side of the entertainment business by co-founding Cinebase Software, which developed a post-production management system for the Hollywood market. Three years later, Bo started Synctrix, Inc., an award winning, video technology design and development company. His creative side beckoned once again leading him to join start-up animation company, Toonacious Family Entertainment, where he served as President overseeing the company&#8217;s business affairs, strategic partnerships, and technology development.</p>\n\n<p>Bo returned to Chattanooga in 2007 and became President of ACH Federal - An electronic payment processing company with a direct relationship to the Federal Reserve.</p>\n\n<p>The entrepreneurial spirit got the best of Bo and he returned to the start-up world. Over the next 18 months Bo was involved in the launch of several technology companies ranging for tech consulting to mobile video. Bo first join Quickcue as a consultant focused on proving out the concept for market acceptance. </p>\n\n<p>After successfully test marketing the concept, Bo became the first CEO of Quickcue, LLC.</p>","image":null,"degrees":[{"degree_type":"BFA","subject":"Graphic Design","institution":"University of Tennessee - Knoxville","graduated_year":1988,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"Quickcue","permalink":"quickcue","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}