{"first_name":"Bob","last_name":"Muglia","permalink":"bob-muglia","crunchbase_url":"http://www.crunchbase.com/person/bob-muglia","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Oct 27 23:52:12 UTC 2008","updated_at":"Mon Jan 10 19:18:56 UTC 2011","overview":"<p>Bob Muglia is the former Senior Vice President of the Server and Tools Business (STB) at Microsoft. STB is chartered to deliver on Dynamic IT, Microsoft&#8217;s initiative focused on helping customers deliver technology innovation that helps IT pros and developers create highly-optimized and agile infrastructures that continuously align to changing business needs. As STB business leader, Muglia is responsible for developing and marketing Microsoft&#8217;s infrastructure and developer software. This integrated set of products provides the foundation for IT operations, security, application development and integration. The infrastructure and developer software portfolio includes Microsoft Windows Server, SQL Server, Visual Studio, Virtualization products, System Center management products and the Forefront line of business security products, among others.</p>\n\n<p>Muglia is a member of Microsoft&#8217;s Senior Leadership Team (which includes Chairman Bill Gates and Chief Executive Officer Steve Ballmer) that is responsible for shaping the company&#8217;s business and technology strategy.</p>\n\n<p>Since joining Microsoft in January 1988, Muglia has served in a variety of positions, including managing the development of the MSN network of Internet services and Microsoft Office family of business productivity applications, Windows Server applications, and productivity appliances such as Pocket PCs, eBooks and Tablet PCs. In addition, Muglia helped to bring together the Visual Studio family of developer tools and drove the Win32 API, customer requirements and product specification for the Microsoft Windows NT operating system.</p>\n\n<p>Before joining Microsoft, Muglia was a development manager at ROLM Co. He holds a bachelor&#8217;s degree in computer science from the University of Michigan.</p>","image":{"available_sizes":[[[150,115],"assets/images/resized/0002/7442/27442v1-max-150x150.png"],[[215,165],"assets/images/resized/0002/7442/27442v1-max-250x250.png"],[[215,165],"assets/images/resized/0002/7442/27442v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[{"description":"Came to China for cloud computing","stoned_year":2010,"stoned_month":9,"stoned_day":16,"source_url":"","source_text":null,"source_description":"","stoneable_type":"Person","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"first_name":"Bob","last_name":"Muglia","permalink":"bob-muglia"}}],"video_embeds":[],"external_links":[],"web_presences":[]}