{"first_name":"Bob","last_name":"Bernatz","permalink":"bob-bernatz","crunchbase_url":"http://www.crunchbase.com/person/bob-bernatz","homepage_url":"http://www.voxopolis.com","birthplace":"","twitter_username":"VOXopolis","blog_url":"http://blog.voxopolis.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 28 00:09:05 UTC 2011","updated_at":"Tue Jun 28 20:47:36 UTC 2011","overview":"<p>Dr. Bob Bernatz, creator of VOXopolis (www.voxopilis.com), has consulted to many of the world&#8217;s largest and most influential organizations. As a licensed corporate psychologist in Southern California, he specialized in assisting executives uncover and overcome their psychological and relational challenges.</p>\n\n<p>From 1990 to 2006, Dr. Bernatz and his team developed and oversaw hundreds of organizational surveys, customer surveys and 360 degree feedback processes for some of the best known organizations in the world.</p>\n\n<p>In his twenty years of consulting, Dr. Bernatz developed a deep appreciation for anonymous communication tools. Dr. Bernatz also discovered several significant weakness of these instruments that severely limited their effectiveness. The most glaring limitation was the lack of interactivity between the sender and recipient of the anonymous information. The lack of this interactivity made it nearly impossible for the recipient of the information to defend, clarify, or seek additional information about the results of the survey or review.</p>\n\n<p>Dr. Bernatz determined that an interactive feedback system that was available anywhere and at anytime would vastly improve the effectiveness of any professional or company. In providing these inexpensive, timely and interactive features through VOXopolis, customers, clients, patients, employees, viewers, vendors, etc. could now give constructive criticism, ask sensitve questions, forward important links or documents, and offer helpful suggestions that are both timely and interactive.</p>\n\n<p>Since its initial launch in 2006, VOXopolis has expanded its customer base from professional and corporate applications to being an anonymous portal for use in social networks, multimedia outlets, news organizations and average citizens from all communities. VOXopolis is presently accessible on over 10 million websites via the AddThis and ShareThis services.</p>\n\n<p>Here&#8217;s a video explaining the VOXopolis service (www.youtube.com/voxopolis) </p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0014/1338/141338v2-max-150x150.jpg"],[[178,250],"assets/images/resized/0014/1338/141338v2-max-250x250.jpg"],[[321,450],"assets/images/resized/0014/1338/141338v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Ph.D.","subject":"Counseling Psychology","institution":"University of Southern California","graduated_year":1994,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}