{"first_name":"Bob","last_name":"Paluck","permalink":"bob-paluck","crunchbase_url":"http://www.crunchbase.com/person/bob-paluck","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Nov 18 15:43:55 UTC 2008","updated_at":"Tue Nov 18 15:47:43 UTC 2008","overview":"<p>Bob Paluck has been a Managing Director since CenterPoint’s founding in 1996. He has led the growth and development of the CenterPoint firm which currently has $425 million under management. Bob currently is on the board of Alibre and Convey Computers and is an observer on the boards of D2Audio and T-RAM Semiconductor.</p>\n\n<p>Before his involvement in venture capital, Bob co-founded Convex Computer Corporation in 1982.  He was President and CEO, and later Chairman of the Board.  He led Convex from its inception in 1982 through its rapid growth in the 1980s, its initial public offering and listing on the New York Stock Exchange, to nearly $250 million in revenue and its successful merger with Hewlett-Packard Corporation in 1995.</p>\n\n<p>Prior to Convex, Bob served at Mostek Corporation, joining the company as a startup in 1971. Over the next 11 years he progressed from designing circuits to Vice President of Engineering and played an active role in growing one of the premier semiconductor companies of the 1970s.</p>\n\n<p>Bob has received many awards including the Outstanding Entrepreneurship Award from Southern Methodist University in 1987, the Distinguished Alumnus Award from the University of Illinois in 1988, the KPMG Peat Marwick High-Tech Entrepreneur Award in 1989, the Entrepreneur of the Year Award from Ernst &amp; Young in 1991, and the AEA Texas High Technology Entrepreneur Award in 1994.  He serves on the engineering advisory boards of the University of Illinois, the University of Texas, and Southern Methodist University. </p>\n\n<p>Bob received a B.S. degree in Electrical Engineering from the University of Illinois in 1969 and an M.B.A. degree from Southern Methodist University in 1980. Bob holds three patents in various areas of semiconductor design. </p>","image":{"available_sizes":[[[113,150],"assets/images/resized/0002/8833/28833v1-max-150x150.jpg"],[[178,235],"assets/images/resized/0002/8833/28833v1-max-250x250.jpg"],[[178,235],"assets/images/resized/0002/8833/28833v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director, Dallas","firm":{"name":"Centerpoint Ventures","permalink":"centerpoint-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,101],"assets/images/resized/0000/3472/3472v1-max-150x150.png"],[[200,136],"assets/images/resized/0000/3472/3472v1-max-250x250.png"],[[200,136],"assets/images/resized/0000/3472/3472v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}