{"first_name":"Bob","last_name":"Goldberg","permalink":"bob-goldberg","crunchbase_url":"http://www.crunchbase.com/person/bob-goldberg","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Second Century Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Dec 30 12:17:04 UTC 2009","updated_at":"Wed Dec 22 18:22:04 UTC 2010","overview":"<p>Bob Goldberg is a Second Century Ventures Officer and Senior Vice President of Marketing, Business Development and Commercial Services for the NATIONAL ASSOCIATION OF REALTORS®. Bob has keen insight into the corporate initiatives and resources within NAR and helps to identify, promote and execute on synergies between Second Century Ventures potential investments / current portfolio companies and NAR’s operating units.</p>\n\n<p>At NAR, Bob oversees the teams who are building the REALTOR® brand and its value to both members and the Association. Through his lucrative negotiations with Fortune 500 and other companies, Bob built the REALTOR Benefits® alliance program to provide value to members and generate significant non-dues revenues for the Association. He also oversees the Internet Products group and Marketing Research group providing market-related research, competitive intelligence, and management of the organization&#8217;s marketing database. Bob also oversees the Commercial Real Estate group whose focus is supporting the commercial real estate segment. Bob also serves as President and Chief Executive Officer of REALTORS® Information Network (RIN).</p>\n\n<p>Prior to joining NAR, Bob spent 11 years with PRC Realty Systems (now Interealty Corp.), the nation&#8217;s leading provider of computer-based real estate information systems with $85M in annual revenues. Bob held key management positions in Business Operations, Sales, Product Marketing, Product Support and Customer Services. Previously, he was the National Marketing Manager with IFI/Plenum Data Corp., a leader in online information database products.</p>\n\n<p>Bob serves on the Board for SentriLock, Inc., Realtors Information Network® RealSelect, Inc, REALTORS® Federal Credit Union and eProperty Data. He is also an observer on the board of Move.com. Bob earned a BA from the University of North Carolina-Chapel Hill.</p>","image":{"available_sizes":[[[94,97],"assets/images/resized/0007/1584/71584v1-max-150x150.jpg"],[[94,97],"assets/images/resized/0007/1584/71584v1-max-250x250.jpg"],[[94,97],"assets/images/resized/0007/1584/71584v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA ","subject":"","institution":"University of North Carolina-Chapel Hill","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Officer","firm":{"name":"Second Century Ventures","permalink":"second-century-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,87],"assets/images/resized/0007/1582/71582v1-max-150x150.png"],[[172,100],"assets/images/resized/0007/1582/71582v1-max-250x250.png"],[[172,100],"assets/images/resized/0007/1582/71582v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}