{"first_name":"Bob","last_name":"Zimmerman","permalink":"bob-zimmerman","crunchbase_url":"http://www.crunchbase.com/person/bob-zimmerman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jan 30 13:33:49 UTC 2011","updated_at":"Sun Jan 30 13:54:58 UTC 2011","overview":"<p>Bob’s distinguished career in custom software development spans more than two decades and has been largely dedicated to the process of leveraging technology to drive innovation and growth. As Geneca&#8217;s CTO, Bob Zimmerman continues to build on his work as the driving force behind Getting Predictable, the requirements definition and project best practices that are the foundation of Geneca’s mission to make software development predictable. He continues to extend these best practices to leverage more value for clients and new growth opportunities for Geneca. </p>\n\n<p>Bob is a specialist in software management, strategic planning, and software process initiatives and is known for his success in driving software engineering teams to improve quality and productivity. Bob&#8217;s uniquely practical, common sense approach to software development enables him to coach and mentor people at all levels. Throughout his career, Bob has shared his passion on software delivery with both executive and software development teams, enabling alignment and success throughout the organizations he touches.</p>\n\n<p>Bob has been a finalist for the Illinois Technology Association (ITA)’s 2008 CityLIGHTS Awards in the category of individual CTOs and CIOs making a significant impact on the Illinois technology community. His selection as a finalist was based on his evangelism for Getting PredictableSM.</p>","image":{"available_sizes":[[[150,97],"assets/images/resized/0011/9588/119588v1-max-150x150.jpg"],[[222,145],"assets/images/resized/0011/9588/119588v1-max-250x250.jpg"],[[222,145],"assets/images/resized/0011/9588/119588v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CTO","firm":{"name":"Geneca","permalink":"geneca","type_of_entity":"company","image":{"available_sizes":[[[150,42],"assets/images/resized/0011/9584/119584v3-max-150x150.jpg"],[[250,70],"assets/images/resized/0011/9584/119584v3-max-250x250.jpg"],[[450,127],"assets/images/resized/0011/9584/119584v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}