{"first_name":"Bob","last_name":"Obuch","permalink":"bob-obuch","crunchbase_url":"http://www.crunchbase.com/person/bob-obuch","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Nov 25 06:38:18 UTC 2008","updated_at":"Mon May 18 12:48:12 UTC 2009","overview":"<p>With over 40 years of executive management and venture capital experience, Bob&#8217;s professional accomplishments make him well equipped to handle challenging negotiations, formulate concise business strategies, and guide management teams through their growth years. Bob particularly enjoys assisting early stage infrastructure and enterprise software companies in meeting and exceeding their business plan objectives.</p>\n\n<p>Prior to joining Palomar, Bob was a founding partner of BA Ventures, (now Scale Partners). While at BAVP, Bob took an active role in Cogency Software, INNOVION, Prolinx, SpeechWorks, Synthon, and VNUS Medical. Over the years Bob led numerous successful ventures including Aurum/BAAN, XLNT/Intel and NetDialog/KANA.</p>\n\n<p>Earlier in his career, Bob held several senior management operating positions with technology based software and service companies. From 1987 to 1994, Bob was President and CEO of two software application companies, Computerized Lodging Systems, Inc., and Command Data Systems.</p>\n\n<p>Bob also served as Executive Vice President of Sales and Marketing for Multimate International and as Vice President and General Manager for Systems and Computer Technology, Inc. Previously, he enjoyed a ten year career with Automatic Data Processing.</p>\n\n<p>Bob currently serves on the boards of Ravenflow, Fulcrum, Mixed Signals, OptoElectronix and Woven Systems.</p>","image":{"available_sizes":[[[129,150],"assets/images/resized/0004/4420/44420v1-max-150x150.jpg"],[[180,208],"assets/images/resized/0004/4420/44420v1-max-250x250.jpg"],[[180,208],"assets/images/resized/0004/4420/44420v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Palomar Ventures","permalink":"palomar-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,23],"assets/images/resized/0002/9521/29521v1-max-150x150.png"],[[250,38],"assets/images/resized/0002/9521/29521v1-max-250x250.png"],[[450,69],"assets/images/resized/0002/9521/29521v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}