{"first_name":"Bob","last_name":"Metcalfe","permalink":"bob-metcalfe","crunchbase_url":"http://www.crunchbase.com/person/bob-metcalfe","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Polaris Venture Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Nov 13 17:49:37 UTC 2008","updated_at":"Mon Mar 28 17:39:56 UTC 2011","overview":"<p>Dr. Robert M. Metcalfe joined Polaris in 2001 and is a general partner in our Waltham office.</p>\n\n<p>He holds the position of Professor of Electrical Engineering and Director of Innovation at The University of Texas at Austin</p>\n\n<p>Experience:\nBob had three careers in technological innovation before becoming a venture capitalist:</p>\n\n<p>While an engineer-scientist (1965-1979), Bob helped pioneer the Internet. In 1973, at the Xerox Palo Alto Research Center, he invented Ethernet, the local-area networking (LAN) standard on which he shares four patents. Now, 35 years later, about 350 million new Ethernet ports are shipped annually.</p>\n\n<p>While an entrepreneur-executive (1979-1990), Bob founded 3Com Corporation, the billion-dollar networking company where at various times he was Chairman, CEO, division general manager, and vice president of engineering, sales, and marketing.</p>\n\n<p>While a publisher-pundit (1990-2000), Bob was CEO of IDG&#8217;s InfoWorld Publishing Company (1992-1995). For eight years, he opined about the Internet in an InfoWorld column read weekly by half a million information technologists.</p>\n\n<p>Bob&#8217;s books include Packet Communication, Beyond Calculation, and Internet Collapses.</p>\n\n<p>Boards:\nBob serves on the boards of Polaris-backed start-ups including 1366, Ember, Greenfuel,  Infinite Power Solutions, Mintera,  SiCortex, and SiOnyx. Bob is a director-trustee-advisor to Avistar, St. Mark’s School, USC Stevens,  MIT,  MIT’s Technology Review Magazine, MIT&#8217;s McGovern Institute for Brain Research, and the MIT Energy Initiative.</p>\n\n<p>Education:\nBob graduated from the Massachusetts Institute of Technology in 1969 with two bachelor degrees, in electrical engineering and in industrial management. He received a master degree in applied mathematics from Harvard University in 1970. In 1973, he received his Ph.D. in computer science from Harvard, where his dissertation was Packet Communication.</p>\n\n<p>Awards:\nIn 1980, Bob received the Hopper Award from the Association for Computing Machinery (ACM). In 1988, he received the Bell Medal from the Institute of Electrical and Electronics Engineers (IEEE). In 1995, Bob was elected to the American Academy of Arts and Sciences. In 1996, he received the IEEE&#8217;s Medal of Honor. In 1997, he was elected to the National Academy of Engineering, and in 1999, to the International Engineering Consortium. In 2003, Bob received the Marconi Prize and was inducted into the Bay Shore High School Hall of Fame. In a 2005, Bob received the National Medal of Technology for his &#8220;leadership in the invention, standardization, and commercialization of Ethernet.&#8221; Bob entered the National Inventors Hall of Fame in 2007 and the Computer History Museum Hall of Fellows in 2008.</p>","image":{"available_sizes":[[[91,150],"assets/images/resized/0002/8638/28638v2-max-150x150.jpg"],[[117,192],"assets/images/resized/0002/8638/28638v2-max-250x250.jpg"],[[117,192],"assets/images/resized/0002/8638/28638v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Polaris Venture Partners","permalink":"polaris-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,36],"assets/images/resized/0001/1153/11153v1-max-150x150.png"],[[163,40],"assets/images/resized/0001/1153/11153v1-max-250x250.png"],[[163,40],"assets/images/resized/0001/1153/11153v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Professor of Innovation and Murchison Fellow of Free Enterprise","firm":{"name":"Polaris Venture Partners","permalink":"polaris-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,36],"assets/images/resized/0001/1153/11153v1-max-150x150.png"],[[163,40],"assets/images/resized/0001/1153/11153v1-max-250x250.png"],[[163,40],"assets/images/resized/0001/1153/11153v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}