{"first_name":"Bob","last_name":"Christiansen","permalink":"bob-christiansen","crunchbase_url":"http://www.crunchbase.com/person/bob-christiansen","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Dec 01 12:53:56 UTC 2008","updated_at":"Mon Dec 01 12:57:34 UTC 2008","overview":"<p>Bob Christiansen is a founding Managing Director of Southern Cross Venture Partners. Previously, he was a General Partner and member of the Investment Committee of the venture capital firm Allen &amp; Buckeridge for eight years. At A&amp;B he was a Director of several portfolio companies, including eServ Global, Wedgetail Communications, VaST Systems, 8020 Software, Fultec Semiconductor, Mantara, Xerocoat and ActiveTorque. He is also a director of the Queensland Government supported technology incubator, iLab.</p>\n\n<p>As an active investor and board member, Bob brings his more than thirty years of experience in computer services, software, and technology with an emphasis on technology applications, business management and operations, system design and development. This experience has been obtained in both large international and small entrepreneurial companies primarily in the USA and Europe.</p>\n\n<p>Bob spent seven years in senior operations and technology roles with Automatic Data Processing Inc (ADP) in Europe and the US. Subsequently, he helped found two US-based technology companies, including Corbel &amp; Co – a Florida software company applying artificial intelligence technology in the field of complex document creation. Corbel grew from a small start-up to a leading provider of computer and related services to the employee benefits industry in the US and in 1993, was successfully sold to NASDAQ listed Broadway &amp; Seymour Inc. Prior to returning to Australia in 1998 Bob acted as Chief Technology Officer for the Advisor Technology Services Division of Fidelity Investments in Boston. Fidelity is the world’s largest mutual fund company.</p>\n\n<p>He holds a Bachelor of Economics and a Diploma of Information Processing from the University of Queensland.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0003/0458/30458v1-max-150x150.jpg"],[[100,150],"assets/images/resized/0003/0458/30458v1-max-250x250.jpg"],[[100,150],"assets/images/resized/0003/0458/30458v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founding Managing Director","firm":{"name":"Southern Cross Venture Partners","permalink":"southern-cross-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,39],"assets/images/resized/0003/0451/30451v1-max-150x150.jpg"],[[250,65],"assets/images/resized/0003/0451/30451v1-max-250x250.jpg"],[[320,84],"assets/images/resized/0003/0451/30451v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}