{"first_name":"Bob","last_name":"Iannucci","permalink":"bob-iannucci","crunchbase_url":"http://www.crunchbase.com/person/bob-iannucci","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"rollApp","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Feb 15 22:42:02 UTC 2012","updated_at":"Thu Feb 23 03:05:53 UTC 2012","overview":"<p>Bob Iannucci is founder and owner of RAI Laboratory LLC – a firm that develops advanced mobile computing technology. Bob is also a consultant, advising clients on mobile systems strategy and the creation of innovation teams and environments.</p>\n\n<p>Previously, Bob was Chief Technology Officer and Head of the worldwide Research Center for Nokia. As CTO, he oversaw the creation of new mobile technologies and initiated and led major initiatives to fundamentally redesign the Nokia user interface and to re-architect Nokia phones at the silicon system level.</p>\n\n<p>Bob played a defining role in Nokia&#8217;s research and development work, transforming new technology creation from a closed- to an open-innovation model. Under his guidance, Nokia created TrafficWorks (traffic congestion prediction and re-routing), the Morph Concept (enabling dramatic advances of functionality in mobile phones using nanotechnology) and Point and Find (zero-click search using a phone’s camera and image recognition technology).</p>\n\n<p>Dr. Iannucci holds a Ph.D. in Electrical Engineering and Computer Science from the Massachusetts Institute of Technology, and is the author and co-author of two books and several academic papers. He has five patents.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Advisor","firm":{"name":"rollApp","permalink":"rollapp","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0019/1968/191968v2-max-150x150.png"],[[250,81],"assets/images/resized/0019/1968/191968v2-max-250x250.png"],[[450,146],"assets/images/resized/0019/1968/191968v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.iannucci.org","title":""}]}