{"first_name":"Bob","last_name":"Rosin","permalink":"bob-rosin","crunchbase_url":"http://www.crunchbase.com/person/bob-rosin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Qik","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri May 21 20:28:31 UTC 2010","updated_at":"Fri Oct 07 01:21:11 UTC 2011","overview":"<p>Mr. Bob Rosin is a seasoned entrepreneur and proven executive with leadership experience in building new businesses related to the Internet, connected applications, and mobile devices.  Bob is presently head of business development for Skype.  Bob&#8217;s role encompasses consumer, enterprise, service provider and other partnerships across mobile, desktop, and embedded devices on a global basis.</p>\n\n<p>Previously, Bob was EVP responsible for Corporate Development, Business Development, and Sales at Qik, Inc., a pioneer and the market leader in video communication and sharing from smartphones.</p>\n\n<p>Qik&#8217;s service grew from 600k to 5M users in 2010 and benefited from partnerships for embedding in over 75 million devices with leading mobile players including Sprint, T-Mobile, Samsung, Nokia, LG, HTC, Motorola, and other mobile operators and device manufacturers. Qik was backed by leading investors including Marc Andreessen, Ben Horowitz, Marc Benioff, Camp Ventures, Quest Venture Partners, and Almaz Capital.  Qik was acquired by Skype in January 2011 for $150M.</p>\n\n<p>At Sony Corporation, Bob was responsible for interactive set-top box business and product planning, where he designed satellite receiver products with DirecTV, built the WebTV business from $0 to over $100M in revenue, and incubated Navio Technologies (acquired by Liberate). After Sony, Bob built two high-profile Silicon Valley startups from scratch and has raised over $117M in venture capital from firms including Sequoia Capital, Atlas Venture, Azure Capital Partners, Paladin Capital Group, AsiaTech Management, Motorola Ventures, Wasserstein Ventures, Angel Investors LP, and others. Bob served as SVP Sales and Marketing at OQO, a pioneer in handheld computing and developer of the first pocketable PC, and brought the company from zero to over $25M in annual revenue with partnerships with industry leaders including Motorola, Verizon Wireless, and Sprint. Previously, Bob was Founder and President of Bang Networks, an early mover in Internet-based realtime messaging infrastructure with leading financial services and media clients.</p>\n\n<p>Bob received his MBA from Harvard Business School where he won the Dubilier Prize for Entrepreneurship, and received his BA from Cornell University Magna Cum Laude with three majors. Bob lived in Japan for 5 years, passing the Level 1 Japanese Language Proficiency Exam of the Japanese government and publishing a series of Japanese-language essays in the national newspaper Mainichi Shimbun. Bob received Red Herring Top 100 for two companies, is first author on 9 granted US patents related to network technologies and user interface, has a Black Belt in Aikido, and is an avid underwater photographer.</p>","image":{"available_sizes":[[[120,120],"assets/images/resized/0009/1436/91436v2-max-150x150.jpg"],[[120,120],"assets/images/resized/0009/1436/91436v2-max-250x250.jpg"],[[120,120],"assets/images/resized/0009/1436/91436v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"","institution":"Harvard University","graduated_year":2000,"graduated_month":null,"graduated_day":null},{"degree_type":"BA Magna Cum Laude","subject":"College Scholar","institution":"Cornell University","graduated_year":1992,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Head of Business Development","firm":{"name":"Skype","permalink":"skype","type_of_entity":"company","image":{"available_sizes":[[[150,66],"assets/images/resized/0000/1387/1387v12-max-150x150.jpg"],[[250,110],"assets/images/resized/0000/1387/1387v12-max-250x250.jpg"],[[315,139],"assets/images/resized/0000/1387/1387v12-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"EVP, Business Development, Corporate Development, and Sales","firm":{"name":"Qik","permalink":"qik","type_of_entity":"company","image":{"available_sizes":[[[150,59],"assets/images/resized/0000/2758/2758v10-max-150x150.png"],[[250,99],"assets/images/resized/0000/2758/2758v10-max-250x250.png"],[[450,178],"assets/images/resized/0000/2758/2758v10-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}