{"first_name":"Bob","last_name":"Davis","permalink":"bob-davis-3","crunchbase_url":"http://www.crunchbase.com/person/bob-davis-3","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jun 27 12:20:49 UTC 2009","updated_at":"Sat Jun 27 12:21:32 UTC 2009","overview":"<p>Bob Davis serves as CEO of Sentilla, a provider of innovative demand-side energy management solutions. Under Bob’s leadership, the company has secured significant venture funding to further develop its wireless sensor network and expand operations worldwide. Sentilla uses tiny interconnected computers placed throughout commercial and industrial facilities to monitor the power use of individual pieces of equipment, enabling companies to measure and reduce energy consumption, and enhance both environmental and financial performance. </p>\n\n<p>Bob has nearly three decades of transforming promising companies with great technology into successful businesses. Previously, Bob served as President and CEO of Netreon through its acquisition by CA Inc., (formerly Computer Associates). Bob was Senior Vice President and General Manager of the Storage Business Unit at CA and Senior Vice President of Corporate Marketing at Novell. He also co-founded and led Kaseya, a global provider of IT automation software and worked in Marketing and Sales at Intel. </p>\n\n<p>Bob holds an MBA with a concentration in Marketing from the University of Santa Clara, and a B.S. in Electrical Engineering from Purdue University. Bob is an avid sports enthusiast and enjoys flying airplanes.</p>","image":{"available_sizes":[[[95,119],"assets/images/resized/0005/1129/51129v1-max-150x150.jpg"],[[95,119],"assets/images/resized/0005/1129/51129v1-max-250x250.jpg"],[[95,119],"assets/images/resized/0005/1129/51129v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"Sentilla","permalink":"sentilla","type_of_entity":"company","image":{"available_sizes":[[[150,67],"assets/images/resized/0005/1127/51127v3-max-150x150.png"],[[150,67],"assets/images/resized/0005/1127/51127v3-max-250x250.png"],[[150,67],"assets/images/resized/0005/1127/51127v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}