{"first_name":"Bob","last_name":"Thompson","permalink":"bob-thompson","crunchbase_url":"http://www.crunchbase.com/person/bob-thompson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Dec 02 20:18:40 UTC 2008","updated_at":"Tue Dec 02 20:21:01 UTC 2008","overview":"<p>Mr. Thompson has over twenty years of business experience including accounting, operational and startup. Prior to joining Southpaw Asset Management LP, Mr. Thompson was Managing Director and Chief Financial Officer of C.E. Unterberg, Towbin from January 1992 to April 2005, where he supervised a staff of five, and was responsible for all financial controls, reporting and much of the business operations including banking/clearing relationships, insurance/risk management, planning and budgeting, contracts, as well as payroll/benefits administration. Mr. Thompson was also instrumental in launching many of C.E. Unterberg, Towbin’s hedge and private equity fund products, including review of offering memorandums and partnership agreements and selecting third-party providers for prime-brokerage, fund administration and back-office/accounting. He also liaised with regulators from NASD, SEC and federal/state taxing authorities. Prior to 1992, he was an audit Manager with Deloitte &amp; Touche (via their acquisition of the Los Angeles office of Spicer &amp; Oppenheim) from November 1985 to June 1991. Mr. Thompson received his B.A. in Business Economics from the University of California at Santa Barbara, and is a Certified Public Accountant.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Financial Officer & Chief Compliance Officer","firm":{"name":"Southpaw Asset Management","permalink":"southpaw-asset-management","type_of_entity":"financial_org","image":{"available_sizes":[[[150,36],"assets/images/resized/0003/0675/30675v1-max-150x150.jpg"],[[250,61],"assets/images/resized/0003/0675/30675v1-max-250x250.jpg"],[[434,107],"assets/images/resized/0003/0675/30675v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}