{"first_name":"Bob","last_name":"Ehlers","permalink":"bob-ehlers","crunchbase_url":"http://www.crunchbase.com/person/bob-ehlers","homepage_url":"http://www.hatuespot.net","birthplace":"San Francisco","twitter_username":"HauteSpotNet","blog_url":"http://blog.hautespot.net","blog_feed_url":"http://blog.hautespot.net/feeds/posts/default","affiliation_name":"Unaffiliated","born_year":1962,"born_month":2,"born_day":7,"tag_list":"wireless-video, surveillance, video-over-ip, mobile-video-surveillance","alias_list":null,"created_at":"Wed May 23 23:33:31 UTC 2012","updated_at":"Thu May 24 14:38:48 UTC 2012","overview":"<p>Bob is the founder of HauteSpot Networks Corporation, maker of wireless routers, VPN gateways and video edge processing devices for the surveillance and security industry.</p>\n\n<p>Bob has a varied background in technology and business management. </p>\n\n<p>Bob grew up in Marin County and after high school, enlisted in the US Coast Guard, where he held various roles and he remained in the reserves for two enlistments. After discharge from active duty, Bob went to college at Cal Poly San Luis Obispo where he studied Marketing and International Management. </p>\n\n<p>For the next 15 years he worked in the shipping and logistics business for American President Lines where he held various roles including the Managing Director of APL Lanka Agencies Pvt Limited, APLs agent in Sri Lanka.</p>\n\n<p>After leaving APL in 1997 Bob worked for a short time at Intrepid Systems, a merchandising management company that was acquired by PeopleSoft. Then he went to work for Inktomi which as an Internet search pioneer. Bob was the VP of Business Services (CIO) and helped to grow the company from 39 to 1700 employees in 2 years.</p>\n\n<p>In 2001 Bob left Inktomi to work for Ziatech, which was immediately acquired by Intel. For the next two years he worked in Product Marketing for embedded computing devices. The former Ziatech entity was acquired by Performance Technologies and Bob stayed on as Director of Product Management.</p>\n\n<p>In 2006 Bob struck out on his own to start HauteSpot Networks. HauteSpots first products were embedded wireless routers with integrated MPEG2 encoding, designed for TV electronic news gathering. Bob has continually innovated from this core concept of combing video and digital wireless transmission. HauteSpot now has a broad array of products primarily for the surveillance industry.</p>\n\n<p>Bob likes to ride motorcycles, both on and off the road. He is an avid scuba diver and has dove all around the world. He is married to Charlotte and has two wonderful kids and three great step kids. He is active in the Boy Scouts, the Foriegn Legion, </p>","image":{"available_sizes":[[[113,150],"assets/images/resized/0019/1338/191338v2-max-150x150.jpg"],[[188,250],"assets/images/resized/0019/1338/191338v2-max-250x250.jpg"],[[339,450],"assets/images/resized/0019/1338/191338v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}