{"first_name":"Bono","last_name":"Rockstar","permalink":"bono-rockstar","crunchbase_url":"http://www.crunchbase.com/person/bono-rockstar","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Elevation Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Tue Jan 19 07:49:50 UTC 2010","updated_at":"Tue Jan 19 07:49:50 UTC 2010","overview":"<p>Bono is a Managing Director and Co-Founder of Elevation Partners.</p>\n\n<p>Bono is the lead singer of Irish rock group U2, one of the most well-known and successful bands in the history of the recorded music industry. Since 1977, U2 has gained an extensive audience through their spellbinding live performances and critically acclaimed recordings. They have sold over 150 million albums worldwide and won 22 Grammy Awards. U2 has also been an industry leader in the management of its business operations and intellectual property. Unlike many artists, U2 owns and controls most of its own catalog.</p>\n\n<p>Bono is also a committed and successful activist in global politics and development policy. During 1999-2000, Bono played a leading role in persuading the U.S. and other industrialized nations to write-off over $30 billion of old debt owed by the poorest countries, so that the monies freed up could be spent on health and education. In partnership with other activists, his campaigning efforts contributed to the U.S. decision to triple foreign assistance to Africa, and to mount a response to the AIDS crisis, resulting in 2 million Africans receiving life-saving anti-retroviral medication. He is a co-founder of ONE, a campaign backed by more than 2 million people from around the world who are committed to the fight against extreme poverty and preventable disease. He also co-founded (RED), a private sector initiative involving some of the world&#8217;s leading brands. (RED) channels funds from purchases of (RED) products to The Global Fund’s programs fighting AIDS in Africa.</p>\n\n<p>Bono has received numerous honors during his career for music and activism, including the French Legion of Honor (2003), an Honorary British Knighthood (2007), and Honorary Doctorates from the University of Pennsylvania and the University of Dublin, Trinity College. He has been nominated for the Nobel Peace Prize multiple times, and in 2005 was named by Time Magazine&#8217;s person of the year along with Bill and Melinda Gates.</p>","image":{"available_sizes":[[[150,44],"assets/images/resized/0007/3913/73913v1-max-150x150.png"],[[250,73],"assets/images/resized/0007/3913/73913v1-max-250x250.png"],[[406,120],"assets/images/resized/0007/3913/73913v1-max-450x450.png"]],"attribution":"<p>Elevation Partners</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder and Managing Director","firm":{"name":"Elevation Partners","permalink":"elevation-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,28],"assets/images/resized/0004/1053/41053v1-max-150x150.jpg"],[[250,47],"assets/images/resized/0004/1053/41053v1-max-250x250.jpg"],[[400,76],"assets/images/resized/0004/1053/41053v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}