{"first_name":"boxpn","last_name":"vpn","permalink":"boxpn-vpn","crunchbase_url":"http://www.crunchbase.com/person/boxpn-vpn","homepage_url":"https://www.boxpn.com","birthplace":"","twitter_username":"boxpn","blog_url":"http://www.facebook.com/boxpn","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1998,"born_month":null,"born_day":null,"tag_list":"vpn, vpn-service, buy-vpn, cheap-vpn, us-vpn, uk-vpn","alias_list":null,"created_at":"Tue Sep 13 06:25:38 UTC 2011","updated_at":"Tue Jan 03 13:03:44 UTC 2012","overview":"<p>boxpn vpn service is providing global VPN services for your World Wide Online Security.</p>\n\n<p>&lt;a href &quot;www.boxpn.com&quot;&gt;boxpn vpn service &lt;/a&gt; creates encrypted secure tunnel connection between your computer and our servers with up to 2048 Bit encryption.</p>\n\n<p>This way, all your internet traffic goes through our vpn servers and you become anonymous on the net. Even your ISP can not see what you are up to on the internet.</p>\n\n<p>Also if you have any web restrictions at work, in your country or by your ISP, this will not effect you when you use boxpn. You will be totally free in the internet.</p>\n\n<p>Internet is yours, not your governments. Now is time to use it!</p>\n\n<p>Maximum speed is given our top priority by boxpn. All servers are connected directly to the worldwide 220Gbit high-speed backbone of PlusServer AG, Softlayer Technologies Inc., UK2 Group and iWeb Technologies which have direct connections to the most important providers and the largest European and US locations.</p>\n\n<p>boxpn, has vpn server network in USA, UK, Canada, Germany, France, Turkey, Sweden, Singapore and Spain.</p>\n\n<p>Security at boxpn!</p>\n\n<p>We understand how important  for you  to be anonymous and secure. So we secured all our server with Microsoft TMG. TMG secures your VPN experience with malware-spyware and anti-virus scanning. Also phishing sites are scanned daily and we keep you secure from these sites.</p>\n\n<p>boxpn has the strongest 2048bit SSTP encryption available at all our servers. Theoritically, it takes around 1 Million years for super computer to decrypt our data.</p>\n\n<p>Also boxpn never collect your logs, so all your data is anonymous.</p>","image":{"available_sizes":[[[150,48],"assets/images/resized/0015/3894/153894v2-max-150x150.png"],[[250,81],"assets/images/resized/0015/3894/153894v2-max-250x250.png"],[[450,146],"assets/images/resized/0015/3894/153894v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}