{"first_name":"Brad","last_name":"Bostic","permalink":"brad-bostic","crunchbase_url":"http://www.crunchbase.com/person/brad-bostic","homepage_url":"http://www.bostechcorp.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"ChaCha","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Aug 11 10:48:59 UTC 2007","updated_at":"Sat Feb 11 02:36:16 UTC 2012","overview":"<p>Brad Bostic is an entrepreneurial leader who has founded and led multiple high-growth technology companies, serving in the capacities of CEO and President.  Brad has built successful companies in the mobile, SaaS, and enterprise software markets.  He has been nationally recognized for his achievements in business, including honors as an Indianapolis Business Journal “40 Under 40” award recipient recognizing the state’s top business leaders under the age of forty.</p>\n\n<p>Brad co-founded ChaCha, a mobile and online Q&amp;A service, in January 2006 and served as President through February 2009.  Under his leadership, ChaCha became the world’s fastest growing text (SMS) search and Q&amp;A service, winning a number of awards including AT&amp;T Fast Pitch, Fierce 15 Most Influential Mobile Companies, and Frost &amp; Sullivan’s Most Innovative Mobile Search product.  </p>\n\n<p>Bostic resumed his role as CEO of Bostech®, a provider of enterprise cloud solutions powered by its world class information exchange technology platform, in July of 2009. The company has two product brands operating as separate business units: hc1.com® and ChainBuilder®. </p>\n\n<p>The hc1.com Healthcare Relationship Management® solution helps medical labs win more clients and serve them for life.  It is a key strategic asset for lab industry leaders including Alere, South Bend Medical Foundation, know error, NeoGenomics, and Cancer Genetics, Inc.</p>\n\n<p>ChainBuilder makes it easy for emerging Web applications in multiple markets including healthcare, retail, e-commerce, and energy to exchange information with on premise business systems.  More than 250 companies, including Amazon.com, Exact Target, Home Depot, and Configure One rely on ChainBuilder to power mission critical transactions today.</p>\n\n<p>Brad graduated from Indiana University, where he majored in business with an emphasis on Information Systems. When he isn&#8217;t building cutting-edge technology companies or scaring his white-knuckled car passengers by showing his dance moves while driving through ice storms, Brad loves to push his limits snowboarding through the trees in the Colorado Rockies. Brad also enjoys skateboarding, football, Guitar Hero III, and sharing time with his wife, Amy, and their three young children.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0002/6885/26885v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0002/6885/26885v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0002/6885/26885v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"President & Co-Founder","firm":{"name":"ChaCha","permalink":"chacha","type_of_entity":"company","image":{"available_sizes":[[[150,89],"assets/images/resized/0010/6139/106139v1-max-150x150.jpg"],[[240,143],"assets/images/resized/0010/6139/106139v1-max-250x250.jpg"],[[240,143],"assets/images/resized/0010/6139/106139v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}