{"first_name":"Brad","last_name":"Smith","permalink":"brad-smith-2","crunchbase_url":"http://www.crunchbase.com/person/brad-smith-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 12 22:13:54 UTC 2008","updated_at":"Thu Jun 12 22:15:26 UTC 2008","overview":"<p>Brad Smith is Microsoft&#8217;s Senior Vice President, General Counsel and Corporate Secretary. He leads the company&#8217;s Department of Legal and Corporate Affairs, which is responsible for all legal work and for government, industry and community affairs activities.</p>\n\n<p>Smith has played a leading role at Microsoft on intellectual property, competition law, and other Internet legal and public policy issues. He is also the company&#8217;s chief compliance officer. Since becoming general counsel in 2002, he has overseen numerous negotiations with governments and other companies, including Microsoft&#8217;s 2002 antitrust settlement with state attorneys general, its 2002 data privacy negotiations with the Federal Trade Commission and European Commission, and agreements to address antitrust or IP issues with Time Warner, Sun Microsystems, RealNetworks, IBM and Novell.</p>\n\n<p>Smith is responsible for Microsoft&#8217;s intellectual property work, including all of its IP portfolio, licensing and public policy activities. He has helped spearhead the growth in the company&#8217;s patent portfolio and the launch of global campaigns to bring enforcement actions against those engaged in software piracy and counterfeiting and against viruses, spyware and other threats to Internet safety. He is also responsible for the expansion of Microsoft’s citizenship and philanthropic activities, work to revise its contracts to make them more customer-friendly, and the strengthening of legal compliance programs, issuing Standards of Business Conduct for all Microsoft employees and creating an Office of Legal Compliance.</p>\n\n<p>Smith previously worked for five years as Deputy General Counsel for Worldwide Sales, and before that, he spent three years managing the company&#8217;s European Law and Corporate Affairs group, based in Paris. Before joining Microsoft, he was a partner at Covington &amp; Burling, having worked in the firm&#8217;s Washington, D.C. and London offices and represented a number of companies in the computing industry.</p>\n\n<p>Smith graduated summa cum laude from Princeton University, where he received the Class of 1901 Medal, the Dewitt Clinton Poole Memorial Prize, and the Harold Willis Dodds Achievement Award, the highest award given to a graduating senior at commencement. He was a Harlan Fiske Stone Scholar at the Columbia University School of Law, where he received the David M. Berger Memorial Award. He also studied international law and economics at the Graduate Institute of International Studies in Geneva, Switzerland.</p>\n\n<p>He has written numerous articles regarding international intellectual property and electronic commerce issues, and has served as a lecturer at the Hague Academy of International Law. </p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0002/0327/20327v1-max-150x150.jpg"],[[167,233],"assets/images/resized/0002/0327/20327v1-max-250x250.jpg"],[[167,233],"assets/images/resized/0002/0327/20327v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.microsoft.com/presspass/exec/bradsmith/default.mspx\" title=\"Microsoft\" rel=\"nofollow\">Microsoft</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"President & CEO","firm":{"name":"elasTiv","permalink":"elastiv","type_of_entity":"company","image":{"available_sizes":[[[85,79],"assets/images/resized/0010/0332/100332v2-max-150x150.png"],[[85,79],"assets/images/resized/0010/0332/100332v2-max-250x250.png"],[[85,79],"assets/images/resized/0010/0332/100332v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Senior Vice President, General Counsel, Corporate Secretary, Legal & Corporate Affairs","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}