{"first_name":"Brad","last_name":"Lakin","permalink":"brad-lakin","crunchbase_url":"http://www.crunchbase.com/person/brad-lakin","homepage_url":"http://www.greatinjurylawyers.com","birthplace":"Saint Louis","twitter_username":"greatinjurylaw","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1970,"born_month":5,"born_day":18,"tag_list":"st--louis-injury-lawyers, personal-injury-lawyers, st--louis-nursing-home-abuse-attorney, missouri-product-liability-attorney, st-louis-medical-malpractice-lawyer, louis-medical-malpractice-attorney, st--louis-medical-malpractice-lawyer","alias_list":null,"created_at":"Thu Nov 29 05:00:18 UTC 2012","updated_at":"Wed Dec 05 07:45:35 UTC 2012","overview":"<p>SL Chapman LLC is group of St. Louis injury lawyers.  We are dedicated and ready to put our innovative approach to complex legal problems to work for you.  With offices in St. Louis, Missouri; Phoenix, Arizona; and Alton, Illinois our highly talented lawyers and staff aggressively, efficiently and skillfully represent clients in complex legal matters throughout the country.\nAs experienced personal injury lawyers, we begin developing a trial strategy from the moment we first meet with you, providing you with a competitive advantage before your case is even filed.  With diverse backgrounds as both plaintiffs’ lawyers and former corporate defense attorneys, we have successfully represented and battled some of the nation’s largest companies.  Our unique insights from this experience allow us to bring a 360-degree approach when preparing your case for trial.\nWe are proud to count among our partners Super Lawyers®, a Million Dollar and Multi-Million Dollar Advocates Forum® member, a Top 100 Trial Lawyer by the National Trial Lawyers and those who have earned the coveted AV (“Preeminent”) rating from Martindale-Hubbell®. Several of our lawyers previously were corporate defense counsel at large defense firms, including a partner in an international law firm; one was a Director of Litigation for a Fortune 500 company; and one holds an Executive MBA from the prestigious Thunderbird School of Global Management. One of our founding partners was named by Law Bulletin Publishing Company as one of “40 Illinois Attorneys Under Forty to Watch.” \nThe accomplished trial lawyers and counselors at SL Chapman LLC draw upon our diverse professional experience in helping our clients solve their complex legal problems. Perhaps this is why we have obtained over $700 million in verdicts, settlements and other benefits on behalf of our clients.\nCoupons (if the site asks):\nFree Books For Injured People &amp; Their Families</p>","image":{"available_sizes":[[[150,32],"assets/images/resized/0022/2929/222929v2-max-150x150.jpg"],[[250,53],"assets/images/resized/0022/2929/222929v2-max-250x250.jpg"],[[409,88],"assets/images/resized/0022/2929/222929v2-max-450x450.jpg"]],"attribution":"<p>Legal Services</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.greatinjurylawyers.com","title":"Personal Injury Lawyers"}]}