{"first_name":"Brad","last_name":"Bridgham","permalink":"brad-bridgham","crunchbase_url":"http://www.crunchbase.com/person/brad-bridgham","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Feb 15 22:40:38 UTC 2008","updated_at":"Thu Apr 03 17:29:27 UTC 2008","overview":"<p>Mr. Bridgham brings over 20 years’ experience managing sales organizations and building relationships within companies of varying sizes from the ranks of the Fortune 500 to emerging single proprietorships. During tenures at PPG Industries and WR Grace Company he developed a broad base of business management expertise with a focus on sales and marketing, weaving value chain activities into innovative product and service offerings to customers and driving profitable growth. While at PPG, Brad held a variety of positions in sales, marketing and operations including Product Manager, Regional Sales Manager, Director of Customer Service and Distribution, Director of Sales and most recently Director of Strategic Markets. His leadership on the implementation of a Customer Relationship Management program, as well as introduction of a new telesales business model within the business, remains a best practice for the organization. At W.R.Grace, Brad rolled out a premier product offering for the industrial paint supply market, applying pocket price waterfall discipline to a non-traditional coatings marketplace. This selling discipline of balancing invoice price with incentives, customer loyalty programs, warranty and product velocity elements to maximize pocket price to the manufacturer has been of particular focus throughout his career. Mr. Bridgham earned his Bachelor of Science Degree from the University of Wisconsin and an MBA in Finance from Waynesburg University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP Sales, Customer Realationship Management","firm":{"name":"QponDirect","permalink":"qpondirect","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0001/2413/12413v1-max-150x150.jpg"],[[176,59],"assets/images/resized/0001/2413/12413v1-max-250x250.jpg"],[[176,59],"assets/images/resized/0001/2413/12413v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}