{"first_name":"Brad","last_name":"Wisler","permalink":"brad-wisler","crunchbase_url":"http://www.crunchbase.com/person/brad-wisler","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"SproutBox","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon May 11 04:22:03 UTC 2009","updated_at":"Thu Feb 11 19:13:45 UTC 2010","overview":"<p>Brad Wisler is an internet entrepreneur, executive, and angel investor.</p>\n\n<p>Brad Wisler has been an entrepreneur since childhood. He has started and run many small businesses in his lifetime, ranging from arts &amp; entertainment production to apparel design to software design. Brad first found significant success in 1998, when he co-founded WorldView Multimedia, the nation’s first new media firm serving clients in politics and government.</p>\n\n<p>Brad Wisler served as CEO and General Manager of Resite Information Technology from 2001 to 2008. During his tenure, he successfully grew the business from an unfunded startup to a nationally recognized leader in web-based software. Brad successfully negotiated the sale of Resite to Dominion Enterprises in 2007, widely regarded as the first multi-million dollar internet software acquisition in Bloomington, Indiana.</p>\n\n<p>On a mission to solve the early stage funding and software development challenges they had faced in previous ventures, Brad founded SproutBox along with Mike Trotzke and Marc Guyer. SproutBox offers entrepreneurs a new form of Venture Capital by investing their talent in startup companies with high growth potential in exchange for equity. SproutBox offers an elite crew of product developers, creatives and business experts to provide programming, business development, accounting, and HR services equivalent to $250,000 to each startup.</p>\n\n<p>In addition to his business success, Brad has been an active civic leader in his town. He has served on the Bloomington City Council since 2006, when he was selected by caucus to complete the term of retiring council member. He was re-elected in 2008 to a four year term. He also currently serves as President of the Monroe County Youth Services Bureau (YSB), which offers crisis counseling services and operates the local youth shelter and Project Safe Place.</p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0007/6761/76761v2-max-150x150.jpg"],[[250,165],"assets/images/resized/0007/6761/76761v2-max-250x250.jpg"],[[368,244],"assets/images/resized/0007/6761/76761v2-max-450x450.jpg"]],"attribution":"<p>Brad Wisler / <a href=\"http://www.sproutbox.com\" title=\"SproutBox\" rel=\"nofollow\">SproutBox</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"co-founder","firm":{"name":"SproutBox","permalink":"sproutbox","type_of_entity":"company","image":{"available_sizes":[[[150,42],"assets/images/resized/0004/3635/43635v2-max-150x150.jpg"],[[250,70],"assets/images/resized/0004/3635/43635v2-max-250x250.jpg"],[[322,91],"assets/images/resized/0004/3635/43635v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"founder","firm":{"name":"ScheduleThing","permalink":"schedulething","type_of_entity":"company","image":{"available_sizes":[[[150,25],"assets/images/resized/0007/6777/76777v2-max-150x150.png"],[[250,42],"assets/images/resized/0007/6777/76777v2-max-250x250.png"],[[344,59],"assets/images/resized/0007/6777/76777v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}