{"first_name":"Brad","last_name":"Templeton","permalink":"brad-templeton","crunchbase_url":"http://www.crunchbase.com/person/brad-templeton","homepage_url":"http://www.templetons.com/brad","birthplace":"","twitter_username":null,"blog_url":"http://ideas.4brad.com","blog_feed_url":"http://ideas.4brad.com/crss","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Nov 04 21:12:51 UTC 2008","updated_at":"Sun Nov 09 19:06:27 UTC 2008","overview":"<p>Brad Templeton is the Chairman of the Board at the Electronic Frontier Foundation.\nHe is active in the computer network community since 1979, was founder and publisher at ClariNet Communications Corp., the #1 Internet-based electronic newspaper publisher until selling it to Newsedge Corporation in 1997.\n Brad participated in the building and growth of USENET from its earliest days, and in 1987 founded and edited rec.humor.funny, the world&#8217;s most widely read computerized conference on that network. He also founded Looking Glass Software Limited, and is the author of a dozen packaged microcomputer software products. He was the first employee of Personal Software/Visicorp, which was the first major microcomputer applications software company, and is the author of a dozen packaged microcomputer software products, including VisiPlot for the IBM-PC, various games, popular tools and utilities for Commodore computers, special Pascal and Basic programming environments designed for education (ALICE), an add-in spreadsheet compiler for Lotus 1-2-3 (3-2-1 Blastoff), and various network related software tools.\n He currently is also on the board of the Foresight Institute. </p>","image":{"available_sizes":[[[72,95],"assets/images/resized/0002/7827/27827v1-max-150x150.jpg"],[[72,95],"assets/images/resized/0002/7827/27827v1-max-250x250.jpg"],[[72,95],"assets/images/resized/0002/7827/27827v1-max-450x450.jpg"]],"attribution":"<p>www.templetons.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}