{"first_name":"Bradford","last_name":"C. Webb, PhD","permalink":"bradford-c-webb-phd","crunchbase_url":"http://www.crunchbase.com/person/bradford-c-webb-phd","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jun 20 09:27:18 UTC 2009","updated_at":"Sat Jun 20 09:27:46 UTC 2009","overview":"<p>Brad Webb is an experienced entrepreneur and investor in the biomedical and biotech industries. In addition to his active role as a Venture Partner at Claremont Creek, Brad consults with other venture firms specializing in medical and pharmaceutical early-stage investing.</p>\n\n<p>After receiving a PhD in Biochemistry and Molecular Biology from the University of California at Santa Barbara in 1979, Brad joined 3M Company&#8217;s ophthalmology products division as a research and development scientist working on designs for post-cataract surgery intraocular lenses. He also supervised human clinical trials and FDA approval processes for 3M. After leaving 3M, Brad led or participated in several start-up ventures in the ophthalmic products industry, with responsibility for research, clinical trials and FDA affairs.</p>\n\n<p>In 1988 Brad founded Vision Biology, Inc., to develop new viscoelastic products for use in eye surgery. Vision Biology&#8217;s revolutionary patented Viscoelastic Surgical Fluid for use during cataract surgery was licensed to Alcon Laboratories in 1996. Brad spent several years consulting for Alcon on a variety of medical product research and development projects, and recently has participated in investments in biotech and medical technology companies.</p>\n\n<p>Brad is a member of Tech Coast Angels, a Southern California based Angel group, is active with UC Santa Barbara technology programs, and will be instrumental in extending the reach of Claremont Creek into the broader Southern California technology region.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0004/9849/49849v1-max-150x150.jpg"],[[166,250],"assets/images/resized/0004/9849/49849v1-max-250x250.jpg"],[[200,300],"assets/images/resized/0004/9849/49849v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Venture Partner","firm":{"name":"Claremont Creek Ventures","permalink":"claremont-creek-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,36],"assets/images/resized/0002/3425/23425v2-max-150x150.jpg"],[[250,60],"assets/images/resized/0002/3425/23425v2-max-250x250.jpg"],[[364,88],"assets/images/resized/0002/3425/23425v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}