{"first_name":"Bradford","last_name":"D. Duea","permalink":"bradford-d-duea","crunchbase_url":"http://www.crunchbase.com/person/bradford-d-duea","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue May 20 12:47:31 UTC 2008","updated_at":"Tue May 20 12:58:05 UTC 2008","overview":"<p>Bradford Duea is the President of Napster. Mr. Duea is responsible for all international activities, including acting as a Board member to Napster Japan (a joint venture with Tower Records Japan), overseeing the business development activities of the company on a worldwide basis, including Napster Mobile, and helping define the strategic direction of the Napster service. He reports directly to Napster&#8217;s CEO and Chairman, Chris Gorog.</p>\n\n<p>From May 2003 to January 2004, Mr. Duea served as Vice President, Worldwide Business Development for Roxio, Inc. (now known as Napster, Inc.), where he was responsible for all business development efforts for the company, including those for Napster.</p>\n\n<p>During this time as VP, Worldwide Business Development at Roxio, Mr. Duea focused on Napster&#8217;s international expansion effort and the formulation of strategic partnerships, including those with Samsung Electronics, Intel, and Gateway. He was an integral member of the transaction team for the acquisition and integration of pressplay (a music subscription joint venture between Sony Music Entertainment and Universal Music Group) and certain assets from VUNet Tech. Prior to his joint duties with Napster and Roxio, from May 2002 to May 2003, Mr. Duea served Roxio as Vice President Worldwide OEM Sales and from February 2001 to May 2002 as Vice President of Business Development. His success in these positions has earned him a reputation as a leader in the initiation and development of global OEM and strategic partnerships. Mr. Duea was instrumental in securing and managing Roxio&#8217;s strategic partnerships with, among others, Microsoft, RealNetworks, Intel, EMI, pressplay and Audible.com. Mr. Duea also led the acquisition and integration of MGI Software, which brought the #1 consumer photo and video editing products into Roxio&#8217;s digital media portfolio.</p>\n\n<p>Prior to joining Roxio, Mr. Duea served as the Vice President, Corporate Development for PeopleSupport, Inc., a provider of integrated e-customer relationship management solutions, where he raised over $50 million in venture financing, and closed strategic partnerships with industry leaders, such as Hewlett Packard and Siebel Systems, Inc. </p>\n\n<p>via: <a href=\"http://investor.napster.com/management.cfm\" title=\"Napster\" rel=\"nofollow\">Napster</a></p>","image":{"available_sizes":[[[83,112],"assets/images/resized/0001/8900/18900v1-max-150x150.jpg"],[[83,112],"assets/images/resized/0001/8900/18900v1-max-250x250.jpg"],[[83,112],"assets/images/resized/0001/8900/18900v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"University of California at Santa Barbara","subject":"","institution":"BA","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"USC","subject":"","institution":"MBA","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"University of San Diego","subject":"","institution":"JD","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"President","firm":{"name":"Napster","permalink":"napster","type_of_entity":"company","image":{"available_sizes":[[[100,96],"assets/images/resized/0001/5810/15810v2-max-150x150.png"],[[100,96],"assets/images/resized/0001/5810/15810v2-max-250x250.png"],[[100,96],"assets/images/resized/0001/5810/15810v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}