{"first_name":"Breakaway","last_name":"Vacation Rentals","permalink":"breakaway-vacation-rentals","crunchbase_url":"http://www.crunchbase.com/person/breakaway-vacation-rentals","homepage_url":"http://www.findyourbreakaway.com","birthplace":"Aspen, Colorado ","twitter_username":"breakawayvr","blog_url":"http://blog.findyourbreakaway.com","blog_feed_url":"http://blog.findyourbreakaway.com/","affiliation_name":"Unaffiliated","born_year":1986,"born_month":4,"born_day":21,"tag_list":"luxury-vacation-rentals, aspen-vacation-rentals, aspen-luxury-rentals","alias_list":null,"created_at":"Sun Apr 01 06:49:41 UTC 2012","updated_at":"Thu Apr 05 20:05:53 UTC 2012","overview":"<p>Changing the way we travel, Breakaway! Vacation Rentals introduces a personalized approach to traveling—combining your vacation preferences with a unique search process to find the perfect vacation rental just for you. With more than 400 luxury properties in various areas of Colorado—Aspen, Carbondale and Snowmass Village—as well as Costa Rica, Breakaway! has set a new standard of extravagance for your vacation needs—offering a collection of apartments, condos, townhomes and houses for individual, family and business travelers alike. Led by founder Tyler Gillespie, a second-generation property manager with a lifetime of realty experience, Breakaway! is guaranteed to make your next vacation one you’ll want to continue to take over and over again.</p>\n\n<p>For Breakaway!, it’s not just about the property—it’s about the experience. Since its inception in 2010, Breakaway! has proven its ability to provide guests with luxury living at an affordable price, offering an extensive list of concierge services to make your stay more comfortable. With more than five years of rental experience in the Aspen area, Gillespie has taken the travel industry by storm as a leader in vacation planning—developing a network of pre-screened rental properties that guarantee guests up-to-date availability, quality facilities and verified listings. Most importantly, through the state-of-the art services he provides, Gillespie gives guests the opportunity to relax and enjoy the essence of traveling: discovery.  “Vacation rentals open doors to travel and see the world,” Gillespie says. “I love it. That’s why I started this business.”</p>","image":{"available_sizes":[[[150,131],"assets/images/resized/0018/2105/182105v2-max-150x150.jpg"],[[250,219],"assets/images/resized/0018/2105/182105v2-max-250x250.jpg"],[[450,394],"assets/images/resized/0018/2105/182105v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.findyourbreakaway.com","title":"Breakaway Vacation Rentals "}],"web_presences":[{"external_url":"http://www.findyourbreakaway.com","title":"Breakaway Vacation Rentals "}]}