{"first_name":"Brendon","last_name":"Kensel","permalink":"brendon-kensel","crunchbase_url":"http://www.crunchbase.com/person/brendon-kensel","homepage_url":"http://www.KenselandCo.com","birthplace":"","twitter_username":"KenselandCo","blog_url":"http://www.kenselandco.com/blog/","blog_feed_url":"http://www.kenselandco.com/blog/feed/rss","affiliation_name":"Kensel & Co. ","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Jul 11 19:25:47 UTC 2009","updated_at":"Thu Nov 24 04:16:15 UTC 2011","overview":"<p>Brendon Kensel is an experienced entrepreneur and investment banking professional with a deep background in building and advising high-growth companies. He is a recognized industry expert in the media, marketing, and technology sectors and has advised leading companies and private equity firms regarding mergers and acquisitions, industry consolidation, new market entry, divestitures, and strategic alliances. Mr. Kensel has also founded several companies including PrimaHealth Credit, a patient-friendly healthcare finance company, and Jock Talk, a first-of-its-kind social media platform for professional athletes and fans.</p>\n\n<p>Mr. Kensel is currently the Managing Partner of Kensel &amp; Co., an advisory firm that partners with high-growth companies and private equity firms to provide corporate finance, merger and acquisition, and strategic planning services. Kensel &amp; Co. has particular expertise within the media, marketing, technology, and business services sectors. The firm is also a principal investor in a range of companies.</p>\n\n<p>Mr. Kensel serves as a member of the Board of Directors of Project Access, a non-profit organization that assists low-income families by providing educational, health, and social services. He regularly works other board members and community volunteers to further the organization’s goals of keeping family members employed, children in school and seniors active.</p>\n\n<p>Mr. Kensel received a B.S. from Central Washington University and a M.B.A. from the Graziadio School of Business and Management at Pepperdine University. He studied global enterprise management at Kellogg College, University of Oxford. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing Partner","firm":{"name":"Kensel & Co. ","permalink":"kensel-co","type_of_entity":"financial_org","image":{"available_sizes":[[[150,59],"assets/images/resized/0005/2619/52619v2-max-150x150.png"],[[224,89],"assets/images/resized/0005/2619/52619v2-max-250x250.png"],[[224,89],"assets/images/resized/0005/2619/52619v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}