{"first_name":"Brennan","last_name":"Hayden","permalink":"brennan-hayden","crunchbase_url":"http://www.crunchbase.com/person/brennan-hayden","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"WDA","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Dec 28 18:56:01 UTC 2011","updated_at":"Sat Jan 07 13:19:14 UTC 2012","overview":"<p>Mr. Hayden is Vice-President of the Wireless Developer Agency (WDA), a leader in mobile commerce, advertising and marketing since 2001. He brings 25 years of experience from a number of successful companies at the forefront of innovation. </p>\n\n<p>Beginning in 1993, he was instrumental in the creation of the Short Message Service (SMS) industry while at Acision, then a privately held startup based in Dublin, Ireland called Aldiscon. While at Aldiscon, Mr. Hayden founded the SMS Forum. Prior to Aldiscon, Mr. Hayden helped bring to market the first integrated multi-media security system for airports, working for Midwest Communications (acquired by Science Applications International Corporation (SAIC)). </p>\n\n<p>Following SAIC, he worked for Data Link Systems in Herndon, Virginia, which supplied high-security systems to the White House, the World Bank, and many other sensitive installations. Mr. Hayden began his career at the IRS in 1984. Immediately prior to WDA, Mr. Hayden worked at Aether Systems, a pioneer in mobile data applications, where he was responsible for conceiving and launching new products. </p>\n\n<p>Brennan holds an MBA from Heriot-Watt University in Edinburgh, Scotland, and a B.S. in Engineering from the University of Louisville Speed Scientific School. Originally from Owensboro, Kentucky, he now lives in Michigan with his wife and children. </p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0016/8973/168973v2-max-150x150.png"],[[150,150],"assets/images/resized/0016/8973/168973v2-max-250x250.png"],[[150,150],"assets/images/resized/0016/8973/168973v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"EVP & COO","firm":{"name":"WDA","permalink":"wda","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0016/7244/167244v11-max-150x150.png"],[[250,250],"assets/images/resized/0016/7244/167244v11-max-250x250.png"],[[450,450],"assets/images/resized/0016/7244/167244v11-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}