{"first_name":"Brendan","last_name":"Churchin","permalink":"brendan-churchin","crunchbase_url":"http://www.crunchbase.com/person/brendan-churchin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jul 29 01:41:02 UTC 2008","updated_at":"Tue Jul 29 01:42:26 UTC 2008","overview":"<p>Brendan Churchin comes to Landmark with extensive background in the Technology and Accounting Industries, leading major advances in CRM compliance, process improvement and cost reduction. Previously, he served as the Senior Business Development Associate at SWK Technologies, a leading mid-market reseller of Sage Software Accounting Systems. In this role, he drove the architecture and development of SWK&#8217;s customer retention policies and enforcement, including customized solutions to integrate hardware and software for individual customer requirements. His prior experience spanned from lead development and qualification to heading up marketing efforts for the company&#8217;s flagship NetUp network services product lines. At Landmark, Brendan is responsible for a variety of client business initiatives, including a focus on Security, Compliance, and Auditing technology and global business services functions. Brendan holds a Bachelor&#8217;s of Science degree in Business Administration with a focus on organizational management and psychology from Colorado State University. </p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"General Partner","firm":{"name":"Landmark Ventures","permalink":"landmark-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,92],"assets/images/resized/0002/2859/22859v7-max-150x150.jpg"],[[250,153],"assets/images/resized/0002/2859/22859v7-max-250x250.jpg"],[[450,277],"assets/images/resized/0002/2859/22859v7-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}