{"first_name":"Brendan","last_name":"Blumer","permalink":"brendan-blumer","crunchbase_url":"http://www.crunchbase.com/person/brendan-blumer","homepage_url":"","birthplace":"Cedar Rapids, IA","twitter_username":"brendanblumer","blog_url":"","blog_feed_url":"","affiliation_name":"GaMeCLiFF","born_year":1986,"born_month":8,"born_day":8,"tag_list":"chief-of-technology, real-estate, ige, asia-pacific-properties, technology, agents, mmorpg, okay-com","alias_list":null,"created_at":"Fri Aug 19 04:25:58 UTC 2011","updated_at":"Fri Aug 26 21:03:24 UTC 2011","overview":"<p>Brendan Blumer (born August 8, 1986) is an American entrepreneur and businessman currently based in Hong Kong. He is the Founder and Chief Technology Officer of Okay.com, a real estate networking platform that&#8217;s part of the Asia Pacific Properties Group.</p>\n\n<p>Blumer was raised in Cedar Rapids, IA. Blumer attended Linn-Mar High School and graduated in 2005. As a high schooler, Blumer worked as a barista at Starbucks while building his first successful operation on the side. During his free time, he played Massively Multiplayer Online Role-Playing Games (MMORPG), including EverQuest and was a varsity tennis player.</p>\n\n<p>While he was an active EverQuest player, Blumer started selling virtual assets on a website he developed called GaMeCLiFF. He funded this company with a 1,000 USD loan from his Grandmother Nancy Piel and operated the company from the age of 15 until he was 18. In December, 2005, GaMeCLiFF was purchased by IGE. Brock Pierce, founder of IGE, was part of the negotiations to acquire Blumer’s company. Blumer was subsequently transferred to Hong Kong to run his business unit within the larger organization.</p>\n\n<p>In 2007, Blumer left IGE to launch a second business. Accounts.net was one of the first websites in the industry to focus on and sell in-game avatars Accounts.net built a proprietary valuation system that allowed for the valuation of hundreds of thousands of permutations of Virtual Avatars inside many MMORPGs automatically. In 3 months Accounts.net was earning more than 750,000 USD per month. In 2008, Blumer merged Accounts.net with a content network. The combination of businesses quickly attracted the attention of institutional investors, and in 2009, Accounts.net accepted institutional capital. The investment company later bought out Blumer’s stake in the company.</p>\n\n<p>In 2009, Blumer founded Okay.com, where he is currently the Chief Technology Officer. For two years, Blumer and his team of approximately 20 people researched and developed a unique platform, creating a system for Real Estate agents in Hong Kong to more effectively manage every facet of their business. Okay.com uses the latest database and social networking concepts to create a living working environment for agents. </p>\n\n<p>In 2010, Asia Pacific Properties, a leader in corporate relocations in Hong Kong and Asia, expressed interest in Blumer’s newest business. A merger was finalized in 2011. Okay.com, APP’s newest subsidiary, is now preparing for a Q2 launch of their newest Agent platform.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief of Technology","firm":{"name":"okay.com","permalink":"okay-com","type_of_entity":"company","image":null}},{"is_past":true,"title":"Founder","firm":{"name":"GaMeCLiFF","permalink":"gamecliff","type_of_entity":"company","image":null}},{"is_past":true,"title":"Founder","firm":{"name":"Accounts.net","permalink":"accounts-net","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://mixergy.com/brendan-blumer-accounts-ne-interview/","title":"Mixergy Interview"}],"web_presences":[{"external_url":"http://www.facebook.com/brendan.blumer","title":""},{"external_url":"http://www.twitter.com/brendanblumer","title":""}]}