{"first_name":"Breogan","last_name":"Gonda","permalink":"breogn-gonda","crunchbase_url":"http://www.crunchbase.com/person/breogn-gonda","homepage_url":"","birthplace":"","twitter_username":"breogan_gonda","blog_url":"","blog_feed_url":"","affiliation_name":"GeneXus","born_year":null,"born_month":null,"born_day":null,"tag_list":"application-development, mobile-development, knowledge-representation, model-driven-development, integrated-development-environment, declarative-programming, productivity, productive-development, application-lifecycle-management, rapid-development-solutio","alias_list":null,"created_at":"Wed Nov 30 18:07:06 UTC 2011","updated_at":"Thu Dec 22 09:08:46 UTC 2011","overview":"<p>Systems Engineer graduated in the School of Engineering of the University of the Republic (Uruguay).</p>\n\n<p>He has been a Professor in the School of Engineering of the University of the Republic, in the Pontifical Catholic University of Porto Alegre (Brazil) and in the Catholic University Dámaso Antonio Larrañaga in Uruguay.</p>\n\n<p>Within his line of studies, Ing. Gonda has delivered courses and seminars as Visiting Professor for post-graduates at several Latin American countries such as: the National University of Buenos Aires (Argentina), the Technological University of Mar del Plata (Argentina), the Technological University of Rosario (Argentina), the Catholic University of Córdoba (Argentina), the Autonomous University of Santa Cruz de la Sierra (Bolivia), the Simón Bolívar University (Caracas, Venezuela),the Santiago University (Santiago de Chile, Chile), the Catholic University of Asunción (Paraguay), </p>\n\n<p>The National University of Panamá.\nFrom 1976 to 1989 he has provided consulting services in Database and application development projects to several of the largest Brazilian and Uruguayan companies.\nIng. Gonda has delivered numerous courses within his specialty field of study in Brazil from 1976 to 1989.\nHe is the co-author of the GeneXus project.</p>\n\n<p>Together with Ing. Nicolás Jodal, his partner in the GeneXus project, Ing. Gonda was honored by the National Academy of Engineering (Uruguay) with the National Engineering Award 1995 because of their work in this project. He has been acknowledged by the Uruguayan Association of Engineers as &#8220;Outstanding Engineer of the year 1996&#8221;. In July 1999, Ing. Gonda has been appointed a Member of the National Engineering Academy (Uruguay).</p>\n\n<p>His areas of research include: Databases, Artificial Intelligence, automatic application development methodology and interaction between the business and information technology worlds.</p>\n\n<p>He is Founding Partner and Director of <a href=\"http://www.crunchbase.com/company/genexus\" title=\"GeneXus-Artech\">GeneXus-Artech</a> and GeneXus Consulting in Uruguay and GeneXus USA, Artech de México, Artech do Brasil and GeneXus Japan Inc. in their respective countries.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0016/7077/167077v2-max-150x150.jpg"],[[165,250],"assets/images/resized/0016/7077/167077v2-max-250x250.jpg"],[[298,450],"assets/images/resized/0016/7077/167077v2-max-450x450.jpg"]],"attribution":"<p>GeneXus</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"President","firm":{"name":"GeneXus","permalink":"genexus","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0016/7204/167204v2-max-150x150.png"],[[233,70],"assets/images/resized/0016/7204/167204v2-max-250x250.png"],[[233,70],"assets/images/resized/0016/7204/167204v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}