{"first_name":"Brett","last_name":"H. Pojunis","permalink":"brett-h-pojunis","crunchbase_url":"http://www.crunchbase.com/person/brett-h-pojunis","homepage_url":"http://www.biglsolutions.com","birthplace":"New York","twitter_username":"pojunis","blog_url":"http://www.newmediaplus.net","blog_feed_url":"","affiliation_name":"Club Scene Network","born_year":1979,"born_month":12,"born_day":15,"tag_list":"libertarian, political-fundraising, web-development, entrepreneur, las-vegas, nightlife, entertainment","alias_list":null,"created_at":"Mon Sep 22 23:46:55 UTC 2008","updated_at":"Fri Oct 05 14:44:27 UTC 2012","overview":"<p>Brett H. Pojunis Professional and Political Bio</p>\n\n<p>Extended Professional bio:</p>\n\n<p>Mr. Pojunis has been Chairman and CEO of NewMediaPlus, Inc. since its inception in October 2009.  NewMediaPlus provides cost-effective solutions to Social Media, Web Development, Graphic Design, and Internet Marketing needs to small-to-midsized companies and a strong focus on publicly traded companies. NewMediaPlus provides the highest level of customer service through 1-on-1 interaction with their clients and intends to launch national retail storefronts called Click and Mortars. </p>\n\n<p>Mr. Pojunis Co-founded GLX, Inc. in September 2009 which is developing a global online investment community called the Global Listing Exchange, www.GLX.com.  Mr. Pojunis’ responsibilities included, but were not limited to; developing the business model and drafting the business plans, oversee the development of www.GLX.com, identify the technology team, establish the events division, and establish and organize working committees to utilize the strengths of the senior management team. </p>\n\n<p>Since its inception in October 2003 to October 2009, Mr. Pojunis was Chairman, CEO and President of Club Scene Media Group, Inc. Club Scene Media Group is based in Las Vegas, NV and is developing a niche social network for nightlife, entertainment and fashion branded globally on a localized basis. In addition to its online business model Club Scene also produces events bringing their virtual community to reality. Mr. Pojunis was founder of dealguys.net, an exclusive social network where investment professionals, executives of public companies and executives from other businesses related the financial markets can connect, recommend and present opportunities to each other. In addition to the social network dealguys.net produces events where members can interact and network with each other. </p>\n\n<p>From 2001 until July 2005, Mr. Pojunis was the Chairman of the Board, CEO of The Liquid Consulting Group, Inc., a full service investor and public relations boutique firm. From 1999 until May 2007, Mr. Pojunis was the President and Chief Executive Officer of Liquid Design Group, a web development and graphic design outsourcing firm with offices in India as well as the United States.</p>\n\n<p>Mr. Pojunis has been involved in finance and the public markets since 1999.  During this time, Mr. Pojunis has been a consultant to many start-up companies including high tech Internet to traditional brick and mortar companies. Mr. Pojunis resides on the Board of Directors of multiple private and public companies and organizations. Mr. Pojunis also has military training ranging from Civil Affairs Specialist (38A) to Combat Engineer (12B). While in the US ARMY he was awarded the Outstanding American award twice, the second time with honorable mention. Mr. Pojunis studied Environmental Liberal Arts at Green Mountain College and Entrepreneurship classes at the Simon School of Business at the University of Rochester. Mr. Pojunis also attended elective International Business and Finance classes at Rochester Institute of Technology.</p>\n\n<p>The following is my political bio:</p>\n\n<p>Mr. Pojunis is one of the leaders in the Libertarian Party and is currently serving his second term on the Libertarian National Committee.  Mr. Pojunis serves on the Information Technology Committee as well as the Audit Committee.</p>\n\n<p>Mr. Pojunis serves on the Libertarian Party of Nevada Executive Committee as their Secretary. </p>\n\n<p>Mr. Pojunis is Co-founder and Co-Chairman of the Young Libertarian National Alliance (YLNA), a grassroots partisan political youth organization which provides essential leadership training and experience to young Libertarians.  The YLNA prepares the youth to serve as future leaders of the Libertarian Party, as well as elected positions at the local, state, and federal levels of government. </p>\n\n<p>Mr. Pojunis is the Co-founder and Director of Big L Solutions, Inc.   Big L Solutions is a holding company which provides essential service for Libertarian organizations.  Some of the services are political fundraising, software development, Internet and web based technologies, public relation and media solutions and manages internet properties such as GoLibertarian.Com.</p>","image":{"available_sizes":[[[144,150],"assets/images/resized/0003/7732/37732v4-max-150x150.png"],[[240,250],"assets/images/resized/0003/7732/37732v4-max-250x250.png"],[[400,415],"assets/images/resized/0003/7732/37732v4-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President  Co-founder","firm":{"name":"Big L Solutions","permalink":"big-l-solutions","type_of_entity":"company","image":{"available_sizes":[[[150,41],"assets/images/resized/0021/2606/212606v2-max-150x150.png"],[[250,69],"assets/images/resized/0021/2606/212606v2-max-250x250.png"],[[450,124],"assets/images/resized/0021/2606/212606v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Chairman/CEO","firm":{"name":"New Media Plus, Inc.","permalink":"new-media-plus","type_of_entity":"company","image":{"available_sizes":[[[150,47],"assets/images/resized/0007/0623/70623v2-max-150x150.png"],[[175,55],"assets/images/resized/0007/0623/70623v2-max-250x250.png"],[[175,55],"assets/images/resized/0007/0623/70623v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Founder & CEO","firm":{"name":"Club Scene Network","permalink":"club-scene-network","type_of_entity":"company","image":{"available_sizes":[[[150,39],"assets/images/resized/0002/5554/25554v4-max-150x150.jpg"],[[250,66],"assets/images/resized/0002/5554/25554v4-max-250x250.jpg"],[[450,118],"assets/images/resized/0002/5554/25554v4-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"co-founder/Interim President","firm":{"name":"dealguys.net","permalink":"dealguys-net","type_of_entity":"company","image":null}},{"is_past":false,"title":"Libertarian National Committee Member","firm":{"name":"Libertarian National Committee","permalink":"libertarian-national-committee","type_of_entity":"company","image":{"available_sizes":[[[146,150],"assets/images/resized/0021/2607/212607v2-max-150x150.png"],[[244,250],"assets/images/resized/0021/2607/212607v2-max-250x250.png"],[[439,450],"assets/images/resized/0021/2607/212607v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Director, President","firm":{"name":"GLX, Inc.","permalink":"glx","type_of_entity":"company","image":{"available_sizes":[[[150,79],"assets/images/resized/0006/4930/64930v6-max-150x150.png"],[[250,133],"assets/images/resized/0006/4930/64930v6-max-250x250.png"],[[450,239],"assets/images/resized/0006/4930/64930v6-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.newmediaplus.net","title":"New Media Plus"},{"external_url":"http://www.BigLSolutions.com","title":"Big L Solutions"},{"external_url":"http://www.golibertarian.com","title":"Go Libertarian"},{"external_url":"http://www.lp.org","title":"Libertarian Party"}]}