{"first_name":"Bret","last_name":"Pearlman","permalink":"bret-pearlman","crunchbase_url":"http://www.crunchbase.com/person/bret-pearlman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Apr 13 19:06:27 UTC 2009","updated_at":"Tue Jan 19 07:16:50 UTC 2010","overview":"<p>Bret Pearlman is a Managing Director and Co-Founder of Elevation Partners. Bret has extensive experience as a private equity investor in large-scale transactions during his twenty year career. Bret joined The Blackstone Group in 1989 as the firm&#8217;s first analyst. From 2000 through mid-2004, Bret was one of eleven Senior Managing Directors whose primary responsibility was investing Blackstone&#8217;s third and fourth core private equity funds, as well as its media and communications private equity fund. As a senior managing director, Bret worked as a key senior member of transaction teams engaged in all aspects of a transaction including sourcing, evaluating, structuring, monitoring, and, where applicable, harvesting investments. In some instances, he accomplished these tasks in conjunction with other senior managing directors of the private equity group.</p>\n\n<p>Bret graduated from the Management and Technology Program at the University of Pennsylvania with a B.S. in Economics, with a concentration in finance from the Wharton School, as well as a B.S. in Engineering, with a concentration in computer science from the Moore School of Electrical Engineering. Since co-founding Elevation Bret has served as Chairman of BioWare / Pandemic Studios and is currently on the board of directors of SDI Media and Forbes Media.</p>","image":{"available_sizes":[[[150,44],"assets/images/resized/0007/3902/73902v1-max-150x150.png"],[[250,73],"assets/images/resized/0007/3902/73902v1-max-250x250.png"],[[406,120],"assets/images/resized/0007/3902/73902v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director, Co-Founder","firm":{"name":"Elevation Partners","permalink":"elevation-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,28],"assets/images/resized/0004/1053/41053v1-max-150x150.jpg"],[[250,47],"assets/images/resized/0004/1053/41053v1-max-250x250.jpg"],[[400,76],"assets/images/resized/0004/1053/41053v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}