{"first_name":"Brian","last_name":"Stansky","permalink":"brian-stansky","crunchbase_url":"http://www.crunchbase.com/person/brian-stansky","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Integral Capital Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed May 14 06:56:17 UTC 2008","updated_at":"Thu May 15 22:48:14 UTC 2008","overview":"<p>Brian Stansky (41) joined Integral in March 2002 as a Managing Director. Prior to joining Integral, Mr. Stansky spent two years as a partner at ABACUS Investments LLC, a hedge fund specializing in the technology, media &amp; telecommunications industries and ten years at T. Rowe Price Associates in various research and portfolio management positions. From March 1997 to January 2000, Mr. Stansky was portfolio manager of the New Age Media Fund and the T. Rowe Price Media &amp; Telecommunications Fund, whose assets grew from a base of $130 million to over $1.0 billion and attained a five star rating from Morningstar during his tenure. During Mr. Stansky&#8217;s tenure, the fund was often listed among the top communications, science &amp; technology, and general stock funds for one and five year periods. Mr. Stansky was portfolio manager of the T. Rowe Price Health Sciences Fund from February 1998 to January 2000. Mr. Stansky also managed the Green Line Entertainment &amp; Communications and Health Sciences Funds. During 1995-1996, Mr. Stansky worked with Mr. Morris directing the investment process for the T. Rowe Price New Age Media Fund, a closed end fund that evolved into the T. Rowe Price Media &amp; Telecommunications Fund. From May 1988 through August 1991, Mr. Stansky worked under Mr. McNamee as a research analyst on the T. Rowe Price Science &amp; Technology and New Horizons funds, covering industries such as software, environmental services, and health care services. Mr. Stansky graduated, summa cum laude, with a B.S. degree in Accounting from Boston College, and an M.S. in Finance and Applied Economics from the Sloan School of Management at M.I.T. Mr. Stansky is a Chartered Financial Analyst.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Integral Capital Partners","permalink":"integral-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[115,150],"assets/images/resized/0001/7358/17358v3-max-150x150.jpg"],[[120,156],"assets/images/resized/0001/7358/17358v3-max-250x250.jpg"],[[120,156],"assets/images/resized/0001/7358/17358v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}