{"first_name":"Brian","last_name":"Baker","permalink":"brian-baker-2","crunchbase_url":"http://www.crunchbase.com/person/brian-baker-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Widevine","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 02 23:27:57 UTC 2009","updated_at":"Fri Nov 05 05:29:18 UTC 2010","overview":"<p>Brian Baker, Chief Executive Officer\nBrian Baker founded the company in 1999 to connect digital content to consumers. He was promoted to the position of CEO in 2003 and oversees Widevine’s business strategy, financing, operations and technology. He has raised over $65 million in financing from venture funds and strategic corporate partners. Baker is Widevine&#8217;s primary interface to the major motion picture studios and broadcasters and is the sole or co-author of 56 issued and pending domestic and international patents related to digital media.</p>\n\n<p>During his tenure Widevine has achieved profitability and become the global leader in providing video optimization and multiplatform content protection for telecom, cable, satellite and Internet video services. Under his direction Widevine has been awarded numerous company and product awards including: Cable &amp; Satellite International’s Product of the Year; Frost &amp; Sullivan’s Leader in Global Growth and Excellence; and Red Herring’s Top 100 North American Company and Top 100 Global Company. In 2010, Multichannel News listed Baker as one of their forty cable and telecommunication industry visionaries under the age of forty.</p>\n\n<p>Prior to the creation of Widevine, Baker held a business development role at Advanced Radio Technologies, a developer of microwave broadband technologies and services. Baker holds a degree from the Foster School of Business at the University of Washington with a concentration in Computer Science and Corporate Finance.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Widevine Technologies","permalink":"widevine","type_of_entity":"company","image":{"available_sizes":[[[141,60],"assets/images/resized/0004/6403/46403v2-max-150x150.png"],[[141,60],"assets/images/resized/0004/6403/46403v2-max-250x250.png"],[[141,60],"assets/images/resized/0004/6403/46403v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}