{"first_name":"Brian","last_name":"Ballard","permalink":"brian-ballard","crunchbase_url":"http://www.crunchbase.com/person/brian-ballard","homepage_url":"","birthplace":"","twitter_username":"ballardbrian3","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Aug 20 14:04:14 UTC 2012","updated_at":"Thu Aug 30 08:04:37 UTC 2012","overview":"<p>A proud graduate of the University of Florida, Brian Ballard has been serving the Sunshine State for over 25 years. Ballard is a committed Republican who has worked on the campaigns of several Florida governors as well as several presidential candidates. He is currently working with the Mitt Romney campaign as a member of the National Leadership Team and as the Florida Finance Co-chair. </p>\n\n<p>Brian Ballard is a man known for his hard work. As a lobbyist and lawyer, he has become known as a person willing to serve as a strong advocate for his clients. His commitment to the Republican Party led to him being named one of Florida&#8217;s Top 10 Republicans by the magazine Campaign and Elections Politics. </p>\n\n<p>Brian is a long time resident of the Sunshine State. He attended the University of Florida for both his undergraduate studies and for his law degree. He earned a BS in business administration from the university and a JD. He also had the privilege of serving as an adjunct instructor at the school. As a result of this commitment, Ballard was inducted into the school&#8217;s Hall of Fame.</p>\n\n<p>Ballard&#8217;s loyalty to Florida continues to this day. He got his start in Florida politics by serving as the Chief of Staff for the Executive Office under Governor Bob Martinez. When Martinez was named the Director of the Office of National Drug Control Policy under the US President, Ballard was the director of the transition.</p>\n\n<p>Together with his wife Kathryn, Brian Ballard held the position of co-chair for the Inaugural Committee for Florida Governor Charlie Crist and for Governor Rick Scott. Ballard has been singled out by presidential candidates John McCain and Mitt Romney. He had served as the Co-chair for Florida during McCain&#8217;s campaign and is currently serving as the Florida Finance Co-Chair for the Romney campaign.</p>\n\n<p>In addition to his work with the government, Brian Ballard is the founder of Ballard Partners, a lobbying firm in Florida. The firm focuses its efforts on a variety of lobbying issues, including education and health care. Ballard Partners has represented a number of clients, from local government authorities to hospitals and schools.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}