{"first_name":"Brian","last_name":"Meehan","permalink":"brian-meehan-2","crunchbase_url":"http://www.crunchbase.com/person/brian-meehan-2","homepage_url":"http://www.knocking.tv","birthplace":"Connecticut","twitter_username":"briangmeehan","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1973,"born_month":4,"born_day":18,"tag_list":"","alias_list":null,"created_at":"Fri Apr 15 00:24:18 UTC 2011","updated_at":"Sat Apr 16 18:54:42 UTC 2011","overview":"<p>Brian Meehan is a creator and co-founder of Knocking.</p>\n\n<p>Brian&#8217;s passionate letter to Steve Jobs unlocked live video on the iphone in November 2009. Knocking quickly became the world’s first peer-to-peer live video streaming network for iPhones and Android phones attracting three million users.</p>\n\n<p>Now, Knocking™ is getting set to release the first ever real-time live video social network. Knocking™ allows people to connect from one phone to millions of phones with the touch of a single button, sending live, streaming, 30 second video knocks directly to the palm of their followers’ hands which they can then accept, watch live, and share virally. Giving followers exclusive, unprecedented access, keeping them constantly updated, motivated and engaged. Knocking Live is the simplest, most intimate way to promote your world LIVE.</p>\n\n<p>From a modest beginning sitting in his basement office, aka the creative bunker, surrounded by his first patented product, the Timemug. Brian&#8217;s serial entrepreneur journey has now brought his passion, drive, creative fire and innovation to lead Knocking. </p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0013/0634/130634v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0013/0634/130634v2-max-250x250.jpg"],[[450,299],"assets/images/resized/0013/0634/130634v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/briangmeehan","title":""}]}