{"first_name":"Brian","last_name":"Gilman","permalink":"brian-gilman","crunchbase_url":"http://www.crunchbase.com/person/brian-gilman","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1981,"born_month":4,"born_day":16,"tag_list":"","alias_list":null,"created_at":"Sat Jul 14 10:05:32 UTC 2012","updated_at":"Sun Jul 15 02:25:44 UTC 2012","overview":"<p>Brian Gilman&#8217;s Exceptional Career </p>\n\n<p>With sound experience and an excellent career track, Brian Gilman has continually proven himself capable of undertaking any task that comes under his care. Regardless of the necessary service or the job title he accepts, Brian is always not only up to the challenge, but able to take charge and reach lofts not previous expected by the company. From his genuine start to his current career position as Director of Sales at Vocus, Inc, Brian Gilman has shown time and time again he is more than up to the challenge.</p>\n\n<p>Brian&#8217;s career party towards Direct or Sales had a small beginning, as in 1992 he started as a sales trainer at Yellow Book USA and learned some valuable lessons during this time, helping hime mold and shape his future career. With the impeccable experience he received here from 1992 to 1997, Brian moved up to District Sales manager where he built on his training and helped improve his current sales expertise. Brian served in this position for three years until 2000, then in the year 2001, he took another career path change, this time with the Washington Post.</p>\n\n<p>The Washington Post Company titled Brian with &#8220;Advertising Manager&#8221; and during his tenure in the position, he managed over $60 million in advertising, coming from several different high-end, well-known companies, including Ethan Allen, Home Depot and Nordstrom. Brian held this position until 2009, where he decided to move on from the Washington Post and take over the Regional Director Partnership Markting position at the Westfield Shopping Malls. </p>\n\n<p>While here, he directed a total of nine different marketing managers in order to craft perfect development marketing, advertising and branding. During this year, he spend a small amount of time in other locations, until in 2010, Brian joined up with Vocus, Inc.</p>\n\n<p>As the Director of Sales for Vocus, Brian expanded the reach of the company substantially. Initially, when he first took over, the company held a total of 383 accounts. Currently, Brian oversees 5,600 different accounts and 36 representatives, all of whom are positioned to help him manage the thousands of accounts. </p>\n\n<p>Throughout Gilman&#8217;s career, he has championed dozens of high-profile accounts and expanded the presence of every single company, ensuring proper growth for each and every business he served for, ensuring longevity for every facility. This not only proves Brian&#8217;s worth, but his ability to improve a company, no matter the situation. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}