{"first_name":"Brian-Edmond","last_name":"Fin","permalink":"brian-edmond-fin","crunchbase_url":"http://www.crunchbase.com/person/brian-edmond-fin","homepage_url":"http://www.brianfin.com","birthplace":"Durban","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"courtico","born_year":1957,"born_month":11,"born_day":18,"tag_list":"","alias_list":null,"created_at":"Fri Jun 24 08:29:16 UTC 2011","updated_at":"Mon Jan 30 18:27:40 UTC 2012","overview":"<p>Brian-edmond fin completed most of his studies in South Africa, his country of birth (home country France) and ventured into business after aquiring experience at Robertsons, known for its spices and Knorr brands, working in purchasing and then marketing. Subsequently approached by Merck Pharmaceuticals. With the responsability of all OTC Consumer products (over the counter products), Merck team, Brian, Clive ramsbottom &amp; roger meredith then improved its rankings from 160 to being the 28 ranked sales pharmaceuticals sales company in South Africa. Wanting to test his own ability Brian ventured out into various business ventures  that were sold after their creation, these being; a gaming company, chain of restaurants, service stations, a communications and transport company. Selling them brian then moved to France and here started a transport company, to sell it 8 years later. After a year holiday Brian researched tried and founded two brands, managed by Courtico Invest LTD: brand one - www.tellpe.com -  providing video chat, telephone fax and webmail services online and via mobile applications, in direct competion to skype.\nThe second brand, courtico estate agent network for independent agents working from home, selling property, businesses and renatl management services. Its concept for independent agents should see its agent inscription grow to 500 free independent agents throughout France. Courtico will increase its coveage to the rest of europe. relaunch 1/11/2011  </p>\n\n<p>During this process Brian &amp; Sarka ventured into the creation of registered trade marks and created various brands, which they manage from france, their home country. </p>\n\n<p>tellpe will officially launch its full services on the 1st/02/2012  and is expecting to pass the 10 million mark in turnover. Its beta stage now succefully completedl the signs that its products, specially its pack server aimed at businesses - pack server (private webmail, fax system, voip telephone with extensions, video conference (up to 8), television news updates will be included on the site from 1/9/2011 for its official launch. Its concept should capture potential skype users as well. Because tellover will allow private users access to its telephone &amp; video communications system, free for two users and payable from 2 to 8 users. </p>\n\n<p>Brian enjoys travelling and reading about the succesfull ventures and projects  of others, saying this should inspires others to do the same. The more people are successful would be a positive point for everyone. </p>","image":null,"degrees":[{"degree_type":"Marketing ","subject":"marketing, economics, finance, cost accounting & statistics...","institution":"Durban Technikon University","graduated_year":1984,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Courtico Invest Ltd","permalink":"courtico-invest-ltd","type_of_entity":"company","image":null}},{"is_past":false,"title":"director","firm":{"name":"Tellover","permalink":"tellover","type_of_entity":"company","image":null}},{"is_past":false,"title":"director","firm":{"name":"courtico","permalink":"courtico","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.facebook.com/#!/","title":"brian fin - tellover - facebook"},{"external_url":"http://www.tellover.com","title":"tellover"},{"external_url":"http://www.courtico.com","title":"courtico"},{"external_url":"http://www.brianfin.com","title":"brian fin"}]}