{"first_name":"Brian","last_name":"Hoskins","permalink":"brian-hoskins","crunchbase_url":"http://www.crunchbase.com/person/brian-hoskins","homepage_url":"","birthplace":"","twitter_username":"bthoskins","blog_url":"http://bthoskins.worldpress.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"mobile, microsoft, emerging-business-team, venture-capital, startups","alias_list":null,"created_at":"Mon Mar 19 08:06:11 UTC 2012","updated_at":"Sun Mar 25 21:50:08 UTC 2012","overview":"<p>Brian Hoskins is Director of Business Development on Microsoft’s Emerging Business Team, focusing on mobile and wireless startups spanning both consumer and enterprise technologies. In his previous role, Brian was Senior Product Manager in Microsoft’s Mobile Communications Business, where he led the commercialization of System Center Mobile Device Manager 2008, a new mobile security, management, and access product. Brian started at Microsoft in 2004 as Senior Product Manager on the Exchange Server team, where he led Pricing and Licensing for the Exchange Server 2007 launch as well as managed Exchange’s global sales force escalations.</p>\n\n<p>Prior to Microsoft, Brian was an Engagement Manager with the Corporate Executive Board in Washington, D.C., leading the launch of a new consulting practice focused on technology and sales force optimization. Brian also worked at Enron Corporation in Houston, TX as a Senior Analyst for a venture capital fund focused on energy technology and later as a Manager launching the world’s first video-on-demand venture delivered via Digital Subscriber Lines (DSL).</p>\n\n<p>Brian holds an MBA with High Distinction from Harvard Business School, where he was a George F. Baker Scholar, and a Bachelor of Arts, summa cum laude, in Economics and French from Vanderbilt University.</p>","image":{"available_sizes":[[[113,150],"assets/images/resized/0017/9937/179937v2-max-150x150.jpg"],[[188,250],"assets/images/resized/0017/9937/179937v2-max-250x250.jpg"],[[242,321],"assets/images/resized/0017/9937/179937v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}