{"first_name":"Brian","last_name":"McGuffie","permalink":"brian-mcguffie","crunchbase_url":"http://www.crunchbase.com/person/brian-mcguffie","homepage_url":"http://www.g3creative.co.uk","birthplace":"Scotland","twitter_username":"","blog_url":"http://g3-creative-solutions.bttradespace.com/news-and-posts/news/7AE9CCE6785EF2D5E040BB0A462B14B1","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1965,"born_month":11,"born_day":17,"tag_list":"graphic-design-glasgow, g3-creative, graphic-designer-scotland","alias_list":null,"created_at":"Tue Jun 22 08:15:10 UTC 2010","updated_at":"Fri Jun 25 20:52:21 UTC 2010","overview":"<p>Brian McGuffie has been running the Glasgow graphic design company G3 Creative Solutions in Scotland since 2006.  He has been working tirelessly on a broad mix of exciting projects. These include large long-term commissions, design and consultancy work for established businesses, public sector and start-up businesses alike.</p>\n\n<p>Key Strengths: Attention to detail, superb work ethic, a keen eye for composition, typography, colour and design that always leads to producing stunning and effective visual results that exceeds clients expectations.</p>\n\n<p>Excellent knowledge of the following design and layout applications -\nAdobe CS2 including Photoshop, Image Ready, Illustrator, Indesign and Acrobat.\nGuru in Macromedia Freehand, proficient in Quark XPress, Page Maker, Microsoft Word, and PowerPoint.</p>\n\n<p>Achievements: Designing and implementing successful graphic design and advertising campaigns, generating leads in targeted markets. Developing and growing G3 Creative as a world-wide design brand.</p>\n\n<p>Three Key Projects carried out by G3 Creative:</p>\n\n<ul>\n<li><p>HB Rentals is the world&#8217;s premier supplier of offshore and onshore accommodation cabins, and related with its head office in Louisiana – Broussard USA and offices through out the world. G3 Creative Solutions in Glasgow are proud to have helped them with the design and production of exhibition display systems and marketing material which includes this pocket sized full colour brochure.</p></li>\n<li><p>Scotland’s Sea Kingdom a VisitScotland project about the culture, wildlife and heritage of Scotland’s west coast island’s such as Islay, Jura, Colonsay, Lismore and Tiree .The project involved the design of the Sea Kingdom logo, full colour brochure design and micro site design and build  http://www.visitscottishheartlands.com/seakingdom/\nhttp://www.visitscottishheartlands.com/ournaturalworld/\nhttp://www.visitscottishheartlands.com/famouspeople/index.html</p></li>\n<li><p>Sierra Rica : Premium quality organic foods from Andalucia, Spain\nThis design project involved packaging and label design, copywriting and production of promotional flyers in various languages for European and US markets. Production of labels for Antony Worrall Thompson organic soups for Sainsbury’s and Waitrose. </p></li>\n<li><p>OEG Offshore : OEG Offshore is one of the world&#8217;s leading suppliers of specialist engineering cabins and cargo-carrying units to the offshore oil and gas industry.\nThis design project involved a range of data sheets, fleet wallcharts and exhibition displays. </p></li>\n</ul>\n\n<p>Brian&#8217;s Leisure Pursuits: A keen hill walker, landscape painter and cyclist.</p>\n\n<p>You can see samples of design work by visiting http://www.g3creative.co.uk</p>","image":{"available_sizes":[[[132,150],"assets/images/resized/0009/1351/91351v2-max-150x150.jpg"],[[221,250],"assets/images/resized/0009/1351/91351v2-max-250x250.jpg"],[[398,450],"assets/images/resized/0009/1351/91351v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}