{"first_name":"Brian","last_name":"Dillon Ferris","permalink":"brian-dillon-ferris","crunchbase_url":"http://www.crunchbase.com/person/brian-dillon-ferris","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"DEALMAKER.COM","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Sep 30 20:52:46 UTC 2009","updated_at":"Wed Nov 11 01:49:43 UTC 2009","overview":"<p>Free-market evangelist and automobile industry reformer. Remorseless maverick and lateral thinker</p>\n\n<p>At under 30 Brian was the world&#8217;s youngest ever factory distributor for both Lamborghini and Maserati. Within 5 years his company was ranked as the world&#8217;s top distributor by market share. He also enjoyed a very close working relationship with Ferrari SpA for more than a decade, as dealer, service specialist and high altitude tuning consultant to Ferrari SpA. </p>\n\n<p>During this period he was also an F2 auto racing sponsor, team owner/driver and competitor in the SA drivers championship, along with Ian Scheckter, team mate Wayne Taylor and other world class competitors.</p>\n\n<p>Then Brian discovered the Internet. He immediately recognized potential for electronic commerce and poured all his time and energy into this new and exciting challenge, focused on harnessing this global network to create a marketing and trading channel for mainstream commodity brands. Initially trading electronic securities where he learned, (under a baptism by fire), how to exploit the enormous power of supply and demand. </p>\n\n<p>Convinced that more transparent markets would also be best for 21st century commerce he dedicated the next 5 years to developing the world’s first electronic trading exchange for complex heterogeneous commercial transactions such as new motor vehicles, computers and travel packaging, and so the MACDAX was born.</p>","image":{"available_sizes":[[[111,150],"assets/images/resized/0006/1432/61432v2-max-150x150.jpg"],[[185,250],"assets/images/resized/0006/1432/61432v2-max-250x250.jpg"],[[305,412],"assets/images/resized/0006/1432/61432v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder & Chief Architect ","firm":{"name":"DEALMAKER.COM","permalink":"dealmaker-com","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0006/1332/61332v2-max-150x150.jpg"],[[180,180],"assets/images/resized/0006/1332/61332v2-max-250x250.jpg"],[[180,180],"assets/images/resized/0006/1332/61332v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}