{"first_name":"Brian","last_name":"Groth","permalink":"brian-groth","crunchbase_url":"http://www.crunchbase.com/person/brian-groth","homepage_url":"http://www.BrianGroth.com","birthplace":"Longview, WA, USA","twitter_username":"BrianGroth","blog_url":"http://BrianGroth.wordpress.com","blog_feed_url":"http://BrianGroth.wordpress.com/feed/","affiliation_name":"Unaffiliated","born_year":1967,"born_month":11,"born_day":12,"tag_list":"sales-engineer-technical-sales-sales-operations","alias_list":null,"created_at":"Sun Oct 14 17:02:55 UTC 2012","updated_at":"Fri Nov 02 03:28:23 UTC 2012","overview":"<p>Brian Groth is a technical sales engineer who consults with customers to help close sales deals, while also improving global sales operations and processes. </p>\n\n<p>Brian Groth started his career at Microsoft in 1994 supporting and debugging networking issues for corporate customers. He eventually moved on to become a Technologist to understand and explain new Internet technologies for the HQ-based Enterprise Sales team. This evolved into managing teams to create sales tools, presentations and technical demonstrations for the global Enterprise Sales organization. \nIn 2002, Brian took on the task of managing the small team that created the largest and most complex demo system at Microsoft, which was presented at the Microsoft Technology Centers (MTCs) around the world and was showcased on MSDN&#8217;s Channel9. The team also present it to Fortune 1000 accounts, helped deploy it at the globally dispersed MTCs and trained the teams in Tokyo, Beijing and Taipei on how to use it for consultative selling.\nIn 2006, Brian moved from Seattle, focused on selling IT to London, to focus on consumer marketing and selling advertising. Brian managed a distributed team across Europe to drive reach and engagement for the Windows Live products, such as Messenger and Hotmail. During this time, Brian managed the engineering (specs, design, dev, test) and marketing (sales readiness, marketing materials, etc.) of the Messenger TV product, which integrated MSN video content into Windows Live Messenger and launched in 20 countries and 12 languages. During this time, Facebook and other social networks started making an impact in the market, which sparked Brian&#8217;s focus on social media technologies. \nIn 2010, Brian moved back to Seattle to join Microsoft Advertising&#8217;s the Global Accounts team and focus on social media and what it means to advertisers, again presenting to and consulting with the Fortune 1000. While still focused on social media, he is now integrating competitive intelligence into the sales strategy and sales process for Microsoft Advertising. </p>","image":{"available_sizes":[[[149,150],"assets/images/resized/0021/5479/215479v2-max-150x150.jpg"],[[249,250],"assets/images/resized/0021/5479/215479v2-max-250x250.jpg"],[[448,450],"assets/images/resized/0021/5479/215479v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"Management Information Systems","institution":"Western Washington University","graduated_year":1991,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://channel9.msdn.com/Blogs/TheChannel9Team/Brian-Groth-and-Mark-Berman-Demo-of-SOA-application","title":"MSDN Channel 9 video"}],"web_presences":[{"external_url":"http://Twitter.com/BrianGroth","title":"@BrianGroth"},{"external_url":"http://www.linkedin.com/in/bgroth","title":"LinkedIn"}]}