{"first_name":"Brian","last_name":"Hall","permalink":"brian-hall","crunchbase_url":"http://www.crunchbase.com/person/brian-hall","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Microsoft","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Nov 13 04:21:06 UTC 2008","updated_at":"Thu Nov 13 05:06:16 UTC 2008","overview":"<p>As general manager of the Windows Live Business Group at Microsoft Corp., Brian Hall is responsible for the worldwide revenue and profit of Windows Live applications and services. Within the Online Services Group, Hall and his team are chartered with the goal of leading Windows Live as the network with the world’s most loyal and engaged community of people using Internet services on PCs as well as mobile devices. They drive the business strategy, market the Windows Live value proposition worldwide, and are responsible for building lasting, value-added partnerships with network operators, software developers, publishers, universities and other groups.</p>\n\n<p>Hall has worked at Microsoft since 1995 in a variety of marketing and technical positions. Most recently, he founded and helped build the Windows Live OneCare business, the industry’s first all-in-one PC care service. He led the creation of the OneCare business plan, ran the customer-focused program management team and served as a product unit manager. In addition, Hall led the worldwide launch of Windows XP and worked as a product manager on Windows 95, Windows 98 and multiple versions of Internet Explorer. For more than two years, he also served as speech assistant to Microsoft CEO Steve Ballmer; in that role he learned to always put the customer’s perspective first. </p>\n\n<p>Hall has a bachelor’s degree with majors in mathematics, economics and philosophy from Yale University, where he also competed all four years as a diver on the varsity swim team. He is married, has a son and a daughter, and loves the outdoors.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0002/8429/28429v1-max-150x150.jpg"],[[166,250],"assets/images/resized/0002/8429/28429v1-max-250x250.jpg"],[[298,450],"assets/images/resized/0002/8429/28429v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Manager, Windows Live Business Group","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}