{"first_name":"Brian","last_name":"M. Platz","permalink":"brian-m-platz","crunchbase_url":"http://www.crunchbase.com/person/brian-m-platz","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu May 15 18:12:46 UTC 2008","updated_at":"Thu May 15 18:21:39 UTC 2008","overview":"<p>Brian Platz is responsible for providing all of the technology and services to deliver SilkRoad’s state-of-the-art web applications, content solutions, and collaborative content systems that allow a business to share information across its value chain. Before joining SilkRoad, Platz was the Vice President of product management for divine, inc. where he led the product strategy and direction for divine’s widely recognized and award winning content management and collaboration products. Platz brings a 12-year career in developing Internet products, e-business initiatives, e-commerce solutions with a variety of high-tech start-ups, including Zentropy and Glabalist Internet Technologies, and InfoBand, an Internet consulting company he founded in 1995.</p>\n\n<p>In 1996, Platz co-founded A List Apart, the highly acclaimed Who’s Who of Internet developers that has grown into one of the largest and most popular independent development Web sites. He also was a fellow founding member of the Web Standards Project, a group formed to push Microsoft and Netscape to adhere to common standards.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Operating Officer","firm":{"name":"SilkRoad technology","permalink":"silkroad-technology","type_of_entity":"company","image":{"available_sizes":[[[150,40],"assets/images/resized/0001/8668/18668v1-max-150x150.png"],[[188,51],"assets/images/resized/0001/8668/18668v1-max-250x250.png"],[[188,51],"assets/images/resized/0001/8668/18668v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}