{"first_name":"Brian","last_name":"L. Roberts","permalink":"brian-l-roberts","crunchbase_url":"http://www.crunchbase.com/person/brian-l-roberts","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 14 22:40:59 UTC 2008","updated_at":"Wed May 14 22:51:58 UTC 2008","overview":"<p>&#8220;Brian L. Roberts is Chairman and CEO of Comcast Corporation, the nation’s leading provider of cable, entertainment and communications products and services. Under his leadership, Comcast has grown into a Fortune 100 company with $30.9 billion in revenues, 24.7 million customers and 100,000 employees.  Comcast’s content networks and investments include E! Entertainment Television, Style Network, The Golf Channel, VERSUS, G4, PBS KIDS Sprout, TV One, and ten Comcast SportsNets networks. The Company also has a majority ownership in Comcast-Spectator, whose major holdings include the Philadelphia Flyers NHL hockey team, the Philadelphia 76ers NBA basketball team and two large multipurpose arenas in Philadelphia.</p>\n\n<p>Mr. Roberts is a member of the Board of Directors of the National Cable &amp; Telecommunications Association (NCTA) where he served as chairman for two consecutive terms from 2005-2007. He also served as NCTA’s chairman from 1995-1996 when the landmark deregulatory 1996 Telecommunications Act became law. Mr. Roberts is serving his third term as Chairman of CableLabs, the research and development consortium for the cable industry. He previously served as their chair from 2003-2005 and 1999-2001.  </p>\n\n<p>Mr. Roberts has won numerous business and industry honors for his leadership.  In May 2007, he was presented with the cable industry&#8217;s highest honor, the Distinguished Vanguard Award for Leadership. In January of 2008, Institutional Investor magazine named him as one of America’s top CEOs for the fifth year in a row  In October of 2006, he was inducted into the Cable Television Hall of Fame. In 2005, he was honored by the National Association for Multi-ethnicity in Communications (NAMIC) for his commitment to diversity in the cable industry, and by the Partnership for a Drug-Free America for Comcast’s unprecedented commitment of resources to champion the PDFA’s drug-free message.  He also was the recipient of the 2004 Humanitarian Award from the Simon Wiesenthal Center.  In 2003 Mr. Roberts was awarded the Steven J. Ross Humanitarian Award by the UJA Federation of New York.  In 2002, he was honored by The Police Athletic League of Philadelphia for his commitment to youth programs and community partnerships.</p>\n\n<p>Mr. Roberts co-chaired the 2003 Resource Development Campaign for the United Way of Southeastern Pennsylvania and was a founding co-chair of Philadelphia 2000, the nonpartisan host committee for the 2000 Republican National Convention.  An All-American in squash, he earned a gold medal with the U.S. squash team in 2005 and silver medals at the 1981, 1985 and 1997 Maccabiah Games in Israel.</p>\n\n<p>Mr. Roberts, 48, received his BS from the Wharton School of Finance of the University of Pennsylvania. He and his wife, Aileen, live in Philadelphia with their three children.&#8221; (Source: <a href=\"http://www.comcast.com/corporate/about/pressroom/corporateoverview/corporateexecutives/brianroberts.html\" title=\"Comcast\" rel=\"nofollow\">Comcast</a>)</p>","image":{"available_sizes":[[[108,150],"assets/images/resized/0001/8610/18610v1-max-150x150.jpg"],[[113,156],"assets/images/resized/0001/8610/18610v1-max-250x250.jpg"],[[113,156],"assets/images/resized/0001/8610/18610v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.comcast.com/corporate/about/pressroom/corporateoverview/corporateexecutives/corporateexecutives.html\" title=\"Comcast\" rel=\"nofollow\">Comcast</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"CEO & Chairman","firm":{"name":"Comcast","permalink":"comcast","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/8607/18607v1-max-150x150.png"],[[155,50],"assets/images/resized/0001/8607/18607v1-max-250x250.png"],[[155,50],"assets/images/resized/0001/8607/18607v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}