{"first_name":"Brian","last_name":"Essig","permalink":"brian-essig","crunchbase_url":"http://www.crunchbase.com/person/brian-essig","homepage_url":"","birthplace":"New Jersey","twitter_username":"","blog_url":"http://www.brianessig.com","blog_feed_url":"","affiliation_name":"Creating Digital","born_year":1984,"born_month":9,"born_day":16,"tag_list":"","alias_list":null,"created_at":"Fri Nov 05 19:58:38 UTC 2010","updated_at":"Tue Nov 09 19:20:08 UTC 2010","overview":"<p>An veteran at developing websites that generate leads, automate processes, and develop automatic revenue streams.</p>\n\n<p>Brian is an experienced professional with expertise in open source database driven website application development, and server architecture design utilizing Java / LAMP / Open Source.</p>\n\n<p>In 2007, he demonstrated initiative as one of the three programmers to launch a highly popular-and still active- social networking site within the online gaming community. A sampling of specializations acquired during this period include third party application integrations, on the fly video encoding, custom content management systems, firewall management, and search engine optimization.</p>\n\n<p>In 2009 Brian realized there was still a big disconnect in traditional business and online medium.  In the last few years, traditional businesses have tried to digitize themselves and have come across too many web development shops and agencies that are not full service and did not satisfactorily perform the services in which they were hired.  Inadequate research by these web development companies combined with a lack of understanding of the business process results in poorly designed, buggy, or incomplete web based systems that do not offer any benefit, cost savings, or innovation to the client.  </p>\n\n<p>Brian saw an immediate need for a creative and development agency that behaved as a professional partner.  A small agency that would take the time to understand the day to day operations of each client, then based on that understanding recommend a course of action.  An agency that can leverage all of its past engagements and bring that insight and knowledge to each new project.  Creating Digital was born.</p>","image":null,"degrees":[{"degree_type":"Bachelors","subject":"Computer Science","institution":"Western New England College","graduated_year":2006,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Owner","firm":{"name":"Creating Digital","permalink":"creating-digital","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}