{"first_name":"Brianna","last_name":"Ladapo","permalink":"brianna-ladapo","crunchbase_url":"http://www.crunchbase.com/person/brianna-ladapo","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jul 16 08:42:37 UTC 2012","updated_at":"Mon Jul 16 10:04:51 UTC 2012","overview":"<p>Brianna Ladapo and Holistic Nutrition </p>\n\n<p>There is a growing body of research that is starting to show the many benefits of holistic nutrition. It is becoming thoroughly clear that holistic nutrition can serve to stop many health issues before they even start. This is especially true when it comes to gastrointestinal issues and obesity. These advances have created an environment where holistic nutrition is no longer looked at as some &#8220;fringe&#8221; concept. Now, this common-sense approach to nutrition is often seen as the golden standard in nutrition.</p>\n\n<p>People like Brianna Ladapo have been taking part in holistic nutrition practices for years. For some, eating this way is more of an ethical issue than a health-based decision. For others, eating this way is simply a matter of survival. No matter what the reasoning is, it is impossible to reasonably deny the benefits that holistic nutrition can offer.</p>\n\n<p>Ethically, many people look to holistic nutrition as a more righteous way to eat. This is because nutrition like this usually does not involve the consumption of meat and dairy products. The proponents of this lifestyle sometimes believe that the livestock production industry in the United States is inhumane. By not eating these products, people feel that they are free of that cycle.</p>\n\n<p>On the other hand, many people simply eat this way to promote healthier living. Brianna Ladapo is someone that feels like health is the real reward of practicing holistic nutrition. By eating better, she is able to take more control over her health and well-being. This has a number of far-reaching consequences in her life and can be credited with helping her maintain a determined attitude.</p>\n\n<p>With the saturation of terrible food habits that people are bombarded by, it can be difficult to make positive health choices. People that decide to practice holistic nutrition and stick with it often have a lot of willpower. After all, they have to constantly fight against ads and social standards pushing them in the opposite direction. The simple act of maintaining ones beliefs in the face of such immense push-back speaks volumes about a person&#8217;s character. </p>\n\n<p>For someone like Brianna, eating well is a lifestyle that she couldn&#8217;t turn away from. It is a lifestyle that promotes a healthy, active body and mind. These are invaluable things to have in life. At the very least, health in these areas more than makes up for any small inconveniences this lifestyle introduces. </p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/1124/201124v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/1124/201124v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/1124/201124v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}