{"first_name":"Brianna","last_name":"White","permalink":"brianna-white-2","crunchbase_url":"http://www.crunchbase.com/person/brianna-white-2","homepage_url":"","birthplace":"Winter Haven, FL","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Thatswzup","born_year":1988,"born_month":4,"born_day":20,"tag_list":"netoworking, events, promotions","alias_list":null,"created_at":"Wed Dec 17 18:37:30 UTC 2008","updated_at":"Sat Dec 20 22:52:44 UTC 2008","overview":"<p>Brianna White, Junior at the University of South Florida, has shown what dedication and drive can accomplish at even a young age.</p>\n\n<p>After growing up in a small town, Brianna knew she wanted more and pushed herself to make good grades in school. After being accepted to and receiving a full tuition scholarship to the University of South Florida, she knew that the move to Tampa was only the beginning.</p>\n\n<p>As an advertising major, Brianna became interested in the Entertainment industry and the world of promotional work for events and artists. In her sophomore year at the age of 19, she was added onto the Thatswzup.com team. Hired just to manage the Myspace and Facebook for the team, she pushed herself to show that she could handle more responsibility.</p>\n\n<p>With time and sweat equity came a promotion to Executive Assistant to the CEO. She took the responsibility on, and put her all into the company, while also working a side job and going to school full-time.</p>\n\n<p>Her love for the company, and her drive to be successful, pushed her forward and she eventually was promoted to Vice President. Working with the company has shaped her as a business woman and given her experience in the business world in a hands on manner. </p>\n\n<p>As the right hand to the CEO of Thatswzup.com, the 20 year old business woman continues to reach for the stars as she conintues toward graduation and a bachelor&#8217;s degree from USF in Advertising. She has also seeked out other business ventures and is now a representative for Avon as well.</p>\n\n<p>Other ventures aside, Brianna&#8217;s heart and commitment lies with Thatswzup.com, and she continues to put her time and focus on the company.</p>","image":null,"degrees":[{"degree_type":"Associates Degree","subject":"","institution":"USF","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Vice President/Executive Assistant to the CEO","firm":{"name":"Thatswzup","permalink":"thatswzup","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.myspace.com/brie863","title":"Myspace"},{"external_url":"http://www.youravon.com/BriannaWhite","title":"Avon Representative"}],"web_presences":[]}