{"first_name":"Brian","last_name":"Schultz","permalink":"brian-schultz-2","crunchbase_url":"http://www.crunchbase.com/person/brian-schultz-2","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Ontela","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Aug 05 15:22:07 UTC 2010","updated_at":"Thu Aug 05 16:57:21 UTC 2010","overview":"<p>Brian brings a wide array of business expertise to early stage companies.</p>\n\n<p>Brian has cofounded two venture-backed technology companies, Ontela and Plectix Biosystems.  Most recently at Ontela, Brian served as COO where he led its strategic planning, business development, finance, and operations from founding to 35 employees</p>\n\n<p>Prior, he spent over 5 years at Microsoft.  While at Microsoft, Brian helped start the Security Business Unit, developing its initial business plan and executing on business development, intellectual property strategy, and acquisitions.  As a Senior Manager on the Corporate Development team, Brian was responsible for the commitment of over $400 million in capital through 6 transactions, and led evaluations of many more.</p>\n\n<p>Brian began his career on Wall Street where he was an analyst with Lehman Brothers in New York, working exclusively with technology companies in their efforts to merge, acquire, raise money, and go public.  Brian graduated cum laude with a BS in Business Administration from Georgetown University with concentrations in Finance and International Business, and a minor in Computer Science. </p>\n\n<p>Brian lives in Seattle with his wife, spending as much time outdoors as possible &#8211; aside from the occasional performance with his band, Driftwood.  They love to travel, trying to photograph what they see.  He works with several nonprofits, and serves on the Board of two.  </p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"COO and Founder","firm":{"name":"Ontela","permalink":"ontela-3","type_of_entity":"company","image":{"available_sizes":[[[129,36],"assets/images/resized/0007/5904/75904v1-max-150x150.png"],[[129,36],"assets/images/resized/0007/5904/75904v1-max-250x250.png"],[[129,36],"assets/images/resized/0007/5904/75904v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Founder","firm":{"name":"Plectix Biosystems","permalink":"plectix-biosystems","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}