{"first_name":"Brian","last_name":"Alvey","permalink":"brian-alvey","crunchbase_url":"http://www.crunchbase.com/person/brian-alvey","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Crowd Fusion","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Sep 01 17:22:13 UTC 2009","updated_at":"Tue Feb 15 20:44:41 UTC 2011","overview":"<p>Brian Alvey is the CEO of Crowd Fusion.</p>\n\n<p>In 1995, Brian Alvey designed the first TV Guide website and helped BusinessWeek leap from AOL to the web. Brian built database-driven web applications and content management systems for many large companies in the 90&#8217;s including Intel, J.D. Edwards, Deloitte &amp; Touche and The McGraw-Hill Companies. His 1999 Tech-Engine site was a &#8220;skinnable HotJobs&#8221; which powered over 200 online career centers including XML.com, Perl.com, O&#8217;Reilly &amp; Associates Network, DevShed and Computer User magazine. He has been the art director of three print magazines and was the Chief Technology Officer of Rising Tide Studios where he developed The Venture Reporter Network, which is now a Dow Jones property.</p>\n\n<p>In 2002, Brian was the creator and host of the Meet The Makers conference, a series of talk show-style events. In 2003, he invented and launched Blogstakes, a sweepstakes application for the blogging community. Brian partnered with web design guru Jeffrey Zeldman in Happy Cog to build content management systems for customers including Capgemini, A List Apart and the Kansas City Chiefs.</p>\n\n<p>In 2004, Brian Alvey and Jason Calacanis created the publishing company Weblogs, Inc. – home to such category leading blogs as Engadget, Autoblog, Joystiq, TUAW, TV Squad, Cinematical, Download Squad, WOW Insider, Slashfood and Blogging Stocks. AOL acquired Weblogs, Inc. in October 2005. In June 2006, Brian also became the chief architect of Netscape and lead the development team which turned the struggling portal into a thriving social news site.</p>\n\n<p>In November 2006, AOL acquired Blogsmith, the enterprise-grade blog publishing platform Brian built. Today AOL uses Blogsmith to publish more than 50 Weblogs, Inc. blogs, dozens of AOL channel blogs and the leading gossip site, TMZ.</p>\n\n<p>In June 2007, Brian left AOL to work with ComicMix, a comic book publishing company he co-founded with industry veterans Mike Gold and Glenn Hauman. Knowing no platform that could do everything he wanted to do in an ultimate comic book lover&#8217;s website, Brian created Crowd Fusion with long-time friend Craig Wood. Crowd Fusion is currently working with a limited number of publishing clients and is creating proof-of-concept sites in many consumer verticals.</p>\n\n<p>Brian graduated from TCU with a degree in Physics and Astronomy and minors in Art and Mathematics. Brian works from home in Westchester County, NY where he and Niki have three kids and three Cavaliers.</p>","image":{"available_sizes":[[[145,110],"assets/images/resized/0012/2227/122227v1-max-150x150.jpg"],[[145,110],"assets/images/resized/0012/2227/122227v1-max-250x250.jpg"],[[145,110],"assets/images/resized/0012/2227/122227v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO, Co-founder","firm":{"name":"Crowd Fusion","permalink":"crowd-fusion","type_of_entity":"company","image":{"available_sizes":[[[150,59],"assets/images/resized/0005/8638/58638v1-max-150x150.png"],[[217,86],"assets/images/resized/0005/8638/58638v1-max-250x250.png"],[[217,86],"assets/images/resized/0005/8638/58638v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}