{"first_name":"Brian","last_name":"J. Sisko","permalink":"brian-j-sisko","crunchbase_url":"http://www.crunchbase.com/person/brian-j-sisko","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Sep 23 21:25:29 UTC 2008","updated_at":"Wed May 05 01:06:47 UTC 2010","overview":"<p>As Senior Vice President and General Counsel, Brian has executive responsibility for Safeguard’s legal affairs, mergers &amp; acquisitions, support of Safeguard’s Board and public company activities, and direct participation in Safeguard’s business strategy. He is also responsible for managing compensation programs, performance programs and other human resources activities at Safeguard.</p>\n\n<p>Brian has more than 20 years of legal, operational, venture capital and public company experience in a high-tech setting, which further strengthens the depth of expertise and leadership within our organization. Safeguard is well positioned as a holding company to execute upon its game plan to deploy capital in new, high-potential situations, build value in our partner companies and realize that value in well-timed exits. Brian’s extensive knowledge of relationship management, M&amp;A and other strategic transactions will enable Safeguard to continue to produce genuine results and be innovative as we execute upon our strategy.</p>\n\n<p>Brian comes to Safeguard from Traffic.com, a former Safeguard Partner Company and a leading provider of accurate, real-time traffic information in the United States, where he was Senior Vice President and General Counsel. Brian&#8217;s legal, corporate finance, general management background and extensive public company experience proved invaluable to Traffic.com during the process of its acquisition by NAVTEQ Corporation (NYSE: NVT) earlier this year.</p>\n\n<p>Previously, Brian was Chief Operating Officer of Halo Technology Holdings, a public holding company for enterprise software businesses. Prior to that, he was Managing Director at Katalyst LLC, a venture capital and consulting firm; General Counsel of National Media Corporation, a public multimedia company with operations in 70 countries; and was a Partner at Klehr, Harrison, Harvey, Branzburg &amp; Ellers LLP, a full-service Philadelphia-based law firm.</p>\n\n<p>Brian is a native of the greater Philadelphia region. He received a BS from Bucknell University and a JD from the University of Pennsylvania Law School.</p>\n\n<p>EXPERIENCE</p>\n\n<pre><code>* Traffic.com – Senior Vice President and General Counsel\n* Halo Technology Holdings – Chief Operating Officer\n* Katalyst LLC – Managing Director\n* National Media Corporation – General Counsel\n* Klehr, Harrison, Harvey, Branzburg &amp;amp; Ellers LLP – Partner\n</code></pre>\n\n<p>EDUCATION</p>\n\n<pre><code>* BS, Bucknell University\n* JD, University of Pennsylvania Law School\n</code></pre>","image":{"available_sizes":[[[108,150],"assets/images/resized/0002/5530/25530v1-max-150x150.jpg"],[[159,220],"assets/images/resized/0002/5530/25530v1-max-250x250.jpg"],[[159,220],"assets/images/resized/0002/5530/25530v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"SVP and General Counsel","firm":{"name":"Safeguard Scientifics","permalink":"safeguard-scientifics","type_of_entity":"company","image":{"available_sizes":[[[150,31],"assets/images/resized/0006/7104/67104v3-max-150x150.jpg"],[[250,51],"assets/images/resized/0006/7104/67104v3-max-250x250.jpg"],[[450,93],"assets/images/resized/0006/7104/67104v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}