{"first_name":"Brian","last_name":"Steel","permalink":"brian-steel-2","crunchbase_url":"http://www.crunchbase.com/person/brian-steel-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 07 01:59:33 UTC 2008","updated_at":"Mon Jul 14 23:47:59 UTC 2008","overview":"<p>Brian is currently the Chairman at Pandora International. Prior to that, Brian held the position of President, International, Yahoo Search Marketing. He was with Yahoo for three years, following its 2003 acquisition of Overture (previously GoTo.com). Prior to Overture/Yahoo, Brian was a Managing Director of Idealab, which created GoTo.com, and also President and CEO of Idealab Silicon Valley. While associated with Idealab, Brian also served on the boards of directors for a number of Idealab companies, including Airwave Wireless, Cooking.com, Cars Direct, Commission Junction, Desktop.tv, eVoice, Omnilux, Scan Mobile, Sameday Technologies, and Spun.com, as well as non-Idealab companies such as Discern Communications and Swell.com. Before joining Idealab, Brian served as president, chief operating officer, and director for On Command Corp., the world&#8217;s largest provider of information and entertainment services to the lodging industry. Previously, Brian held senior executive positions at SBC Communications and Shearson Lehman Brothers.</p>\n\n<p>Brian holds a B.A. in economics and conducted graduate work in corporate strategy at Duke University, international marketing and finance at the Pacific Asian Management Institute, and negotiation at Harvard University. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Board Member","firm":{"name":"MeeVee","permalink":"meevee","type_of_entity":"company","image":{"available_sizes":[[[126,71],"assets/images/resized/0000/1957/1957v1-max-150x150.png"],[[126,71],"assets/images/resized/0000/1957/1957v1-max-250x250.png"],[[126,71],"assets/images/resized/0000/1957/1957v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}