{"first_name":"Brian","last_name":"P. Christian","permalink":"brian-p-christian","crunchbase_url":"http://www.crunchbase.com/person/brian-p-christian","homepage_url":"http://www.zettaset.com","birthplace":"","twitter_username":"bxrist","blog_url":"","blog_feed_url":"","affiliation_name":"Zettaset (GOTO Metrics)","born_year":1976,"born_month":8,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Feb 16 20:07:09 UTC 2010","updated_at":"Mon Sep 19 03:44:05 UTC 2011","overview":"<p>Brian Christian is a Co-founder and Chief Executive Officer at Zettaset. He is the visionary behind its products and its platforms. Zettaset is the latest in a long line of successful and industry revolutionary ventures that he has created. His past ventures included SPI Dynamics which was the leading expert in Web application security assessment and testing before its successful exit to Hewlett-Packard in 2007. Brian has over 16 years of experience in high tech positions within the information technology industry with the last 15 years of his career focused exclusively on product innovation. His role at SPI Dynamics provided an ideal venue for his leadership and visionary capabilities. Brian’s successful career includes key security positions at Lucent Technologies, Security First Technologies and Internet Security Systems (ISS). While at Security First, the first online banking company, Brian helped to establish the baseline of Internet financial commerce and also created security policies for several Web-based Internet banking sites throughout America and Europe. While at ISS, Brian helped to create the standard for the industry’s first penetration and vulnerability assessment models. Brian has spoken on the topic of Web application security at numerous conferences world wide including SANS, Infosec, Infosec Canada, ISACA Audit Conference, ISSA and ISACA Chapter Meetings, Infosecurity and CSI. He was the San Francisco OWASP Chapter President from 2004 to 2007 and has contributed to and spoken at many of Silicon Valleys Emerging Web 2.0 events and conferences.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder & CTO","firm":{"name":"Zettaset","permalink":"goto-metrics","type_of_entity":"company","image":{"available_sizes":[[[150,39],"assets/images/resized/0007/6812/76812v3-max-150x150.png"],[[250,66],"assets/images/resized/0007/6812/76812v3-max-250x250.png"],[[284,75],"assets/images/resized/0007/6812/76812v3-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Founder","firm":{"name":"SPI Dynamics","permalink":"spi-dynamics","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}