{"first_name":"Brian","last_name":"Study","permalink":"brian-study","crunchbase_url":"http://www.crunchbase.com/person/brian-study","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"SAVO","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jul 18 20:18:24 UTC 2008","updated_at":"Tue Jul 29 18:58:56 UTC 2008","overview":"<p>Brian Study is SAVO’s Senior Vice President of Solution Architecture. In this role, he works with SAVO’s clients and prospects to understand how SAVO fits in their business and technology architecture and helps ensure each client has access to SAVO’s best practices around our product and around Sales Enablement. In addition to Sales Enablement, Brian has extensive background in CRM technology integration, content management, portals, technology program management, and the organizational issues related to technology implementation. He has fifteen years of experience using information technology to help clients create and implement solutions that enable change and achieve results.</p>\n\n<p>Brian has a BS in Economics from the Wharton School of the University of Pennsylvania. Prior to SAVO, Brian was Vice President / Associate Director in the technology practice with marketing consulting firm, Digitas. In this role, Study provided content management and web development expertise to Digitas’s clients and led the technology enablement practices for the Chicago office. Prior to joining Digitas, Brian held a variety of leadership positions, including roles at boutique consulting firm Roundarch and Deloitte Consulting.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"SVP Solution Architecture","firm":{"name":"SAVO","permalink":"savo","type_of_entity":"company","image":{"available_sizes":[[[136,47],"assets/images/resized/0002/2367/22367v1-max-150x150.png"],[[136,47],"assets/images/resized/0002/2367/22367v1-max-250x250.png"],[[136,47],"assets/images/resized/0002/2367/22367v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}