{"first_name":"Brian","last_name":"Ussher","permalink":"brian-ussher","crunchbase_url":"http://www.crunchbase.com/person/brian-ussher","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Mar 02 12:10:29 UTC 2012","updated_at":"Fri Mar 02 12:12:06 UTC 2012","overview":"<p>Brian Ussher is President and Co-Founder of iland Internet Solutions. Mr. Ussher co-founded iland in 1995 with Scott Sparvero, CEO. The company was initially created to provide web application development services to small, mid-size and large organizations. In 2000 iland moved into the colocation, dedicated server and virtual hosting business in order to provide companies with flexible and secure hosting environments. This move became the catalyst for iland’s further expansion into over 50 markets throughout the United States and Europe and the company’s development of server virtualization and replication technologies. Mr. Ussher is responsible for leading and directing the company’s day-to-day activities and together with Mr. Sparvero, is responsible for iland’s strategic direction and growth as a global provider of cloud infrastructure solutions.</p>\n\n<p>Prior to iland, Mr. Ussher developed software for a variety of verticals, including medical billing, construction, materials management, financial and POS systems. He also worked at Exxon, consulting and developing inter-company billing and tracking systems for core business functions such as telecommunications and document management. Mr. Ussher is well versed in Windows, Novell and UNIX systems, as well as network administration and application-level technical support.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President & Co-founder","firm":{"name":"iland","permalink":"iland","type_of_entity":"company","image":{"available_sizes":[[[150,78],"assets/images/resized/0017/6680/176680v1-max-150x150.jpg"],[[205,107],"assets/images/resized/0017/6680/176680v1-max-250x250.jpg"],[[205,107],"assets/images/resized/0017/6680/176680v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}