{"first_name":"Brian","last_name":"Karp","permalink":"brian-karp","crunchbase_url":"http://www.crunchbase.com/person/brian-karp","homepage_url":"http://www.bakerlaw.com/briankarp/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1980,"born_month":1,"born_day":8,"tag_list":"","alias_list":null,"created_at":"Wed Jun 29 19:35:56 UTC 2011","updated_at":"Thu Jun 30 18:03:30 UTC 2011","overview":"<p>Within the transactional business space, Brian Karp’s practice is broad, but tends to focus on technology acquisition and development, business formation, venture capital financing, strategic business acquisition, software licensing, electronic medical record system acquisition and implementation, licensing of print and media content for iPad and other electronic wireless delivery, general e-commerce counseling and commercial agreement negotiation.</p>\n\n<p>Mr. Karp has experience counseling, negotiating and drafting documents on behalf of clients, ranging from start ups to major international businesses, with respect to:</p>\n\n<p>Acquisition of large-scale information systems and cloud computing services, including development, customization and implementation, for healthcare providers, financial institutions and other industries; \nMergers and acquisitions, including disposition of operational business assets—assist with all phases from term sheets and confidentiality agreements to closing of the transaction; \nAdvise licensors and purchasers of enterprise software systems with respect to intellectual property and commercial rights; \nCounsel owners and purchasers of media content with respect to e-book, iPad and other electronic wireless distribution; \nAdvise start up businesses on entity formation and other new business considerations; \nVenture capital and other financing—assist with all phases from due diligence through drafting of purchase documents; \nAdvise dietary supplement producer on FDA and other regulatory considerations; \nDraft website Terms of Use and Privacy Policies; review of websites for compliance with privacy, data and security laws; \nCounsel regarding use of open source software and related issues; and \nCounsel regarding use of social media websites.\nMr. Karp has acted in a variety of capacities on behalf of the court-appointed Trustee for the liquidation of Bernard L. Madoff Investment Securities LLC, including in the areas of the Trustee’s purchase of data hosting, litigation support and e-discovery services. Separately, he has assisted in certain investigations conducted by the Trustee and his counsel.</p>\n\n<p>Additionally, Mr. Karp has served as primary counsel for Baker Hostetler with respect to the firm’s software and technology acquisition.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}