{"first_name":"Brock","last_name":"Pierce","permalink":"brock-pierce-3","crunchbase_url":"http://www.crunchbase.com/person/brock-pierce-3","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Playsino","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Apr 21 03:36:32 UTC 2012","updated_at":"Tue Jul 10 22:10:28 UTC 2012","overview":"<p>Brock Pierce (31) is an entrepreneur best known for pioneering the market for virtual goods in online games. He has founded eight companies, acquired more than 30 companies, and closed a dozen corporate finance transactions, securing more than $200 million on behalf of his companies. He is currently CEO of Playsino and Titan Gaming, Managing Director of the Clearstone Global Gaming Fund, and he sits on the boards of IMI Exchange, Xfire, EverTune, RevenueAPEX, and Spicy Horse Games.</p>\n\n<p>Pierce is a co-founder of Titan Gaming and assumed the role of CEO in November, 2011. Titan is a game developer and publisher of social casino games for Facebook and mobile platforms. Titan’s investors include Eric Schmidt’s Tomorrow Ventures and many of Southern California’s most successful entrepreneurs.</p>\n\n<p>Among his other current game ventures, Pierce is the founder of IMI Exchange, which raised over $100 Million from blue chip investors such as Goldman Sachs and Oak Investment Partners. During Pierce’s tenure as CEO, he managed the acquisition of over 30 companies and established operations in Shanghai, Hong Kong, Seoul and the United States, supporting more than 600 employees. Today, IMI Exchange owns the world’s leading marketplaces for the trading of virtual goods with sales exceeding $500 million annually. Pierce was more recently responsible for acquiring Xfire from Viacom. Xfire is a social application for hardcore gamers with over 21 million registered users. Xfire announced a new financing in October 2011 lead by Intel Capital. Xfire was previously acquired by Viacom in 2006 for $110 Million. Pierce joined the board of American McGee’s Shanghai based Spicy Horse Games in December 2011. </p>\n\n<p>Among his past game ventures, Pierce is the founder of ZAM Network. ZAM is one of the largest gaming media properties, providing information and services to more than 15 million hardcore PC gamers each month, generating more than 500 million monthly page views. ZAM was sold in January, 2012, to Tencent Holdings, the largest Internet company in China and third-largest in the world. </p>\n\n<p>Pierce co-founded GamesTV, a joint venture with Shanghai Media Group. GamesTV was a televised game channel similar to G4, serving the mainland Chinese market over the SMG Digital Platform. Pierce is also the founder of IGE, the company that pioneered the market for virtual goods in online games in the Western World. IGE generated nearly $100 Million in revenue in 2006 and was sold in early 2007.</p>\n\n<p>Pierce is primarily works in the game business, but has a few other current non-gaming businesses. Pierce is co-founder of EverTune, a patented proprietary technology that keeps any stringed instrument in tune for the life of the string set by utilizing a spring based constant tension system.  He is also co-founder of RevenueAPEX, a specialty finance company financing accounts receivables for the Internet advertising industry. </p>\n\n<p>Since 2010, Pierce has been one of two overseas advisors to the China Youth League of China, which governs the education and recreational activities for China’s youth up to the age of 28.  In addition to his role at the China Youth League, Pierce is also a board member of CGRI, a Non-Profit Joint Venture company with the China Youth League, whose purpose is to promote and regulate “green and healthy” online content for China’s Youth.</p>\n\n<p>Prior to entering the game business, Pierce co-founded Digital Entertainment Network (DEN), one of the first and most ambitious web television companies. DEN raised more than $88 million from investors including Microsoft, Intel Capital and NBC.  He began his career as a successful Hollywood actor, starring or appearing in twelve major motion pictures, including The Mighty Ducks and First Kid, as well as many commercials.</p>\n\n<p>Pierce generally plays the role of strategist and dealmaker in each company after attracting the management teams and capital. He is an active angel investor, a founding mentor of the Founder Institute’s LA Chapter, and a member of SoCal Tech and Media Entertainment Technology Alliance. Pierce is an active supporter of non-profit and advocacy organizations and is a member of Clinton Global Initiative.</p>\n\n<p>Both Wired and Fortune have written lengthy biographical feature stories on Pierce’s career. In addition, he has been a guest lecturer at Stanford, UCLA and USC, as well as many video game and entrepreneurial conferences.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Playsino","permalink":"playsino","type_of_entity":"company","image":{"available_sizes":[[[123,66],"assets/images/resized/0018/5296/185296v1-max-150x150.png"],[[123,66],"assets/images/resized/0018/5296/185296v1-max-250x250.png"],[[123,66],"assets/images/resized/0018/5296/185296v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}