{"first_name":"Brook","last_name":"Lang","permalink":"brook-lang","crunchbase_url":"http://www.crunchbase.com/person/brook-lang","homepage_url":"","birthplace":"Seattle","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jul 13 20:36:33 UTC 2011","updated_at":"Thu Jul 14 19:11:45 UTC 2011","overview":"<p>Brook Lang is currently the Founder and CEO of Montavo, Inc.</p>\n\n<p>Mr. Lang has previously served as CEO of Infomove, a leading wireless technology company, growing the company from intellectual property development phase to successful market launch. Subsequently, he was appointed to T-Mobile, a leading provider of wireless telecommunications services and a subsidiary of the Deutsche Telekom Group to spearhead sales and marketing initiatives in national retail for T-Mobile.  Mr. Lang was responsible for $800 million in yearly acquisition revenue, and helped negotiate and conclude a multimillion dollar multi-year sales program for T-Mobile. He also directed and co-managed a field sales force of over 400 sales personnel to exceed sales revenue quotas.</p>\n\n<p>After T-Mobile Mr. Lang started several executive projects in the wireless industry helping launch products and services to the wireless, content, gaming, retail, distribution, and enterprise markets, with L &amp; S. Later, Mr. Lang, together with proprietary IP he developed, was engaged to lead Montavo.</p>\n\n<p>Mr. Lang holds a Bachelor’s degree in Business Administration from the University of Washington.</p>","image":{"available_sizes":[[[150,146],"assets/images/resized/0014/4048/144048v2-max-150x150.jpg"],[[250,244],"assets/images/resized/0014/4048/144048v2-max-250x250.jpg"],[[450,439],"assets/images/resized/0014/4048/144048v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}