{"first_name":"Bruce","last_name":"Borup","permalink":"bruce-borup","crunchbase_url":"http://www.crunchbase.com/person/bruce-borup","homepage_url":"http://www.bruceborup.com","birthplace":"USA","twitter_username":"bruceborup","blog_url":"http://bruceborup.blogspot.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"strategy, chaos, complexity, leadership, business-planning, bruce-borup","alias_list":null,"created_at":"Wed Oct 17 17:52:44 UTC 2012","updated_at":"Wed Oct 31 00:24:05 UTC 2012","overview":"<p>Dr. Bruce Borup is a Sr. Consultant who assists clients with strategy development, business process improvement, training and development programs. </p>\n\n<p>His expertise is in the development of strategy during highly turbulent, complex situations or where the rate of internal or external change is very fast, such as during fast-growth, turn-around situations, international expansion, mergers or in rapidly declining markets. His day-to-day work involves the financial analyses of domestic and overseas investment opportunities including project assessments, monitoring and evaluation, cash flow analyses, cost benefit analyses, multi-criteria and multi-variant analyses, business model and revenue model assessments. Previous to this position, Dr. Borup was the Chief Executive Officer of a Bay-area high tech company (Eckso Bionics) and immediately prior to that he served as the CEO of a local $8 million company, which he grew to a $224 million diversified company with operations in eight countries and thirty-two states. He earned a spot on the Inc. 500 list for this performance. Dr. Borup graduated from Law School in England, has a Masters Degree in Marketing and a PhD in Business. He has also served as the Assistant Professor of Entrepreneurship and the Chair of the Business Department at Alaska Pacific University where he worked with entrepreneurs and SME’s to develop deal flow for Angel Investors and Venture Capitalists. He served as the Chairman of Alaska Investnet; Alaska’s premier investor network. Captain Borup (Ranger, Airborne) served for six years in the U.S. Army Infantry.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0021/6013/216013v2-max-150x150.jpg"],[[200,200],"assets/images/resized/0021/6013/216013v2-max-250x250.jpg"],[[200,200],"assets/images/resized/0021/6013/216013v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.facebook.com/pages/Bruce-Borup/232081356808281?sk=wall","title":"Facebook"},{"external_url":"http://twitter.com/#!/BruceBorup","title":"Twitter"},{"external_url":"http://bruceborup.com","title":""}]}