{"first_name":"Bruce","last_name":"Bauer","permalink":"bruce-bauer","crunchbase_url":"http://www.crunchbase.com/person/bruce-bauer","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Nov 23 16:05:00 UTC 2008","updated_at":"Sun Nov 23 16:06:53 UTC 2008","overview":"<p>Bruce is a founder of Newbury and has spent more than 21 years in the venture capital industry. At Newbury, Bruce focuses on investments in security, imaging, sensors, healthcare IT and enterprise software products and services. Bruce led the firm&#8217;s investments in, and has served on the Boards of Sentillion, Okena (acquired by Cisco), PS&#8217;Soft, MessageGate, PacificEdge Software (acquired by Serena Software), Hydrocision, Sensor Platforms, and NextBio. Prior to founding Newbury, Bruce worked as a Principal at Berkeley International Capital for eight years, directing the firm&#8217;s investments in healthcare and software. At Berkeley he organized and managed the investment of a $54 million portfolio of technology companies including Landmark Graphics (LGC), Nellcor (NELL), Sepracor (SEPR), Lumisys (acquired by Kodak), Crystal Semiconductor (acquired by Cirrus Logic), Resound (RSND), Ventritex (VNTX), Dianon Systems (acquired by LabCorp), and Protocol Systems (PCOL).</p>\n\n<p>Prior to Berkeley International, Bruce worked for Diasonics, where he was responsible for clinical product development, business development, and marketing for the Digital X-Ray Division. Bruce began his career in technology R&amp;D with American Edwards Labs (AHSC/Baxter) and advanced to business development roles including Director of Business Development. Bruce earned B.S.E. and Ph.D. degrees in Biomedical Engineering from Duke University.</p>\n\n<p>Originally from the East Coast, Bruce lives in the East Bay with his wife and two daughters. In his free time, Bruce enjoys skiing, woodworking, and flying. </p>","image":{"available_sizes":[[[110,150],"assets/images/resized/0002/9267/29267v1-max-150x150.jpg"],[[110,150],"assets/images/resized/0002/9267/29267v1-max-250x250.jpg"],[[110,150],"assets/images/resized/0002/9267/29267v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Senior Managing Director ","firm":{"name":"Newbury Ventures","permalink":"newbury-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,47],"assets/images/resized/0002/9265/29265v1-max-150x150.jpg"],[[250,78],"assets/images/resized/0002/9265/29265v1-max-250x250.jpg"],[[254,80],"assets/images/resized/0002/9265/29265v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}