{"first_name":"Bruce","last_name":"Magown","permalink":"bruce-magown","crunchbase_url":"http://www.crunchbase.com/person/bruce-magown","homepage_url":"http://www.interweave.biz","birthplace":"Providence","twitter_username":"InterWeave1","blog_url":"http://solutionsforthecloud.blogspot.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"salesforce, quickbooks, saas, sugarcrm","alias_list":null,"created_at":"Mon Aug 22 13:02:57 UTC 2011","updated_at":"Sun Aug 28 02:59:59 UTC 2011","overview":"<p>Bruce Magown is the Managing Director of Magown Advisory Group LLP., a Private Equity Group that invests in and advises technology focused companies. </p>\n\n<p>Mr. Magown is the Chief Executive Officer, President, Board Member and Investor in SecurDigital, Inc., the company that developed SecurVoice©; the voice, data and video encryption solution designed to pass FIPS 140-2 certification. Additional features in SecurVoice© are (PKI, 3DES, AES - and 27 other encryption algorithms) and VOIP. SecurVoice© has several modes of operation; they include two forms of encryption, two forms of cryptographic key management supported and three forms of communications when operating as a voice device.</p>\n\n<p>SecurDigital focus is executing and supporting the global distribution plan for SecurVoice© world-wide. SecurDigital has established SecurDigital© of Europe Ltd. (EU and Middle East), SecurDigital© Latin America (Central and South America) and SecurDigital© Africa, Pacific Rim and other global continents (future) are underway.</p>\n\n<p>Mr. Magown established Integration Technologies, Inc. and developed InterWeave, the SaaS SOA Integration Service, consisting of three simple components; the InterWeave Integration Platform, the Integration Manager and the Interactive Development Environment. He is the Chairman and CEO. </p>\n\n<p>Mr. Magown served as the Chief Operating Officer, Chief Financial Officer, head of the Audit Committee, Investor and Board member of the Uncommon Media Group, LLC. Mr. Magown subsequently served as President and Chief Operations Officer of Knoa Corp., a privately held company focusing on interactive and media rich solutions. Mr. Magown served as the Vice President of the strategic Alliance of Sun/Netscape formed by America Online and Sun Microsystems representing Canada, United States East Coast, and Latin America. Mr. Magown also served as the Chief Executive Officer of Information Engineering, Inc., an e-business solution provider.</p>\n\n<p>Specialties\nMarketing, SaaS, Enterprise Sales and Software Engineering </p>\n\n<p>Strategic and tactical planning, go-to-market strategy, solution selling</p>\n\n<p>Prepare or direct all corporate documents of the company and subsidiaries, stockholder issues, material contracts and agreements, litigation, employees and related parties, corporate financial information, corporate property, corporate taxation and audit, corporate insurance and liability, corporate governance and governmental regulations and filings</p>","image":{"available_sizes":[[[150,75],"assets/images/resized/0015/0510/150510v2-max-150x150.jpg"],[[250,125],"assets/images/resized/0015/0510/150510v2-max-250x250.jpg"],[[450,225],"assets/images/resized/0015/0510/150510v2-max-450x450.jpg"]],"attribution":"<p>Bruce Magown</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.interweave.biz","title":""},{"external_url":"https://twitter.com/#!/interweave1","title":""},{"external_url":"http://www.facebook.com/pages/InterWeave-Smart-Solutions/143916006885","title":""}]}