{"first_name":"Bruce","last_name":"Margetich","permalink":"bruce-margetich","crunchbase_url":"http://www.crunchbase.com/person/bruce-margetich","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Dec 31 07:40:52 UTC 2009","updated_at":"Thu Dec 31 07:53:39 UTC 2009","overview":"<p>Bruce Margetich has extensive knowledge and experience of corporate financial planning, operations and capital markets through a broad-based financial background that includes public accounting and financial management for both publicly held and privately owned companies. Since 1985, Bruce has participated in the venture capital industry and has been involved in individual transactions ranging from $2 million to $400 million. With strengths in corporate finance and strategic planning, Bruce has acted as a strategic financial advisor to numerous successful early-stage and growth-stage telecommunications and technology companies. Often acting as a senior manager, Bruce has assumed operating roles, led companies in developing comprehensive and cohesive growth plans, and advised on issues regarding mergers, acquisitions and divestitures, capital structure, equity and debt placements, public offering planning and filing, and other strategic business initiatives. Since 1996, Bruce has consulted technology companies whose investors included Safeguard Scientifics, Comcast, GE Capital, Cox Communications, Internet Capital, EnerTech, Edison Ventures, CSFirstBoston, CommVentures, JPMorgan, Van Wagoner Funds and Chase Capital. Some of the companies Bruce has advised include eColony, Enerwise Global Technologies, Arbinet-the-Exchange, StarCite, LinkShare Corporation, Essential.com, SageMaker and Telecom Towers.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Partner","firm":{"name":"Turnstone Capital Management","permalink":"turnstone-capital-management","type_of_entity":"financial_org","image":{"available_sizes":[[[150,23],"assets/images/resized/0007/1678/71678v1-max-150x150.jpg"],[[250,38],"assets/images/resized/0007/1678/71678v1-max-250x250.jpg"],[[321,50],"assets/images/resized/0007/1678/71678v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}