{"first_name":"Bruce","last_name":"Schneier","permalink":"bruce-schneier","crunchbase_url":"http://www.crunchbase.com/person/bruce-schneier","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Fri Mar 16 14:20:52 UTC 2012","updated_at":"Fri Mar 16 14:41:52 UTC 2012","overview":"<p>Bruce Schneier is an internationally renowned security technologist and author. </p>\n\n<p>Described by The Economist as a &#8220;security guru,&#8221; he is best known as a refreshingly candid and lucid security critic and commentator. When people want to know how security really works, they turn to Schneier.</p>\n\n<p>His first bestseller, Applied Cryptography, explained how the arcane science of secret codes actually works, and was described by Wired as &#8220;the book the National Security Agency wanted never to be published.&#8221; </p>\n\n<p>His book on computer and network security, Secrets and Lies, was called by Fortune &#8220;[a] jewel box of little surprises you can actually use.&#8221; Beyond Fear tackles the problems of security from the small to the large: personal safety, crime, corporate security, national security. </p>\n\n<p>His current book, Schneier on Security, offers insight into everything from the risk of identity theft (vastly overrated) to the long-range security threat of unchecked presidential power and the surprisingly simple way to tamper-proof elections.</p>\n\n<p>Regularly quoted in the media &#8211; and subject of an Internet meme &#8211; he has testified on security before the United States Congress on several occasions and has written articles and op eds for many major publications, including The New York Times, The Guardian, Forbes, Wired, Nature, The Bulletin of the Atomic Scientists, The Sydney Morning Herald, The Boston Globe, The San Francisco Chronicle, and The Washington Post.\nSchneier also publishes a free monthly newsletter, Crypto-Gram, with over 150,000 readers. </p>\n\n<p>In its ten years of regular publication, Crypto-Gram has become one of the most widely read forums for free-wheeling discussions, pointed critiques, and serious debate about security. As head curmudgeon at the table, Schneier explains, debunks, and draws lessons from security stories that make the news.</p>","image":{"available_sizes":[[[121,150],"assets/images/resized/0017/9183/179183v2-max-150x150.png"],[[138,171],"assets/images/resized/0017/9183/179183v2-max-250x250.png"],[[138,171],"assets/images/resized/0017/9183/179183v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}