{"first_name":"Bruce","last_name":"Lipnick","permalink":"bruce-lipnick","crunchbase_url":"http://www.crunchbase.com/person/bruce-lipnick","homepage_url":"http://www.assetalliance.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Asset Alliance","born_year":null,"born_month":null,"born_day":null,"tag_list":"asset-alliance, bruce-lipnick","alias_list":null,"created_at":"Wed May 30 20:33:08 UTC 2012","updated_at":"Fri Jun 08 02:27:35 UTC 2012","overview":"<p>Bruce H. Lipnick is Founder, Chief Executive Officer and Chairman of the Board of Directors of Asset Alliance Corporation (“Asset Alliance”). He is also Chairman and Chief Executive Officer of  Asset Alliance Advisors, Inc. He has an extensive background in alternative investments with over 38 years of experience in the investment management and financial services industries, and was a pioneer in utilizing various hedging techniques in portfolio management in the early 1970’s through the 1980’s.  Among other affiliate manager-related activities, Mr. Lipnick serves on the Board of Directors of Wessex Asset Management Limited, a UK based hedge fund manager as well as on the board of many of Asset Alliance&#8217;s subsidiary and sponsored funds. </p>\n\n<p>He is also a member of the Asset Alliance Investment Committee, Transaction Structuring Committee and CIO of the Asset Alliance Manager Participation Fund. Prior to founding Asset Alliance, Mr. Lipnick served as principal, general partner and senior executive officer for several investment management organizations including Wharton Management Group, Inc., which he founded in 1982 and also served as president. Mr. Lipnick is a member of the Advisory Council of the Milken Institute California Center and of the Advisory Board of the Eco Power Conference in Brazil. He is also a member of United States House of Representatives Speaker Nancy Pelosi’s Speaker’s Cabinet, and in 2002 he received Ernst and Young’s Entrepreneur of the Year Award. Mr. Lipnick is a supporter of the New Combinations Fund for the New York City Ballet and a supporter of the School of American Ballet at Lincoln Center. He is also a patron of MOMA and the Metropolitan Museum of Art, a past Dinner Chairman of Petra Nemcova’s Happy Hearts Fund and a board member of Hedge Funds Care. In 2008, Mr. Lipnick received the Lifetime Humanitarian Award for Giving from Hedge Funds Care. In May 2011, Mr. Lipnick received the Lifetime Achievement Award from The Young Jewish Professionals (YJP) for his career in the corporate finance world, spanning almost four decades. Earlier in his career, Mr. Lipnick was President and Founder of the Elms Companies and was Vice President of Ladenburg Thalmann &amp; Co., a merchant investment bank, in addition to founding and serving as President of Pierpont Management, Inc., a family office. Mr. Lipnick received a Bachelor of Arts in Finance from Long Island University in 1969. Mr. Lipnick has directly or indirectly owned or operated seats on several major U.S. Securities and Commodities Exchanges. Mr. Lipnick is a member of the Board of Directors for the Federal Enforcement Homeland Security Foundation.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder, Chief Executive Officer and Chairman of the Board ","firm":{"name":"Asset Alliance","permalink":"asset-alliance","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}