{"first_name":"Bruce","last_name":"Rieke","permalink":"bruce-rieke","crunchbase_url":"http://www.crunchbase.com/person/bruce-rieke","homepage_url":"http://www.blrieke.com","birthplace":"Shawnee Kansas ","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"B L Rieke Custom Homes","born_year":1965,"born_month":null,"born_day":null,"tag_list":"custom, home, builder, kansas-city, kansas, overland-park, leawood, olathe, shawnee, bruce, rieke","alias_list":null,"created_at":"Tue Nov 02 13:38:56 UTC 2010","updated_at":"Tue Nov 02 18:55:01 UTC 2010","overview":"<p>ounded by the husband and wife team of Bruce and Antonia (Toni) Rieke in 1989, B.L. Rieke Custom Homes has grown from a small business to a thriving and successful custom home building company. B.L. Rieke Custom Homes has built hundreds of custom dream homes for families in the metro Kansas City area and at the Lake of the Ozarks. </p>\n\n<p>Bruce and Toni’s high standards for producing uniquely distinguished, high-quality homes for their buyers have become a hallmark of their reputation. They believe communication is the foundation for a successful and rewarding building experience that begins with the homeowner and continues to their staff, skilled contractors, vendors, craftsmen and real estate professionals.</p>\n\n<p>Bruce has been in the construction industry for most of his life, starting as a teenager in his father’s concrete business by carrying foundation forms. Bruce and Toni are lifelong residents of Kansas City having lived in Shawnee, Lenexa, Desoto, Olathe and Overland Park. They are well known and respected in the community for their kindness, community support and reputation as quality custom builders. B.L. Rieke Custom Homes are the epitome of craftsmanship and quality and are highly valued by homeowners.</p>\n\n<p>Since 1994, B.L. Rieke Custom Homes has been recognized multiple times as a winner of homebuilder awards including the Grand Award for the Pick of Parade, American Dream and Distinctive Design awards for the greater Kansas City area. These awards have been earned through construction of inventive homes adhering to the most stringent standards in the industry. </p>\n\n<p>B.L. Rieke Custom Homes is an active participant in the Home Builders Association of Greater Kansas City, the Kansas City Area Council, the National Association of Home Builders and the Better Business Bureau. After visiting the home you will note that each home they build is not just a house but a dream home.</p>\n\n<p>Bruce Rieke’s Specialties:\nCustom Home Building with attention to quality and service. \nOver two decades of building a dream home for families all over the KC Metro area.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Owner","firm":{"name":"B L Rieke Custom Homes","permalink":"b-l-rieke-custom-homes","type_of_entity":"company","image":{"available_sizes":[[[150,52],"assets/images/resized/0011/4647/114647v2-max-150x150.jpg"],[[250,86],"assets/images/resized/0011/4647/114647v2-max-250x250.jpg"],[[450,156],"assets/images/resized/0011/4647/114647v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.blrieke.com","title":"Company Website "},{"external_url":"http://www.facebook.com/bruceriekecustomhomes","title":"Facebook "}]}