{"first_name":"Bruno","last_name":"Ott","permalink":"bruno-ott","crunchbase_url":"http://www.crunchbase.com/person/bruno-ott","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Opinno","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Sep 02 02:31:20 UTC 2009","updated_at":"Thu Sep 17 00:23:09 UTC 2009","overview":"<p>Bruno Ott is the General Director of Opinno in Spain. Bruno is an industrial engineer from the ICAI and received his MBA from the Instituto de Empresa.</p>\n\n<p>Previously Bruno was the General Director of Real Estate Group with a presence in Spain, Portugal, the United States and England. Bruno’s duties included holding positions on the councils of the companies that comprised the real estate group and supervising all areas of group purchasing, sales, administration, finance, legal issues, etc.</p>\n\n<p>He has extensive experience in managing national and international projects. He has assembled a sales network with offices in London, Amsterdam, Dublin, Madrid and Murcia selling over 1,500 units in two years.</p>\n\n<p>Bruno has been an advisor for Hoteles H10, Prasa, and Sanostra y Globalia among others. Since 2005, he has also been the owner of multiple hairdressing and beauty salons of the Marco Aldany franchise.</p>\n\n<p>In recent years, he has obtained bank financing for international projects such as the purchase of a 5 star hotel in the Dominican Republic, a building in SoHo in New York and solar arrays in Portugal.</p>\n\n<p>During his earlier career as a Senior Strategy Consultant at Accenture, he was involved in multiple strategic plans, marketing plans and sales and reorganizations for companies like Coca Cola, IZAR, PSA, BMW and Globalia. In the latter he served as Head of Staff of the Presidency for a year, reporting directly to the Hidalgo family. </p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0005/9980/59980v2-max-150x150.jpg"],[[150,187],"assets/images/resized/0005/9980/59980v2-max-250x250.jpg"],[[150,187],"assets/images/resized/0005/9980/59980v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director, Spain","firm":{"name":"Opinno","permalink":"opinno","type_of_entity":"company","image":{"available_sizes":[[[150,52],"assets/images/resized/0005/8503/58503v2-max-150x150.jpg"],[[200,70],"assets/images/resized/0005/8503/58503v2-max-250x250.jpg"],[[200,70],"assets/images/resized/0005/8503/58503v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}