{"first_name":"Bruno","last_name":"Teuber","permalink":"bruno-teuber","crunchbase_url":"http://www.crunchbase.com/person/bruno-teuber","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jan 19 22:01:30 UTC 2010","updated_at":"Sun May 16 20:33:19 UTC 2010","overview":"<p>As the Vice President &amp; GM EMEA, Bruno is responsible for driving and managing the growth of Lithium’s business in rapidly expanding international markets.</p>\n\n<p>He joins Lithium with a 17 year track record of successfully creating and scaling high performing EMEA sales organizations for many different US companies such as Digital Equipment Corporation, Sun Microsystems, Tivoli Systems, IBM, and Motive Communications. Most recently, Bruno was VP of Worldwide Sales at ON Networks, a new media company in the video content and advertizing space.</p>\n\n<p>Prior to ON Networks, Bruno was responsible for building Motive’s business in Europe from zero to a 90 person organization contributing to more than half of the company’s global revenue. Before Motive, Bruno was Vice President of EMEA sales for Tivoli Systems, before and after IBM’s acquisition, managing a staff of over 400 people and business of over $1 billion in revenue. For Sun Microsystems, he managed a Swiss bank cooperation globally, at that time one of Sun’s largest and most important world-wide customers. Bruno started his business career at Digital Equipment Corporation as an engineer, installing and project managing large and complex computer networks, before moving to Digital’s marketing and sales departments.</p>\n\n<p>Bruno was born and raised in Switzerland where he graduated from the School of Business Administration Zürich and also holds an engineering degree.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP & GM EMEA","firm":{"name":"Lithium Technologies","permalink":"lithiumtechnologies","type_of_entity":"company","image":{"available_sizes":[[[150,54],"assets/images/resized/0000/4156/4156v8-max-150x150.png"],[[165,60],"assets/images/resized/0000/4156/4156v8-max-250x250.png"],[[165,60],"assets/images/resized/0000/4156/4156v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}