{"first_name":"Bryan","last_name":"Long","permalink":"bryan-long","crunchbase_url":"http://www.crunchbase.com/person/bryan-long","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Retroficiency","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Mar 31 17:17:05 UTC 2011","updated_at":"Wed Apr 06 18:13:04 UTC 2011","overview":"<p>Bryan is a computer engineer with a background in software development and a passion for building things from scratch.  </p>\n\n<p>At Retroficiency, his primary responsibility is to develop and oversee the technology that drives the Efficiency Identification and Qualification (EIQ) platform.  </p>\n\n<p>Prior to joining Retroficiency, Bryan spent ten years at the US government at the Volpe Center, a research and development facility.  In the last six years he spent his time deploying an international network that allowed over 50 countries to share maritime information in real time.  He helped develop the specification and system architecture, deploy the servers, and later was involved with installing sensors around the world to help expand the coverage of the network. Bryan was responsible for the complete life cycle of the software, including  accreditation within the US Navy.<br/>\nPrior to joining the government, Bryan was a co-founder of a company,  Cadimus Technologies, that developed a digital jukebox for use in high end home entertainment systems.  The prototype that was developed won the 2002 Electrical Engineering Senior design competition, Capstone, at Northeastern University.</p>\n\n<p>From 2007 - 2009 Bryan attended Massachusetts Institute of Technology&#8217;s Sloan School of Management where he expanded his knowledge and leveraged his data background to come up with novel ideas.  Bryan&#8217;s thesis, co-authored with Taariq Lewis, was on applying data diffusion methods to ecommerce retail sales transactions to better predict sales trajectories.  Bryan met Bennett Fisher at MIT Sloan and started working on the technology that drives Retroficiency today.  From initial system design to the EIQ platform that exists today Bryan has been overseeing and directing the technology that will change the manual energy audit chore into a technology-assisted and scalable process.\nBryan received his BS in Electrical Engineering from the Northeastern University and an MBA  from MIT Sloan.</p>","image":null,"degrees":[{"degree_type":"MBA","subject":"Business","institution":"Massachusetts Institute of Technology","graduated_year":2009,"graduated_month":null,"graduated_day":null},{"degree_type":"BS","subject":"Electrical and Computer Engineering","institution":"Northeastern University","graduated_year":2002,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CTO & Co-Founder","firm":{"name":"Retroficiency","permalink":"retroficiency","type_of_entity":"company","image":{"available_sizes":[[[150,40],"assets/images/resized/0012/5645/125645v4-max-150x150.jpg"],[[250,67],"assets/images/resized/0012/5645/125645v4-max-250x250.jpg"],[[450,121],"assets/images/resized/0012/5645/125645v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}