{"first_name":"Bryant","last_name":"J. Tong","permalink":"bryant-j-tong","crunchbase_url":"http://www.crunchbase.com/person/bryant-j-tong","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 02 11:14:03 UTC 2009","updated_at":"Tue Jun 02 11:22:41 UTC 2009","overview":"<p>Bryant Tong joined Nth Power in 2001 as a Managing Director.</p>\n\n<p>Bryant has led Nth Power’s investments in Accelergy Corporation, NanoGram Corporation, Microposite, Inc. and Arxx Corporation, and he serves on the board of each of these companies.</p>\n\n<p>Previously, Bryant was founder, President and CEO of Pacific Venture Capital, LLC (PVC), the venture capital arm of the PG&amp;E Corporation. At PVC, Bryant led investments in the energy and telecommunications sectors.</p>\n\n<p>Prior to joining PVC, Bryant co-founded ReSourcePhoenix, Inc. (RPC) and successfully took the company public. RPC pioneered the use of the Internet to help businesses outsource their IT and accounting operations. As President and COO, he planned business strategy, sales and marketing and was responsible for all day-to-day operations.</p>\n\n<p>Previous to ReSourcePhoenix, Bryant also served as part of the senior management group at Phoenix American, Inc. While at Phoenix American, Bryant worked with Phoenix Growth Capital (PGC). PGC invested in over 200 venture capital-backed companies by providing venture lease financing. PGC was one of the most profitable divisions within Phoenix American.</p>\n\n<p>A native of San Francisco, California, Bryant received his Bachelor of Science in business administration from the Haas School of Business at the University of California, Berkeley. Bryant is a member of the American Institute of CPAs and also serves as a member of several industry advisory boards including the Energy Venture Fair and the Golden Capital Network. Bryant founded and chairs the China-U.S. Energy Efficiency Alliance. Bryant also serves on the University of San Francisco Entrepreneurship Program Advisory Board.</p>","image":{"available_sizes":[[[118,150],"assets/images/resized/0004/6279/46279v1-max-150x150.jpg"],[[126,159],"assets/images/resized/0004/6279/46279v1-max-250x250.jpg"],[[126,159],"assets/images/resized/0004/6279/46279v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor of Science","subject":"Business administration","institution":"University of California","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Nth Power","permalink":"nth-power","type_of_entity":"financial_org","image":{"available_sizes":[[[150,100],"assets/images/resized/0004/6272/46272v1-max-150x150.png"],[[150,100],"assets/images/resized/0004/6272/46272v1-max-250x250.png"],[[150,100],"assets/images/resized/0004/6272/46272v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}