{"first_name":"Bryan","last_name":"Rosencrantz","permalink":"bryan-rosencrantz","crunchbase_url":"http://www.crunchbase.com/person/bryan-rosencrantz","homepage_url":"http://fitscape.com","birthplace":"Portland, OR","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1973,"born_month":null,"born_day":null,"tag_list":"entrepreneur, entrepreneurship, wellness, health, healthcare, fitness, diet, weight, weight-loss, sports, activity, iwell, fitscape","alias_list":null,"created_at":"Mon Nov 10 01:46:37 UTC 2008","updated_at":"Sat Dec 18 00:23:17 UTC 2010","overview":"<p>Bryan is the CEO of Fitscape, Inc., which was one of the first health destinations ever to exist on the internet.  Fitscape is a healthcare software company committed to innovation and total body well-being. Founded in 1995, it was one of the first companies to recognize the benefit of bringing health and wellness solutions online, utilizing its revolutionary iWell platform. Fitscape continues to pioneer new products and concepts to shape the health and wellness industry.</p>\n\n<p>Bryan&#8217;s experience includes startup consulting, healthcare software, merchandising, computer programming and analysis, and real estate business development and procurement.  He has worked with well known corporations and celebrities, and has been featured on LA&#8217;s Channel 9 News, and various publications including the Los Angeles Business Journal, Venice Interactive Community, Entrepreneur Magazine, Microsoft.com, Dummies books, college text books, and the USC Business School Magazine.</p>\n\n<p>Bryan graduated from the University of Southern California with a degree in business and entrepreneurship. He received the distinguished Marcia Israel &#8220;Outstanding Student of the year&#8221; award, as well as a Top Five business plan award. Bryan was the only graduate from the program to receive both honors, and returns to lecture and grade business plans.</p>\n\n<p>In his spare time Bryan volunteers as a search and rescue pilot for the USAF Aux Civil Air Patrol, is an avid published photographer, and serves on numerous charitable boards.</p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0011/4132/114132v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0011/4132/114132v2-max-250x250.jpg"],[[450,300],"assets/images/resized/0011/4132/114132v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.S.","subject":"Business Administration Entrepreneur Program","institution":"University of Southern California","graduated_year":1996,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}