{"first_name":"Bryan","last_name":"Mistele","permalink":"bryan-mistele","crunchbase_url":"http://www.crunchbase.com/person/bryan-mistele","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Aug 04 10:51:17 UTC 2011","updated_at":"Thu Aug 04 10:52:51 UTC 2011","overview":"<p>Bryan Mistele is the co-founder, President &amp; Chief Executive Officer of INRIX. Bryan started INRIX in 2004, having had more than 15 years experience building high-technology businesses and transforming industries through the power of information technology\nPrior to INRIX, Mistele was an executive at Microsoft, responsible for successfully building and managing four businesses within the company including global responsibility for Automotive Telematics and Mobile Services; as well as HomeAdvisor Technologies, Inc. and Microsoft Investor/MSN MoneyCentral. He was most recently the General Manager of Microsoft&#8217;s Automotive Group. In this role, Mistele was responsible for driving the overall market success of Microsoft&#8217;s Automotive products worldwide, including T-Box - Microsoft&#8217;s wireless telematics device (known in the market as Ford Sync and Fiat Blue &amp; Me) and Voice Command - a revolutionary speech recognition product for the Pocket PC. Prior to Microsoft, Mistele worked at the Ford Motor Company.\nAs a leader on technology and transportation issues, Bryan serves as a member of the Bipartisan Policy Center&#8217;s National Transportation Policy Project, and as a member of the United States Department of Transportation&#8217;s ITS Advisory Committee. In addition, Bryan serves on the board of the Discovery/Cascadia Institute, a leading think-tank on transportation issues in the Northwest and on the regional executive committee of Gen Next, a network of accomplished entrepreneurial leaders committed to taking on global challenges.</p>","image":{"available_sizes":[[[131,150],"assets/images/resized/0014/7782/147782v1-max-150x150.jpg"],[[187,214],"assets/images/resized/0014/7782/147782v1-max-250x250.jpg"],[[187,214],"assets/images/resized/0014/7782/147782v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"","institution":"Harvard Business School","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President & Chief Executive Officer ","firm":{"name":"INRIX","permalink":"inrix","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0006/8926/68926v2-max-150x150.jpg"],[[250,75],"assets/images/resized/0006/8926/68926v2-max-250x250.jpg"],[[450,136],"assets/images/resized/0006/8926/68926v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}