{"first_name":"Bryon","last_name":"Evje","permalink":"bryon-evje","crunchbase_url":"http://www.crunchbase.com/person/bryon-evje","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Broadband Enterprises","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Aug 27 11:22:59 UTC 2007","updated_at":"Thu May 01 00:46:24 UTC 2008","overview":"<p>Bryon Evje has been the Chief Operating Officer of Broadband Enterprises for over two years and has been responsible for expanding the company’s network across 1,700 web publishers, whose aggregate monthly footprint includes 800 million video streams and approximately 25 million unique users. He joined Broadband Enterprises in October, 2004.</p>\n\n<p>In addition to overseeing the company’s affiliate network, Evje has structured strategic programming partnerships and built the company’s syndication and technology businesses. He is also responsible for helping shape the company’s original production strategy and partnerships.</p>\n\n<p>Prior to joining Broadband Enterprises, Evje was vice president for broadband video distributor Wavexpress, with primary responsibilities including fulfilling operational and sales functions for one of the web’s pioneering Video On Demand (VOD) technology providers.</p>\n\n<p>Evje began his internet career as a professional sports content provider for ACSSports, he was responsible for all programming operations for a host of major professional sports teams, including the New York Yankees, Baltimore Orioles, Cleveland Browns and Washington Capitals.</p>\n\n<p>He began his professional career as a sportswriter, where he wrote for a variety of sports websites, including ESPN.com, Fox Sports.com, The Sporting News.com, as well as online advertising industry trade magazines and websites.</p>\n\n<p>He graduated form New York Tech in Long Island in 1995 with a BA in Communications. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}