{"first_name":"Burton","last_name":"H. Lee","permalink":"burton-h-lee","crunchbase_url":"http://www.crunchbase.com/person/burton-h-lee","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Dec 03 10:56:39 UTC 2008","updated_at":"Wed Dec 03 10:58:19 UTC 2008","overview":"<p>Burton Lee has spent more than fifteen years working in venture-backed startups, global high tech corporations, strategic consulting firms, leading research universities, and federal and state agencies. His experience includes senior positions with leading technology organizations such as GE Global Research, Hewlett Packard, DaimlerChrysler AG, and NASA. His expertise spans the commercial space, aviation, information technology, nanotech, alternative energy, clean tech, and robotics industries.</p>\n\n<p>Burton currently serves as Managing Partner of Innovarium Ventures, a firm that provides strategic, financial and technical advisory services to startup companies, venture capital and private equity firms, angel networks, investment banks, major corporations, and federal and state agencies. He served as Chairman of the highly successful Space Venture Finance Symposium held in May 2007, and is a co-founder of Spaceport America in New Mexico.</p>\n\n<p>Burton holds a Ph.D. in Mechanical &amp; Electrical Engineering from Stanford, an MBA in finance and entrepreneurship from Cornell University, and an AB in Physics from Brown University. He is a graduate of the founding class of the International Space University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Principal","firm":{"name":"Space Angels","permalink":"space-angels","type_of_entity":"financial_org","image":{"available_sizes":[[[150,34],"assets/images/resized/0003/0856/30856v1-max-150x150.jpg"],[[250,56],"assets/images/resized/0003/0856/30856v1-max-250x250.jpg"],[[316,72],"assets/images/resized/0003/0856/30856v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}