{"first_name":"Cameron","last_name":"Turner","permalink":"cameron-turner","crunchbase_url":"http://www.crunchbase.com/person/cameron-turner","homepage_url":"http://be.net/limedesigns","birthplace":"St. Louis, Mo","twitter_username":"ideadoc","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1986,"born_month":7,"born_day":10,"tag_list":"entrepreneur","alias_list":null,"created_at":"Mon Oct 31 06:58:55 UTC 2011","updated_at":"Tue Nov 29 22:23:45 UTC 2011","overview":"<p>Cameron is the vision of iDeaDoc.  As Founder and CEO this idea came to him in a plan to eliminate bad ideas.  In the process of brainstorming he realized there was a tool here that could help people who has a business or idea, make it better. </p>\n\n<p>As a young entrepreneur Cameron has learned the ups and downs of generating business. Adopting web design and eventually user experience design and development, it came natural to him to create a visual solution for this. While always making it a point to be around great problems solvers in their own frields, Cameron has been able to learn modern business strategy.</p>\n\n<p>This mixture of design, intent, and a clear goal he has his eyes set on the startup world. Have worked on branding and development for startups like: TabJuice, Antengo, MySportz, WebRat, EverBank, Acceptly, Eco ATM and many others. Many of these opportunities while only invited a design position, allowed him to wear many hats, and in some occasions help refocus the companies plans to succeed. </p>\n\n<p>Now partnering up with savvy people and great leaders Cameron is looking to build up a portfolio of companies with matched quality of industry leaders. </p>","image":{"available_sizes":[[[113,150],"assets/images/resized/0016/0157/160157v2-max-150x150.jpg"],[[188,250],"assets/images/resized/0016/0157/160157v2-max-250x250.jpg"],[[283,375],"assets/images/resized/0016/0157/160157v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}