{"first_name":"Camilo","last_name":"Acosta","permalink":"camilo-acosta","crunchbase_url":"http://www.crunchbase.com/person/camilo-acosta","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Root Orange","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Mar 01 21:55:26 UTC 2010","updated_at":"Sun Oct 30 02:37:44 UTC 2011","overview":"<p>Camilo is founder and CEO of PayByGroup, a group payment platform so no single person is on the hook for group purchases like vacation rentals, concerts, sporting events, etc.  PayByGroup integrates directly with merchants and employs a Kickstarter model where payments only go through once a minimum number of people have bought in.  PayByGroup is a 500 Startups company, and Camilo&#8217;s second venture with Frank Langston.</p>\n\n<p>Before starting PayByGroup, Camilo and Frank started Root Orange, a domain-splitting business that allowed a different business in every city to use the exact same domain name at the same time.</p>\n\n<p>Prior to that, Camilo worked for his mom’s government communications company,The Media Network, where he introduced newfangled tools young people use like Facebook and Twitter to the company’s communications offerings.  Years later, the federal government is still figuring out how to use social media.  He also oversaw the company’s website re-design, which introduced him to the headache of website re-design.  Camilo’s previous gigs include stints at the Corporate Executive Board and New Vantage Group, a venture capital firm in Northern Virginia.</p>\n\n<p>During the rare times he is not working, Camilo does fundraising and advocacy work for education reform efforts, a cause both he and Frank fervently support.  He was almost assaulted once by an angry mob of fired (read: low-performing) public school teachers while testifying at a D.C. City Council hearing.  Camilo enjoyed the experience and The Washington Post found it newsworthy.</p>\n\n<p>Camilo received his B.A. in Politics from Princeton University, where his thesis on micro-finance in South Africa inexplicably managed to receive the Picard Prize. He is a graduate of the Sidwell Friends School in Washington, D.C, where he enjoyed pasta dinners with Al Gore at the Vice President’s residence and seeing Hillary Clinton in frumpy mom clothes.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder & CEO","firm":{"name":"PayByGroup","permalink":"paybygroup","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0015/9844/159844v2-max-150x150.png"],[[250,250],"assets/images/resized/0015/9844/159844v2-max-250x250.png"],[[450,450],"assets/images/resized/0015/9844/159844v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"co-President","firm":{"name":"Root Orange","permalink":"root-orange","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}