{"first_name":"Carey","last_name":"Lai","permalink":"carey-lai","crunchbase_url":"http://www.crunchbase.com/person/carey-lai","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Institutional Venture Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jan 12 01:20:21 UTC 2010","updated_at":"Fri Dec 03 19:09:26 UTC 2010","overview":"<p>Carey Lai joined Institutional Venture Partners (IVP) in June of 2004. He focuses primarily on rapidly growing later-stage, growth-equity and select public market investments in software, Internet, wireless, and technology-enabled services companies. Carey actively works with IVP portfolio companies Cortina Systems, Hands-On Mobile, LiveOps, MotoSport, Synchronoss Technologies (SNCR) and Varolii. Carey also actively participated in venture investments in ArcSight (acquired by Hewlett-Packard), Business.com (acquired by RHD), Concur (CNQR), Danger (acquired by Microsoft), eHealth (EHTH), Data Domain (acquired by EMC), HomeAway, MarkMonitor, Mobile365 (acquired by Sybase), Motion Computing, SuccessFactors (SFSF), Tripwire, and Yodlee. Carey currently serves on the Board of Directors of MotoSport and is a Board Observer for Hands-On Mobile.</p>\n\n<p>Prior to joining IVP, Carey was a Financial Analyst in the Technology Investment Banking Group at Banc of America Securities. While at Banc of America Securities, Carey focused on strategic company, industry, and transaction analyses in conjunction with both corporate finance and advisory engagements. His responsibilities included expanding the firm&#8217;s footprint by evaluating potential opportunities and analyzing emerging technologies within the financial technology, infrastructure and application software sectors. His transaction experience included offerings for some of the leading technology companies in the country, including Blackbaud Software (BLKB), Computer Associates (CA), Hewlett Packard (HPQ), Sungard Data Systems (SDS), and Tibco Software (TIBX).</p>\n\n<p>Earlier in his career, Carey worked for PricewaterhouseCoopers, advising clients within the Technology sector. Carey currently serves on the executive committee team of NextGen Partners, an organization of over 250 pre-partner venture capitalists, and also serves as a mentor for the TACL Internship Program.</p>\n\n<p>Carey earned a B.A. in International Economics from the University of California at Los Angeles and an M.B.A. from the Wharton School of Business at the University of Pennsylvania with a major in Finance.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0011/2503/112503v2-max-150x150.jpg"],[[178,250],"assets/images/resized/0011/2503/112503v2-max-250x250.jpg"],[[321,450],"assets/images/resized/0011/2503/112503v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"","institution":"University of Pennsylvania","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Vice President","firm":{"name":"Institutional Venture Partners","permalink":"institutional-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,68],"assets/images/resized/0001/5065/15065v3-max-150x150.jpg"],[[250,113],"assets/images/resized/0001/5065/15065v3-max-250x250.jpg"],[[450,204],"assets/images/resized/0001/5065/15065v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}