{"first_name":"Career","last_name":"Workz","permalink":"career-workz","crunchbase_url":"http://www.crunchbase.com/person/career-workz","homepage_url":"http://www.careerworkz.com/","birthplace":"Ahmedabad","twitter_username":"careerworkz","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"indias-free-job-site, india-free-jobs-posting, india-job-posting, fresher-jobs-ahmedabad, premier-indian-job-portal, it-jobs-ahmedabad","alias_list":null,"created_at":"Wed Feb 23 12:39:29 UTC 2011","updated_at":"Thu Feb 24 20:37:55 UTC 2011","overview":"<p>Careerworkz is started with a goal to deliver the best talents to the industry. With the increasing demand of skilled manpower in the industry its hard to find right candidate for the right position as well companies are coming out with different kind of demand as per the changing industry. We are trying to create a platform to help employees and employers to come together at a single platform and satisfy their needs.</p>\n\n<p>We are soon launching the official website which would have ample of features for employers to manage their job listing, take online interviews, an unique way to search for resumes, resume database manager, online job posting with one click to multiple sites and many more features. On the other hand candidates will have some unique features like creating a unique stylized CV, multiple resume options, direct contact to consultants, multiple job posting facility, video CV and PDF CV creation, self evaluation and many more features.</p>\n\n<p>Companies posting jobs will have unique mini website feature where they can post jobs as well track and connect to their existing website. We are here to bring a revolution in the industry which is surely going to make a huge difference in every day routine. Careerworkz will serve you with the best of industry jobs and candidates.</p>\n\n<p>Write us back at career@careerworkz.com if you have any suggestions.</p>","image":{"available_sizes":[[[150,24],"assets/images/resized/0012/3557/123557v2-max-150x150.png"],[[250,40],"assets/images/resized/0012/3557/123557v2-max-250x250.png"],[[254,41],"assets/images/resized/0012/3557/123557v2-max-450x450.png"]],"attribution":"<p>Jobs across India</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}