{"first_name":"Carl","last_name":"Roetger","permalink":"carl-roetger","crunchbase_url":"http://www.crunchbase.com/person/carl-roetger","homepage_url":"http://www.uni-span.com.au","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1973,"born_month":7,"born_day":17,"tag_list":"","alias_list":null,"created_at":"Sun Apr 17 05:37:05 UTC 2011","updated_at":"Sun Apr 17 15:08:46 UTC 2011","overview":"<p>At Uni-Span, we hire and sell quality and innovative scaffolding and formwork equipment. We’ve been working successfully in Australia and abroad for more than 25 years and our highly professional management team has more than 90 years combined experience in the industry. We know what equipment you need, how to maximise the return on your investment and how to deliver to schedule, safely, efficiently and without fuss.\nWe act as a flexible one-stop shop to save you precious time. So whether you’re a developer, builder, construction manager, form worker or event manager tackling major or minor projects in Australia, you’ll find Uni-span’s wide range of scaffolding products tick all the right boxes – innovative, durable, credible, competitively priced and Australian Safety Standard guaranteed. We sell quality Scaffolding and Formwork equipment nationwide and stock equipment for hire in Queensland and, thanks to our industry leading delivery system, our orders always arrive on time.\nOngoing innovation is important to us and we’re constantly thinking about more effective and cost-efficient solutions to address your Scaffolding and Formwork equipment needs; our unique Uni-mesh containment solution is one new example. We predominantly sell Heavy Duty Galvanised modular scaffolding systems and if it’s aluminium scaffolding you’re after, click on Superhire for solutions. If we don’t stock a product we can most likely source it, so just ask.\nIf you’re ready for a quote or want some advice on our range of Scaffold and formwork products, call us on 1300 882 825 or email your specs through our website – we’ll get back to you the following day. You’re also welcome to visit our head office and Scaffold and formwork equipment yard in Yatala, Qld or our Western Australia Scaffold division.\nFor more information about the breadth of Uni-Span’s Scaffolding and Formwork business, browse our website, call our knowledgeable sales staff or download the company catalogue. We’re here to help you get the job done efficiently, effectively and safely</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.uni-span.com.au","title":""}],"web_presences":[]}