{"first_name":"Carl","last_name":"Bass","permalink":"carl-bass","crunchbase_url":"http://www.crunchbase.com/person/carl-bass","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"iRise","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Apr 30 02:59:55 UTC 2008","updated_at":"Mon Apr 23 23:23:34 UTC 2012","overview":"<p>Carl Bass is president and chief executive officer of Autodesk, Inc. Formerly he was Autodesk&#8217;s chief operating officer, responsible for worldwide sales, marketing and product development. Earlier roles included CTO and EVP of product development. </p>\n\n<p>In 1981, Mr. Bass co-founded Flying Moose Systems and Graphics Ltd., which became Ithaca Software in 1986. He served as chief technology officer and CEO. Mr. Bass joined Autodesk when the company acquired Ithaca Software, the developers of HOOPS, in 1993. </p>\n\n<p>When Autodesk spun off its Buzzsaw division in 1999 as a separate start-up, Mr. Bass left to be its CEO and president. He returned to Autodesk when the company acquired Buzzsaw in 2001. </p>\n\n<p>Mr. Bass serves on the Board of Directors of Autodesk and e2Open. He also serves on the Board of Trustees at the Art Center College of Design. Mr. Bass previously served on the board of McAfee and iRise. He is a member of the Executive Advisory Boards of Cornell Computing and Information Science and U.C. Berkeley School of Information and FIRST (For Inspiration and Recognition of Science &amp; Technology). </p>\n\n<p>Mr. Bass was born in New York, New York. His father was a chemist and his mother a New York City schoolteacher. After starting college at Cornell University, Mr. Bass took a five-year hiatus to build boats, furniture and sculpture in Seattle and Maine. He graduated from Cornell University in 1983 with a bachelor&#8217;s degree in mathematics. </p>\n\n<p>Mr. Bass owns a workshop near his home in Berkeley, Calif.,  where he designs and fabricates objects made from wood, metal and stone. His projects have included furniture, sculpture and a walk-in wooden rocket ship he built for his children, which is on permanent display at Chabot Science Center. He is married to Daryl Austern and they have two children. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Board of Directors","firm":{"name":"iRise","permalink":"irise","type_of_entity":"company","image":{"available_sizes":[[[150,68],"assets/images/resized/0001/7014/17014v1-max-150x150.jpg"],[[176,80],"assets/images/resized/0001/7014/17014v1-max-250x250.jpg"],[[176,80],"assets/images/resized/0001/7014/17014v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Board of Directors","firm":{"name":"E2open","permalink":"e2open","type_of_entity":"company","image":{"available_sizes":[[[150,31],"assets/images/resized/0011/2922/112922v1-max-150x150.jpg"],[[232,48],"assets/images/resized/0011/2922/112922v1-max-250x250.jpg"],[[232,48],"assets/images/resized/0011/2922/112922v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}