{"first_name":"Carly","last_name":"Fiorina","permalink":"carly-fiorina","crunchbase_url":"http://www.crunchbase.com/person/carly-fiorina","homepage_url":"http://www.carlyfiorina.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Compaq","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"Carleton Firoina","created_at":"Wed Oct 14 21:47:00 UTC 2009","updated_at":"Fri Dec 10 19:16:32 UTC 2010","overview":"<p>A self-made woman, Carly Fiorina began her business career as a secretary and rose through the ranks of corporate America to become the first, and to date, the only woman to lead a Fortune 20 company. Serving as the Chairman and Chief Executive Officer of Hewlett-Packard Company (HP) from 1999 to 2005, she led the reinvention of the legendary company, successfully steering it through the dot-com bust and the worst technology recession in 25 years. During her tenure, HP’s revenues doubled, from $44 billion to $88 billion, with improved profitability in every product category.</p>\n\n<p>A proven leader, her pursuit of the controversial merger with Compaq Computer, now acknowledged to be the most successful merger in high-tech history, positioned HP to become the first $100 billion information technology company, creating leadership positions for the company in every product line.</p>\n\n<p>Carly has an uncommon record of success that spans more than 20 years at AT&amp;T and Lucent Technologies, where she led the largest-of-its-time IPO of Lucent and became President of its largest business.</p>\n\n<p>Today, Carly is one of the most recognized business leaders in the world and a global influencer of public opinion who Chairs the Board of the Technology Policy Institute, serves on the Board of Business Executives for National Security, is a Global Envoy for Lance Armstrong’s LIVESTRONG organization and serves as vice chair of the Initiative for Global Development. She is also a member of the Defense Business Board, and recently served on the Advisory Group for Transformational Diplomacy for the Department of State.</p>\n\n<p>An active member of America’s philanthropic community, Carly serves as the Chairman of the Fiorina Foundation, Chair of The One Woman Initiative—A Fund for Women’s Empowerment and is a founding partner with The African Leadership Academy. She is also a board member of Freedom House, Vital Voices, the National Symphony Orchestra and Ford‘s Theatre and serves as a trustee for MIT.</p>\n\n<p>Carly received her undergraduate degree from Stanford University, holds an MBA from the University of Maryland, and a Masters of Science in Business from the Massachusetts Institute of Technology</p>","image":{"available_sizes":[[[98,150],"assets/images/resized/0006/2728/62728v1-max-150x150.jpg"],[[164,250],"assets/images/resized/0006/2728/62728v1-max-250x250.jpg"],[[295,450],"assets/images/resized/0006/2728/62728v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.flickr.com/photos/techshownetwork/\" title=\"TechShowNetwork\" rel=\"nofollow\">TechShowNetwork</a></p>"},"degrees":[],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"Hewlett-Packard","permalink":"hewlett-packard","type_of_entity":"company","image":{"available_sizes":[[[145,150],"assets/images/resized/0001/4529/14529v5-max-150x150.jpg"],[[242,250],"assets/images/resized/0001/4529/14529v5-max-250x250.jpg"],[[291,300],"assets/images/resized/0001/4529/14529v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.honestly.com/profile?id=471425","title":"Honestly.com Reviews"}]}