{"first_name":"Carl","last_name":"Weinstein","permalink":"carl-weinstein","crunchbase_url":"http://www.crunchbase.com/person/carl-weinstein","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 06 21:29:16 UTC 2008","updated_at":"Thu Jun 19 05:22:34 UTC 2008","overview":"<p>Carl brings nearly 20 years of award winning marketing and product strategy to Cozi. After beginning his career with Emmis Communications in New York, Carl joined the fledgling Seattle Mariners Baseball Club in the early ‘90s. As the youngest director in Major League Baseball at the time, Carl’s marketing efforts helped to transform the Mariners into one of MLB’s most effective marketing models setting both team and league attendance records and winning a National Gold Effie. Carl returned to his media roots as Director of Programming, Operations and Marketing for New Century Media (now part of Clear Channel Communications) during which time the Seattle based radio group achieved its highest consolidated ratings and revenue in group history. In ‘99, Carl combined his media, sports and entertainment background with a love of technology to create a revolutionary new media model and founded Onecast Media, Inc. Under his direction, the company’s groundbreaking online service, Seasonticket.com, offered the first personalized on-demand sports highlight service for the broadband era. The service was recognized as a visionary business model for delivering highly personalized, rich media content, winning 3 New Media Envision Awards in ‘00. Most recently, as Chief Marketing Officer for Screenlife Games, Carl played a key role in helping to build the Scene It? DVD Game franchise into the #1 selling board game brand worldwide with distribution in 9 languages, over 20 countries and in more than 40k retail doors worldwide. Carl graduated from prestigious SI Newhouse School of Public Communications at Syracuse University, but claims his best accomplishment to date is his 9 year old son, Cole.</p>","image":{"available_sizes":[[[110,131],"assets/images/resized/0002/0677/20677v1-max-150x150.jpg"],[[110,131],"assets/images/resized/0002/0677/20677v1-max-250x250.jpg"],[[110,131],"assets/images/resized/0002/0677/20677v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.cozi.com/about/management.aspx\" title=\"Cozi\" rel=\"nofollow\">Cozi</a></p>"},"degrees":[],"relationships":[{"is_past":true,"title":"Chief Marketing Officer","firm":{"name":"Cozi","permalink":"cozi","type_of_entity":"company","image":{"available_sizes":[[[150,75],"assets/images/resized/0002/0057/20057v2-max-150x150.png"],[[250,125],"assets/images/resized/0002/0057/20057v2-max-250x250.png"],[[400,200],"assets/images/resized/0002/0057/20057v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}