{"first_name":"Carley","last_name":"Roney","permalink":"carley-roney-3","crunchbase_url":"http://www.crunchbase.com/person/carley-roney-3","homepage_url":"http://www.xogroupinc.com/the-knot-inc-company.aspx","birthplace":"","twitter_username":"carleyroney","blog_url":"http://blog.theknot.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Dec 04 17:08:32 UTC 2012","updated_at":"Wed Dec 05 08:05:30 UTC 2012","overview":"<p>Carley Roney is cofounder and editor in chief of XO Group Inc., formerly The Knot Inc., a global media and technology leader devoted to weddings, pregnancy and everything in between. </p>\n\n<p>Roney, her husband, and two partners founded XO Group Inc. in 1996 and quickly took the wedding world by storm with a fresh voice, stylish ideas and up-to-date advice. Today, The Knot Wedding Network is home to the #1 online wedding-planning resource, TheKnot.com (www.theknot.com), and the #1 registry site, WeddingChannel.com, which together reach nearly 2 million U.S. brides annually. Roney has been the driving force behind the brand’s expansion across multiple media platforms: from the web to magazines and books, television and video, social media and mobile applications. In 2010, she even proved the brand’s global reach by instrumenting the launch of Ijie.com (www.ijie.com), a lifestyle website in China.</p>\n\n<p>Inspired by thousands of loyal users, Roney has also created The Nest (www.thenest.com) and The Bump (www.thebump.com) brands for young couples and first-time parents—offering multimedia content, tools, and community platforms designed specifically for the unique needs of couples setting up homes and getting ready for baby. As today’s leading expert on real-world weddings and young married life, Roney has made frequent appearances on television shows such as TODAY, The Oprah Winfrey Show, ABC Nightline, Live! with Regis and Kelly, Access Hollywood and more. She is the author of more than a dozen popular wedding, newlywed and baby books, and her syndicated advice column &#8220;Ask Carley&#8221; appears in newspapers nationwide. In 2008, Roney was named one of Crain’s New York “40 Under 40” and is regularly recognized and consulted as a mentor for women in business and entrepreneurs.</p>\n\n<p>Prior to founding The Knot, Roney was the President of RunTime Inc., where she produced award-winning media products for The Smithsonian and Sotheby&#8217;s. Previous to RunTime, she was creative director and editor for clients such as the National Museum of American History, The McGraw-Hill Companies and Simon &amp; Schuster. Roney holds an MA in cultural studies from New York University and a BFA from New York University Tisch School of the Arts, Institute of Film and Television. She lives in Brooklyn with her husband and three children.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0022/3820/223820v2-max-150x150.jpg"],[[200,250],"assets/images/resized/0022/3820/223820v2-max-250x250.jpg"],[[360,450],"assets/images/resized/0022/3820/223820v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}