{"first_name":"Carl","last_name":"Edouard Pihl","permalink":"carl-edouard-pihl","crunchbase_url":"http://www.crunchbase.com/person/carl-edouard-pihl","homepage_url":"http://www.lostinlondon.net","birthplace":"New York","twitter_username":"pilou","blog_url":"http://www.ticketinghub.com","blog_feed_url":"http://www.drinkyz.com","affiliation_name":"Studentbox ","born_year":1983,"born_month":8,"born_day":18,"tag_list":"","alias_list":"","created_at":"Tue Mar 17 10:01:55 UTC 2009","updated_at":"Fri Oct 19 21:27:26 UTC 2012","overview":"<p>Carl is a Serial Entrepreneur who traveled the world. </p>\n\n<p>With a Greek-Swedish father and a French-Romanian mother, New York born Carl is fluent in three languages and can take his pick from three passports!</p>\n\n<p>International commerce came naturally to Carl as his mother was a successful business woman. They moved to France when he was 12, and he learnt to speak French and Italian. He would love to learn Greek and Spanish too.</p>\n\n<p>Carl’s always considered himself to be an entrepreneur and from a young age he collected baseball cards and comics, selling them on for a profit.</p>\n\n<p>Interested in music, Carl became DJ ‘Boom’ for kids’ parties. It was here he recognised his talent for events and became involved in PR for privately organised parties for the young elite of Paris. After one year, he was organizing these parties himself with a staff of 20. He finally had to drop the events company once it started taking over from his schoolwork.</p>\n\n<p>Whilst at King’s College in London, Carl co-founded the Entrepreneur Society and was selected to attend an International Enterprise boot camp which gave him the confidence to pursue his dream. His idea was to make an online community targeting more than two million people in the UK. One year later, Student Box was launched.</p>\n\n<p>Carl now has people running Student Box for him whilst he has moved on to his new project, Drinkyz, a promotional bottling company for major events.</p>\n\n<p>Carl thinks anyone can be an entrepreneur and that it’s more about the idea than the person. However, having drive, intelligence and a willingness to work hard is an advantage.</p>\n\n<p>Carl says his main strengths in business are that he’s calm and very sociable which enable him to find out what the client really wants. For him, business is about pleasing people; companies, customers and all those in between.</p>\n\n<p>Carl feels his weakness on the Last Millionaire could be that he’s too nice, as he likes to give people a second chance.</p>\n\n<p>Carl thinks his experience working as a holiday rep in Egypt will help him cope during his time abroad, and he’s confident he can hold his own with the other entrepreneurs.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0003/8693/38693v1-max-150x150.jpg"],[[166,250],"assets/images/resized/0003/8693/38693v1-max-250x250.jpg"],[[166,250],"assets/images/resized/0003/8693/38693v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"Engineering and Business Management","institution":"Kings College, London","graduated_year":2006,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder and CEO","firm":{"name":"Studentbox ","permalink":"studentbox","type_of_entity":"company","image":{"available_sizes":[[[150,33],"assets/images/resized/0003/8692/38692v1-max-150x150.jpg"],[[247,55],"assets/images/resized/0003/8692/38692v1-max-250x250.jpg"],[[247,55],"assets/images/resized/0003/8692/38692v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Founder","firm":{"name":"TicketingHub","permalink":"ticketinghub","type_of_entity":"company","image":{"available_sizes":[[[150,33],"assets/images/resized/0022/1451/221451v2-max-150x150.png"],[[250,55],"assets/images/resized/0022/1451/221451v2-max-250x250.png"],[[450,100],"assets/images/resized/0022/1451/221451v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}