{"first_name":"Carlos Manuel","last_name":"Garcia","permalink":"carlos-manuel-garcia","crunchbase_url":"http://www.crunchbase.com/person/carlos-manuel-garcia","homepage_url":"http://www.cytorex.com","birthplace":"Venezuela","twitter_username":"GarciaCarlosM","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1952,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Aug 09 20:58:00 UTC 2009","updated_at":"Tue Aug 11 17:15:12 UTC 2009","overview":"<p>Senior Operations Executive with over 25 years of experience in logistics, finance, marketing, transportation services, purchasing &amp; procurement, new business development, business planning, and corporate strategy.</p>\n\n<p>Cytorex Biosciences, Inc. (Weston, Florida) is developing novel pharmacologically active low pH acid formulations for cancer, the second-leading cause of death in the industrialized world. Cytoreg®, our patented lead drug candidate, is currently in preclinical testing for cancer, as well as in discovery and preclinical development for indications in diseases of immune origin. In 2007, worldwide sales of cancer therapies totaled USD $42.2 billion. Within the 7 major markets (US, Japan, France, Germany, Italy, Spain, and the United Kingdom), sales amounted to USD $34.3 billion. These sales are expected to grow at a compound annual growth rate (CAGR) of 12% between 2006 and 2011, almost 3 times faster than the pharmaceutical industry as a whole, reaching USD $55 billion by 2012. Cytorex intends to initially focus development efforts of Cytoreg® on cancer types with high levels of unmet need: Glioblastoma Multiforme (grade IV brain tumor); pancreatic cancer; and metastatic melanoma. Cytoreg® may also be developed for brain metastases. These four cancer types have low survival rates, are currently underserved with existing marketed therapies and have few pipeline products. Cytorex’s objective is to market new compounds based on our expertise in formulation of low acidic compositions for use in treatment of disease. </p>\n\n<p>The US patent office granted Cytorex Patent Number 7,141,251 in Nov. 28, 2006. The Title of the patent is: &#8220;Pharmacologically Active Strong Acid Solutions&#8221; . The technology is still patent pending in Europe.</p>\n\n<p>Phone No.954-573-4006\nFax No. 954-337-2249\nwebsite: http://www.cytorex.com\ne-mail: cytorex@gmail.com </p>\n\n<p>Specialties:\nImport/Export, Transportation, Logistics, Contract negotiation, Financial Services, Insurance, Business Plan Development, Corporate Operations.</p>","image":{"available_sizes":[[[115,150],"assets/images/resized/0005/5732/55732v2-max-150x150.png"],[[191,250],"assets/images/resized/0005/5732/55732v2-max-250x250.png"],[[345,450],"assets/images/resized/0005/5732/55732v2-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"B.S.","subject":"Industrial Enginering","institution":"Texas A&M University","graduated_year":1980,"graduated_month":null,"graduated_day":null},{"degree_type":"M.E.I.E","subject":"Industrial Enginering","institution":"Texas A&M University","graduated_year":1982,"graduated_month":null,"graduated_day":null},{"degree_type":"B.S.","subject":"Military Arts & Sciences","institution":"Academia Militar de Venezuela","graduated_year":1974,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}