{"first_name":"Carmine","last_name":"Gallo","permalink":"carmine-gallo","crunchbase_url":"http://www.crunchbase.com/person/carmine-gallo","homepage_url":"http://www.carminegallo.com/","birthplace":"","twitter_username":"carminegallo","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Wed Dec 14 22:52:21 UTC 2011","updated_at":"Wed Dec 14 23:19:14 UTC 2011","overview":"<p>Carmine Gallo is the communications coach for the world’s most admired brands. He transforms executives into extraordinary presenters—working directly with the companies that touch your life every day. A former anchor and correspondent for CNN and CBS, Gallo works directly with the world’s top business leaders to help them craft compelling messages, tell inspiring stories and share their innovative ideas with a global audience. Gallo has addressed executives at Intel, Cisco, Google, Medtronic, Disney, The Four Seasons, SAP, Pfizer, Linked In, Chevron, SanDisk, Univision, Edmunds.com, and many other global brands. Gallo is also a popular keynote speaker whose customized multimedia presentations are a hit with audiences around the world.</p>\n\n<p>Gallo writes leadership and communications columns for several media outlets including Forbes.com (My Communications Coach) Gallo has also written several bestselling and award-winning books including The Innovation Secrets of Steve Jobs which is the winner of an Axiom award for one of the top three best business books of 2011. The Presentation Secrets of Steve Jobs has become an international bestseller and has been translated into 14 languages. Gallo’s next book, The Power of Foursquare, reveals how innovative businesses around the world are leveraging new mobile marketing tools to attract new customers, engage current customers, and extend their brand story to an entirely new audience of consumers.</p>\n\n<p>Gallo has been featured in The Wall Street Journal, The New York Times, Success Magazine and on CNBC. Gallo has also been asked to give presentations to marketing and MBA students at Stanford, UCLA, and UC Berkeley. He graduated with honors from UCLA and has a Master’s Degree from the Medill School of Journalism at Northwestern. Gallo lives in Pleasanton, California, with his wife and two daughters.</p>\n\n<p>If you would like to book Carmine as a speaker for your next event, please contact Tom Neilssen at BrightSight Group, Carmine’s exclusive speaking agent.</p>\n\n<p>Carmine is passionate about helping others tell their stories.</p>","image":{"available_sizes":[[[150,115],"assets/images/resized/0016/6461/166461v1-max-150x150.jpg"],[[188,145],"assets/images/resized/0016/6461/166461v1-max-250x250.jpg"],[[188,145],"assets/images/resized/0016/6461/166461v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Masters","subject":"Journalism","institution":"Northwestern","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"<iframe width=\"560\" height=\"315\" src=\"http://www.youtube.com/embed/0el2LuwrtvE\" frameborder=\"0\" allowfullscreen></iframe>","description":"<p>Foursquare with Corcoran Group</p>"}],"external_links":[],"web_presences":[]}