{"first_name":"Carol","last_name":"Tran","permalink":"carol-tran","crunchbase_url":"http://www.crunchbase.com/person/carol-tran","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Chic Meets Geek","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Apr 20 10:24:50 UTC 2010","updated_at":"Thu Apr 22 02:08:17 UTC 2010","overview":"<p>Carol Tran was born and raised in San Diego and loves anything related to law, science, tech, and art.  She attended college at University of California, San Diego and obtained an education background in Theatre and Neuroscience.  In high school and college, she worked at the Salk Institute and was mentored by Francis Crick, the co-discoverer of the structure of the DNA molecule, and Joanne Chory, the well-respected and renowned plant geneticist.  She was about to head off to medical school, but was given an opportunity to work in Washington, D.C. under the guidance of both political administrations, former Attorney Generals Janet Reno and John Ashcroft.  After catching the legal bug, she moved to the Bay Area to pursue law school, but picked up the business degree along the way by participating in the dual Juris Doctorate and Masters of Business Administration program.  She has experience working in the legal sector at Elan Pharmaceuticals, Oracle Corp., Morgan Stanley, and Kyocera Wireless.</p>\n\n<p>Prior to attending graduate school, she spent a year acting in Hollywood and appeared in several shows and commercials.  In addition, she was trained professionally in competitive equestrian and marathon biking.</p>\n\n<p>She served on the board for Women in Science, WeekendApps OpenSocial, American Cancer Society, and March of Dimes.  Currently, she devotes her time as a Board of Director of the San Francisco Opera (Bravo).</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder & Chief Executive Director","firm":{"name":"Chic Meets Geek","permalink":"chic-meets-geek","type_of_entity":"company","image":{"available_sizes":[[[150,112],"assets/images/resized/0008/4276/84276v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0008/4276/84276v2-max-250x250.jpg"],[[267,200],"assets/images/resized/0008/4276/84276v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/caroltran","title":"@caroltran"}]}