{"first_name":"Carol","last_name":"O'Connor","permalink":"carol-oconnor","crunchbase_url":"http://www.crunchbase.com/person/carol-oconnor","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Mar 21 17:30:10 UTC 2008","updated_at":"Fri Mar 21 17:31:09 UTC 2008","overview":"<p>Carol joined Ariadne Capital in February 2006, and led and closed multiple transactions for Ariadne Capital since then. She manages the deal support team, and focuses on M&amp;A and Private Placements.</p>\n\n<p>She has more than 18 years of Investment Banking experience, with 13 years specializing in media and telecommunications industries and has raised over $500m in capital for both early stage development and acquisition financing. She was the Managing Director of Communications Equity Associates International Ltd., London from 1997 to 2002. Prior to that, Carol had been based in CEA&#8217;s Munich office since 1993 where she was responsible for the Eastern European business. She advised European and US clients on European transactions in the broadcasting, publishing, radio and cable television industries.</p>\n\n<p>Previously, Carol worked in the Frankfurt Corporate Finance Department of Schroeder Munchmeyer Hengst, a private German investment bank, advising UK companies on their German acquisitions. Prior to that, she worked in the Mergers and Acquisitions Department of Societe Generale, France&#8217;s largest private bank, also in Frankfurt. She specialized in divestitures of German companies to international buyers and in representing French groups on German acquisition projects.</p>\n\n<p>A British national, Carol holds a Bachelor of Arts in Languages from London University and a European MBA from the European School of Management. Carol speaks both French and German.</p>","image":{"available_sizes":[[[126,150],"assets/images/resized/0001/6161/16161v1-max-150x150.jpg"],[[185,220],"assets/images/resized/0001/6161/16161v1-max-250x250.jpg"],[[185,220],"assets/images/resized/0001/6161/16161v1-max-450x450.jpg"]],"attribution":"<p>http://www.ariadnecapital.com/</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}