{"first_name":"Carol","last_name":"Dekkers","permalink":"carol-dekkers","crunchbase_url":"http://www.crunchbase.com/person/carol-dekkers","homepage_url":"http://www.qualityplustech.com","birthplace":"Calgary","twitter_username":"caroldekkers","blog_url":"http://musingsaboutsoftwaredevelopment.wordpress.com","blog_feed_url":"","affiliation_name":"Quality Plus Technologies, Inc.","born_year":1959,"born_month":7,"born_day":25,"tag_list":"software-engineering, females-in-technology, function-points, metrics, process-improvement, scope-management, project-management, ict, cmc, pmp, pmi, apegga, cultural-diversity, ifpug, iso, carol-dekkers, engineering, icmci, communication, nsa, public-spe","alias_list":null,"created_at":"Fri Sep 03 17:39:22 UTC 2010","updated_at":"Fri Sep 03 21:56:45 UTC 2010","overview":"<p>Carol Dekkers is President of Quality Plus Technologies, Inc and works with corporate and government clients who want to maximize project success through project management and measurement best practices.  She has delivered keynote and other technology presentations in over 25 countries for international technology and quality conferences (including SAP&#8217;s Global Quality Day in both 2007 and 2008). She is the co-author of two textbooks (below) and dozens of published articles on software metrics, quality and communication for technical professionals. She has received numerous awards including being named by ASQ&#8217;s Quality Progress as one of the 21 New Faces of Quality for the 21st Century in 2000.</p>\n\n<p>Ms. Dekkers holds designations as a Project Management Professional (PMP), a Certified Management Consultant (CMC), Certified Function Point Specialist (CFPS), a Certified Scope Manager (CSM) and a Professional Engineer (P.Eng.-Canada).  She is well regarded as a project management expert and author with specialization in software metrics, project scope management, and IT globalization. She is a key member of the US delegation to ISO software engineering standards (since 1994) and is a project editor, reviewer and technical advisor.  In addition to consulting, she has worked as a visiting scientist with the Software Engineering Institute (SEI).  Carol is the co-author of two books:  The IT Measurement Compendium: Estimating and Benchmarking Success with Functional Size Measurement; and Program Management Toolkit for Software and Systems Development; and contributed to a number of other books and journals worldwide.</p>\n\n<p>Ms. Dekkers is available for keynote presentations and workshops, and works with companies worldwide who want to maximize their success with technology and project management.</p>","image":{"available_sizes":[[[126,150],"assets/images/resized/0010/0481/100481v2-max-150x150.jpg"],[[205,244],"assets/images/resized/0010/0481/100481v2-max-250x250.jpg"],[[205,244],"assets/images/resized/0010/0481/100481v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BSc","subject":"Mechanical Engineering","institution":"University of Calgary","graduated_year":1981,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President","firm":{"name":"Quality Plus Technologies","permalink":"quality-plus-technologies-inc","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.amsup.com/media/quality_progress.htm","title":"21 New Voices of Quality for the 21st Century"}],"web_presences":[{"external_url":"http://linkedin.com/caroldekkers","title":"Linked In"}]}