{"first_name":"Carole-Ann","last_name":"Matignon","permalink":"carole-ann-matignon","crunchbase_url":"http://www.crunchbase.com/person/carole-ann-matignon","homepage_url":"http://www.sparklinglogic.com","birthplace":"France","twitter_username":"CMatignon","blog_url":"htttp://blog.sparklinglogic.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Feb 17 04:07:59 UTC 2011","updated_at":"Fri Feb 18 00:28:59 UTC 2011","overview":"<p>Carole-Ann Matignon serves Sparkling Logic Inc. as President, Chief Executive Officer and Chairman of the Board.\n She is a renowned guru in the Decision Management space. She created the vision for Decision Management that is widely adopted now in the industry. Her claim to fame is managing the strategy and direction of Blaze Advisor, the leading BRMS product, while she also managed all the Decision Management tools at FICO (business rules, predictive analytics and optimization). She has a vision for Decision Management both as a technology and a discipline that can revolutionize the way corporations do business, and will never get tired of painting that vision for her audience. She speaks often at Industry conferences and has conducted university classes in France and Washington DC.\n She started her career building advanced systems using all kinds of technologies &#8211; expert systems, rules, optimization, dashboarding and cubes, web search, and beta version of database replication. At Cleversys (acquired by Kurt Salmon &amp; Associates), she also conducted strategic consulting gigs around change management.\n While playing with advanced software components, she found a passion for technology and joined ILOG (acquired by IBM). She developed a growing interest in Optimization as well as Business Rules. At ILOG, she coined the term BRMS while brainstorming with her Sales counterpart. She led the Presales organization for Telecom in the Americas up until 2000 when she joined Blaze Software (acquired by Brokat Technologies, HNC Software and finally FICO).\n Her 360-degree experience allowed her to gain appreciation for all aspects of a software company, giving her a unique perspective on the business. Her technical background kept her very much in touch with technology as she advanced.\n She also became addicted to Twitter in the process. She is active on all kinds of social media, always looking for new digital experience!\n Outside of work, Carole-Ann loves spending time with her two boys. They grow fruits in their Northern California home and cook all together in the French tradition.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0012/2479/122479v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0012/2479/122479v2-max-250x250.jpg"],[[450,450],"assets/images/resized/0012/2479/122479v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}