{"first_name":"Carol","last_name":"Sands","permalink":"carol-sands","crunchbase_url":"http://www.crunchbase.com/person/carol-sands","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 08 22:57:41 UTC 2009","updated_at":"Mon Jun 08 22:58:49 UTC 2009","overview":"<p>Carol Sands  is the Founder and the Managing Member of The Halo Funds.  She has spent the last 36 years with investing, entrepreneurial, and/or large corporate institutions.    </p>\n\n<p>Carol’s career started in the Midwest where she was a bank officer with First Bank Systems and held marketing or sales positions with Motorola and Xerox Computer Services.  After moving to San Francisco, she was hired into executive positions at Arthur Young (now Ernst &amp; Young) and Coopers &amp; Lybrand (now PricewaterhouseCoopers).  Then Carol founded Sands MarketingPlus, an international sales management and marketing consulting firm with advertising &amp; PR agencies.</p>\n\n<p>In 1997, she incorporated The Angels’ Forum Management Company; the parent company for a revolutionary company in angel investing that organizes individual investors with previous entrepreneurial experience to invest as a single entity using a venture capital model for due diligence, mentoring, and board management, called The Angels’ Forum. </p>\n\n<p>In 2000, Carol co‑founded Halo I, a $25 million venture fund invested in early‑stage, Silicon Valley based start‑ups, with Ed Esber, Phil Schlein, Craig Sirnio and Ed Berkowitz.  With the same core partners, Halo Fund II was launched in 2004.  An annex fund to Halo I, The Halo Opportunity Fund (January 2006) had Carol continuing as the Managing Member.  In 2007, Ed Esber and Carol Sands co‑founded The Halo Fund III Management Company with Phil Schlein, Craig Sirnio, Nagesh Mhatre and Geoff Tate.  </p>\n\n<p>In addition to her investment‑based responsibilities, Carol is the Chair of the Global Women’s Leadership Network, and a board advisor to Facing History and Ourselves.  She is a Charter Member of The Indus Entrepreneurs (TiE), an Advisory Board Member for Silicon Valley Association of Startup Entrepreneurs (SVASE) and the ANZA Technology Network, as well as a member of The Forum for Women Entrepreneurs &amp; Executives (FWE&amp;E) and the Women’s Forum West.   She is also a Director of the Sands Family Foundation which funds early stage and pre‑NIH research relating to prostate and ovarian cancers.  Carol received her B.A. in Business Administration from The University of Iowa.</p>","image":{"available_sizes":[[[106,150],"assets/images/resized/0004/7510/47510v1-max-150x150.jpg"],[[150,211],"assets/images/resized/0004/7510/47510v1-max-250x250.jpg"],[[150,211],"assets/images/resized/0004/7510/47510v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"The Halo Fund","permalink":"the-halo-fund","type_of_entity":"financial_org","image":{"available_sizes":[[[77,94],"assets/images/resized/0004/7506/47506v1-max-150x150.jpg"],[[77,94],"assets/images/resized/0004/7506/47506v1-max-250x250.jpg"],[[77,94],"assets/images/resized/0004/7506/47506v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}