{"first_name":"Carrie","last_name":"Chitsey","permalink":"carrie-chitsey","crunchbase_url":"http://www.crunchbase.com/person/carrie-chitsey","homepage_url":"http://www.3seventy.com","birthplace":"Austin","twitter_username":"3Seventy","blog_url":"http://blog.3seventy.com/blog-CEO/","blog_feed_url":"","affiliation_name":"3Seventy","born_year":1978,"born_month":2,"born_day":24,"tag_list":"3seventy, mobile, mobile-marketing, service-as-a-software, technology, texting","alias_list":null,"created_at":"Mon Nov 28 23:55:02 UTC 2011","updated_at":"Tue Dec 13 20:26:27 UTC 2011","overview":"<p>As a founding partner of 3Seventy and Blinx, Carrie has been a serial entrepreneur in many sales, marketing and technology ventures. Carrie brings the pragmatic experience of working for the Big 5 Consulting Firms and the vision of a forward thinking, &#8220;out of the box&#8221; entrepreneur. She is known by her peers as a mobile and social thought leader to many enterprise clients, partners and advertising agencies. As a regular speaker on mobile thought leadership and innovation, her opinions are highly respected and sought after. She continues to innovate new mobile technologies for brands such as HP, Office Depot, Sony, Pepsi, Frito-Lay, Energizer in the coupon, loyalty and consumer interaction place. Ms. Chitsey has received a Six Sigma Green Belt and is certified in multiple technologies such as Avaya, Siebel, Nortel and others. She serves on the board of several charity organizations in Texas.</p>\n\n<p>Prior to 3Seventy, Carrie co-founded Red Leaf ROI which was a marketing consulting and technology automation company. She consulted and build out sales and marketing processes and solutions for Fortune 100 companies in the US and Internationally. Carrie has enjoyed hands-on experiences and management responsibilities for every facet of call center operations. Carrie is recognized by her peers as a call center and Customer Relationship Management strategy innovator and thought leader. She has built over forty-five call centers from the ground up and redesigned, consolidated and created operational and sales efficiencies for hundreds nationwide. </p>\n\n<p>Prior to Red Leaf ROI, Carrie was the founder of Red Leaf Capital a 1200 person call center outsourcing company for leading brands sales and marketing efforts. She was an innovator in mortgage and business to business sales. She changed the way the wholesale mortgage business operated in the field and revamped the process to bring this into an inside sales environment. Her team was responsible for over $100 million/month in loan origination in the new process. </p>\n\n<p>Early in her career, Carrie spent 6 years at KPMG/BearingPoint in the financial services and hospitality practice as the point person in the Call Center and CRM Solutions practice globally. She was responsible for selling, structuring and managing a large number of complex projects and solutions for Fortune 100 companies that included clients such as Chase, Bank of America, Nasdaq, New Century Mortgage, Marriott, Harrah’s, E-Trade, Accredited, AT&amp;T, Nextel/Sprint, Hartford Insurance and many others. Carrie leads the drive for a new-generation.  In her few minutes of spare time, she is an avid Texas Hold&#8217;em poker player, loves to cook and her cocker spaniel is a legendary fixture at the 3Seventy offices. </p>","image":{"available_sizes":[[[150,77],"assets/images/resized/0016/4322/164322v2-max-150x150.jpg"],[[250,128],"assets/images/resized/0016/4322/164322v2-max-250x250.jpg"],[[450,232],"assets/images/resized/0016/4322/164322v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"CEO & Founder","firm":{"name":"3Seventy","permalink":"3seventy","type_of_entity":"company","image":null}},{"is_past":true,"title":"CEO & Founder","firm":{"name":"Blinx","permalink":"blinx","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.mobilecommercedaily.com/tag/carrie-chitsey","title":"How to engage the connected shopper"},{"external_url":"http://www.openpr.com/news/198697/Digital-Brand-Expressions-Partners-With-3Seventy.html","title":"Digital Brands Expressions partners with 3Seventy"},{"external_url":"http://www.fastcompany.com/1739892/ditch-your-business-card-for-these-apps","title":"Ditch Your Business Card for These Apps"},{"external_url":"http://www.women2.org/category/female-founders-to-watch/","title":"Female Founders to Watch"},{"external_url":"http://www.mobilemarketingwatch.com/3seventy-debuts-new-mobileminute-video-series-watch-it-weekly-here-on-mmw-19426/","title":"Mobile Minute Launches on Mobile Marketing Watch"}],"web_presences":[{"external_url":"http://blog.3seventy.com/blog-CEO/","title":"3Seventy CEO Blog"},{"external_url":"http://blog.3seventy.com/blog-mkt-ops/","title":"3Seventy Marketing Blog"},{"external_url":"https://twitter.com/#!/3Seventy","title":"3Seventy Twitter"},{"external_url":"https://twitter.com/#!/carriechitsey","title":"Carrie Chitsey Twitter"}]}