{"first_name":"Carsten","last_name":"Holler","permalink":"carsten-holler","crunchbase_url":"http://www.crunchbase.com/person/carsten-holler","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 28 20:32:18 UTC 2009","updated_at":"Wed Jan 28 20:32:17 UTC 2009","overview":"<p>German artist Carsten Höller was born 1961 in Brussels, Belgium and lives and works in Stockholm. He holds a doctorate in biology, and his artwork often involves viewer participation, to test theories concerning human perception and physiological reactions. The effects of his work on the viewer range from doubts, doublings and disorientation to euphoria and fun</p>\n\n<p>Höller&#8217;s most well known interactive installations are his slides, notably the monumental Test Site, Tate Modern in London (2006) and a slide he made for the offices of Prada in Milan (2000), which connects Miuccia Prada&#8217;s personal office to her car.</p>\n\n<p>Other solo exhibitions include Carrousel, Kunsthaus Bregenz (2008) and One, Some, Many/Deux, Plus, Tout, National Gallery of Canada (2007). He has also exhibited in Solomon R. Guggenheim Museum, New York, at 28th Bienal de Sao Paulo, Institute of Contemporary Arts, London.</p>\n\n<p>Carsten Höller opened his London based Double Club to the public in 2008 for a transient term of six months. Part installation, part venue, it consists of three spaces (restaurant, courtyard bar and discotheque) which are all divided into Western and Congolese portions. The respective areas have been designed to represent the most visually challenging from both cultures.</p>","image":{"available_sizes":[[[96,150],"assets/images/resized/0003/5093/35093v1-max-150x150.jpg"],[[160,250],"assets/images/resized/0003/5093/35093v1-max-250x250.jpg"],[[240,373],"assets/images/resized/0003/5093/35093v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}