{"first_name":"Caryl","last_name":"Bloom, Ph.D., MFT","permalink":"caryl-bloom-ph-d-mft","crunchbase_url":"http://www.crunchbase.com/person/caryl-bloom-ph-d-mft","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Ayax Systems","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Apr 28 14:49:45 UTC 2009","updated_at":"Fri May 08 18:11:58 UTC 2009","overview":"<p>Dr. Caryl Bloom received her Ph.D in Psychology in 1998 at the  California Graduate Institute, following a BA and MA in counseling psychology from Loyola Marymount University. She earlier had an advanced degree and career in medical technology. Academically, she has been a faculty member in the graduate psychology program at Argosy University, Mount St. Mary’s College, and the undergraduate program at West Los Angeles College. Dr. Bloom has an active and successful practice in Los Angeles California, where her specialties include personality assessment and therapy for Axis I disorders.  A skilled diagnostician with considerable experience in teaching and administering the Millon Inventories, she has a strong research and clinical background. Currently, Dr. Bloom is a Senior Consultant at the Institute for Advanced Studies in Personology and Psychopathology in the area of Medical Applications. She is also a co-editor of the upcoming book The Millon Inventories, 2nd Ed., with Dr. T. Millon.  Dr. Bloom is on the lecture circuit, presenting trainings and workshops on Millon theory, taxonomy, assessment, and intervention.</p>\n\n<p>Dr. Bloom has been working with Ayax Systems in the development of multiple proprietary psychological tests to help users match their personalities with their alternatives through the decision making process.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Lead Psychologist","firm":{"name":"Ayax Systems","permalink":"ayax-systems","type_of_entity":"company","image":{"available_sizes":[[[150,68],"assets/images/resized/0004/2787/42787v2-max-150x150.jpg"],[[250,114],"assets/images/resized/0004/2787/42787v2-max-250x250.jpg"],[[450,205],"assets/images/resized/0004/2787/42787v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}