{"first_name":"Cary","last_name":"Newfeldt","permalink":"cary-newfeldt","crunchbase_url":"http://www.crunchbase.com/person/cary-newfeldt","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Aequilibrium","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 05 23:05:28 UTC 2012","updated_at":"Tue Jun 12 13:16:00 UTC 2012","overview":"<p>With the technology industry insight and broad experience gained from a career stretching over 15 years, Cary is well positioned to lead the Mobile Services team at Aequilibrium.</p>\n\n<p>A graduate of the Vancouver Film School Multimedia Program, Cary has a strong inter-disciplinary background in developing user interface content for new media, and mobile strategy for the retail product vertical.</p>\n\n<p>Years of experience leading and managing development teams and researching mobile strategy for both the digital agency and product retail environments have given Cary a keen understanding of what is state-of-the-art in mobile trends and how to map thinking to a multitude of business cases.</p>\n\n<p>He has an acute grasp of the underlying systems that run both web and mobile devices, with specialties in operations and management of large diverse teams, interface technology comprehension and decimation, inter-disciplinary communications, agency proficiencies and mobile thinking/development for enterprise and various verticals.</p>\n\n<p>Cary’s portfolio is a testament to the exciting clients, communities and employers he has worked with, including Nike, Starbucks, Electronic Arts, BioWare, Singapore Sigraph Working Group, Heineken, Disney, Amway, Shu Uemura, Hitachi, CBC, and Lululemon.</p>\n\n<p>Prior to joining Aequilibrium, Cary played a number of key roles in the construction of a mobile thinking team in a world class digital agency. More recently, he has been busy conceptualizing how to narrowly focus mobile across a large retail organization with a single-minded goal from enterprise eCommerce to community driven mobile applications.</p>\n\n<p>Driven to create, Cary’s proudest accomplishments have been simply building media that generate intense customer satisfaction. When he’s not inside enjoying science fiction, hacking or learning new technologies, you might catch him shredding snow on a local mountain, hiking or spending time with his family.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Director, Mobile","firm":{"name":"Aequilibrium","permalink":"aequilibrium","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}