{"first_name":"Cary","last_name":"Buruch","permalink":"cary-buruch","crunchbase_url":"http://www.crunchbase.com/person/cary-buruch","homepage_url":"http://www.elite.com","birthplace":"San Jose","twitter_username":"caryburch","blog_url":"","blog_feed_url":"","affiliation_name":"Thomson Reuters Elite","born_year":null,"born_month":null,"born_day":null,"tag_list":"cary-burch, polo, elite, ceo, coo, gm","alias_list":null,"created_at":"Wed Feb 08 20:12:48 UTC 2012","updated_at":"Wed Feb 08 23:16:14 UTC 2012","overview":"<p>A prominent software executive and operator with more than two decades of executive experience,Cary Burch is Chief Operating Officer for Thomson Reuters, Elite (NYSE: TRI). Elite is part of Thomson Reuters the world’s leading source of intelligent information for businesses and professionals. Thomson Reuters employs more than 50,000 people in 93 countries. Thomson Reuters shares are listed on the New York Stock Exchange, Toronto Stock Exchange, London Stock Exchange and NASDAQ.Prior to TRI Elite Mr. Burch was the CEO of Lender Support Systems Inc., a San Diego-area software company that serves the financial services industry. LSSI was sold in 2010 to Constellation Software a Canadian based public software company.Mr. Burch sits on the board of directors/advisors for several internet based B2B and B2C companies. He also advises private equity and venture capital firms that are seeking to invest into established and start-up technology firms.  Cary Burch’s experience in the financial services industry is extensive, and his achievements considerable. Prior to leading LSSI,Cary Burch was EVP/GM of Technology Solutions for Fidelity National Information Solutions, a wholly owned subsidiary of Fidelity National Financial, where he was responsible for business development and P&amp;L for the solutions division. The division, which employed morethan 500 people, provided software products, eBusiness solutions, M&amp;A analysis and professional services to Fortune 500 companies.Prior to that, Cary Burch was an executive of The First American Corporation, serving as CIO of its Consumer Information Group and as President of First American CreditNet. He also served as a board member of the First American Corporate Technology Strategy Board.Cary Burch was SVP/CIO of Advanta Mortgage from 1993 to 1998, managingits Technology Service Bureau Group. From 1989 to 1993, Cary Burch was Vice President of Strategic Technologies and CIO for First Franklin Financial from 1989 to 1993. He was instrumental in guiding First Franklin through startup operations; it is now one of the nation’s leading mortgage lending companies.Before entering the financial services industry, Cary Burch held top technology management positions at Advanta Corporation, Lyon’s (a Sara Lee subsidiary) and Global Media, an international marketing firm.Honors and Core Strengths:Cary Burch is widely acknowledged as a skilled executive with formidable business development and relationship management talents, a view affirmed by the Financial Services Executive Forum, which named him one of the Top 20 IT Executives in the financial services industry for 2002-2003. The award recognizes creativity, commitment and effectiveness.Cary Burch stands on the strength of his reputation, his experience and his expertise. His top-level industry contacts are many, and he fosters an attitude of teamwork in the service of leadership and quantifiable results. Whether he is guiding a startup or optimizing an established company, Cary Burch has a reputation for his ability to bring about real results when it comes to creating profits and honing a company’s competitive advantage.Cary Burch has held been honored to hold several board advisory and director positions throughout the industry, bringing to the table a dynamic voice and keen business acumen. Cary Burch is recognized as an active industry advocate and accomplished presenter on technology advancement, with many industry and trade magazine publishing credits to his name.Education:Cary Burch earned an MBA from Pepperdine University and has completed international executive studies at Harvard Business School and Oxford University in the UK. Cary performed undergraduate studies at the University of California.Athletic Accomplishments:Cary Burch is an accomplished polo player and athlete. Cary holds a professional level handicap rating with the United States Polo Association and the Federation of International Polo. He is a two time United States National Polo Champion (2003 and 2007). He has played for the Ford Trucks Team, Tommy Bahama Polo Team, Lexus Polo Team and various other high brand Sponsors.</p>","image":{"available_sizes":[[[100,120],"assets/images/resized/0017/3494/173494v2-max-150x150.jpg"],[[100,120],"assets/images/resized/0017/3494/173494v2-max-250x250.jpg"],[[100,120],"assets/images/resized/0017/3494/173494v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"Management","institution":"Pepperdine","graduated_year":1996,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chief Operating Officer","firm":{"name":"Thomson Reuters Elite","permalink":"thomson-reuters-elite","type_of_entity":"company","image":null}},{"is_past":true,"title":"Chairman & CEO","firm":{"name":"LSSI","permalink":"lssi","type_of_entity":"financial_org","image":null}},{"is_past":true,"title":"President, SVP, CIO","firm":{"name":"The First American Corp","permalink":"the-first-american-corp","type_of_entity":"financial_org","image":null}},{"is_past":true,"title":"VP Strategic Technology","firm":{"name":"First Franklin Financial","permalink":"first-franklin-financial","type_of_entity":"financial_org","image":null}},{"is_past":true,"title":"Senior Vice President","firm":{"name":"Advanta","permalink":"advanta","type_of_entity":"financial_org","image":null}},{"is_past":true,"title":"COO/GM","firm":{"name":"FNIA","permalink":"fnia","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://lssi-lendersupportsystemsinc.blogspot.com/2009/03/new-consumer-for-2009-and-beyond.html","title":"New Consumer"},{"external_url":"http://lendersupport.blogspot.com/","title":"Blogger"},{"external_url":"http://www.poloplayersedition.com/test2/archives/art0108.php","title":"Polo Player Article"}],"web_presences":[{"external_url":"http://www.ziggs.com/apps/profile/bio.aspx?uid=50845","title":"Ziggs"},{"external_url":"http://www.linkedin.com/in/caryburch","title":"LinkedIn"},{"external_url":"http://www.naymz.com/caryburch1029121","title":"Naymz"},{"external_url":"http://peoplepond.com/caryburch","title":"People Pond"},{"external_url":"http://www.elite.com/executiveteam/","title":"Elite, Thomson Reuters"},{"external_url":"http://www.facebook.com/cary.burch","title":"Facebook"},{"external_url":"http://workface.com/e/caryburch","title":"Workface"},{"external_url":"http://caryburch.wetpaint.com/","title":"Wet Paint"},{"external_url":"http://www.plaxo.com/profile/showPublic/103081059278?src=badge&ppk=97011c7754f76679a3d0549d7e1db5a783ed5157","title":"Plaxo"},{"external_url":"http://www.ikarma.com/id/34206","title":"iKarma"},{"external_url":"http://commongate.com/CaryB/","title":"CommonGate"},{"external_url":"http://www.youtube.com/watch?v=6R4ff-38dxQ","title":"You Tube"},{"external_url":"http://questforstars.com/?page_id=2","title":"Quest For Stars"}]}