{"first_name":"casa","last_name":"swap","permalink":"casa-swap","crunchbase_url":"http://www.crunchbase.com/person/casa-swap","homepage_url":"http://www.casaswap.com/","birthplace":"","twitter_username":"","blog_url":"http://casastudentrooms.blogspot.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"sublet-housing, student-accommodation-world, rooms-for-students","alias_list":null,"created_at":"Sat Nov 26 11:37:01 UTC 2011","updated_at":"Sun Nov 27 02:49:25 UTC 2011","overview":"<p>CasaSwap specializes in providing accommodation to students all over the world. The company’s specialty lies in providing student housing to international students in a fast and convenient manner. CasaSwap provides its services to students, renters, home owners, property managers and swappers. The company facilities youngsters to get in touch with open minded people of similar interests and likings. To avail the multitude of benefits that CasaSwap offers, you need to register with the company.</p>\n\n<p>Signing up is absolutely free for all stake holders. Once you sign up on CasaSwap, you become a part of international housing service provider’s network whose services will be at your call and disposal. You can swap you present accommodation with someone else living in a different part of the globe, or you can sublet your apartment during summer breaks. The company takes care to safeguard your privacy and does not disclose your email ID or physical address to any third party without your explicit written permission. CasaSwap is your one stop destination for your all international student housing services. </p>\n\n<p>Visit: - http://www.casaswap.com/\nEmail: info@casaswap.com</p>","image":{"available_sizes":[[[150,48],"assets/images/resized/0016/4101/164101v2-max-150x150.jpg"],[[250,81],"assets/images/resized/0016/4101/164101v2-max-250x250.jpg"],[[348,113],"assets/images/resized/0016/4101/164101v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}