{"first_name":"Catharine","last_name":"Allado","permalink":"catharine-allado","crunchbase_url":"http://www.crunchbase.com/person/catharine-allado","homepage_url":"http://www.seniorcarehomes.com","birthplace":"","twitter_username":"seniorcarehomes","blog_url":"","blog_feed_url":"","affiliation_name":"SeniorCareHomes.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"senior-care, assisted-living, nursing-homes, senior-care-homes","alias_list":null,"created_at":"Sun Oct 17 23:41:49 UTC 2010","updated_at":"Thu Feb 02 06:07:35 UTC 2012","overview":"<p>Kate brings to SeniorCareHomes.com (Formerly La Dolce Living) www.seniorcarehomes.com experience in building start-up Companies and a background in customer service, health insurance, medical services, finance and billing. She started her career with Citibank providing banking and customer service. She then joined PeopleSupport and was instrumental in building the customer care center from ground up. She moved up quickly through the ranks where she was one of the heads of the Expedia, ProFlowers and other Major US accounts.</p>\n\n<p>When Kate moved to Los Angeles, she worked for WellPoint Insurance (Blue Cross). She again moved up quickly being offered to assist the head of customer care Insurance team. Kate decided it was time to move on and started her own company which helped other businesses with Medical Management and Billing Services. After much success, she decided to join SeniorCareHomes.com due to its mission knowing she could bring to the table her talent and passion for helping elders.</p>\n\n<p>Born in Metro Manila (Philippines), Kate attended Assumption College, an exclusive university well-known for educating many of the Philippines&#8217; presidents and top officials. Kate holds a Bachelor of Business Administration Degree in International Business.</p>\n\n<p>Growing up close with her family, Kate has always made family #1. Although she is across the world from her family, she always makes it to a point to talk to her grandparents and parents more than twice a week. Kate&#8217;s passion and dedication for her family is definitely reflected in helping other families find what they are looking for. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Operations Officer","firm":{"name":"SeniorCareHomes.com","permalink":"la-dolce-living","type_of_entity":"company","image":{"available_sizes":[[[130,150],"assets/images/resized/0009/9539/99539v2-max-150x150.jpg"],[[217,250],"assets/images/resized/0009/9539/99539v2-max-250x250.jpg"],[[391,450],"assets/images/resized/0009/9539/99539v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}