{"first_name":"Cesar","last_name":"S. Cesar","permalink":"cesar-s-cesar","crunchbase_url":"http://www.crunchbase.com/person/cesar-s-cesar","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Hands","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 02 12:35:01 UTC 2009","updated_at":"Mon Sep 21 21:20:57 UTC 2009","overview":"<p>Cesar S. Cesar is an Internet and Mobile Entrepreneur. In 20 years of professional experience, he worked on projects for organizations in internet, mobile internet, wireless carriers, advertising, e-business and technology industries. Graduated in Engineering, Cesar also got specialization at Austin Software Foundry.</p>\n\n<p>Cesar was involved in implementation of the first internet service provider in Brazil Alternex. Since then, he has always worked with a solid technology base. Cesar was founder and CEO at Nexxa Technologies (e-business consulting firm for top-500 Brazilian corporations), project leader at Atos Origin and internet systems architect at Coppe/UFRJ, one of the most important researches centers in Brazil.</p>\n\n<p>Cesar is currently involved with trend-spotting, strategic planning and alliances, market research and development of new products and services at Hands. As a director of a pioneer mobile marketing company in Latin America and leader of Brazilian market, Cesar integrates the ability and experience to analyze the trends of mobile advertising, e-business, sales and business development.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0004/7696/47696v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0004/7696/47696v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0004/7696/47696v2-max-450x450.jpg"]],"attribution":"<p>Cesar S. Cesar, Strategy &amp; Marketing Director - Hands</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}