{"first_name":"Cesar","last_name":"DOnofrio","permalink":"cesar-donofrio","crunchbase_url":"http://www.crunchbase.com/person/cesar-donofrio","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Common Sense","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jun 16 17:22:54 UTC 2008","updated_at":"Tue Dec 21 22:35:23 UTC 2010","overview":"<p>Cesar is a Web technology expert and an entrepreneur who is passionate about making the user experience simple, friendly and easy to use for all users, from users who have custom needs and use Common Sense applications to customers on a Web site for transaction purposes&#8230;and business owners who want a good experience in simplifying day-to-day business processes. </p>\n\n<p>With 10 years of technology experience, Cesar is focused on the strategic use of software applications to build powerful, long-lasting relationships between companies and their customers with the Internet serving as a pipeline for two-way communication. </p>\n\n<p>For Souper Salad, the nation largest all-you-care-to-eat soup and salad bar restaurant chain, Cesar and his team built a powerful, relationship-building e-mail marketing program that alerts over 100,000 salad-and-soup-lovers about specials and promotions. The e-mail marketing program called, [Doppler] (http://www.fromdoppler.com), is a Common Sense product that sends e-blasts and also tracks who opts into the e-mails, the time and date the e-mails were opened, who responded to the e-mails, and where the viewer clicked on the message. </p>\n\n<p>A results-oriented, highly accurate e-mail marketing tool, [Doppler] (http://www.fromdoppler.com) is used to test different promotions so a company can strategically choose the most effective promotion to blast to all customers who opt-in for coupons and information about specials. On the cutting edge, [Doppler] (http://www.fromdoppler.com) is the only e-mail marketing program today that can feature highly appealing &#8220;flash-like&#8221; changing images in e-messages. </p>\n\n<p>Cesar is also highly experienced in custom software development.  For The Scooter Store, America&#8217;s number one provider of power chairs and mobility scooters, Cesar and his team of programmers created custom software for several departments including sales, billings and collections. For DELL, Cesar and his team built custom software that allows this computer giant to send e-mails in 32 languages to hundreds of regions around the world.  </p>\n\n<p>For Advantage-Rent-A-Car, Cesar led the effort on custom software development so travel company partners like Travelocity, Expedia, and Orbitz can connect their systems to retrieve information about car availability and rates.  Other clients Cesar has served include Microsoft, Frost Bank, Rush Enterprise, Clarke American and HEB. </p>\n\n<p>Cesar is an accomplished business analyst in development and implementation of software applications using Microsoft .NET. He is highly skilled in User Interface and User Experience.  He has strong marketing and programming experience in Internet/intranet and solid knowledge of database design, development, implementation and reporting (data warehousing). He is trained in project administration and software components. He is skilled in analyzing, developing and implementing software applications for Financial and Management Information Systems, Hospital HealthCare Systems, Student Information Systems, and Sales Purchase Systems. </p>\n\n<p>Cesar graduated as an engineer in Information Systems from the University of Buenos Aires in Argentina. He is often called upon by organizations, such as the American Marketing Association and networking organizations, to give presentations on e-mail marketing best practices. He and his family have resided in San Antonio, Texas since 2002.  </p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0011/4944/114944v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0011/4944/114944v2-max-250x250.jpg"],[[450,450],"assets/images/resized/0011/4944/114944v2-max-450x450.jpg"]],"attribution":"<p>CesarDOnofrio</p>"},"degrees":[{"degree_type":"Engineer ","subject":"Information Systems","institution":"University of Buenos Aires","graduated_year":1999,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Making Sense","permalink":"making-sense","type_of_entity":"company","image":{"available_sizes":[[[150,108],"assets/images/resized/0002/1196/21196v5-max-150x150.png"],[[235,170],"assets/images/resized/0002/1196/21196v5-max-250x250.png"],[[235,170],"assets/images/resized/0002/1196/21196v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.getcs.com","title":"Common Sense"},{"external_url":"http://www.fromdoppler.com","title":"Doppler Email Marketing"}]}