{"first_name":"Chad","last_name":"Kugler","permalink":"chad-kugler","crunchbase_url":"http://www.crunchbase.com/person/chad-kugler","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Mar 25 10:54:45 UTC 2011","updated_at":"Fri Mar 25 10:58:44 UTC 2011","overview":"<p>Chad  Kugler co-founded the predecessor of BridgePoint Medical (the incubator Prospex Medical) in March 2005 where he served as Vice President. In January of 2007, Prospex spun out two medical device companies, BridgePoint Medical in cardiology and Apnex in obstructive sleep apnea. At the time of spin out, Chad assumed the principal role at BridgePoint Medical serving as its President and General Manager.</p>\n\n<p>Chad brings to the company twelve years of medical device start-up experience and sixteen years of medical industry experience as an entrepreneur, inventor, engineer and an executive manager for both acutely used and implantable products. Prior to Prospex, Chad held a management position at Torax Medical where he was the primary inventor of their technology for acid reflux disease. Chad also worked for over five years as the Director of Research and Development at Teramed (aortic endovascular graft company acquired by Cordis 2001) where he was the primary inventor of the technology, directed a multidisciplinary development team through the rigors of product design, product development, clinical trials, and European commercialization. He has extensive domain knowledge in interventional cardiology starting his career as an engineer with SCIMED/Boston Scientific. Chad has 18 patents granted and numerous pending.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President and General Manager","firm":{"name":"BridgePoint Medical","permalink":"bridgepoint-medical","type_of_entity":"company","image":{"available_sizes":[[[150,72],"assets/images/resized/0008/0345/80345v1-max-150x150.jpg"],[[216,104],"assets/images/resized/0008/0345/80345v1-max-250x250.jpg"],[[216,104],"assets/images/resized/0008/0345/80345v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}