{"first_name":"CHAD IAN","last_name":"LIEBERMAN","permalink":"chad-ian-lieberman","crunchbase_url":"http://www.crunchbase.com/person/chad-ian-lieberman","homepage_url":"http://www.6wseo.com","birthplace":"New York City","twitter_username":"6wseo","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1970,"born_month":1,"born_day":5,"tag_list":"chad-ian-lieberman, seo-expert, seo-company, 6wseo","alias_list":null,"created_at":"Tue Nov 27 08:19:22 UTC 2012","updated_at":"Wed Dec 05 07:54:08 UTC 2012","overview":"<p>Chad Ian Lieberman has built his expertise as a knowledgeable and experienced Search Engine Optimization strategist, consultant and In-House SEO in combination with his skills as a Web Developer for more than a decade.</p>\n\n<p>Currently, Chad Ian Lieberman concentrates his resourcefulness and skills on the diversified aspects of Search Engine Optimization for independent clients, where he&#8217;s earned the distinction of consistent top rankings in all major search engines. He is consistently involved in technologies that maximize usability and accessibility when optimizing/developing large web sites as well as identifying problems and solutions that result in major cost saving strategies.</p>\n\n<p>Known for improving upon and augmenting the operating performance in a multitude of web based environments, Chad Ian-Lieberman has been responsible for developing SEO-friendly ecommerce applications, tracking/ analysis systems related directly to Search Engine Placement and web traffic trends. His commitment and dedication derive from his strong desire to improve upon and simplify technologically advanced systems that result in an increase of convergence in his projects.</p>\n\n<p>Highly successful and respected within the Search Engine Optimization communities, Scott participates in numerous industry forums and has consulted &amp; been employed by successful internet companies including: Baseball.com, Edmunds.com, Verizon Wireless, Toyota.com, Tgllaw.com, 1800Flowers.com, Search &amp; Social Media, Sports Illustrated and PGA/PGA Tour to name a few. http://www.6wseo.com</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0022/2478/222478v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0022/2478/222478v2-max-250x250.jpg"],[[299,299],"assets/images/resized/0022/2478/222478v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}