{"first_name":"Chad","last_name":"Conway","permalink":"chad-conway","crunchbase_url":"http://www.crunchbase.com/person/chad-conway","homepage_url":"http://chadconway.com","birthplace":"Boston","twitter_username":"chadwickconway","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1989,"born_month":null,"born_day":null,"tag_list":"chadwick, commutacar, conway, crowninshield, car, comuta, comuta-car, creek, duxbury, eagle, electric, island, lab, ma, massachusetts, media, mit, rose-hulman, scout, 1980","alias_list":null,"created_at":"Wed Apr 04 03:46:42 UTC 2012","updated_at":"Wed Apr 11 03:57:35 UTC 2012","overview":"<p>Electric Vehicle Systems Engineer</p>\n\n<p>Chad Conway is a senior-engineering student at Rose-Hulman Institute of Technology.  Chad’s real passion is electric cars.  Starting in his sophomore year in high school he began working on electric car projects.  By his junior year he had completely rebuilt a 1980 electric Comuta-Car that he drives as his primary means of transportation to this day.  This practical experience leads him to believe that electric drive is the most efficient and practical alternative to internal combustion engines.  Chad is keeping well informed of developments in battery technology and dreams of a day when super capacitors will replace chemical energy storage.  Chad’s career goal is to work with an automotive design team, engineering the world’s best electric vehicles.<br/>\n     Chad has over six years of experience in the Hybrid and Electric Vehicle Industry including summer internships at Tesla Motors and the MIT Media Lab. During his first stint at Tesla, he took ideas through the engineering design process and finished with production parts that were key components in a Tesla battery pack. Additionally, he managed and organized the prototype battery pack builds. During his second stint at Tesla, he was located in Wymondham, United Kingdom where he traveled throughout Europe investigating and performing failure analysis on battery packs. At MIT, he was fortunate to assist the Smart Cities Group designing the City Car. He is honored at having achieved the rank of Eagle Scout and proud of the memorable project that resulted from this effort. He looks forward to making the world a better place through engineering the electric cars of today and of the furture.</p>\n\n<p>Chad can be reached via email at:chadconway@gmail.com</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0018/2524/182524v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0018/2524/182524v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0018/2524/182524v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelors of Science","subject":"Mechanical Engineering","institution":"Rose-Hulman Institute of Technology","graduated_year":2012,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/chadconway","title":"LinkedIn"},{"external_url":"https://twitter.com/chadwickconway","title":"Twitter"},{"external_url":"http://www.facebook.com/chadconway","title":"Facebook"},{"external_url":"http://www.facebook.com/chadconway","title":"Flickr"},{"external_url":"http://chadconway.com","title":"Website"}]}