{"first_name":"Chad","last_name":"Mureta","permalink":"chad-mureta","crunchbase_url":"http://www.crunchbase.com/person/chad-mureta","homepage_url":"http://chadmureta.com","birthplace":"","twitter_username":"chadmureta","blog_url":"http://chadmureta.com/blog/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Mon Mar 19 18:40:07 UTC 2012","updated_at":"Mon Mar 19 18:40:07 UTC 2012","overview":"<p>Over the past decade, Chad Mureta’s professional and personal lives have impacted each other in profound and unexpected ways. In 2009, a devastating car accident confined him to a hospital bed, where Mureta discovered the possibilities of the emerging app market while experimenting with his iPhone. During that time, Chad realized that his real estate business was not only consuming his life, it was also in no way connected to what he was passionate about.</p>\n\n<p>Without any tech experience, he developed an idea for a mobile application called “Fingerprint Security Pro,” that would go on to be a best-seller in the App Store and serve as the catalyst for a new company, career, and way of life. Chad realized that through mobile apps, he could create a system that worked while he didn’t. Now almost three years later, he has spearheaded the development and marketing of 46 apps, which have been downloaded over 35 million times worldwide.</p>\n\n<p>While Chad loves the exciting nature of the app business, it’s his true passion for living a life free from the 9-to-5 grind that propels him as an appreneur. By letting technology work for him, Chad has been living his bucket list: traveling the world, learning salsa, becoming a certified scuba diver and skydiver, and his list continues to grow every year. Chad uses the app business as a means to work less and truly “have a life.”</p>\n\n<p>As an author, speaker, consultant, and entrepreneur, Mureta’s unique insight, experience, and tenacity have enabled him to make his businesses thrive, all while living the life of his dreams and traveling the world. Mureta shares his experiences and expertise in his first book, App Empire: Make Money, Have a Life, and Let Technology Work for You (March 2012, Wiley Publishing).</p>","image":{"available_sizes":[[[150,146],"assets/images/resized/0018/0040/180040v1-max-150x150.jpg"],[[197,192],"assets/images/resized/0018/0040/180040v1-max-250x250.jpg"],[[197,192],"assets/images/resized/0018/0040/180040v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}