{"first_name":"Charles","last_name":"F. Kireker","permalink":"charles-f-kireker","crunchbase_url":"http://www.crunchbase.com/person/charles-f-kireker","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 08 13:14:01 UTC 2009","updated_at":"Mon Jun 08 13:19:49 UTC 2009","overview":"<p>Kireker is a co-founder of and senior advisor to FreshTracks Capital, L.P., which manages $25 million in Limited Partner capital. Before launching FreshTracks in 2000, Charlie co-founded in 1993 Green Mountain Capital, L.P., a mezzanine Small Business Investment Company that invested in some 30 companies in northern New England. Kireker also co-founded North Country Angels in 1999. He is an experienced Board member and consultant to emerging growth companies in Vermont, which have included VEMAS, Eating Well, Vermont Teddy Bear Company and Autumn Harp.</p>\n\n<p>Active with numerous Boards, Charlie currently serves as a Director of the Vermont Technology Council, The Lake Champlain Regional Chamber of Commerce and sits on the board of BlueCross BlueShield of Vermont. Kireker worked closely with the Orton Family Foundation since its inception, and was a founding Board member of the VT Forum on Sprawl. He is also a member of the Governor’s Council of Environmental Advisors.</p>\n\n<p>Charlie formerly chaired the Board of the Vermont Land Trust, and more recently co-chaired their successful $25 million capital campaign. During the early 80&#8217;s, Kireker was CEO of the Massachusetts Industrial Finance Agency. Kireker graduated from Princeton University (1972) and Harvard University (MPP, 1981).</p>","image":{"available_sizes":[[[103,150],"assets/images/resized/0004/7365/47365v1-max-150x150.jpg"],[[171,250],"assets/images/resized/0004/7365/47365v1-max-250x250.jpg"],[[220,320],"assets/images/resized/0004/7365/47365v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}