{"first_name":"Charles","last_name":"Moore","permalink":"charles-moore","crunchbase_url":"http://www.crunchbase.com/person/charles-moore","homepage_url":"http://www.rocketlawyer.com","birthplace":"","twitter_username":"charleymooreesq","blog_url":"http://www.article-3.com","blog_feed_url":"","affiliation_name":"Rocket Lawyer","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Feb 29 21:27:22 UTC 2008","updated_at":"Sat Jun 02 02:13:21 UTC 2012","overview":"<p>Charley is the Founder and Executive Chairman of Rocket Lawyer Incorporated, a long-time entrepreneur and a legal commentator. </p>\n\n<p>His experience as a lawyer working with consumer services, start-up businesses, and small law firms taught him that something was missing –an easy and affordable way for everyone to understand and manage their legal needs. That’s why he started Rocket Lawyer.</p>\n\n<p>Charley has been at the forefront of Internet corporate development since beginning his career as an attorney at Venture Law Group in Menlo Park, California in 1996. While practicing at Venture Law Group, he participated in the early-stage representation of Yahoo! (IPO), WebTV Networks (acquired by Microsoft) and Cerent Corporation (acquired by Cisco Systems) and was the founder of Onstation Corporation (acquired by The Cobalt Group).</p>\n\n<p>Charley graduated from the University of California at Berkeley (Juris Doctorate), San Francisco State University (MS) and the United States Naval Academy (BS). He served as a U.S. Naval officer and is a Gulf War veteran. He currently serves on the board of directors of the Northern California Public Broadcasting Corporation (KQED) and the UC Berkeley School of Law, among other organizations.</p>\n\n<p>Having appeared on MSNBC, CNBC, Fox, and in Forbes, the WSJ, the Chicago Tribune, the California Lawyer, The Times and The Guardian among other, the issues Charley can comment on include patent law and the importance of intellectual property, Internet piracy, cloud computing, small business legal issues and IPOs. </p>","image":{"available_sizes":[[[150,111],"assets/images/resized/0019/3359/193359v2-max-150x150.jpg"],[[250,186],"assets/images/resized/0019/3359/193359v2-max-250x250.jpg"],[[291,217],"assets/images/resized/0019/3359/193359v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder and Executive Chairman","firm":{"name":"Rocket Lawyer","permalink":"rocketlawyer","type_of_entity":"company","image":{"available_sizes":[[[150,36],"assets/images/resized/0001/4094/14094v10-max-150x150.png"],[[250,60],"assets/images/resized/0001/4094/14094v10-max-250x250.png"],[[250,60],"assets/images/resized/0001/4094/14094v10-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.rocketlawyer.com","title":"Rocket Lawyer"},{"external_url":"http://www.article-3.com","title":"Article 3"}]}