{"first_name":"Charlie","last_name":"Mahoney","permalink":"charlie-mahoney","crunchbase_url":"http://www.crunchbase.com/person/charlie-mahoney","homepage_url":"http://www.charliemahoney.net","birthplace":"","twitter_username":"chasmahoney","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"photographer, photojournalist, multimedia-production","alias_list":null,"created_at":"Tue Sep 14 09:50:24 UTC 2010","updated_at":"Thu Sep 23 03:03:50 UTC 2010","overview":"<p>Charlie is an acclaimed freelance photojournalist, multimedia producer and educator who is dedicated to documenting stories of social significance. Over the last few years he has worked on issues ranging from the plight of African immigrants entering Europe to the troubling issues of climate change and political unrest in the Maldives. While his projects have taken him all over the world, he is currently focused on contemporary issues in the Southern Europe. A sensitive eye to color and complex imagery are signatures of his work.\nCharlie brings a diverse background to the field of photography and journalism. He has a B.A. in International Relations and Biology from Bowdoin College. Prior to his career in photography, he worked 10 years in finance in San Francisco, California.\nSince receiving a Masters in Photojournalism from the University Autónoma of Barcelona, Charlie has received recognition in numerous international awards, including the International Photography Awards, the Environmental Photographer of the Year Awards, the Travel Photographer of the Year awards and the PX3 Prix de la Photographie.\nHe is a founding member of Prime Photo Collective and is a contributing photographer to Corbis and Agence Cosmos in France. He lives with his wife in Barcelona, Spain, where he attempts to perfect his Catalonian culinary creations. He is fluent in Spanish and English.</p>","image":null,"degrees":[{"degree_type":"Bachelor of Arts","subject":"International Relations, Biology","institution":"Bowdoin College","graduated_year":1990,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.facebook.com/charliemahoney.net","title":"Facebook"},{"external_url":"http://twitter.com/chasmahoney","title":"Twitter"}]}