{"first_name":"Charlie","last_name":"Jackson","permalink":"charlie-jackson","crunchbase_url":"http://www.crunchbase.com/person/charlie-jackson","homepage_url":"http://en.wikipedia.org/wiki/Charlie_Jackson_%28software%29","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Casmiro","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jul 08 00:29:08 UTC 2010","updated_at":"Mon Jul 12 23:00:22 UTC 2010","overview":"<p>Jackson founded Silicon Beach Software in 1984. The company developed and published Macintosh software. It was best known for its graphics editors SuperPaint, Digital Darkroom and SuperCard. Silicon Beach was acquired by Aldus Corporation in 1990. That year he was named Entrepreneur of the Year in San Diego for High Tech.[1]</p>\n\n<p>In 1984, Jackson also founded the San Diego Macintosh User Group.</p>\n\n<p>Jackson co-founded FutureWave Software with Jonathan Gay in 1993. FutureWave developed and published FutureSplash Animator. Macromedia acquired FutureWave in 1996 and renamed the product Flash 1.0, which in turn became Adobe Flash when Macromedia was acquired by Adobe Systems.\n[edit] Investments</p>\n\n<p>Jackson made some notable investments in the 1990s. In 1993, he and Nicholas Negroponte were the two seed investors in Wired magazine.[2] In 1994, Jackson loaned Wired Ventures the money that allowed the company to start up HotWired, the first commercial web magazine.</p>\n\n<p>Jackson was the seed investor in Outpost.com, an early online reseller of computer equipment. Outpost.com gained some notoriety for its TV ads in which gerbils were shot out of a cannon and wolves attacked a high school marching band.</p>\n\n<p>Jackson was the first investor in Angelic Entertainment, a movie production company. He was an executive producer of Angelic&#8217;s first two movies, The Month of August and Hole in One.</p>\n\n<p>Jackson was the first investor in Streamload, an online media storage and retrieval company that was subsequently renamed Nirvanix and he was the first investor in Pacific Coast Software, publisher of WebCatalog, an e-commerce package.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Seed","firm":{"name":"Wired Magazine","permalink":"wired-magazine","type_of_entity":"company","image":{"available_sizes":[[[150,29],"assets/images/resized/0002/2955/22955v1-max-150x150.png"],[[250,49],"assets/images/resized/0002/2955/22955v1-max-250x250.png"],[[388,77],"assets/images/resized/0002/2955/22955v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"","firm":{"name":"Streamload","permalink":"streamload","type_of_entity":"company","image":null}},{"is_past":false,"title":"Seed","firm":{"name":"Outpost.com","permalink":"outpost-com","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}