{"first_name":"Charles","last_name":"Dusseau","permalink":"charles-dusseau","crunchbase_url":"http://www.crunchbase.com/person/charles-dusseau","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Addashop","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Feb 07 20:20:10 UTC 2010","updated_at":"Mon Feb 08 22:00:40 UTC 2010","overview":"<p>Charles Dusseau has spent his career moving between public and private, domestic and international sectors, sometimes situated at the confluence of all of them. After completing degrees in international finance at the University of Colorado and international political economy at Georgetown University, he spent nine years as an international banker for Chase Manhattan, working and living throughout Latin America and the Caribbean. While in Buenos Aires, he chronicled political and economic events as a columnist for the Buenos Aires Herald. When transferred to Miami, he served as Chase’s country manager for Central America and as a member of the debt renegotiation committees for Costa Rica, Honduras, and Nicaragua.</p>\n\n<p>Dusseau soon was elected a commissioner of Miami-Dade County and was subsequently appointed as Florida’s secretary of commerce, where he oversaw development and passage of several job-creation incentive programs, managed a network of seven overseas offices, and was responsible for the state’s tourism development efforts. His primary goal, however, was to eliminate his own job, which was accomplished by privatizing the Department of Commerce.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Board of Directors","firm":{"name":"Addashop","permalink":"addashop","type_of_entity":"company","image":{"available_sizes":[[[150,77],"assets/images/resized/0013/4453/134453v2-max-150x150.jpg"],[[250,129],"assets/images/resized/0013/4453/134453v2-max-250x250.jpg"],[[323,167],"assets/images/resized/0013/4453/134453v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}