{"first_name":"Charlie","last_name":"Ardagh","permalink":"charlie-ardagh","crunchbase_url":"http://www.crunchbase.com/person/charlie-ardagh","homepage_url":"http://www.clipsure.com","birthplace":"Dublin, Ireland","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1976,"born_month":12,"born_day":29,"tag_list":"","alias_list":null,"created_at":"Thu Oct 21 11:46:56 UTC 2010","updated_at":"Tue Oct 16 05:08:17 UTC 2012","overview":"<p>Charlie Ardagh is an established entrepreneur having spent the last 14 years starting, building and developing businesses in the telecoms, media and Internet sector.</p>\n\n<p>Charlie&#8217;s most recent ventures are trackalyse.com, an insights platform for competitive activity tracking on Facebook that benchmarks pages against each other. The service has over 1000 customers across 50 countries. Propelad.com is a yet to launch Facebook ads platform that helps small and medium sizes businesses to maximise the potential of their content from Facebook ads. </p>\n\n<p>Companies which Charlie has been a co-founder of include Formus Communications, Leap Broadband, EAP Consulting, as well as playing a leading role in the establishment of Magnet Networks. These companies have rolled out leading edge wired and wireless telecoms networks in Europe, using technologies such as LMDS, WLL, WiMax, xDSL, and fibre. Always being first to market with services to customers such as broadband Internet access, data services, VoIP, IPTV.  </p>\n\n<p>Charlie has a long track record in sales and marketing in particular, with a successful track record in delivering revenues, building sales teams and commercial partnerships, developing above and below the line as well as online and social media campaigns as well as leading the development of innovative products and services. </p>\n\n<p>An experienced negotiator Charlie has lead negotiations for the sale and refinancing of businesses with trade buyers, investors and financial institutions. </p>\n\n<p>Charlie was a board member of Ireland&#8217;s national pediatric hospital (Our Lady&#8217;s Hospital for Sick Children, Crumlin) for 7 years as well as a director of other not for profit organisations. </p>","image":null,"degrees":[{"degree_type":"BA, Psychology & MArketing ","subject":"","institution":"University of Bedfordshire","graduated_year":1998,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://ie.linkedin.com/pub/charlie-ardagh/4/11/760","title":""}]}