{"first_name":"Charles","last_name":"Chi","permalink":"charles-chi","crunchbase_url":"http://www.crunchbase.com/person/charles-chi","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Sanera","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 07 21:12:46 UTC 2009","updated_at":"Fri Apr 22 01:30:53 UTC 2011","overview":"<p>Charles joined Greylock in 2000. His area of focus is systems, semi-conductors and related software for communications, computing and storage for the enterprise, service provider and consumer markets.</p>\n\n<p>Prior to Greylock Charles held executive positions in the communications sector that spanned both service providers and equipment suppliers. He joined Greylock from CIENA Corporation where he was vice president of marketing. Previously Charles had co-founded and led marketing at Lightera Networks, Inc., a market defining optical core switching company acquired by CIENA. Before Lightera he held marketing, sales engineering and engineering roles at Cisco, StrataCom, AT&amp;T Canada and Bell Canada. During his tenure he developed and launched a number of new products and services based on new technologies.</p>\n\n<p>Charles represents Greylock on the boards of Aquantia, Kickfire, ReFocus Imaging and SiTime. Charles&#8217; previous investments include Calista Technologies (acquired by Microsoft), Quorum Systems (acquired by Spreadtrum), Espial (TSX: ESP.TO), Sanera Systems (acquired by McDATA) and Siliquent (acquired by Broadcom).</p>\n\n<p>He earned his Bachelor of Engineering in Systems and Computer Engineering in 1988 from Carleton University in Ottawa, Canada. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Board of Directors","firm":{"name":"Sanera","permalink":"sanera","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}