{"first_name":"Charles","last_name":"Dietrich","permalink":"charles-dietrich-2","crunchbase_url":"http://www.crunchbase.com/person/charles-dietrich-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"SlideRocket","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Sep 28 22:51:29 UTC 2009","updated_at":"Sun Mar 04 05:14:47 UTC 2012","overview":"<p>Chuck Dietrich is the CEO of SlideRocket, the premiere presentation platformthat reinvents presentations by bringing big ideas to life, engaging audiences and driving business.He brings more than a dozen years of entrepreneurial experience to the team and is passionate about rewriting the rules of presentations through SlideRocket’s interactive, cloud-based platform. In April2011, Dietrich facilitated the company’s high-profile acquisition by VMware, the global leader in virtualization and cloud infrastructure. VMware and SlideRocket share a mutual affinity for seizing big opportunities to reinvent how people work –an environment that is collaborative, social and mobile.  </p>\n\n<p>Prior to SlideRocket, Chuck was the general manager and vice president of Salesforce Mobile, where he spearheaded the company’s strategic alliances with carriers and mobile device providers including Apple, Motorola, Nokia, RIM, Sprint and others.  In 2008, Chuck shared the stage with Steve Jobs,highlighting capabilities on the newly released iPhone.  Chuck also led salesforce.com’s successful acquisition of Sendia.  </p>\n\n<p>Chuck has been invited to guest lecture MBA students at Harvard, MIT and Northwestern on cloud technologies.  Under his direction at SlideRocket, the company has been selected by SXSW Interactive as the official presentation platform for three years running. </p>\n\n<p>Chuck holds an MBA from the University of Utah and a BA from the University of Colorado.  When not innovating cloud technologies, he is an avid world traveler and athlete, with an active interest in skiing, mountaineering in the Andes and Himalayasand kite surfing.  Chuck currently lives in San Francisco with his wife and two children.  </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0017/6440/176440v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0017/6440/176440v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0017/6440/176440v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"SlideRocket","permalink":"sliderocket","type_of_entity":"company","image":{"available_sizes":[[[150,29],"assets/images/resized/0001/3990/13990v1-max-150x150.png"],[[216,42],"assets/images/resized/0001/3990/13990v1-max-250x250.png"],[[216,42],"assets/images/resized/0001/3990/13990v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}