{"first_name":"Charlie","last_name":"B. Williams III","permalink":"charlie-b-williams-iii","crunchbase_url":"http://www.crunchbase.com/person/charlie-b-williams-iii","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"DBL LLC","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Dec 30 04:01:31 UTC 2008","updated_at":"Wed Dec 31 18:56:17 UTC 2008","overview":"<p>Mr. Williams is the youngest out the group but is a prime example of the type of leadership qualities that DBL brings out in today&#8217;s youth. Charlie B Williams III (27) is a creative professional in the Gaming entertainment industry and is quickly making a name for himself in his chosen field of profession. Charlie Graduated from the Illinois Institute of Art in Schaumburg IL. Upon Graduating in 2004 he received a Bachelor of Fine Arts in Media Arts and Animation. This Eventually lead him to land his first Job with Electronic Arts where he had a pivotal role in creating assets for numerous titles thus having credits with Some of EA&#8217; s Biggest titles such as EA sports Fight Night Round 3 For XBOX 360 play station 2 Xbox and also being Credit on other block buster titles like EA DEF Jam Icon for the Xbox 360 Play station 3. After Charlie time at Electronic Arts-Chicago he then moved on to his current position at Independent studios by the name of High voltage Software and there sister company Red Eye Studios where he is Now a Lead Environment Artist.. Being a well round artist allows him to do to everything from corporate identity to brand management, as well as graphic and web design. Charlie brings over 6 plus years of artistic and technical knowhow to the DBL brand.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Graphic Manager","firm":{"name":"DBL LLC","permalink":"dbl-llc","type_of_entity":"company","image":{"available_sizes":[[[150,66],"assets/images/resized/0003/2681/32681v2-max-150x150.png"],[[250,110],"assets/images/resized/0003/2681/32681v2-max-250x250.png"],[[450,199],"assets/images/resized/0003/2681/32681v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}