{"first_name":"Charles","last_name":"Hough","permalink":"charles-hough","crunchbase_url":"http://www.crunchbase.com/person/charles-hough","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Apr 13 07:18:56 UTC 2009","updated_at":"Sun May 16 20:32:27 UTC 2010","overview":"<p>As Chief Operating Officer, Charles is responsible for Lithium&#8217;s customer success, overseeing all facets of customer operations and business planning.</p>\n\n<p>A strong advocate for customers and active customer support communities, Charles brings a long track record of building customer-centric organizations. Previously, Charles led the Partner Services team at Yahoo, helping its customers achieve their business goals with Yahoo&#8217;s monetization products. In this role, he led the team to deliver continuous optimization of the monetization solution to ensure ongoing customer success.</p>\n\n<p>Charles also held multiple leadership roles at Interwoven, helping the company grow from a start-up to a recognized leader in enterprise content management. He led some of the largest deployments of Interwoven&#8217;s solutions and headed its Worldwide Support team, helping to increase the company&#8217;s customer satisfaction to record levels. As Vice President of Support, he led the development of Interwoven&#8217;s support platform, which led to industry recognitions by substantially enhancing the company&#8217;s engagement of its large customer base.</p>\n\n<p>Charles holds a BS and an MS in Electrical Engineering &amp; Computer Sciences from the University of California at Berkeley and an MS in Management Science &amp; Engineering from Stanford University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Operating Officer","firm":{"name":"Lithium Technologies","permalink":"lithiumtechnologies","type_of_entity":"company","image":{"available_sizes":[[[150,54],"assets/images/resized/0000/4156/4156v8-max-150x150.png"],[[165,60],"assets/images/resized/0000/4156/4156v8-max-250x250.png"],[[165,60],"assets/images/resized/0000/4156/4156v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}