{"first_name":"Charles F.","last_name":"McCormick","permalink":"charles-mccormick","crunchbase_url":"http://www.crunchbase.com/person/charles-mccormick","homepage_url":"http://www.mcoblaw.com","birthplace":"Brighton, MA","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1969,"born_month":8,"born_day":4,"tag_list":"venture-capital, vc, series-a, series-b, lbo, mbo, start-up, visa, l-1, e-3, b-1, digital-media, silicon-alley, invest, , ma, merger, sale, joint-venture, law, lawyer, sec, finra, broker-dealer, angel, corporate, law-firm, immigration, attorney","alias_list":null,"created_at":"Tue Aug 10 16:32:35 UTC 2010","updated_at":"Thu Sep 27 21:29:24 UTC 2012","overview":"<p>Charles is a co-founder of McCormick &amp; O&#8217;Brien, LLP, a New York City-based law firm that specializes in representing members of the investor and entrepreneurial communities building great companies.   </p>\n\n<p>He has extensive experience advising private equity investors and emerging companies in a wide variety of investment and commercial transactions, including LBOs/MBOs, leveraged recapitalizations, non-bankruptcy restructurings, secured and unsecured debt financings, mergers, stock and asset acquisitions, sales, divestitures, joint ventures, public stock offerings, PIPE transactions, venture capital financings and commercial licensing transactions.  </p>\n\n<p>Charles has managed a variety of complex domestic and international investment and M&amp;A transactions and possesses significant cross-border transactional experience in Canada, Mexico, Latin America and Eastern and Western Europe.  </p>\n\n<p>Mr. McCormick is a 1995 graduate of the University of Chicago Law School, where he completed course work in Corporate Finance at University of Chicago Booth School of Business, was a Research Assistant to Professor Geoffrey Miller, a Moot Court Participant and a Clinical Fellow with the Edwin F. Mandel Legal Aid Clinic Criminal Justice Project.  </p>\n\n<p>He was graduated summa cum laude from Fordham College, in 1991, where he was elected to Phi Beta Kappa. He is a member of the New York City and American Bar Associations. He is admitted to practice in New York State.  He is a past member of the New York City Affairs Committee and a current member of the Corporate Law Committee of the New York City Bar Association.  </p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0020/4070/204070v2-max-150x150.jpg"],[[165,250],"assets/images/resized/0020/4070/204070v2-max-250x250.jpg"],[[298,450],"assets/images/resized/0020/4070/204070v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"JD","subject":"Law","institution":"University of Chicago Law School","graduated_year":1995,"graduated_month":null,"graduated_day":null},{"degree_type":"BA","subject":"Philosophy","institution":"Fordham College","graduated_year":1991,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/profile/view?id=197853&trk=tab_pro","title":"Linked In"}]}