{"first_name":"Charles","last_name":"Armstrong","permalink":"charles-armstrong","crunchbase_url":"http://www.crunchbase.com/person/charles-armstrong","homepage_url":"http://trampolinesystems.com","birthplace":"Portsmouth, UK","twitter_username":"car0lus","blog_url":"http://charlesarmstrong.net","blog_feed_url":"","affiliation_name":"Trampoline Systems","born_year":1971,"born_month":9,"born_day":14,"tag_list":"","alias_list":null,"created_at":"Mon Apr 07 18:09:43 UTC 2008","updated_at":"Sun Sep 06 02:34:30 UTC 2009","overview":"<p>Charles Armstrong (born September 14 1971) is a British ethnographer, entrepreneur and author. He&#8217;s primarily know for his work on social analytics, emergent democracy and electronically-mediated organisations. Armstrong serves as CEO of the social analytics business Trampoline Systems, as Custodian of think tank CIRCUS foundation and as Director of the non-profit One Click Orgs.</p>\n\n<p>Early education</p>\n\n<p>Born in Portsmouth, UK Armstrong&#8217;s family moved to Cornwall in 1978. Armstrong attended the state primary school in the village of Lanner before being awarded a scholarship and an assisted place to Truro School in 1983. In 1988 the family moved to Gloucestershire where Armstrong gained academic and musical scholarships to study at Cheltenham College. In 1990 he was awarded a choral scholarship to St John&#8217;s College, Cambridge where his uncle, grandfather and great-grandfather had also studied. Armstrong graduated with a degree in Social and Political Science in 1993.</p>\n\n<p>Balkan Odyssey</p>\n\n<p>In 1994 Armstrong formed a venture called the Electric Company which worked with David Owen to develop and publish a CD-ROM titled &#8220;Balkan Odyssey&#8221; documenting the peace process in former Yugoslavia; where Owen was serving as the EU&#8217;s Peace Envoy. The disc contained the text of Owen&#8217;s book of the same title with hyperlinks to full text of all peace plans, associated maps, debates from the International Conference on the Former Yugoslavia, photo-journalism from the conflict, video reportage from the BBC and ITN and audio material recorded by Owen. The project included an automated system to link relevant items. It was developed by a team of five people using consumer technology for a minimal budget. It was believed to be the first cross-platform CD-ROM developed with a single media archiving serving both Windows and Apple platforms. The disc was launched in November 2005 at London&#8217;s Queen Elizabeth Conference Centre and was praised by specialist and mainstream press including the Economist.</p>\n\n<p>CIRCUS foundation</p>\n\n<p>in 1997 Armstrong formed the think tank CIRCUS foundation to develop experimental social projects using electronic media. That same year he came into contact with the sociologist and innovator Michael Young who was to be a great influence upon him. Armstrong wrote to Young offering his assistance developing electronic learning systems for the School for Social Entrepreneurs which Young was then establishing. This led to the development by CIRCUS foundation of SSE Learning Web, a highly decentralised fore-runner of social networking platforms.</p>\n\n<p>Ethnography in the Isles of Scilly</p>\n\n<p>Armstrong&#8217;s deepening relationship with SSE led him to become a student with the school in 1999. He left London and relocated to the Isles of Scilly for one year, spending six months on the island of St Agnes, one month on the Gugh and five months on the island of St Mary&#8217;s. During his period in the islands Armstrong conducted ethnographic research into information distribution and collective decision-making. He also formed a community enterprise called the Scillonia Digital Workshop to stimulate the development of digital-sector skills in the islands. The constitution for this organisation represents Armstrong&#8217;s first experiment with electronic democratic systems.</p>\n\n<p>Ghana and Stromboli</p>\n\n<p>After completing his work in the Isles of Scilly Armstrong moved to Milano, Italy in 2000. He spent November and December of that year in Tamale, Ghana establishing a derivative of the digital workshop model, producing a short documentary on girls&#8217; education and helping school girls work with digital media production. This project was funded by Camfed. Armstrong returned to London for six months in 2001, during which period Michael Young became Armstrong&#8217;s mentor on condition that Armstrong taught him how to use a computer. In August 2001 Armstrong moved to the volcanic island of Stromboli where he lived for the following two years.</p>\n\n<p>Trampoline Systems</p>\n\n<p>In July 2003 Armstrong returned to London to found the technology venture Trampoline Systems. The company develops software that analyses large quantities of email and other data to map relationships and subject matter across large complex networks. In 2007 Trampoline announced an investment deal with the Tudor Group. The business has received a number of honours including Red Herring&#8217;s Global 100 Award in 2009. It operates from offices in Shoreditch, London.</p>\n\n<p>Emergent Democracy</p>\n\n<p>Following Armstrong&#8217;s experimental constitution for the Scillonia Digital Workshop his interest in electronic democratic systems was reignited by a conversation with Joi Ito at Foo Camp in 2008. This led him to establish CIRCUS foundation&#8217;s Themis project to develop constitutions and platforms for emergent democracy. In October 2008 One Click Orgs was initiated as a sub-project to develop an electronic platform providing simple legal structures and democratic governance for virtual organisations. Armstrong&#8217;s chapter on emergent democracy will appear in an upcoming book by O&#8217;Reilly Media provisionally titled Open Government.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder / CEO","firm":{"name":"Trampoline Systems","permalink":"trampoline-systems","type_of_entity":"company","image":{"available_sizes":[[[135,50],"assets/images/resized/0001/7015/17015v1-max-150x150.png"],[[135,50],"assets/images/resized/0001/7015/17015v1-max-250x250.png"],[[135,50],"assets/images/resized/0001/7015/17015v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"CEO & Founder","firm":{"name":"TourWrist","permalink":"tour-wrist-2","type_of_entity":"company","image":{"available_sizes":[[[150,43],"assets/images/resized/0014/3807/143807v4-max-150x150.png"],[[250,72],"assets/images/resized/0014/3807/143807v4-max-250x250.png"],[[450,130],"assets/images/resized/0014/3807/143807v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}