{"first_name":"CHELSE","last_name":"BENHAM","permalink":"chelse-benham-2","crunchbase_url":"http://www.crunchbase.com/person/chelse-benham-2","homepage_url":"http://www.chelsebenham.com","birthplace":"Dallas, TX","twitter_username":"chelsebenham","blog_url":"http://www.businessbitchness.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1968,"born_month":11,"born_day":7,"tag_list":"producer, director, writer, editor, marketing, social-media-expert, app-building, mobile-apps, grant-writing, technology-maven, blogger, business-advice, award-winning, telly, emmy, webby, addy","alias_list":null,"created_at":"Tue Feb 22 14:45:25 UTC 2011","updated_at":"Wed Feb 23 04:29:46 UTC 2011","overview":"<p>Chelse is a Webby and multi-EMMY and Telly Award-winning producer/director/editor, and writer. She spent the first half of her career working in television production creating programming for such companies as HGTV, A&amp;E, and the History Channel. From documentaries to commercials, Chelse has worked in all phases of the production process, taking concepts to product delivery in both long format (documentary, dramatic) and short format (commercials) productions. </p>\n\n<p>Built on a foundation of seasoned experience, she combines more than 18 years of television and marketing training. She has a reputation of &#8220;turning over rocks&#8221; to find untapped opportunities to gain a competitive advantage. Her unique technical expertise and &#8220;big picture&#8221; thinking allow her to fluidly integrate the different areas of video production, television programming and acquisition, social/multimedia marketing, and mobile applications creation together. </p>\n\n<p>She champions the mixture of traditional push marketing approaches with social media strategy to create greater Web presence and virtual traction. She uses both forms of push &amp; pull media to create comprehensive brand awareness strategies.</p>\n\n<p>After her fellowship in Digital Content Design, at the American Film Institute in Hollywood, and as a result of her penchant for Web tools, apps, and graphic design, she led a team to develop a Webby People&#8217;s Voice Award and W3 Award-winning interactive website. Additionally, her expanded interests and skills into online social gaming, mobile application development led to the designing and creation of an ADDY Award-winning iPhone/iPad native app called Bucky Challenge; The University of Texas-Pan American&#8217;s first sports game used as a marketing tool. She documented the mobile application building experience in her blog The Novice App Builder, which was listed at 2010 SXSW Interactive. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/chelsebenham","title":"LinkedIn "},{"external_url":"http://www.twitter.com/chelsebenham","title":"Twitter"}]}