{"first_name":"Cheng","last_name":"Chen","permalink":"cheng-chen","crunchbase_url":"http://www.crunchbase.com/person/cheng-chen","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Aug 19 13:26:00 UTC 2011","updated_at":"Fri Aug 19 13:28:45 UTC 2011","overview":"<p>Cheng T. Chen leads the development of ProtonMedia’s social collaboration platform, ProtoSphere, as CTO and VP of Engineering. He plays a critical role in conceiving and driving the company’s ambitious product roadmap for ProtoSphere 2.0 and beyond. Cheng has been a driving force behind the development of crucial telecom technology for over 25 years, founding and growing successful companies. Most recently, Cheng co-founded Quintum Technologies, a VoIP technology company, where he served as President and CEO. He later managed Quintum’s acquisition by Network Equipment Technologies. Prior to Quintum, Cheng co-founded AccessWorks, where he created the patented Async-to-Sync PPP technology, and developed the first ISDN Terminal Adaptor for Internet access, the de-facto standard for Internet access among terminal adapter vendors worldwide. AccessWorks was later acquired by 3Com Corporation. He was also Engineering V.P. and Chief Architect at Teleos Communications from 1986 to 1993. Chen spent his early career at Bell Labs, where he developed various packet and circuit switching technologies.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CTO/VP of Engineering","firm":{"name":"ProtonMedia","permalink":"protonmedia","type_of_entity":"company","image":{"available_sizes":[[[150,77],"assets/images/resized/0005/2920/52920v1-max-150x150.jpg"],[[169,87],"assets/images/resized/0005/2920/52920v1-max-250x250.jpg"],[[169,87],"assets/images/resized/0005/2920/52920v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}