{"first_name":"Cheryl","last_name":"Goyette","permalink":"cheryl-goyette","crunchbase_url":"http://www.crunchbase.com/person/cheryl-goyette","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Fairhaven Capital Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Jun 13 01:20:38 UTC 2009","updated_at":"Sat Jun 13 08:11:26 UTC 2009","overview":"<p>Cheryl has over 17 years of experience in the venture industry. Prior to joining Fairhaven, she was the Senior Vice President, Partnership Finance and Chief Financial Officer of Flagship Ventures, an early-stage venture capital firm focused on creating, financing, and building innovative companies in the life science and technology sectors, with $500 million of capital under management.  Prior to joining OneLiberty Ventures, a predecessor firm to Flagship Ventures, in 1998, Cheryl was a Partner and Chief Financial Officer at Capital Resource Partners, a private equity firm specializing in mezzanine debt financings.  </p>\n\n<p>Before entering the venture capital industry, Cheryl&#8217;s varied experience included over five years of public accounting, both as a tax consultant with Ernst &amp; Young and as a senior auditor with PricewaterhouseCoopers. In addition, she started and successfully ran her own CPA practice. Cheryl received her CPA license in June of 1982. She has an MS in Taxation from the Graduate School of Bentley College and a BS in Accounting from Bentley College, where she graduated with Highest Honors.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Fairhaven Capital Partners","permalink":"fairhaven-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,39],"assets/images/resized/0002/6060/26060v2-max-150x150.jpg"],[[250,65],"assets/images/resized/0002/6060/26060v2-max-250x250.jpg"],[[450,118],"assets/images/resized/0002/6060/26060v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}