{"first_name":"Chester","last_name":"Spell","permalink":"chester-spell","crunchbase_url":"http://www.crunchbase.com/person/chester-spell","homepage_url":"http://camden-sbc.rutgers.edu/FacultyStaff/Directory/spell.htm","birthplace":"Savannah, GA","twitter_username":"cspell331","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1954,"born_month":12,"born_day":16,"tag_list":"professor, health, virtual-teams, social-networks, justice, substance-abuse, knowledge-management","alias_list":null,"created_at":"Thu Aug 11 20:04:33 UTC 2011","updated_at":"Mon Aug 15 21:14:31 UTC 2011","overview":"<p>Chester Spell is Associate Professor of Management at Rutgers University. He studies the health implications of technology and other working conditions, and how people cope with technology that is confusing, awkward, or seen as so bad it is just plain unfair. He teaches and consults on these topics, especially the effect of virtual technologies on users’ long-term physical and mental health.</p>\n\n<p>Chester regularly teaches courses in Human Resource Management, Compensation, and Organizational Behavior. He has appeared in print and broadcast media dozens of times over the past five years, discussing issues such as: Disability Issues, Employee mental health, Workplace substance abuse treatment programs, Employee assistance programs, and Work-family programs. He is an author of the book Lunar Settlements, a series of papers on engineering and physiological/health considerations in constructing a permanent lunar base. This series was based on a conference presentations sponsored by the Rutgers Dept. of Mechanical Engineering and featured talks by former astronauts including Harrison Schmitt, the last man to walk on the moon.</p>\n\n<p>He has also published over 40 studies in peer reviewed journals and book chapters, including several on the role of technology in affecting how people are managed, appearing in the journal Human Relations, as well as conference presentations on the same topics.  </p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0014/9327/149327v2-max-150x150.jpg"],[[187,250],"assets/images/resized/0014/9327/149327v2-max-250x250.jpg"],[[337,450],"assets/images/resized/0014/9327/149327v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.I.E.; Ph.D","subject":"Industrial Engineering; Management","institution":"Georgia Institute of Technology","graduated_year":1996,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}