{"first_name":"Chetan","last_name":"Kelkar","permalink":"chetan-kelkar-2","crunchbase_url":"http://www.crunchbase.com/person/chetan-kelkar-2","homepage_url":"http://www.agiletechgnosys.com","birthplace":"Mumbai","twitter_username":"agiletechnosys","blog_url":"http://agiletechnosys.wordpress.com","blog_feed_url":"","affiliation_name":"Agile Technosys","born_year":1978,"born_month":1,"born_day":13,"tag_list":"chetan-kelkar","alias_list":null,"created_at":"Mon Nov 16 08:43:40 UTC 2009","updated_at":"Mon Nov 16 19:22:31 UTC 2009","overview":"<p>Chetan Kelkar – CEO at Agile Technosys\nChetan Kelkar works in the capacity of Independent Director at Agile Technosys. Agile Technosys is a software development and services company providing premium services to its clientèle across the globe. His role is to look after the business development, quality management, and overall strategic planning for the growth of the company.\n \nHe is skilled in developing complete web sites, data-driven web applications, user documentation, and rendering graphic designs into web pages that function in all browsers. He possesses strong organizational and analytical skills. PHP, Mysql, Joomla, Magento, Akelos, OsDate, OsCommerce, Code Ignitor, CakePHP, Symphony are a few of his niche domains. He is an expert in search marketing (ranking algorithms and web page optimization), XHTML, CSS, PHP, JavaScript, and MySQL database analysis and design. \n \nAlong with being technically sound, he is a result-driven IT professional, who understands the needs of the client very well. Excellent communication and interpersonal skills are the qualities that help him retain clients and gain new ones. He is well aware of the importance of deadlines, and hence ensures time-bound delivery of services and products. He has developed strong architecture and integration problem solving skills due to his 10-years of experience in this industry. This has helped him in forming a company of 175 talented individuals and raising it to phenomenal heights in a short time span of merely three years.\n \nHis dedication to his work, strong conviction in his values, helpful nature, and Never-Say-Die attitude is what sets him apart from the others. </p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"Agile Technosys","permalink":"agile-technosys","type_of_entity":"company","image":{"available_sizes":[[[150,75],"assets/images/resized/0005/3005/53005v2-max-150x150.png"],[[174,87],"assets/images/resized/0005/3005/53005v2-max-250x250.png"],[[174,87],"assets/images/resized/0005/3005/53005v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}