{"first_name":"Chia-Lin","last_name":"Simmons","permalink":"chia-lin-simmons","crunchbase_url":"http://www.crunchbase.com/person/chia-lin-simmons","homepage_url":"","birthplace":"","twitter_username":"chialinsimmons","blog_url":"http://www.chialinsimmons.blogspot.com","blog_feed_url":"","affiliation_name":"AOL / Time Warner","born_year":null,"born_month":null,"born_day":null,"tag_list":"chia-lin-simmons, chialin, odm, on-digital-media, playphone, play-phone, amazon, audible, mba, attorney, cnet, wired, newscorp, beyond-com, nokia, sony-ericsson, motorola, palm, sandisk, creative, garmin, best-buy, harman, mobile-social-gaming, social-gam","alias_list":null,"created_at":"Wed Aug 11 01:09:52 UTC 2010","updated_at":"Thu Apr 14 05:26:43 UTC 2011","overview":"<p>Chia-Lin Simmons is the VP of Marketing &amp; Content for Harman International&#8217;s (NASDAQ: HAR) Aha division. She is responsible for global marketing for the mobile, in-home and in-car products and global content business development and content programming for the Aha Radio platform. </p>\n\n<p>Prior to joining Harman in 2010, Simmons was VP of Marketing and General Manager of Playphone North America. She was responsible for the strategic direction of marketing, business development, product marketing, operations and customer support for the U.S. and Canada. As a marketing and business development executive with more than 16 years of experience, she has led successful marketing, business development and product marketing efforts in wireless, mobile devices, e-commerce, and emerging technology units for a variety of companies in the digital media industry. Simmons has held key positions with companies such as AOL / Time Warner, Audible (an Amazon company), WIRED, CNET, Beyond.com, Newscorp, and other digital media brands. Most recently, she managed partnerships with social media companies such as MySpace and Facebook at AOL / Time Warner as a business development executive. As Audible&#8217;s VP of Strategic Alliances, Simmons successfully launched Audible&#8217;s wireless business and was responsible for global partnership and marketing programs with companies such as Sony Ericsson, Nokia, Motorola, Palm, SanDisk, Creative, Garmin, Best Buy, Amazon and other major mobile handset, consumer electronics and online/offline commerce companies. </p>\n\n<p>In her spare time, she spends time as the co-host of a weekly podcast call On Digital Media (www.odmcast.com). The podcast covers the technology, creation, distribution, consumption and monetization of digital media and its effects on traditional media and marketing. The ODM podcast counts as its listeners numerous technologies, digital media and traditional media executives. </p>\n\n<p>Simmons graduated Magna cum Laude and Phi Beta Kappa from U.C. San Diego and received her MBA from Cornell University, where she was a Park Leadership Fellow. She also has a JD from George Mason University School of Law and is a licensed New York attorney.</p>","image":null,"degrees":[{"degree_type":"MBA","subject":"Business","institution":"Cornell University","graduated_year":2002,"graduated_month":null,"graduated_day":null},{"degree_type":"JD","subject":"Law","institution":"George Mason University","graduated_year":2005,"graduated_month":null,"graduated_day":null},{"degree_type":"BA","subject":"Communications","institution":"University of California, San Diego","graduated_year":1995,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"VP, Marketing & Content","firm":{"name":"Harman International","permalink":"harman-international","type_of_entity":"financial_org","image":null}},{"is_past":true,"title":"Vice President, Strategic Alliances","firm":{"name":"Audible ( Amazon )","permalink":"audible-amazon","type_of_entity":"financial_org","image":null}},{"is_past":true,"title":"Sr Director of Business Development","firm":{"name":"AOL / Time Warner","permalink":"aol-time-warner","type_of_entity":"financial_org","image":null}},{"is_past":true,"title":"Marketing Director, etc","firm":{"name":"Voquette , Clip2, CNET, Wired, Newscorp","permalink":"voquette-clip2-cnet-wired-newscorp","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/csimmons","title":"LinkedIn"},{"external_url":"http://twitter.com/zeropts","title":"Twitter"}]}