{"first_name":"Ching-Yu","last_name":"Hu","permalink":"ching-yu-hu","crunchbase_url":"http://www.crunchbase.com/person/ching-yu-hu","homepage_url":"http://www.skyboximaging.com","birthplace":"Stanford, CA","twitter_username":"cyhu","blog_url":"","blog_feed_url":"","affiliation_name":"Skybox Imaging","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":"","created_at":"Tue Apr 17 07:08:05 UTC 2012","updated_at":"Sat Aug 04 14:43:23 UTC 2012","overview":"<p>Ching-Yu is an entrepreneur born and raised in Silicon Valley. </p>\n\n<p>As the Director of Business Development, Ching-Yu is responsible for driving new business opportunities with strategic alliances and partnerships around the world. Since co-founding Skybox, she has played a key role in supporting Skybox’s Series A, B, and C venture capital financing, marketing, sales, and various business operations initiatives. </p>\n\n<p>In 2008, Ching-Yu met her 3 co-founders who shared a vision of building a big data company powered by small satellites. Prior to Skybox, Ching-Yu held various roles at JPMorgan and TIAA-CREF creating portfolio optimization models, analyzing large volumes of transactional data to determine risks and exposures of financial assets, and other data analytics projects. As an undergraduate, Ching-Yu conducted research in the Industrial Engineering Operations Research department focusing on uncertainty modeling and robust portfolio optimization.</p>\n\n<p>Ching-Yu earned her Master’s degree in Management Science &amp; Engineering at Stanford University. She previously earned a Bachelor’s degree in Operations Research Management Science, and a Bachelor’s degree in Statistics from University of California, Berkeley. </p>\n\n<p>While not at Skybox, Ching-Yu greatly enjoys bossa-nova jazz, vinyasa yoga, traveling, and spending time with her friends and family.</p>","image":{"available_sizes":[[[150,123],"assets/images/resized/0020/4381/204381v1-max-150x150.png"],[[250,206],"assets/images/resized/0020/4381/204381v1-max-250x250.png"],[[250,206],"assets/images/resized/0020/4381/204381v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Skybox Imaging","permalink":"skybox-imaging","type_of_entity":"company","image":{"available_sizes":[[[150,133],"assets/images/resized/0012/2677/122677v5-max-150x150.jpg"],[[250,222],"assets/images/resized/0012/2677/122677v5-max-250x250.jpg"],[[450,400],"assets/images/resized/0012/2677/122677v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}