{"first_name":"Chris","last_name":"Tilton","permalink":"chris-tilton-2","crunchbase_url":"http://www.crunchbase.com/person/chris-tilton-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Aug 06 03:24:23 UTC 2011","updated_at":"Sat Aug 06 03:26:51 UTC 2011","overview":"<p>With 20 years of high-level marketing experience and a proven track record in helping launch successful companies, Chris Tilton brings a wealth of marketing and software security expertise to the Zettaset team. As Vice President of Marketing, Chris oversees the company&#8217;s marketing, advertising and public relations initiatives and plays an integral role in its growth and development.</p>\n\n<p>Chris has held a variety of key marketing positions during his seasoned career. Prior to joining Zettaset, he worked with several industry-leading companies, including SPI Dynamics, which established itself as the expert in Web application security assessment and testing before its successful exit to Hewlett-Packard in 2007. Following that, Chris was recruited by several other startups, where he created successful marketing departments from scratch and developed them into integral lead- and profit-generating components for each venture. At Purewire, Chris played a key executive role as VP of marketing programs and contributed to its successful exit to Barracuda in October 2009. Soon thereafter, Chris was hired at Veracode, where he created and managed the company&#8217;s marketing initiatives in Europe.In addition to his skills in budgeting and negotiation, lead generation and project management, Chris is well-respected in the software security industry for his innovative ideas and team-player attitude.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP of Marketing","firm":{"name":"Zettaset","permalink":"goto-metrics","type_of_entity":"company","image":{"available_sizes":[[[150,39],"assets/images/resized/0007/6812/76812v3-max-150x150.png"],[[250,66],"assets/images/resized/0007/6812/76812v3-max-250x250.png"],[[284,75],"assets/images/resized/0007/6812/76812v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}