{"first_name":"Chris","last_name":"Daniels","permalink":"chris-daniels","crunchbase_url":"http://www.crunchbase.com/person/chris-daniels","homepage_url":"http://www.askwomen.com.au","birthplace":"","twitter_username":"askwomen","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"askwomen","alias_list":null,"created_at":"Wed Nov 07 06:13:04 UTC 2012","updated_at":"Thu Nov 08 07:55:52 UTC 2012","overview":"<p>askwomen is the start of a brand new online community for today’s modern woman and features relevant and contextual information on women’s lifestyles. The site features book club reviews, the best coffee shops, fashion trends, health &amp; fitness, relationships, sex, food &amp; wine, nutrition, parenting, family, music, modern living, video, technology, pets and more. Our focus is on a wide spectrum of women&#8217;s interests and women’s lifestyles and is not directed towards the standard celebrity gossip and makeup tips that most female related sites publish. askwomen is the modern woman’s way of seeking advice from her girlfriends and sharing her advice. We encourage you to both read and contribute to create a vibrant online community for women.</p>\n\n<p>Our approach is:</p>\n\n<p>• positive: Life is too short to create negativity\n• honest: We give you our honest opinions and experiences\n• respectful: We will sometimes challenge people or ideas, but we commit to always do this respectfully\n• encouraging: We want this site to provide inspiration for all women to develop and</p>\n\n<pre><code>We’re about what women have always done for each other which is to ask for help when they need it and to give help when they can.\n</code></pre>\n\n<p>NOTE: The askwomen.com.au website is a newly created, wholly independent, unaffiliated Australian website with no association with any other &#8220;ask&#8221; related websites on the worldwide web.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}