{"first_name":"Chris","last_name":"Capossela","permalink":"chris-capossela","crunchbase_url":"http://www.crunchbase.com/person/chris-capossela","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jul 02 23:30:35 UTC 2008","updated_at":"Mon Jul 07 20:09:05 UTC 2008","overview":"<p>Chris Capossela is senior vice president of the <a href=\"http://www.crunchbase.com/company/microsoft\" title=\"Microsoft\">Microsoft</a> Information Worker Product Management Group. He manages the Microsoft Office System of products, which includes desktop applications such as Word, Excel, PowerPoint, Outlook, InfoPath, Groove, OneNote, Project and Visio, server products such as Office SharePoint Server, Exchange Server, Office Communication Server and Project Server, and hosted software services such as Office Live, Office Live Meeting and Office Online – all of which deliver end-user productivity and companywide unified communications and collaboration, business intelligence and enterprise content management capabilities. Capossela is responsible for worldwide product and business management for the Office System. This includes defining pricing, packaging, go-to-markets, branding and advertising, as well as developing sales integration and the partner ecosystem around the world.</p>\n\n<p>Capossela has spent more than 15 years at Microsoft in a variety of marketing, technical and field positions.</p>\n\n<p>Previously, Capossela was general manager of the Microsoft Project business unit, where he was responsible for the development of Microsoft Project. Capossela also has served as chief of staff for the president of Microsoft&#8217;s Europe, Middle East and Africa (EMEA) region, which is composed of 38 Microsoft subsidiaries and has its headquarters in Paris.</p>\n\n<p>For more than two years Capossela served as speech assistant for Microsoft Chairman Bill Gates. During that time Capossela worked closely with Gates, crafting material for more than 350 speeches and presentations. His experience with Gates taught him to think big and to never miss an opportunity to learn something new.</p>\n\n<p>Early in his career at the software company, Capossela worked as a product manager for Microsoft Visual FoxPro and Access; he spent three years as a program manager for Access, the company&#8217;s database management program and a key product in the Microsoft Office System. While a member of the Access team in 1997, Capossela was granted a U.S. patent for his method of integrating Access with source code control programs such as Microsoft Visual SourceSafe.</p>\n\n<p>Capossela has a bachelor&#8217;s degree in computer science and economics from Harvard University. He first became interested in computers when, as a boy, he wrote a reservation system for his family&#8217;s small Italian restaurant in Boston using dBASE for DOS on an early IBM PC.</p>\n\n<p>Capossela lives in Seattle with his wife and two daughters. Away from work, Capossela is a movie buff and enjoys playing tennis and traveling. </p>","image":{"available_sizes":[[[106,150],"assets/images/resized/0002/1438/21438v1-max-150x150.jpg"],[[145,204],"assets/images/resized/0002/1438/21438v1-max-250x250.jpg"],[[145,204],"assets/images/resized/0002/1438/21438v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.microsoft.com/presspass/exec/capossela/default.mspx\" title=\"Microsoft\" rel=\"nofollow\">Microsoft</a></p>"},"degrees":[{"degree_type":"Bachelor","subject":"Computer Science and Economics","institution":"Harvard University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Senior Vice President, Information Worker Product Management Group","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://en.thinkexist.com/quotes/chris_capossela/","title":"Quotes from Chris Capossela"}],"web_presences":[]}