{"first_name":"Christopher M","last_name":"Dancy","permalink":"christopher-m-dancy","crunchbase_url":"http://www.crunchbase.com/person/christopher-m-dancy","homepage_url":"http://www.chrisdancy.com","birthplace":"Silver Spring, Maryland","twitter_username":"chrisdancy","blog_url":"http://www.servicesphere.com","blog_feed_url":"http://www.chrisdancy.com/journal/rss.xml","affiliation_name":"Unaffiliated","born_year":1968,"born_month":10,"born_day":11,"tag_list":"itil, itsm, service-desk, denver, westminster-maryland","alias_list":null,"created_at":"Mon Jun 01 21:46:06 UTC 2009","updated_at":"Thu Jun 04 20:39:28 UTC 2009","overview":"<p>Chris Dancy founder and Vice President of Sales and Marketing of ServiceSphereTM. </p>\n\n<p>ServiceSphere is an organization dedicated to the full lifecycle of IT support. and 100% vendor agnostic.  We focus on supporting customers in their quest to advance their ITSM &amp; ITIL ambitions while maintaining a healthy distance from HYPE. </p>\n\n<p>Finally Servicesphere brings unique after hours support for small IT Desks who want to extend their hours of operations without giving over their ENTIRE support department to strangers in a strange lands!</p>\n\n<p>Previously Chris Dancy joined Touchpaper/Avocent as Vice President of Business Development in March 2007, advocating processed based approach to ITSM through people, process and tools.</p>\n\n<p>Chris has over 20 years of experience in IT, and was responsible for enterprise presales support ITIL consulting, best practices support and North American speaking ITSM engagements.</p>\n\n<p>Before joining Touchpaper/Avocent, Chris was the Director of Product Development Service Desk Technologies &amp; Desktop Management Strategies at NetworkD.</p>\n\n<p>In this role, Chris developed internal testing methodologies and managed iValue and iServiceDesk for HEAT roadmap.</p>\n\n<p>iValue was one of the first technologies to bridge service desk and desktop management agnostically from any service desk software to LANDesk, Microsoft SMS and Novell Zen.</p>\n\n<p>Previously at NetworkD, Chris was lead solution architect for HEAT Service Desk &amp; the LANDesk Management Suite, advising customers on ITIL best practices and the integration between desktop and support desk to combine disparate IT practice silos.  Becoming one of the world&#8217;s top HEAT consultants with his &#8220;Kung-Fu&#8221; approach to making FrontRange&#8217;s HEAT product do the impossible!</p>\n\n<p>Prior to NetworkD, Chris was a solution consultant for FrontRange. While there Chris installed over 150 customers around North America and Europe, from the State Department to Samsung Electronics.</p>\n\n<p>Chris started his career as a service desk manager WebMD.</p>\n\n<p>Chris has a Bachelor of Science degree in Accounting from Mount Saint Mary’s University and currently resides in Denver, Colorado with his family.</p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0004/6206/46206v2-max-150x150.jpg"],[[80,80],"assets/images/resized/0004/6206/46206v2-max-250x250.jpg"],[[80,80],"assets/images/resized/0004/6206/46206v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor of Science ","subject":"Accounting","institution":"Mt St Mary's","graduated_year":1991,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}