{"first_name":"Chris","last_name":"Beeson","permalink":"chris-beeson","crunchbase_url":"http://www.crunchbase.com/person/chris-beeson","homepage_url":"http://www.digikey.com","birthplace":"Dayton, OH","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Digi-Key","born_year":1959,"born_month":12,"born_day":15,"tag_list":"","alias_list":null,"created_at":"Sun Oct 17 02:05:33 UTC 2010","updated_at":"Mon Oct 18 03:00:17 UTC 2010","overview":"<p>More than 25 years of experience in electronic components distribution. Currently, he is VP of Sales and VP of Supplier Management at a $1.5 Billion distributor of electronic components including microcontrollers, semiconductors, peripherals, converters and passive components. The company is the fifth largest distributor in North America and plays a significant role in serving design engineers and supplying production quantities to OEMs and contract manufacturers. It specializes in lighting (solid state and LEDs), wireless and microcontroller products. The distributor features more than 400 manufacturers in its line card including Texas Instruments, Freescale, Cypress, Analog Devices, Atmel, Avago, Skyworks, Tri Quint, NXP Semiconductors, STMicroelectronics, National Semiconductor, Infineon Technology, Toshiba, Molex, Tyco, Amphenol, Maxim and RFMD, among many others. It sells a number of products directly to Apple and other Tier 1 manufacturers. Prior to joining his current firm, the consultant spent 10 years as a Regional VP for Avnet. He can comment on pricing, demand, inventory levels, competitive positioning, new technologies, and supplier selection, among other topics.</p>","image":null,"degrees":[{"degree_type":"Marketing","subject":"","institution":"Bowling Green","graduated_year":1982,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"VP Sales","firm":{"name":"Digi-Key","permalink":"digi-key","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}