{"first_name":"Chris","last_name":"Rust","permalink":"chris-rust","crunchbase_url":"http://www.crunchbase.com/person/chris-rust","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"US Venture Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Nov 27 05:32:06 UTC 2008","updated_at":"Thu Mar 05 23:23:00 UTC 2009","overview":"<p>Chris is a venture capitalist that focuses on early stage information technology investments.</p>\n\n<p>Chris Rust joined USVP in November 2004. Prior to USVP, Chris was the CEO of Mahi Networks (acquired by Meriton Systems). Previously, he was a Partner at Sequoia Capital. \nChris&#8217;s operating experience before entering venture capital spanned twelve years in engineering, product management, and sales support roles at high growth private companies like Carrier Access Corporation (Nasdaq: CACS) and ComCore (acquired by NSM), and large companies like U S West. Chris was a founding network architect of Time Warner Roadrunner and a founding member of the DOCSIS cable modem standards effort.  Time Warner Roadrunner has grown into one of the largest broadband service providers in the U.S. </p>\n\n<p>Chris is currently a Director of Akros, Clustrix, Dilithium, Dune, Veriwave, and Zannel. Previously, Chris was a Director or lead investor in Abrizio (PMCS), Afara (SUN), Avanex (AVNX), Commerce5 (DRIV), LVL7 (BRCM), Mellanox (MLNX), Santur, Stratalight (OPXT), SwitchOn Networks (PMCS), Telera (ALA), and VxTel (INTC). </p>\n\n<p>Chris received a B.S. and M.S. Electrical Engineering from the University of Lowell, an M.S. Telecommunications Engineering from the University of Colorado, Boulder, and an M.S. Engineering Management from the University of Colorado, Boulder. </p>\n\n<p>CONTACT:  rust@usvp.com, 650 854 9080\nASSISTANT: Cynthia Sprock, 650.926.7761, csprock@usvp.com </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"US Venture Partners","permalink":"us-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[103,58],"assets/images/resized/0001/5080/15080v1-max-150x150.png"],[[103,58],"assets/images/resized/0001/5080/15080v1-max-250x250.png"],[[103,58],"assets/images/resized/0001/5080/15080v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}