{"first_name":"Chris","last_name":"Butler","permalink":"chris-butler-2","crunchbase_url":"http://www.crunchbase.com/person/chris-butler-2","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"betwyx","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Feb 17 23:09:58 UTC 2010","updated_at":"Thu Mar 04 19:40:47 UTC 2010","overview":"<p>Chris Butler has 18 years experience focused on building software solutions with the past 12 focused exclusively in online media.  While spending over  7 years as the CTO of IPRO, Mr. Butler became considered one of the foremost authorities in online media buying and online media research.  As a result, Mr Butler also served on several industry leading initiatives and boards and committees of the Interactive Advertising Bureau, Web Analytics Association and Online Publishers Association.   </p>\n\n<p>Mr. Butler’s efforts from 2004-2007 focused on dramatically extending IPRO’s research capabilities and eventually led to the design of IPRO’s core product, SPOTSITE, as the first research-driven media  marketplace.  SPOTSITE allowed media buyers to buy media from the over 100,000 websites using IPRO research to explicitly target specific demographic audiences for their media buys.  Additionally, some of IPRO’s media screening capabilities help drive the use and adoption of Right Media’s advertising exchange from  </p>\n\n<p>Since leaving IPRO in 2007, Mr Butler has continued on the forefront of online media by serving as the founder and President of VERTUAL MEDIA, the first and largest online ad network focused exclusively on helping advertisers reach the young male audience.  Mr Butler currently serves as the Managing Director of Salvo Marketing, a leading online advertising agency helping brands like Scion automobiles, Debix, and New Leaf America  launch their online presence and brands.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CTO","firm":{"name":"betwyx","permalink":"betwyx","type_of_entity":"company","image":{"available_sizes":[[[150,47],"assets/images/resized/0007/2075/72075v2-max-150x150.tiff"],[[250,79],"assets/images/resized/0007/2075/72075v2-max-250x250.tiff"],[[450,142],"assets/images/resized/0007/2075/72075v2-max-450x450.tiff"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}