{"first_name":"Chris","last_name":"Hewitt","permalink":"chris-hewitt-2","crunchbase_url":"http://www.crunchbase.com/person/chris-hewitt-2","homepage_url":"http://www.berkeleypr.co.uk","birthplace":"","twitter_username":"","blog_url":"http://www.berkeleypr.co.uk/blog/","blog_feed_url":"http://www.berkeleypr.co.uk/blog/","affiliation_name":"Berkeley Public Relations","born_year":null,"born_month":null,"born_day":null,"tag_list":"public-relations, pr","alias_list":null,"created_at":"Tue Apr 13 13:21:26 UTC 2010","updated_at":"Fri Sep 14 17:14:15 UTC 2012","overview":"<p>Chris Hewitt is CEO and founder of Berkeley Communications Group that comprises two leading PR brands. Berkeley PR is a specialist new media and technology agency based in Reading and Ascent PR is a regional firm targeting a diversity of entrepreneurial enterprises from offices in Bristol, Reading, Manchester and London.</p>\n\n<p>Hewitt is a former journalist who spends much of his time today advising board level directors on brand messaging, media training and communications strategies. His view is that businesses need to wake up to the opportunities available to them in this digital age and add colour if not a little controversy to their message to stand out from the crowd. He is on a mission to stamp out mediocrity and to position his clients as distinctive, memorable and likeable characters on their particular stage. In his view, PR is the warm-up act to the main event that is sales.</p>\n\n<p>&#8220;Ultimately, we are here to drive up prosperity of businesses and any agency who had forgotten that has lost the plot.&#8221;</p>\n\n<p>He is an avid believer in the entrepreneurial spirit — an attribute he believes should be embraced not just by small business, but larger ones too. Hence the focus of the Berkeley Communications Group on fast-track businesses from both a B2B and consumer perspective.</p>\n\n<p>His loves include sailing, learning Spanish and walking the dog with his young family. Dislikes include bad weather, bad manners and bad customer service.</p>","image":{"available_sizes":[[[141,150],"assets/images/resized/0008/3622/83622v2-max-150x150.jpg"],[[195,207],"assets/images/resized/0008/3622/83622v2-max-250x250.jpg"],[[195,207],"assets/images/resized/0008/3622/83622v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"Berkeley Public Relations","permalink":"berkeley-public-relations","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0008/0961/80961v2-max-150x150.jpg"],[[250,84],"assets/images/resized/0008/0961/80961v2-max-250x250.jpg"],[[450,151],"assets/images/resized/0008/0961/80961v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}