{"first_name":"Chris","last_name":"Datcu","permalink":"chris-datcu","crunchbase_url":"http://www.crunchbase.com/person/chris-datcu","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Aequilibrium","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 05 23:05:28 UTC 2012","updated_at":"Tue Jun 12 13:15:58 UTC 2012","overview":"<p>Chris’s career spans 20 years and encompasses the full spectrum of development and team lead experience, developing software for customers in Canada, United States and Switzerland, with a strong expertise in web development, business-to-business, e-commerce and database design.</p>\n\n<p>His varied roles, adaptable nature and commitment to continual learning align with Aequilibrium’s culture of Generalizing Specialists whose diverse skillsets are imperative to success in this technology space. Chris has been a member of the core development team at Rational Software, which was acquired by IBM in 2003 for $2.1 billion.</p>\n\n<p>He was also a project engineer at Creo, where his responsibilities included the leadership of the eCentral development team, deployment, architecture, security and operations.</p>\n\n<p>After the acquisition by Kodak in 2005, Chris moved to Absolute Software, a provider of infrastructure security services to major computer manufacturers like Dell, Toshiba and Panasonic.</p>\n\n<p>Using a multitude of technologies, Chris has played various roles from senior software developer, architect, team lead, database and user interface designer.</p>\n\n<p>He worked in numerous positions for a roster of high profile companies, including: Rational Software, Creo /Kodak, Absolute Software, Habanero, WorkSafe, Cariyo, Emergeo Solutions, Talent Technology, Starvision Multimedia, Benchmark, Kirmac Information Technologies, Motion Works International, Conac, Morewave, Jordans, Voice Mobility, Envision Financial, Quartech, GLB Financial, Ryzex, Talent Technology, Dominion, Spectrum Canada, Novax, AfterCAD, Morewave and Vanguard.</p>\n\n<p>Chris applies his skills to develop software for the cloud, web applications and CMS solutions (in particular using SharePoint).</p>\n\n<p>He has a complete understanding of the full software development cycle, from planning, requirement analysis, design, development, unit testing, development and production. Versed in multiple programming languages and technologies, he holds a Master of Science in electrical engineering from the Polytechnic Institute Bucharest with a credential of academic standing provided by University of Toronto.</p>\n\n<p>His consulting activities keep him on the leading edge of software development and enable him to deliver high quality, measurable and lasting results.</p>\n\n<p>In his spare time, Chris enjoys graphic design, illustration, fine art photography, and spending time with his family.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Director, Technology","firm":{"name":"Aequilibrium","permalink":"aequilibrium","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}