{"first_name":"Christopher","last_name":"E. Girgenti","permalink":"christopher-e-girgenti","crunchbase_url":"http://www.crunchbase.com/person/christopher-e-girgenti","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Nov 23 14:37:57 UTC 2008","updated_at":"Sun Nov 23 14:39:44 UTC 2008","overview":"<p>Chris joined New World Ventures in 1996 and has served as Managing Partner since 1998. During this time, he has led the organization and capital formation for four technology venture funds and has led or overseen investments in more than 30 companies. For 20 years, Chris has assisted management teams in building businesses, including helping set strategy, with execution and overall value creation, and optimizing liquidity events. As an active investor and board member, Chris works closely with companies providing general management, finance and operational assistance.</p>\n\n<p>His prior experience includes the corporate finance departments of two regional investment banking firms, The Chicago Corporation and Kemper Securities, Inc. As a banker, Chris focused on technology-related transactions including public offerings, mergers and acquisitions and financial advisory. Prior to becoming a banker, he worked in the merger and acquisition group of KPMG Peat Marwick where he coordinated business valuations and divestiture engagements.</p>\n\n<p>Chris currently serves on the Boards of HyperQuest, Inc., Univa Corporation, Sportvision, Inc., and Reserve Brands, Inc., and as a board observer of The Active Network, Inc. and LeftHand Networks, Inc. Chris graduated with a B.S. in applied mathematics-economics from Brown University and earned his M.B.A. in finance and accounting from Columbia Business School. Chris is also a Chartered Financial Analyst.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing Partner","firm":{"name":"New World Ventures","permalink":"new-world-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,75],"assets/images/resized/0002/9260/29260v3-max-150x150.jpg"],[[250,125],"assets/images/resized/0002/9260/29260v3-max-250x250.jpg"],[[450,225],"assets/images/resized/0002/9260/29260v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}