{"first_name":"Christopher","last_name":"Karatzinis","permalink":"christopher-karatzinis","crunchbase_url":"http://www.crunchbase.com/person/christopher-karatzinis","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"SaaSPlex","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jan 15 17:29:55 UTC 2009","updated_at":"Fri May 01 15:44:07 UTC 2009","overview":"<p>Christopher Karatzinis is a technologist, innovator, visionary and entrepreneur with concerned interest in IT security, SaaS and Cloud Computing. Christopher is well known and respected in his field, with over twenty years of experience in all phases of project life, with the ability to innovate, adapt, invent, motivate and excel in a collaborative and professional manner. He combines very strong technology knowledge with outstanding capacity for leadership, strategic planning and management. Christopher is a dynamic example of that special breed of entrepreneurs who are powering the next generation of the cloud powered web based revolution.</p>\n\n<p>Christopher is a founding director of SaaSPlex, a software product company that has developed the SaaSPlex Platform to provide consolidated access, user administration, application provisioning and centralised billing for any third party cloud services or applications. The latest SaaSPlex product is called eazyBusiness and can be accessed at http://www.eazybusiness.com</p>\n\n<p>Christopher also founded SAASENT Technologies in 2006 to provide SaaS and Cloud Computing solutions and professional services to enterprise clients. Christopher is also a founding director of Compisol, an IT solutions provider that built Ireland&#8217;s first online stock trading system and was a Deloitte Fast 50 winner in 2003.</p>\n\n<p>Prior to Compisol, Christopher worked with Ebeon as a senior technology consultant and senior architect, with FORTHnet S.A. and University of the Aegean as a network architect. Christopher has a degree in Mathematics and Computer Science from University of the Aegean and an MSc from the UCD in the area of Open Network Security.\nSpecialties</p>\n\n<p>Cloud Computing, SaaS, OnDemand, CRM, ERP, DMS, CMS, SOA, BPEL, IMS, KMS, Agile, Open Source, Managed Services, Application Development, Collaboration, Infrastructure, Integration, Information Delivery, Project Management, Project Delivery Process, Case Management, Document Management, Government, Financial Services, Banking, Insurance, Assurance, Government, Central Government, Corporate, Utilities</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founding Director","firm":{"name":"SaaSPlex","permalink":"saasplex","type_of_entity":"company","image":{"available_sizes":[[[150,63],"assets/images/resized/0003/3943/33943v2-max-150x150.png"],[[250,105],"assets/images/resized/0003/3943/33943v2-max-250x250.png"],[[300,126],"assets/images/resized/0003/3943/33943v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Founding Director","firm":{"name":"EazyBusiness","permalink":"eazybusiness","type_of_entity":"company","image":{"available_sizes":[[[150,26],"assets/images/resized/0008/0545/80545v2-max-150x150.png"],[[250,43],"assets/images/resized/0008/0545/80545v2-max-250x250.png"],[[300,52],"assets/images/resized/0008/0545/80545v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Founding Director","firm":{"name":"SaaSEnt","permalink":"saasent","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}