{"first_name":"Christopher","last_name":"Noble","permalink":"christopher-noble","crunchbase_url":"http://www.crunchbase.com/person/christopher-noble","homepage_url":"http://togapit.com","birthplace":"Oshawa, Ontario, Canada","twitter_username":"togapit","blog_url":"http://togapit.com/blog","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1984,"born_month":8,"born_day":28,"tag_list":"noble, togapit, toga-systems, itouch-my-friends, itouchmyfriends","alias_list":null,"created_at":"Wed Jan 13 19:35:02 UTC 2010","updated_at":"Fri Jan 15 22:46:03 UTC 2010","overview":"<p>As Toga Pit&#8217;s CEO, Chris heads brings it all together-from idea to execution. He ensures that business runs like a well-oiled machine (or, well, a well-programmed computer). Having graduated from one of Canada&#8217;s leading Computer Science programs, Chris gained enough expertise and entrepreneurial confidence to start up his own web design company, Toga Systems. </p>\n\n<p>Inspired the iPhone application giant, NG Moco, Chris and his partners began Toga Pit with the intent to bring fun and hilarious applications to iPhones around the world. Chris lives dangerously, and the same energy and tenacity in the applications he&#8217;s producing. Though he realizes the value of un-bandaged hands in the computer programming industry, Chris can&#8217;t resist the thrill of any and all extreme sports, particularly, mountain biking, skiing, and wake boarding. Chris has <em>proudly</em> racked up six surgeries as a result, lending considerably less merit to the &#8220;wussy&#8221; tonsil and wisdom teeth surgeries of his youth. Take this as evidence that Chris is tough, and he&#8217;ll get any job done, tenser-bandaged hand or not. With Nitro the one-metre iguana and Neka, his adopted stray kitten always within reach, Chris works long hours without losing sight of his goal to make Toga Pit a powerful industry player. </p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0007/3270/73270v2-max-150x150.jpg"],[[187,250],"assets/images/resized/0007/3270/73270v2-max-250x250.jpg"],[[337,450],"assets/images/resized/0007/3270/73270v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor","subject":"Computer Science","institution":"University of Waterloo","graduated_year":2009,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}