{"first_name":"Christien","last_name":"Rioux","permalink":"christien-rioux","crunchbase_url":"http://www.crunchbase.com/person/christien-rioux","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jul 01 06:10:31 UTC 2009","updated_at":"Wed Jul 01 06:11:23 UTC 2009","overview":"<p>Christien Rioux, co-founder and chief scientist of Veracode, is responsible for the technical vision and design of Veracode’s advanced security technology. Working with the engineering team, his primary role is the design of new algorithms and security analysis techniques.\nBefore founding Veracode, Mr. Rioux founded @stake, a security consultancy, as well as L0pht Heavy Industries, a renowned security think tank. Mr. Rioux was a research scientist at @stake, where he was responsible for developing new software analysis techniques and for applying cutting edge research to solve difficult security problems. He also led and managed the development for a new enterprise security product in 2000 known as the SmartRisk Analyzer (SRA), a binary analysis tool and its patented algorithms, and has been responsible for its growth and development for the past five years.\nAt L0pht, Mr. Rioux was a senior developer. He co-authored the best-selling Windows password auditing tool @stake LC (L0phtCrack) and the AntiSniff network intrusion detection system. His other activities with L0pht included significant security research, publication work and public speaking engagements. Mr. Rioux is also responsible for numerous security advisories in many applications, operating systems and environments. He is recognized as an authority in the areas of Windows product vulnerability assessment, application optimization and program analysis.\nHis background includes 23 years of computer programming and software engineering experience on a wide range of platforms and for numerous companies, including financial institutions, mechanical engineering firms, educational institutions and multimedia groups.\nHe graduated from the Massachusetts Institute of Technology in 1998, with a Bachelor’s Degree in Computer Science.</p>","image":{"available_sizes":[[[131,131],"assets/images/resized/0005/1486/51486v1-max-150x150.jpg"],[[131,131],"assets/images/resized/0005/1486/51486v1-max-250x250.jpg"],[[131,131],"assets/images/resized/0005/1486/51486v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder and Chief Scientist","firm":{"name":"Veracode","permalink":"veracode","type_of_entity":"company","image":{"available_sizes":[[[150,28],"assets/images/resized/0003/2950/32950v1-max-150x150.png"],[[237,45],"assets/images/resized/0003/2950/32950v1-max-250x250.png"],[[237,45],"assets/images/resized/0003/2950/32950v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}