{"first_name":"Christopher","last_name":"Smart","permalink":"christopher-smart","crunchbase_url":"http://www.crunchbase.com/person/christopher-smart","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Acacia Capital Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Mar 03 21:44:30 UTC 2008","updated_at":"Thu Aug 06 17:57:05 UTC 2009","overview":"<p>Chris Smart is a General Partner of Acacia Capital Partners . This was established as a buy out of IDG Ventures Europe. Acacia is a venture capital company which invests in technology companies across Europe. He is a founding partner in the fund. </p>\n\n<p>He currently has board roles in Mirics Semiconductor, Shazam, Skinkers and Solarflare Inc. In addition he is on the Advisory Board of Aptivate, a not for profit company looking to solve the problems of information access in developing nations and is on the Council of the Cambridge Society for the Appplication of Research. Prior to IDG he was Managing Director of Cambridge Research and Innovation which he established in the 90’s as one of the pre-eminent specialist early stage technology venture capital companies in the UK. He was involved in funding from inception and the development of a range of ventures among which are Cambridge Display Technology, Nanomagnetics and Cambridge Positioning Systems, Cambridge Molecular Technology and Brax. He held directorships in these companies. Before entering venture capital he held senior executive positions in the electronics industry, primarily in a product and software development environment. </p>\n\n<p>Mr. Smart graduated in Electrical Engineering and then obtained an MSc in Physics ( Cum Laude) from Durban University and an MSc in Management from Imperial College, London University. He is an honorary member of Magdalene College, Cambridge. </p>","image":{"available_sizes":[[[72,108],"assets/images/resized/0005/5497/55497v2-max-150x150.jpg"],[[72,108],"assets/images/resized/0005/5497/55497v2-max-250x250.jpg"],[[72,108],"assets/images/resized/0005/5497/55497v2-max-450x450.jpg"]],"attribution":"<p>Chris Smart</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Acacia Capital Partners","permalink":"acacia-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,19],"assets/images/resized/0001/4346/14346v1-max-150x150.png"],[[250,32],"assets/images/resized/0001/4346/14346v1-max-250x250.png"],[[397,51],"assets/images/resized/0001/4346/14346v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}