{"first_name":"Chris","last_name":"Jones","permalink":"chris-jones-3","crunchbase_url":"http://www.crunchbase.com/person/chris-jones-3","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Microsoft","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Nov 13 04:19:05 UTC 2008","updated_at":"Thu Nov 13 04:20:06 UTC 2008","overview":"<p>As corporate vice president of Windows Live Experience Program Management at Microsoft Corp., Chris Jones leads program management, planning, design, usability, user assistance and business development for Windows Live Experience. Jones drives the vision and planning process and is accountable for the ongoing direction of Windows Live services.</p>\n\n<p>Before his Windows Live appointment, Jones was corporate vice president of Windows Client Core Development, where he owned and managed the engineering deliverables for Windows Client to the Windows Vista operating system. As part of this role, he was responsible for driving for excellence across all areas of the user interface and client operating system (Microsoft Internet Explorer, graphics, digital media and presentation platform) as well as acting as a bridge between the Client and Windows Core Operating System Division (COSD) organizations.</p>\n\n<p>Before leading Windows Client Core Development, Jones was corporate vice president for COSD and was instrumental in driving the vision behind the shared engineering services organization: to build the industry-leading operating system foundation to power Microsoft platform products. As part of this role, he focused on coordination and planning with the business divisions, driving customer feedback and connection throughout the teams. He led the development of world-class program management standards and processes. Jones worked previously as corporate vice president of the Windows Client group, as general manager and group program manager for Internet Explorer, and supported the shipment of Internet Explorer versions 3.0, 4.0 and 5.0. Other positions he has held in program management at Microsoft range from consumer e-mail to desktop publishing.</p>\n\n<p>Jones joined Microsoft in 1991. He holds a bachelor&#8217;s degree in mathematical and computational sciences from Stanford University.</p>","image":{"available_sizes":[[[150,115],"assets/images/resized/0002/8427/28427v1-max-150x150.png"],[[215,165],"assets/images/resized/0002/8427/28427v1-max-250x250.png"],[[215,165],"assets/images/resized/0002/8427/28427v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Vice President, Windows Live Experience","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}