{"first_name":"Chris","last_name":"Schroeder","permalink":"chris-schroeder","crunchbase_url":"http://www.crunchbase.com/person/chris-schroeder","homepage_url":"","birthplace":"","twitter_username":"cmschroed","blog_url":"","blog_feed_url":"","affiliation_name":"HealthCentral","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":"","created_at":"Wed Jan 30 07:35:53 UTC 2008","updated_at":"Thu Feb 17 03:46:57 UTC 2011","overview":"<p>Christopher M. Schroeder is an entrepreneur and investor in interactive technologies and social communications. He is Chief Executive Officer and Board Member of HealthCentral, a collection of condition and wellness-specific interactive experiences focused on people finding and sharing real-life experiences related to their health needs. Backed by Polaris Ventures, Sequoia Capital, The Carlyle Group, Allen &amp; Co., and IAC/Interactive Corp (IAC), HealthCentral also manages a condition-specific health online advertising network. </p>\n\n<p>Schroeder is an investor and advisor for a series of technology start-ups and funds ranging from news and media, education, social networks and marketing. He is also engaged in exploring more global trends towards entrepreneurship, with a special focus on the developing world and the Middle East.</p>\n\n<p>A veteran of online media, Schroeder served as CEO and Publisher of Washingtonpost.Newsweek Interactive, which hosts washingtonpost.com and newsweek.msnbc.com, among other leading news sites. During his tenure, the Company more than quadrupled in revenue and audience. Previously, Schroeder was CEO and President of LEGI-SLATE, INC, a leading online B2B provider of information on federal and state legislation and regulation, which he sold.</p>\n\n<p>Prior to joining The Washington Post, Schroeder was a partner with Thayer Capital Partners, a leading private equity company in Washington, DC, and with the investment bank Salomon Brothers in New York. Schroeder has also had extensive government experience, serving in leading management roles in President George Bush’s 1988 and 1992 election campaigns, and working on Secretary of State James A. Baker’s staff with then Under Secretary (and currently President of the World Bank) Robert Zoellick.</p>\n\n<p>Schroeder was a co-founder, and served as Chairman, of the Online Publishers Association (OPA), a research and information organization comprised of the CEOs of top online quality content publishers (including MSNBC, The NY Times, Dow Jones, ESPN.) </p>\n\n<p>Schroeder writes and speaks extensively on the internet and consumer behavior, and has been published in The Wall Street Journal, Newsweek and media magazines. He graduated magna cum laude from Harvard College and with honors from Harvard Business School.</p>","image":{"available_sizes":[[[119,150],"assets/images/resized/0012/2469/122469v1-max-150x150.jpg"],[[199,250],"assets/images/resized/0012/2469/122469v1-max-250x250.jpg"],[[359,450],"assets/images/resized/0012/2469/122469v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"","institution":"Harvard University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"Harvard Business School","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"HealthCentral","permalink":"healthcentral","type_of_entity":"company","image":{"available_sizes":[[[150,20],"assets/images/resized/0000/3343/3343v3-max-150x150.jpg"],[[250,33],"assets/images/resized/0000/3343/3343v3-max-250x250.jpg"],[[300,40],"assets/images/resized/0000/3343/3343v3-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Head of Business Development, Treasurer","firm":{"name":"The Washington Post Company","permalink":"the-washington-post-company","type_of_entity":"company","image":{"available_sizes":[[[150,32],"assets/images/resized/0002/1660/21660v1-max-150x150.png"],[[250,53],"assets/images/resized/0002/1660/21660v1-max-250x250.png"],[[328,70],"assets/images/resized/0002/1660/21660v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}