{"first_name":"Chris","last_name":"Howard","permalink":"chris-howard-3","crunchbase_url":"http://www.crunchbase.com/person/chris-howard-3","homepage_url":"http://www.libboo.com/chrishoward","birthplace":"Reading, UK","twitter_username":"iamtheoptimist","blog_url":"http://www.iamanoptimist.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed May 23 03:59:09 UTC 2012","updated_at":"Thu May 24 14:20:25 UTC 2012","overview":"<p>Chris was previously a semi-successful music producer from London, UK working for some of the biggest labels and bands in the day. After hitting the music industry&#8217;s &#8216;golden age&#8217; of 26, Chris decided to take a career pivot and moved on to gain a PhD in computational physics from the University of Reading.</p>\n\n<p>In 2009, Chris moved to the Massachusetts Institute of Technology to work alongside MIT and a partner charity - Molecular Frontiers - to understand how online social influence can be used to better the uptake of science by the younger generations. </p>\n\n<p>In 2010, Chris was offered the Head Teaching Fellow position for Physical Sciences at Harvard University. It was during this time that Chris was caught with the entrepreneurial bug. </p>\n\n<p>After much soul-searching, Chris went back to the reasons he failed as a music producer whereby it became obvious that due to the changes in the publishing industry, authors are now the new musicians. This spurred the creation of Libboo.com whereby Chris and his team have taken Libboo from a hobby back in early 2011, to one of the most celebrated young companies in Boston, MA - gaining entrance to the prestigious MassChallenge and Techstars accelerators, as well as being supported by some of the most influential media-based investors in the north-east USA.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0019/1144/191144v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0019/1144/191144v2-max-250x250.jpg"],[[450,450],"assets/images/resized/0019/1144/191144v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}