{"first_name":"Christopher","last_name":"Walker","permalink":"christopher-walker","crunchbase_url":"http://www.crunchbase.com/person/christopher-walker","homepage_url":"http://www.salonsOPEN.com","birthplace":"","twitter_username":"cmwalker25","blog_url":"http://www.salonsOPEN.com/blog/","blog_feed_url":"http://www.salonsOPEN.com/blog/feed/","affiliation_name":"Salon Marketing Network LLC","born_year":null,"born_month":null,"born_day":null,"tag_list":"salon, hair-salon, stylist, hair-stylist, marketing, spa","alias_list":null,"created_at":"Wed Apr 18 17:48:15 UTC 2012","updated_at":"Tue Apr 24 09:35:43 UTC 2012","overview":"<p>Christoper Morrell Walker is a seasoned IT executive with an extensive and diverse background in technological innovations for small to medium sized businesses. In his 10+ years of experience, he has worked as an IT Director for a college, but has worked as a analytical specialist with the ability to assess a problem and come up with the most conducive solution. With a strong background in Informations Systems and ability to problem solve, he has become one of the brightest minds in the Atlanta area that people come to when there is problem in integrating an IT Solution or just developing better processes for complex redundancy issues.</p>\n\n<p>He handled the role as IT Director &amp; Technology Strategies for a local College in charge of being a liaison between IT and Academics. In this role, he was in charge of listening to the problems of Academics to find the best solution to their problems. He quickly built a reputation around the College as the person who was able to listen to problems, communicate without the technical lingo, and provide a solution to make jobs easier and more efficient. After solutions were implemented, he was in charge of training the staff in implementing the new solution so that the process was seamless.</p>\n\n<p>He currently owns a marketing company, Salon Marketing Network LLC, in charge of providing unique services for the salon industry to market their services and products online to millions of customers. By utilizing his web applications/development skills in the latest Object Oriented Programming languages, he was able to become one of the top companies in providing salons with a unique platform to have their services &amp; products in front of potential clients. And this company continues to grow as he moves forward with mobile applications and location based applications development.  And now, he has founded SalonsOPEN.com, the salon industry&#8217;s client-centric platform for reserving clients, retaining clients, and rewarding clients.</p>\n\n<p>Specialties\nWeb Application, Development, Mobile Applications, Problem Solver Through Technology, IT Liaison, Branding, Marketing, PHP, MySQL, C, C++, JSON, JavaScript, JQuery, SQL</p>","image":null,"degrees":[{"degree_type":"BS","subject":"Computer Information Systems","institution":"DeVry Institute of Technology","graduated_year":2002,"graduated_month":null,"graduated_day":null},{"degree_type":"MS","subject":"Technology","institution":"Troy University","graduated_year":2008,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO/Founder","firm":{"name":"SalonsOPEN.com","permalink":"salonsopen-com","type_of_entity":"company","image":null}},{"is_past":true,"title":"CEO/Founder","firm":{"name":"Salon Marketing Network LLC","permalink":"salon-marketing-network-llc","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.salonsOPEN.com","title":"SalonsOPEN.com"}]}