{"first_name":"Christopher","last_name":"Celeste","permalink":"christopher-celeste","crunchbase_url":"http://www.crunchbase.com/person/christopher-celeste","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Hatch Partners, LLC","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Aug 19 16:15:08 UTC 2012","updated_at":"Thu Sep 06 21:21:01 UTC 2012","overview":"<p>Christopher is a Partner with Hatch Partners, an organization that helps entrepreneurs bring ideas to market by offering coaching, connections, and capital.  He is also CEO of Tackk, a company whose mission is to empower everyone with the ability to instantly create, publish and share beautiful content on the web. </p>\n\n<p>Christopher Celeste has spent more than twenty years catalyzing ideas in politics, marketing and business.</p>\n\n<p>Born in New Delhi, India and raised in a large political family in Ohio, Christopher grew up in and around political campaigns. After graduating with honors from Stanford University in 1988, Christopher returned to Ohio and helped to found and lead Participation 2000, a non-traditional political action committee designed to train young organizers. Christopher’s afﬁnity for “campaigns” took him from politics to advertising where he spent ﬁfteen years in various marketing agencies, eventually serving as president of several ﬁrms including Resource (www.resource.com), a national technology marketing ﬁrm, where he managed ofﬁces in Columbus and San Francisco. During this period Christopher played a key role in the e-commerce launch and web fashion show for Victoria’s Secret that garnered international attention and was named ADWEEK’s Marketing Event of the Year. </p>\n\n<p>In 2004, Christopher became a Founder &amp; the first President of FindawayWorld, whose core product is Playaway, the world’s ﬁrst preloaded digital audio book format (www.playaway.com). Called a “genius idea” by Oprah Magazine and the “simplest way to get from the bookstore to Chapter One” by the New York Times, Christopher helped to lead Findaway from a start-up idea to a profitable, Inc 500 success. </p>\n\n<p>In 2010, after selling his interest in Findaway, Christopher shifted his attention to Hatch, whose mission is to provide coaching, connections &amp; capital to early-stage entrepreneurs.</p>\n\n<p>Christopher and his wife – fellow entrepreneur Nancy Kramer – have six children between them. While Christopher serves on several boards, he spends most of his free time with family, writing about leadership or helping friends and fellow entrepreneurs catalyze new ideas.</p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0020/9678/209678v2-max-150x150.jpg"],[[250,165],"assets/images/resized/0020/9678/209678v2-max-250x250.jpg"],[[450,297],"assets/images/resized/0020/9678/209678v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"Political Science","institution":"Stanford University","graduated_year":1988,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Tackk","permalink":"tackk","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0020/8551/208551v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0020/8551/208551v2-max-250x250.jpg"],[[373,373],"assets/images/resized/0020/8551/208551v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Principal","firm":{"name":"Hatch Partners, LLC","permalink":"hatch-partners-llc","type_of_entity":"financial_org","image":{"available_sizes":[[[108,29],"assets/images/resized/0020/7334/207334v2-max-150x150.png"],[[108,29],"assets/images/resized/0020/7334/207334v2-max-250x250.png"],[[108,29],"assets/images/resized/0020/7334/207334v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}