{"first_name":"Chris","last_name":"Painter","permalink":"chris-painter","crunchbase_url":"http://www.crunchbase.com/person/chris-painter","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"US Government","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Thu Aug 25 18:06:22 UTC 2011","updated_at":"Thu Aug 25 18:08:48 UTC 2011","overview":"<p>Chris Painter has been on the vanguard of cyber issues for twenty years. Most recently, he served in the White House as Senior Director for Cybersecurity Policy in the National Security Staff. During his two years at the White House, Painter was a senior member of the team that conducted the President&#8217;s Cyberspace Policy Review and subsequently served as Acting Cybersecurity Coordinator. He coordinated the development of a forthcoming international strategy for cyberspace and chaired high-level interagency groups devoted to international and other cyber issues.</p>\n\n<p>Chris Painter began his federal career as an Assistant U.S. Attorney in Los Angeles where he led some of the most high profile and significant cybercrime prosecutions in the country, including the prosecution of notorious computer hacker Kevin Mitnick. He subsequently helped lead the case and policy efforts of the Computer Crime and Intellectual Property Section in the U.S. Department of Justice and served, for a short time, as Deputy Assistant Director of the F.B.I.&#8217;s Cyber Division. For over ten years, he has been a leader in international cyber issues. He has represented the United States in numerous international fora, including Chairing the cutting edge G8 High Tech Crime Subgroup since 2002. He has worked with dozens of foreign governments in bi-lateral meetings and has been a frequent spokesperson and presenter on cyber issues around the globe. He is a graduate of Stanford Law School and Cornell University.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0015/1112/151112v1-max-150x150.jpg"],[[200,250],"assets/images/resized/0015/1112/151112v1-max-250x250.jpg"],[[200,250],"assets/images/resized/0015/1112/151112v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"","subject":"","institution":"Cornell University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"J.D.","subject":"","institution":"Stanford University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Coordinator of Cyber Issues","firm":{"name":"U.S. Department of State","permalink":"u-s-department-of-state-2","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"<iframe width=\"420\" height=\"345\" src=\"http://www.youtube.com/embed/9Aw9Ku2yaDM\" frameborder=\"0\" allowfullscreen></iframe>","description":""}],"external_links":[],"web_presences":[]}