{"first_name":"Christopher","last_name":"Pommerening","permalink":"christopher-pommerening","crunchbase_url":"http://www.crunchbase.com/person/christopher-pommerening","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Feb 23 03:16:38 UTC 2008","updated_at":"Fri Apr 10 16:20:57 UTC 2009","overview":"<p>Christopher Pommerening started his professional career in Spain in 1998 co-founding AutoScout24 Spain S.A. as CEO and member of the Board of Directors. Autoscout24 is part of the Scout24 Group, Europe’s leading operator of virtual market places. Christopher was appointed Managing Director of Scout24 Spain in 2001. While preparing the internationalisation of the Scout24 Group, he also set up B24 Networks, a Europe wide market place on the internet for the yachting sector. </p>\n\n<p>In 2002 he decided to devote himself full time to venture capital and entrepreneurship through his already established venture catalyst company VCMORE GmbH by offering consulting services and investment to start-ups through a network of business angels. Over the years he has established a wide contact network in Europe and in the US for consultants, business angels and industry specialists. Alongside the latter, in 2002, he co-started the Spanish chapter of the Entrepreneurs Organisation (EO) being one of the largest entrepreneur organisations in the world, and in the same year he co-founded ACP - Active Capital Partners, one of Europe’s few entrepreneurial driven Venture Capital companies. </p>\n\n<p>In 2006 He has been elected to be the Ambassador for EO Europe &amp; Africa, in order to grow the organisation in 10 different countries. In 2007 Christopher co-founded Linqia, the first aggregator and vertical search engine for online communities and groups. </p>\n\n<p>Currently he is Managing Partner of ACP - Active Capital Partners, member of the Board of Directors of Vinus &amp; Brindis and Polymita Technologies, member of the Advisory Board of BuyVIP, Non Executive Chairman of Linqia, member of the Venture Committee of ASCRI and Advisor to Gild International. </p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0004/0570/40570v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0004/0570/40570v2-max-250x250.jpg"],[[220,331],"assets/images/resized/0004/0570/40570v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder","firm":{"name":"Foundum","permalink":"foundum","type_of_entity":"company","image":{"available_sizes":[[[150,40],"assets/images/resized/0019/9919/199919v2-max-150x150.jpg"],[[250,67],"assets/images/resized/0019/9919/199919v2-max-250x250.jpg"],[[450,121],"assets/images/resized/0019/9919/199919v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Business Angel","firm":{"name":"Starfish Community Group","permalink":"starfish-community-group","type_of_entity":"company","image":{"available_sizes":[[[150,111],"assets/images/resized/0001/3344/13344v4-max-150x150.jpg"],[[250,186],"assets/images/resized/0001/3344/13344v4-max-250x250.jpg"],[[450,335],"assets/images/resized/0001/3344/13344v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}