{"first_name":"Chris","last_name":"Carlson","permalink":"chris-carlson","crunchbase_url":"http://www.crunchbase.com/person/chris-carlson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri May 07 16:52:04 UTC 2010","updated_at":"Fri Jul 29 12:08:02 UTC 2011","overview":"<p>A University of Michigan alum, Chris Carlson comes to Tap Me with extensive experience in bridging the gap between sales and product/technology, successfully generating revenue for several high profile media and technology companies. Chris, an industry veteran, brings a diverse direct-response and branding background, spanning almost all of the digital ad platforms including: eCommerce, search, ad networks, content sites, and social networking.\nPrior to joining Tap Me, Chris served as Vice President of Central Sales for MySpace where he lead his team to consecutive years of revenue growth, consistently exceeding their sales quotas. Chris also originated the creation of a cross-functional taskforce that helped improve advertising program development, packaging, and sales. Chris served as Midwest Sales Director for Advertising.com, a division of AOL. Here he established the first joint selling efforts in Midwest between AOL and Advertising.com, orchestrating multiple successful integrated deals with such major Fortune 500 companies such as McDonald’s, State Farm, Dell, JCPenney, and many others. In addition to doubling revenue under his leadership, his work also led to the largest sale in the Midwest market in company history.\nFrom 2002-2006, Chris was Director of Direct Marketing Solutions at IAC Advertising Solutions (formerly Ask Jeeves). There he headed sales and development of new products and technology, including the negotiation and supervision of outside technology partnerships, and the creation of new internal reporting and forecasting systems.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP of Product, Co-Founder","firm":{"name":"Tap.Me","permalink":"metamoorephosis-games","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0006/2547/62547v12-max-150x150.png"],[[250,250],"assets/images/resized/0006/2547/62547v12-max-250x250.png"],[[450,450],"assets/images/resized/0006/2547/62547v12-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}