{"first_name":"Chris","last_name":"Nawn","permalink":"chris-nawn","crunchbase_url":"http://www.crunchbase.com/person/chris-nawn","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Integral Capital Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed May 14 06:54:39 UTC 2008","updated_at":"Thu May 15 22:47:52 UTC 2008","overview":"<p>Chris joined Integral as a Managing Director in 2007. Chris has over twenty-years of experience investing in technology companies in both the private and public capital markets. Chris contributes to Integral’s management of both its publicly traded and privately held technology portfolios. Prior to Integral, Chris founded and was Portfolio Manger of Proteus Capital from 2003 to early 2007. Prior to founding Proteus, he successfully managed a $100 million technology hedge fund for Technology Crossover Ventures (TCV) in Palo Alto, California where he also assembled a four person investment team from scratch. Before joining TCV Chris was with Warburg, Pincus in New York, a global leader in the Venture Capital industry, where he was a senior member of the Emerging Growth Group and a Portfolio Manager of the $240 million Warburg, Pincus Post Venture Capital fund. Prior to Warburg, he was the Technology and Telecommunications Sector Manager at The Dreyfus Corporation and a senior Analyst at Weiss, Peck and Greer. Chris started out as a Senior Analyst at Texas Commerce Bank and as an Analyst at America General. He earned a B.A. from the Colorado College and an M.B.A. from the University of Texas in Arlington.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Integral Capital Partners","permalink":"integral-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[115,150],"assets/images/resized/0001/7358/17358v3-max-150x150.jpg"],[[120,156],"assets/images/resized/0001/7358/17358v3-max-250x250.jpg"],[[120,156],"assets/images/resized/0001/7358/17358v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}