{"first_name":"Chris","last_name":"McArdle","permalink":"chris-mcardle","crunchbase_url":"http://www.crunchbase.com/person/chris-mcardle","homepage_url":"","birthplace":"Bethesda, MA","twitter_username":"cjmcardle","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1971,"born_month":3,"born_day":1,"tag_list":"","alias_list":null,"created_at":"Fri Aug 13 18:23:39 UTC 2010","updated_at":"Fri Aug 13 19:25:31 UTC 2010","overview":"<p>Chris McArdle is at the forefront of the interactive markets industry helping a wide range of clients receive, decipher and act upon intelligence when they need it most – at the moment of interaction with prospects and customers.  Chris is expert in online lead generation driving customer acquisition and retention best practices in verification, scoring, and analytics for some of the most recognized and valuable online brands.</p>\n\n<p>Prior to joining TARGUSinfo Chris was the Director of Strategic Initiatives for Patton Boggs, the world’s leading lobbying group and an AMLAW 100 law firm.  He was engaged in strategic efforts to grow the client base and led the firm’s efforts to grow its global footprint.  Before joining Patton Boggs, Chris was the Senior Director of New Business Development and Marketing for The Advisory Board Company.  In that role, he conducted market research, led market sizing, and did financial analysis ultimately leading to the launch of several business lines.  McArdle was also the Director of Strategic Planning and New Business Development at Toys R Us and was a consultant for leadership guru Noel Tichy’s firm.  He began his career at Ford Motor Company, where he held roles within the marketing and sales division in posts across the country including Sales Development Manager for the Washington, D.C. Region.  </p>\n\n<p>He has a BSBA from Georgetown University and an MBA from the University of Michigan Business School in Ann Arbor, MI.</p>","image":{"available_sizes":[[[116,150],"assets/images/resized/0009/7594/97594v2-max-150x150.jpg"],[[193,250],"assets/images/resized/0009/7594/97594v2-max-250x250.jpg"],[[348,450],"assets/images/resized/0009/7594/97594v2-max-450x450.jpg"]],"attribution":"<p>TARGUSinfo</p>"},"degrees":[{"degree_type":"MBA","subject":"","institution":"University of Michigan Business School","graduated_year":2002,"graduated_month":null,"graduated_day":null},{"degree_type":"BS","subject":"Bachelor of Science in Marketing and International Business","institution":"Georgetown University","graduated_year":1993,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/christopherjohnmcardle","title":"LinkedIn"},{"external_url":"http://twitter.com/cjmcardle","title":"Twitter"}]}