{"first_name":"Christopher","last_name":"Darby","permalink":"christopher-darby","crunchbase_url":"http://www.crunchbase.com/person/christopher-darby","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue May 19 10:23:03 UTC 2009","updated_at":"Tue May 19 10:24:34 UTC 2009","overview":"<p>Mr. Chris Darby is President and CEO of In-Q-Tel, the independent strategic investment firm that identifies innovative technologies to support the missions of the Central Intelligence Agency and the broader Intelligence Community. He joined In-Q-Tel in September 2006. Mr. Darby was previously Vice President and General Manager at Intel overseeing their Middleware Products Division. At Intel, Mr. Darby had responsibility for the Corporation&#8217;s Infrastructure Software business including Open Source and Commercial Products. He joined Intel in August 2005 with the acquisition of Sarvega Inc. Mr. Darby had been the president &amp; CEO of Sarvega, a venture backed supplier of XML Networking and Security products.</p>\n\n<p>Prior to Sarvega, Mr. Darby was the Chairman and CEO of @stake, the well-known internet security consulting firm ultimately acquired by Symantec (SYMC). While at @stake, he assembled the world&#8217;s leading collection of security researchers and built a business that spanned North America and Europe.</p>\n\n<p>Before @stake, Mr. Darby served as President and CEO of Interpath Communications, a facilities-based ASP later acquired by US Internetworking (USIX). Mr. Darby also held several executive positions at Digital Equipment Corporation (now Hewlett-Packard) with responsibility for telecom industry initiatives, corporate strategy, and alliances. He began his career at Northern Telecom (now Nortel Networks) and Bell Northern Research</p>","image":null,"degrees":[{"degree_type":"Graduated","subject":"","institution":"University of Western Ontario","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President and CEO","firm":{"name":"In-Q-Tel","permalink":"in-q-tel","type_of_entity":"financial_org","image":{"available_sizes":[[[125,91],"assets/images/resized/0002/9271/29271v1-max-150x150.png"],[[125,91],"assets/images/resized/0002/9271/29271v1-max-250x250.png"],[[125,91],"assets/images/resized/0002/9271/29271v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}