{"first_name":"Christian","last_name":"Lenk","permalink":"christian-lenk","crunchbase_url":"http://www.crunchbase.com/person/christian-lenk","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 22 16:33:57 UTC 2009","updated_at":"Mon Jun 22 16:35:36 UTC 2009","overview":"<p>Christian Lenk (born 1980) finished 2003 its teaching as a banker at Deutsche Bank Private and Business AG. Then he began studying business administration at the University of Leipzig, with a focus on &#8220;banking&#8221; and &#8220;marketing&#8221; in particular in the field of business evaluation and business planning. </p>\n\n<p>Practical experience gained Mr. Lenk already during his studies as a student at the S-holdings in the area of investment management. As part of his thesis &#8220;Risk management for private equity investors on the S-stakes example of Sparkasse Leipzig, he developed a concept for implementation in the new equity valuation and risk control system. </p>\n\n<p>After his graduation in October 2008 started when Mr. Lenk S-holdings as a speaker for the investment management. In cooperation with the subsidiary Saxess AG he integrated the tool &#8220;Raven&#8221; for risk assessment. Since April 2009, Mr. Lenk as equity managers, especially in early stage financing to take action.</p>\n\n<p>[ORIGINAL TEXT] Christian Lenk (geb. 1980) beendete 2003 seine Lehre zum Bankkaufmann in der Deutschen Bank Privat- und Geschäftskunden AG. Danach begann er ein Studium der Betriebswirtschaftslehre an der Universität Leipzig mit den Schwerpunkten „Bankwesen“ sowie „Marketing“ insbesondere im Bereich Gründerevaluation und Businessplanung.</p>\n\n<p>Praxiserfahrung sammelte Herr Lenk während seines Studiums bereits als Werkstudent bei den S-Beteiligungen im Bereich Beteiligungsmanagement. Im Rahmen seiner Diplomarbeit „Risikomanagement für Private Equity Investoren am Beispiel S-Beteiligungen der Sparkasse Leipzig“ erarbeitete er ein Konzept zur Implementierung in das neue Beteiligungsbewertungs- und Risikocontrollingsystem.</p>\n\n<p>Nach seinem Studienabschluss im Oktober 2008 startete Herr Lenk bei den S-Beteiligungen als Referent für das Beteiligungsmanagement . In Zusammenarbeit mit dem Tochterunternehmen Saxess AG integrierte er das Tool &#8220;RaBe&#8221; zur Risikobewertung . Seit April 2009 ist Herr Lenk als Beteiligungsmanager, vor allem im Bereich Frühphasenfinanzierung, tätig.</p>","image":{"available_sizes":[[[90,120],"assets/images/resized/0005/0147/50147v1-max-150x150.png"],[[90,120],"assets/images/resized/0005/0147/50147v1-max-250x250.png"],[[90,120],"assets/images/resized/0005/0147/50147v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Technologiegruenderfonds Sachsen","permalink":"technologiegrnderfonds-sachsen","type_of_entity":"financial_org","image":{"available_sizes":[[[150,74],"assets/images/resized/0005/0139/50139v2-max-150x150.jpg"],[[232,115],"assets/images/resized/0005/0139/50139v2-max-250x250.jpg"],[[232,115],"assets/images/resized/0005/0139/50139v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}