{"first_name":"Chris","last_name":"Donahue","permalink":"chris-donahue-2","crunchbase_url":"http://www.crunchbase.com/person/chris-donahue-2","homepage_url":"","birthplace":"Manchester, Conn, US","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 14 17:19:24 UTC 2012","updated_at":"Thu Nov 22 04:25:18 UTC 2012","overview":"<p>Chris has nearly 25 years of experience in the video game, hardware and software, Internet, and Cloud Gaming industries, and is a seasoned veteran in leading start-ups, growing small to mid-size technology firms, as well as managing successful programs at Fortune 500 companies.</p>\n\n<p>As Vice President of Marketing and Publisher Relations at CiiNOW, Chris is responsible for designing and driving all consumer marketing and strategic content acquisition initiatives. </p>\n\n<p>Prior to joining the CiiNOW team, Chris was Director of Games and Media at OnLive, Inc. where he secured and managed game publisher and game developer relationships. Previous to OnLive, Chris was President of the SparkWorkz online division at inXile entertainment, and prior to that, was SVP of Marketing and Business Development at Live Gamer, Inc. Chris held the position of Director and Group Manager of Games and Graphics for Windows at Microsoft Corporation, where he played the primary role in defining and developing the Windows game platform strategy and program. Chris has also held leadership roles in Developer Relations at NVIDIA Corporation and ATI Research, Inc., and was Executive Producer at The ImagiNation Network and Sierra On-Line. </p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0022/0407/220407v2-max-150x150.jpg"],[[178,250],"assets/images/resized/0022/0407/220407v2-max-250x250.jpg"],[[321,450],"assets/images/resized/0022/0407/220407v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}