{"first_name":"Christian","last_name":"Rood","permalink":"christian-rood","crunchbase_url":"http://www.crunchbase.com/person/christian-rood","homepage_url":"http://www.roadtovalue.com","birthplace":"Utrecht","twitter_username":"RoadtoValue","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1973,"born_month":5,"born_day":1,"tag_list":"","alias_list":null,"created_at":"Tue Aug 21 08:40:34 UTC 2012","updated_at":"Thu Aug 23 18:32:43 UTC 2012","overview":"<p>Christian founded Road to Value B.V. in Jan 2009. Christian is well experienced in the process of value creation. Before he founded Road to Value, he was an investment manager for KRC Capital, a private equity fund in the fashion, leisure, and real estate industries, owned by the family office of Mr. Kul Rattan Chadha, founder of MEXX. Key responsibilities included the acquisition of stakes in mid market companies, development of investments, turn arounds, and disposals of stakes, as well as the judgement of new investment opportunities. Furthermore, Christian helped to establish Spaces, a chain of modern multi tenant office buildings.</p>\n\n<p>From 2000-2006, Christian was an investment banker for ABN AMRO Bank in the healthcare industry, specializing in Medical Technology and Healthcare Services in Europe and in the U.S. In that role, Christian originated and executed merger &amp; acquisition transactions and related financing for both strategic buyers and private equity funds.</p>\n\n<p>From 1998-2000, Christian was a strategy consultant with Coopers &amp; Lybrand, focusing on finance and strategy and value based management, advising clients such as Schiphol Airport, Randstad Holding, Schuitema on value creation. </p>\n\n<p>Christian holds a MSc. degree in business administration from the Rotterdam School of Management,  and a BSc. degree in industrial management from the Technische Hogeschool Rijswijk, and attended the PED program of IMD in Switzerland.</p>","image":{"available_sizes":[[[92,92],"assets/images/resized/0020/7170/207170v2-max-150x150.jpg"],[[92,92],"assets/images/resized/0020/7170/207170v2-max-250x250.jpg"],[[92,92],"assets/images/resized/0020/7170/207170v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/profile/view?id=1383573&trk=tab_pro","title":"Linkedin"},{"external_url":"https://twitter.com/RoadtoValue","title":"Twitter"}]}