{"first_name":"Chuck","last_name":"Taylor","permalink":"chuck-taylor","crunchbase_url":"http://www.crunchbase.com/person/chuck-taylor","homepage_url":"","birthplace":"","twitter_username":"chuck_taylor","blog_url":"","blog_feed_url":"","affiliation_name":"Affinity Circles","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Wed Aug 08 05:05:41 UTC 2007","updated_at":"Tue Jul 12 16:56:22 UTC 2011","overview":"<p>In May 2011, Mr. Taylor sold Doostang to Universum Group (www.universumglobal.com), based on Stockholm, Sweden.  Founded in 1988, Universum is the global leader in Employer Branding research, consulting, and media productions.   Post acquisition, he was is assisting Universum with the integration of Doostang and leading the development of a broader digital strategy for the parent company. </p>\n\n<p>Mr. Taylor is an accomplished executive with over 15 years of success in leading organizational transformation, business development, and product development initiatives for emerging technology companies. A passionate, decisive executive known for his entrepreneurial spirit and track record of growing revenue, he has enjoyed a consistent series of business development opportunities with emerging and growth stage companies.</p>\n\n<p>Mr. Taylor started his career as an effective Operations Manager with Proctor &amp; Gamble and quickly gained the skills and experience necessary to provide strategic management consulting for a wide range of companies in telecommunications, automotive manufacturing, financial services, and healthcare industries. He quickly demonstrated his exceptional business leadership and discipline by turning around an unprofitable telecommunications company to gain a 67% increase in capacity. In addition, Mr. Taylor leveraged his strategic foresight to identify M&amp;A targets and develop post-merger branding strategies for a regional health insurer.</p>\n\n<p>Capitalizing on his business development expertise, Mr. Taylor joined Progressive Insurance and took the nation’s 7th largest marine insurer to the 3rd largest with more than $7.5B in insured assets and $165M P&amp;L. He again demonstrated his exceptional business acumen and market insight. Mr. Taylor forged strategic marketing partnerships with organizations including ESPN and became the exclusive sponsor of the nation’s top fishing tournament series, ESPN Bass Masters, driving company awareness and further business growth.</p>\n\n<p>Mr. Taylor then took advantage of the opportunity to direct product marketing and manage P&amp;L for Yahoo!’s $100M+ property, HotJobs. He introduced and evangelized a patent-pending product that positioned HotJobs as a leader in the industry. </p>\n\n<p>The expertise he gained in the job marketing industry led to his next role as Vice President of Marketing and Business Development for Affinity Circles, the leading provider of white label communities for college alumni associations seeking to promote career advancement opportunities among its 140+ communities with more than 15M members worldwide. Here he captured business with reputable employers such as Google, Merrill Lynch, and Oracle, and was quoted as an industry expert in Fortune, Business Week, the New York Times, and the Wall Street Journal.</p>\n\n<p>Today, Mr. Taylor is the CEO of Doostang, an exclusive, web-based career network for elite young professionals founded at Stanford and MIT and featured in the New York Times, the Wall Street Journal, Forbes, Time, and U.S. News and World Report. Here, Mr. Taylor has transformed the entire organization, created a new business model, renegotiated marketing partnerships, and restructured the staff. In less than 15 months, he took the company from losing $300K a month to consistent profitability and raised over $1M in venture capital.</p>\n\n<p>Mr. Taylor has a Harvard MBA and both Master’s and Bachelor’s degrees from Cornell University. He is an active Career Development Officer for the Harvard Business School Association of Northern California.  </p>\n\n<p>Throughout his professional career, Mr. Taylor has exemplified the highest level of integrity, professionalism, and entrepreneurial spirit. He has consistently attracted, developed, and retained the leading talent in each of the industries he has provided leadership in. His commitment to his corporate responsibilities as a Chief Executive Officer, as well as his clients’ objectives, has served to enhance his business success and the achievement of business goals. Mr. Taylor is known as an engaging leader, adept strategist, disciplined entrepreneur, and creative business developer. After witnessing and thriving in a wide range of market environments, Mr. Taylor possesses the humility, wisdom, insight, and skill-set to establish and lead profit centers, maximize resources, and develop synergistic, highly motivated, and qualified teams.</p>","image":{"available_sizes":[[[131,150],"assets/images/resized/0001/5869/15869v3-max-150x150.jpg"],[[211,240],"assets/images/resized/0001/5869/15869v3-max-250x250.jpg"],[[211,240],"assets/images/resized/0001/5869/15869v3-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Revenue Officer","firm":{"name":"Oodle","permalink":"oodle","type_of_entity":"company","image":{"available_sizes":[[[150,64],"assets/images/resized/0000/3559/3559v2-max-150x150.png"],[[197,85],"assets/images/resized/0000/3559/3559v2-max-250x250.png"],[[197,85],"assets/images/resized/0000/3559/3559v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/chuckinator","title":"LinkedIn Profile"}]}