{"first_name":"Chuck","last_name":"Johnson","permalink":"chuck-johnson-2","crunchbase_url":"http://www.crunchbase.com/person/chuck-johnson-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon May 18 08:26:25 UTC 2009","updated_at":"Mon May 18 08:27:05 UTC 2009","overview":"<p>Chuck Johnson joined NMP in 1993 and primarily focuses his investment activities on technology and software companies. Currently, Chuck oversees NMP’s investments in Gateway One Leasing &amp; Finance, Dealer Services, NewsStand, EG Technology, Jacket Micro Devices, Relativity, nGimat and Engineous. He has previously led NMP investments such as Firethorn (acquired by Qualcomm), Employease (acquired by ADP), Synchrologic (acquired by Intellisync/Nokia) and Talus (acquired by Manugistics).</p>\n\n<p>Prior to NMP, Chuck was a co-founder and CEO of Sales Technologies, a start-up software company that became the most successful investment made by NMP’s first fund. Sales Technologies automated complex sales functions for major corporations through the use of the company’s proprietary software. Chuck oversaw the company’s development from the inception stage to over\n$50 million in revenue in eight years, eventually consummating a successful acquisition by Dun &amp; Bradstreet in 1989, after which Chuck continued in the role of CEO for several additional years.</p>\n\n<p>Prior to founding Sales Technologies, Chuck was a management consultant with McKinsey &amp; Company and previously held several marketing and sales management positions with Procter &amp; Gamble. Chuck has held leadership roles in several entrepreneurial organizations, including Chairman of the Technology Association of Georgia and Chairman of the Georgia Tech Forum. Chuck received a BA from Duke University.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0004/4383/44383v1-max-150x150.png"],[[200,250],"assets/images/resized/0004/4383/44383v1-max-250x250.png"],[[200,250],"assets/images/resized/0004/4383/44383v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Noro-Moseley Partners","permalink":"noro-moseley-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,75],"assets/images/resized/0004/2736/42736v2-max-150x150.png"],[[156,79],"assets/images/resized/0004/2736/42736v2-max-250x250.png"],[[156,79],"assets/images/resized/0004/2736/42736v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}