{"first_name":"Chuck","last_name":"Cullen","permalink":"chuck-cullen-2","crunchbase_url":"http://www.crunchbase.com/person/chuck-cullen-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Grotech Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Nov 17 09:16:44 UTC 2008","updated_at":"Wed Jun 29 14:11:18 UTC 2011","overview":"<p>Chuck Cullen joined Grotech Ventures in 2000 and is a General Partner and Grotech Ventures’s Chief Financial Officer. Chuck is responsible for all financial, accounting and administrative functions for the Grotech Ventures funds and works on selected investments. Chuck’s investment activities focus on technology-leveraged services, e-commerce and healthcare IT. Chuck is active on several portfolio company boards, including buySAFE, Biotix Inc, and OpenQ. He previously served on the boards of MEDecision (Nasdaq: MEDE), Brandywine Senior Care, Entek and Sagittarius Brands (holding company for Captain D’s and Del Taco restaurants). He has also worked closely with management at HealthScribe, First Service Networks and SimonDelivers.</p>\n\n<p>Prior to joining Grotech Ventures, Chuck served as the Chief Financial and Administrative Officer of Avatech Solutions, Inc., an IT solutions provider serving the design automation market. Prior to Avatech, he was the Director of Finance for Packaging Resources, Inc., a $125 million plastic packaging manufacturer. He previously worked as a management consultant on Fortune 500 engagements for A.T. Kearney, Inc., practiced law with Hogan and Hartson and began his career in public accounting as a CPA with Ernst &amp; Young.</p>\n\n<p>Chuck received a Bachelor of Business Administration in Accounting (Magna Cum Laude) from Loyola College. He received his Juris Doctor (Magna Cum Laude/Notre Dame Law Review) from the University of Notre Dame Law School and his Master of Business Administration (Beta Gamma Sigma) from the Kellogg Graduate School of Management at Northwestern University. Chuck is a past member of the Maryland State Bar Association and the Maryland Association of Certified Public Accountants. He currently serves on the board of Mount Saint Joseph High School.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0014/1741/141741v2-max-150x150.jpg"],[[200,250],"assets/images/resized/0014/1741/141741v2-max-250x250.jpg"],[[360,450],"assets/images/resized/0014/1741/141741v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner and CFO","firm":{"name":"Grotech Ventures","permalink":"grotech-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,78],"assets/images/resized/0002/9090/29090v1-max-150x150.png"],[[167,87],"assets/images/resized/0002/9090/29090v1-max-250x250.png"],[[167,87],"assets/images/resized/0002/9090/29090v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Director","firm":{"name":"OpenQ","permalink":"openq","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0014/4282/144282v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0014/4282/144282v2-max-250x250.jpg"],[[256,256],"assets/images/resized/0014/4282/144282v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}