{"first_name":"Chuck","last_name":"Sacco","permalink":"chuck-sacco","crunchbase_url":"http://www.crunchbase.com/person/chuck-sacco","homepage_url":"http://www.chucksacco.com","birthplace":"","twitter_username":null,"blog_url":"http://phindme.blogspot.com/","blog_feed_url":"http://phindme.blogspot.com/feeds/posts/default?alt=rss","affiliation_name":"PhindMe","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jun 23 18:54:57 UTC 2008","updated_at":"Sun Aug 10 16:46:18 UTC 2008","overview":"<p>Chuck leads PhindMe, having previously held operational and executive leadership roles in the fields of enterprise software, business process management, and mobile application development. Prior to PhindMe he was a General Manager at SoftBrands, an international ERP, CRM, and BPM company in the manufacturing, distribution, and hospitality industries.</p>\n\n<p>PhindMe is Chuck’s second startup, previously helping launch a technology consulting business. He led the consulting and client development operations of that self-funded startup before the business was successfully sold to a public software company.</p>\n\n<p>Chuck’s has specific expertise in selling and implementing technology platforms with small and mid-sized companies, helping them improve their bottom line through the effective use of technology. He has also led the setup of national and international partner programs, helping local companies leverage local market expertise.</p>\n\n<p>With an MBA in technology management from Drexel University and a Beta Gamma Sigma honoree, Chuck has authored articles and speeches on mobile marketing and business process management.</p>\n\n<p>He recently spoke at Search Marketing Expo Local/Mobile, The Philadelphia-based Innovator&#8217;s Club, the Mobile Content Conference, and the Greater Philadelphia Senior Executive Group discussing how consumers will use mobile technologies in varied ways to interact with local business communities.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"PhindMe Mobile","permalink":"phindme","type_of_entity":"company","image":{"available_sizes":[[[150,33],"assets/images/resized/0002/0847/20847v5-max-150x150.png"],[[250,55],"assets/images/resized/0002/0847/20847v5-max-250x250.png"],[[450,100],"assets/images/resized/0002/0847/20847v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}