{"first_name":"Cindy","last_name":"Guo","permalink":"cindy-guo","crunchbase_url":"http://www.crunchbase.com/person/cindy-guo","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jan 28 21:59:57 UTC 2010","updated_at":"Thu Jan 28 22:01:28 UTC 2010","overview":"<p>Cindy joined Ventech at the end of 2007 and is in charge of investing in chineses start-ups through a dedicated vehicle. Cindy brings her operational experience in innovating companies as well as her high level professional network. </p>\n\n<p>Before joining Ventech Capital China, Cindy GUO keeps leading Ascend Capital Partners, overseeing the venture investment, financial advisory and incubating companies in the industries of Financial Services, TMT, IT, Automobile, Healthcare &amp; Pharmaceutical. All of them are the top leaders in its section, such as UUSEE, Acorn (NYSE: ATV), NVC, Good Media etc.. </p>\n\n<p>Prior to joining Ascend Capital Partners, Cindy was the Vice President at Skystar Corp, a leading Business Intelligence solution provider in China, responsible for Business Development and Investor Relations. She was previously the Director of Marketing and Business Development in Ecantata Ltd, an eProcurement solution provider, and early in her career, she served as Chief Coordinator of Public Affairs at Jiangsu Sunshine Corp (SHEX: 600220). </p>\n\n<p>Cindy received her bachelor degree in Economics from the Central University of Finance &amp; Economics of Beijing. Cindy was granted with series awards in school, including Silver Award at China Mathematics Contest (1993), Silver Award at China Physics Contest (1990), Silver Award at China &#8220;Hua, Luo-Geng&#8221; Mathematics Contest (1988), Gold Award at State Fine Art Festival (1986).</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Ventech","permalink":"ventech-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,150],"assets/images/resized/0002/9792/29792v4-max-150x150.jpg"],[[250,250],"assets/images/resized/0002/9792/29792v4-max-250x250.jpg"],[[450,450],"assets/images/resized/0002/9792/29792v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}