{"first_name":"Cindy","last_name":"Joffrion","permalink":"cindy-joffrion","crunchbase_url":"http://www.crunchbase.com/person/cindy-joffrion","homepage_url":"http://www.cindyjoffrion.org/About__Biography_.html","birthplace":"","twitter_username":"","blog_url":"http://cindyjoffrion.blogspot.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Oct 04 01:48:39 UTC 2012","updated_at":"Sat Oct 20 03:42:21 UTC 2012","overview":"<p>Born and raised in Mexico, Cindy had spent her early years listening to the vivid stories of her father, a prominent police lieutenant. Cindy spent her summers with her grandparents in New Mexico. She vividly remembers listening to the great stories told by her native American friends. Ever since her earliest days, she loved story telling.</p>\n\n<p>Cindy left Mexico in 1987 to attend Northern University in Utah. She studied art, humanities, and literature, as a student at the University. However, she could not escape the allure of storytelling and quickly began studying to become a novelist. She began by reading every chance she had. From classical literature to contemporary novels, Cindy&#8217;s love of storytelling was uncontrollable. Cindy soon sold her television to get enough money to buy a typewriter. Once she began typing, she never stopped.</p>\n\n<p>Cindy left college before earning her degree. She decided to move to Hollywood, where she could study people, and listen to their stories. &#8220;I became a student of life&#8221;, she recalls. A year later, Wendy married a prominent magazine editor and planted her roots in Los Angeles. Wendy then began writing short stories for several magazines. Her first piece was published in National Story Review in 1994.</p>\n\n<p>Her first novel, Eye of the Hurricane, received wide acclaim and earned Cindy several prestigious awards. Since that time, Cindy has penned nearly a dozen novels and historical hardcover books.</p>\n\n<p>Cindy is now working on her first screenplay which is due to be completed early next year. Cindy love of storytelling is infectious&#8221;, said one loyal reader at a recent book signing, &#8220;Once you read one, you have to read all of her books&#8221;.</p>\n\n<p>-Peter Jones\n New MexicoTribune</p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0021/4148/214148v2-max-150x150.jpg"],[[200,132],"assets/images/resized/0021/4148/214148v2-max-250x250.jpg"],[[200,132],"assets/images/resized/0021/4148/214148v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}