{"first_name":"Claire","last_name":"Houry","permalink":"claire-houry","crunchbase_url":"http://www.crunchbase.com/person/claire-houry","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jan 28 10:04:27 UTC 2010","updated_at":"Thu Jan 28 21:56:43 UTC 2010","overview":"<p>Claire joined Ventech as General Partner in 2008. She focuses on Software and Wireless sectors as well as on the Cleantech technologies. Claire brings to Ventech her international investment experience in varied sectors as well as her sector-based expertise in Cleantech. She currently sits on the board of MXP4, BonitaSoft and B-Process. </p>\n\n<p>Claire started her career at Crédit Lyonnais in projects financing activities in France and in the USA. Then she participated in the creation and in the development, between 2000 in 2005, of the Venture capital department of Crédit Lyonnais (which will become Credit Agricole Private Equity), leading the investments in companies as Musiwave (sold to Openwave) or Meiosys (sold to IBM). \nIn 2005 Claire co-funded the Infrastucture fund for AXA Private Equity, investing in the Utilities sector (energy, water, waste) in Europe, more particularly in the renewable energy sector. Claire was at the time board member of companies as Sita Cornwall (integrated waste management project operated by the group Suez Environnement, UK) or Monte Calvello (wind farms developed by the Italian company Tozzi, IT). </p>\n\n<p>Claire is an engineer in electronics (Institut Supérieur d’Electronique de Paris) and graduated of ESSEC. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Ventech","permalink":"ventech-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,150],"assets/images/resized/0002/9792/29792v4-max-150x150.jpg"],[[250,250],"assets/images/resized/0002/9792/29792v4-max-250x250.jpg"],[[450,450],"assets/images/resized/0002/9792/29792v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}