{"first_name":"Claire","last_name":"W. Tucker","permalink":"claire-w-tucker","crunchbase_url":"http://www.crunchbase.com/person/claire-w-tucker","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Feb 20 14:11:36 UTC 2011","updated_at":"Sun Feb 20 14:16:16 UTC 2011","overview":"<p>Ms. Tucker is a senior banking executive with thirty-three years’ experience in the Business Banking field.  Most recently, Ms. Tucker has served as senior vice-president/Metro Markets and city president (Nashville) for FirstBank, a $1.7 billion community bank headquartered in Lexington, Tennessee.  Ms. Tucker was responsible for overseeing the bank’s sales and marketing activities in the major metropolitan markets in Tennessee and was responsible for development of the Bank’s market presence in Nashville.  During her tenure, FirstBank was recognized by the Nashville Post as one of the Top 20 Emerging Companies in Nashville.  Prior to joining FirstBank in late 2001, Ms. Tucker was with AmSouth Bank in Nashville, a $42 billion commercial bank with offices in seven states.  She served as a senior executive vice-president for AmSouth with responsibility for all Business Banking activities in six southeastern states and New York.  She was a member of an 11-person management committee chaired by the chief executive officer that was charged with oversight of all activities of the company, including strategic planning, tactical execution and delivery of financial results.  From 1975-1999, Ms. Tucker was with First American Corporation, Nashville, Tennessee, which was merged with and into AmSouth in 1999.  Beginning as a management trainee in 1975, Ms. Tucker advanced to become president of corporate banking for First American in 1997.  Ms. Tucker earned a B.S. in Accounting from Tennessee Wesleyan College in 1975 and certification in 1982 as a Certified Management Accountant.  She is a graduate of Stonier Graduate School of Banking at Rutgers University (1982), also earning an MBA from the University of Tennessee/Tennessee State University that same year.  Active in the community, Ms. Tucker currently serves on the executive committee for Ingram Entertainment; on the board of the Nashville Ballet; chair of St. Luke’s Community House; member of the advancement committee of Tennessee Wesleyan College; vice-chair of the Minnie Pearl Cancer Foundation; member of the advisory council of the Legal Aid Society of Middle Tennessee and the Cumberlands; member of the boards of the YMCA of Middle Tennessee and the YW Advisory Board; foundation trustee for Brentwood United Methodist Church; and a member of the PENCIL Foundation.  Ms. Tucker was a member of the 1995-1996 Class of Leadership Nashville and program co-chair for the class of 1996-1997; she served as chair of the audit committee and secretary/treasurer of the Tennessee Education Lottery Corporation.  Her previous community activities have included leadership roles in organizations that help feed and shelter the poor of the community, raise money for the United Way; and bring management and infrastructure strength to the greater Nashville area.  Ms. Tucker has one son who is currently a junior at Vanderbilt University.  She lives in Brentwood, Tennessee.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President and Chief Executive Officer ","firm":{"name":"Capstar Bank","permalink":"capstar-bank","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0012/3041/123041v1-max-150x150.png"],[[250,58],"assets/images/resized/0012/3041/123041v1-max-250x250.png"],[[258,60],"assets/images/resized/0012/3041/123041v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}