{"first_name":"Claudio","last_name":"Pinkus","permalink":"claudio-pinkus-2","crunchbase_url":"http://www.crunchbase.com/person/claudio-pinkus-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Multiply","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Mar 27 19:51:07 UTC 2008","updated_at":"Wed Nov 26 06:12:11 UTC 2008","overview":"<p>Claudio Pinkus is founder and Managing Director of NetStrategies, LLC, a boutique consulting and financial advisory firm based in Los Angeles, CA.</p>\n\n<p>He is an angel investor and consultant to the Internet industry, assisting companies such as Univision Communications, TransCosmos, Inc. and Ask Jeeves. Until June, 2004, Claudio was Chief Strategy Officer for Ask Jeeves, Inc. where he was responsible for planning and executing the acquisition of Interactive Search Holdings, which doubled the company’s market share in Search, and doubled the market capitalization. He was also responsible for the revenue partnership with Google, which produced over $1 Billion in revenues over a three year period.</p>\n\n<p>From December, 2000 to June, 2002 Claudio served as president of Ask Jeeves Business Solutions, the enterprise software division of Ask Jeeves, Inc. During this period, he reorganized the division, improved gross margins, and increased the average selling price. During Claudio’s tenure at Jeeves, he was also responsible for establishing the company’s presence overseas, setting up partnerships in the UK, Japan and the Spanish speaking world.</p>\n\n<p>From 1996 to 1999, Claudio was Chief Executive Officer of Bowne Global Solutions, Inc., the world’s largest provider of globalization consulting services. Under his leadership, the company grew its revenues four fold and laid the foundation for further consolidation through operational excellence.</p>\n\n<p>Claudio serves on multiple boards, including those of Multiply, MediaMobz, and WorldLinks, among others. He attended UCLA, where he studied chemistry and computer sciences.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Chief Strategy Officer","firm":{"name":"Multiply","permalink":"multiply","type_of_entity":"company","image":{"available_sizes":[[[109,106],"assets/images/resized/0000/0007/7v6-max-150x150.png"],[[109,106],"assets/images/resized/0000/0007/7v6-max-250x250.png"],[[109,106],"assets/images/resized/0000/0007/7v6-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}