{"first_name":"Clay","last_name":"Walton","permalink":"clay-walton","crunchbase_url":"http://www.crunchbase.com/person/clay-walton","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jun 17 12:31:05 UTC 2009","updated_at":"Wed Jun 17 12:33:25 UTC 2009","overview":"<p>As Senior Vice President of Engineering and CTO, Mr. Walton provides the leadership to manage the company’s project engineering, construction and start-up activities, intellectual property portfolio, and technological advancement.</p>\n\n<p>Mr. Walton has over thirty years of experience in the environmental, chemical process, refining, and energy production industries. He comes to EnerTech after 8 years as Vice President of Project Operations at Microgy, Inc., a leader in the design, construction, and operation of biogas plants in the United States. There Mr. Walton oversaw the construction of the largest biogas production and conversion to pipeline-grade natural gas facility in the world. Before joining Microgy, Mr. Walton was President of Trident Technologies International where he managed the commercialization of environmental remediation systems in Japan and Korea and negotiated engineering and construction contracts in the Far East.</p>\n\n<p>A registered professional engineer in several states, Mr. Walton holds a Bachelor of Science in Mechanical Engineering from the University of Oklahoma and a Master of Science in Environmental Engineering from the Colorado School of Mines.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Senior Vice President & CTO","firm":{"name":"EnerTech Environmental","permalink":"enertech-environmental","type_of_entity":"company","image":{"available_sizes":[[[150,32],"assets/images/resized/0004/9094/49094v1-max-150x150.png"],[[178,38],"assets/images/resized/0004/9094/49094v1-max-250x250.png"],[[178,38],"assets/images/resized/0004/9094/49094v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}