{"first_name":"Clayton","last_name":"Lewis","permalink":"clayton-lewis","crunchbase_url":"http://www.crunchbase.com/person/clayton-lewis","homepage_url":"http://www.maveron.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Maveron","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Sep 09 17:27:17 UTC 2010","updated_at":"Mon Mar 28 20:57:27 UTC 2011","overview":"<p>Clayton Lewis joined Maveron as a partner in 2007. Taking the helm of one of the firm’s wellness portfolio companies, his leadership resulted in the successful sale of the business. Today Clayton leads Maveron’s investments in health and wellness companies, and continues to work directly with portfolio companies. Clayton has an extensive background in driving operations and a strong track record of returns, serving as president and chief operating officer of HouseValues.com, where he directed revenue growth from $48 million to $98 million in two years. Prior to HouseValues.com, he was part of the executive team that took Onvia public, raising $240 million and completing five acquisitions in less than two years. As president and chief operating officer, he revamped Onvia’s strategy, transforming it from a business-to-business to a business-to-government model. In addition to two decades of executive leadership experience, Clayton held positions in national politics serving on Capitol Hill as Chief of Staff to Congresswoman Louise Slaughter (NY) and managed several high-profile campaigns. Today Clayton leads our investment activities in health and wellness companies while working with portfolio companies and Maveron operations. Clayton works directly with Allconnect, CitizenHawk, NextFoods, and Trupanion. He holds a degree in business from the University of Washington where he was elected president of the Associated Students. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Maveron","permalink":"maveron","type_of_entity":"financial_org","image":{"available_sizes":[[[150,62],"assets/images/resized/0000/3055/3055v11-max-150x150.png"],[[231,96],"assets/images/resized/0000/3055/3055v11-max-250x250.png"],[[231,96],"assets/images/resized/0000/3055/3055v11-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}