{"first_name":"Clay","last_name":"Shirky","permalink":"clay-shirky","crunchbase_url":"http://www.crunchbase.com/person/clay-shirky","homepage_url":"http://www.shirky.com/","birthplace":"","twitter_username":"cshirky","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":"","created_at":"Thu Feb 18 06:22:50 UTC 2010","updated_at":"Sun Aug 15 05:45:48 UTC 2010","overview":"<p>Mr. Shirky divides his time between consulting, teaching, and writing on the social and economic effects of Internet technologies. His consulting practice is focused on the rise of decentralized technologies such as peer-to-peer, web services, and wireless networks that provide alternatives to the wired client/server infrastructure that characterizes the Web. Current clients include Nokia, GBN, the Library of Congress, the Highlands Forum, the Markle Foundation, and the BBC.</p>\n\n<p>In addition to his consulting work, Mr. Shirky is an adjunct professor in NYU&#8217;s graduate Interactive Telecommunications Program (ITP), where he teaches courses on the interrelated effects of social and technological network topology &#8211; how our networks shape culture and vice-versa. His current course, Social Weather, examines the cues we use to understand group dynamics in online spaces and the possible ways of improving user interaction by redesigning our social software to better reflect the emergent properties of groups.</p>\n\n<p>Mr. Shirky has written extensively about the internet since 1996. Over the years, he has had regular columns in Business 2.0, FEED, OpenP2P.com and ACM Net_Worker, and his writings have appeared in the New York Times, the Wall Street Journal, the Harvard Business Review, Wired, Release 1.0, Computerworld, and IEEE Computer. He has been interviewed by Slashdot, Red Herring, Media Life, and the Economist&#8217;s Ebusiness Forum. He has written about biotechnology in his &#8220;After Darwin&#8221; column in FEED magazine, and serves as a technical reviewer for O&#8217;Reilly&#8217;s bioinformatics series. He helps program the &#8220;Biological Models of Computation&#8221; track for O&#8217;Reilly&#8217;s Emerging Technology conferences.</p>\n\n<p>Mr. Shirky frequently speaks on emerging technologies at a variety of forums and organizations, including PC Forum, the Internet Society, the Department of Defense, the BBC, the American Museum of the Moving Image, the Highlands Forum, the Economist Group, Storewidth, the World Technology Network, and several O&#8217;Reilly conferences on Peer-to-Peer, Open Source, and Emerging Technology.</p>\n\n<p>Prior to his appointment at NYU, Mr. Shirky was a Partner at the investment firm The Accelerator Group in 1999-2001, an international investment group with offices in New York, Los Angeles, and London. The Accelerator Group was focused on early stage firms, and Mr. Shirky&#8217;s role was technological due diligence and product strategy.</p>\n\n<p>Mr. Shirky was the original Professor of New Media in the Media Studies department at Hunter College, where he created the department&#8217;s first undergraduate and graduate offerings in new media, and helped design the current MFA in Integrated Media Arts program.</p>\n\n<p>Prior to his appointment at Hunter, he was the Chief Technology Officer of the NYC-based Web media and design firm Site Specific, where he created the company&#8217;s media tracking database and server log analysis software. Site Specific was later acquired by CKS Group, where he was promoted to VP Technology, Eastern Region.</p>\n\n<p>Before there was a Web, he was Vice-President of the New York chapter of the EFF, and wrote technology guides for Ziff-Davis, including a guide to email-accessible internet resources, and a guide to the culture of the internet. He appeared as an expert witness on internet culture in Shea vs. Reno, a case cited in the Supreme Court&#8217;s decision to strike down the Communications Decency Act in 1996.</p>\n\n<p>Mr. Shirky graduated from Yale College with a degree in art, and prior to falling in love with the internet, he worked as a theater director and designer in New York. His company, Hard Place Theater, staged &#8220;non-fiction theater&#8221;, theatrical collages of found documents.</p>\n\n<p>Mr. Shirky&#8217;s writings are archived at shirky.com, and he currently runs the N.E.C. mailing list for his writings on networks, economics, and culture.</p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0009/7736/97736v2-max-150x150.jpg"],[[250,168],"assets/images/resized/0009/7736/97736v2-max-250x250.jpg"],[[450,302],"assets/images/resized/0009/7736/97736v2-max-450x450.jpg"]],"attribution":"<p>Joi Ito</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Director","firm":{"name":"Socialbomb","permalink":"socialbomb","type_of_entity":"company","image":{"available_sizes":[[[107,150],"assets/images/resized/0003/3014/33014v1-max-150x150.png"],[[179,250],"assets/images/resized/0003/3014/33014v1-max-250x250.png"],[[234,326],"assets/images/resized/0003/3014/33014v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"advisor","firm":{"name":"scroll kit","permalink":"scroll-kit","type_of_entity":"company","image":null}},{"is_past":false,"title":"Advisor","firm":{"name":"Stack Exchange","permalink":"stack-exchange","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0012/5685/125685v3-max-150x150.png"],[[250,74],"assets/images/resized/0012/5685/125685v3-max-250x250.png"],[[450,134],"assets/images/resized/0012/5685/125685v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://en.wikipedia.org/wiki/Clay_Shirky","title":"wikipedia"}],"web_presences":[]}