{"first_name":"Clayton","last_name":"Christensen","permalink":"clayton-christensen-2","crunchbase_url":"http://www.crunchbase.com/person/clayton-christensen-2","homepage_url":"http://www.claytonchristensen.com/index.html","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Mon Apr 02 21:08:21 UTC 2012","updated_at":"Thu Oct 25 06:27:05 UTC 2012","overview":"<p>Clayton M. Christensen is the architect of and the world’s foremost authority on disruptive innovation, a framework which describes the process by which a product or service takes root initially in simple applications at the bottom of a market and then relentlessly moves ‘up market’, eventually displacing established competitors.  Consistently acknowledged in rankings and surveys as one of the world’s leading thinkers on innovation, Christensen is widely sought after as a speaker, advisor and board member.  His research has been applied to national economies, start-up and Fortune 50 companies, as well as to early and late stage investing. </p>\n\n<p>His seminal book The Innovator’s Dilemma (1997), which first outlined his disruptive innovation frameworks, received the Global Business Book Award for the Best Business Book of the Year in 1997, was a New York Times bestseller, has been translated into over 10 languages, and is sold in over 25 countries.  He is also a four-time recipient of the McKinsey Award for the Harvard Business Reviews’s best article and received a Lifetime Achievement Award from the Tribeca Film Festival in 2010.</p>\n\n<p>Christensen has recently focused his innovation lens on two of our most vexing social issues, education and health care.  Disrupting Class which looks at the root causes of why schools struggle and offers solutions was named one of the &#8220;10 Best Innovation and Design Books in 2008” by BusinessWeek and the best Human Capital book of the year in the Strategy + Business Best Books of 2008.  The Innovator&#8217;s Prescription (2009) examines how to fix the problems facing healthcare.  So as to further examine and apply his frameworks to the social sector, Christensen founded Innosight Institute, a non-profit think tank, in 2008.</p>\n\n<p>An advisor to numerous countries and companies, including the government of Singapore, he is currently a board member at India’s Tata Consultancy Services (NYSE: TCS), Franklin Covey (NYSE: FC), W.R. Hambrecht, and Vanu.  Christensen also applies his frameworks via management consultancy Innosight which he co-founded in 2000, and <a href=\"http://www.crunchbase.com/financial-organization/rose-park-advisors\" title=\"Rose Park Advisors\">Rose Park Advisors</a>, an investment firm he founded in 2007.</p>\n\n<p>Christensen was born in Salt Lake City, Utah in 1952.  He graduated with highest honors in economics from Brigham Young University in 1975.  Later, he received an M.Phil. in applied econometrics and the economics of less-developed countries from Oxford University in 1977, where he studied as a Rhodes Scholar.  He received an MBA with High Distinction from the Harvard Business School in 1979, graduating as a George F. Baker Scholar.  In 1982-1983 he was a White House fellow, serving as an assistant to U.S. Transportation Secretaries Drew Lewis and Elizabeth Dole.  In 1992, he was awarded a DBA from the Harvard Business School, receiving the Best Dissertation Award from the Institute of Management Sciences for his doctoral thesis on technology development in the disk drive industry.  He is currently the Kim B. Clark Professor of Business Administration at the Harvard Business School.</p>\n\n<p>Professor Christensen is committed to both community and church.  In addition to his stint as a White House Fellow, he was an elected member of the Belmont Town Council for 8 years, and has served the Boy Scouts of America for 25 years as a scoutmaster, cub master, den leader and troop and pack committee chairman.  He also worked as a missionary for the Church of Jesus Christ of Latter-day Saints in the Republic of Korea from 1971 to 1973, speaks fluent Korean, and is currently a leader in his church.  He and his wife Christine live in Belmont, MA. They are the parents of five children, and have three grandchildren.</p>","image":{"available_sizes":[[[140,150],"assets/images/resized/0018/2291/182291v1-max-150x150.jpg"],[[234,250],"assets/images/resized/0018/2291/182291v1-max-250x250.jpg"],[[280,299],"assets/images/resized/0018/2291/182291v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"Economics","institution":"Brigham Young University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MPhil","subject":"Applied Econometrics","institution":"Oxford University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"Harvard Business School","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"DBA","subject":"","institution":"Harvard Business School","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}