{"first_name":"Cleve","last_name":"Adams","permalink":"cleve-adams","crunchbase_url":"http://www.crunchbase.com/person/cleve-adams","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Kerosene and a match","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Sep 06 04:33:31 UTC 2010","updated_at":"Wed Jun 15 18:48:34 UTC 2011","overview":"<p>Start-up/turnaround/revenue expert for High Tech/Clean Tech Companies with four successful start-ups and four successful exits including a $1 billion IPO \n My average Return to Investors is 21x.\n 8 years as a successful CEO – 12 as a successful sales and marketing executive.\nI have produced an impressive history of growing and managing companies from  pre-revenue startups to more than $1Billion in MV. \n My skills extend to building and selling companies  for significant returns to its investors or taking them through IPO’s creating billion dollar corporations\nSenior management experience in Mobile/Wireless, Security software, Enterprise, Games, SaaS, Consumer, Storage, and digital media.<br/>\nHelped Start, built and managed the largest company in the SaaS/ Network security software market from pre-revenue to a $1.0B IPO, the largest in San Diego county history. \nBuilt worldwide reseller and distribution channel to 1100 strong in 82 countries in 3 years\nExpertise in raising capital. I have raised over $50M from tier one VC’s \nRecent M&amp;A experience and expertise.\nBoard of Pepperdine University – Graziadio School of Business and Management\nPrincipal – OneAccord Partners – Interim Revenue Executives\nChairman  –  KaaM Inc - KaaM has developed a mobile/vision &amp; augmented reality gaming platform.  KaaM was named by Forbes Magazine in 2009 as Americas 2nd Most Promising Company. \nInterim CEO – Hightower software, IT Info Mgmt, brought in to sell the company. \nCEO, Puresight Inc — the number one provider of advanced content recognition and management solutions for mobile operators, retail and Enterprise markets. Company was sold to BCGI in 2006\nHelpedStart and 1st executive at — Websense Inc. an Internet Security Software company that went public in March 2000. Adams was largely credited as the key figure behind the company&#8217;s transformation from a pre-revenue security startup to a $1B  global corporation in the span of just four years as the companies only executive in its  first 3 years. </p>","image":null,"degrees":[{"degree_type":"Masters","subject":"Business","institution":"Pepperdine","graduated_year":2001,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Kerosene and a match","permalink":"kerosene-and-a-match","type_of_entity":"company","image":{"available_sizes":[[[150,25],"assets/images/resized/0007/7131/77131v2-max-150x150.jpg"],[[250,42],"assets/images/resized/0007/7131/77131v2-max-250x250.jpg"],[[450,76],"assets/images/resized/0007/7131/77131v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}