{"first_name":"Clifford","last_name":"McDowell","permalink":"clifford-mcdowell","crunchbase_url":"http://www.crunchbase.com/person/clifford-mcdowell","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Mr Site","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Aug 08 14:42:13 UTC 2011","updated_at":"Tue Aug 09 18:08:57 UTC 2011","overview":"<p>Clifford McDowell was appointed as the CEO of Mr Site in 2010, where his progressive approach to business has helped to cement the company’s position as the UK’s leading provider of easy-to-use website building tools. </p>\n\n<p>He has extensive experience in the technology sector. During his career, he has worked for some of the UK’s foremost technology providers, including Amphire, Pitney Bowes and Prudential Insurance in technical, logistical and managerial positions. This has given him a very rounded understanding of the technology industry and a unique insight into developing integrated business strategies.\nHe has spearheaded the company’s international expansion, driving forward the opening of offices in India and the growth across Europe and Australia. </p>\n\n<p>He is also very interested in working with the next generation of business professionals to help them bring a fresh approach to British industry. As well as acting a mentor for a local scheme to support young adults develop their business skills, he sits on the strategic advisory board of The Small Business Consultancy, a social enterprise inspiring young people to achieve success through enterprise. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Mr Site","permalink":"mr-site","type_of_entity":"company","image":{"available_sizes":[[[100,60],"assets/images/resized/0014/8346/148346v2-max-150x150.jpg"],[[100,60],"assets/images/resized/0014/8346/148346v2-max-250x250.jpg"],[[100,60],"assets/images/resized/0014/8346/148346v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}