{"first_name":"Clifford","last_name":"Lowell","permalink":"clifford-lowell","crunchbase_url":"http://www.crunchbase.com/person/clifford-lowell","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 22 10:01:12 UTC 2009","updated_at":"Mon Jun 22 10:03:17 UTC 2009","overview":"<p>Dr. Lowell is Professor and Chair Department of Laboratory Medicine, University of California, San Francisco. He received his M.D., Ph.D. degrees from Johns Hopkins School of Medicine in 1986. He completed his training in Internal Medicine at the Johns Hopkins Hospital (1989) and subspecialty training in Hematology/Oncology at UCSF (1993). His post-doctoral research fellowship training was done with Dr. Harold Varmus at UCSF (1989-1995), where Dr. Lowell developed his research interests in tyrosine kinase based signaling mechanisms. Dr. Lowell joined the faculty in the Dept. of Laboratory Medicine in 1995 and served as the Director of Clinical Immunology Laboratory through 2006. Dr. Lowell&#8217;s group continues to work on a variety of aspects of tyrosine kinases and intracellular signaling in innate immune cells. Dr. Lowell has authored over 110 peer-reviewed scientific manuscripts, received the prestigious Scholar Award from the Leukemia/Lymphoma Society, and is a standing member of the N.I.H. Innate Immunity Study Section. In 2006, Dr. Lowell was named Chairman of the Laboratory Medicine at UCSF with overall Departmental responsibility for Clinical Pathology, Transfusion Medicine and diagnostic testing at UCSF.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Linkage Biosciences","permalink":"linkage-biosciences","type_of_entity":"company","image":{"available_sizes":[[[150,54],"assets/images/resized/0005/0073/50073v1-max-150x150.jpg"],[[191,70],"assets/images/resized/0005/0073/50073v1-max-250x250.jpg"],[[191,70],"assets/images/resized/0005/0073/50073v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}