{"first_name":"Clint","last_name":"Heiden","permalink":"clint-heiden","crunchbase_url":"http://www.crunchbase.com/person/clint-heiden","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"VisualCV","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Feb 11 21:37:35 UTC 2008","updated_at":"Mon Sep 29 06:52:08 UTC 2008","overview":"<p>Mr. Heiden co-founded VisualCV, web 2.0 software spinoff from The Heiden Group, with Eric Dean, a previous Heiden Group partner, and Phillip Merrick, co-founder of webMethods. VisualCV is a career management, career presentation and professional networking site. </p>\n\n<p>It is a great example of the level at which The Heiden Group participates in its core focus – consulting, advising and recruiting for premier Emerging Technology firms.</p>\n\n<p>Mr. Heiden has over 16 years of executive experience including a full scope of P&amp;L, finance, HR, and operations management. This background complements his exceptional track record in sales, marketing, and business development. Mr. Heiden specializes in spearheading diverse national and global organizations in fast-paced and rapidly changing environments and has delivered over $8B in organic revenue growth for the organizations that he has led. He is an expert at assembling high performance sales teams and has orchestrated over 15 successful integrations for companies such as Cable &amp; Wireless America, Exodus, Qwest, MCI and UUNET.</p>\n\n<p>Clint Heiden Executive Summary\nDelivered over $8B in organic revenue growth for the organizations that he has led Formerly Executive VP of Worldwide Sales for Cable and Wireless America Formerly Senior VP of Advanced IP for Qwest Communications As VP of Global Markets for UUNET, drove revenue growth from $6M to $3.6B in 6 years Prior to co-founding The Heiden Group, Mr. Heiden was Executive VP of Worldwide Sales for Cable and Wireless America. In this capacity he transformed an inefficient and unfocused sales organization into an elite group of top performers. As part of the Executive Team, Mr. Heiden also streamlined the product portfolio and drove a performance turnaround in the areas of client churn and sales force productivity. He later helped lead the company through a financial restructuring that led to a $155M cash sale of the business to SAVVIS Communications.</p>\n\n<p>Mr. Heiden has also served as Senior VP of Advanced IP for Qwest Communications where he created Qwest&#8217;s first dedicated IP sales team, and as President of MindSquared/Zephion networks, where he designed and delivered strategies to ignite sales by building powerful sales forces.</p>\n\n<p>Mr. Heiden&#8217;s experience also includes serving as President of OnLine Office Supplies, a web software start-up where he spearheaded business growth from $400K to over $30M in less than one year. As the VP of Global Markets for UUNET, Mr. Heiden drove astonishing revenue growth from $6M to $3.6B in 6 years.\nBefore joining UUNET, Mr. Heiden ran worldwide sales for InterCon Systems where he was the fifth employee and ran revenue from zero to $12M annually while guiding InterCon to a 95% market share. He also drove international expansion and conquered stiff competition to help InterCon become Japan&#8217;s first ISP.</p>\n\n<p>Mr. Heiden has a BSBA in Computer Information Systems from James Madison University, where he received the Distinguished Alumni Award in 1999, the university&#8217;s highest honor.</p>\n\n<p>Mr. Heiden has served in numerous advisory roles for technology companies through the years including: Board of Directors of NetSec (sold to MCI for $105M in 2005) and Technical Advisory Board of Greenwich Technology Partner&#8217;s (Inc.&#8217;s #9 fastest-growing private business 2002). </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Cofounder","firm":{"name":"VisualCV","permalink":"visualcv","type_of_entity":"company","image":{"available_sizes":[[[150,55],"assets/images/resized/0001/1446/11446v1-max-150x150.jpg"],[[250,92],"assets/images/resized/0001/1446/11446v1-max-250x250.jpg"],[[262,97],"assets/images/resized/0001/1446/11446v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}