{"first_name":"Coach Rob","last_name":"Williams","permalink":"coach-rob-williams","crunchbase_url":"http://www.crunchbase.com/person/coach-rob-williams","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1993,"born_month":2,"born_day":2,"tag_list":"","alias_list":null,"created_at":"Fri Sep 14 09:51:57 UTC 2012","updated_at":"Tue Oct 16 05:07:51 UTC 2012","overview":"<p>Coach Rob Williams</p>\n\n<p>Over the course of his career, each position Coach Rob Williams has held has had one thing in common: basketball. He&#8217;s worked as a coach and instructor for a wide range of levels, from high school to college. When not coaching, Williams can often be found in the classroom, teaching a diverse range of subjects from physical education to driver&#8217;s education. </p>\n\n<p>Coach Rob Williams loves sports. He loves sports so much that he earned not one, but two degrees in sports related fields. His first degree is a bachelor of science in sports management from Florida State University. He then went on to earn a masters degree in sports administration from the US Sports Academy, a school whose primary focus is providing graduate degrees in sports fields.</p>\n\n<p>Williams got his start coaching early. As a player and student at Gulf Coast Community College, he also served as the assistant basketball coach. Rob Williams was one of the team&#8217;s shining stars at Gulf Coast. He earned the title of Defensive Player of the Year in 1991. In 1992, he helped the team set a record for most points scored in a game.</p>\n\n<p>Coach Rob Williams has had a lasting impact on the basketball teams he coached at the high school level. He&#8217;s worked as a basketball coach in Georgia and Florida. From 2007 to 2008, Williams was the head coach for the boy&#8217;s basketball team at Ware County High School in Georgia. While he was coach, the team had an 18 to 10 record. </p>\n\n<p>Williams wasn&#8217;t only the coach at Ware County High School. He also served as the school&#8217;s driver education teacher and first aid teacher. Through his various positions at the high school, Williams was able to teach students several important life lessons, from how to bandage a wound to how to drive a car.</p>\n\n<p>Coach Rob Williams is also in demand as a basketball coach at the community college level. He&#8217;s worked with teams at several colleges, from North Florida University to Alabama Southern Community College. Each team did well and set records while Williams was at the helm.</p>","image":{"available_sizes":[[[150,83],"assets/images/resized/0021/1322/211322v4-max-150x150.png"],[[250,138],"assets/images/resized/0021/1322/211322v4-max-250x250.png"],[[450,249],"assets/images/resized/0021/1322/211322v4-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}