{"first_name":"Cody","last_name":"Worland","permalink":"cody-worland","crunchbase_url":"http://www.crunchbase.com/person/cody-worland","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Equidity","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Feb 09 23:16:24 UTC 2011","updated_at":"Thu May 05 22:29:35 UTC 2011","overview":"<p>Cody met Mona DeFrawi in 2008 during the planning and execution of the debut investor conference for InsideVenture, Mona&#8217;s former company that was acquired by SecondMarket in 2009. Having been an extended team member for over a year, helping create InsideVenture’s successful debut under Mona’s leadership, Cody was thrilled to join the Equidity team, to help complete Mona’s original mission of facilitating primary liquidity opportunities.  Prior to 2008, Cody was the Corporate Sales Manager at the luxury property Bacara Resort &amp; Spa located in Santa Barbara, where Cody created and maintained relationships with companies in the entertainment and financial industries. He also produced and managed corporate contracts for &#8220;on-property&#8221; events such as vehicle launches, investment seminars, and large, high-end corporate events.  In 2005, Cody joined SunCrest Capital, a San Diego-based real estate firm, where he advised homeowners of their financing options based on market conditions while establishing strong relationships with the top financial institutions. Also in 2005, Cody was the top producer for both the 1st and 2nd quarters. Cody actively recruited new employees whom he managed, trained and coached into productive loan officers which increased the company&#8217;s yearly earnings by over $200k in 2006.  Additionally, he recognized the need for SunCrest Capital to offer more services to their clients which led to the partnership with World Financial, a financial services firm, allowing all SunCrest officers to offer full financial planning. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP Business Development & Co-Founder","firm":{"name":"Equidity","permalink":"equidity","type_of_entity":"company","image":{"available_sizes":[[[150,28],"assets/images/resized/0012/0687/120687v4-max-150x150.png"],[[239,46],"assets/images/resized/0012/0687/120687v4-max-250x250.png"],[[239,46],"assets/images/resized/0012/0687/120687v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}