{"first_name":"Cody","last_name":"Landefeld","permalink":"cody-landefeld","crunchbase_url":"http://www.crunchbase.com/person/cody-landefeld","homepage_url":"http://www.codyl.com","birthplace":"Phoenix, Arizona","twitter_username":"codyL","blog_url":"http://www.codyl.com/blog/","blog_feed_url":"http://feeds.feedburner.com/codyL-design-marketing","affiliation_name":"Unaffiliated","born_year":1980,"born_month":11,"born_day":2,"tag_list":"websites, graphic-design, website-strategy, website-design, website-development","alias_list":null,"created_at":"Mon Oct 11 03:07:11 UTC 2010","updated_at":"Wed Oct 13 18:10:06 UTC 2010","overview":"<p>Starting with art and design as a 6 year old Cody Landefeld began his venture into design with sketching, drawing, and painting through high school.  In 2000 he began attending college for Information Technology.  It was then when Cody Landefeld created his first website  called The Cadet League and began his venture into website and graphic design.  </p>\n\n<p>This website featured independent music acts on a local and national level such as Pedro the Lion (David Bazan), and Dashboard Confessional (Chris Carrabba).  Attention caught on both locally and nationally as several record companies and music acts gave exclusive access for interviews and album reviews.  From the time the website launched other music acts began to inquire for design and website services.  </p>\n\n<p>His first client was a little known band from New York City called The Drums.  There began a string of independent bands and record labels who contracted Cody Landefeld&#8217;s service on a freelance level.  After working for a while under other agencies as well as other freelance ventures, in 2005 Cody Landefeld formed codyL.  Simply titled after the name people started to write on his checks while giving up on trying to spell his last name.</p>\n\n<p>Picking up now, Cody Landefeld is a web strategist, an experienced graphic and user interface designer, and runs a boutique website development company in Phoenix Arizona still under the title &#8220;codyL.&#8221;  We work to provide small to large companies develop an efficient online strategy using the web to become more effective in their industries.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0010/5183/105183v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0010/5183/105183v2-max-250x250.jpg"],[[300,300],"assets/images/resized/0010/5183/105183v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.codyl.com/2010/02/10/how-to-market-your-business-online/","title":"How to Market Your Business Online - by Cody Landefeld"}],"web_presences":[{"external_url":"http://twitter.com/codyL","title":"Twitter"},{"external_url":"http://www.linkedin.com/profile/view?id=2436090&locale=en_US&trk=tab_pro","title":"Linked In"},{"external_url":"http://www.facebook.com/codyLandefeld","title":"Facebook"}]}