{"first_name":"Cole","last_name":"Sirucek","permalink":"cole-sirucek","crunchbase_url":"http://www.crunchbase.com/person/cole-sirucek","homepage_url":"","birthplace":"Twin Falls, Idaho, USA","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1975,"born_month":10,"born_day":17,"tag_list":"","alias_list":null,"created_at":"Thu Apr 14 07:29:39 UTC 2011","updated_at":"Sat Nov 10 09:05:08 UTC 2012","overview":"<p>Cole Sirucek is an entrepreneur and investor. Currently, he is the Co-Founder and Chief Executive Officer of Epic MMA Club, Asia largest mixed martial arts training club. He is also a Co-Founder and Executive Chairman of DocDoc Pte. Ltd., Asia’s largest real-time online doctor reservation system and is a member of the Board of Directors for Global Eagle Acquisition Corp, a NASDAQ listed Special Purpose Acquisition Corporation focused on the media and entertainment industry.    </p>\n\n<p>Previously, Cole spent seven years as an investor with Temasek Holdings. In this capacity, he sourced, executed and monitored investments on a global basis in the firm’s telecommunications, media and technology group. He has successfully invested US$506M.</p>\n\n<p>Before Temasek, he was the Co-Founder and Executive Vice President of Pluto Networks – a wireless data networking company. He has previously held executive positions in Hawaii’s State Government and has worked as a technology venture capitalist and strategy business consultant. </p>\n\n<p>Cole grew up in the USA and attended Massachusetts Institute of Technology, Sloan School (Master of Business Administration) and Harvard’s Kennedy School of Government (Masters of Public Administration). He was a President of MIT’s Private Equity &amp; Venture Capital Association and a Lead Organizer of the MIT $100K Global Startup Workshop Entrepreneurship Competition. </p>\n\n<p>In his free time, Cole is a martial artist, adventure racer, scuba diver and mountaineer.  Cole has completed self-supported 250KM foot races across China’s Gobi Desert and Egypt’s Sahara Desert, funding medical missions in Vietnam and China that directly saved the lives +13 children.  He has also successfully led an expedition up the Western Breach of Mt. Kilimanjaro, for the Make-A-Wish Foundation of Singapore. </p>","image":{"available_sizes":[[[111,150],"assets/images/resized/0013/0524/130524v2-max-150x150.jpg"],[[186,250],"assets/images/resized/0013/0524/130524v2-max-250x250.jpg"],[[259,347],"assets/images/resized/0013/0524/130524v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.racingtheplanet.com/","title":"Adventure Races"},{"external_url":"http://www.makeawish.org.sg/","title":"Charity "},{"external_url":"http://www.childrensheartlink.org/","title":"Charity"},{"external_url":"http://www.technologyreview.com/","title":"Technology Review "},{"external_url":"http://www.ted.com/","title":"TED "},{"external_url":"http://evolve-mma.com/","title":"My Gym "}]}