{"first_name":"Constance","last_name":"Freedman","permalink":"constance-freedman","crunchbase_url":"http://www.crunchbase.com/person/constance-freedman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Second Century Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Dec 30 12:17:04 UTC 2009","updated_at":"Wed Dec 22 18:21:55 UTC 2010","overview":"<p>Constance Freedman is the Managing Director of the Second Century Ventures Fund.  She manages all aspects of the fund, from cultivating investment opportunities to helping portfolio companies achieve their strategic goals.  Constance is also the Vice President of Strategic Investments for NATIONAL ASSOCIATION OF REALTORS® where she assesses key strategic investment initiatives within NAR.</p>\n\n<p>Constance comes to Second Century Ventures with an entrepreneurial background in Venture Capital, Technology and Real Estate. Prior to joining SCV, Constance was a principal at Cue Ball, an early and growth stage investment firm focused on the information services and consumer sectors. At Cue Ball Constance helped to form Cue Ball Capital and played an integral role in all aspects of Cue Ball’s investment process including taking on an interim executive role at one of its portfolio companies. Prior to Cue Ball, Constance was an Associate at Mt. Auburn Partners, a private equity firm focused on investments in business and consumer services. She founded Freedman Ventures where she conducted investment evaluations in spaces including consumer, software and information services and pursued an independent buyout of an information services firm in the real estate space. Constance has seven years operating experience at technology start-ups including Molecular (backed by CMGI, acquired by Isobar) and Account4.com (acquired by Lawson). In addition, Constance spent three years as a licensed real estate professional.</p>\n\n<p>Constance is on the Board of Overseers of From the Top. She earned a BS from Boston University and a MBA from Harvard Business School.</p>","image":{"available_sizes":[[[100,98],"assets/images/resized/0007/1586/71586v1-max-150x150.jpg"],[[100,98],"assets/images/resized/0007/1586/71586v1-max-250x250.jpg"],[[100,98],"assets/images/resized/0007/1586/71586v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"","institution":"Harvard Business School","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Second Century Ventures","permalink":"second-century-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,87],"assets/images/resized/0007/1582/71582v1-max-150x150.png"],[[172,100],"assets/images/resized/0007/1582/71582v1-max-250x250.png"],[[172,100],"assets/images/resized/0007/1582/71582v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}