{"first_name":"coolfunnytshirts.net","last_name":"designs","permalink":"coolfunnytshirts-net-designs","crunchbase_url":"http://www.crunchbase.com/person/coolfunnytshirts-net-designs","homepage_url":"http://www.coolfunnytshirts.net","birthplace":"","twitter_username":"coolfunnytshirt","blog_url":"http://www.coolfunnytshirts.net","blog_feed_url":"http://coolfunnytshirt.wordpress.com","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"cool-tshirts, funny-tshirts, cool-funny-tshirts, cheap-tshirts, cheap-print-tshirts, cool-funny-slogan-tshirts, cool-funny-quotes-tshirts, cool-funny-design-tshirts, cool-funny-print-tshirts","alias_list":null,"created_at":"Sat Dec 18 18:00:19 UTC 2010","updated_at":"Sat Dec 18 21:28:08 UTC 2010","overview":"<p>Say it with Cool, Funny, Witty, Crazy Quotes and Slogan Tshirts</p>\n\n<p>Get cool and funny! - Go for Cool, Funny, Witty, Crazy Quotes and Slogan Tshirts. Unleash your expressions and attitude through your tshirts. Buy cheap cool funny tshirts online at www.coolfunnytshirts.net</p>\n\n<p>Wearing tshirts can be a lot of fun. Tshirts are cool and casual as a fashion statement.  Tshirts can reflect the mood and personality of a person. Tshirts can have artistic, graphic, illustrative, cartoonistic design or based on cool, funny text based quotes, slogan or messages. Tshirts are a cool fashion statement to let out your expressions. Tshirts help you out to speak your attitude through them. Tshirts can often be help to make a great satirical and sarcastic statement on friends, colleagues, boss, profession, relationships etc. Design Tshirts are a very good way to reflect messages on current social issues.</p>\n\n<p>These tshirts can further be categorized into cool and funny crazy tshirts, wacky tshirts, witty tshirts, cool and funny sarcastic tshirts, humor tshirts, cool and funny wicked tshirts, naughty tshirts, funky tshirts, vintage tshirts, custom tshirts, humour tshirts, cool and funny graphic tshirts, logo tshirts, coolfunnyquotes tshirts, inspirational tshirts, motivational tshirts, cool and funny oneliner based tshirts, quotation based tshirts, quote tshirts, slogan tshirt, design tshirts, printed tshirts, hindi tshirts, cool and funny bengali tshirts, bangla tshirts, kolkata tshirts, delhi tshirts, regional tshirts, cool and funny language tshirts, india tshirts, country tshirts, independence day tshirts, republic day tshirts, mother&#8217;s day tshirts, cool and funny recession tshirts, cool and funny cricket tshirts, cool and funny bollywood tshirts, movie tshirts, cool and funny filmy tshirts, hollywood tshirts, romantic tshirts, romance tshirts, valentine&#8217;s day tshirts, college tshirts, school tshirts, office tshirts, boss tshirts, friends tshirts, geek tshirts, cool and funny  gift tshirts, kid&#8217;s tshirts, boyfriend gift tshirts, girlfriend gift tshirts, friends gift tshirts, best friend tshirts, mother  gift tshirts, father tshirts, son gift tshirts, daughter gift tshirts, sister gift tshirts, brother gift tshirts, boss gift tshirts, colleague gift tshirts, bride tshirts, groom tshirts, wedding tshirts, couple tshirts, single tshirts, bachelor tshirts, just married tshirts, expressive tshirts, message tshirts, male tshirts, cool and funny profession tshirts, attitude tshirts and more.</p>\n\n<p>You can visit www.coolfunnytshirts.net for this vast category of collection. </p>\n\n<ul>\n<li>coolfunnytshirts.net</li>\n</ul>","image":{"available_sizes":[[[125,125],"assets/images/resized/0011/4591/114591v2-max-150x150.png"],[[125,125],"assets/images/resized/0011/4591/114591v2-max-250x250.png"],[[125,125],"assets/images/resized/0011/4591/114591v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.coolfunnytshirts.net","title":"Get cool and funny! - Go for Cool, Funny, Witty, Crazy Quotes and Slogan Tshirts. Unleash your expressions and attitude through your tshirts. Buy cheap cool funny tshirts online at www.coolfunnytshirts.net "},{"external_url":"http://coolfunnytshirt.wordpress.com","title":"Get cool and funny! - Go for Cool, Funny, Witty, Crazy Quotes and Slogan Tshirts. Unleash your expressions and attitude through your tshirts. Buy cheap cool funny tshirts online at www.coolfunnytshirts.net "},{"external_url":"http://coolfunnytshirts.yolasite.com/","title":"Get cool and funny! - Go for Cool, Funny, Witty, Crazy Quotes and Slogan Tshirts. Unleash your expressions and attitude through your tshirts. Buy cheap cool funny tshirts online at www.coolfunnytshirts.net "}]}