{"first_name":"Craig","last_name":"Bennett","permalink":"craig-bennett","crunchbase_url":"http://www.crunchbase.com/person/craig-bennett","homepage_url":"http://techreviewsandhelp.com/","birthplace":"Tucson Arizona","twitter_username":"","blog_url":"http://techreviewsandhelp.com/","blog_feed_url":"","affiliation_name":"Ace Hardware","born_year":1987,"born_month":10,"born_day":12,"tag_list":"","alias_list":null,"created_at":"Wed May 30 21:36:57 UTC 2012","updated_at":"Wed Jun 20 15:04:26 UTC 2012","overview":"<p>Craig Bennett II was born in a military family on October 12, 1987. At a young age, Craig found a passion for the space program, and he vowed to do everything he can so he could become an astronaut. At a young age, Craig decided there were three ways to go into space. First is through the military. Next is through a research field. And lastly, is to pay your way. Keeping this in mind, he decided to try  to go for all three methods, but later on in his life he found you can spend your time doing two of the three. So, at age 14 while his friends went surfing and played, he study the stock market. By age 16, he develops blueprints for robots so he could sell them. Unfortunately, he did send  some of the blueprints to several companies later on in his life, and every company said the technology is not there to make the robots, and it would cost too much to make the technology at that time. </p>\n\n<p>A few months before his high school graduation, he switches jobs from working at Ace Hardware in Cocoa Beach, to working at Cocoa Beach Animal Hospital as a veterinarian technician. When Craig graduated from Cocoa Beach High School, he set out to fulfill his dream. To fulfill his dream, he went after an aerospace degree since the local aerospace program allowed him to be taught under current and past NASA employees while using NASA equipment in NASA buildings. Also, by this time he started trading in the stock market since he just turned the legal age to trade. He loves to joke around about his first trade. In his own words, he says, “In my first trade, I put $50 in the market, and that afternoon it became $350. But, the next day I lost $35.”</p>\n\n<p>While Craig set out to achieve his aerospace degree, he started volunteering at Android Media Network. Also at the same time, he started work at a virtual job as a data miner and writer for The Unlockr. After years of developing his skills with the Android community, Craig set off to fix a problem in the smart phone world. He developed a web site called Apps for Android. As Craig points out, there is a problem between the flood of useless apps on the market places, and users are not getting what they need. To solve this problem Craig&#8217;s new site Apps for Android was originally a place where application users post what they want, and developers can build apps from the list. The problem Craig found after he made the site was users would come to the site, but app developers would not interact with the site. The advantage Craig had been the site was completely free to run. Because of this, thesite is still open at AppsForAndroid.webs.com</p>\n\n<p>On November 10, 2011, a month before Craig graduated with his aerospace degree and a month after his 24th birthday, he made his biggest company yet, Tech Reviews and Help. Tech Reviews and Help was originally made to replace the every growing problem with Android Media Network. As Craig points out, the problem with Android Media Network was the Face Book sites were hard to find, many people were confused who worked for Android Media Network, as time past he will be the only volunteer helping people, and the page name only serves the few while the new site could serve everyone. Craig try to negotiated the Android Media Network owner, Brandon Kinney to help him run the site. But, sadly Brandon Kinney wasn’t interested. Knowing this was going to be a big task, Craig negotiated a deal with  a virtual coworker, Amin Lalani  to help him with the site. Amin Lalani would give Craig insight on what other people may think of the looks and feel for the site. Craig also found it is extremely important to have someone to bounce ideas off of, so the new company can be all it can be.</p>\n\n<p>After Craig graduated, he transfer up north to be around family and to increase his opportunities in the research fields and in obtaining the money to complete his dream of becoming an astronaut. At a later time, Craig did research on the housing market, and he reveled while the United States government and media was reporting the housing market was going up, and it had virtually no problem, this was a lie. Craig found the average of distress homes in America in 2012. He found if you took all the distresses sells in America and put an equal amount of distress homes in each county, you would have about 2,000 distress homes in each county. Knowing this and knowing how the president and media is acting like this isn’t happening, Craig vowed his Tech Reviews and Help site would never knowingly have manipulating information on it while he was in charge. Using this vow, Craig quickly gained the the readers trust. Tech Reviews and Help views quickly went up, but Craig said that didn’t matter. He knew the important thing was the money. He wanted the site to have it’s own office, magazine, and show. To do this, he  negotiated deals with companies for a mutual benefit. He found if his company works with other companies he easily gains more money than working alone.</p>\n\n<p>On March 2012, Craig made a site for Amin Lalani, Modifying Technology.</p>\n\n<p>On May 28 2012, Craig announced his site Tech Reviews and Help got 285.949 hits in the past 120 days.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0019/3196/193196v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0019/3196/193196v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0019/3196/193196v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Aerospace ","subject":"","institution":"BCC","graduated_year":2011,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Apps For Android","permalink":"apps-for-android","type_of_entity":"company","image":null}},{"is_past":false,"title":"CEO and founder ","firm":{"name":"Tech Reviews and Help","permalink":"tech-reviews-and-help","type_of_entity":"company","image":{"available_sizes":[[[150,99],"assets/images/resized/0019/6283/196283v2-max-150x150.jpg"],[[250,165],"assets/images/resized/0019/6283/196283v2-max-250x250.jpg"],[[300,199],"assets/images/resized/0019/6283/196283v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Data miner","firm":{"name":"The Unlockr ","permalink":"the-unlockr","type_of_entity":"company","image":null}},{"is_past":false,"title":"Composite Technician","firm":{"name":"Spirit Aerosystems","permalink":"spirit-aerosystems","type_of_entity":"company","image":null}},{"is_past":true,"title":"Sales","firm":{"name":"Ace Hardware","permalink":"ace-hardware","type_of_entity":"company","image":{"available_sizes":[[[135,63],"assets/images/resized/0016/7486/167486v1-max-150x150.jpg"],[[135,63],"assets/images/resized/0016/7486/167486v1-max-250x250.jpg"],[[135,63],"assets/images/resized/0016/7486/167486v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Vet Tech","firm":{"name":"Cocoa Beach Animal Hospital","permalink":"cocoa-beach-animal-hospital","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://techreviewsandhelp.com/","title":""},{"external_url":"http://www.facebook.com/pages/Tech-Reviews-and-Help/166858853409946","title":""}]}