{"first_name":"Craig","last_name":"Taylor","permalink":"craig-taylor","crunchbase_url":"http://www.crunchbase.com/person/craig-taylor","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Alloy Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Aug 04 13:32:02 UTC 2007","updated_at":"Thu Mar 26 20:37:30 UTC 2009","overview":"<p>Craig C. Taylor has been an active venture capitalist since 1977, and co-founded Alloy Ventures with John Shoch in 1996. At Alloy, he focuses on investments in laboratory instrumentation, diagnostics and cleantech, especially green-focused companies that sit at the intersection of biotech, nanotech and IT.</p>\n\n<p>Operating experience\nCraig is a veteran venture capital investor and expert in technology transfer from leading research institutions. Before co-founding Alloy Ventures, he worked at Asset Management Co., which he joined in 1977. Previously, Craig worked in the Office of Technology Licensing at Stanford University from 1975 to 1977. He is a past member of the Board of Directors of the National Venture Capital Association, and serves on the Board of Advisors of the MIT/Stanford Venture Laboratory. He earned a BS (1972) and an MS (1974) in physics from Brown University, and an MBA from Stanford (1977).</p>\n\n<p>Current board seats\nCraig serves on the board of directors of ForteBio, Labcyte, Optimedica, Zyomyx, and KFx Medical.</p>\n\n<p>Past board seats\nCraig has led successful investments in, and served on the boards of, dozens of leading life science companies. He was a founding board member of Applied Biosystems, the pioneering biotechnology company founded in 1981 that was later became a division of Applera and was recently sold for $6.7 billion to Invitrogen Corp. He was also a founding board member of Adeza Biomedical, a woman&#8217;s health company that completed a public offering on Nasdaq in 2004 and was later acquired by Cytec. He also served on the board of Lynx Therapeutics, a provider of genetic analysis tools for biological research that completed an IPO on Nasdaq in 2000, and later merged with Solex Ltd., before it was acquired by Illumina for $600 million 2006.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Alloy Ventures","permalink":"alloy-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[113,53],"assets/images/resized/0000/3916/3916v1-max-150x150.png"],[[113,53],"assets/images/resized/0000/3916/3916v1-max-250x250.png"],[[113,53],"assets/images/resized/0000/3916/3916v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}