{"first_name":"Craig","last_name":"Eisler","permalink":"craig-eisler-2","crunchbase_url":"http://www.crunchbase.com/person/craig-eisler-2","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jul 20 01:21:04 UTC 2009","updated_at":"Mon Jul 20 21:03:54 UTC 2009","overview":"<p>Craig Eisler is corporate vice president of entertainment client software for the TV, Video &amp; Music Business at Microsoft Corp. In this role, Eisler leads the planning, design and development of client software across Windows, the Xbox video game system and Windows Mobile.</p>\n\n<p>Eisler previously served as general manager of the Macintosh Business Unit (MacBU). He oversaw the worldwide development and business strategy for Microsoft Office products on the Macintosh platform and was responsible for Microsoft&#8217;s relationship with Apple Inc. Under his leadership, MacBU launched Office 2008 for Mac, the most successful launch in the history of Office for Mac.</p>\n\n<p>Eisler rejoined Microsoft in April 2007, after serving as senior vice president and general manager of America Online Inc.&#8217;s AOL Wireless, which included Tegic Communications, Mobile AIM and AOL Mobile. During his tenure, AOL Wireless launched new mobile Web services and new predictive text software, expanded the reach of Mobile AIM, and built a wireless media player hardware and software reference design.</p>\n\n<p>Before joining AOL in June 2004, Eisler led Action Engine Corp. for over four years. As president and CEO, he raised more than $35 million dollars in venture capital and oversaw the creation of an award-winning mobile software platform deployed by wireless operators around the world.</p>\n\n<p>Prior to leaving to co-found Action Engine, Eisler was at Microsoft from June 1993 until January 2000. He was the general manager of the Windows Media Platform Group, an architect for multimedia in Microsoft Internet Explorer 4, the original developer and one of the three founding members of the Microsoft DirectX team, and a technical evangelist for Windows 95.</p>\n\n<p>Before moving to the U.S. and joining Microsoft in 1993, Eisler spent almost three years working on development tools at Watcom International Corp., a Canadian software company. Eisler holds 14 patents and has a joint bachelor&#8217;s degree in applied mathematics and computer science from the University of Waterloo in Ontario, Canada. He lives in the Seattle area with his wife and two sons. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}