{"first_name":"Craig","last_name":"Seldin","permalink":"craig-seldin","crunchbase_url":"http://www.crunchbase.com/person/craig-seldin","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jul 13 15:02:54 UTC 2012","updated_at":"Sat Jul 14 11:33:40 UTC 2012","overview":"<p>When in need of an attorney, the citizens of Houston know that Craig Seldin is the man for the job. Seldin has been serving the greater community of Houston for years through his legal firm. His dedication to his fellow Texans and to the law has made him one of the most prominent attorneys around. </p>\n\n<p>One of the things people look for in an attorney is mutual respect. Clients want to feel cared for and valued. Seldin offers precisely that. Many clients of other attorneys can feel that they are viewed as an income opportunity. Seldin, however, sees each patient as a human who needs assistance in an important legal matter.</p>\n\n<p>When taking on a case, Seldin makes certain that each client feels comfortable and valued. One of the first things he does is listen to the client. Particularly in cases of personal matters, clients want to feel that they are heard. Working with an attorney can get overwhelming, and Seldin ensures openness and comfort. He feels it is his legal and personal duty to listen to every client.</p>\n\n<p>In addition to Seldin’s personal care, clients can rest assured that he is well equipped to address a wide variety of legal cases. Both his undergraduate education and his studies in law have endowed him with the necessary knowledge. He approaches each case with an astute intelligence about the law. </p>\n\n<p>Seldin stands capable of addressing a broad range of client cases. They include DUI defense, misdemeanors, civil rights, family law, and much more. Seldin can settle any matter of legal issues, whatever the clients’ needs. His successes in legal cases stand as proof of Seldin’s abilities. In fact, some have seen settlements up to $100,000.</p>\n\n<p>And it isn’t just his clients that have the highest praise for him. Throughout his educational years and his career, Seldin has garnered the laud of many. In fact, he was designated as a representative for the Oxford University’s Rhodes Scholarship. Additionally, his home state of Texas awarded in the WOW Award for his amazing legal work. </p>\n\n<p>Seldin is determined and focused in his work. His knowledge and experience show his capabilities. When it comes down to it, a client couldn’t ask for more when they work with attorney Craig Seldin.  </p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/0781/200781v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/0781/200781v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/0781/200781v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}