{"first_name":"Craig","last_name":"Gosselin","permalink":"craig-gosselin","crunchbase_url":"http://www.crunchbase.com/person/craig-gosselin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jun 13 04:47:08 UTC 2009","updated_at":"Sat Jun 13 04:57:43 UTC 2009","overview":"<p>Craig is responsible for offer management, marketing, and communications at Tangoe. A leader with more than 20 years of experience, Craig has successfully led business units, marketing, and sales organizations in corporate, venture capital, and private equity environments. He has worked with leading brands in technology, financial services, and consumer products while also having managed large global operations teams.</p>\n\n<p>Prior to joining Tangoe, Craig held multiple senior marketing and sales positions. These include serving as Chief Marketing Officer at NewStep Networks, a technology leader in fixed mobile convergence, and Chief Marketing and Sales Officer at Velocita Wireless. Velocita was a Cerberus Capital portfolio company and a leader in wireless data networking that was successfully sold to Sprint Nextel in 2006, representing a significant increase in value. Prior to joining Velocita, Craig served as Vice President of Sales and Channel Marketing at Virgin Mobile USA. He joined the startup company prior to market launch and led the development of the distribution network and Virgin Mobile presence at over 30,000 locations, resulting in 2 million new customers. Previous to Virgin Mobile, Craig held the position of Senior Vice President at American Express. In this role, he led a 1000 person sales and service organization that had responsibility for service strategy, new account development, and product development. From 1986 to 1998, Craig held multiple leadership roles within AT&amp;T, directing large sales, product management, marketing, and service organizations. In his last assignment at AT&amp;T, he led the international consumer long distance business where he had profit and loss responsibility for a $3.5 Billion business unit.</p>\n\n<p>Craig received a B.S. degree in Electrical Engineering from Worcester Polytechnic Institute and a M.B.A. degree from the University of Houston, both with honors.</p>","image":null,"degrees":[{"degree_type":"M.B.A.","subject":"","institution":"University of Houston","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chief Marketing Officer","firm":{"name":"Tangoe","permalink":"tangoe","type_of_entity":"company","image":{"available_sizes":[[[136,82],"assets/images/resized/0004/8337/48337v2-max-150x150.png"],[[136,82],"assets/images/resized/0004/8337/48337v2-max-250x250.png"],[[136,82],"assets/images/resized/0004/8337/48337v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}