{"first_name":"Craig","last_name":"Mullaney","permalink":"craig-mullaney","crunchbase_url":"http://www.crunchbase.com/person/craig-mullaney","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Fri Nov 09 17:54:21 UTC 2012","updated_at":"Fri Nov 09 17:57:48 UTC 2012","overview":"<p>Craig M. Mullaney joined Ustream, the world’s leading live broadcast network, in 2011.  As Senior Vice President for Content, Strategy, &amp; Operations, Mullaney oversees media partnerships, programming, corporate strategy, and operations.  </p>\n\n<p>He previously led the operations, planning, and strategy portfolio at Development Innovation Ventures, a venture capital fund within the U.S. Agency for International Development (USAID) that identifies, tests, and scales breakthrough innovations to core challenges throughout the developing world.  He previously served at USAID as the senior adviser to the Administrator, Dr. Rajiv Shah, on Afghanistan and Pakistan.  In 2010, Devex named Mullaney a “40 Under 40 International Development Leader.”</p>\n\n<p>Before joining USAID, Mullaney served at the Pentagon in the Office of the Secretary of Defense as the Principal Director for Afghanistan, Pakistan, and Central Asia Policy and as the Chief of Staff for the Department of Defense Transition Team.  Prior to joining the Department of Defense, Mullaney was on the national security policy staff of President Obama’s 2008 presidential campaign. </p>\n\n<p>Mullaney graduated second in his class from the United States Military Academy.  After completing Ranger School, he continued to the University of Oxford on a Rhodes scholarship and earned two masters degrees in diplomatic and economic history.</p>\n\n<p>In 2003, Mullaney led an infantry rifle platoon along the hostile border between Afghanistan and Pakistan with the 10th Mountain Division as part of Operation Enduring Freedom.  His platoon, operating along a range from humanitarian assistance to combat engagements against al-Qaeda, earned the most combat decorations in the division.  Following his return to the United States, Mullaney joined the elite 3rd Infantry Regiment, “The Old Guard,” in Arlington, Virginia, responsible for Arlington National Cemetery burials, the Tomb of the Unknowns, and defense of the National Capital Region.  He served a three-year appointment to the history faculty of the U.S. Naval Academy in Annapolis, Maryland and led the International Scholarships Program to institutional and national record levels of success.  Mullaney’s military decorations include the Bronze Star, Army Commendation Medal with “V” device, Combat Infantryman’s Badge, Ranger Tab, and Parachutist Badge.</p>\n\n<p>Mullaney is the author of the 2009 New York Times bestseller The Unforgiving Minute: A Soldier’s Education, a Washington Post Best Books of 2009, Military Times Best Military Books of the Decade, and Barnes and Noble Discover Great New Writers selection.  He has appeared on The Charlie Rose Show, The CBS Early Show, BBC World News America, National Public Radio, The Colbert Report, and The Daily Show with Jon Stewart.  Mullaney speaks frequently about leadership, management, and education.  His speaking engagements have included Harvard Business School, U.S. Southern Command, Princeton University, JP Morgan Chase, military service academies, and numerous other business, academic, leadership, and policy forums.  Mullaney is a Term Member of the Council on Foreign Relations and Adjunct Fellow at the Pell Center for International Relations and Public Policy.</p>\n\n<p>A proud Rhode Island native, Craig currently resides in San Francisco, California.  A former wrestler, rower, marathoner, and sport parachutist, Mullaney’s current interests include cycling and barefoot hiking.</p>","image":{"available_sizes":[[[150,131],"assets/images/resized/0021/9700/219700v1-max-150x150.png"],[[207,182],"assets/images/resized/0021/9700/219700v1-max-250x250.png"],[[207,182],"assets/images/resized/0021/9700/219700v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Senior Vice President for Content, Strategy, & Operations","firm":{"name":"Ustream","permalink":"ustream","type_of_entity":"company","image":{"available_sizes":[[[150,33],"assets/images/resized/0017/1425/171425v4-max-150x150.png"],[[250,54],"assets/images/resized/0017/1425/171425v4-max-250x250.png"],[[450,98],"assets/images/resized/0017/1425/171425v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}