{"first_name":"Craig","last_name":"Johnson","permalink":"craig-johnson-2","crunchbase_url":"http://www.crunchbase.com/person/craig-johnson-2","homepage_url":"","birthplace":"","twitter_username":"cwj01","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Aug 08 13:19:15 UTC 2010","updated_at":"Sun Aug 08 22:16:25 UTC 2010","overview":"<p>A seasoned marketing professional who has the ability to instantly see the big picture and lead a team of people to successfully achieve results. </p>\n\n<p>Summary </p>\n\n<p>Craig has over 10+ years of marketing and sales experience, primarily focused in consumer packaged goods brand management working on nationally recognizable brands including Dr. Pepper, Seven Up, Arnold Bread Products, Johnson and Johnson and Glory Foods. Throughout his career, he has managed various brands under Cadbury Schweppes and Glory Foods and had success uncovering key consumer insights that initiated the development of marketing strategies, brand repositioning, and new product launches, all resulting in increases of volume and household penetration.</p>\n\n<p>Additionally, he has been instrumental in driving incremental sales by developing effective in-store programs through his knowledge of customer/shopper marketing on brands including Mission Tortillas, Emerald Nuts and Pop Secret Popcorn.</p>\n\n<p>Craig Johnson is a native of Tennessee. He earned his Bachelor of Science in Electrical Engineering from the University of Tennessee (Knoxville) and his MBA in Marketing from Clark Atlanta University.</p>","image":null,"degrees":[{"degree_type":"BS ","subject":"Electrical Engineering","institution":"University of Tennessee, Knoxville","graduated_year":1997,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"Marketing","institution":"Clark Atlanta University","graduated_year":2003,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}