{"first_name":"Craig","last_name":"Wood","permalink":"craig-wood-2","crunchbase_url":"http://www.crunchbase.com/person/craig-wood-2","homepage_url":"http://www.crowdfusion.com/","birthplace":"","twitter_username":"w3ace","blog_url":"http://www.craigsblog.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Sep 14 03:42:37 UTC 2009","updated_at":"Thu Feb 17 02:10:24 UTC 2011","overview":"<p>Craig Wood is the CTO of Crowd Fusion.</p>\n\n<p>Craig Wood is an avid search enthusiast and a pioneer in the SEO industry since 1995. His expertise in SEO, SEM, trend spotting, data mining, spam fighting and leading distributed technology teams proves invaluable in advancing the vision and capabilities of Crowd Fusion. Some of Craig’s past projects include Did-it.com, Netscape (social news and search) and Blogsmith.</p>\n\n<p>As Chief Technology Officer of Did-it.com, Craig was responsible for a number of remarkable innovations, including architecting and engineering the Did-it.com Detective – a tool used by tens of thousands of early adopter search marketers to test their inclusion, distribution and position in what was then the top 10 search engines including memorable brands like Infoseek, Altavista, OpenText, Excite and Yahoo.</p>\n\n<p>Craig engineered and built Did-it Plus, a search engine optimization technology that was one of the first search engine strategies for eBay, University of Phoenix Online, Deja News and Playboy, as well as over two thousand other search marketers. Did-it Plus created a pay-per-click search model for search engine placement before Goto.com created the first PPC Search Engine.</p>\n\n<p>Craig co-authored and served as the technology editor of the original Search Engine Secrets, which sold 50,000 copies and explained advanced strategies for getting top placement in search engine results.</p>\n\n<p>As a zeitgeist aficionado, continually looking for new ways to condense the fire hose of content available on the internet into easily consumable chunks, Craig continues his passion for innovation both in the expansion of the Crowd Fusion platform and in popular experimental sites like wikirage, his Wikipedia edit tracker.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"COO, Co-founder","firm":{"name":"Crowd Fusion","permalink":"crowd-fusion","type_of_entity":"company","image":{"available_sizes":[[[150,59],"assets/images/resized/0005/8638/58638v1-max-150x150.png"],[[217,86],"assets/images/resized/0005/8638/58638v1-max-250x250.png"],[[217,86],"assets/images/resized/0005/8638/58638v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}