{"first_name":"Craig","last_name":"Forman","permalink":"craig-forman","crunchbase_url":"http://www.crunchbase.com/person/craig-forman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Where","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Dec 23 21:53:48 UTC 2009","updated_at":"Tue Jul 05 19:07:31 UTC 2011","overview":"<p>Craig Forman is a media, technology and telecommunications executive, entrepreneur and investor. </p>\n\n<p>For the past two years, Forman served on the board and as executive chairman at mobile location services leader WHERE Inc., which was acquired by EBay Inc. in April 2011. He also serves on several other private company boards.</p>\n\n<p>Previously, as President, Access &amp; Audience at EarthLink Inc., Forman was responsible for more than $1.2 billion in annual revenue and leadership of the Access, PeoplePC, Voice, and Value-added Services businesses. He also led such shared services as Operations, Information Technology and Customer Support. This group&#8217;s mandate is to deliver best-in-class Internet access and offer engaging products and applications that are not only safe, secure, and reliable, but also useful, valuable, and enjoyable.</p>\n\n<p>Before joining EarthLink in March 2006 as executive vice president and president of EarthLink&#8217;s Value Added Services group, Forman was a senior executive at Yahoo Inc., where he had served since Feb. 2004 as head of that Internet portal company&#8217;s Media and Information businesses. In that role, Forman led Yahoo&#8217;s News, Finance, Sports, Health, Weather, Education, Kids, and Astrology businesses.</p>\n\n<p>As a business executive and entrepreneur, Forman has taken his career to the intersection of media, technology, and communications. Before joining EarthLink, Forman served for 4 years as CEO and co-founder of Success Television and MyPrimeTime Inc., a television production and venture-backed Internet company. Forman and his team produced 2 business and lifestyle PBS television series, &#8220;Great Entrepreneurs&#8221; and &#8220;Great Leaders,&#8221; as well as broadband programming and an award-winning Internet site targeted at 35-54 year-old baby boomers. Forman is non-executive chairman of Success Television.</p>\n\n<p>Earlier, Forman served as a senior operating executive at Time Warner&#8217;s CNN Group and Time Inc. divisions, and at The Wall Street Journal/Dow Jones. He also was a member of the management team that took early search-engine Infoseek public. As VP at CNN Financial News, Forman led the team that made CNNfn.com one of the leading financial websites, and one of the first news sites to turn profitable. As VP-Worldwide Development at Time Inc. New Media, Forman managed the Internet businesses of Fortune and Money magazines while also serving as CEO of Thrive, a healthy-living joint venture with AOL. Previously, as Infoseek&#8217;s first editor and VP of Product Management, Forman helped build one of the pioneering search engines.</p>\n\n<p>Prior to his joining Infoseek, Forman served as a general manager, editor, bureau chief, and foreign correspondent at Dow Jones and The Wall Street Journal. As director of DJ&#8217;s Business Information Services International unit, Forman helped develop the Online Journal globally, and expanded the electronic-publishing division to over 50 countries. As Tokyo Bureau Chief of the Journal, Forman diversified the output of the bureau into broadcast as well as print. While based in London as the Journal&#8217;s Deputy Bureau Chief, Forman was a member of the 1991 Persian Gulf War reporting team that was finalist for a Pulitzer Prize.</p>\n\n<p>Forman has a master&#8217;s degree in law from Yale and an undergraduate degree from Princeton. </p>","image":{"available_sizes":[[[127,150],"assets/images/resized/0014/2522/142522v2-max-150x150.jpg"],[[212,250],"assets/images/resized/0014/2522/142522v2-max-250x250.jpg"],[[382,450],"assets/images/resized/0014/2522/142522v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"AB","subject":"WWS","institution":"Princeton University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MSL","subject":"","institution":"Yale Law School","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Executive Chairman ","firm":{"name":"Where","permalink":"where-com","type_of_entity":"company","image":{"available_sizes":[[[150,70],"assets/images/resized/0006/3338/63338v13-max-150x150.png"],[[250,117],"assets/images/resized/0006/3338/63338v13-max-250x250.png"],[[450,211],"assets/images/resized/0006/3338/63338v13-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/cforman","title":""}]}