{"first_name":"Craig","last_name":"Smith","permalink":"craig-smith-4","crunchbase_url":"http://www.crunchbase.com/person/craig-smith-4","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jan 29 12:09:34 UTC 2011","updated_at":"Sat Jan 29 12:10:46 UTC 2011","overview":"<p>Craig Smith is responsible for Virtify’s worldwide sales and partner organization. He has twenty years of sales leadership experience building enterprise software companies in the content management and life sciences software industries. </p>\n\n<p>Smith joins Virtify from ClearTrial, the leader in clinical trials operation software for planning, forecasting and tracking clinical trials where he led sales to record levels and helped establish its clinical services organization.  Previously, as VP of Sales at Media Publisher (now Qumu) Smith built the  sales team that acquired the initial customers resulting in the company’s market leadership position in Enterprise Video Communications. As VP of Enterprise Sales at iManage, he established record enterprise sales for collaborative content management software resulting in an acquisition by Interwoven and subsequently Autonomy.  As VP of North American Sales at Saba Software, a leader in e-learning and performance management software, he led the sales organization in acquiring its first 100 enterprise customers and the transition to being a publicly-traded company.  As process industries sales director for Documentum, Smith was a key member of the team that built Documentum&#8217;s pharmaceutical industry leadership position from the earliest customers, growing revenues ten-fold and transitioning it to a publicly-traded company.  Smith also had a key sales role in developing Perkin Elmer’s life sciences industry leadership position with the SQL*LIMS laboratory information management solution.  Smith holds a BS in Chemical Engineering from the University of Kentucky.</p>","image":null,"degrees":[{"degree_type":"BS","subject":"Chemical Engineering","institution":"University of Kentucky","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Vice President ","firm":{"name":"Virtify","permalink":"virtify","type_of_entity":"company","image":{"available_sizes":[[[150,39],"assets/images/resized/0007/2801/72801v1-max-150x150.png"],[[220,58],"assets/images/resized/0007/2801/72801v1-max-250x250.png"],[[220,58],"assets/images/resized/0007/2801/72801v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}