{"first_name":"craig","last_name":"nobles","permalink":"craig-nobles","crunchbase_url":"http://www.crunchbase.com/person/craig-nobles","homepage_url":"http://www.swaggmedia.com","birthplace":"los angeles","twitter_username":"swaggmediatv","blog_url":"http://www.swaggmediawifi.com","blog_feed_url":"http://www.smistreaming.com","affiliation_name":"Unaffiliated","born_year":1957,"born_month":7,"born_day":21,"tag_list":"proctor-and-gamble, mobile, digital, music, film, d2c-ecommerce, distribution","alias_list":null,"created_at":"Sun Nov 07 20:36:26 UTC 2010","updated_at":"Tue Oct 09 21:11:15 UTC 2012","overview":"<p>CRAIG NOBLES INNOVATOR | TRENDSETTER | DRIVEN | GENIUS</p>\n\n<p>Once a DJ in Los Angeles, the California - bred music mogul’s journey began in 1973 entertaining the likes of David Lee Roth and Eddie Van Halen while growing up in Pasadena. Contributing to some of the most popular events in and around Greater Los Angeles, Craig Nobles fell in love with music and developing relationships with artists, promoters, and executives alike. Heeding the advice of his mentor, Maurice Warfield, Nobles jumped at the opportunity to shadow one of the greatest in the business. Though he would continue developing his skills as a DJ and Socialite/Entrepreneur, Craig Nobles was determined to get the respect from the industry his remarkable talent deserved, all while fine tuning his skills in the areas of marketing, sales, A&amp;R, publicity, and promotions. “I thought this was it, but one day I just needed a change, so I moved to New York. “\nIronically, the fall of 1983 ushered in those changes, he moved to New York and again resumed entertaining amongst the premieres of nightlife. This would lead to other projects including an assistant position with Harry Belafonte and most notably BEAT STREET, where he taught the actors the DJ style of scratching and assisted in the A&amp;R administration of the soundtrack. Just a glimpse of things to come&#8230;Refusing to follow trends, Craig Nobles awed his peers with his drive and passion for music.</p>\n\n<p>Joining Grand Jury Productions, Craig Nobles balanced his daily duties as A&amp;R, Marketing, Promotions, Sales, Business Affairs, and Deal Negotiations on behalf of Grand Jury artists with major labels such as Interscope, Warner Brothers, and RCA to name a few. Having grown within the era of Irving Azoff, Russell Simmons, Barry Wiess Steve Berman, Doug Morris, and Steve Rifkind – greatness was never an option.\n“The formula I use is real and so are the results,” says Nobles. Time will only tell, but looking at history, the future looks bright.</p>\n\n<p>Specialties</p>\n\n<ul>\n<li>Experienced in budget allocation, forecasting, contract negotiating, marketing, imaging, strategic planning &amp; project management as well as building and maintaining partnerships.</li>\n<li>Knowledgable on youth/pop culture and developing strategies for target demographics.</li>\n<li>Extensive knowledge and experience in recording, egineering, production of multi media.</li>\n<li>Experience in developing online/mobile campaigns, integrated sites, building/running online and ground street teams, grass roots marketing</li>\n</ul>","image":{"available_sizes":[[[150,76],"assets/images/resized/0010/9066/109066v2-max-150x150.png"],[[250,128],"assets/images/resized/0010/9066/109066v2-max-250x250.png"],[[450,230],"assets/images/resized/0010/9066/109066v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"http://youtu.be/XARrNW1pMpU","description":"<p>Morning Workout&#8230;</p>"}],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/craignobles","title":""},{"external_url":"http://www.swaggmedia.com","title":""}]}