{"first_name":"Craig","last_name":"Ellrod","permalink":"craig-ellrod","crunchbase_url":"http://www.crunchbase.com/person/craig-ellrod","homepage_url":"http://craig.ellrod.com","birthplace":"Silicon Valley, CA, USA","twitter_username":"craigellrod","blog_url":"http://craig.ellrod.com","blog_feed_url":"http://craig.ellrod.com/feed/","affiliation_name":"Send My Kid","born_year":1964,"born_month":8,"born_day":1,"tag_list":"craig, ellrod, technical-marketing, product-management, founder, ceo, tech-geek","alias_list":null,"created_at":"Wed Jun 06 20:25:25 UTC 2012","updated_at":"Sat Jun 09 17:57:44 UTC 2012","overview":"<p>Craig has over 25 years experience in the tech industry.</p>\n\n<p>Craig holds a Bachelor of Science in Computer Science from California State University, Chico, and a Masters in Business Administration from Pepperdine University. He has held many positions in the computer industry including software programmer, technical support, field and corporate system engineering, technical and product marketing, product management and sales. He has worked for companies such as Celerity Computing, Emulex, Pinnacle Storage, Sync Research, Cisco Systems, Extreme Networks, smaller startup ventures and now Citrix Systems. He has authored several patent applications, patent designs and received an innovation award while at Extreme Networks.</p>\n\n<p>Craig wrote the book on Technical Marketing. He is the founder of the Technical Marketing Group based in the heart of Silicon Valley, and runs a Technical Marketing Blog and online forum.</p>\n\n<p>Craig has extensive experience setting up wordpress blog sites and websites that incorporate social media plugins, and in making those blogs seamlessly integrate with social media platforms such as Twitter, LinkedIn, Facebook and YouTube. Craig knows HTML and PHP, and understands web technologies, especially Web 2.0 such as XML, RSS, Yahoo Pipes and AJAX, but is not a programmer by profession. Craig has recent experience in the Application Delivery Controller market space, so he knows what a web application looks like from the front-end web interface, the security in front of it, to the database server and storage on the back-end. Craig is an operations guy and knows how to take a website from a single server, shared hosting environment all the way to a mid-range dedicated hosting environment, to a large scale production environment. Craig is familiar with load balancing, high availability, security, performance management and capacity planning.</p>","image":{"available_sizes":[[[100,100],"assets/images/resized/0019/4246/194246v2-max-150x150.jpg"],[[100,100],"assets/images/resized/0019/4246/194246v2-max-250x250.jpg"],[[100,100],"assets/images/resized/0019/4246/194246v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BSCS","subject":"Computer Science","institution":"California State University, Chico","graduated_year":1986,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"Business Management","institution":"Pepperdine","graduated_year":1991,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder, CEO","firm":{"name":"Send My Kid","permalink":"send-my-kid","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://twitter.com/#!/SendMyKid","title":"@sendmykid"},{"external_url":"http://www.facebook.com/pages/SendMyKid/325015494220171","title":"Facebook"},{"external_url":"http://www.linkedin.com/groups/Send-My-Kid-3963502","title":"LinkedIn"}]}