{"first_name":"Craig","last_name":"Schlawin","permalink":"craig-schlawin","crunchbase_url":"http://www.crunchbase.com/person/craig-schlawin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Mar 25 10:54:46 UTC 2011","updated_at":"Fri Mar 25 10:55:44 UTC 2011","overview":"<p>Craig Schlawin joined BridgePoint Medical as Director of Quality with responsibilities for the development of the Quality Management System (QMS) and documentation systems. He has over 27 years experience in quality and medical device manufacturing, including leadership roles in quality assurance at leading medical technology companies such as Aequitron Medical, Nellcor Puritan Bennett, eMed, IntraTherapeutics, Acorn Cardiovascular, Pulmonetic Systems, Viasys and Lumen Biomedical, Inc. where he developed, designed and obtained compliance of the quality systems in accordance with ISO and FDA QSR requirements. Craig has broad experience in product design, development, sterilization and regulatory requirements. Previously he has served as Manager of Quality Assurance, Manager of Design Services, where he was the senior mechanical engineer for the next generation of apnea and ventilator products, Test Engineering Manager and Sustaining Engineering Manager. Craig is named on two US medical device patents, with others pending.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Vice President of Quality Assurance","firm":{"name":"BridgePoint Medical","permalink":"bridgepoint-medical","type_of_entity":"company","image":{"available_sizes":[[[150,72],"assets/images/resized/0008/0345/80345v1-max-150x150.jpg"],[[216,104],"assets/images/resized/0008/0345/80345v1-max-250x250.jpg"],[[216,104],"assets/images/resized/0008/0345/80345v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}