{"first_name":"Craig","last_name":"Mundie","permalink":"craig-mundie-2","crunchbase_url":"http://www.crunchbase.com/person/craig-mundie-2","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Microsoft","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Wed Nov 16 00:54:47 UTC 2011","updated_at":"Wed Nov 16 00:55:02 UTC 2011","overview":"<p>Craig Mundie is chief research and strategy officer of Microsoft Corp., reporting to CEO Steve Ballmer. In this role, he oversees Microsoft Research, one of the world&#8217;s largest computer-science research organizations, and is responsible for Microsoft&#8217;s long-term technology strategy. Mundie also directs a number of technology incubations, and works with government and business leaders around the world on technology policy, regulation and standards.</p>\n\n<p>Mundie has spent much of his career building startups in various fields, including supercomputing, consumer electronics, education, healthcare and robotics. He joined Microsoft in 1992 to create and run the Consumer Platforms Division, which developed non-PC platforms such as the Windows CE operating system; software for the Handheld PC, Pocket PC and Auto PC; and early console-gaming products. Mundie also started Microsoft&#8217;s digital-TV efforts, acquiring and managing its WebTV Networks subsidiary, and built its fast-growing healthcare solutions business.</p>\n\n<p>Prior to his current role, Mundie served as Microsoft&#8217;s chief technical officer for advanced strategies and policy, working with Microsoft Chairman Bill Gates to develop the company&#8217;s global strategies around technical, business and policy issues. Another long-standing focus for Mundie is privacy, security and cyber-security. He initiated Microsoft&#8217;s Trustworthy Computing initiative, which has leveraged new software-development practices to significantly improve the security of the company&#8217;s products.</p>\n\n<p>For more than a decade, Mundie has also been Microsoft&#8217;s principal technology-policy liaison to the U.S. and foreign governments, with an emphasis on China, India and Russia. He has served on the U.S. National Security Telecommunications Advisory Committee and the Markle Foundation Task Force on National Security in the Information Age. In April 2009 Mundie was appointed by President Barack Obama to the President&#8217;s Council of Advisors on Science and Technology.</p>\n\n<p>Mundie started his career in 1970, working on operating-system development for the Data General NOVA at Systems Equipment Corp. (SEC) while still studying at Georgia Tech. SEC was subsequently acquired by Data General Corp., where Mundie went on to develop the INFOS data-management system. In 1977 Mundie moved to Data General&#8217;s advanced development facility in Research Triangle Park, N.C., ultimately becoming its director. In 1982, Mundie was one of three co-founders of Alliant Computer Systems Corp., which developed vector-parallel mini-supercomputers. He held a variety of positions at Alliant before becoming CEO. The company shut down in 1992.</p>\n\n<p>Mundie holds a bachelor&#8217;s degree in electrical engineering and a master&#8217;s degree in information theory and computer science from Georgia Tech. Mundie enjoys traveling and spending time on his boat. He is married, with one married daughter.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0016/2556/162556v1-max-150x150.jpg"],[[178,250],"assets/images/resized/0016/2556/162556v1-max-250x250.jpg"],[[321,450],"assets/images/resized/0016/2556/162556v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Research and Strategy Officer","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}