{"first_name":"Craig","last_name":"R. Barrett","permalink":"craig-r-barrett","crunchbase_url":"http://www.crunchbase.com/person/craig-r-barrett","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Intel","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":"","created_at":"Tue Jul 08 18:26:07 UTC 2008","updated_at":"Sun Mar 14 05:57:19 UTC 2010","overview":"<p>Dr. Craig Barrett is a leading advocate for improving education in the U.S. and around the world. He is also a vocal spokesman for the value technology can provide in raising social and economic standards globally. He recently stepped down as Chairman of the Board of Intel Corporation, a post he held from May 2005 to May 2009.</p>\n\n<p>Craig Barrett was born August 29, 1939 in San Francisco, California. He attended Stanford University in Palo Alto, California from 1957 to 1964, and received his Bachelor of Science, Master of Science and Ph.D. degrees in Materials Science. After graduation, he joined the faculty of Stanford University in the Department of Materials Science and Engineering, and remained through 1974, rising to the rank of Associate Professor. Dr. Barrett was a Fulbright Fellow at Danish Technical University in Denmark in 1972 and a NATO Postdoctoral Fellow at the National Physical Laboratory in England from 1964 to 1965. Dr. Barrett is the author of over 40 technical papers dealing with the influence of microstructure on the properties of materials, and a textbook on materials science, Principles of Engineering Materials.</p>\n\n<p>Dr. Barrett joined Intel Corporation in 1974 as a technology development manager. He was named a vice president of the corporation in 1984, promoted to senior vice president in 1987, and executive vice president in 1990. Dr. Barrett was elected to Intel Corporation&#8217;s Board of Directors in 1992 and was named the company&#8217;s chief operating officer in 1993. He became Intel&#8217;s fourth president in May 1997, chief executive officer in 1998 and chairman of the Board on May 18, 2005.</p>\n\n<p>Dr. Barrett served until June 2009 as Chairman of the United Nations Global Alliance for Information and Communication Technologies and Development, which works to bring computers and other technology to developing parts of the world. He co-chairs Achieve, Inc., is vice chairman of the National Forest Foundation, serves on the Board of Directors of Science Foundation Arizona and Dossia, the advisory board of the Peter G. Peterson Foundation, the faculty of Thunderbird School of Global Management, and is Honorary Chairman of the Irish Technology Leadership Group. Dr. Barrett has recently been appointed by the President as one of the private sector leaders for a national education science, technology, engineering and math (STEM) initiative. He has served on numerous boards, policy and government panels, and has been an appointee of the President&#8217;s Advisory Committee for Trade Policy and Negotiations and to the American Health Information Community. Dr. Barrett has co-chaired the Business Coalition for Student Achievement and the National Innovation Initiative Leadership Council, and has served as a member of the Board of Trustees for the U.S. Council for International Business and the Clinton Global Initiative Education Advisory Board. He has been a member of the National Governors&#8217; Association Task Force on Innovation America, the National Infrastructure Advisory Council, the Committee on Scientific Communication and National Security, the U.S.-Brazil CEO Forum and is past chair of the National Academy of Engineering. Dr. Barrett formerly served on the Board of Directors of the U.S. Semiconductor Industry Association, the National Action Council for Minorities in Engineering, and TechNet.</p>","image":{"available_sizes":[[[150,143],"assets/images/resized/0008/0249/80249v1-max-150x150.jpg"],[[197,188],"assets/images/resized/0008/0249/80249v1-max-250x250.jpg"],[[197,188],"assets/images/resized/0008/0249/80249v1-max-450x450.jpg"]],"attribution":"<p>Intel / <a href=\"http://www.intel.com/pressroom/kits/bios/barrett.htm\" title=\"Intel\" rel=\"nofollow\">Intel</a></p>"},"degrees":[{"degree_type":"Ph.D","subject":"Materials Science","institution":"Stanford","graduated_year":1964,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"CEO And Chairman of the Board","firm":{"name":"Intel","permalink":"intel","type_of_entity":"company","image":{"available_sizes":[[[150,99],"assets/images/resized/0001/0592/10592v1-max-150x150.jpg"],[[250,165],"assets/images/resized/0001/0592/10592v1-max-250x250.jpg"],[[450,297],"assets/images/resized/0001/0592/10592v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}