{"first_name":"Craig","last_name":"Rosenblatt","permalink":"craig-rosenblatt","crunchbase_url":"http://www.crunchbase.com/person/craig-rosenblatt","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"3Cinteractive","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jul 12 13:11:52 UTC 2012","updated_at":"Mon Jul 16 21:15:20 UTC 2012","overview":"<p>Craig Rosenblatt is the chief financial officer at 3Cinteractive (3Ci). He is responsible for the financial leadership of 3Ci as well as providing guidance on the strategic direction of the company.</p>\n\n<p>Prior to 3Ci, Rosenblatt was a senior vice president at Morgan Keegan Technology Group, the nation’s largest middle market investment banking practice focused on technology companies. While at Morgan Keegan he led the wireless practice and was responsible for deal origination, relationship management and transaction execution.</p>\n\n<p>Before joining Morgan Keegan Technology Group, he worked for Mooreland Partners, a boutique investment bank focused exclusively on the technology industry. During his tenure at Mooreland Partners, Rosenblatt specialized in communication equipment and software and advised companies in industry sectors such as wireless and wireline systems, infrastructure equipment, and security software. </p>\n\n<p>Previously, he worked for Avaya Inc., an enterprise communications systems company, where his roles included strategic planning and evaluating acquisition opportunities. </p>\n\n<p>Prior to joining Avaya, Rosenblatt spent five years as Principal at Texas Pacific Group, a global private equity firm where he was responsible for originating investment opportunities, conducting business and financial due diligence, and structuring and negotiating transactions. </p>\n\n<p>Rosenblatt earned a master’s in business administration from Columbia Business School and graduated magna cum laude from Harvard University with a bachelor’s degree in economics.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Financial Officer","firm":{"name":"3Cinteractive","permalink":"3c-interactive","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0006/4740/64740v6-max-150x150.jpg"],[[250,84],"assets/images/resized/0006/4740/64740v6-max-250x250.jpg"],[[450,151],"assets/images/resized/0006/4740/64740v6-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}