{"first_name":"Crawford","last_name":"Del Prete","permalink":"crawford-del-prete","crunchbase_url":"http://www.crunchbase.com/person/crawford-del-prete","homepage_url":"http://www.idc.com","birthplace":"Boston","twitter_username":"craw","blog_url":"","blog_feed_url":"","affiliation_name":"IDG Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Sep 08 01:18:37 UTC 2010","updated_at":"Sat Feb 18 11:49:01 UTC 2012","overview":"<p>Crawford Del Prete, Executive Vice President, Worldwide Research Products &amp; Chief Research Officer manages IDC&#8217;s largest research organization. This includes IDC&#8217;s Consulting, Enterprise Computing, Storage, Networking, Integration, Development and Application Software Strategies, Professional Services, Telecommunications, Personal Computing, Mobility, Consumer, Digital Marketplace and New Media, SMB, Vertical Markets and WW Tracker research practices. Mr. Del Prete is also responsible for IDC&#8217;s Industry Insights Companies, which specifically target the needs of end users in six vertical segments. </p>\n\n<p>Mr. Del Prete is a leading authority on the IT industry and has completed extensive research on the structure and evolution of the information technology industry. In 2001, Mr. Del Prete forged IDC&#8217;s partnership with Innosight, the consultancy founded by Harvard Business School Professor Clayton Christensen. Together, the companies have created a body of work to understand and predict trends in disruptive innovation. Mr. Del Prete also serves as IDC&#8217;s lead analyst covering Hewlett Packard. </p>\n\n<p>Mr. Del Prete joined IDC in 1989. At that time he initiated coverage of the Winchester Disk Drive market, and was a founder of IDC&#8217;s European and Asia Pacific storage research programs. In 1997, Mr. Del Prete founded IDC&#8217;s coverage of the Semiconductor marketplace. In 1995, Mr. Del Prete was honored with IDC&#8217;s James Peacock award for research excellence, IDC&#8217;s highest honor. That same year he was voted &#8220;most valuable&#8221; storage analyst by an outside panel of his peers from the International Disk Equipment Manufacturers Association. Mr. Del Prete is a member of the United States Computer History Museum Storage Committee. </p>\n\n<p>Prior to IDC, Mr. Del Prete was at Installed Technology International. Before this, he was with Paine Webber Jackson and Curtis in New York in the government securities and commercial lending sectors. Mr. Del Prete holds a B.A. from Michigan State University. </p>","image":{"available_sizes":[[[115,150],"assets/images/resized/0010/0901/100901v2-max-150x150.jpg"],[[191,250],"assets/images/resized/0010/0901/100901v2-max-250x250.jpg"],[[345,450],"assets/images/resized/0010/0901/100901v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"","institution":"Michigan State University","graduated_year":1987,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Advisor","firm":{"name":"IDG Ventures","permalink":"idg-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,29],"assets/images/resized/0002/9640/29640v2-max-150x150.png"],[[171,34],"assets/images/resized/0002/9640/29640v2-max-250x250.png"],[[171,34],"assets/images/resized/0002/9640/29640v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/craw","title":""}]}