{"first_name":"Creflo","last_name":"Dollar","permalink":"creflo-dollar","crunchbase_url":"http://www.crunchbase.com/person/creflo-dollar","homepage_url":"http://www.creflodollarministries.org/","birthplace":"Atlanta ","twitter_username":"Creflo_Dollar","blog_url":"http://creflodollarblog.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"creflo-dollar, pastor-creflo-dollar","alias_list":null,"created_at":"Fri Jul 13 19:41:53 UTC 2012","updated_at":"Sat Jul 14 22:44:44 UTC 2012","overview":"<p>Creflo Dollar is the founder and senior pastor of World Changers Church International (WCCI) in College Park, Georgia which serves nearly 30,000 members, and World Changers Church-New York which hosts over 6,000 worshippers each week. With more than 25 years in ministry, Creflo Dollar is committed to bringing the good news of Jesus Christ to people all over the world, literally changing the world one person at a time.\nA former educational therapist, Creflo Dollar received the vision for World Changers Ministries Christian Center in 1986. He held the church’s first worship service in the cafeteria of Kathleen Mitchell Elementary School in College Park, Georgia, with only eight people in attendance. Over the years the ministry grew rapidly and was renamed World Changers Church International. The congregation moved from the cafeteria to a modest-sized chapel, adding a weekly radio broadcast and four services each Sunday. On December 24, 1995, WCCI moved into its present location, the 8,500-seat sanctuary known as the World Dome. At a cost of nearly $18 million, the World Dome was built without any bank financing. The construction of the World Dome is a testament to the miracle-working power of God and remains a model of debt-freedom that ministries all over the world emulate.\nA native of College Park, Georgia, Creflo Dollar has a bachelors degree in education, a masters degree in counseling, and a doctorate in counseling. He was awarded an honorary Doctor of Divinity degree from Oral Roberts University in 1998. He is the publisher of CHANGE magazine, a quarterly international publication with nearly 100,000 subscribers, and The Max, a bimonthly resource newsletter for ministers and ministry leaders. His award-winning Changing Your World television broadcast reaches nearly 1 billion homes in practically every country in the world.\nA much sought-after conference speaker and best-selling author, Creflo Dollar is known for his practical approach to the Bible and has encouraged thousands to pursue a personal relationship with God. Creflo Dollar and his wife, Taffi, have five children and live in Atlanta.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0020/0837/200837v2-max-150x150.jpg"],[[200,200],"assets/images/resized/0020/0837/200837v2-max-250x250.jpg"],[[200,200],"assets/images/resized/0020/0837/200837v2-max-450x450.jpg"]],"attribution":"<p>Creflo Dollar</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}