{"first_name":"Cricket","last_name":"Proline","permalink":"cricket-proline","crunchbase_url":"http://www.crunchbase.com/person/cricket-proline","homepage_url":"http://www.cricketproline.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1978,"born_month":9,"born_day":19,"tag_list":"cricket, cricket-bats, cricket-balls, cricket-gloves, cricket-pads, e-store, thigh-guard, stumps, cricket-helmet","alias_list":null,"created_at":"Tue Aug 17 19:16:08 UTC 2010","updated_at":"Tue Aug 17 19:39:17 UTC 2010","overview":"<p>Cricketproline.com is an international cricket supplier that has brought the world&#8217;s Top Brands available to all cricketing enthusiasts at the click of a mouse.  The webs store caters to all spectra of cricketing enthusiasts. From beginners to professionals - all can be assured  of finding something of interest here on this store.</p>\n\n<p>Our range is very competitively priced and 100% genuine, so you can purchase with confidence and full satisfaction knowing that you are dealing with a company of international repute.</p>\n\n<p>We proudly state - &#8220;We cater to All your cricketing Needs.&#8221;</p>\n\n<p>Cricketproline.com is also an initiative to bridge the gap between the haves and have&#8211;nots in the cricketing world. Whether the requirement is for a High end Bat or for a practice bat, we cater to all your needs and requirements.</p>\n\n<p>Cricketproline.com is also a repository of some great cricketing trivia, amazing statistics and also a collection of some of the best articles that can be found on the cricketing world.</p>","image":{"available_sizes":[[[150,50],"assets/images/resized/0009/8183/98183v2-max-150x150.jpg"],[[250,83],"assets/images/resized/0009/8183/98183v2-max-250x250.jpg"],[[294,98],"assets/images/resized/0009/8183/98183v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}