{"first_name":"Cristian","last_name":"FRANCU","permalink":"cristian-francu","crunchbase_url":"http://www.crunchbase.com/person/cristian-francu","homepage_url":"http://www.klevertravel.ro","birthplace":"Romania","twitter_username":"cristianfrancu","blog_url":"http://www.klevertravel.ro/lifestyle.html","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1980,"born_month":9,"born_day":4,"tag_list":"travel, tourism, turism, romania, business, internet, bucharest","alias_list":null,"created_at":"Mon Dec 06 17:11:09 UTC 2010","updated_at":"Sat Jul 09 01:19:22 UTC 2011","overview":"<p>Your Romanian Professional Problem Solver, Travel &amp; Events Consultant, Free Time Alchemist, Architect of Bridges between Souls&#8230; and Friend</p>\n\n<p>Cristian has developed one of the first choices Travel Agencies in the Romanian travel market.</p>\n\n<p>Cristian is a 30 years old, open-minded, motivated, ambitious, energetic young Romanian, an &#8216;enthusiastic&#8217; entrepreneur who knows that, &#8216;together we are stronger&#8217;. </p>\n\n<p>He is an Academy of Economic Studies in Bucharest Alumnus - so he has a Bachelor Degree in Economics. He was a proud member of the VIP - Volunteers for Ideas and Projects organization, until June 2003, when he graduated ASE.</p>\n\n<p>He was Marketing Officer, Project Manager, HR Manager and then President of VIP, and now I am a member in the VIP Board of Directors. </p>\n\n<p>During his studies, he had a full time position as Advertising Manager for a small Publishing House. </p>\n\n<p>In 2004 he was Project Manager at Kondiment Solutions. His business was the implementation and development of a Travel Portal - www.KleverTravel.com. </p>\n\n<p>He also founded with 2 partners the MindSmith Group (wwwMindSmith.ro)</p>\n\n<p>His 110% focus today is on the Travel &amp; Events Consulting and Problem Solving Agency he founded in 2006!</p>\n\n<p>He is the C.E.O. of KLEVER TRAVEL (www.KleverTravel.ro)</p>\n\n<p>Their purpose is to provide travel &amp; corporate services of superior quality in order to improve your travel experiences and to organize the best corporate events for our partners. Your problems become their challenges and opportunities. While they help you save money and time you’ll forget about any traveling or event organizing related stress and worries.</p>\n\n<p>Klever Travel&#8217;s mission is to meet your everyday needs, to anticipate and understand your aspirations and expectations in order to Kleverly respond with special, individualized travel and corporate services. </p>\n\n<p>Also, Cristian is a MindSmith Trainer and Coach . (Please check www.Mindsmith.ro)</p>\n\n<p>His Personal Mission is</p>\n\n<ul>\n<li><p>to inspire, motivate, train, teach and coach others helping them to build their own success stories, empowering them to Perform their Magic, and</p></li>\n<li><p>to support companies in their path towards excellence helping them to become &#8216;built to last organizations&#8217;.\nOn the long-term, He wants to become a millionaire in euro for what it will make of him to achieve it.</p></li>\n</ul>\n\n<p>He is sure that life is consistently testing us for our level of commitment and for our determination to achieve our goals and dreams. He is sure that the life’s greatest rewards are reserved for those who demonstrate a never-ending commitment and determination, great passion and adaptability, and the will to act proactively until they succeed. This kind of proactivity, commitment and determination can move mountains if it’s constant and consistent.</p>","image":{"available_sizes":[[[147,150],"assets/images/resized/0011/3036/113036v4-max-150x150.jpg"],[[246,250],"assets/images/resized/0011/3036/113036v4-max-250x250.jpg"],[[293,297],"assets/images/resized/0011/3036/113036v4-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.klevertravel.ro","title":""},{"external_url":"http://www.facebook.com/cristianfrancu","title":""},{"external_url":"http://twitter.com/cristianfrancu","title":""}]}