{"first_name":"Cristian","last_name":"Mitreanu","permalink":"cristian-mitreanu","crunchbase_url":"http://www.crunchbase.com/person/cristian-mitreanu","homepage_url":"http://www.CristianMitreanu.com","birthplace":"Romania","twitter_username":null,"blog_url":"http://www.BizBigPic.com/CristianMitreanu","blog_feed_url":"http://www.bizbigpic.com/cristianmitreanu/atom.xml","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"mitreanu, cristian, redefiningstrategy, bizbigpic, spointra, redefining, strategy, ofmos, tofmos, needs, innovation, commoditization","alias_list":null,"created_at":"Fri Jul 25 00:50:15 UTC 2008","updated_at":"Mon Jul 27 19:33:07 UTC 2009","overview":"<p>Cristian Mitreanu is an entrepreneur, business professional, and author.</p>\n\n<p>Cristian is the creator of a theory that provides a new, revolutionary business and economic worldview. Rooted in human nature, the theory explains the fundamental dynamics that underlie the activity of a company, as well as an entire economy. Since December 2002, Cristian has been concentrating his efforts on developing and disseminating this theory (patent pending). In August 2006, he launched BizBigPic, an innovative web-based vehicle for theory dissemination, as well as the first stage of a venture intended to evolve into a unique knowledge-and-technology platform that supports and empowers individuals in their quest for enduring success in business.</p>\n\n<p>In April 2007, he self-published &#8220;Spointra and the Secret of Business Success,&#8221; a book that employs an innovative approach to presenting the theory &#8211; &#8220;a children&#8217;s book for business professionals.&#8221;</p>\n\n<p>Cristian has written several articles, of which some were published by prestigious outlets, including MIT Sloan Management Review and the American Marketing Association.  His homepage is at CristianMitreanu.com.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}