{"first_name":"Crisis","last_name":"Commander","permalink":"crisis-commander","crunchbase_url":"http://www.crunchbase.com/person/crisis-commander","homepage_url":"http://www.crisismanagementsoftware.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"business-continuity, crisis-management, incident-management, continuity-planning, emergency-notification, business-continuity-planning, crisis-management-planning, business-continuity-solution, crisis-management-software, crisis-commander","alias_list":null,"created_at":"Fri Aug 24 14:20:57 UTC 2012","updated_at":"Thu Aug 30 10:50:51 UTC 2012","overview":"<p>Crisis Commander USA, Inc. is the exclusive North American reseller of the award-winning crisis management and business continuity software, Crisis Commander.</p>\n\n<p>Crisis Commander software is currently used by over 200 organizations in 39 countries across the globe, and has been used in major disasters such as:</p>\n\n<p>Myanmar Cyclone ’08\nLondon Subway Bombing\nAsian Tsunami\nHurricane Katrina\nMost recently, airlines and airports throughout Europe utilized Crisis Commander to help cope with the Icelandic volcano eruption. In addition to the major incidents above, Crisis Commander has been in continuous use since 2003, playing a pivotal role in the successful management of countless minor incidents and exercises.</p>\n\n<p>In 2009, Crisis Commander was named Most Innovative Solution of the Year at the prestigious Business Continuity Awards—a long-running annual event organized by UK-based CIR magazine to recognise excellence within the field of business continuity and operational risk management.</p>\n\n<p>Crisis Commander boasts an extensive and highly diverse base of clients in sectors including:</p>\n\n<p>Government: Swedish parliament, City of London, City of Plymouth (UK)\nInsurance: Lloyds, Aviva, Westfield\nAir Transport: British Midlands, Swedish FAA, Omni Air International\nIndustrial: Sandvik, Volvo, Siemens, Nissan\nMedical: Seton Health Network (Austin, TX)</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0020/7992/207992v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0020/7992/207992v2-max-250x250.jpg"],[[300,300],"assets/images/resized/0020/7992/207992v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.crisismanagementsoftware.com","title":""}],"web_presences":[]}