{"first_name":"Cynthia","last_name":"Cohen","permalink":"cynthia-cohen-2","crunchbase_url":"http://www.crunchbase.com/person/cynthia-cohen-2","homepage_url":"http://www.strategicmindshare.com","birthplace":"Medford","twitter_username":"StrategyDiva","blog_url":"","blog_feed_url":"","affiliation_name":"Strategic Mindshare","born_year":1967,"born_month":3,"born_day":16,"tag_list":"","alias_list":null,"created_at":"Thu Oct 07 23:21:17 UTC 2010","updated_at":"Wed Aug 15 14:21:42 UTC 2012","overview":"<p>Cynthia Cohen, who is known as &#8220;The Strategy Diva&#8221;, is Founder and President of Strategic Mindshare, a consulting firm that advises venture firms, private equity firms and emerging businesses.  Her focus is on traditional and online consumer businesses and she has extensive experience consulting in business strategy, marketing, market research, merchandising, e-commerce and social media.  Widely known for her annual forecast of consumer trends, she is one of the nation&#8217;s leading experts on retailing and brand strategy. </p>\n\n<p>In addition, Cynthia is Co Founder and Managing Partner of Expert Equity Enterprise which provides expert advisory services to early stage ventures in exchange for equity.</p>\n\n<p>Cynthia is a widely sought after speaker and authority on consumer trends who combines consumer insights and prognostications with realistic market penetrations strategies. Frequently quoted by the national print and online press, she has also appeared on Nightly Business Report, CNBC, CNN and other broadcast news programs.  Cynthia has authored many articles on consumer trends and marketing strategies for trade publications.  Her most current retail commentaries and consumer trends can be found at www.twitter.com/StrategyDiva.  </p>\n\n<p>Continuing her long-time passion for mentoring female business students, Cynthia established the Strategic Mindshare Foundation, which provides scholarships and mentoring to young women in business school. She is Chairman of the Foundation.</p>\n\n<p>Prior to founding Strategic Mindshare, she was a Partner in Management Consulting at Deloitte &amp; Touche. </p>","image":null,"degrees":[{"degree_type":"BSSBA","subject":"Finance","institution":"Boston University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President","firm":{"name":"Strategic Mindshare","permalink":"strategic-mindshare","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}