{"first_name":"Cynthia","last_name":"Smith","permalink":"cynthia-smith","crunchbase_url":"http://www.crunchbase.com/person/cynthia-smith","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Oct 30 15:12:35 UTC 2009","updated_at":"Fri Oct 30 15:15:19 UTC 2009","overview":"<p>Cindy Smith is Vice President of Marketing of Bling Nation. In this role, Smith brings more than twenty years of experience in the payments industry. Prior to joining Bling Nation, Smith was the Vice President of Card Services for Patelco Credit Union, where she was responsible for setting and executing the risk and sales strategy for all of Patelco’s branded cards, including ATM, debit, credit and HSA cards. Before Patelco, Smith served as Vice President of Sales and Service for Technology Credit Union, where she set and implemented the sales and services strategies for the retail branch network, business services and business development. Prior to that Smith served with Nextcard Visa, where she successfully launched Nextcard’s only secured consumer credit product. Smith has also served in various positions with Positive Communications and Associates Visa Credit Card Service. Smith holds a bachelors of arts degree and a masters of science degree in human resources management from Golden Gate University.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Marketing","firm":{"name":"Bling Nation","permalink":"bling-nation","type_of_entity":"company","image":{"available_sizes":[[[150,100],"assets/images/resized/0005/1717/51717v13-max-150x150.jpg"],[[165,110],"assets/images/resized/0005/1717/51717v13-max-250x250.jpg"],[[165,110],"assets/images/resized/0005/1717/51717v13-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}