{"first_name":"Cyrus","last_name":"Rajabi","permalink":"cyrus-rajabi","crunchbase_url":"http://www.crunchbase.com/person/cyrus-rajabi","homepage_url":"http://www.cyrusrajabi.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"cyrus-rajabi-attorney-lawyer-securities-corporate-real-estate-denver-consumer-reports-jones-keller-law-attorney","alias_list":null,"created_at":"Fri Jan 06 00:20:43 UTC 2012","updated_at":"Thu Jan 12 09:04:07 UTC 2012","overview":"<p>Cyrus Rajabi is a corporate, securities and real estate attorney / shareholder with Jones &amp; Keller, P.C.</p>\n\n<p>Cyrus concentrates his practice on business, securities and real estate law, including representing emerging and established companies, as well as individuals, in all manner of business, securities and real estate transactions. </p>\n\n<p>As a principal in several Colorado business entities, Cyrus has over a decade of business ownership and management experience. He also has over a decade of practical experience in the real estate industry, including commercial and residential development. </p>\n\n<p>His business experience has included working with various federal, state and local agencies that impact clients’ transactions including the IRS, CAID, CDOR, CDOI, SBA, SEC and various local planning and zoning departments. With both legal and practical business experience, Cyrus is able to apply his integrated perspective to quickly address clients&#8217; concerns and needs, oftentimes in innovative, more advantageous ways. Cyrus’ combined legal, business, and entrepreneurial experience is an invaluable resource, particularly to start-up ventures.</p>\n\n<p>Experience</p>\n\n<p>Cyrus has experience in a wide variety of business and real estate transactions, including: entity formation; contract negotiation, drafting and review; license agreements; shareholders’ agreements; confidentiality agreements; mergers; acquisitions; non-disclosure, non-compete, and non-solicitation agreements; planning &amp; zoning issues; asset sales; business and asset sales; development and construction agreements; closing document review; foreclosures; commercial and residential leases; sale-and-leaseback transaction; installment land sales; common ownership interest matters; financing issues; security interests; condominium and common interest community law (including both residential and commercial conversions); real estate planning and investment strategy; as well as strategic planning.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0016/9039/169039v2-max-150x150.jpg"],[[165,250],"assets/images/resized/0016/9039/169039v2-max-250x250.jpg"],[[265,400],"assets/images/resized/0016/9039/169039v2-max-450x450.jpg"]],"attribution":"<p>Cyrus Rajabi</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.cyrusrajabi.com","title":"Cyrus Rajabi - Attorney / Shareholder with Jones & Keller, P.C."}],"web_presences":[]}