{"first_name":"D & N","last_name":"FINANCIAL","permalink":"d-n-financial","crunchbase_url":"http://www.crunchbase.com/person/d-n-financial","homepage_url":"http://www.dnfinan.com","birthplace":"London","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1982,"born_month":null,"born_day":null,"tag_list":"looking-for-an-accountant","alias_list":null,"created_at":"Wed Sep 28 22:33:48 UTC 2011","updated_at":"Sat Nov 19 00:41:02 UTC 2011","overview":"<p>D&amp;N Financial - Accountants &amp; Tax Advisers</p>\n\n<p>We specialize in advising owner-managed businesses, small to medium sized companies, as well as start-ups, sole traders and high net worth individuals. All clients, large or small, appreciate our personal and down-to-earth approach, as well as our renowned quality of service.</p>\n\n<p>D&amp;N Financial is dedicated towards delivering the precise importance to your financial responsibilities.</p>\n\n<p>From satisfying statuary requirements to helping you unlock the potential within your financial affairs, with the desire to provide a service, which is second to none - offering clear, concise advice in a professional manner.</p>\n\n<p>Specifically, we can offer proactive and practical advice on all areas of Accounting, Business Planning and Tax.</p>\n\n<p>We believe that quality services can only comes through the right training, experience &amp; education. Professional Education is vital but training those professionals is even more important. Therefore we make sure that we hire accountants and bookkeepers who are qualified by expertise, training and education. All our accountants are members and affiliates of professional bodies such as Association of Chartered Certified Accountants and Chartered Institute of Taxation. This ensures us that we provide the best services our clients deserve without compromising the quality of our service.</p>\n\n<p>Below you’ll find a summary of the main areas we cover. Please feel free to get in touch if you’d like to discuss your requirements in more detail.</p>\n\n<pre><code>Company formation\nBook keeping\nVAT\nPayroll\nStatutory accounts\nCorporation tax\nSelf assessment\nManagement accounts\nTax rates\n</code></pre>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}