{"first_name":"Dain","last_name":"F. DeGroff","permalink":"dain-f-degroff","crunchbase_url":"http://www.crunchbase.com/person/dain-f-degroff","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Triangle Peak Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Dec 03 23:57:43 UTC 2008","updated_at":"Fri Jan 28 03:51:40 UTC 2011","overview":"<p>Dain F. DeGroff is a co-founding partner of Triangle Peak Partners, LP and serves as President. He has significant experience working with private and public companies, providing strategic, process, and financing solutions. Prior to Triangle Peak, he served as a Managing Director with Fort Mason Capital, where he conducted private, direct investments in private and public companies, focusing on the technology, alternative energy, and energy sectors.</p>\n\n<p>Prior to Fort Mason, Dain was an investment banker at both Hambrecht &amp; Quist and JP Morgan, where he executed numerous M&amp;A, debt and equity transactions in the technology sector and also led both firms’ global efforts in wireless. Prior to his banking experience, he was a consultant for Accenture Consulting in its technology practice. Before entering the workforce, Dain completed the U.S. Navy&#8217;s Nuclear Engineering program and served as a U.S. Navy Submarine officer on a fast-attack submarine.</p>\n\n<p>He serves on the boards of SendMe, Inc. and Achates Power, Inc., is a board observer on PCH International, Inc., and led investments into Fusion-io, Tremor Media, and Marin Software.</p>\n\n<p>He received an M.B.A. from the Wharton School of the University of Pennsylvania and a B.S. in Mechanical Engineering from Stanford University.</p>\n\n<p>Dain serves on the Investment Committee of Juvenile Diabetes Research Foundation International. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-founding Partner","firm":{"name":"Triangle Peak Partners","permalink":"triangle-peak-partners-2","type_of_entity":"financial_org","image":{"available_sizes":[[[150,44],"assets/images/resized/0003/0572/30572v10-max-150x150.jpg"],[[250,73],"assets/images/resized/0003/0572/30572v10-max-250x250.jpg"],[[450,132],"assets/images/resized/0003/0572/30572v10-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}