{"first_name":"Dale","last_name":"Hill","permalink":"dale-hill","crunchbase_url":"http://www.crunchbase.com/person/dale-hill","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 10 02:33:15 UTC 2010","updated_at":"Sat Aug 20 10:44:57 UTC 2011","overview":"<p>Dale Hill is a pioneer in clean transit solutions with more than 40 years experience in executive management and sales in transportation and engineering. He founded Proterra in 2004 to design and manufacture advanced technology vehicles that are powered by clean, domestic fuels. Prior to Proterra, Mr. Hill founded TransTeq, a company that designed and manufactured the EcoMark Alternative Fueled Hybrid-Electric Vehicle for the Denver Regional Transportation Districtís 16th St. Mall. These buses distribute 65,000 passengers each day and have carried more than 180 million passengers during 10 years of revenue service. As a career entrepreneur, Mr. Hill also founded Alumatech, which manufactures aluminum dump trailers and won the 1992 trucking industry award for the ìMost Significant Contribution to the Trucking Industry for Non Powered Vehiclesî. In addition, he founded Tech-Weld, a Houston based welding supply company which became Houston&#8217;s third largest supplier to the welding industry prior to its sale in 1992. Mr. Hill  earned a Bachelor of Science in Mechanical Engineering from LeTourneau University in Longview, Texas. He holds three patents, is a member of the Society of Automotive Engineers and American Welding Society, and has published several papers.</p>","image":null,"degrees":[{"degree_type":"Bachelor of Science","subject":"Mechanical Engineering ","institution":"LeTourneau University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Proterra","permalink":"proterra","type_of_entity":"company","image":{"available_sizes":[[[150,21],"assets/images/resized/0009/0076/90076v1-max-150x150.png"],[[250,36],"assets/images/resized/0009/0076/90076v1-max-250x250.png"],[[450,65],"assets/images/resized/0009/0076/90076v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}