{"first_name":"Dallas","last_name":"Tanner","permalink":"dallas-tanner","crunchbase_url":"http://www.crunchbase.com/person/dallas-tanner","homepage_url":"http://www.imdb.com/name/nm1872149/","birthplace":" Rhode Island","twitter_username":"dallastanner1","blog_url":"http://dallastanner.wordpress.com/","blog_feed_url":"","affiliation_name":"Destination X Adventure TV","born_year":1972,"born_month":9,"born_day":18,"tag_list":"dallas-tanner, destination-x-hawaii, eric-dallas-tanner, hollywood, directors, tv, film, distribution, syndication, marketing, action-sports","alias_list":null,"created_at":"Sun Jun 03 01:03:21 UTC 2012","updated_at":"Sun Jul 01 03:25:30 UTC 2012","overview":"<p>Hollywood Producer/Director/Creator Dallas Tanner is  known  for creating more than over 200 episodes of TV for networks like CBS, ABC, Direct TV, Dish and clients worldwide. He  has worked with NASCAR and Indy Racing teams and also trained to be a semi pro driver himself. </p>\n\n<p>His greatest thrills  are on action and adventure film making in an area where its extremely dangerous work where he has worked with legendary stunt pilots, base jumping skydivers, cross country rally racing with stunt men who train with the &#8220;Fast and Furious films&#8221; and he himself has taken the helm filming with sharks in the Pacific and high speed fighter jets over the Pacific Ocean. From the mid nineties on, 5 crew and adventure enthusiasts who worked on his films, were later killed in unrelated  accidents while performing dangerous stunt filming.</p>\n\n<p>After attending both business school ( Northeastern University in Boston) and The American Film Institute in Hollywood, he got his start in entertainment becoming a partner in NYC Magazine and serving on the board of directors of several other lifestyles magazines. He than took over a Pacific based action sports TV production and magazine group taking him to Hawaii where he lived and operated one of the most influential action sports media companies supplying TV series for Fox Sports. Here Dallas became the executive producer and creator of one of the longest running action sports series in the world. In 2005 he than launched an all female version of the action sports series called &#8220;Destination X Hawaii&#8221; which was distributed to over 66 countries worldwide.</p>\n\n<p>In addition to film making, Dallas Tanner developed and created several  other TV series, supervised the development of online entertainment platform, utilizing social community, worked with many lifestyles company brands, supervised marketing, managed talent for tv and film and recording projects, and developed online affiliate program for syndication of online sports, entertainment and music programmings. Supervised all internet development and programming team as well for online entertainment ventures. To date he has  produced over 200 episodes of reality, adventure, travel, and lifestyles television programming distributed to over 66 countries worldwide. Executive produced recording artists in 2008. Presented TV projects for development with major TV networks worldwide including CBS, ABC, Fox, CW, Mynetwork TV, Paramount TV and many more. </p>\n\n<p>His greatest thrills are still taking charge on extremely dangerous adventure film making.</p>","image":{"available_sizes":[[[81,150],"assets/images/resized/0019/3655/193655v2-max-150x150.png"],[[135,250],"assets/images/resized/0019/3655/193655v2-max-250x250.png"],[[152,280],"assets/images/resized/0019/3655/193655v2-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"Film","subject":"Filmmaking/Directing","institution":"American Film Institute","graduated_year":1999,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Executie Producer","firm":{"name":"Destination X Adventure TV","permalink":"destination-x-adventure-tv","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://dallas-tanner.blogspot.com/","title":"Dallas Tanner wraps TV series"},{"external_url":"http://workface.com/e/ericdallastanner","title":"Dallas Tanner Credential Summary"},{"external_url":"http://www.newswiretoday.com/news/3966/","title":"Dallas Tanner releases \"911' Concert DVD"},{"external_url":"http://www.ziggs.com/public/Eric%20Dallas_Tanner_117614","title":"Dallas Tanner online execuitve summary"}],"web_presences":[{"external_url":"http://www.imdb.com/name/nm1872149/bio","title":"IMDB professional credits"},{"external_url":"http://www.linkedin.com/in/dallastanner","title":"Linked In"}]}