{"first_name":"Damien","last_name":"Stevens","permalink":"damien-stevens","crunchbase_url":"http://www.crunchbase.com/person/damien-stevens","homepage_url":"http://www.servosity.com","birthplace":"South Carolina","twitter_username":"damienstevens","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1978,"born_month":6,"born_day":22,"tag_list":"disaster-recovery, servosity, cloud-backup, virtualization","alias_list":null,"created_at":"Fri Jul 13 21:33:25 UTC 2012","updated_at":"Sat Jul 14 22:48:32 UTC 2012","overview":"<p>Damien (and the team at Servosity) are working on making Disaster Recovery software and systems as easy to use as a smart phone (think self-healing computers). </p>\n\n<p>He has a deep background in virtualization and cloud computing, including working with Amazon Web Services since early 2007. </p>\n\n<p>Prior to founding Servosity, Damien founded, built, and sold Utopia Net which was the number one Ranked Web Development Company in the Upstate. Damien was a co-founder of the GSA Technology Council and the IT Leadership Council, non-profit technology advocates for South Carolina. Prior to that he worked for Intel on ecommerce systems.</p>\n\n<p>In 2009 Damien was named Best and Brightest 35 and Under by Greenville Magazine. He has volunteered to help with IT needs of the Special Olympics and received an Award for mentoring students at Santa Clara University. </p>\n\n<p>Damien is a FastTrac TechVenture Graduate, he has served on the Advisory board for ECPI College, and Advisory Council for Innoventure. Outside of work, Damien serves as Deacon at his church and spends time with his amazing wife and son.</p>","image":{"available_sizes":[[[128,128],"assets/images/resized/0020/0873/200873v2-max-150x150.png"],[[128,128],"assets/images/resized/0020/0873/200873v2-max-250x250.png"],[[128,128],"assets/images/resized/0020/0873/200873v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}