{"first_name":"Damon","last_name":"Ragusa","permalink":"damon-ragusa","crunchbase_url":"http://www.crunchbase.com/person/damon-ragusa","homepage_url":"http://www.thinkvine.com","birthplace":"","twitter_username":"DamonRagusa","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"ceo, entrepreneur, marketing, analytics, optimization, founder","alias_list":null,"created_at":"Thu Dec 30 19:00:35 UTC 2010","updated_at":"Thu Jan 12 03:29:30 UTC 2012","overview":"<p>As Chairman and Chief Strategy Officer, Damon Ragusa shapes the company&#8217;s strategy and product direction.  An accomplished entrepreneur and marketing technologist, Damon has successfully transitioned ThinkVine from a custom solutions consultancy into a software-as-a-service enterprise in the marketing optimization space. In early 2009, under Damon&#8217;s leadership, ThinkVine launched its marketing planning &amp; simulation application leading to triple digit annual growth in software revenue.  A popular speaker known for his domain expertise and thought leadership, Damon is frequently asked to present at such conferences as ad:tech, American Marketing Association (AMA), Advertising Research Foundation and the Institute for International Research.  Damon has held Partner and senior level positions at management consulting, marketing science and software development firms and holds degrees in Quantitative Studies and Psychology from Bowling Green State University and has conducted advanced studies in both Business Administration and Computer Science.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0011/5823/115823v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0011/5823/115823v2-max-250x250.jpg"],[[299,450],"assets/images/resized/0011/5823/115823v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}