{"first_name":"Damon","last_name":"Schechter","permalink":"damon-schechter","crunchbase_url":"http://www.crunchbase.com/person/damon-schechter","homepage_url":"http://www.shipwire.com","birthplace":"","twitter_username":"shipwire","blog_url":"http://www.shipwire.com/blog","blog_feed_url":"http://feeds.feedburner.com/ShipwireBlog","affiliation_name":"Shipwire","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue May 20 04:54:20 UTC 2008","updated_at":"Sun Oct 30 13:40:57 UTC 2011","overview":"<p>Damon is responsible for driving the vision and strategy of Shipwire, as well as the operations. He brings over seventeen years of experience as an entrepreneur, business manager, and R&amp;D leader. Prior to starting Shipwire, Damon hired a Pulitzer-nominated coauthor and wrote bestseller Delivering the Goods: The Art of Managing Your Supply Chain (J. Wiley &amp; Sons; 2002). Prior to being an author, Damon was an active investor and advisor to more than 30 startups in the areas of ecommerce and supply chain management. Prior to becoming an investor, Damon managed the flagship product family for Cobalt Networks. As product manager, Damon developed the first successful web and ecommerce servers and helped Cobalt grow into a worldwide leader in the category, culminating in a successful IPO and acquisition by Sun Microsystems for $2B. Prior to Cobalt, Damon was a consultant, creating the first supply chain Internet-applications for Sun Microsystems, Ryder System, and the U.S. Air Force. Damon is also an inventor on multiple U.S. and foreign patents, and is actively involved in the Young President’s Organization (YPO). He graduated with high distinction from Stanford University, from which he holds a B.A. in economics and a M.S. in engineering.</p>\n\n<p>Since inception, Shipwire has been on a mission to give our customers the shipping muscle of Fortune 500 companies. During that time, we have provisioned warehouses in 3 countries, served businesses with headquarters in over 45 countries, and delighted buyers in more than 180 countries. Backed by commerce and technology giants eBay® and Newell-Rubbermaid®, it is an incredibly exciting time for our organization. We are accelerating the development of our platform’s enterprise features, and reaching deeper into global markets. We at Shipwire draw inspiration from the entrepreneurship of our customers, and take pride in helping our customers contribute directly to the global economy.</p>\n\n<p>For more information on Damon and Shipwire.com please visit <a href=\"http://www.shipwire.com\" title=\"www.shipwire.com\" rel=\"nofollow\">www.shipwire.com</a></p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0016/0061/160061v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0016/0061/160061v2-max-250x250.jpg"],[[299,450],"assets/images/resized/0016/0061/160061v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"Economics","institution":"Stanford University","graduated_year":1993,"graduated_month":null,"graduated_day":null},{"degree_type":"MS","subject":"Engineering","institution":"Stanford University","graduated_year":1994,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Shipwire","permalink":"shipwire","type_of_entity":"company","image":{"available_sizes":[[[150,41],"assets/images/resized/0001/8890/18890v1-max-150x150.png"],[[220,61],"assets/images/resized/0001/8890/18890v1-max-250x250.png"],[[220,61],"assets/images/resized/0001/8890/18890v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.shipwire.com","title":"Shipwire"}]}