{"first_name":"Damon","last_name":"Danieli","permalink":"damon-danieli","crunchbase_url":"http://www.crunchbase.com/person/damon-danieli","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Mar 28 16:12:22 UTC 2009","updated_at":"Thu Aug 13 05:12:30 UTC 2009","overview":"<p>Damon co-founded Zero260 and Z2Live and serves as its Chief Technology Officer. Damon conceived of, designed, built and launched Z2Live&#8217;s first application, PhotoFeedd.</p>\n\n<p>Prior to founding Zero260, Damon spent 14 years at Microsoft in a variety of development and innovation</p>\n\n<p>management roles. During his Microsoft career, Damon served as Technical Lead of the Xbox Entertainment Network inside Microsoft Games Studios and as a Lead Program Manager for Xbox Live where he designed many of the marquee features of the Xbox Live service including Voice Chat, Voice Commands, Friends, Invitations, Presence and Notifications. Also as part of the Xbox team, Damon served as program manager for Security, Authentication, Authorization, NAT Traversal, Matchmaking and Networking.</p>\n\n<p>Prior to joining the Xbox team, Damon served as Development Lead for the SideWinder line of Gaming Devices and the ActiMates Line of Characters (including Microsoft&#8217;s Interactive Barney toy). His last position at Microsoft was a Senior Developer in the Microsoft Startup Business Accelerator division. As such, Damon was part of a small, agile team that combined technology from Microsoft&#8217;s research division with production techniques from their product groups. Damon was granted over 20 patents while at Microsoft.</p>\n\n<p>Damon&#8217;s international experiences includes working as a database programmer at Solidarity&#8217;s Bank Informacji Gospodarczej (Economic Information Bank) where he created a database for internal Polish companies seeking foreign capital and assistance. While stationed in Tokyo, he worked as an International Relations Kenshusei for Aoki Construction, a mid-sized Japanese construction company. Damon started his career at 20 years old when he started his first company, Internal Technologies - a startup that embedded Microsoft Windows on Read Only Memory (ROM) based platforms such as Kiosks. Damon&#8217;s education accomplishments include earning a Bachelor of Sciences in Electrical Engineering in 1996 and a Masters in Computer Science in 1999, both from the University of Washington.</p>","image":{"available_sizes":[[[150,83],"assets/images/resized/0005/6256/56256v1-max-150x150.jpg"],[[250,138],"assets/images/resized/0005/6256/56256v1-max-250x250.jpg"],[[312,173],"assets/images/resized/0005/6256/56256v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"CTO, cofounder","firm":{"name":"Z2Live","permalink":"z2live","type_of_entity":"company","image":{"available_sizes":[[[150,69],"assets/images/resized/0005/6253/56253v1-max-150x150.jpg"],[[250,116],"assets/images/resized/0005/6253/56253v1-max-250x250.jpg"],[[267,124],"assets/images/resized/0005/6253/56253v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}