{"first_name":"Dan","last_name":"Dolan","permalink":"dan-dolan","crunchbase_url":"http://www.crunchbase.com/person/dan-dolan","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Nov 20 01:07:07 UTC 2012","updated_at":"Thu Nov 22 05:03:08 UTC 2012","overview":"<p>Atty. Daniel Dolan II is an experienced Miami personal injury attorney who has past experience in representing doctors, hospitals and corporation against the negligence claim filed against them. He also represents the seriously injured individuals in an accident caused by other individual&#8217;s negligence or carelessness. He represents clients all over Florida who have been the victims of serious or catastrophic personal injuries, wrongful deaths and the like. </p>\n\n<p>As a Miami wrongful death attorney, Atty. Dolan has recovered more than 60 million USD damages on behalf of his clients and their families. In the year 2008, Dan was chosen as the Head of the Miami Dade Justice Association or otherwise known as Dade County Trial Lawyers Association, the biggest county-based trial lawyer association in the state. He is an Eagle member of the Academy of Florida Trial Lawyers and was also selected to serve as the President of the Dade County Legislative Recruitment Task Force. In 2004, he was awarded a Bronze Eagle award in the Academy. </p>\n\n<p>Dan is an AV Peer Review Rated lawyer of the prestigious online review site Martindale-Hubbel. He got the highest rating in legal ability and ethical standards. Since 2002, he has been recognized as one of the region&#8217;s leading trial attorneys, listed in Florida Super Lawyers and Trend Magazine&#8217;s prestigious Florida Legal Elite. </p>","image":{"available_sizes":[[[122,150],"assets/images/resized/0022/1134/221134v2-max-150x150.jpg"],[[177,216],"assets/images/resized/0022/1134/221134v2-max-250x250.jpg"],[[177,216],"assets/images/resized/0022/1134/221134v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}