{"first_name":"Dan","last_name":"Hill","permalink":"dan-hill","crunchbase_url":"http://www.crunchbase.com/person/dan-hill","homepage_url":"http://juscollege.com","birthplace":"New Jersey","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Joystick Interactive","born_year":1989,"born_month":9,"born_day":28,"tag_list":"juscollege, mocapoke, graphic, design, web, development","alias_list":null,"created_at":"Thu Jul 29 21:35:23 UTC 2010","updated_at":"Wed Mar 30 01:55:53 UTC 2011","overview":"<p>For more than seven years, Dan Hill has been founding and operating web design and development businesses across the United States.  Dan has founded three profitable web-related companies including a freelance operation and a branding agency in New Jersey, a development firm in Los Angeles, CA, as well as multiple social networking websites.  A published mentor in the web-design field at 16, Dan possesses the creative insight necessary to bring users and code together in a seamless, effortless union of digital goodness.  </p>\n\n<p>Dan’s incredible and compelling drive to be successful in his field landed him paid internships at the ages of 16, 17, and 18, before even attending college. These internships were negotiated and completed with top agencies in New York City, Los Angeles, and even one with a satellite branch of a company based in The United Arab Emirates. Dan’s creative intuition and quick wit have allowed him to progress within 6 years from designing his own MySpace.com profile page to building robust interfaces and software platforms for fortune 500 companies such as Walt Disney, Wyndham Resorts, and ABC; all on a freelance basis.  </p>\n\n<p>Dan is constantly thinking of new ideas and ways of making the Internet a more entertaining, safe, and effective means of communication.  He has an artistic, deeply rooted attention to detail as well as an understanding of the way people think; acquired through his studies of philosophy and psychology. These traits allow Dan to design intuitive interfaces that grasp the user’s attention, hold it tightly, and send it in the right direction, without causing confusion or unrest.</p>\n\n<p>Although a happy-go-lucky goof ball, Dan has an analytical, problem-solving machine for a brain.  He is a kind person with a sarcastic sense of humor.  He enjoys life above all things and tries his best to keep smiles on the faces of those around him.  A Renaissance man with a twist, Dan does what he can to give back to the community, including a non-profit initiative to aiding Los Angeles’ homeless by selling t-shirts and sending all profits to organizations such as Coalition for the Homeless, Homeless Housing, Beyond Shelter,    Women Are Dreamers, Too, and Housing Opportunities for Women (HOW).  He enjoys socializing with friends, culinary arts, Bazooka Bubble Gum, pasta, drawing, and building kinetic and still sculptures.</p>","image":{"available_sizes":[[[68,150],"assets/images/resized/0009/5396/95396v2-max-150x150.jpg"],[[113,250],"assets/images/resized/0009/5396/95396v2-max-250x250.jpg"],[[204,450],"assets/images/resized/0009/5396/95396v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Digital Ninja","firm":{"name":"Joystick Interactive","permalink":"joystick-interactive","type_of_entity":"company","image":null}},{"is_past":true,"title":"CEO - Creative Director","firm":{"name":"Mocapoke Media","permalink":"mocapoke-media","type_of_entity":"company","image":null}},{"is_past":true,"title":"Founder - Creative Director","firm":{"name":"Sesh Media","permalink":"sesh-media","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.amazon.com/Hacking-MySpace-Customizations-Space-ExtremeTech/dp/0470045841","title":"Profile Hall of Fame - Publication"}],"web_presences":[{"external_url":"http://facebook.com/dan.chill","title":"Facebook"},{"external_url":"http://mocapoke.com","title":"Personal Portfolio"}]}