{"first_name":"Dan","last_name":"Gershenson","permalink":"dan-gershenson","crunchbase_url":"http://www.crunchbase.com/person/dan-gershenson","homepage_url":"http://www.chicagobrander.com","birthplace":"Wheaton, IL","twitter_username":"DanOnBranding","blog_url":"http://www.chicagobrander.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1972,"born_month":11,"born_day":10,"tag_list":"advertising, marketing, branding, social-media, creative-director, copywriter, creative, chicago, advertising-agency","alias_list":null,"created_at":"Mon Aug 30 18:44:54 UTC 2010","updated_at":"Wed Apr 11 21:16:40 UTC 2012","overview":"<p>Dan Gershenson is a Chicago-based brand strategy and content marketing consultant. He contributes to Boost Marketing as its VP of Brand Strategy, consults with small to medium sized businesses, writes a blog called Chicago Brander and is a columnist for the online edition of Crain&#8217;s Chicago Business. He has worked in the advertising and marketing industry for 16 years. </p>\n\n<p>His experience began in 1995 with Austin Knight, a recruitment advertising firm. As a Copywriter, his client experience included the Detroit Tigers, Nortel, Hitachi and Advocate Health Care. His focus was primary a combination of print advertising, direct mail and recruitment-oriented microsites.</p>\n\n<p>After five years at this agency, he moved on to DDB Chicago in 2000, where he worked on the State Farm and U.S. Gypsum (Sheetrock) accounts. His experience extended to print, direct mail, radio and TV advertising.</p>\n\n<p>In 2005, Gershenson with two other partners formed The Creative Underground, a brand development agency based in south Florida. He served clients such as CSL Plasma, Boca Lago Country Club, C3 Cloud Computing, My First Home and more. </p>\n\n<p>Seeking a return to his Midwest roots, Gershenson left the agency at the end of 2010 and joined Boost Marketing in 2011. His experience extends to such clients as FANUC, Exact Metrology, Stenzel Clinical and a variety of other brands.</p>\n\n<p>Today, Gershenson focuses on strategic planning and content marketing in both his role for the agency and as an independent consultant. He has conducted over 100 Brand Audits for the purpose of uncovering strategic insights that steer creative direction. He has written several White Papers on the subjects of branding and social media, including &#8220;&#8216;Get on Twitter&#8217; Is Not A Social Media Strategy.&#8221; </p>","image":{"available_sizes":[[[75,150],"assets/images/resized/0016/6327/166327v2-max-150x150.jpg"],[[125,250],"assets/images/resized/0016/6327/166327v2-max-250x250.jpg"],[[225,450],"assets/images/resized/0016/6327/166327v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor's","subject":"Advertising","institution":"Drake University","graduated_year":1995,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://twitter.com/DanOnBranding","title":"DanOnBranding"},{"external_url":"http://www.linkedin.com/in/dangershenson","title":"Connect on LinkedIn"}]}