{"first_name":"Dan","last_name":"Ramsden","permalink":"dan-ramsden-2","crunchbase_url":"http://www.crunchbase.com/person/dan-ramsden-2","homepage_url":"http://www.coriseco.com","birthplace":"","twitter_username":"d_ramsden","blog_url":"http://www.discourseandnotes.com","blog_feed_url":"http://feeds.feedburner.com/discourseandnotes/TkTw","affiliation_name":"CoRise Co., LLC","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jan 10 19:33:36 UTC 2012","updated_at":"Sun Jan 15 23:26:12 UTC 2012","overview":"<p>Dan is a veteran investment banker with more than two decades of experience in institutional as well as boutique private settings. Since the mid-90s, Dan has been exclusively focused on the media and technology sectors. In the course of his career, Dan has been involved in the execution of more than $20 billion in transaction volume, as both principal and agent. He is the founder and CEO of CoRise.</p>\n\n<p>Dan’s Wall Street career began in 1987, a year in which the Black Monday crash of October served as his welcome to the scene. He became active in leveraged finance in 1990, participating in many of the era’s high-profile buyouts and the development of innovative leveraged structures. Dedicating himself to the media and technology industries since 1995, Dan has provided corporate finance and advisory services to companies, entrepreneurs and investors during the most exciting technical evolution of our time. </p>\n\n<p>He has witnessed the transition of traditional to new media, analog technology to digital, wireline communication to wireless, decentralized applications to cloud computing, and he remains amazed each day by the never-ending transitions. Dan has helped to finance startups, growth platforms and mature companies in this continuously evolving field. He has advised buyers and sellers on M&amp;A transactions and strategy, and he has helped to structure, underwrite or place private as well as public equity and debt capital. </p>\n\n<p>Approximately half of Dan’s finance career was with BMO Capital Markets, where, as managing director, he started and helped to build out the institution’s U.S. media investment banking practice. Since leaving BMO Capital Markets in 2002, Dan has been a managing director with two New York based boutique firms founded and run by veterans of established organizations such as Donaldson, Lufkin &amp; Jenrette, Bank of America and Citigroup. Dan founded one of the predecessor firms of CoRise – DreamTigerEquities – at the end of 2009, where he was joined by several veteran bankers, some of whom are now his colleagues in CoRise. </p>\n\n<p>Dan’s experience on Wall Street and in the various media segments is long and deep enough to have taught him some fundamental precepts: everything changes, many things relate, and some things repeat. Knowing which of these things is which and how to navigate the concurrent dynamism and unity is a critical success driver in both technology and capital markets, which are connected. </p>\n\n<p>Dan graduated from Cornell University in 1986 with a B.A. in English, and he earned his M.B.A. cum laude from Fordham University in 1990. He serves as an Advisor to the Dean of Computing and Information Science (CIS) at Cornell University, heads up the finance sub-committee of Cornell&#8217;s Arts &amp; Sciences Career Connections, and serves on the advisory council of Entrepreneurship@Cornell.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0017/0131/170131v2-max-150x150.jpg"],[[168,126],"assets/images/resized/0017/0131/170131v2-max-250x250.jpg"],[[168,126],"assets/images/resized/0017/0131/170131v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO & Partner","firm":{"name":"CoRise","permalink":"corise","type_of_entity":"company","image":{"available_sizes":[[[150,41],"assets/images/resized/0016/9405/169405v2-max-150x150.jpg"],[[179,50],"assets/images/resized/0016/9405/169405v2-max-250x250.jpg"],[[179,50],"assets/images/resized/0016/9405/169405v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"","firm":{"name":"CoRise Co., LLC","permalink":"corise-co-llc-2","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://discourseandnotes.com","title":"Blog"},{"external_url":"http://coriseco.com","title":"Company page"}],"web_presences":[{"external_url":"http://www.linkedin.com/in/danramsden","title":"LinkedIn"},{"external_url":"https://twitter.com/#!/d_ramsden","title":"Twitter"}]}