{"first_name":"Dan","last_name":"Ciporin","permalink":"dan-ciporin","crunchbase_url":"http://www.crunchbase.com/person/dan-ciporin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"LGiLab","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Nov 24 05:35:49 UTC 2008","updated_at":"Fri Oct 22 02:24:10 UTC 2010","overview":"<p>Dan Ciporin is a Venture Partner at Canaan Partners and is the former CEO of Shopping.com.</p>\n\n<p>Dan is committed to building innovative businesses that make the Internet a more engaging place for consumers. Dan joined Canaan’s Connecticut office in 2007 to invest in emerging leaders in online advertising and digital media in the New York corridor, as well as in communications infrastructure companies that deliver interactive content to connected consumers.</p>\n\n<p>Dan brings two decades of executive-level operational experience to Canaan. He was the former Chairman and CEO of Shopping.com, the pioneer in online comparison shopping, where he oversaw growth from zero to over $100 million in revenues in just five years, culminating in the company’s IPO in October 2004 and later acquisition by eBay in 2005. Previously, Dan served as chairman of the Internet Lab, a US-Israeli incubator for early-stage consumer Internet startups, as Senior VP of MasterCard International, where he was responsible for the marketing and product management of all online global debit products, and as a strategy consultant for both Mars and Co. and Corporate Value Associates.</p>\n\n<p>At Canaan, Dan sits on the board of Lending Club, an innovative online lending community where people borrow and lend money, bypass the banks, and get better rates; OpenSky, a community of shoppers, suppliers, &amp; shopkeepers working together to change how the world shops; Gemvara, a web-based service that is revolutionizing the jewelry market by empowering consumers and independent jewelers to design fully personalized, high-quality jewelry; and Peer39, the global leader in semantic advertising solutions.  In addition to his work with Canaan, Dan is on the boards of three public companies: Primedia (PRM), one of the world’s leading targeted media companies; VistaPrint (VRPT), which supplies more than 10 million global customers with customized printed products online; and leading graphics software company Corel (CREL).</p>\n\n<p>Dan earned an AB from Princeton University’s Woodrow Wilson School of Public and International Affairs and an MBA from Yale University. Dan is committed to improving the lives of people living in poverty in Southeast Asia. After serving in 1980 as Director of Educational Programs for the UN-funded Sakaeo Refugee Camp in Thailand – where he lived in a teak stilt house in the middle of a remote rice paddy – Dan has continued to support volunteer organizations in that part of the world.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Advisor","firm":{"name":"LGiLab","permalink":"lgilab","type_of_entity":"financial_org","image":{"available_sizes":[[[150,10],"assets/images/resized/0002/9371/29371v1-max-150x150.png"],[[250,17],"assets/images/resized/0002/9371/29371v1-max-250x250.png"],[[355,25],"assets/images/resized/0002/9371/29371v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[{"description":"Invested in SkillSlate.com","stoned_year":2010,"stoned_month":7,"stoned_day":null,"source_url":"http://www.skillslate.com/press/funding","source_text":null,"source_description":"Press Release","stoneable_type":"Person","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"first_name":"Dan","last_name":"Ciporin","permalink":"dan-ciporin"}}],"video_embeds":[],"external_links":[],"web_presences":[]}