{"first_name":"Dan","last_name":"Miller","permalink":"dan-miller-3","crunchbase_url":"http://www.crunchbase.com/person/dan-miller-3","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jun 21 22:17:44 UTC 2009","updated_at":"Sun Jun 21 22:19:46 UTC 2009","overview":"<p>Dan Miller is Managing Director of The Roda Group, a venture development company based in Berkeley, California.  Dan serves on the boards of several Roda Group companies including Solazyme, a renewable energy company, and was previously the president of Ask Jeeves, Inc. (now Ask.com), a former Roda Group affiliate company.</p>\n\n<p>Mr. Miller was Executive Vice President of TCSI Corporation, a company he co-founded with his Roda Group partner, Roger Strauch. TCSI (now owned by Rocket Software) is a leading provider of integrated software products and services for the global telecommunications industry.  Prior to TCSI, Mr. Miller was a systems engineer at Hughes Aircraft&#8217;s Space and Communications Group where he was responsible for designing communications payloads for commercial communications satellites.</p>\n\n<p>Mr. Miller received his Bachelor of Science in Electrical Engineering, with distinction, from Cornell University and his Master of Science in Electrical Engineering from Stanford University. He holds three patents in the areas of compression technology and wireless communications systems.</p>\n\n<p>Mr. Miller is President of the Foundation Board of Trustees of the Chabot Space &amp; Science Center and is also a member of Cornell University&#8217;s Computing and Information Science and School of Electrical and Computer Engineering Advisory Boards.  He is also a member of The Climate Project and has given talks about climate change at conferences across the nation.</p>","image":{"available_sizes":[[[144,150],"assets/images/resized/0004/9994/49994v1-max-150x150.jpg"],[[147,153],"assets/images/resized/0004/9994/49994v1-max-250x250.jpg"],[[147,153],"assets/images/resized/0004/9994/49994v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"The Roda Group","permalink":"the-roda-group","type_of_entity":"financial_org","image":{"available_sizes":[[[94,68],"assets/images/resized/0004/9992/49992v1-max-150x150.jpg"],[[94,68],"assets/images/resized/0004/9992/49992v1-max-250x250.jpg"],[[94,68],"assets/images/resized/0004/9992/49992v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}