{"first_name":"Dan","last_name":"Housman","permalink":"dan-housman","crunchbase_url":"http://www.crunchbase.com/person/dan-housman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Recombinant Data Corp.","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Oct 05 21:06:17 UTC 2009","updated_at":"Tue Jan 03 18:28:20 UTC 2012","overview":"<p>Dan is an experienced software entrepreneur that provides product management, marketing, and technical leadership to his start-up ventures. He holds a bachelor&#8217;s degree in Chemistry and Biology from MIT in 1995.</p>\n\n<p>Dan&#8217;s current project work is focused on a clinical data warehouse start-up, Recombinant. Having built quality reporting solutions for Partners Healthcare Dan co-founded Recombinant to leverage his background in science/medicine and software/analytics. Focusing on research systems such as i2b2 and Profiles RNS and quality tools for population health and ACOs. The business has rapidly grown to support major clients including healthcare and pharmaceutical industry leaders such as the VA (GenISIS), Johnson &amp; Johnson (tranSMART), Piedmont Healthcare (CIT), and TDI (The Dartmouth Institute).</p>\n\n<p>Dan began his carreer in 1995 establishing software ventures relating to ecommerce such as VirtuMall and VirtuFlex - focused on online order fulfillment. He co-founded ChannelWave in 1998, a venture backed start-up focused on using internet tools. ChannelWave delivered software and SaaS solutions to manage channel sales for high tech clients including Research in Motion, 3COM, Nortel, Logitech, Brittish Telecom. Dan managed the growth of the business including integration of multiple acquisitions through to a final acquisition of the company by Click Commerce and Digital River.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director, Analytical Applications","firm":{"name":"Recombinant Data Corp.","permalink":"recombinant-data-corp","type_of_entity":"company","image":{"available_sizes":[[[150,15],"assets/images/resized/0006/1727/61727v2-max-150x150.jpg"],[[250,26],"assets/images/resized/0006/1727/61727v2-max-250x250.jpg"],[[365,38],"assets/images/resized/0006/1727/61727v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}