{"first_name":"Dan","last_name":"Achille","permalink":"dan-achille","crunchbase_url":"http://www.crunchbase.com/person/dan-achille","homepage_url":"http://Dandingo.com","birthplace":"New York","twitter_username":"dandingocpa","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1985,"born_month":3,"born_day":30,"tag_list":"","alias_list":null,"created_at":"Mon Jan 03 04:00:46 UTC 2011","updated_at":"Mon Jan 03 15:50:47 UTC 2011","overview":"<p>Dandingo.com LLC a Affiliate/CPA Network, based out of New York , was truly started for affiliates by affiliates. We know you&#8217;ve heard this phrase many times but we are true to it. The Dandingo.com Affiliate/CPA network was started to create leverage for all honest affiliates. What we do is we link internet marketers (affiliates) with online advertisers offers. As a network we can bring volume to each advertiser and this makes for higher payouts on sales and/or leads. We have higher&#8230; (read more)\nMission:Instead of partnering up with some corporate minded network that will shave your leads , take long to payout,or make you feel inferior because you weren&#8217;t as profitable as another affiliate, you could join Dandingo.com and get higher and quicker payouts anyway. On top of that support is available 24 7 for our accepted affiliates. So its a win win.</p>\n\n<p>Unless you&#8217;re some type of fraudster, spammer, or scammer Dandingo does not see anything wrong with you being treated with the utmost respect on any network. Especially a network that accepted you in the first place</p>\n\n<p>No matter what your monthly budget is, no matter how many leads or sales you can bring in a month, if you seem like an honest affiliate that is ambitious, who listens, follows rules, is active and eager to make money, Dandingo.com will be glad to welcome you to our team. We have super affiliates that work with us because our payouts are higher on most offers then other well known branded networks , but on our team everyone is treated equally. All our affiliates get their fair share and then some. No more NET 30 or NET 60 waiting months for a check like a sucker. We pay our affiliates twice a month so they can reinvest quickly and consistently BANK profits. We are truly FOR AFFILIATES BY AFFILIATES and here to make money with you. ARE YOU?</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}