{"first_name":"Dana","last_name":"Brunetti","permalink":"dana-brunetti","crunchbase_url":"http://www.crunchbase.com/person/dana-brunetti","homepage_url":"","birthplace":"","twitter_username":"DanaBrunetti","blog_url":"","blog_feed_url":"","affiliation_name":"Trigger Street","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Wed Aug 22 18:56:47 UTC 2012","updated_at":"Fri Aug 31 18:40:12 UTC 2012","overview":"<p>Dana Brunetti is the president of Trigger Street Productions, a production company founded by Kevin Spacey in 1997.  Also an innovator in social networking, Brunetti launched Trigger Street Labs in 2002 - a online platform for feedback and exposure for undiscovered writing and filmmaking talent.</p>\n\n<p>In 2009, he produced the film The Social Network, the story of how Facebook was created.  The film was directed by David Fincher, written by Aaron Sorkin and based on Ben Mezrich&#8217;s Book, The Accidental Billionaires.  This year, he is producing Captain Phillips Starring Tom Hanks and directed by Paul Greengrass as well as the new streaming-only Netflix show House of Cards with David Fincher and Kevin Spacey.  In July of this year, it was announced that he and Michael De Luca would produce the 50 Shades of Grey film adaptation.</p>\n\n<p>He also worked with Mezrich in 2008, when he produced the film 21, which was based off his New York Times best selling book Bringing Down The House.  He has produced the films Fanboys, Shrink, the Emmy-nominated Bernard and Doris, Casino Jack, Mini&#8217;s First Time, The Sasquatch Gang, and the documentaries Uncle Frank, and Rebuilds: A Year at Ground Zero.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0020/7523/207523v1-max-150x150.png"],[[200,249],"assets/images/resized/0020/7523/207523v1-max-250x250.png"],[[200,249],"assets/images/resized/0020/7523/207523v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://en.wikipedia.org/wiki/Dana_Brunetti","title":"Wikipedia"},{"external_url":"http://www.imdb.com/name/nm0116232/","title":"IMDB"}]}