{"first_name":"Dana","last_name":"Callow","permalink":"dana-callow","crunchbase_url":"http://www.crunchbase.com/person/dana-callow","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon May 18 14:31:58 UTC 2009","updated_at":"Mon May 18 14:34:03 UTC 2009","overview":"<p>Dana is the Managing Partner of Boston Millennia Partners. Prior to founding Boston Millennia Partners, Dana co-founded Boston Capital Ventures in 1982. Before that, he worked as a Senior Consultant at Braxton Associates, an international strategic planning firm that was formed by professionals from Boston Consulting Group and Bain &amp; Co. He worked with Fortune 100 companies in strategic planning and implementing merger and acquisition strategies.</p>\n\n<p>Prior to working in the management consulting business, Dana worked in sales and marketing for Tymshare, Inc. (McDonnell-Douglas). He currently is Presiding Director and Chair of the governance committee of PAREXEL International Corporation (NasdaqGS:PRXL) a $1 billion plus clinical trials management company. He is, or has served, as a Director of a number of other public and private companies, including ILEX Oncology, Inc. (Nasdaq: ILXO), a cancer pharmaceutical company acquired by Genzyme for $1 billion; MedAptus, Inc., a mobile computing provider of clinical, financial and administrative software solutions to the medical community; and PHT Technologies, Inc., a provider of mobile and Web-based technology solutions to the pharmaceutical industry focused on clinical trials management. Other investment responsibilities included Glycofi Inc., (acquired by Merck, NYSE: MRK); HotJobs, Inc. (acquired by Yahoo, NasdaqGS: YHOO); iVillage, Inc. (acquired by NBC Universal, a subsidiary of General Electric, NYSE: GE); and Tektagen, Inc. (acquired by Charles River Laboratories, NYSE: CRL).</p>\n\n<p>Dana is a Director of Jobs for Massachusetts, a Massachusetts based non-profit organization comprised of business and political leaders including the Governor and Congressional leaders. He is a member of the Advisory Board of the Dartmouth/Tuck Center for Private Equity and Entrepreneurship. He is a member of the Board of Trustees and the Chairman of the Investment Committee at Tufts University and on the Board of Overseers at Tufts University Medical School.</p>","image":{"available_sizes":[[[150,115],"assets/images/resized/0004/4449/44449v1-max-150x150.jpg"],[[152,117],"assets/images/resized/0004/4449/44449v1-max-250x250.jpg"],[[152,117],"assets/images/resized/0004/4449/44449v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Graduated","subject":"Magna cum laude","institution":"Tufts University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing General Partner","firm":{"name":"Boston Millennia Partners","permalink":"boston-millennia-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,14],"assets/images/resized/0004/4445/44445v1-max-150x150.png"],[[250,24],"assets/images/resized/0004/4445/44445v1-max-250x250.png"],[[450,44],"assets/images/resized/0004/4445/44445v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}