{"first_name":"Dana","last_name":"Waldman","permalink":"dana-waldman","crunchbase_url":"http://www.crunchbase.com/person/dana-waldman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jul 11 18:45:12 UTC 2011","updated_at":"Mon Jul 11 18:45:39 UTC 2011","overview":"<p>Waldman has over 25 years&#8217; experience in building and leading businesses in the communications, signal processing, software, and other technology areas. He has created and led companies that were competitive in both government and commercial sectors, and has worked in start-up enterprises, as well as in Fortune 500 environments.</p>\n\n<p>Mr. Waldman spent 13 years in various management roles at Ford Aerospace, Loral Corporation, and Lockheed Martin. He played major roles with those companies by creating entrepreneurial opportunities, including the adaptation of military technology to commercial applications. His product development efforts have included satellite communications, laptop computers, network management, and medical imaging systems, among other technologies.</p>\n\n<p>As founder and CEO, Waldman led a spinout of technology from Lockheed Martin, raised over $200 million in venture capital from leading private equity firms, and created an international business that achieved a market valuation in excess of $1 billion.</p>\n\n<p>Mr. Waldman holds a B.S. in Electrical Engineering from Tulane University and an MBA from Golden Gate University. He has been featured in numerous technology and financial publications, including Fortune magazine, and has appeared on several television news segments. He is a member of the Adjunct Faculty at Golden Gate University in San Francisco, teaching MBA courses in leadership and other subjects, while also serving as that institution&#8217;s Chairman of the Board of Trustees.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO & Chairman of the Board of Directors","firm":{"name":"Cleartronic, Inc.","permalink":"cleartronic-inc","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}