{"first_name":"Dana","last_name":"Mead","permalink":"dana-mead","crunchbase_url":"http://www.crunchbase.com/person/dana-mead","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 28 17:13:45 UTC 2008","updated_at":"Thu May 29 00:11:58 UTC 2008","overview":"<p>Dana Mead joined Kleiner Perkins Caufield &amp; Byers as a partner in May 2005 to work in the life sciences practice.</p>\n\n<p>For the past 23 years, Dana&#8217;s career has focused on identifying new medical technologies, developing new markets and therapies, and building world-class management teams. He has worked with physician thought leaders around the world representing 10 different medical specialties. At KPCB, Dana leverages experience gained from his venture-funded, start-up management roles and board participation to support entrepreneurs and innovators dedicated to making a real difference in the lives of millions suffering from life-limiting disease.</p>\n\n<p>Prior to joining KPCB, Dana was President of Guidant Vascular Intervention, a fully integrated billion dollar division with over 4500 employees. Since joining Guidant in 1992, he held positions of increasing responsibility including Vice President and General Manager, Cardiac &amp; Vascular Surgery; Vice President and General Manager, Stents, Vascular Intervention Group; President, Japan and A/P Operations based in Tokyo; and Vice President, Corporate Relations and Policy with responsibility for investor relations, corporate communications, corporate marketing and public policy initiatives. Prior to joining Guidant, Dana worked in various sales and marketing roles at Allergan, Inc. and Johnson &amp; Johnson. A native of Connecticut, Dana received his Bachelor&#8217;s degree from Lafayette College and holds an MBA degree from the University of Southern California. Dana serves on the boards of AesThera, Inc., Corventis, Navigenics, Inc., OtisMed Corporation, Sinexus, Inc., Synvascular, Invuity, Inc., Spinal Modulation, Inspire Medical Systems, the California Healthcare Institute (CHI), the Cardiovascular Research Foundation (CRF), and Lucile Packard Children’s Hospital.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Kleiner Perkins Caufield & Byers","permalink":"kleiner-perkins-caufield-byers","type_of_entity":"financial_org","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/0998/10998v8-max-150x150.jpg"],[[250,250],"assets/images/resized/0001/0998/10998v8-max-250x250.jpg"],[[450,450],"assets/images/resized/0001/0998/10998v8-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}