{"first_name":"Dana","last_name":"Gardner","permalink":"dana-gardner","crunchbase_url":"http://www.crunchbase.com/person/dana-gardner","homepage_url":"http://www.interarbor-solutions.com/","birthplace":"Somerville, Mass.","twitter_username":null,"blog_url":"http://briefingsdirectblog.blogspot.com","blog_feed_url":"http://briefingsdirectblog.blogspot.com/feeds/posts/default?alt=rss","affiliation_name":"Unaffiliated","born_year":1960,"born_month":6,"born_day":5,"tag_list":"software, enterprise-software, SOA, cloud-computing, middleware, mufflers, podcasts, BriefingsDirect, Interarbor, application-development","alias_list":null,"created_at":"Fri Apr 18 07:27:06 UTC 2008","updated_at":"Wed Apr 30 14:43:00 UTC 2008","overview":"<p>Dana Gardner is a leading identifier of software productivity trends and new IT business value opportunities. He honed his skills and refined his insights as an IT industry analyst, beginning in 1999. For 10 years prior to becoming an industry analyst, he was a pundit and online/print news editor, with onging coverage of the emerging software development and enterprise infrastructure arenas.</p>\n\n<p>Gardner is well known as a creative thought leader on enterprise software solutions, strategies, partnerships, and markets. As a skilled multi-media communicator and evangelist, he has written dozens of industry reports on the business benefits of IT and Internet innovation for advancing general productivity, improving employee efficiency, and reducing total IT costs.</p>\n\n<p>Gardner tracks and analyzes a critical set of enterprise software technologies and business development issues: Service Oriented Architecture, Web services, integration, application development tools and application delivery optimization techniques. His specific interests include enterprise infrastructure and business processes, developer tool advances and trends, open source strategies, infrastructure outsourcing and utility usage trends, governance and virtualization deployment initiatives.</p>\n\n<p>As founder and president of Interarbor Solutions, Gardner has taken a strong record in consulting services for IT vendors, carriers, and enterprises to yet another level: The exciting new communications capabilities around Internet social media. Businesses of all kinds are quickly exploiting blogs, podcasts and video-podcasts for education, communications and viral outreach. Gardner practices what he preaches, as a frequent blogger on ZDNet and his personal blog, as well as a podcaster. He began podcasting as a founding member of the Gillmor Gang in 2004.</p>\n\n<p>Through Interarbor Solutions and the BriefingsDirect™ series of Internet content vehicles, Gardner is introducing a novel mashup of analyst skills with Web 2.0 publishing. BriefingsDirect™ and producing BriefingsDirect™sponsored and non-sponsored podcasts combine the value of leading industry analysts&#8217; perspective and objective credibility with a natural language ease in understanding complex IT subjects. This equivalent of a deep-dive analyst briefing made available as a widely available podcast to all interested listeners breaks the mold of exclusive knowledge, takes the best of what IT product innovators know, and delivers it all with balance and objectivity within a 30-minute lively discussion.</p>\n\n<p>Gardner is a former senior analyst in the Application Infrastructure &amp; Software Platforms Decision Service at Yankee Group Research Inc., where he advised clients on enterprise software technologies, software trends and developments, and application development and deployment strategies. Before joining Yankee Group in 2003, Gardner was an industry analyst covering enterprise software at Aberdeen Group, beginning in 1999. A reporter and editor in the general press from 1980 through 1988, Gardner is a former editor-at-large and founding online news editor at InfoWorld. He is also a former news editor at the global IDG News Service, and at Digital News &amp; Review and Design News magazines.</p>\n\n<p>Gardner was designated a &#8220;Top Industry Influencer&#8221; for IT industry analysts by Technology Marketing magazine in both 2001 and 2002. He helped earn a &#8220;Best Trade Tabloid&#8221; Maggie Award from Western Publications Association (WPA) in 1998, and was a &#8220;Top Computer Journalist&#8221; for electronic publications, awarded by Marketing Computers in 1996.</p>\n\n<p>He is frequently quoted as an IT industry thought leader in publications such as The New York Times, The Wall Street Journal, The Boston Globe, Financial Times, Washington Post, Business Week, San Francisco Chronicle, San Jose Mercury News, Reuters, Associated Press, MSNBC.com, CNN.com, and ABCNews.com, as well as dozens of IT trade publications and Web sites.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/7456/17456v1-max-150x150.jpg"],[[150,150],"assets/images/resized/0001/7456/17456v1-max-250x250.jpg"],[[150,150],"assets/images/resized/0001/7456/17456v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor of Science","subject":"Journalism","institution":"Northeastern University","graduated_year":1984,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President and Founder","firm":{"name":"Interarbor Solutions","permalink":"interarbor-solutions","type_of_entity":"company","image":{"available_sizes":[[[150,37],"assets/images/resized/0003/8353/38353v1-max-150x150.png"],[[250,62],"assets/images/resized/0003/8353/38353v1-max-250x250.png"],[[450,112],"assets/images/resized/0003/8353/38353v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://www.linkedin.com/in/danagardner","title":"LinkedIn"},{"external_url":"http://twitter.com/Dana_Gardner","title":"Twitter"},{"external_url":"http://del.icio.us/danagardner","title":"Del.icio.us Tags"},{"external_url":"http://www.facebook.com/profile.php?id=735116476","title":"Facebook"}]}