{"first_name":"Danielle","last_name":"Hughes","permalink":"danielle-hughes","crunchbase_url":"http://www.crunchbase.com/person/danielle-hughes","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Divine Capital Markets","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Mar 19 18:54:04 UTC 2008","updated_at":"Thu Apr 07 01:32:00 UTC 2011","overview":"<p>Ms. Hughes is the CEO and Founder of Divine Capital Markets LLC. Ms. Hughes founded Divine Capital in 2001 with the intention of aligning her firm&#8217;s interests with her client&#8217;s interests, understanding the importance of transparency in the global marketplace along the value chain within the securities industry. Today, Divine is recognized for providing high quality equity and option execution, research and trading strategies, investment banking services, and capital introduction. Divine Capital&#8217;s clients include leading institutional fund managers, pension plan sponsors, major corporations, family offices and high net worth individuals.</p>\n\n<p>Ms. Hughes began her wall Street career in 1991, and has extensive proven expertise in the areas of proprietary and agency equity trading and investment banking. From 1992 to 1998, Ms. Hughes served as Vice President of Trading at M.H. Meyerson &amp; Co., a large wholesale market making firm, and was responsible for establishing the firm&#8217;s IPO and Secondary trading desk. Working with the Investment Banking department, Ms. Hughes was responsible for effecting numerous corporate finance transactions for companies listed on NASDAQ NMS, Small Cap and the OTC Bulletin Board. In 2005, Ms. Hughes established Divine Alternative Asset Management.</p>\n\n<p>Ms. Hughes appears regularly on CNBC and is a frequent guest on the FOX News and FOX Business. She is a member of the Women&#8217;s Presidents Organization and serves on the Deans Advisory Board for the School of Behavioral Sciences at the University of Massachusetts at Amherst.</p>\n\n<p>Ms. Hughes graduated cum laude from the University of Massachusetts at Amherst. She holds the Series 7, 63, 55, 24, 53, 65 and 79 securities licenses.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Divine Capital Markets","permalink":"divine-capital-markets","type_of_entity":"financial_org","image":{"available_sizes":[[[150,17],"assets/images/resized/0002/1473/21473v1-max-150x150.png"],[[250,29],"assets/images/resized/0002/1473/21473v1-max-250x250.png"],[[251,30],"assets/images/resized/0002/1473/21473v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.divinecapital.com","title":"Divine Capital site"},{"external_url":"http://www.linkedin.com/profile/view?id=11356661&locale=en_US&trk=tab_pro","title":"LinkedIn"}]}