{"first_name":"Daniel","last_name":"Kahneman","permalink":"daniel-kahneman","crunchbase_url":"http://www.crunchbase.com/person/daniel-kahneman","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 28 20:41:56 UTC 2009","updated_at":"Wed Jan 28 20:41:56 UTC 2009","overview":"<p>Daniel Kahneman is Eugene Higgins Professor of Psychology and Professor of Public Affairs Emeritus at Princeton University. He was educated at The Hebrew University in Jerusalem and obtained his PhD in Berkeley. He taught at The Hebrew University, at the University of British Columbia and at Berkeley, and joined the Princeton faculty in 1994, retiring in 2007. Over a wide-ranging research career he has been involved in many fields of psychology, ranging from vision and attention to the study of juror behavior and the measurement of well-being. He is best known for his contributions, with his late colleague Amos Tversky, to the psychology of judgment and decision making, which inspired the development of behavioral economics in general, and of behavioral finance in particular. This work earned Kahneman the Nobel Prize in Economics in 2002 and many other honors, including the 2006 Thomas Schelling Award given by the Kennedy School at Harvard &#8220;to an individual whose remarkable intellectual work has had a transformative impact on public policy&#8221;, and the Outstanding Lifetime Contribution Award of the American Psychological Association in 2007. He was instrumental in establishing the teaching of Psychology as a core discipline in the Woodrow Wilson School for Public and International Affairs at Princeton.</p>","image":{"available_sizes":[[[96,150],"assets/images/resized/0003/5105/35105v1-max-150x150.jpg"],[[160,250],"assets/images/resized/0003/5105/35105v1-max-250x250.jpg"],[[240,373],"assets/images/resized/0003/5105/35105v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}