{"first_name":"Daniel","last_name":"Crane","permalink":"daniel-crane","crunchbase_url":"http://www.crunchbase.com/person/daniel-crane","homepage_url":"http://web.law.umich.edu/_facultybiopage/facultybiopagenew.asp?ID=461","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Sat Feb 26 00:36:42 UTC 2011","updated_at":"Sat Feb 26 00:37:03 UTC 2011","overview":"<p>Professor Daniel Crane teaches contracts, antitrust, antitrust and intellectual property, and various advanced antitrust courses. He was previously professor of law at Yeshiva University&#8217;s Benjamin N. Cardozo School of Law, and a visiting professor at New York University Law School and the University of Chicago Law School. </p>\n\n<p>In the spring of 2009, he taught antitrust law on a Fulbright Scholarship at the Universidade Católica Portuguesa in Lisbon. His recent scholarship has focused primarily on antitrust and economic regulation, particularly the institutional structure of antitrust enforcement, predatory pricing, bundling, and the antitrust implications of various patent practices. Crane&#8217;s work has appeared in the University of Chicago Law Review, the California Law Review, the Michigan Law Review, and the Cornell Law Review, among other journals. </p>\n\n<p>He is the author of several books on antitrust law and has books forthcoming with Oxford University Press, one on the institutional structure of antitrust enforcement and the other on the intellectual history of competition policy.</p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0012/4043/124043v1-max-150x150.jpg"],[[125,166],"assets/images/resized/0012/4043/124043v1-max-250x250.jpg"],[[125,166],"assets/images/resized/0012/4043/124043v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}