{"first_name":"Daniel","last_name":"Delshad","permalink":"daniel-delshad","crunchbase_url":"http://www.crunchbase.com/person/daniel-delshad","homepage_url":"http://www.delshadcapital.com","birthplace":"Beverly Hills, CA","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jul 21 00:22:45 UTC 2011","updated_at":"Thu Jul 21 18:06:08 UTC 2011","overview":"<p>Daniel Delshad is the Managing Partner of Delshad Capital.  Delshad Capital provides early stage capital and advisory services to people building disruptive technology companies.  Mr. Delshad is responsible for the firms overall investment strategy and operations.  He has over 10 years in executive management experience in media, technology, and the internet. </p>\n\n<p>Prior to starting Delshad Capital, Mr. Delshad was the Chief Executive Officer of Storage World Media a large media and publishing business in the IT industry.  Storage World Media worked with industry leaders such as EMC, HP, IBM, Cisco, SUN, SONY, and many others.  After Storage World Media, Mr. Delshad became the CEO of Dream Team Gaming, an innovative developer of social games for the casino industry.  Dream Team Gaming work with many of the top casino properties in the world such as Harrah&#8217;s, Caesars Palace, World Series of Poker, Hard Rock Hotel and Casino, and The Bicycle Casino.</p>\n\n<p>Mr Delshad graduated from University of Southern California Marshall School of Business with a emphasis in Finance and Entrepreneurship.  Mr Delshad also studied abroad through the business exchange program at the Hong Kong University of Science and Technology (HKUST) with an emphasis in International Marketing.  </p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0014/5394/145394v2-max-150x150.jpg"],[[186,250],"assets/images/resized/0014/5394/145394v2-max-250x250.jpg"],[[336,450],"assets/images/resized/0014/5394/145394v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}