{"first_name":"Daniel","last_name":"Brauser","permalink":"daniel-brauser-2","crunchbase_url":"http://www.crunchbase.com/person/daniel-brauser-2","homepage_url":"http://www.usell.com","birthplace":"","twitter_username":"uSellCFO","blog_url":"http://www.usell.com/blog","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"usell-cfo, dan-brauser, duke-university, university-of-florida","alias_list":null,"created_at":"Mon Aug 29 15:20:03 UTC 2011","updated_at":"Wed Aug 31 01:21:23 UTC 2011","overview":"<p>As co-founder and CFO of Upstream Worldwide, Dan is responsible for the company’s financial operations, and is responsible for creating and expanding strategic partnerships for the benefit of Upstream’s growing number of users and investors. Dan works closely with the executive team to develop the overall mission and direction of the company and provides oversight to the day-to-day operations while charting the financial plan for the company’s future.</p>\n\n<p>Dan has extensive experience in resource coordination and accounting processes for emerging growth companies. Prior to Upstream, Dan was a co-founder and senior executive at Health Benefits Direct where he helped to create an innovative, technology-led approach to individual health insurance sales.  By evolving the traditional brokerage business, Health Benefits Direct quickly became one of the largest producing agencies for the nation’s top individual health insurance carriers.  In early 2009 the company sold its direct brokerage business and now focuses entirely on licensing the platform they originally developed to support their new way of doing business. Additionally, Dan is a partner in a private investment group that focuses on capital formation for early stage companies in a wide array of deal structures.</p>\n\n<p>Dan holds a BS in Finance from the University of Florida along with an MBA from Duke University’s Fuqua School of Business.</p>","image":null,"degrees":[{"degree_type":"BS","subject":"Finance","institution":"University of Florida","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"Fuqua School of Business","institution":"Duke University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}