{"first_name":"Daniel","last_name":"Ciraldo","permalink":"daniel-ciraldo","crunchbase_url":"http://www.crunchbase.com/person/daniel-ciraldo","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Young Folks Consulting","born_year":null,"born_month":null,"born_day":null,"tag_list":"web-development, startups, entrepreneur, silicon-valley, photo-retouch-service, website-development, website-analytics, seo, sem, usability, design","alias_list":null,"created_at":"Wed Nov 11 15:33:50 UTC 2009","updated_at":"Mon Feb 20 21:38:02 UTC 2012","overview":"<p>Daniel Ciraldo is an internet entrepreneur, founder of three online businesses, and startup advisor.</p>\n\n<p>In 2006, he founded PicWash, the online photo retouch service. PicWash was named by Photoshop Creative Magazine as among the best internet services. It includes a website at PicWash.com as well as a rich internet application built in Adobe Flex, which is embeddable on third party websites, such as Facebook, Photobucket, Picasa, Smugmug, and Flickr. Users upload their photos to PicWash and a professional graphic designer will enhance the photo and return an optimized version within 48 hours. Prices range from $7 to $15 depending on the level of beauty enhancement desired. As of 2011, PicWash had 8,000 users and had received significant publicity in top national media outlets such as CNET, Oprah Magazine, Nylon, Good Housekeeping, and Quick and Simple.</p>\n\n<p>In 2009, PicWash was selected by Y Combinator for the final stage of the application process - a 10 minute in-person interview where Y Combinator flew Daniel to Mountain View, California at YC&#8217;s expense. PicWash was not ultimately chosen for Y Combinator seed-stage funding, however the trip to Mountain View inspired Daniel to move west and continue to pursue his passion for the internet.</p>\n\n<p>In 2010 Daniel moved to Palo Alto, California. During his time in Silicon Valley, he started Young Folks Consulting, a web development and internet consulting agency aimed at helping small to mid sized businesses design, plan, and implement their online strategy.</p>\n\n<p>In 2010, Daniel worked under contract at Facebook as an Analyst on the Risk Management team. The team worked with teams across the company to enable new features, help users stay safe online, and protect the company&#8217;s assets.</p>\n\n<p>Daniel&#8217;s primary focus as of 2011 is on Young Folks Consulting, where he and his team provide web development, website analytics, SEO, SEM, and usability and design services to its clients. Young Folks currently serves clients in San Francisco, Seattle, Los Angeles, New York and Miami. He also advises pre-launch startups in New York City and Paris, France.</p>\n\n<p>Previously, he was Director of Sales and Marketing for Florida-based CosMedical Technologies, a physician-dispensed skin care manufacturing company. </p>\n\n<p>Prior to that, he was a strategic Business Analyst at Deloitte Consulting in NYC, where he was involved in projects related to Strategy Formulation, Operational Excellence, Sales Force Effectiveness, Customer and Channel Strategy, Data Integration, and Document Imaging &amp; Retention for Governmental compliance.</p>\n\n<p>Daniel holds a Bachelor of Science in Finance and Marketing with a minor in Spanish from NYU Stern School of Business, from which he graduated magna cum laude. He has also studied PHP and Java programming in San Francisco and Miami.</p>\n\n<p>Daniel attended Ransom Everglades High School in Coconut Grove, Florida. He also attended The American School in Switzerland, in Lugano, Switzerland at age 15.</p>\n\n<p>Daniel&#8217;s native language is English. He also speaks Italian and Spanish. His hobbies include classical piano, which he has played since the age of 6. His favorite composer is Chopin.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0007/4797/74797v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0007/4797/74797v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0007/4797/74797v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor of Science","subject":"Finance/Marketing","institution":"NYU Stern","graduated_year":2005,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"PicWash","permalink":"picwash-com","type_of_entity":"company","image":{"available_sizes":[[[150,43],"assets/images/resized/0007/4595/74595v4-max-150x150.png"],[[250,72],"assets/images/resized/0007/4595/74595v4-max-250x250.png"],[[264,77],"assets/images/resized/0007/4595/74595v4-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Founder","firm":{"name":"Young Folks Consulting","permalink":"young-folks-consulting","type_of_entity":"company","image":null}}],"investments":[],"milestones":[{"description":"Started Young Folks Consulting.","stoned_year":2010,"stoned_month":6,"stoned_day":null,"source_url":"","source_text":null,"source_description":"","stoneable_type":"Person","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"first_name":"Daniel","last_name":"Ciraldo","permalink":"daniel-ciraldo"}},{"description":"Started Seasonal Skin Care","stoned_year":2006,"stoned_month":null,"stoned_day":null,"source_url":"","source_text":null,"source_description":"","stoneable_type":"Person","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"first_name":"Daniel","last_name":"Ciraldo","permalink":"daniel-ciraldo"}}],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.picwash.com/","title":"PicWash Photo Retouch Service"}]}