{"first_name":"Daniel","last_name":"Rubin","permalink":"daniel-rubin","crunchbase_url":"http://www.crunchbase.com/person/daniel-rubin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Alloy Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Aug 04 13:30:09 UTC 2007","updated_at":"Thu Mar 26 20:35:08 UTC 2009","overview":"<p>Daniel I. Rubin joined Alloy Ventures in 1999 after a 15-year career in business development, marketing and sales at leading technology companies. At Alloy, he focuses on investments in semiconductors, cleantech, and software-as-a-service. </p>\n\n<p>Operating experience\nBefore becoming a venture capitalist in 1999, Dan was a successful technology entrepreneur and also held a variety of executive-level sales, marketing and business development jobs in the IT industry. In 1991, he was a co-founder of Artisan Components and served as the initial VP of sales and marketing. He was the VP of business development through the company’s initial public offering in 1998. The company was later acquired by ARM Ltd. for $1 billion.</p>\n\n<p>Prior to Artisan Components, Dan worked at semiconductor capital equipment company Ultratech Stepper in many roles, including director of product marketing and managing director of Asian operations. He received a BA in Physics from Pomona College (1982).</p>\n\n<p>Current board seats\nDan serves on the board of directors of CiraNova, Ensenda, Molecular Imprints, Gradient Design Automation, Integrated Materials,Teradici, IPExtreme, and Integrated PhotoVoltaics. He is a board observer at Ellie Mae.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Alloy Ventures","permalink":"alloy-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[113,53],"assets/images/resized/0000/3916/3916v1-max-150x150.png"],[[113,53],"assets/images/resized/0000/3916/3916v1-max-250x250.png"],[[113,53],"assets/images/resized/0000/3916/3916v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}