{"first_name":"Daniel","last_name":"Rey","permalink":"daniel-rey","crunchbase_url":"http://www.crunchbase.com/person/daniel-rey","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Crea Labs","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Feb 03 13:01:31 UTC 2009","updated_at":"Sun Mar 15 22:47:29 UTC 2009","overview":"<p>Though he started his career as a programmer, Daniel Rey soon (and by chance) found out his real call was in System Administration. Since 2005 he has worked at Crea| SX Networks designing and implementing high-availability and high-scalability solutions and today he is the company’s COO and main technical referent when it comes to Server Networks setup and management. He claims his other computer is a 4000 node Beowulf cluster, though none has ever seen it, and occasionally uses his martial arts knowledge to increase staff productivity.</p>\n\n<p>While working at Crea| SX Networks, Daniel has been involved in projects with clients such as The Turner Broadcasting Systems Inc., Conviva, IamFootball.com, Panda Software, Bacardi, Wamba.com, Hispavista, Bingos.com, Bingos.co.uk, MediaGambling, ElGranBingo.com, Mambo.ca, HealthCare.com, among others.\nCurrently, Crea| SX Networks and its group of talented professionals are focused on projects that involve hosting, development, design, consulting, marketing and customer support.  </p>\n\n<p>DANIEL REY’S EXPERIENCE</p>\n\n<p>COO</p>\n\n<p>Crea Uruguay</p>\n\n<p>July 2008 -Present                       </p>\n\n<p>As Chief Operations Officer for Crea, part of the Crea Group, he is in charge of company operations and project supervising.</p>\n\n<p>Crea Uruguay (formerly SX Networks) is a six-year-old company that provides Web 2.0 services, focusing on Social Networks Software, Video Players and Video Streaming, Online Video Encoding, Games and Animations, as well as more traditional Web Services like Corporate Sites Design, Development and Hosting. </p>\n\n<p>CTO </p>\n\n<p>SX Networks</p>\n\n<p>March 2005 - July 2008                  </p>\n\n<p>Head of the Technology Department. Administration of Linux servers in Uruguay, USA, Netherland, Spain, Malta and Curacao. In charge of the design and implementation of high-availability and high-scalability solutions for the company’s clients.</p>\n\n<p>Systems Administrator</p>\n\n<p>Netlabs S.R.L.</p>\n\n<p>May 2002 – March 2005                 </p>\n\n<p>Customer Support and System Administration for Netlabs, working in projects such as the architecture redesign and restructure of an ISP network and the design and setup of a cluster with high availability and load balancing for the email service of an ISP. Setup and administration of firewalls, IDS, mail, web, webmail, monitoring and radius servers, etc.</p>\n\n<p>Systems Administrator</p>\n\n<p>Netgate</p>\n\n<p>August 1997  – April 2002            </p>\n\n<p>Administration of servers (Linux and Windows) and the ISP network. In charge of the well-functioning of all the services (web, mail, dedicated links, dial-up access, etc.) and network security.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"COO","firm":{"name":"Crea","permalink":"crea","type_of_entity":"company","image":{"available_sizes":[[[150,111],"assets/images/resized/0003/5544/35544v2-max-150x150.jpg"],[[250,185],"assets/images/resized/0003/5544/35544v2-max-250x250.jpg"],[[450,333],"assets/images/resized/0003/5544/35544v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}