{"first_name":"Daniel","last_name":"Zurr","permalink":"daniel-zurr","crunchbase_url":"http://www.crunchbase.com/person/daniel-zurr","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 04 00:59:23 UTC 2009","updated_at":"Thu Jun 04 01:07:06 UTC 2009","overview":"<p>Daniel Zurr Ph.D., CEO, Founder and Director, former President of Plantex Ikapharm (currently part of the Teva Group). Dr. Daniel Zurr founded Quark in 1993 and is currently CEO of the Company. Dr. Zurr also currently serves as a Director of QBI. Dr. Zurr has vast experience in senior research and business management in the chemical and pharmaceutical industries. Prior to establishing QBI, Dr. Zurr was the CEO of Plantex-Ikapharm, then the second largest pharmaceutical company in Israel with more than 300 employees and marketing offices in the United States, Europe and Japan, focused in the field of bulk active ingredients and finished dosage pharmaceuticals. During Dr. Zurr’s tenure, Plantex Ikapharm, now part of the Teva group of companies, became the first Israeli company ever to be inspected and approved by the FDA. In the early eighties, Dr. Zurr served as the Director of Licensing at G.D. Searle in Skokie, Illinois, where he was responsible for the major collaborative agreement between G.D. Searle and Meiji Seika Kaisha (Tokyo), involving the licensing of several drugs and recombinant DNA technology transfer. Dr. Zurr was also responsible for numerous other agreements, including those with Bayer AG (Leverkusen), Ono Pharmaceutical (Osaka) and May and Baker (London).</p>","image":null,"degrees":[{"degree_type":"M.Sc.","subject":"","institution":"Hebrew University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President and CEO","firm":{"name":"Quark Pharmaceuticals","permalink":"quark-pharmaceuticals","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0004/6573/46573v1-max-150x150.png"],[[168,51],"assets/images/resized/0004/6573/46573v1-max-250x250.png"],[[168,51],"assets/images/resized/0004/6573/46573v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}