{"first_name":"Daniel","last_name":"Rosen","permalink":"daniel-rosen","crunchbase_url":"http://www.crunchbase.com/person/daniel-rosen","homepage_url":"http://www.credit-aid.com","birthplace":"Los Angeles","twitter_username":"creditaid","blog_url":"http://www.credit-aid.com/blog","blog_feed_url":"http://www.credit-aid.com/credit-repair-blog/?feed=rss2","affiliation_name":"Unaffiliated","born_year":1963,"born_month":2,"born_day":14,"tag_list":"credit-repair-software","alias_list":null,"created_at":"Mon Oct 04 15:59:36 UTC 2010","updated_at":"Tue May 29 10:25:11 UTC 2012","overview":"<p>Credit-Aid: Credit Repair Software http://www.credit-aid.com CEO, Daniel Rosen is an entrepreneur, author, consumer advocate and motivational speaker who has appeared on The Tonight Show, Good Morning America, CNN and MSNBC. Rosen is also a software developer who has twice been &#8220;featured speaker&#8221; at the PC Magazine Awards for Excellence at Comdex. </p>\n\n<p>Rosen first developed Credit-Aid: credit repair software to solve his own credit problem.  A bank error had caused his score to plummet.  Repairing the damage for the error became a full-time job.  He started to develop a software solution to handle the repetitive tasks involved in credit repair. It worked and he raised his own credit score over 200 points in a very short time. Credit-Aid Software is now the top selling credit repair software and credit repair business software in the world.  Rosen writes articles, books and appears on television to discuss credit strategies. He teaches how to rapidly improve, manage and increase a credit score. Initially he built his software as an inexpensive solution for consumer, but soon, Mortgage Brokers and Companies began requesting larger versions to handle their clients.  Credit-Aid began developing professional editions which enable the user to start a credit repair business or to build your own qualified leads for real estate, mortgage, auto and other associated industries. Rosen&#8217;s financial strategies, positive outlook, boundless energy and sense of humor make him a popular speaker on the corporate circuit. </p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0010/4112/104112v2-max-150x150.jpg"],[[178,250],"assets/images/resized/0010/4112/104112v2-max-250x250.jpg"],[[258,361],"assets/images/resized/0010/4112/104112v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.credit-aid.com","title":"Credit Repair Software"}]}