{"first_name":"Daniel","last_name":"Desta","permalink":"daniel-desta","crunchbase_url":"http://www.crunchbase.com/person/daniel-desta","homepage_url":"http://about.me/danieldesta","birthplace":"Santa Ana, CA","twitter_username":"DanielKDesta","blog_url":"http://www.danieldesta.com","blog_feed_url":"","affiliation_name":"Funding International Exchange","born_year":1985,"born_month":3,"born_day":23,"tag_list":"daniel-desta, funding-international-exchange, daniel-desta-funding","alias_list":null,"created_at":"Wed Jul 06 01:28:12 UTC 2011","updated_at":"Thu Nov 22 06:44:10 UTC 2012","overview":"<p>At 18, Daniel Desta set out to find his future. Having decided to leave Devry University after just one semester, he packed his bags and left Columbus, Ohio in pursuit of bigger and better things. He knew there had to be something more in store for him. With the reluctant blessing of a family who didn&#8217;t always agree with his decision, but who knew he had to find himself, Daniel set out for California with nothing more than a book bag and a dream.</p>\n\n<p>After settling in San Jose, California and getting his bearings, he began to focus on his future. One day he picked up a paper and saw an ad that caught his eye. The ad simply read, &#8220;Looking for Loan officers. No experience needed, will train and can earn $10,000 a month.&#8221; This was too good to pass up so Daniel immediately called and set up an interview. The interview was a bit more than Daniel expected. It was a group interview with 12 people in the room. Soon the President of the company walked in and stated simply that of the 12 people in that room only one or two would be successful. Daniel was determined to be one of those two and after two short months, Daniel was the only loan officer left standing.</p>\n\n<p>Mastering home loans was just the beginning for Daniel and he soon moved on to new challenges. It was commercial loans that really piqued his interest, especially after many of his residential clients started to express an interest in commercial real estate. Seeing an opportunity, Daniel put his entrepreneurial spirit to work and founded Funding International Exchange, a company that provides privatized funding for major commercial developments. </p>\n\n<p>Daniel&#8217;s guiding principle in all of his endeavors is &#8220;Where there is a will, there is always a way&#8221; and he doesn&#8217;t stop until the job is done correctly and the client is satisfied. After starting his firm he reached out to some of the wealthiest firms, people and families, offering them the chance to invest in various projects and promising them a healthy return on their investment. This networking paid off and clients soon came to realize that Daniel was operating with a new and unique business model. He had created a streamlined process of investing, making it easier for clients to make clear decisions. His passion for the individual strengthens his personal relationships, which is the foundation for his reputable company. And that moral mentality is the secret to the success of Daniel Desta.</p>","image":{"available_sizes":[[[102,150],"assets/images/resized/0014/2610/142610v9-max-150x150.jpg"],[[171,250],"assets/images/resized/0014/2610/142610v9-max-250x250.jpg"],[[308,450],"assets/images/resized/0014/2610/142610v9-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"President","firm":{"name":"Funding International Exchange","permalink":"funding-international-exchange","type_of_entity":"company","image":null}},{"is_past":true,"title":"President","firm":{"name":"Funding International Exchange","permalink":"funding-international-exchange","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.danieldesta.com","title":""}],"web_presences":[]}