{"first_name":"Daniel","last_name":"Quezada","permalink":"daniel-quezada","crunchbase_url":"http://www.crunchbase.com/person/daniel-quezada","homepage_url":"http://www.carecloud.com","birthplace":"","twitter_username":"","blog_url":"http://blog.carecloud.com","blog_feed_url":"http://feeds.feedburner.com/carecloudblog","affiliation_name":"CareCloud","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Dec 20 19:22:43 UTC 2010","updated_at":"Thu May 26 06:33:08 UTC 2011","overview":"<p>Daniel Quezada is Vice President of Finance at CareCloud, responsible for overseeing corporate finance and accounting functions, including treasury, planning, analysis and financial reporting. He joined CareCloud in November 2010 as Corporate Controller and implemented new technologies, establishing more efficient practices to streamline finance processes and internal controls.</p>\n\n<p>Prior to CareCloud, Mr. Quezada developed a strong track record helping prominent organizations improve performance and manage risk. He previously held several finance roles at Burger King Corporation, including Senior Manager for Global Shared Services, where he led several projects to restructure corporate finance and accounting activities for the company’s subsidiaries in EMEA and Asia Pacific. As Controller for the Latin America/Caribbean Region, a key reporting segment with revenues of $115 million and operations in 26 countries, Mr. Quezada was involved in strategic initiatives to improve restaurant unit performance and optimize the Company’s tax structure. He was also a project manager in the Company’s first-year Sarbanes-Oxley compliance initiative and IPO process. Prior to Burger King, Mr. Quezada was a management consultant with KPMG and Arthur Andersen, working with diverse global clients such as Goldman Sachs, DHL Express, Ryder System, FPL Energy, Banco Santander and PeopleSoft. He has extensive experience in finance transformation, systems integration and shared services with Fortune 500 and Global 2000 organizations.</p>\n\n<p>Mr. Quezada holds a Master of Business Administration degree from the University of Miami and is also certified in Six Sigma.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0011/4942/114942v2-max-150x150.png"],[[167,250],"assets/images/resized/0011/4942/114942v2-max-250x250.png"],[[200,299],"assets/images/resized/0011/4942/114942v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Vice President of Finance","firm":{"name":"CareCloud","permalink":"carecloud","type_of_entity":"company","image":{"available_sizes":[[[150,64],"assets/images/resized/0006/0043/60043v2-max-150x150.png"],[[250,107],"assets/images/resized/0006/0043/60043v2-max-250x250.png"],[[450,192],"assets/images/resized/0006/0043/60043v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}