{"first_name":"Dan'l","last_name":"Lewin","permalink":"danl-lewin","crunchbase_url":"http://www.crunchbase.com/person/danl-lewin","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Microsoft","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 05 10:32:37 UTC 2008","updated_at":"Wed Feb 25 15:49:46 UTC 2009","overview":"<p>Dan&#8217;l Lewin, corporate vice president for Strategic and Emerging Business Development (SEBT), is responsible for Microsoft Corp.&#8217;s global relationships with startups, venture capitalists and the business relationships with industry partners such as Adobe Systems Inc., Sun Microsystems Inc. and IBM Corp. Based in Silicon Valley, Lewin also has executive and site responsibility for the company&#8217;s operations in Mountain View, Calif., which currently employ 2,000 people.</p>\n\n<p>The SEBT includes three groups: the Emerging Business Team, the Local Software Economy (LSE) and the Strategic Relations Group, whose common goal is to support software startups and established companies working on the Microsoft platform while helping develop and grow local software economies worldwide. Through the Microsoft Startup Accelerator Program, the Interop Vendor and Secure IT Alliances, and the LSE&#8217;s Microsoft Innovation Center program, Lewin&#8217;s groups help accelerate startup success in more than 60 countries and help partner companies offer security-enhanced and interoperable products and services.</p>\n\n<p>Lewin has spent more than 30 years as a Silicon Valley-based executive leading sales and marketing divisions for companies including Apple Computer Inc., NeXT Inc. and GO Corp. Before joining Microsoft, he was CEO of Aurigin Systems Inc., a startup that pioneered intellectual property asset management, and he has consulted for emerging companies, venture capital firms and corporate joint ventures.</p>\n\n<p>Lewin serves on the boards of the Churchill Club; Software Development Forum; American Electronics Association; Santa Clara University Center for Science, Technology and Society; and the Tech Museum of Innovation, where he serves as chairman of the Tech Museum Awards program. He holds a bachelor of arts in politics from Princeton University.</p>","image":{"available_sizes":[[[150,115],"assets/images/resized/0002/7859/27859v1-max-150x150.png"],[[215,165],"assets/images/resized/0002/7859/27859v1-max-250x250.png"],[[215,165],"assets/images/resized/0002/7859/27859v1-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"AB","subject":"Politics","institution":"Princeton University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Corporate Vice President, Strategic and Emerging Business Development","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}