{"first_name":"Danny Singh","last_name":"Students' Finance Success","permalink":"danny-singh-students-finance-success","crunchbase_url":"http://www.crunchbase.com/person/danny-singh-students-finance-success","homepage_url":"http://www.facebook.com/studentsfinance","birthplace":"Orlando","twitter_username":"finance101whiz","blog_url":"http://www.flickr.com/people/studentsfinancesuccess","blog_feed_url":"http://en.netlog.com/studentsfinancesuccess","affiliation_name":"Students' Finance Success","born_year":1993,"born_month":6,"born_day":16,"tag_list":"","alias_list":null,"created_at":"Wed Sep 12 04:12:16 UTC 2012","updated_at":"Tue Sep 18 17:16:36 UTC 2012","overview":"<p>Danny Singh has been doing his mother&#8217;s finances since he was a child, has never been late on any bill, and has worked with over 30 financial institutions. At 14, he was able to refinance his mother&#8217;s house and car for lower interest rates. At 16, he managed to get over $1,300 interest refunded from a credit card company. Now, in response to the student loans crisis emerging, Danny is doing financial seminars, publishing tips, and helping consumers rehabilitate their credit by operating a non-profit credit assistance agency called &#8220;Students&#8217; Finance Success.&#8221; He has been recognized by Governor Rick Perry, First Lady Anita Perry, Seminole County Commissioner Bob Dallari, State Representative Jason Broduer, Senator Marco Rubio, and several news stations as the &#8220;financial whiz kid.&#8221; If you need help of any kind then please contact him using www.facebook.com/studentsfinance or call him at (407) 496-6005. He can help you save a house from foreclosure, save a car from repossession, and handle any type of financial issue free of charge. Danny&#8217;s reward is your financial freedom and experience helps his passion grow. Danny published a book called &#8220;Finance 101: The Whiz Kid&#8217;s Perfect Credit Guide.&#8221; All profits are donated to the Children&#8217;s National Medical Center for HIV research. Thank you for your support.</p>\n\n<p>“Danny has demonstrated exceptional finance and accounting abilities and his accomplishments are impressive- especially considering his young age. His training has been invaluable. I am pleased to commend his excellence.”\nRick Perry, Governor of Texas and First Lady Anita Perry</p>\n\n<p>“I can say without reservation that Danny is a young man of impeccable character. Danny has taken a strong stand for his family as he began controlling the family finances. He is truly a unique individual who has had extremely different priorities.”\nJason Brodeur, Florida State Representative, District 33</p>\n\n<p>“Danny’s extensive knowledge of credit and the banking industry that he shared with me greatly impressed me considering his young age. His financial talents are rare and he is with no doubt a very gifted individual with a bright future ahead.”\nBob Dallari, Seminole County Commissioner, District 1</p>\n\n<p>“Paying the bills and balancing a checkbook&#8211;all the task and responsibilities of being an adult. But one mom said she handed it all over to her son at just 11 years old.”\nCentral Florida News 13</p>\n\n<p>“Danny was a natural, a finance whiz kid. Soon, he was spending time reading the small print on each of his mom&#8217;s credit card statements and every bill that came through. He started refinancing the ways banks work, how credit card companies calculate interest and what makes credit good.”\nEast Orlando Sun</p>\n\n<p>“Growing up Danny wanted to be a doctor. But that changed, the moment his mom gave him a new chore around the house. One that saved her thousands of dollars, and helped her son find a new path in life.”\nDallas/Fort Worth WFAA-TV</p>\n\n<p>“Danny accomplished the feat by negotiating with Bank of America was he was just 14 years old!”\nFox 35 News</p>\n\n<p>“Feeling frustrated over finances? Need help managing a student loan? The Financial Whiz Kid may be able to help.”\nSeminole Chronicle</p>\n\n<p>“You may have heard of Danny “Financial Whiz Kid” Singh. At the age of 11, the Orlando boy took over his mom’s finances. By the age of 14, he had refinanced their home mortgage, persuaded banks to remove annual fees from his mom’s credit cards and negotiated more than $1300 in refunds on interest and fees for her. His financial savvy attracted the attention of print and electronic media – and fellow high school students.”\nSeminole State College of Florida (Formerly, Seminole Community College)</p>\n\n<p>“In reading Danny’s book, Danny is truly a genius when it comes to finances because he is always giving advice, especially to college students. His information helped me make the financial decision, which was to put my savings into a more lucrative account so I would not need to take out loans for college! I was not disappointed by his book and neither will you.”\nLacey Kresen, Student at Valencia College, Orlando</p>\n\n<p>“In Finance 101: The Whiz Kid&#8217;s Perfect Credit Guide, Danny demonstrates he has an endless knowledge of finances. He himself has applied what he knows about money, loans, and other financial decisions and is now sharing this invaluable information with us. Danny truly cares about others and their finances and the purpose of his book is to help us remain debt free and happy.”\nGrace Love, Student at the Seminole State College of Florida, Sanford</p>\n\n<p>“Danny’s book proves he is incredibly knowledgeable when it comes to personal finance. The best part about his book is that he does not just want to help his fellow students begin their lives by making the best financial decisions possible but he also wants to make sure that they continue to use good spending habits into the future. I absolutely love how he does so in terms that anyone and everyone can understand.”\nArisa Ramirez, Student at Rollins College, Winter Park</p>\n\n<p>“Danny Singh is the man to go to for financial information. In his book, he breaks it down to a level that&#8217;s understandable for anyone. He even goes above and beyond to provide financial assurance if you contact him directly.”\nNicole Phillip, Student at the University of Central Florida, Orlando</p>\n\n<p>“Danny has an extraordinary talent in finance. Through his book, he shares it with the world hopefully to help everyone. Not only did he help his mom with her credit, but he has freely helped in giving useful tips to friends on how to avoid debt and how to develop good credit; especially for us college students! Danny’s book is vital for all consumers to have regardless of their financial conditions.”\nNadia Williams, Student at the University of Central Florida, Orlando</p>\n\n<p>“I have never read such a greatly detailed and yet, easy to understand book about credit and managing your finances. His book is as beneficial at the financial seminars he has performed at the college. I am an international student, and knew very little about the credit scoring system before reading Danny’s book and now I have a perfect understanding of it. Despite being 19, I feel as though Danny clearly knows more about finance than a person with an MBA. I cannot stress the importance of reading this book because it saved me from making poor financial decisions and it is guaranteed to help others do the same.”\nMedge L. Parcily. Student at Seminole State College of Florida, Sanford</p>\n\n<p>“Do not think the book will not help you succeed financially because Danny is extremely knowledgeable and has a gift for finance. His book has taught me the steps I always need to take before taking out a loan or applying for a new credit card! The book has been so helpful and serves as a guide to help me achieve the best credit possible and ultimately, save the most amount of money for retirement.”\nKaitlyn Pennington, Student at Harmony High School, Orlando</p>\n\n<p>“Danny is extremely brilliant when it comes to the finance world and the most important part of his book in the way he explains about credit cards and home financing: He knows what he is talking about and has many years of experience to support his knowledge. He also has the patience and ability to explain all these things well to people ignorant about the specific details when it comes to consumer finance.”\nRatna Okhai, Student at the University of Central Florida, Orlando</p>\n\n<p>“Danny is a professional in finance and he shows this in Finance 101: The Whiz Kid&#8217;s Perfect Credit Guide. When I first opened up a checking account I had issues with overdraft fees and didn&#8217;t understand how my account was handled. I also was a victim of credit card fraud. Danny’s book has supported, explained, and given me tips as to how to survive the world of banking. He is not just a professional but a great friend to everyone who wants to achieve the dream of financial freedom.”\nSteven Silvernail, Student at the University of Central Florida, Orlando</p>\n\n<p>“Danny&#8217;s book is motivated to help consumers of all ages achieve unlimited financial success just as how he has achieved success with his mother&#8217;s finances. He offers several tips on budgeting money so the maximum amount can be used towards paying loans and saving for retirement while taking care of everyday expenses. Doing so allows for me to improve my credit scores and save even more money on insurance. I was not aware about the significance of building credit early and how without credit, I could be denied for a job, house, or car. The book enlightened me on finance and I am so grateful for reading it. The book is the best investment I have ever made in my life.”\nTyi Gardener, Student at Valencia College, Orlando</p>\n\n<p>“Wow - what a knowledgeable book! Mr Singh covers everything from credit cards to student loans to retirement accounts. I would recommend using this book as more of a reference book since it is so full of information and will be something you will want to refer back to for many years.”\nDanny Kofke, author of &#8220;A Simple Book Of Financial Wisdom: Teach Yourself (and your kids) How To Live Wealthy With Little Money&#8221;</p>","image":{"available_sizes":[[[119,150],"assets/images/resized/0021/0996/210996v2-max-150x150.jpg"],[[199,250],"assets/images/resized/0021/0996/210996v2-max-250x250.jpg"],[[359,450],"assets/images/resized/0021/0996/210996v2-max-450x450.jpg"]],"attribution":"<p>Finance 101: The Whiz Kid&#8217;s Perfect Credit Guide</p>"},"degrees":[{"degree_type":"Bachelor of Science","subject":"Business and Information Management","institution":"Seminole State College of Florida","graduated_year":2012,"graduated_month":null,"graduated_day":null},{"degree_type":"Masters and Ph.D.","subject":"Business Administration and Management","institution":"University of Central Florida","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Consumer Banking and Credit Advisor","firm":{"name":"Students' Finance Success","permalink":"students-finance-success","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}