{"first_name":"Dante","last_name":"Crescenzi","permalink":"dante-crescenzi","crunchbase_url":"http://www.crunchbase.com/person/dante-crescenzi","homepage_url":"","birthplace":"Washington, DC","twitter_username":"dantecrescenzi","blog_url":"http://www.edante.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1973,"born_month":10,"born_day":2,"tag_list":"","alias_list":null,"created_at":"Wed Jan 06 03:17:38 UTC 2010","updated_at":"Wed May 12 22:58:30 UTC 2010","overview":"<p>Entrepreneur who founded ImpactWorks, an Interactive Online Development Company. Co-founder of International Technology Group, LLC, a Technology Outsourcing &amp; Professional Services Company and Co-Founder of iDentaKey, a Portable Safety Software Development Company.</p>\n\n<p>Innovator who built the iDentaKey brand and company that developed the iDentaKey portable safety software from initial concept to a successful product that currently sells in many online and brick and mortar stores in several countries.</p>\n\n<p>Contributing leader with extensive executive management, marketing, product marketing, marketing communications, and product management experience.</p>\n\n<p>Seasoned product manager of a publicly-traded Internet Service Provider (Digex) responsible for identifying new markets for generation of additional revenue to WSMG. Defined and implemented new product offerings based upon market research. Assessed competition for similar offerings; determined best DIGEX positioning. Key, active participant in activities leading up to a successful public offering.</p>\n\n<p>Broad-based Internet marketing and technology expert whose experience includes brand development, product marketing, product management, manufacturing and operations, consulting, and development. Product and services expertise includes Internet and Online services, Internet/Intranet application development and deployment, end-user applications, systems analysis &amp; design, client/server and object-oriented development and deployment.</p>","image":{"available_sizes":[[[93,150],"assets/images/resized/0008/6848/86848v2-max-150x150.jpg"],[[104,166],"assets/images/resized/0008/6848/86848v2-max-250x250.jpg"],[[104,166],"assets/images/resized/0008/6848/86848v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}