{"first_name":"Darius","last_name":"Wey","permalink":"darius-wey","crunchbase_url":"http://www.crunchbase.com/person/darius-wey","homepage_url":"http://codesparq.com","birthplace":"","twitter_username":"dariuswey","blog_url":"","blog_feed_url":"","affiliation_name":"Future Health","born_year":null,"born_month":null,"born_day":null,"tag_list":"developer","alias_list":null,"created_at":"Wed Dec 16 02:41:22 UTC 2009","updated_at":"Tue Jun 26 16:37:31 UTC 2012","overview":"<p>A double-major Computer Science graduate from the University of Western Australia, Darius is a well-regarded designer and developer with a wealth of knowledge and experience in the fields of computational and programming principles, systems, software engineering, graphic and Web design, and mobile computing.</p>\n\n<p>Darius worked as a Software Engineer at IBM, focusing on the development of Tivoli systems and service management solutions, before venturing into the world of technology start-ups by founding Codesparq, a business specializing in the design and development of Web and mobile applications. His technical expertise in this area, coupled with a medical background spanning over three years, now sees him drive the design and development of many of Future Health&#8217;s innovative solutions.</p>\n\n<p>When not programming, Darius serves as the News Editor, System Administrator, and is a prolific writer for Thoughts Media Inc., a global network of online communities focused on Windows Mobile-based, Zune-based, and Apple-based software and hardware as well as a wide variety of other technologies. He also serves as a member of the Board of Experts panel at Smartphone &amp; Pocket PC Magazine, and an executive of the Perth Mobility User Group. Over the years, he has delivered many presentations and contributed countless technical articles to Microsoft, multiple user groups, and online and printed magazines. His passion for and thorough knowledge of mobile computing as well as his desire and willingness to give back to the community has seen him recognized as a Microsoft Most Valuable Professional (MVP).</p>\n\n<p>Darius currently resides in the sunny coastal city of Perth, Australia. He has an avid interest in travel, photography, music, and good food, and is shamelessly addicted to green tea.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CTO","firm":{"name":"HealthEngine","permalink":"healthengine","type_of_entity":"company","image":{"available_sizes":[[[150,24],"assets/images/resized/0004/0043/40043v6-max-150x150.png"],[[250,41],"assets/images/resized/0004/0043/40043v6-max-250x250.png"],[[450,73],"assets/images/resized/0004/0043/40043v6-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Associate","firm":{"name":"Future Health","permalink":"future-health","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0006/9600/69600v2-max-150x150.jpg"],[[250,89],"assets/images/resized/0006/9600/69600v2-max-250x250.jpg"],[[257,92],"assets/images/resized/0006/9600/69600v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.facebook.com/dariuswey","title":"Facebook"},{"external_url":"http://twitter.com/dariuswey","title":"Twitter"},{"external_url":"http://au.linkedin.com/in/dariuswey","title":"LinkedIn"}]}