{"first_name":"Darlene","last_name":"Emerick","permalink":"darlene-emerick","crunchbase_url":"http://www.crunchbase.com/person/darlene-emerick","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Lovetropolis.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jun 18 17:18:10 UTC 2009","updated_at":"Fri Jun 19 19:07:14 UTC 2009","overview":"<p>Ms. Emerick&#8217;s education and vocational credentials make her an effective manager of the visual communication and presentation of Lovetropolis.com.  Ms. Emerick is an award-winning web developer, graphic artist and designer whose individual and collaborative work has been recognized multiple times with DAF Alfies and Addys, both prestigious industry awards.</p>\n\n<p>Ms. Emerick is a graduate of the Colorado Institute of Art and has nearly 30 years professional experience in graphic design and production.  She is strongly versed in conceptual design, Flash animation, illustration and digital video.  Ms. Emerick has previously worked with both global corporations prominent domestic companies.</p>\n\n<p>As Director of Graphic Design, Ms. Emerick&#8217;s duties include managing and maintaining website content, uploading new graphic work and content, providing technical and creative support for Lovetropolis.com, implementing leading-edge graphics and technologies, developing web site graphics and arrangements, enhancing and maintaining creative and overall visual aspects of Lovetropolis.com, assisting in development of concepts to create online experiences that delight Lovetropolis.com members and designing page templates and browser-ready proofs of concepts for web properties and onine campaigns.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Director of Graphic Design","firm":{"name":"Lovetropolis.com","permalink":"lovetropolis-com","type_of_entity":"company","image":{"available_sizes":[[[150,22],"assets/images/resized/0004/9655/49655v2-max-150x150.png"],[[250,36],"assets/images/resized/0004/9655/49655v2-max-250x250.png"],[[450,66],"assets/images/resized/0004/9655/49655v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}