{"first_name":"Darren","last_name":"McKenzie Chaffee","permalink":"darren-mckenzie-chaffee","crunchbase_url":"http://www.crunchbase.com/person/darren-mckenzie-chaffee","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"CoBe Capital","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jun 07 23:04:56 UTC 2012","updated_at":"Fri Oct 12 01:40:29 UTC 2012","overview":"<p>Darren Chaffee, Managing Director of Global Mergers and Acquisitions at CoBe Capital, oversees the evaluation and execution of transactions, including valuation, due diligence and contract negotiation.  He oversees all transactions on a global basis and leads all North American transactions directly.  Mr. Chaffee most recently led the acquisitions of Warendorfer Küchen, Bourrelier Éducation and Sendori.</p>\n\n<p>Mr. Chaffee has been responsible for institutionalizing CoBe Capital&#8217;s business development strategy and development of CoBe&#8217;s European platform for transactions and operations.  Since joining CoBe Capital, he has worked directly with Neal Cohen to drive CoBe&#8217;s growth and international expansion.</p>\n\n<p>A road warrior at heart, he is frequently traveling to evaluate new transactions, working with corporate development teams to execute new potential deals, guiding management our teams at operating companies and networking internationally to create new opportunities.  Given his deep financial expertise, he oversees all financial due diligence during transactions and consults operating companies on their financial management.</p>\n\n<p>Prior to joining CoBe Capital, Mr. Chaffee was a Principal with the Pegasus Blue Star Fund, where he completed transactions in media &amp; entertainment, healthcare, aviation, consumer goods, business services and retail.  Prior to Pegasus, Mr. Chaffee was with Platinum Equity, where he specialized in complex corporate carve-out acquisitions.  He began his career at Deloitte as part of the Mergers and Acquisitions Services group in New York.  There, he performed private equity due diligence, advising on transactions in biotech, radio, manufacturing, telecom and financial services.</p>\n\n<p>Mr. Chaffee received a Master of Accounting from the University of Southern California&#8217;s Marshall School of Business and graduated with distinction from Occidental College with an A.B. in Economics and Diplomacy &amp; World Affairs.  He is a Chartered Financial Analyst and a licensed Certified Public Accountant in the State of New York.\nMr. Chaffee resides in Manhattan with his wife and daughter.  He is an avid runner and enjoys running marathons.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director, Global Mergers and Acquisitions","firm":{"name":"CoBe Capital","permalink":"cobe-capital","type_of_entity":"company","image":{"available_sizes":[[[150,59],"assets/images/resized/0021/3943/213943v2-max-150x150.png"],[[250,98],"assets/images/resized/0021/3943/213943v2-max-250x250.png"],[[450,177],"assets/images/resized/0021/3943/213943v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}