{"first_name":"Darren","last_name":"Salkeld","permalink":"darren-salkeld","crunchbase_url":"http://www.crunchbase.com/person/darren-salkeld","homepage_url":"","birthplace":"","twitter_username":"SkalkeldDarren","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Aug 24 11:25:21 UTC 2012","updated_at":"Thu Aug 30 19:49:13 UTC 2012","overview":"<p>Darren Salkeld helps turn business ideas into successful and profitable realities.  As an entrepreneur and seasoned start-up specialist he creates business plans that succeed, even in today&#8217;s economy.  By organizing and designing business plans that target the right audience, he has helped business start-ups find success and profitability. By utilizing both online strategies and traditional business plan models, businesses can get the most exposure and draw needed attention to their business.</p>\n\n<p>When Darren Salkeld speaks with new business owners and entrepreneurs, he speaks from experience. Having built his consulting business from the ground up he knows what it takes to succeed and he enjoys sharing his knowledge with others who want to create a successful business for themselves.  Darren is business-minded and also well-rounded in his experience, having helped a myriad of charities build business plans and raise money for their work. On a personal level he donates to multiple charities that are special to him, including Save the Children, an organization that provides support to children in over 120 countries.</p>\n\n<p>Not every business owner can afford to get their businesses up and running on their own—that&#8217;s where investors come in.  More than anything else, investors want to see how a business idea will be successful and generate a profit. An effective business plan is the best way to ensure that investors seriously consider a business proposal.</p>\n\n<p>Darren Salkeld has helped companies make over $15,000,000 of income over an 18 month time span through his systems.  By using his first-hand experience he helps clients compose a business plan that will allow investors to see their ideas in action.  Darren Salkeld works with owners of small business start-ups as well as CEO&#8217;s of Fortune 500 Companies; both have seen success from his experienced advice. With business plans that highlight strategy, marketing and financials, success for entrepreneurs becomes a reality.  </p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/7937/207937v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/7937/207937v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/7937/207937v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}