{"first_name":"Darren","last_name":"Nelson","permalink":"darren-nelson","crunchbase_url":"http://www.crunchbase.com/person/darren-nelson","homepage_url":"http://www.sofloridarealty.com/","birthplace":"Mount Kisco, NY","twitter_username":"RealEstateSFL","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1978,"born_month":8,"born_day":1,"tag_list":"real-estate, south-florida, fort-lauderdale, broward-county, homes-for-rent, apartments-for-rent, house-for-sale, sell-my-home, rentals","alias_list":null,"created_at":"Fri Jul 20 11:42:57 UTC 2012","updated_at":"Tue Jul 24 09:27:24 UTC 2012","overview":"<p>About Darren Nelson</p>\n\n<p>My Client-First Philosophy\nThere are many qualities and skills that go into being an excellent real estate professional - integrity, in-depth community and market knowledge, marketing savvy, effective negotiation skills and a high-quality professional network, all of which are hallmarks of how I work.</p>\n\n<p>That said, in my experience as a Ft. Lauderdale real estate professional, I&#8217;ve also found that providing the very best service is essentially about putting my clients first. This means keeping myself accessible, being a good listener as well as a good communicator, and responding quickly to your needs.</p>\n\n<p>This &#8220;client first&#8221; philosophy has always been my approach and it requires me to continually improve my skills and ways of doing business. In addition, I&#8217;ve found that the latest technologies are enabling me to do everything I&#8217;ve always done, only much more quickly and efficiently. They&#8217;ve also helped me to extend the range of services I provide to my clients.</p>\n\n<p>So when you decide that you&#8217;d like to buy or sell a home in the South Florida, Broward, Fort Lauderdale, Pompano, Lauderdale-by-the-Sea, Lauderdale Lakes, Oakland Park, Plantation, Victoria Park, Downtown Fort Lauderdale, Sunrise, Coconut Creek, Hillsboro Beach, Hollywood, Miramar areas, please contact me.</p>","image":{"available_sizes":[[[110,150],"assets/images/resized/0020/2062/202062v2-max-150x150.jpg"],[[184,250],"assets/images/resized/0020/2062/202062v2-max-250x250.jpg"],[[332,450],"assets/images/resized/0020/2062/202062v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://browardcountyhomes.info/","title":"What's Your Home Worth?"},{"external_url":"http://www.sofloridarealty.com/","title":"Website"}]}