{"first_name":"Darren","last_name":"Pollard","permalink":"darren-pollard","crunchbase_url":"http://www.crunchbase.com/person/darren-pollard","homepage_url":"http://www.mobilewizz.com/","birthplace":"Sydney, Australia","twitter_username":"mobilewizz","blog_url":"http://djp.typepad.com/","blog_feed_url":"http://djp.typepad.com/meusvitainrecenseo/index.rdf","affiliation_name":"Mayfair Gaming Group","born_year":1969,"born_month":12,"born_day":16,"tag_list":"","alias_list":null,"created_at":"Sun Nov 30 21:35:51 UTC 2008","updated_at":"Tue Jul 21 18:12:58 UTC 2009","overview":"<p>Darren is a media and IT professional based in New York. He has a sound track record of founding and growing a number of successful entrepreneurial ventures across the technology, mobile and internet industries in both Australia and the United States and now the United Kingdom.</p>\n\n<p>Darren is the founder of Mayfair Gaming Group, a play-for-money mobile gambling startup to be launched in the United Kingdom.  Mayfair Mobile has a simple but unique approach to the mobile distribution model that will foster greater discovery for players and provide much needed revenue for public houses across the UK.</p>\n\n<p>Based in New York, Darren was previously part of the founding team that established the new US operations of FunkySexyCool, a mobile social network that had achieved moderate success in Australia and Germany. He oversaw new partnership development and provided strategy and was instrumental in assisting the newly appointed Chief Executive navigate the challenging mobile content landscape as well as appoint two key senior members of the management team.</p>\n\n<p>Darren also helped LiveEvents – a boutique interactive mobile marketing outfit based in Sydney, Australia – create a presence in the North American market during 2005. He secured a number of deals including an interactive mobile TV service for a Mexican broadcaster and a Canadian sports media company.</p>\n\n<p>Before his move to the United States, Darren founded SportzSMS, whose technology was subsequently licensed to a number of sports media organizations globally including ESPN Soccernet in London, UK and Eurosport in Paris, France.</p>\n\n<p>Darren’s most successful venture was when he co-founded Broadscope Training Services which was Australia&#8217;s largest training company in 2003 - with more than 110 staff, over 8000 trainees and more than $20 million revenue.  Darren was responsible for the drive and growth of the business helping to automate the sales processes for the sales and marketing team of 25, oversaw the branding strategy to help increase the profile of the company which subsequently drove double digit growth for the company via multiple online, radio, television and print media campaigns.</p>\n\n<p>Darren is a keen traveler and has been to all seven continents and has lived in New York, Melbourne, Copenhagen and London.</p>\n\n<p>Darren holds a Associate Diploma of IT from Swinburne Institute and is a member of the American Australian Association and Advance, both professional networking groups for Australians living in the United States.</p>","image":{"available_sizes":[[[105,150],"assets/images/resized/0003/1181/31181v4-max-150x150.png"],[[120,170],"assets/images/resized/0003/1181/31181v4-max-250x250.png"],[[120,170],"assets/images/resized/0003/1181/31181v4-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"Bachelor","subject":"Information Tech","institution":"Swinburne University","graduated_year":1992,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Mayfair Gaming Group","permalink":"mayfair-gaming-group","type_of_entity":"company","image":{"available_sizes":[[[150,75],"assets/images/resized/0003/0454/30454v2-max-150x150.png"],[[150,75],"assets/images/resized/0003/0454/30454v2-max-250x250.png"],[[150,75],"assets/images/resized/0003/0454/30454v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}