{"first_name":"Daryl","last_name":"Scott","permalink":"daryl-scott","crunchbase_url":"http://www.crunchbase.com/person/daryl-scott","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Attaain","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jul 25 14:54:59 UTC 2008","updated_at":"Fri Aug 01 17:51:10 UTC 2008","overview":"<p>Daryl Scott, CEO of <a href=\"http://www.attaain.com\" title=\"Attaain Inc.\" rel=\"nofollow\">Attaain Inc.</a>, has over twenty-five years of experience in high technology businesses, including over eleven years leading the growth of several start-up companies in California’s Silicon Valley. He has extensive experience in a wide range of technologies, including enterprise and retail application software, mobile and wireless computing, and Internet, web and database systems.</p>\n\n<p>As an entrepreneur, he has previously founded a number of successful technology companies. Most recently, he was President &amp; CEO of Scott Technology Group, a high-tech management consulting firm. He also served as President &amp; Partner of Milestone Equity Partners SW Virginia, where he was responsible for identifying, launching and providing ongoing coaching to premier early-stage technology companies.</p>\n\n<p>Prior to this, Mr. Scott was President and CEO of CASIO Soft, Inc., a San Jose, California field force automation and mobile data collection spin-off company from CASIO Computer Corporation. Leading up to the spin-out of CASIO Soft, Mr. Scott was Director of the Mobile Systems Group at CASIO’s U.S. Research and Development Center, where he was responsible for both internal development and external licensing of technologies used in a variety of mobile computing systems and products, and for technology transfers to and from the Company’s R&amp;D facilities in Japan.</p>\n\n<p>Previously, Mr. Scott was founder and President of Avail Technology, Inc., a developer and marketer of software for the mobile computing market. He also founded and served as President of Select Micro Systems, Inc., specializing in desktop business and marketing applications, which was later acquired by Strategic Mapping, Inc. Post acquisition, Mr. Scott then went on to serve as Executive Vice President and a member of the Board of Directors at Strategic Mapping, Inc., a Geographic Information Systems and data analysis firm.</p>\n\n<p>Mr. Scott’s career also includes managing the development of a wide range of business software and market intelligence systems used in marketing, media planning and sales forecasting for several of the largest advertising agencies in New York City including Young &amp; Rubicam, J Walter Thompson and Foote, Cone &amp; Belding. He served as Corporate Vice President of Media Research at Foote, Cone &amp; Belding and developed many of the agency’s in-house marketing/media analysis and forecasting systems.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President & CEO","firm":{"name":"Attaain","permalink":"attaain","type_of_entity":"company","image":{"available_sizes":[[[129,33],"assets/images/resized/0002/2813/22813v1-max-150x150.png"],[[129,33],"assets/images/resized/0002/2813/22813v1-max-250x250.png"],[[129,33],"assets/images/resized/0002/2813/22813v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}