{"first_name":"Dave","last_name":"Mathieson","permalink":"dave-mathieson","crunchbase_url":"http://www.crunchbase.com/person/dave-mathieson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jul 23 11:27:40 UTC 2011","updated_at":"Sat Jul 23 11:29:23 UTC 2011","overview":"<p>Mr. David Mathieson was appointed Executive Vice President and Chief Financial Officer of Comverge, Inc. (NASDAQ:COMV) on May 31, 2011. Mr. Mathieson served as Senior Vice President and Chief Financial Officer of RSC Holdings Inc. (NYSE:RRR), a leading North American equipment rental company, from January 2008 until May 2010. Mr. Mathieson served as Senior Vice President and Chief Financial Officer of Brady Corporation. (NYSE:BRC) a global leader in identification solutions from December 2003 to December 12, 2007 and joined Brady in 2001 as European Finance Director. Prior to joining Brady, Mr. Mathieson was Vice President and Chief Financial Officer of Honeywell Europe, Middle East and Africa, concluding a 20 year career with Honeywell International, a global technology company, which included positions in Scotland, Belgium, Denmark, England and the USA. Mr. Mathieson has been a director of Tennant Company (NYSE:TNC), a global manufacturer of cleaning equipment and floor coatings solutions, since 2006.  </p>\n\n<p>Mr. Mathieson is a Fellow of the Chartered Management Accountants Institute in the United Kingdom and studied for this qualification at Glasgow College of Commerce and Glasgow Caledonian University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Financial Officer and EVP","firm":{"name":"Comverge","permalink":"comverge","type_of_entity":"company","image":{"available_sizes":[[[150,46],"assets/images/resized/0009/8974/98974v3-max-150x150.jpg"],[[250,76],"assets/images/resized/0009/8974/98974v3-max-250x250.jpg"],[[260,80],"assets/images/resized/0009/8974/98974v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}