{"first_name":"Dave","last_name":"Nemiroff","permalink":"dave-nemiroff","crunchbase_url":"http://www.crunchbase.com/person/dave-nemiroff","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Sep 14 03:55:44 UTC 2012","updated_at":"Fri Sep 14 04:03:22 UTC 2012","overview":"<p>Dave Nemiroff co-led the original design and development of the GFF fuel cell and blue box system.  Dave brings over 25 years of engineering, manufacturing, systems integration, and technology management experience with startups, Fortune 100 firms, public agencies and non-profits in the areas of materials science, aerospace manufacturing, food technology, commercial aquariums, museums and wastewater management systems.</p>\n\n<p>Prior to joining Global Fresh Foods, Dave was VP Technology where he staffed and managed the R&amp;D team of an early stage nano materials science startup and led the transformation of the host university labs into a reliable best-in-class, high-volume commercial facility. Earlier, with his consulting and contracting firm, he designed and built mission-critical industrial controls systems for life support systems for large public aquariums and management and monitoring systems for wastewater facilities. Additionally, working with clients supplying advanced composite materials to Tier 1 aerospace manufacturers, he drove process and quality improvement programs leading to significant cost reductions. Prior to starting his practice, Dave was a program and project manager with Hexcel and led the capital equipment installation, start up and material qualification of their Belgian subsidiary’s facility.</p>","image":null,"degrees":[{"degree_type":"BA","subject":"Physics ","institution":" University of California","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Vice President of Technology","firm":{"name":"Global Fresh Foods","permalink":"global-fresh-foods","type_of_entity":"company","image":{"available_sizes":[[[150,95],"assets/images/resized/0021/1284/211284v1-max-150x150.jpg"],[[206,131],"assets/images/resized/0021/1284/211284v1-max-250x250.jpg"],[[206,131],"assets/images/resized/0021/1284/211284v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}