{"first_name":"Dave","last_name":"Iannone","permalink":"dave-iannone","crunchbase_url":"http://www.crunchbase.com/person/dave-iannone","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Go Forward Media","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Mar 17 04:44:09 UTC 2010","updated_at":"Sun Mar 21 04:30:21 UTC 2010","overview":"<p>President/CEO</p>\n\n<p>Dave is a progressive, dynamic eMedia, B2B publishing, marketing, content management, social networking and public safety veteran. His focus with clients will be overall content and audience strategies, marketing and community growth, business development and operational management.</p>\n\n<p>At Red 7 Media, recently ranked by Inc. Magazine&#8217;s as the nation&#8217;s fastest growing periodical company, Dave led the launch of new career centers, professional networks, publication event sites, and web-based awards programs. This included the rapid growth of FOLIO: Magazine&#8217;s Web site as the dominant online news and information destination for the magazine industry. The company&#8217;s eMedia revenue has doubled in the last year and continues to skyrocket.</p>\n\n<p>Prior to joining Red 7, Dave was Vice President of Interactive at Cygnus Business Media, where he led content, operational, marketing and business development across more than a dozen vertical markets. Major web launches included products in the security, aviation, supply chain and public safety markets. He joined Cygnus in 1998 after founding Firehouse.com, one of the most successful Web portals in B2B publishing.</p>\n\n<p>Firehouse.com has grown to more than 600,000 unqiue visitors monthly. He led the acquisition and integration of the former Fire-EMS.net, and purchase and re-launch of Officer.com, now a top law enforcement online destination.</p>\n\n<p>More than 100 Webcasts were produced, and dozens of blogs and podcasts launched, as well as the company&#8217;s first video center, which included on-site filming and editing from one of the largest trade shows within Cygnus. Working with the publication group, Cygnus&#8217; Aircraft Maintenance Technology group launched one of the most aggressive Webcast-based training programs under Dave&#8217;s watch, the FAA-endorsed IA Renewal Program, which allows technicians to be re-certified annually online.</p>\n\n<p>He was one of MIN Magazine&#8217;s 21 Most Intriguing People in Magazine Media in 2005. His sites have previously been recognized by the American Business Media Jesse H. Neal, American Society of Business Press Editors Azbee and FOLIO: Ozzie awards.</p>\n\n<p>Beyond GFM: When he&#8217;s not at plugging away for clients, Dave loves to check out the latest movies, Washington Wizards basketball, anything Terps, occasional creative writing and online networking. He also serves on the Board of Maryland Media, the non-profit organization which oversees the student publications at the University of Maryland. Dave is a Life Member of the Hyattsville (MD) Volunteer Fire Department and also serves on the Advisory Board of the National Junior Firefighter program. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President/CEO","firm":{"name":"Go Forward Media","permalink":"go-forward-media","type_of_entity":"company","image":{"available_sizes":[[[150,36],"assets/images/resized/0008/1021/81021v2-max-150x150.png"],[[250,60],"assets/images/resized/0008/1021/81021v2-max-250x250.png"],[[404,97],"assets/images/resized/0008/1021/81021v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}