{"first_name":"Dave","last_name":"Dupre","permalink":"dave-dupre","crunchbase_url":"http://www.crunchbase.com/person/dave-dupre","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Boston Technologies","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jan 31 17:33:53 UTC 2011","updated_at":"Fri Feb 04 00:53:29 UTC 2011","overview":"<p>Dave Dupre oversees Boston Technologies Product, Development, Architecture, and Quality Assurance teams and is responsible for the strategic direction, maintenance, quality, and delivery of its FX solutions. With over 20 years of experience, Dupre leverages his strategic leadership, deep technical knowledge and proven track record of both conceptualizing and delivering complex technology to his role as VP of Technology.</p>\n\n<p>Prior to Boston Technologies, Dave Dupre was Chief Technology Officer at Wimba, a leader in online collaboration for education. Before that he was Co-Founder and Chief Technology Officer for Inquisix, a sales referral site. Dave Dupre began his career as a Software Engineer for companies like Itek Optical Systems and Lotus Development but took on increasingly senior leadership roles at technology companies and start-ups Open Market, NaviNet, PaperThin, and Sermo.</p>\n\n<p>Dave Dupre holds a Bachelor of Science in Computer Engineering, as well as a Masters of Science in Computer Science, from Boston University. Three patents and a Smithsonian award nomination distinguish his work.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Chief Technology Officer","firm":{"name":"Boston Technologies","permalink":"boston-technologies","type_of_entity":"company","image":{"available_sizes":[[[150,42],"assets/images/resized/0011/9746/119746v2-max-150x150.png"],[[188,53],"assets/images/resized/0011/9746/119746v2-max-250x250.png"],[[188,53],"assets/images/resized/0011/9746/119746v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}