{"first_name":"Dave","last_name":"Crowder","permalink":"dave-crowder-2","crunchbase_url":"http://www.crunchbase.com/person/dave-crowder-2","homepage_url":"","birthplace":"Pensacola, FL","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1965,"born_month":11,"born_day":30,"tag_list":"","alias_list":null,"created_at":"Wed Aug 10 05:02:27 UTC 2011","updated_at":"Wed Aug 10 20:54:12 UTC 2011","overview":"<p>Dave Crowder is a venture capitalist with almost 20 years of experience working in Silicon Valley. In 2000, he co-founded Thomas Weisel Venture Partners, a $250 million early stage venture capital fund that invested in emerging technology companies. While at TWVP, Dave focused on investments in software and Internet services companies. He led the firm&#8217;s investments in Aligo (acquired by Corrigo), Arbor Networks (acquired by Danaher), Exit41, Medsphere and Pivia (acquired by Swan Labs, then F5). He also was instrumental in sourcing TWVP’s investments in Application Security, BigFix (acquired by IBM), and Control4. </p>\n\n<p>Prior to founding TWVP, Dave was a Founding Partner of Thomas Weisel Partners where he managed several of TWP’s initial investment banking engagements and helped build the Technology Group. Before joining TWP, he was a Senior Managing Director and head of the Software and Internet Group in Investment Banking at Montgomery Securities. While an investment banker, Dave&#8217;s clients included, among others, Hotels.com, InfoSpace, Open Text, Overture Services, Preview Travel (Travelocity), Real Networks, Ticketmaster Online-Citysearch and Yahoo!. Prior to Montgomery, he was an investment banker at Goldman, Sachs &amp; Co.</p>","image":{"available_sizes":[[[100,100],"assets/images/resized/0014/8701/148701v2-max-150x150.jpg"],[[100,100],"assets/images/resized/0014/8701/148701v2-max-250x250.jpg"],[[100,100],"assets/images/resized/0014/8701/148701v2-max-450x450.jpg"]],"attribution":"<p>David Crowder</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/profile/edit?goback=%2Enpe_*1_*1_*1_*1_*1_*1%2Enpe_*1_en*4US_*1_*1_*1_*1%2Enpv1_*1_*1_*1_*1_*1_*1_*1_*1_*1_*1_*1_*1_*1_*1_*1_*1_*1_*1_*1_*1","title":"LinkedIn profile"}]}