{"first_name":"Dave","last_name":"Meeker","permalink":"dave-meeker","crunchbase_url":"http://www.crunchbase.com/person/dave-meeker","homepage_url":"http://www.davemeeker.com","birthplace":"Columbus, Ohio","twitter_username":"dmeeker","blog_url":"http://blog.roundarch.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1973,"born_month":1,"born_day":27,"tag_list":"user-experience, emerging-technology, roundarch","alias_list":null,"created_at":"Fri Apr 30 20:20:03 UTC 2010","updated_at":"Fri Apr 30 21:53:48 UTC 2010","overview":"<p>Dave Meeker has been professionally involved in the strategy, design and development of next-generation creative technology since 1993 and currently serves as the Director of Emerging Technology for Roundarch as well as Co-Director of Roundarch Labs. </p>\n\n<p>Dave advises private equity/venture capital investors on issues related to Web technology and software ventures, including both products and services. Dave is considered an expert in his field, and often speaks on topics related to next-generation technology and consumer-focused innovation at industry events. Dave also serves as a subject matter expert on innovation, technology and user experience design for a variety of media publications. </p>\n\n<p>Prior to his role at Roundarch, Dave was Managing Partner at EffectiveUI, Director of Custom Applications at Whittmanhart, and Director of Information Architecture at Chicago&#8217;s dotCom darling, Web Design Group. Dave got his start in 1995, offering dial-up Internet access and Web design services as part of an early Internet start-up ISP and consulting firm, NewReach Communications. </p>\n\n<p>During his career, Dave has worked for clients in almost every industry, and since 1999 has focused primarily on helping fortune 500 clients redefine their strategic approach to interacting with customers, how they use technology to improve their own processes and products and how design can play a very important role in the inception and execution of change. </p>\n\n<p>Some of the clients that Dave has worked with include Tesla Motors, Motorola, Adobe, Microsoft, Draft FCB, Lockheed Martin, Rockwell Collins, The Chicago Mercantile Exchange, Northern Trust, Harley Davidson, Proctor and Gamble, Abbot Labs, GE, Nike, Red Vines / Sour Punch Candy, The National Football League, Major League Baseball, The State of Ohio, Moen, American Greetings, GoJo Industries, The Ohio Lottery, MBNA, Blockbuster Entertainment, Huizenga Holdings, The Kraft Group, and United Airlines. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.destinationcrm.com/Articles/Editorial/Magazine-Features/CRM-and-the-iPhone-53250.aspx","title":""}],"web_presences":[{"external_url":"http://www.linkedin.com/in/meeker","title":"Linked In"}]}