{"first_name":"Dave","last_name":"Weld","permalink":"dave-weld","crunchbase_url":"http://www.crunchbase.com/person/dave-weld","homepage_url":"http://www.daveweld.com","birthplace":"Lake Forest, IL","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Aug 20 13:22:40 UTC 2012","updated_at":"Thu Aug 23 18:59:09 UTC 2012","overview":"<p>2011 RAMI WINNER FOR BEST BLUES BAND!!</p>\n\n<p>Dave Weld born in Chicago, he was first influenced as a child when he found an old Victrola in the basement and wore out the blues 78&#8217;s. He moved to New Mexico, and studied guitar under Kurt Black, a jazz player who worked with Benny Carter, Grant in the NY jazz scene. Dave also met and jammed with Gatemouth Brown. Weld drawn back to Chicago after hearing Howlin Wolf on the radio and found that he was welcome on the West side of Chicago (black hood). He started sitting in at clubs and landed a gig with Hound Dog Taylor&#8217;s band, Brewer Phillips,Ted Harvey, at Sweet Peas on 43rd St. Philips and Harvey had been working with JB Hutto after Hound Dog&#8217;s death, and came back to Chicago after breaking off with JB in Boston. Weld then moved on to the 1815 Club on W. Roosevelt, which was owned and operated by Eddie Shaw who had Howlin Wolf&#8217;s band, the Wolf Pack. Dave stayed there and played in the band with Chico Chism, Lafayette Gilbert, Hubert Sumlin, Detroit Junior, and Eddie Shaw. Dave played with Otis Rush, Maxwell St. Jimmy, Guitar Junior, Jew Town Burks, Doug Macdonald, Boston Blackie, Tail Dragger, Little Wolf, Big Bad Ben, Little Aurthur, Johnny Littlejohn and more. During this time Weld was under tutelage from JB Hutto, a Grammy awarded Blues Hall of Fame slide man from Georgia. He studied at JB&#8217;s house and met Lil&#8217; Ed, and they started the Blues Imperials&#8221;. Bruce Igauer from Alligator recorded them in a historic session &#8220;Roughousin&#8217;&#8221; and they started world tours. Dave started &#8220;Dave Weld and the Imperial Flames&#8221; in 1988 and they came out with their first CD &#8220;Roughrockin&#8217; in Chicago&#8221;, on Parsifal Records in Belgium, the second time they recorded for Earwig Music, &#8220;Keep on Walkin&#8217;&#8221;, and the band again went overseas. The current band is Abb Locke, legndary sax man, Jeff Taylor, Monica (Garcia) Myhre and Dave Kaye who is now signed with Delmark Records with a new CD &#8220;Burnin Love&#8221;.</p>\n\n<p>Abb Locke is one of the most legendary saxmen of the blues, born in Cottonplant, Arkansas. Picked cotton as a young boy but had a dream to play the sax. He struggled throughout his childhood, living on his own and working his way to fullfill his dream. He came from the cotton fields to Carnegie Hall. This came true when he played with Albert Collins. He has recorded and worked with Buddy Guy (see the Chess box set), Willie Mabon. Earl Hooker, Albert Collins, Koko Taylor, Magic Sam, Eddie Clearwater, Lonnie Brooks, Muddy Waters, Elmore James, Howlin Wolf (three or four years in the band and Abb is featured in Wolf&#8217;s new biography), the Rolling Stones, and many more.</p>\n\n<p>Jeff Taylor (Drums/Vocals)is well known and well respected. Born in 1960 in Chicago, IL. They say he came out singin&#8217;. At 11 he joined the &#8220;Little Angels&#8221; group to sing and after that he sang and played drums for Top Hat, who vouched for Jeff to get him into clubs to work at that young age, and they worked the South and West side of Chicago, and had a standing job at The Sabre Room, where Jeff met and played with Dizzy Gilespie, Cab Caloway, Frank Sinatra, Dean Martin, Count Basie and Tony Bennet. He then freelanced strating with Smilin Bobby, Tyrone Davis, the Dells, the Chilites, Lonnie Brooks, AC Reed, Eddy Clearwater, Artie White, Junior Wells, and more. Jef and Dave do a duo where Jeff sings the bass lines so they can sound like a three piece band. He was with the band for four years then joined the Rythm and Blues Kings for three, then back with Dave for six years.</p>\n\n<p>Monica Garcia (Mona Rose) Musician (piano/harp) songwriter, learned to sing and dance as a child performer in the Hidalgo Club in Rockford, IL from the age of six through her teens, backing up stars from Mexico, and fronting local jazz musicians. Her family training, church chior, led her to numerous bands from Mexican, R&amp;B, Funk, Rock and Blues. She was a member of very active in the Blues community giving. Among the co-founders of the Blues in The Schools program in Rockford, organizing several benefits for musicians and families. She was a vocalist/piano with the group Art Attack, 2001 Rami winner for Funk/R&amp;B. Met Dave Weld in 2002 and formed a friendship which lead to her singing the blues with his band. Co-writing many songs with Dave Weld and became known for her originals, &#8220;Listen to Mama&#8221;, &#8220;Talk Dirty&#8221; or classic blues. Completing the band package with diva blues and harmony.</p>","image":null,"degrees":[{"degree_type":"BA","subject":"Journalism, Music","institution":"New Mexico State University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}