{"first_name":"Dave","last_name":"Carvajal","permalink":"dave-carvajal","crunchbase_url":"http://www.crunchbase.com/person/dave-carvajal","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Dave Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Sep 27 21:02:43 UTC 2010","updated_at":"Mon Aug 29 12:44:12 UTC 2011","overview":"<p>Dave brings a wealth of relevant experience as the CEO / Founder of Dave Partners LLC, the most respected boutique executive search firm in the NYC internet, eCommerce &amp; digital media space.  Having built HotJobs which grew to 650 employees, $125 million in revenues, IPO and then sold to Yahoo! for $436 million as co-founder and then having built The Ladders which grew to 300 Employees and $80 million in revenues, Mr. Carvajal is a sought out advisor on all matters related to Executive Search, Leadership Development &amp; Human Capital.  He is advisor to the top venture capital firms and entrepreneurs of the highest-growth companies in the NYC Internet ecosystem.</p>\n\n<p>Dave has been building leadership teams for high-growth companies for more than 15 years. Most recently he led all the human resource initiatives as Vice President of People at TheLadders.com, where he focused on attracting, retaining and developing TheLadders.com people, as well as managing the company’s relationships with over 40,000 executive recruiters. Prior to TheLadders, Carvajal was SVP &amp; General Manager of HotJob.com’s AgencyExchange, the online marketplace focused on staffing and search professionals. Having joined HotJobs.com as a co-founder in 1997, his initial post was Vice President, Human Resources. Before HotJobs.com, Carvajal was a Senior Executive Search Professional at Otec.com LTD, a New York-based executive search firm.</p>\n\n<p>Dave Carvajal is a graduate of Executive Education and Management programs from The Wharton School, Columbia Business School, and the Harvard Business School. He received a BA in International Trade from Clemson University.  Dave is fluent in French and Spanish and is an avid triathlete.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Dave Partners","permalink":"dave-partners","type_of_entity":"company","image":{"available_sizes":[[[150,114],"assets/images/resized/0010/4824/104824v2-max-150x150.jpg"],[[225,172],"assets/images/resized/0010/4824/104824v2-max-250x250.jpg"],[[225,172],"assets/images/resized/0010/4824/104824v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[{"funding_round":{"round_code":"seed","source_url":"http://techcrunch.com/2011/09/20/numberfire-raising-seed-round-to-build-the-last-fantasy-football-tool-youll-ever-need/","source_description":"NumberFire Raising Seed Round To Build The Last Fantasy Football Tool You’ll Ever Need","raised_amount":null,"raised_currency_code":"USD","funded_year":2011,"funded_month":9,"funded_day":20,"company":{"name":"numberFire","permalink":"numberfire","image":{"available_sizes":[[[119,38],"assets/images/resized/0008/5809/85809v6-max-150x150.jpg"],[[119,38],"assets/images/resized/0008/5809/85809v6-max-250x250.jpg"],[[119,38],"assets/images/resized/0008/5809/85809v6-max-450x450.jpg"]],"attribution":null}}}}],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}