{"first_name":"Dave","last_name":"Robertson","permalink":"dave-robertson-3","crunchbase_url":"http://www.crunchbase.com/person/dave-robertson-3","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jun 17 02:32:33 UTC 2009","updated_at":"Wed Jun 17 02:33:46 UTC 2009","overview":"<p>Dave has almost two decades of experience in networking, computer engineering and strategic product development. Prior to his current role as Vice President of Strategy and Marketing at Vyatta, Dave was the co-founder, CTO, and Vice President of Strategy at Inkra networks where he provided the product and strategy direction that captured a tier-one customer base including IBM, EDS, AT&amp;T, and NEC. Prior to Inkra, Dave was Vice President of Product Management for Nortel Networks, responsible for product strategy and definition related to the company&#8217;s line of Layer 2 and Layer 3 Ethernet switches and campus ATM switches. Additionally, Dave forged key strategic alliances and OEM relationships. Dave has also held management positions at Bay Networks, Rapid City Communications, Cabletron Systems, and ZeitNet, Inc., where he spearheaded Gigabit Ethernet and ATM product lines and strategic marketing initiatives. Dave began his career with engineering positions at Hewlett-Packard. Experienced in numerous networking and software technologies, Dave holds five patents, with more pending, and is the author of three books. Dave holds a B.S. degree in electrical and computer engineering from the University of California, Santa Barbara.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Vice President Strategy and Marketing","firm":{"name":"Vyatta","permalink":"vyatta","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0004/8980/48980v1-max-150x150.png"],[[247,73],"assets/images/resized/0004/8980/48980v1-max-250x250.png"],[[247,73],"assets/images/resized/0004/8980/48980v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}