{"first_name":"Dave","last_name":"Maki","permalink":"dave-maki","crunchbase_url":"http://www.crunchbase.com/person/dave-maki","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jun 03 10:21:36 UTC 2009","updated_at":"Wed Jun 03 10:23:09 UTC 2009","overview":"<p>Dave has been associated with life sciences companies for the past 23 years and has maintained a business relationship with Steve Johnson since 1992. Prior to co-founding Altitude Life Science Ventures, Dave served as a Partner with Perennial Ventures from 2001 until 2003. From 2000 to 2001, Dave served as Vice President of Tredegar Investments where he was responsible for the sourcing and management of investments in early stage life science companies, and where he served on the Board of Directors of the life science companies Xcyte Therapies, Ceptyr, and Advanced Imaging Technologies. From 1998 to 1999, Dave served as a consultant to Tredegar Investments, where he performed due diligence and analysis regarding potential investments and assisted portfolio companies in intellectual property and strategic planning. From 1987 to 1999, Dave served as a Partner at the intellectual property firm of Seed and Berry (now Seed IP Law), where he focused on strategic planning for healthcare companies, particularly in relation to R&amp;D planning, competitive analysis, and corporate collaborations and licensing transactions with large pharmaceutical companies, biotechnology companies and universities. During his 17 year tenure (1983-1999), Dave served as the firm&#8217;s Managing Partner for 3 years and Financial Partner for 5 years. Under his leadership as Senior Partner in the Biotechnology Group, the firm built the client base to represent over 60 healthcare companies. In his career, Dave has served as a Director for a diverse set of life sciences companies and has managed a number of other healthcare investments, including Locus Pharmaceuticals and Elixir Pharmaceutical. Dave currently serves as a Director on the Board of Dharma Therapeutics and the Infectious Disease Research Institute. Dave&#8217;s areas of expertise include intellectual property, technology assessment, competitive analysis and corporate partnering.</p>","image":{"available_sizes":[[[150,101],"assets/images/resized/0004/6468/46468v1-max-150x150.jpg"],[[221,150],"assets/images/resized/0004/6468/46468v1-max-250x250.jpg"],[[221,150],"assets/images/resized/0004/6468/46468v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Altitude Life Science Ventures","permalink":"altitude-life-science-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,20],"assets/images/resized/0004/6467/46467v1-max-150x150.jpg"],[[250,34],"assets/images/resized/0004/6467/46467v1-max-250x250.jpg"],[[450,62],"assets/images/resized/0004/6467/46467v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}