{"first_name":"Dave","last_name":"Liu","permalink":"dave-liu","crunchbase_url":"http://www.crunchbase.com/person/dave-liu","homepage_url":"http://daveliu.com","birthplace":"U.S.A.","twitter_username":null,"blog_url":"http://daveliu.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"digital-media, internet, jefferies, aquantive, yahoo, nokia, cbord, reunion, classmates, friends-reunited, navic, maven, oak-pacific-interactive, frontrange, superdata, oversee, name-media, fastclick, internet-brands, dice, shutterfly, comscore, investmen","alias_list":null,"created_at":"Fri Jan 09 05:35:16 UTC 2009","updated_at":"Sun Jan 11 21:46:51 UTC 2009","overview":"<p>Dave Liu is Co-Head of Digital Media and Internet at Jefferies &amp; Company, Inc. (www.jefferies.com).  He works in the firm&#8217;s Silicon Valley office and covers both U.S. and Asian technology companies and has strong domain knowledge of technology capital markets. Since joining the firm in 1993, Mr. Liu has completed over 50 transactions resulting in an aggregate value of more than $5 billion. With more than 15 years of investment banking, venture capital and technology start-up experience, Mr. Liu has advised on a broad range of transactions ranging from IPOs, follow-on offerings, convertibles, private company sales, tender offers and restructurings. Mr. Liu founded his own software company and has served on the boards of several technology start-ups. He holds an MBA degree from Harvard Business School and two BS degrees from the University of Pennsylvania. </p>\n\n<p>Past clients of his firm include aQuantive, Yahoo, Nokia, CBORD, Reunion, Classmates, Friends Reunited, NAVIC, Maven, Oak Pacific Interactive, FrontRange, Superdata, Oversee, Name Media, Fastclick, Internet Brands, DICE, Shutterfly, comScore, etc.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0003/3485/33485v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0003/3485/33485v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0003/3485/33485v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"Management","institution":"Harvard University","graduated_year":1999,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}