{"first_name":"David","last_name":"Rubinstein","permalink":"david-rubinstein","crunchbase_url":"http://www.crunchbase.com/person/david-rubinstein","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Mar 25 19:30:24 UTC 2008","updated_at":"Mon Jul 14 23:47:56 UTC 2008","overview":"<p>&#8220;In his role as vice president of media sales at ExpoTV, David works to engage brands in the robust consumer conversation taking place amongst the site’s users by overseeing all interactive media, sponsorship and cable video-on-demand sales.</p>\n\n<p>Prior to joining the team at ExpoTV, Rubinstein served as senior category director at Yahoo, where he supervised company engagements with top technology and telecom advertisers such as HP, Dell, and ATT, and identified opportunities to drive category revenue growth. During his time with the company, David released several groundbreaking research studies, which are considered must-reads for executives seeking to understand the impact of online advertising on offline sales. He also met regularly with Fortune 100 advertisers to discuss their online initiatives, competitive landscape, and online success metrics.</p>\n\n<p>Prior to his tenure at Yahoo, Rubinstein developed and executed account strategy for wireless carriers and manufacturers at competitive intelligence firm Current Analysis. He also served as director of product management for Telephia (now Nielsen Mobile).</p>\n\n<p>David has a BA in Political Science from Colgate University and an MBA from the F.W. Olin Graduate School of Business at Babson and is a regular speaker at industry events such as CES and the CEA industry forum.&#8221; (Source: <a href=\"http://www.expotv.com/about/management/bill_hildebolt/bios,3\" title=\"ExpoTV\" rel=\"nofollow\">ExpoTV</a>)</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"SVP Sales","firm":{"name":"EXPO","permalink":"expotv","type_of_entity":"company","image":{"available_sizes":[[[150,85],"assets/images/resized/0001/5461/15461v1-max-150x150.jpg"],[[191,109],"assets/images/resized/0001/5461/15461v1-max-250x250.jpg"],[[191,109],"assets/images/resized/0001/5461/15461v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}