{"first_name":"David","last_name":"Brooks","permalink":"david-brooks-5","crunchbase_url":"http://www.crunchbase.com/person/david-brooks-5","homepage_url":"http://www.doctor.com","birthplace":"NY","twitter_username":"dsbrooks","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 05 19:23:12 UTC 2012","updated_at":"Sat Jun 09 17:20:33 UTC 2012","overview":"<p>David S. Brooks is an entrepreneurial business executive with more than 25 years of corporate communications, marketing, and investor relations experience.  </p>\n\n<p>Brooks is currently Vice President of client services for Health Platforms, Inc. and co-founder of PracticeBrain, Inc., the healthcare software company it acquired in January 2012.<br/>\nBrooks is a partner with Optimal Conversions, Inc., a NY-based web strategy and marketing firm he co-founded in 2009, and owner of SPS Group, a corporate communications consulting firm he founded in 2007.   </p>\n\n<p>Prior to Optimal Conversions and SPS, Brooks was Vice President, Marketing &amp; Sales for DWIN Electronics, a manufacturer of high-definition plasma displays and digital video projectors for home theater.  </p>\n\n<p>Brooks also served as director, investor relations &amp; corporate communications for UNOVA, Inc., (NYSE:IN), a $1B industrial technology company.  During his tenure, Mr. Brooks’ developed an investor relations campaign that helped increase market capitalization by 625% and trading liquidity from 50,000 to 500,000 shares/day.</p>\n\n<p>Earlier in his career, Brooks worked as global marketing communications manager for a division of Warner-Lambert Company, and held senior management positions with public relations agencies for Mobil Chemical, BASF and International Paper.</p>\n\n<p>Brooks graduated from the State University of New York with a Bachelor’s degree in Rhetoric &amp; Communications, and the University of Southern California with an MBA.</p>","image":{"available_sizes":[[[133,150],"assets/images/resized/0019/4057/194057v2-max-150x150.jpg"],[[222,250],"assets/images/resized/0019/4057/194057v2-max-250x250.jpg"],[[230,259],"assets/images/resized/0019/4057/194057v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"Business Administration","institution":"University of Southern California","graduated_year":2000,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}