{"first_name":"David","last_name":"Tabizel","permalink":"david-tabizel","crunchbase_url":"http://www.crunchbase.com/person/david-tabizel","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"VideoJug","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jan 03 10:51:22 UTC 2008","updated_at":"Fri Mar 07 09:07:34 UTC 2008","overview":"<p>David Tabizel is an Internet pioneer, who was the co-founder of a number of successful technology startups such as 365 Corporation (Football 365, Rugby 365 etc), Demon Internet, Autonomy, Rage Software, Durlacher (now Panmure Gordon) and others.</p>\n\n<p>He was also involved in the forming and founding of Metrodome Film in the UK and in Ginger Media&#8217;s purchase of Virgin Radio in the late 1990&#8217;s. He also purchased Laughing Stock, Europe&#8217;s leading comedy record label in the mid 1990&#8217;s.</p>\n\n<p>Tabizel is credited with writing one of the first books on the Internet in 1991 and also wrote an influential work anticipating the Internet boom of the 1990&#8217;s in &#8220;The Internet an Investment Perspective&#8221; (Financial Publications Ltd 1994). He has written books on the video games industry and on artificial intelligence - also published by FP.</p>\n\n<p>Currently he lives and works in Spain, where he founded Videojug (www.videojug.com) which is a large scale publisher and producer of educational videos. As of February 2008, Videojug had produced around 40,000 films and is probably the world&#8217;s largest original producer of digital video content for the Internet, with offices in Spain, London (UK) and Los Angeles (USA).</p>\n\n<p>Videojug was founded with Dan Thompson (Tabizel&#8217;s partner from 365) along with UK broadcast stalwarts Johnny Vaughan, Danny Kelly and Gregor Cameron. The company makes best practice and experience videos, featuring such personalities as Stephen Fry, Roseanne Barr and William Shatner.</p>\n\n<p>He has always maintained a very low profile and when the UK&#8217;s Sunday Telegraph compiled its list of the 25 most influential Internet personalities, Tabizel was the only person not to have a photograph included. Instead the telegraph featured a shadowy outline, commenting that his influence was in opposite proportion to his profile.</p>\n\n<p>Nonetheless in a rare interview in 1995 with the Independent newspaper, Tabizel was directly quoted during an otherwise serious interview about emerging Internet commerce:</p>\n\n<p>&#8220;Mr Tabizel is an accomplished dog imitator. &#8220;I empathise with our hairy friends,&#8221; he says. &#8220;I used to train them and if I see a dog in the park it will come to me.&#8221; He is not barking to impress humans (though it impressed me) but to talk to dogs. And yes, he is a little potty. &#8220;Sometimes if I&#8217;m feeling particularly stressed in the street, I let out a bark.&#8221;</p>\n\n<p>From: The Independent - London Date: August 13, 1995 Author: David Bowen </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"VideoJug","permalink":"videojug","type_of_entity":"company","image":{"available_sizes":[[[150,42],"assets/images/resized/0002/1312/21312v3-max-150x150.jpg"],[[250,71],"assets/images/resized/0002/1312/21312v3-max-250x250.jpg"],[[250,71],"assets/images/resized/0002/1312/21312v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}