{"first_name":"David","last_name":"Sukoff","permalink":"david-sukoff","crunchbase_url":"http://www.crunchbase.com/person/david-sukoff","homepage_url":"http://www.sookbox.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1973,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jul 05 19:39:58 UTC 2012","updated_at":"Thu Jul 05 19:50:46 UTC 2012","overview":"<p>David has been formulating and designing the Sookbox since 2005. In 2011, he founded Sookbox LLC, and serves as the principal. David leads the development and directs the company. </p>\n\n<p>Prior to Sookbox, David served as principal and co-founder of Speedwagon Partners, a real estate development company focused on single family home construction. This has facilitated the genesis and implementation of the Sookbox.</p>\n\n<p>Previous to Speedwagon, David co-founded Precept Asset Management in 2002, and co-managed the fixed income relative value fund. In addition, he assembled and managed a team of professionals, and oversaw the development and implementation of proprietary systems, as well as the operations of the fund and management company. Precept grew its assets from an initial $14mm to a peak of nearly $500mm. Prior to founding Precept, David spent seven years working for fixed income relative value money management firms, designing and implementing systems for risk analysis, fixed income valuation and strategy optimization, as well as developing trading strategies.</p>\n\n<p>David has always had a keen insight into how computer programming fits into our business and personal lives.  In his youth, he was amongst the first to program a database system on his way to leading two teams to National Championships in programming competitions.  In 1995, foreseeing the digital ad market potential, he developed clickable ads using emerging hyperlink technology.  Then in 1997 he turned his focus to search engine optimization, anticipating the dramatic changes that they would have on everyone&#8217;s lives.  By the late 1990&#8217;s, and through the 2000&#8217;s, David focused his programming energies on bringing financial management, and with it derivatives valuation, into the modern era, culminating in the founding of Precept.</p>\n\n<p>David received his B.S. in Finance from the Massachusetts Institute of Technology (MIT), where his studies included a research assistantship with Professor John Cox, programming term structure models for the purpose of pricing swaps and interest-sensitive options. He received the highest numerical score in the core computer programming class at MIT (1.00). </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}