{"first_name":"David","last_name":"Fishman","permalink":"david-fishman-3","crunchbase_url":"http://www.crunchbase.com/person/david-fishman-3","homepage_url":"","birthplace":"Denver, Colorado","twitter_username":"","blog_url":"http://fishspeed.com","blog_feed_url":"","affiliation_name":"CastleWave","born_year":1979,"born_month":2,"born_day":26,"tag_list":"david-fishman, digital-media","alias_list":null,"created_at":"Mon Dec 20 17:54:50 UTC 2010","updated_at":"Thu Mar 03 19:36:00 UTC 2011","overview":"<p>David Fishman has spent his career building digital media companies. He was a co-founder of CastleWave (www.castlewave.com)  where he led sales, business development and strategy. Castlewave was sold to Crexendo, a division of Imergent, Inc. (IIG on Nasdaq) in February 2010. Prior to CastleWave, he was the CEO of uPlayMe, Inc., a Web 2.0 music and social network. Previous to uPlayMe he was a Director at WRP Media, Inc., where he co-founded the New York City office. WRP was the media and interactive arm of the Denver-based Belcaro Group, Inc., who owns ShopAtHome.com. Fishman was responsible for developing strategic business plans for ShopAtHome’s diverse digital media businesses and identifying emerging growth opportunities for the company in the digital realm.</p>\n\n<p>Before assuming his position at WRP, Mr. Fishman was vice president of business development with iLead Media, where he was responsible for developing an international call center and lead generation business. His responsibilities included finding new interactive acquisition opportunities in the domestic arena. iLead was acquired by Think Partnership (labeled THK on Amex).</p>\n\n<p>Prior to joining iLead Media, Fishman was co-founder and vice president of business development for Karizma Media Solutions. Karizma Media was founded in 2000 as an email delivery technology company. Its client list included FingerHut.com, Ask.com and Johnson &amp; Johnson. Karizma’s technology was acquired by J. Scott International, a research firm in Pennsylvania.</p>\n\n<p>Fishman graduated from George Washington University with a BA in philosophy, where he played Division I varsity soccer.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0011/8283/118283v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0011/8283/118283v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0011/8283/118283v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"Philosophy","institution":"The George Washington University","graduated_year":2001,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Co-Founder","firm":{"name":"CastleWave","permalink":"castlewave","type_of_entity":"company","image":null}},{"is_past":true,"title":"Director","firm":{"name":"WRP Media","permalink":"wrp-media","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}