{"first_name":"David","last_name":"H. Gilmour","permalink":"david-h-gilmour","crunchbase_url":"http://www.crunchbase.com/person/david-h-gilmour","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Aug 05 05:10:28 UTC 2011","updated_at":"Fri Aug 05 05:29:23 UTC 2011","overview":"<p>David Gilmour has enjoyed phenomenal success throughout his entrepreneurial career. In 1969, Gilmour and long-time partner Peter Munk founded the South Pacific Hotel Corporation (SPHC), which quickly became the largest hotel chain in the South Pacific. A decade later the chain was sold and the partners formed Barrick Gold Corporation, now the most profitable and largest gold-mining firm in the world. They followed this by forming a real-estate company called Horsham Corporation, which became TrizecHahn, recently one of the largest publicly traded REIT companies in North America. Gilmour is also the founder of FIJI Water LLC, which in 2004 was the fastest growing premium beverage in the United States, when he divested himself of the company. In 1972, on a trip to Fiji to review SPHC operations, Gilmour discovered the 2,200 acre island of Wakaya and purchased it. In 1990, Gilmour and his wife Jill opened The Wakaya Club, an exclusive resort on Wakaya (see www.wakaya.com). The Wakaya Club has become a favorite retreat where people &#8220;who have it all, go to get away from it all.&#8221; The Wakaya Club is a four-time winner of &#8220;Andrew Harper&#8217;s Hideaway Report&#8221; Grand Hideaway Award. In 2006, Gilmour founded a media company, VIV Publishing LLC, whose first product is an entirely new concept in women&#8217;s magazines: a health and lifestyle publication called VIV. With Zinio, Gilmour is pioneering paperless delivery of VIV, breaking new ground in an environmentally responsible, consumer- and advertiser-friendly new medium. David Gilmour was presented with the U.S. State Department&#8217;s 2004 Award for Corporate Excellence (ACE) by Secretary of State Colin Powell in recognition of the international growth and success of FIJI Water together with its philanthropic endeavors in Fiji. Gilmour was also awarded &#8220;The Order of Fiji&#8221; by the president of Fiji, Ratu Sir Kamisese Mara, in 1998, for his commercial and philanthropic achievements in the Fiji Islands.</p>","image":{"available_sizes":[[[125,150],"assets/images/resized/0014/7967/147967v1-max-150x150.jpg"],[[209,250],"assets/images/resized/0014/7967/147967v1-max-250x250.jpg"],[[300,358],"assets/images/resized/0014/7967/147967v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Owner, Executive Chairman","firm":{"name":"Zinio","permalink":"zinio","type_of_entity":"company","image":{"available_sizes":[[[150,69],"assets/images/resized/0001/9313/19313v1-max-150x150.png"],[[170,79],"assets/images/resized/0001/9313/19313v1-max-250x250.png"],[[170,79],"assets/images/resized/0001/9313/19313v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}