{"first_name":"David","last_name":"Safaii","permalink":"david-safaii","crunchbase_url":"http://www.crunchbase.com/person/david-safaii","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 20 20:13:06 UTC 2009","updated_at":"Wed May 20 20:18:25 UTC 2009","overview":"<p>David Safaii is a Principal at Windspeed Ventures, which he joined in January 2004. He assists in the evaluation of emerging trends within technology under consideration by the firm and is involved in all aspects of sourcing, diligence and process. David has been involved in over a dozen investments and works closely with portfolio companies within the areas of corporate development and other various functions.</p>\n\n<p>Prior to joining Windspeed, David was at the Technology Investment Banking Group at CIBC World Markets where he focused on enterprise software. David has completed numerous public and private equity financings, mergers and acquisitions and general financial advisory engagements. Prior to his career in investment banking, David assisted in the development of Lehman Brothers&#8217; Global Equity and Derivative Trading System and spent two years in the Equity and Fixed Income Sales Department of Oppenheimer trading municipal and mortgage-backed securities. His clients included numerous banks, mutual funds, and insurance companies.</p>\n\n<p>David is Chairman Emeritus and Director of Sponsors &amp; Partnerships of the New England Venture Network (NEVN), the largest young venture capital organization on the East Coast. Under NEVN, he co-founded VentureNetwork.VC, the first social network built exclusively for the venture capital community.</p>\n\n<p>David holds a BA in computer information processing from Boston College. He is actively involved with The Crohns and Colitis Foundation of America (CCFA) and is the Co-Chairman of the United Way’s Young Leaders program.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0004/4866/44866v1-max-150x150.jpg"],[[150,226],"assets/images/resized/0004/4866/44866v1-max-250x250.jpg"],[[150,226],"assets/images/resized/0004/4866/44866v1-max-450x450.jpg"]],"attribution":"<p>Windspeed Ventures</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Principal","firm":{"name":"Windspeed Ventures","permalink":"windspeed-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[136,69],"assets/images/resized/0004/4551/44551v2-max-150x150.jpg"],[[136,69],"assets/images/resized/0004/4551/44551v2-max-250x250.jpg"],[[136,69],"assets/images/resized/0004/4551/44551v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}