{"first_name":"David","last_name":"John","permalink":"david-john-2","crunchbase_url":"http://www.crunchbase.com/person/david-john-2","homepage_url":"http://www.jirah.us","birthplace":"Mississauga","twitter_username":"jirahnertworks","blog_url":"http://letuswebdesignprofessional.wordpress.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1984,"born_month":9,"born_day":6,"tag_list":"custom-logo-design, e-commerce-solutions, software-design, graphic-design, cd-cover-design, magazines-design, brochure-design, seo, professional-web-site-design, jirah-networks-inc-jirah-networks-inc-canada","alias_list":null,"created_at":"Tue Apr 03 09:49:53 UTC 2012","updated_at":"Wed Apr 11 21:12:17 UTC 2012","overview":"<p>The Jirah Networks Inc., we are passionate about internet technology that un-caged un witty became a global leader and a basic necessity in every home in the world. Our team members are all controlled technology by individuals of different backgrounds understanding the impact of computer technology and its use in today’s lifestyle.</p>\n\n<p>There are many people in the industry of design and development, performing their jobs every day. We started this business on the core value of quality and not quantity. Our mission is to provide web-based solutions that work in the best interests of consumers and producers. Creation or development of web-based technology has become so cheap on the basis of Franken-food style ideas to attract quick solutions, but do they work? Fast-food can only fill their appetite for a few minutes, but the effects are severe and the benefits are of the wrong sides. Web quality or graphic designs are no different than the difference between organic and fast.</p>\n\n<p>We’ve always believed the internet should be available to any size of company and must be accessible. This view always kept us in the development of cost-effective solutions throughout by cutting a huge marketing and operating costs. Many companies can’t provide high quality due to their running costs. There are always strings attached to low-cost ads appealing to large companies, but at the end of the day consumers end up paying fortunes on behalf of cheap solutions.</p>","image":{"available_sizes":[[[134,58],"assets/images/resized/0018/2374/182374v2-max-150x150.jpg"],[[134,58],"assets/images/resized/0018/2374/182374v2-max-250x250.jpg"],[[134,58],"assets/images/resized/0018/2374/182374v2-max-450x450.jpg"]],"attribution":"<p>Jirah Networks Inc</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.jirah.us","title":"Jirah Networks Inc - "}],"web_presences":[{"external_url":"https://twitter.com/#!/jirahnetwork","title":""}]}