{"first_name":"David","last_name":"Beebe","permalink":"david-beebe","crunchbase_url":"http://www.crunchbase.com/person/david-beebe","homepage_url":"http://www.davidbeebe.com","birthplace":"Arlington, Washington","twitter_username":"davidbeebe","blog_url":"http://www.davidbeebe.com","blog_feed_url":"","affiliation_name":"FishBowl Worldwide Media","born_year":null,"born_month":null,"born_day":null,"tag_list":"digital-video, david-beebe, fishbowl-worldwide-media, disney-abc-television-group, digital-media-executive, digital-programming-development-and-production","alias_list":null,"created_at":"Sun Sep 18 19:19:26 UTC 2011","updated_at":"Tue Sep 18 20:47:21 UTC 2012","overview":"<p>David Beebe is a Digital Entertainment Executive with a successful track record of creating and leading digital media business units responsible for the strategic and creative development, production, programming, and monetization of video content and products that entertain, engage, and influence consumers across multiple platforms. An industry thought leader, who has founded two digital studios and who was recognized by the Academy of Television Arts &amp; Sciences in 2011 for leading the digital video group that produced the Emmy-winning Oscar Digital Experience and in 2008 for Product Managing the Emmy-winning ABC.com Full Episode Player. General Manager and P&amp;L experience leading 40+ person organizations.</p>\n\n<p>Beebe has led digital studios and created content and products for Fishbowl Worldwide Media, Vin Di Bona Productions, Disney/ABC Television Group, DIRECTV, and Showtime.</p>\n\n<p>Currently, Beebe is VP &amp; GM, Digital, at FishBowl Worldwide Media/Vin Di Bona Productions, a next generation studio founded by television producer Vin Di Bona (creator of America’s Funniest Home Videos) and entertainment industry veteran Bruce Gersh. Beebe is responsible for the general management, strategy, development, production, and monetization of all digital content and products. Beebe created and oversees the Petsami brand, the world’s first digital entertainment network for pet and animal lovers available on YouTube and PETSAMI.com. Beebe also created the original series Stunt Nation with Sal Masekela for Yahoo.com, set to premiere July 2012 as well as Telly Award Winning series Ultimate Proposal and Ultimate Surprises with Cameron Mathison, now in its third season on Yahoo.com with over 50 million views. The digital studio includes among its other projects the hit web series, CuteWinFail with Toby Turner, which is ranked in the YouTube Comedy Channel Top 20 with more than 90 million video views. Beebe created and launched the Spanish version of CWF, Lindo Victroia Fracso, with Jose Romero, the #1 YouTuber in Peru. Beebe also oversees all digital properties and products for the hit show, America’s Funniest Home Videos, now its 23 season.</p>\n\n<p>Prior to joining FishBowl Worldwide Media, Beebe was Vice President, Digital Studio – a division he founded – at the Disney-ABC Television Group. Beebe was charged with the general management, creative development, and physical production of all digital programming for Disney-ABC Television Group’s diverse portfolio of broadcast and cable networks, including ABC Entertainment, ABC Daytime, ABC Family, and SOAPnet. During his six years at Disney/ABC, Beebe oversaw development and production of derivative series for Ugly Betty, Scrubs, Cougar Town, and Grey’s Anatomy. He also oversaw development and production of over 100 original series, including Life With Confidence for Extreme Makeover Home Edition, Stars Go Green, and the Emmy nominated Mysteries of the Universe: The Dharma Initiative. Beebe led the digital video production team that produced the groundbreaking and Emmy winning 2011 Oscar Live Experience on Oscar.com for the 83rd Academy Awards. Beebe was also the Project Manager for the industry disrupting and Emmy winning Full Episode player on ABC.com.</p>\n\n<p>Before joining Disney/ABC, Beebe spent seven years at DIRECTV in a variety of broadcast operations, production, and digital positions.</p>\n\n<p>During a multiyear production deal at Showtime Networks, Beebe Executive Produced six documentary style DVD Bonus Features for the hit series Queer as Folk for three seasons.</p>\n\n<p>Beebe started his career in the US Coast Guard as a Communications Specialist, and was responsible for leading radio communication teams during search and rescue and law enforcement operations. He graduated from the USCG Communications School and received an Honorable Discharge with distinguished leadership awards.</p>\n\n<p>Beebe has been a featured speaker and moderator at industry events organized by Silicon Beach Fest, VidCon, TubeFilter, Digital Hollywood, Digital LA, OMMA Video, Streaming Media West &amp; East, International Radio and Television Society, Academy Television Arts &amp; Sciences, and the International Academy of Web Television.</p>\n\n<p>An active member of the community, Beebe has been appointed to several public office positions for the City of West Hollywood, first on the Eastside Project Development Advisory Council and then on the Los Angeles County Vector Control Board. He’s also served as a board member for Christopher Street West, leading the digital media and broadcast efforts of the organization.</p>","image":{"available_sizes":[[[135,150],"assets/images/resized/0016/2147/162147v2-max-150x150.jpg"],[[225,250],"assets/images/resized/0016/2147/162147v2-max-250x250.jpg"],[[270,300],"assets/images/resized/0016/2147/162147v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Vice President & General Manager, Digital","firm":{"name":"FishBowl Worldwide Media","permalink":"fishbowl-worldwide-media","type_of_entity":"company","image":{"available_sizes":[[[150,51],"assets/images/resized/0016/1579/161579v1-max-150x150.jpg"],[[190,65],"assets/images/resized/0016/1579/161579v1-max-250x250.jpg"],[[190,65],"assets/images/resized/0016/1579/161579v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Vice President, Digital Media Studio","firm":{"name":"Disney-ABC Television Groupzssdcss","permalink":"disney-abc-television-group","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/#!/davidbeebe","title":"Twitter"},{"external_url":"http://www.facebook.com/davidraybeebe","title":"Facebook"},{"external_url":"http://www.davidbeebe.com","title":"Blog"}]}