{"first_name":"David","last_name":"Hurowitz","permalink":"david-hurowitz","crunchbase_url":"http://www.crunchbase.com/person/david-hurowitz","homepage_url":"","birthplace":"New Haven, CT","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"www.searchtoppers.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"seo, david-hurowitz, entrepreneur","alias_list":null,"created_at":"Thu Jun 14 20:02:32 UTC 2012","updated_at":"Tue Jun 19 13:52:33 UTC 2012","overview":"<p>Entrepreneur, Dad, Out of the box thinker, One who lives life to it&#8217;s fullest!</p>\n\n<p>David Hurowitz is a classic entrepreneur with a passion for business. He started his first business at the age of 12 and by the age of 14 had six employees under his management. During his freshman year of college in 1984 he created a promotional company that he parlayed into a multi-million dollar business during his four years at college. As the business matured, Hurowitz’s clients included leading brands such as:GAP, Nike, Nabisco, Merrill Lynch, Liz Claiborne, Levi Strauss, Polo, Adidas, Calvin Klein, Timberland, Lee, Tommy Bahamas, Tommy Hilfiger and FILA just to name a few. His vision led operations and grew the business to $44M in sales, which he later sold to an international partner.\nIn 2003 Hurowitz founded Search Toppers, a best in-class SEO (Search Engine Optimization), SEM (Search Engine Marketing) and Mobile Marketing firm. His contagious energy and boundless enthusiasm has not only attracted local clientèle but national brands and international corporations to the firm. Search Toppers client base has grown and Hurowitz continues to pioneer creative initiatives in new media channels such as social media, video and mobile. He initiated the company&#8217;s development in search and continues to champion the companies&#8217; expansion of interactive offerings. Hurowitz is also the primary author of five patents pending in the area of geographic search and mobile marketing.\nHurowitz has a BS in Marketing and BS in Economics from Clark University. He founded the Young Entrepreneur Society at Clark University and received the Silver Hammer Award from the City of Worcester Mass., which acknowledges the premier construction or rehabilitation projects that have an extraordinary visual and aesthetic impact on the physical landscape of the community. Hurowitz most enjoys time with his family and serving his local community.</p>","image":null,"degrees":[{"degree_type":"under graduate","subject":"Econimics","institution":"Clark University","graduated_year":1988,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"www.searchtoppers.com","permalink":"www-searchtoppers-com","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}