{"first_name":"David","last_name":"Levine","permalink":"david-levine-2","crunchbase_url":"http://www.crunchbase.com/person/david-levine-2","homepage_url":"http://www.geostellar.com","birthplace":"Buffalo, NY","twitter_username":"geostella","blog_url":"","blog_feed_url":"","affiliation_name":"Lanworth","born_year":1966,"born_month":1,"born_day":11,"tag_list":"cleantech, geospatial, geostellar, founder, ceo","alias_list":null,"created_at":"Sun Apr 03 01:02:17 UTC 2011","updated_at":"Tue Apr 12 06:06:41 UTC 2011","overview":"<p>David Levine is a career technology executive focused on corporate risk, geospatial analysis, distributed computing and applications in the energy, government, infrastructure, health, entertainment and natural resource sectors. Mr. Levine previously served as Vice President, Business Development for Lanworth, a natural resource intelligence company, Vice President, Geospatial Solutions for the James W. Sewall Company, where he led the operating unit responsible for GIS, enterprise systems engineering and integration, cadastral dataset production and forest cover-type mapping, and Senior Vice President for Imagetree, a LiDAR-based forest inventory platform.</p>\n\n<p>In 2000, Mr. Levine founded Emergent Game Technologies (formerly Butterfly.net) to provide the systems infrastructure for networked games. Mr. Levine focused on bringing Emergent’s platform to the entertainment industry as well as to government markets, where it served homeland security, defense and education efforts. For Emergent, Mr. Levine developed strategic alliances with Cisco, IBM, Intel, MCI and Sony. Previous entrepreneurial endeavors included the creation of Ultraprise Corporation, a provider of the leading business-to-business whole-loan exchange and portfolio risk management platform for the financial services industry. At Ultraprise, Mr. Levine received a patent for the online exchange of whole loan portfolios and created MISMO, the Mortgage Industry Standards and Measures Organization, which remains an active part of the Mortgage Bankers Association.</p>\n\n<p>Mr. Levine started his first technology company, HuskyLabs, as a groundbreaking Internet systems design, development and integration firm in 1992 after developing and deploying Web-based publishing solutions for the World Bank as an analyst for Communications Development, Inc. HuskyLabs served the Coca-Cola Company, Times Mirror Corporation, National Public Radio, the National Aquarium in Baltimore, the Rouse Company and many other corporate and non-profit organizations.</p>\n\n<p>Mr. Levine is recognized as an early Internet leader, participating as a presenter and panelist in landmark events, such as the First International Conference on the World Wide Web at CERN Particle Physics Lab, the first business on the Internet panel at Comdex and lecturing on Java and streaming media at Internet World between 1995 and 1997. He wrote one of the first books on the Java programming language, Live Java: Database to Cyberspace, and was the keynote speaker at the first NASA Java Day in Cape Canaveral.</p>\n\n<p>For the past decade, Mr. Levine has been engaged by a wide variety of organizations for professional development, market strategy and technology innovation services. In February 2005, Mr. Levine was appointed by West Virginia Governor Joe Manchin to establish an office of Technology-based Economic Development within the West Virginia Department of Commerce. He has also served as the Executive Director of the Robert C. Byrd National Technology Transfer Center.</p>\n\n<p>Mr. Levine graduated from Yale University with a degree in Philosophy, was awarded the Rackham Memorial Fellowship in Poetry at the University of Michigan and is currently pursuing graduate studies in education, psychology, leadership and ecology as time permits.</p>\n\n<p>Between 1986 and 1991, David performed as a vocalist, lyricist, guitarist and front-man for the band Senator Flux.</p>","image":{"available_sizes":[[[108,150],"assets/images/resized/0012/9954/129954v2-max-150x150.jpg"],[[180,250],"assets/images/resized/0012/9954/129954v2-max-250x250.jpg"],[[194,269],"assets/images/resized/0012/9954/129954v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.A.","subject":"Philosophy","institution":"Yale University","graduated_year":1988,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder & CEO","firm":{"name":"Geostellar","permalink":"geostellar","type_of_entity":"company","image":{"available_sizes":[[[150,145],"assets/images/resized/0012/9955/129955v2-max-150x150.png"],[[250,241],"assets/images/resized/0012/9955/129955v2-max-250x250.png"],[[450,435],"assets/images/resized/0012/9955/129955v2-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Founder & CEO","firm":{"name":"Emergent Game Technologies","permalink":"emergent","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0003/6480/36480v1-max-150x150.png"],[[227,91],"assets/images/resized/0003/6480/36480v1-max-250x250.png"],[[227,91],"assets/images/resized/0003/6480/36480v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"VP Business Development","firm":{"name":"Lanworth","permalink":"lanworth","type_of_entity":"company","image":null}},{"is_past":true,"title":"VP Geospatial Solutions","firm":{"name":"Sewall","permalink":"sewall","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.wvexecutive.com/node/426","title":""}],"web_presences":[{"external_url":"http://twitter.com/#!/geostella","title":""},{"external_url":"http://www.linkedin.com/in/motodave","title":""}]}