{"first_name":"David","last_name":"Mosk","permalink":"david-mosk","crunchbase_url":"http://www.crunchbase.com/person/david-mosk","homepage_url":"http://www.catch4catch.com","birthplace":"Los Angeles, CA","twitter_username":"catch4catchcom","blog_url":"http://www.catch4catch.com","blog_feed_url":"http://www.catch4catch.com","affiliation_name":"Unaffiliated","born_year":1980,"born_month":1,"born_day":16,"tag_list":"beshert, shidduch, jewish-online-dating, jewish-men, jews, jewish-dating, free-jewish-dating, matchmaker, jewish-singles, catch4catch, catch-4-catch, catch-for-catch, catchforcatch, online-jewish-dating, free-matchmaking, jdate, aish, ish, supertova, jewi","alias_list":null,"created_at":"Sat Aug 21 20:51:01 UTC 2010","updated_at":"Mon Aug 23 19:46:57 UTC 2010","overview":"<p>We have one objective at Catch4Catch.com: </p>\n\n<p>Help bring Jewish singles of all ages, interested in Jewish marriages with their potential beshert of a Jewish man or Jewish woman together to part-take in Jewish dating online. </p>\n\n<p>Let&#8217;s face it, finding that Jewish match (or Jewish Catch!) in this day and age, is no simple feat. We&#8217;ve created an environment where Jewish singles can comfortably find Jewish romance and friendship with other Jewish men and Jewish women. Single Jewish men and single Jewish women need to give Jewish dating online a try using our free Jewish dating websites at Catch4Catch.com!</p>\n\n<p>You will be surprised how fast and easily you can find your beshert or make a Shidduch! You can meet Jewish singles from all over the world at Catch4Catch.com and remember THIS COMMUNITY IS COMPLETELY FREE! </p>\n\n<p>Catch4Catch.com has active Jewish singles: </p>\n\n<p>Jewish singles at Catch4Catch.com are active. That&#8217;s because we delete profiles that have not been in use for an extended period of time. This way you will almost always be sure to get a response from either Jewish men or Jewish women at Catch4Catch.com. Unlike other Jewish internet dating places which have profiles that have not been in use for years, any potential Jewish match featured on our site is an active member. </p>\n\n<p>Catch4Catch.com is a 100% Free Online Dating site for the Jewish Community.  Jewish singles can instant message, e-mail, blog, post music &amp; video, use our FREE mobile version (www.Catch4Catch.com from any mobile device) and much more - ALL FOR FREE!  Join us today!</p>","image":{"available_sizes":[[[150,26],"assets/images/resized/0009/8823/98823v2-max-150x150.jpg"],[[218,39],"assets/images/resized/0009/8823/98823v2-max-250x250.jpg"],[[218,39],"assets/images/resized/0009/8823/98823v2-max-450x450.jpg"]],"attribution":"<p>Catch4Catch.com - Free Online Dating for The Jewish Community</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}