{"first_name":"David","last_name":"Frigstad","permalink":"david-frigstad","crunchbase_url":"http://www.crunchbase.com/person/david-frigstad","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Frost & Sullivan","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Mon Aug 13 23:58:59 UTC 2012","updated_at":"Tue Aug 14 00:03:36 UTC 2012","overview":"<p>David Frigstad serves as the chairman of Frost &amp; Sullivan and is one of the driving forces in its growth, which has consistently outpaced industry averages.</p>\n\n<p>Frost &amp; Sullivan provides research and growth consulting support to Fortune 1000 clients in all global economic centers with its 25 country offices The company provides a full array of research methodologies which include:  Best Practices, Market Engineering, Customer Research, Technical Insights Research, Demographics, Financial Benchmarking, Competitive Benchmarking and Economic Research. All of these research groups work together to support and drive the growth strategy development of the Frost &amp; Sullivan clients.  </p>\n\n<p>David Frigstad and his business partner Wyman Bravard co-founded Market Intelligence Research Company shortly after graduating college. While in college together they developed a vision to create a global consulting organization, which focused on applying research to drive corporate growth. Over the last 25 years they have been totally dedicated on implementing this Vision.  </p>\n\n<p>In 1993 they acquired Frost &amp; Sullivan, which was the dominant player in the emerging market and technology research field. With Frost &amp; Sullivan’s strong brand recognition globally and the expertise at applying the research function to drive corporate growth, they put the new Frost &amp; Sullivan at the top of the list of the fastest growing companies in the consulting industry.</p>\n\n<p>Mr. Frigstad holds a Bachelor of Science degree in MIS and management. He received his master degree in Japanese Business Administration from the Japan American Institute of Management Science in association with Sophia University, Tokyo Japan. He also holds a Masters in Business Administration with a doubleconcentration in International Finance and International Marketing from Indiana University.</p>\n\n<p>The CEO&#8217;s key responsibility is to drive growth - two thirds however are frustrated with their current growth rate and would like to see it accelerated. As the visionary and growth leader in your organization, you must have a comprehensive view of, your industry and markets, global competition, emerging or potentially disruptive technology, economic shifts, customer views, and best practices that you can leverage to grow your organization. </p>","image":{"available_sizes":[[[65,65],"assets/images/resized/0020/5880/205880v1-max-150x150.jpg"],[[65,65],"assets/images/resized/0020/5880/205880v1-max-250x250.jpg"],[[65,65],"assets/images/resized/0020/5880/205880v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"International Finance, International Marketing","institution":"Indiana University","graduated_year":1979,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"Japanese Business Administration","institution":"Japan America Institute of Management Science","graduated_year":1978,"graduated_month":null,"graduated_day":null},{"degree_type":"BS","subject":"Management Information Systems/Business","institution":"Indiana University Bloomington","graduated_year":1977,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chairman","firm":{"name":"Frost & Sullivan","permalink":"frost-sullivan","type_of_entity":"company","image":{"available_sizes":[[[150,18],"assets/images/resized/0020/5878/205878v1-max-150x150.png"],[[250,30],"assets/images/resized/0020/5878/205878v1-max-250x250.png"],[[325,40],"assets/images/resized/0020/5878/205878v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/davidfrigstad","title":"LinkedIn"}]}