{"first_name":"David","last_name":"Kapnick","permalink":"david-kapnick","crunchbase_url":"http://www.crunchbase.com/person/david-kapnick","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Nov 23 16:05:00 UTC 2008","updated_at":"Sun Nov 23 16:09:27 UTC 2008","overview":"<p>Dave joined Newbury in July 2004 and is primarily responsible for all of the firm&#8217;s finance, investor relations and reporting functions. For the previous five years Dave served as Chief Financial Officer of Broadview Capital Partners, a $250 million private equity investment fund focused on later-stage growth equity investments in the IT, communications and digital media industries. Prior to joining BCP, Dave was Chief Financial Officer of C&amp;L Financial, managing the finance and accounting departments for the U.S. operations of a Hong Kong based hotel and real estate organization. Earlier, he was a senior manager with Arthur Andersen, working primarily with start-ups and other closely held companies.</p>\n\n<p>Dave currently serves on the Boards of the Terry Sanford Institute of Public Policy at Duke University, Legal Community Against Violence and VCBC (the leading membership organization for financial professionals at venture capital firms). He also serves as a volunteer Mentor for the Global Social Venture Competition at the Haas School of Business at UC Berkeley.</p>\n\n<p>Dave holds an MBA from the Amos Tuck School at Dartmouth College, an AB degree from Duke University, majoring in management science and psychology, and a California CPA. He enjoys travel, tennis, skiing and other outdoor activities, especially in the Lake Tahoe area. Originally from Chicago, Dave now lives in San Francisco with his wife and has two children in college and beyond. </p>","image":{"available_sizes":[[[110,150],"assets/images/resized/0002/9269/29269v1-max-150x150.jpg"],[[110,150],"assets/images/resized/0002/9269/29269v1-max-250x250.jpg"],[[110,150],"assets/images/resized/0002/9269/29269v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Managing Director and CFO ","firm":{"name":"Newbury Ventures","permalink":"newbury-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,47],"assets/images/resized/0002/9265/29265v1-max-150x150.jpg"],[[250,78],"assets/images/resized/0002/9265/29265v1-max-250x250.jpg"],[[254,80],"assets/images/resized/0002/9265/29265v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}