{"first_name":"David","last_name":"Lisle","permalink":"david-lisle","crunchbase_url":"http://www.crunchbase.com/person/david-lisle","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Credit Coach","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Sep 01 05:20:23 UTC 2010","updated_at":"Mon Oct 04 17:27:20 UTC 2010","overview":"<p>Lisle has been President and CEO of Wausaukee Composites, Inc. since 2002. The ISO 9001:2008 certified company is a premier supplier of highly engineered composite, urethane and structural plastic components to Fortune 500 original-equipment manufacturers, worldwide. Wausaukee Composites is recognized for its product excellence, process innovation, speed to market, and superior customer service in the construction truck, agricultural tractor, wind energy, mass transit, medical imaging, commercial site furnishing, recreation, and environmental industries. Wausaukee Composites has approximately 500 employees at five plant locations in the Midwestern United States.</p>\n\n<p>Prior to joining Wausaukee Composites, Mr. Lisle held executive management positions in business development, strategic planning and financial analysis in the energy industry, including roles as Director – Planning and Financial Analysis at Amoco Production Company; Director of Strategic Planning – International Business Development at Unocal Corporation; and Director – New Ventures at Reliant Energy. Mr Lisle was also a co-founder and Chief Operating Officer of the Oil &amp; Gas Journal Exchange, a successful start-up internet portal site for the energy industry and online oil and gas asset brokerage.</p>\n\n<p>Lisle received a BS degree in Geology from Michigan State University, an MS degree in Geophysics from Louisiana State University where he was an Amoco Fellow, and an MBA from The Darden School at The University of Virginia. Mr. Lisle is a Board Member of Wisconsin Windworks; and the New North, Inc., a regional collaboration effort focused on promoting regional cooperation and economic development in an 18-county region in Northeast Wisconsin; and a former Board Member of the United Way of Brown County; and the Bay Area Workforce Development Board. He is a member of The Executive Committee (TEC) in northeast Wisconsin, and the American Composites Manufacturer’s Association. Dave lives in Green Bay, Wisconsin with his wife Bonnie, and their three children.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Board Member","firm":{"name":"Credit Coach","permalink":"credit-coach-electronic-services","type_of_entity":"company","image":{"available_sizes":[[[150,38],"assets/images/resized/0006/5993/65993v8-max-150x150.jpg"],[[250,63],"assets/images/resized/0006/5993/65993v8-max-250x250.jpg"],[[450,115],"assets/images/resized/0006/5993/65993v8-max-450x450.jpg"]],"attribution":null}}}],"investments":[{"funding_round":{"round_code":"angel","source_url":"http://www.jsonline.com/business/129237308.html","source_description":"Start-up lands angel investment funding","raised_amount":1300000,"raised_currency_code":"USD","funded_year":2011,"funded_month":6,"funded_day":29,"company":{"name":"Aver Informatics","permalink":"aver-informatics","image":{"available_sizes":[[[150,91],"assets/images/resized/0015/3696/153696v2-max-150x150.png"],[[250,152],"assets/images/resized/0015/3696/153696v2-max-250x250.png"],[[450,274],"assets/images/resized/0015/3696/153696v2-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}