{"first_name":"David","last_name":"Honig","permalink":"david-honig-4","crunchbase_url":"http://www.crunchbase.com/person/david-honig-4","homepage_url":"http://www.marketsearchrecruiting.com","birthplace":"New York","twitter_username":"DavidHonig","blog_url":"http://blog.marketsearchrecruiting.com/","blog_feed_url":"http://blog.marketsearchrecruiting.com/","affiliation_name":"Unaffiliated","born_year":1968,"born_month":11,"born_day":29,"tag_list":"","alias_list":null,"created_at":"Wed Dec 08 15:13:51 UTC 2010","updated_at":"Thu Dec 09 07:13:58 UTC 2010","overview":"<p>Insightful Recruiting for Marketing and Advertising Professionals\nAdvertising and marketing folks are a unique breed. We get it. Whatever your type or need, we have experience to help you find your perfect match. On the hunt for the hippest, new, award-hungry shop to call home? In need of that young, competitive type to fill a seat. Heck, if you just want to bring your dog to work, we’ll find something for you, too.</p>\n\n<p>MarketSearch brings qualified marketing and advertising professionals together with companies who are seeking the same. We are trusted by both sides–companies for providing quality candidates and candidates for providing quality professional opportunities–because we have a nationally proven track record of success in the executive marketing and advertising industry.</p>\n\n<p>Just like you, we are focused. At MarketSearch, we do not attempt to be everything to everybody. We are solely dedicated to executive marketing and advertising so that we can meet the needs of our clients and customers better than anyone else. And we have the references and testimonials to back it up.</p>\n\n<p>Looking to fill a seat? We know just your type. Call 1-617-971-0300. Or contact us at www.MarketSearchRecruiting.com</p>","image":{"available_sizes":[[[108,150],"assets/images/resized/0011/3361/113361v2-max-150x150.jpg"],[[181,250],"assets/images/resized/0011/3361/113361v2-max-250x250.jpg"],[[326,450],"assets/images/resized/0011/3361/113361v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/davidhonig","title":""}]}