{"first_name":"David","last_name":"William Baum","permalink":"david-william-baum","crunchbase_url":"http://www.crunchbase.com/person/david-william-baum","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 23 00:50:17 UTC 2009","updated_at":"Tue Jun 23 00:51:35 UTC 2009","overview":"<p>David William Baum is an experienced venture capital general partner with twenty one years in the information technology industry, including twelve years in technology finance and nine years in entrepreneurial operating management roles. </p>\n\n<p>As an operating entrepreneur, David founded two companies including Pensoft Corporation, a venture-backed (Mohr, Davidow Ventures, IVP, and Bay Partners) mobile communications company that was sold to AT&amp;T in 1994. David served as VP of Engineering at Pensoft for over four years. David was a key principal that raised, launched, staffed, and managed Prism Venture Partners, a leading early stage venture capital fund. Founded in 1996, Prism has provided start-up equity to more than eighty-five companies, which have completed four public offerings and twenty five strategic mergers and acquisitions. During his tenure at Prism, the firm grew from zero to over $1.25B under management. Previous investments include Network24 Communications (sold to Akamai), DotBank (sold to Yahoo), Altaworks (sold to Opnet), Integral Access (sold to Telco Systems), Syncra Systems (sold to Retek), Softricity (sold to Microsoft), Salesnet (sold to RightNow) and Bitfone (sold to HP).</p>\n\n<p>After leaving Prism, David founded CCVentures, a stage-agnostic operational consulting business. At CCVentures, David assisted private companies in business plan development, governance issues, financing strategies, and go-to-market campaigns. Investments and clients include: Carbonite, OnePin, Intouch Systems, mVisible, Nimbit, H2Index, Skyhook Wireless and WorldWinner.</p>\n\n<p>In January of 2006, CCVentures merged with Ametron to form Stage 1 Ventures, an early stage venture capital firm. New investments include 800-411-INFO, Mophap, Gaterocket, Cuesol, Magnify Media, and AgileCo.</p>\n\n<p>David holds an MBA from the Harvard Business School with second year honors and BS in Computer Science from Drexel University where he graduated first in his science class.</p>\n\n<p>David’s investment areas of focus are: mobile applications and systems, internet applications, content and gaming, IPTV, virtualization, local merchant search, on-demand enterprise software and data communications equipment. David is a member of the CommonAngels and the MIT Enterprise Forum.</p>","image":{"available_sizes":[[[105,100],"assets/images/resized/0005/0219/50219v1-max-150x150.jpg"],[[105,100],"assets/images/resized/0005/0219/50219v1-max-250x250.jpg"],[[105,100],"assets/images/resized/0005/0219/50219v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Stage 1 Ventures","permalink":"stage-1-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,38],"assets/images/resized/0005/0218/50218v1-max-150x150.jpg"],[[213,54],"assets/images/resized/0005/0218/50218v1-max-250x250.jpg"],[[213,54],"assets/images/resized/0005/0218/50218v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}