{"first_name":"David","last_name":"Boyer","permalink":"david-boyer","crunchbase_url":"http://www.crunchbase.com/person/david-boyer","homepage_url":"http://www.zfere.com","birthplace":"Joplin, MO","twitter_username":"dave_from_zfere","blog_url":"http://www.zfere.info/daveblog/","blog_feed_url":"","affiliation_name":"Zfere","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Oct 04 21:16:58 UTC 2011","updated_at":"Tue Feb 14 08:27:34 UTC 2012","overview":"<p>Dave Boyer  Director of Operations \n(Acting COO)</p>\n\n<p>Mr. Boyer is a co-originator of Zfere&#8217;s basic algorithm along with Mr. Vanderbol as a research associate with OPM Research and Development. He current serves as the company&#8217;s acting Operations Officer and upon a replacement being named for that role will head Zfere&#8217;s Facilities division. He is responsible for building the companys state-of-the-art customer service, and data centers throughout North America.</p>\n\n<p>His construction, development, and management experience spans over 13 years.  As a serial entrepreneur, Mr. Boyer has formed and managed several construction industry businesses, including general construction, finishing, coatings, and inspection services.  This diverse background has afforded him the ability to see the big picture and has given him the ability to find solutions that do not appear to be resident in the company&#8217;s &#8220;tool-box&#8221;.</p>\n\n<p>Mr. Boyer is also an accomplished musician and videographer.  His expertise extends to computer based video/audio recording and editing systems, web broadcast systems, web design, graphic design, and data basing technologies. Often Mr. Boyer is tasked with finding a solution to bridge the gap between the operating sections of the company and this is where his previous professional experience often comes into play in the form of his management practices. Mr. Boyer possesses a passion to research and archive.  He has shown incredible talent in research, and problem solving roles and is responsible for developing Zfere&#8217;s initial social media scope of work and programming requirement necessary for the company&#8217;s initial software development team. </p>\n\n<p>Often, Mr. Boyer acts as the teams chief facilitator. Having started several of his own successful service companies, David knows what it takes to complete the mission. His can do, will do attitude is essential to meeting the company&#8217;s timeline goals. Mr. Boyer often functions as the center post which allows the various different segments of the team to work dynamically while staying targeted on a common completion date.  His direct interaction style has won him the respect of his peers as well as the position he holds within the company at this time.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}