{"first_name":"David","last_name":"Ellner","permalink":"david-ellner","crunchbase_url":"http://www.crunchbase.com/person/david-ellner","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 14 03:08:19 UTC 2009","updated_at":"Wed Jan 14 03:49:05 UTC 2009","overview":"<p>David Ellner is the Executive Vice President for Global Digital Initiatives at Universal Music Group.</p>\n\n<p>In this role, Ellner will further develop UMG&#8217;s digital media business by identifying new digital-related business opportunities, fostering new service and product ventures, overseeing the company&#8217;s portal and Web site activities, and directing new business partner relationships. He also works closely with various UMG labels, and new media efforts worldwide.</p>\n\n<p>Formerly, Mr. Ellner served as Senior Vice President of Operations/Chief Financial Officer of Universal Motown Records Group. Prior to joining Universal, Mr. Ellner served as Vice President of Finance and North America for EMI Music Publishing. He has also held the position of Vice President, Finance &amp; Administration for PolyGram Video and Director of Finance for Mercury Records. Formerly, he served as Controller for Next Plateau Records. Mr. Ellner started his career at Ernst &amp; Young.</p>\n\n<p>As SVP of Operations/CFO of Universal Motown Records Group, Mr. Ellner was responsible for a number of key departments including New Technologies, Finance, Production, Inventory Management, A&amp;R Administration and Marketing Administration. Additionally, he was responsible for coordinating Human Resources and IT functions for the division. As head of New Technologies, Mr. Ellner led digital sales and marketing activities for the division, serving as the company’s point person with such partner companies as iTunes, AOL, Yahoo, Cingular and Sprint.</p>\n\n<p>Mr. Ellner is a graduate of the State University at Albany with a Bachelor of Science and received a Master of Business Administration from New York University. He is currently an Associate Professor of Finance at New York University’s Stern of School of Business. </p>","image":{"available_sizes":[[[117,150],"assets/images/resized/0003/3760/33760v1-max-150x150.jpg"],[[125,159],"assets/images/resized/0003/3760/33760v1-max-250x250.jpg"],[[125,159],"assets/images/resized/0003/3760/33760v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.variety.com/article/VR1117957021.html?categoryid=1043&amp;cs=1\" title=\"Variety\" rel=\"nofollow\">Variety</a></p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}