{"first_name":"David","last_name":"R. Scholl","permalink":"david-r-scholl","crunchbase_url":"http://www.crunchbase.com/person/david-r-scholl","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Diagnostic Hybrids","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 13 10:53:21 UTC 2010","updated_at":"Fri May 11 22:38:23 UTC 2012","overview":"<p>Dr. Scholl, PhD, is  a part-time partner with Athenian Venture Partners in its Healthcare practice since 2000, initially joining the firm as a scientific consultant in 1997. During this period, Dr. Scholl served as CEO of Diagnostic Hybrids (DHI), taking it from start-up to a $138M company before merging it with Quidel Corp (Nasdaq: QDEL) in 2010.  After completing the integrations as an SVP, he retired from Quidel in October 2011. Dr. Scholl is currently transitioning to a more active role at Athenian.</p>\n\n<p>Since 1983, Dr. Scholl was instrumental in driving DHI’s research and development and market adoption of numerous industry-leading commercial products. As DHI’s CEO, since 1997, he built the firm’s manufacturing, sales and business development infrastructure, developed long-term relationships with the company’s key stakeholders, and raised $12.5M in equity growth capital from Summit Partners to accelerate the Company’s growth.</p>\n\n<p>At Athenian, Dr. Scholl has worked on a wide range of Healthcare investment opportunities including biopharmaceuticals, gene delivery technology, genomics, bio-imaging technology tissue engineering, and cancer therapeutics; combined with his experience at DHI, Dr. Scholl has a total of 28 years of Healthcare experience in venture capital, research and development, and operating management.</p>\n\n<p>Dr. Scholl has served professionally on the NCCLS Subcommittee for Antiviral Susceptibility Testing Standards and on the Subcommittee for Virus Culture Standards. Over the past 15 years, he has provided service on numerous Ohio state boards, including as Chairman of BioOhio, as a commissioner on the Ohio Third Frontier Commission, and as a founding board member of the Ohio Business Development Coalition (OBDC) Board. In addition, Dr. Scholl was the recipient of the Central Ohio Ernst and Young Entrepreneur of the Year Award in Healthcare, is a trustee of the Ohio University Foundation, and is president of FIRST, The Foundation for Ichthyosis and Related Skin Types, Inc.™</p>\n\n<p>Dr. Scholl was a Post-Doctoral Research Fellow at the Roche Institute for Molecular Biology, after completing a PhD in Microbiology at Ohio University. He holds an undergraduate degree in Biology from Indiana University.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0018/8269/188269v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0018/8269/188269v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0018/8269/188269v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President & CEO","firm":{"name":"Diagnostic Hybrids","permalink":"diagnostic-hybrids","type_of_entity":"company","image":{"available_sizes":[[[122,77],"assets/images/resized/0007/3172/73172v1-max-150x150.jpg"],[[122,77],"assets/images/resized/0007/3172/73172v1-max-250x250.jpg"],[[122,77],"assets/images/resized/0007/3172/73172v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Partner","firm":{"name":"Athenian Venture Partners","permalink":"athenian-venture-partners","type_of_entity":"company","image":{"available_sizes":[[[150,59],"assets/images/resized/0019/3849/193849v2-max-150x150.jpg"],[[250,98],"assets/images/resized/0019/3849/193849v2-max-250x250.jpg"],[[450,177],"assets/images/resized/0019/3849/193849v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Partner","firm":{"name":"Athenian Venture Partners","permalink":"athenian-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,59],"assets/images/resized/0003/6232/36232v4-max-150x150.jpg"],[[250,98],"assets/images/resized/0003/6232/36232v4-max-250x250.jpg"],[[450,177],"assets/images/resized/0003/6232/36232v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}