{"first_name":"David","last_name":"Soane","permalink":"david-soane-2","crunchbase_url":"http://www.crunchbase.com/person/david-soane-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 04 04:53:22 UTC 2012","updated_at":"Mon Jun 04 04:55:17 UTC 2012","overview":"<p>Dr. David Soane is a co-founder of Phoenix Venture Partners (PVP) and serves as Special Partner with dual responsibilities at Soane Labs, a technology incubator affiliated with PVP. Dr. Soane is a prolific inventor and sereal entrepreneur. He has successfully developed materials science technologies in several industries and has been the founder-CTO or -CEO of twelve Advanced Materials start-ups, including Soane Energy, Crop Enhancement, NanoPaper, Nano-Tex (acquired), ZMS (acquired), Innovative Construction and Building Materials (acquired), 2C Optics (acquired), and ACLARA Biosciences (IPO). Dr. Soane is also the Founder and Chairman of Soane Labs, a technology incubator that develops Advanced Materials innovation for established industries. Previously, Dr. Saone was a tenured professor of Chemical Engineering at the University of California at Berkley for 15 years, where he mentored over 35 graduate students and was the winner of the Henry and Camille Dreyfus Award. Dr. Soane is the author of more than 200 scientific papers, two books, and approximately 100 patents/patent applications. He earned his BS from the National Taiwan University and his MA and PhD from University of California at Berkley. Dr. Soane has served on numerous advisory boards, inlcuding those of the Department of Mechanical Engineering at MIT and the Department of Mechanical Engineering at Tufts University. He is a frequent speaker and lecturer on nanotechnology and chemical engineering and his given keynote adresses at the Forbes Nanotechnology Conference and presented to the Office of Science and Technology at the White House.</p>","image":{"available_sizes":[[[96,87],"assets/images/resized/0019/3716/193716v1-max-150x150.jpg"],[[96,87],"assets/images/resized/0019/3716/193716v1-max-250x250.jpg"],[[96,87],"assets/images/resized/0019/3716/193716v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Special Partner","firm":{"name":"Phoenix Venture Partners","permalink":"phoenix-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,67],"assets/images/resized/0019/3713/193713v1-max-150x150.jpg"],[[250,112],"assets/images/resized/0019/3713/193713v1-max-250x250.jpg"],[[250,112],"assets/images/resized/0019/3713/193713v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}