{"first_name":"David","last_name":"Douglas Stone","permalink":"david-douglas-stone","crunchbase_url":"http://www.crunchbase.com/person/david-douglas-stone","homepage_url":"http://www.cashstar.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"CashStar","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Mar 20 14:51:40 UTC 2009","updated_at":"Tue Dec 01 20:49:37 UTC 2009","overview":"<p>David Douglas Stone has more than 20 years of executive management experience in Fortune 500 and emerging growth technology companies with a strong emphasis on innovative payment systems and loyalty solutions. He has served as a senior executive in several financial services firms, including American Express, where he pioneered the first universal prepaid product, the American Express Gift Cheque, which quickly grew to sales in excess of $300M. Just prior to CashStar, he worked with Intel Capital’s Mobile Commerce team in identifying new applications for mobile and digital couponing. He also assisted Waste Management with the development of the company’s new Web 2.0 venture, Greenopolis, which focuses on incenting and rewarding consumer green behaviors.</p>\n\n<p>While at ERG Group, a leading global smart card technology company, David added $150M in new revenue and played a critical role in ERG’s successful turnaround. He co-founded an innovative sports loyalty company, Sports Loyalty Systems, whose clients included Major League Baseball teams. David also led the creation of Affinnova, a multimillion dollar innovative product development company.</p>\n\n<p>David holds a Masters Degree from the Fletcher School of Law and Diplomacy including graduate studies at MIT and Harvard Business School.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-founder and CEO","firm":{"name":"CashStar","permalink":"cashstar","type_of_entity":"company","image":{"available_sizes":[[[150,37],"assets/images/resized/0003/8771/38771v4-max-150x150.png"],[[241,61],"assets/images/resized/0003/8771/38771v4-max-250x250.png"],[[241,61],"assets/images/resized/0003/8771/38771v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}