{"first_name":"David","last_name":"Chao","permalink":"david-chao","crunchbase_url":"http://www.crunchbase.com/person/david-chao","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"doll capital management","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":"","created_at":"Tue Jun 10 03:12:08 UTC 2008","updated_at":"Wed May 12 22:34:30 UTC 2010","overview":"<p>David Chao, co-founder and general partner of DCM, has been active in the information technology industry since the 1980s, participating in the fastest growing sectors of computers, communication and the Internet. At DCM, he guides portfolio companies in formulating corporate and product marketing strategies, developing strong management teams and implementing domestic and international partnerships.</p>\n\n<p>Prior to DCM, David was a co-founder, acting chief financial officer and chief technical officer, as well as board member of Japan Communications Inc. (JCI) (Nasdaq Japan - Hercules: 9424), Japan’s premier provider of mobile data and voice communications services for corporations and professionals and largest mobile virtual network operator (MVNO).</p>\n\n<p>Previously, David worked as a management consultant at McKinsey &amp; Company in San Francisco. There, he worked with communication and software firms to develop their technology, marketing and financial strategies. David also established a successful practice focused on broadband infrastructure and services and corporate valuation. Earlier in his career, David worked in marketing and product management at Apple Computer, where he co-authored Apple Japan’s successful One Billion Dollar Revenue Plan. Implemented by his team over a four-year period, the plan helped grow revenues from $25 million to $1 billion during that time. David also implemented Japan’s first cash-back rebate program for PC/electronic manufacturers and conceived and managed branding programs — including the Janet Jackson Tour — for Apple. He also managed the company’s portfolio of start-up investments in the United States. Prior to Apple, David was an account executive for Recruit, Japan’s largest HR advertising and web infomediary corporation.</p>\n\n<p>David serves on the Boards of numerous DCM portfolio companies. He is on the Board of 51job (Nasdaq: JOBS) and Spansion (Nasdaq: SPSN). He is also responsible for the investments in All About Japan, Inc. (JASDAQ: 2454), Clearwire (Nasdaq: CLWR), Kabu.com (TSE: 8703), Recourse Technologies (Symantec), Sling Media, SMIC (NYSE: SMI) and eDreams. David serves on the Board of Legend Capital in China and the management board of Stanford Graduate Business School. He has also been listed as a Top 25 venture capitalist by Forbes Magazine since 2004.</p>","image":{"available_sizes":[[[148,148],"assets/images/resized/0003/1785/31785v1-max-150x150.jpg"],[[148,148],"assets/images/resized/0003/1785/31785v1-max-250x250.jpg"],[[148,148],"assets/images/resized/0003/1785/31785v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.dcm.com/team-david-chao-serious.php\" title=\"DCM\" rel=\"nofollow\">DCM</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Co-founder, General Partner","firm":{"name":"DCM","permalink":"dcm","type_of_entity":"financial_org","image":{"available_sizes":[[[150,55],"assets/images/resized/0002/0115/20115v1-max-150x150.png"],[[250,92],"assets/images/resized/0002/0115/20115v1-max-250x250.png"],[[270,100],"assets/images/resized/0002/0115/20115v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Board of Directors","firm":{"name":"Slice","permalink":"project-slice","type_of_entity":"company","image":{"available_sizes":[[[150,73],"assets/images/resized/0013/6588/136588v2-max-150x150.jpg"],[[250,122],"assets/images/resized/0013/6588/136588v2-max-250x250.jpg"],[[450,220],"assets/images/resized/0013/6588/136588v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}