{"first_name":"David","last_name":"Anthony","permalink":"david-anthony","crunchbase_url":"http://www.crunchbase.com/person/david-anthony","homepage_url":"http://21ventures.net","birthplace":"","twitter_username":"davidanthony21","blog_url":"","blog_feed_url":"","affiliation_name":"21Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jun 03 11:42:16 UTC 2009","updated_at":"Fri Jun 12 22:20:24 UTC 2009","overview":"<p>David Anthony is an experienced entrepreneur, venture capitalist, and educator. Since founding 21Ventures in 2003, the fund has provided seed, growth, and bridge capital to over 39 technology ventures across the globe. David Anthony sits on the board of portfolio companies: Agent Video Intelligence, 3GSolar, BioPetroClean and VOIP Logic. David is on the board of directors of publicly traded Entech Solar, there he functions as the chairman of the compensation committee.</p>\n\n<p>David Anthony is an Adjunct Professor at the New York Academy of Sciences (NYAS). The Academy, based in Manhattan brings together scientists of different disciplines from around the world to advance the understanding of science, technology, and medicine, and to stimulate new ways to think about how their research is applied in society and the world. The Academy is widely recognized as one of the world&#8217;s foremost organizers of scientific conferences and symposia. David&#8217;s students at the Academy hail from such prestigious institutions as Columbia, NYU, Princeton, Yale, Rockefeller University, Sloan Kettering, and the Albert Einstein College of Medicine.</p>\n\n<p>In 1995, David Anthony launched Notorious Entertainment, a developer of multimedia brands, which published the internationally distributed magazine, Notorious, and developed an early streaming website. In 1998, he sold the company to entertainment mogul Sean &#8220;P. Diddy&#8221; Combs, and ran the company for two subsequent years. Before Notorious, Mr. Anthony, with Dartmouth College professor Dr. John K. Shank, consulted for Fortune 500 clients on capital investments, mergers and acquisitions, and entrepreneurship.</p>\n\n<p>David received his MBA from The Tuck School of Business at Dartmouth College in 1989 and a BA in economics from George Washington University in 1982. He is an entrepreneurship mentor at the Land Center for Entrepreneurship at Columbia University Graduate School of Business. In 2002, David was awarded the Distinguished Mentor of the Year Award from Columbia University.</p>","image":{"available_sizes":[[[108,108],"assets/images/resized/0004/6475/46475v1-max-150x150.jpg"],[[108,108],"assets/images/resized/0004/6475/46475v1-max-250x250.jpg"],[[108,108],"assets/images/resized/0004/6475/46475v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"","institution":"The Tuck School of Business","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Partner","firm":{"name":"21Ventures","permalink":"21ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,93],"assets/images/resized/0001/9720/19720v1-max-150x150.png"],[[179,111],"assets/images/resized/0001/9720/19720v1-max-250x250.png"],[[179,111],"assets/images/resized/0001/9720/19720v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}