{"first_name":"David","last_name":"Urovsky","permalink":"david-urovsky","crunchbase_url":"http://www.crunchbase.com/person/david-urovsky","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1960,"born_month":10,"born_day":17,"tag_list":"","alias_list":null,"created_at":"Mon Jul 16 06:32:13 UTC 2012","updated_at":"Mon Jul 16 10:03:45 UTC 2012","overview":"<p>David Urovsky is a multi-faceted man. David graduated in 1994 with a Bachelors of Arts degree. He followed that with a Master’s of Science degree in marketing. After graduation, he looked into several different career options before landing on the path of becoming a toy maker.</p>\n\n<p>David’s toys are excellent for children because they: </p>\n\n<p>• Develop hand-eye coordination\n• Develop fine motor coordination\n• Develop basic movements such as crawling and walking\n• Develop social skills\n• Develop imagination</p>\n\n<p>David has used his degrees in marketing and communication to market his toys. He thoroughly understands how to market a product. Now, he is willing to pass that knowledge on to other small business owners. He strongly believes that America’s healing will come from small businesses that thrive and prosper. </p>\n\n<p>Therefore, he is willing to help other small business people with writing articles that will promote their products. He is also willing to help other small businesses write press releases that will get people’s attention. He will teach eager learners how to prosper through the use of social media. </p>\n\n<p>David understands that marketing on the Internet has its own language. David is willing to pass along his knowledge of that language so that other small businesses will prosper. David understands search engine optimization. He will assist other owners with his knowledge. Then the small business will prosper and be able to pass the knowledge onto others.</p>\n\n<p>David Urovsky&#8217;s Tours</p>\n\n<p>David loves to give tours of New York City, his adopted hometown. David’s favorite place in New York City is the Empire State Building. David loves going to the top of the 86th floor and gazing at the view from the observatory. He loves going to the Statue of Liberty. </p>\n\n<p>Since David is a toy maker, he will easily keep children entertained during these excursions. While children often get bored during other tours, on David’s they stay perfectly entertained. That is, because just like with his toys, David understands that everyone relates to the world around them in unique ways. Another of David Urovsky’s favorite locations is the American Museum of Natural History which contains 32,000,000 specimens including David’s favorite the dinosaur skeletons. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}