{"first_name":"David","last_name":"Harper","permalink":"david-harper-2","crunchbase_url":"http://www.crunchbase.com/person/david-harper-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Delivr","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu May 07 16:13:34 UTC 2009","updated_at":"Thu Feb 16 00:20:21 UTC 2012","overview":"<p>David Harper is the founder &amp; CEO of Delivr. Delivr is a leading provider of QR Code &amp; NFC Tag solutions that connect advertisers to consumers by bridging the physical and digital world. Since 2008, Delivr&#8217;s QR Code Management &amp; Tracking Platform has been successfully deployed by thousands of brands, retailers, media companies, ad agencies, and marketers to create and manage measurable mobile barcode campaigns. Headquartered in New York, Delivr receives traffic from over 145 countries around the world every day. The company is privately held. </p>\n\n<p>David Harper also co-founded PercentMobile. PercentMobile is a hosted mobile analytics service that makes your mobile audience and opportunities clear.</p>\n\n<p>David Harper co-founded the New York chapter of Helsinki-based Mobile Monday. Mobile Monday is NY&#8217;s premiere mobile network and authority for the media, financial, and advertising industries. Mobile Monday NY, Inc. is a 501(c)(6) not-for-profit corporation. David is an active member of the Mobile Marketing Associations (MMA).</p>\n\n<p>As founder of Engagelogic Corp – a privately held, NY-based software development and early-stage venture firm – David Harper has more than 20 years experience as an entrepreneur, patent holding inventor, and technologist.</p>\n\n<p>In 2001, David Harper founded Winksite – a mobile content management and social networking software company whose solutions connect publishers to their audiences and audience members to each other.</p>\n\n<p>David Harper has successfully founded several software companies, one of which was sold to an investment bank after growing it from scratch to millions in revenues. During this time he served on the board of the Long Island Advertising Club and his interactive ad agency was a 4As member. David Harper has also been instrumental in capital raises and P&amp;L for companies under management.</p>\n\n<p>David co-authored several chapters in Politics to Go – a handbook on the political uses of mobile technology that anthologizes over 50 of today’s top names in technology and politics. The Politics to Go handbook was published by the Institute for Politics, Democracy &amp; the Internet (IPDI) at The George Washington University’s Graduate School of Political Management. His focus was on the use of mobile technology to reach the 18-34 yr old audience. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Delivr","permalink":"delivr","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0004/3238/43238v4-max-150x150.png"],[[250,76],"assets/images/resized/0004/3238/43238v4-max-250x250.png"],[[312,95],"assets/images/resized/0004/3238/43238v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}