{"first_name":"David","last_name":"Boardman","permalink":"david-boardman","crunchbase_url":"http://www.crunchbase.com/person/david-boardman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Atigeo","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Apr 07 16:51:23 UTC 2009","updated_at":"Sun Apr 12 22:39:26 UTC 2009","overview":"<p>David brings to Atigeo hands on experience in software innovation and a deep understanding of global applications and deployments. He has over 15 years of experience in the technology sector as an entrepreneur and Fortune 100 executive. As the Vice President and General Manager of Atigeo, David leads the development of Atigeo&#8217;s software products and is responsible for business management and marketing of Lifepass.  Prior to Atigeo, David was CEO and founder of Pervasive Services, a provider of Wi-Fi content management service for municipalities and the sports industry. While at Pervasive, he launched the Mobile Media Consortium in 2003, which brought together the New Media Institute and leading industry partners including Intel, McDonalds, BelAir Networks, iAnywhere, Hewlett-Packard, Nokia and Turner Broadcasting to develop ground-breaking research for real-world mobile applications. Before Pervasive, David developed and led Hewlett-Packard&#8217;s software development consulting practice, which specialized in the global deployment of enterprise software for the telecom industry. David serves on the board of advisors of the Wireless Technology Forum. \nDavid holds master’s and bachelor’s degrees in computer science from Purdue University. While at Purdue, David spearheaded ground-breaking research that analyzed software behavior based on acoustic patterns. </p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"General Manager & VP","firm":{"name":"Atigeo","permalink":"atigeo","type_of_entity":"company","image":{"available_sizes":[[[150,40],"assets/images/resized/0004/0486/40486v4-max-150x150.jpg"],[[250,67],"assets/images/resized/0004/0486/40486v4-max-250x250.jpg"],[[300,81],"assets/images/resized/0004/0486/40486v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}