{"first_name":"David","last_name":"Gessel","permalink":"david-gessel","crunchbase_url":"http://www.crunchbase.com/person/david-gessel","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Nov 03 00:46:36 UTC 2009","updated_at":"Tue Nov 03 00:57:31 UTC 2009","overview":"<p>Mr. Gessel joined American Capital in September, 2005 as a vice president in the Operations Team. Previously, Mr. Gessel ran Black Rose Technology, an engineering consulting firm offering design and engineering services including mechanical engineering, thermal design and testing, and industrial design. Mr. Gessel co-founded several ventures including Keyspan Instruments, Inc. to design optical and experimental instruments including a temperature controlled ceilometer under contract to NASA. From 1993-1997, Mr. Gessel was a Senior Researcher and Project Director at Interval Research Corporation where he was responsible for the development of a state-of-the-art rapid prototyping facility, designed and fabricated numerous projects including pen based computers, panoramic cameras, 3D video, ultrasonic arrays, and teleconferencing, and shared responsibility for the operation of the Electric Carnival which demonstrated the wonders of multimedia and the Internet throughout the U.S. and Canada. Prior to his tenure at Interval, Mr. Gessel spent three years as a scientist in Apple Computer&#8217;s Advanced Technology Group where he focused his efforts on digital camera technology, rapid prototyping, pen based computers, and display technologies.</p>\n\n<p>Mr. Gessel holds a BS in Physics with a Concentration in Writing from the Massachusetts Institute of Technology and has been awarded seven US patents and two European patents.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP Product Strategy","firm":{"name":"Tsavo Media","permalink":"tsavo","type_of_entity":"company","image":{"available_sizes":[[[150,77],"assets/images/resized/0002/3889/23889v1-max-150x150.png"],[[250,128],"assets/images/resized/0002/3889/23889v1-max-250x250.png"],[[276,142],"assets/images/resized/0002/3889/23889v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}