{"first_name":"David","last_name":"Wong","permalink":"david-wong-3","crunchbase_url":"http://www.crunchbase.com/person/david-wong-3","homepage_url":"http://btlaw.com/","birthplace":"","twitter_username":"dawwong","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Dec 13 19:36:50 UTC 2009","updated_at":"Mon Dec 14 20:04:10 UTC 2009","overview":"<p>David A. W. Wong is an attorney with Barnes &amp; Thornburg. Mr. Wong’s practice focuses on Internet law, technology, media, intellectual property counseling, risk management, prosecution, policing, and enforcement. He regularly advises clients on commercial and intellectual property issues, such as trademark, copyright, defamation, trade dress, advertising, right of publicity, trade secret, and unfair competition matters.</p>\n\n<p>Mr. Wong advises a range of clients from start-ups to multinational corporations, including Internet businesses, software developers, computer hardware and device manufacturers, toy manufacturers, media and publishing companies, automotive companies, clothing retailers, and financial institutions.</p>\n\n<p>Mr. Wong represents clients such as Automattic, Inc. (WordPress); Bitly, Inc.; Digg, Inc.; Etsy, Inc.; Flock, Inc.; OpenTable, Inc.; Revision3 Corporation; TokBox, Inc.; Tumblr, Inc., and Tweetdeck, Inc in Internet-related matters. He has expertise in matters relating to including international Internet brand protection and licensing; UDRP, ACPA, and foreign domain name proceedings; domain name acquisition and protection; DMCA and copyright enforcement; online service agreements and terms of service; online privacy, security, defamation, technology and content licensing matters; online marketing and advertising issues; and addressing Internet fraud, diversion, phishing, hacking, and online theft. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/davidawwong","title":""}]}