{"first_name":"David","last_name":"Menzies","permalink":"david-menzies","crunchbase_url":"http://www.crunchbase.com/person/david-menzies","homepage_url":"http://gmsinnovate.com","birthplace":"Huntington, NY","twitter_username":"davidmenzies","blog_url":"http://nctechnews.com","blog_feed_url":"http://nctechnews.com/feed/","affiliation_name":"Global Media Strategies","born_year":1967,"born_month":4,"born_day":9,"tag_list":"pr, public-relations, media-relations, writer, marketing","alias_list":null,"created_at":"Thu May 24 10:20:32 UTC 2012","updated_at":"Thu May 24 14:54:43 UTC 2012","overview":"<p>David D. Menzies is an energetic, creative award-winning marketing and PR professional with 20+ years experience developing and managing implementation of successful communications initiatives including promotional programming, media relations and crisis management.</p>\n\n<p>He boasts exceptional written and oral communication skills, especially in life sciences, healthcare and general technology, along with a demonstrated knowledge of current and evolving journalistic principles and practices garnered from professional experience as both a journalist and PR practitioner.</p>\n\n<p>Mr. Menzies&#8217; diverse background includes a wide-range of business development, business management, internal and external relations, and marketing success in engineering, technology, pharmaceutical, corporate, nonprofit, higher education, healthcare and government sectors.</p>\n\n<p>He operates Global Media Strategies, an innovative PR, media relations, and marketing firm specializing in technology and life sciences.</p>\n\n<p>Working out of the technology-rich Research Triangle Park, Global Media Strategies maintains a vibrant portfolio of domestic and international clients across a multitude of industries including:</p>\n\n<p>engineering* biomedical * medical devices * healthcare * cleantech * pharmaceutical * biotech * technology transfer * finance * law * general technology * manufacturing * product design * nonprofit * B2C * retail</p>\n\n<p>Mr. Menzies specializes in helping clients figure out what they are trying to say, who they are trying to say it to, and developing tools and methodologies to deliver that message. In addition to serving individual client needs, he is dedicated to contributing to a vibrant and growing economic environment throughout North Carolina.</p>\n\n<p>A former print newspaper editor and reporter, Mr. Menzies is a contributing author to several regional and national industry publications and is Editor/Publisher of NCTechNews.com. </p>","image":null,"degrees":[{"degree_type":"BA","subject":"Communication","institution":"SUNY Geneseo","graduated_year":1989,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"President","firm":{"name":"Global Media Strategies","permalink":"global-media-strategies","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}