{"first_name":"David","last_name":"P. Rizzo","permalink":"david-p-rizzo","crunchbase_url":"http://www.crunchbase.com/person/david-p-rizzo","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"IDEA Fund Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jun 05 11:56:47 UTC 2009","updated_at":"Fri Aug 03 19:12:21 UTC 2012","overview":"<p>David Rizzo is Managing Partner of IDEA Fund Partners. He also serves as the President and Chief Executive Officer of NC IDEA, a non-profit organization that maintains a strategic partnership with IDEA Fund Partners. David brings more than 25 years of leadership experience in general management, strategic planning, acquisitions and divestitures and corporate finance and investment within technology-based business environments. In addition, David has established a proven track record of entrepreneurial success. He has keen insight and knowledge of interplay among technology, economics and public policy.</p>\n\n<p>David is recognized nationally as a visionary for technology-led economic development. This passion led him to a position as President and CEO of MCNC, a private, non-profit created to be a catalyst for technology-based economic development throughout North Carolina. David strategically realigned the company into three separate organizations - including the creation and leadership of MCNC Ventures. Mr. Rizzo also led the company through a restructuring that resulted in the spin-off of MCNC Research &amp; Development Institute (now NC IDEA).</p>\n\n<p>Prior to joining MCNC, David’s entrepreneurial drive lured him away from a senior executive role at IBM to found Charlotte-based Osprey Systems in 1992, which he later sold in 2002. David positioned the company as one of the nation’s leading e-services companies and a North Carolina technology success. He grew the company to 225 employees with $30 million in annual sales, supported by his investor relations strategy that garnered $24 million in outside capital investments from Morgan Stanley and Bank of America.</p>\n\n<p>David is actively involved in North Carolina’s technology community and has held numerous leadership positions with civic and professional associations. He currently serves on the boards of NC IDEA, the Council for Entrepreneurial Development (CED), STI TechInventures, Affinergy, Strikeiron and Ziptronix. Previously, David served as Chairman of NCTA (North Carolina Technology Association) and on the boards of Chorus Systems, Unitive Technologies, the Kenan Institute’s Center for Entrepreneurship, Intervolve and the Governor’s Board of Science and Technology.</p>\n\n<p>David received a B.A. in Economics from the College of William &amp; Mary. He also studied at the Wharton School&#8217;s Financial Services Institute and The Brookings Institute&#8217;s Public Policy Issues in the Financial Services Industry.</p>","image":null,"degrees":[{"degree_type":"Bachelor's of arts","subject":"Economics","institution":"College of William & Mary","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Partner","firm":{"name":"IDEA Fund Partners","permalink":"idea-fund-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,55],"assets/images/resized/0002/9206/29206v5-max-150x150.png"],[[250,92],"assets/images/resized/0002/9206/29206v5-max-250x250.png"],[[450,166],"assets/images/resized/0002/9206/29206v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}