{"first_name":"David","last_name":"Charpentier","permalink":"david-charpentier","crunchbase_url":"http://www.crunchbase.com/person/david-charpentier","homepage_url":"","birthplace":"Ottawa Ontario","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1990,"born_month":6,"born_day":27,"tag_list":"httpwww-usedottawa-comclassified-adinterior-plant-maintenance-18557549","alias_list":null,"created_at":"Wed Nov 21 04:12:16 UTC 2012","updated_at":"Thu Nov 22 05:11:16 UTC 2012","overview":"<p>I am a graduated of the Horticulture Technician Program at Algonquin College and I have studied tropical plants for indoor settings extensively. I have been caring for the plants in an office building for almost a year and they are doing very well! I am looking to care for commercial and private interiorscape locations malls, office buildings, schools, private residents, hotels. If you are interested in buying plant material for your location I can come and provide consultations on what plant material to purchase and were they&#8217;ll be best suited at the location.</p>\n\n<p>Interior plants create a good climate for workers as well as for guests. Interiorscape plants are also good for interior sceneries and can create an amazing artistic impact.</p>\n\n<p>Services </p>\n\n<p>-Watering \n-Pest management \n-Transplanting \n-Plant maintenance \n-Installation \n-Consultations </p>\n\n<p>My hourly rate will be negotiated after I inspect the site. I except check only I am not setup for online payment.</p>\n\n<p>I am servicing the city of Ottawa only if the location is out of town or on the Quebec side more information will be required. If the contract is installing plant material for the site I will make arrangements for plant material and supplies to be delivered from reparable suppliers. Contact me by either giving me a call 613-415-2415 or send me an email davidcharpentier25@gmail.com ! I have good references and I will gladly make them available to you upon request. If you have any questions please feel free to ask me!</p>\n\n<p>I am a professional reliable individual. I show up to work on time and do my job to the best of my abilities. I realize there are instances where I would be working in a secured building and I would gladly undergo a security check if it&#8217;s required in order for you to hire me! If I were needed to come in at a certain time day or even night to maintain the plants I would gladly do it. </p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0022/1363/221363v2-max-150x150.jpg"],[[187,250],"assets/images/resized/0022/1363/221363v2-max-250x250.jpg"],[[337,450],"assets/images/resized/0022/1363/221363v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}