{"first_name":"David","last_name":"Merel","permalink":"david-merel-2","crunchbase_url":"http://www.crunchbase.com/person/david-merel-2","homepage_url":"http://www.socialpassport.net","birthplace":"","twitter_username":"dmerel","blog_url":"","blog_feed_url":"","affiliation_name":"Social Passport","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu May 05 15:30:24 UTC 2011","updated_at":"Sun May 08 23:02:56 UTC 2011","overview":"<p>David Merel, Founder and CEO, is the founder and CEO of Think Bright LLC a local/long distance telephone company as well as a cutting-edge VOIP carrier.  David started Think Bright LLC in 2005 and continues to manage the company and its employees.  He acts as the company&#8217;s chief architect designing new technologies that have added significant revenues to the company&#8217;s operations.</p>\n\n<p>In 2009, David founded Merel Technologies, LLC, a U.S. based manufacturer of interactive multitouch tables. To date, the tables have been disseminated and used at large events such as the ESPN X-Games, and in small businesses for waiting areas, lobbies, and other areas of high-traffic.</p>\n\n<p>Prior to Think Bright, David was a technology development project manager at Sitaro Group LLC where he leveraged open source technologies for IT projects.  Among other things, David worked with the Ad Council on media delivery solutions.  Previous to that opportunity David was an architect and global project manager for Young &amp; Rubicam.</p>\n\n<p>David Merel earned a Bachelor of Arts triple majoring in philosophy, politics and law from SUNY Binghamton.  David holds a CCNA (a Cisco Certified Network Associate) certificate and is proficient in over 10 languages and databases, various operating systems, VOIP and related protocol, and other business applications.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Social Passport","permalink":"social-passport","type_of_entity":"company","image":{"available_sizes":[[[150,112],"assets/images/resized/0013/3856/133856v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0013/3856/133856v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0013/3856/133856v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}