{"first_name":"David","last_name":"Lieb","permalink":"david-lieb","crunchbase_url":"http://www.crunchbase.com/person/david-lieb","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Bump Technologies","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Jan 10 01:12:35 UTC 2010","updated_at":"Thu Oct 25 06:47:06 UTC 2012","overview":"<p>David is CEO and Co-founder of Bump Technologies, which he created along with Andy Huibers and Jake Mintz in the fall of 2008 while a first-year MBA student at the University of Chicago. In 2009, the company launched the Bump app for iPhone (and shortly thereafter, Android), which lets users physically bump mobile phones together to exchange contact information, photos and more. Bump is one of the most-downloaded apps of all time, with more than 100M downloads.</p>\n\n<p>Bump Technologies released two standalone iPhone apps in 2012: Bump Pay, a peer-to-peer mobile payments app, and Flock, an innovative, contextual photo-sharing app that aggregates the photos you’ve taken while with your Facebook friends into a single group album. Also in 2012, the company released an update to the native Bump app that lets you transfer photos from your phone to your computer by simply tapping the spacebar – it works like magic, and you’ll never need to email photos to yourself again.</p>\n\n<p>Previously, David served as a technologist and algorithm designer at Texas Instruments, where he helped develop digital display devices for projectors and large-screen televisions. Prior to TI, David taught robotic vehicles to see, learn, and drive themselves while a research assistant in the Stanford Artificial Intelligence Lab.</p>\n\n<p>David holds an undergraduate degree in Electrical Engineering from Princeton University, where he also pitched on the baseball team.</p>","image":{"available_sizes":[[[150,139],"assets/images/resized/0010/6480/106480v2-max-150x150.jpg"],[[250,232],"assets/images/resized/0010/6480/106480v2-max-250x250.jpg"],[[450,418],"assets/images/resized/0010/6480/106480v2-max-450x450.jpg"]],"attribution":"<p><a href=\"http://bu.mp\" title=\"Bump Technologies\" rel=\"nofollow\">Bump Technologies</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"co-founder / CEO","firm":{"name":"Bump Technologies","permalink":"bump-technologies","type_of_entity":"company","image":{"available_sizes":[[[150,66],"assets/images/resized/0005/2322/52322v3-max-150x150.png"],[[227,100],"assets/images/resized/0005/2322/52322v3-max-250x250.png"],[[227,100],"assets/images/resized/0005/2322/52322v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}