{"first_name":"David","last_name":"W. Checketts","permalink":"david-w-checketts","crunchbase_url":"http://www.crunchbase.com/person/david-w-checketts","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 28 12:49:51 UTC 2008","updated_at":"Tue Feb 23 19:16:30 UTC 2010","overview":"<p>David W. Checketts founded SCP Worldwide (SCP) in September 2001. One of the most heralded sports, media and entertainment executives currently serves as Chairman of this fast growing company.</p>\n\n<p>Under his direction and leadership, SCP has acquired an impressive stable of assets. In June 2006 the company acquired the St. Louis Blues of the National Hockey League, Scottrade Center and Kiel Opera House in June 2006. In 2004, SCP acquired the twelfth Major League Soccer (MLS) franchise launching Real Salt Lake in Checketts&#8217; hometown of Salt Lake City, Utah. In addition, SCP owns sports-talk radio station KALL 700 AM &#8220;The Zone&#8221;, also in Salt Lake City, has a controlling interest in Running Subway, an entertainment production company, and this year acquired Tupelo-Honey a heralded media production company.</p>\n\n<p>The 52-year-old Mr. Checketts created his sports media company after a successful ten-year career at Madison Square Garden (MSG). As President and Chief Executive Officer for seven years, Mr. Checketts oversaw all operations of one of the most powerful sports and entertainment companies globally, including the &#8220;World&#8217;s Most Famous Arena&#8221; and its three sports franchises, the New York Knickerbockers of the NBA, the New York Rangers of the NHL, and the New York Liberty of the WNBA - along with the award winning MSG Network and FOX Sports Network. In 1997, while at his post, Mr. Checketts took on the ambitious acquisition and comprehensive restoration of New York&#8217;s historic Radio City Music Hall. Although MSG, under his leadership, was awarded with many accomplishments such as being named Arena of the Year for six straight years, the achievement he takes most pride in is the establishment of the MSG &#8220;Cheering for Children&#8221; foundation which created after school programs for thousands of New York City school children.</p>\n\n<p>Mr. Checketts began his career at Madison Square Garden as President of the New York Knicks in March 1991. In the four seasons he served as President, the team finished twice in first place, made it to the Eastern Conference Finals twice and captured the Eastern Conference Champion Title in 1994. During this time, the team set records in attendance, ratings and revenues including setting the all-time sellout streak of 460 games at The Garden. Forbes named the Knicks the most valuable franchise in the NBA.</p>\n\n<p>In his role as Governor of the Knicks (NBA), Rangers (NHL) and Liberty (WNBA), Mr. Checketts was instrumental in all three leagues development and mission. For the NBA, he was part of both the Planning Committee and the Labor Relations Committee which including being a lead negotiator in the Collective Bargaining Agreement (CBA) in 1999. For the WNBA, he was one of the founding partners and served on the League&#8217;s Operating Committee.</p>\n\n<p>Prior to joining the Knicks, Mr. Checketts spent one year as General Manager of NBA International, working with NBA Commissioner David Stern on building a presence for the league in broadcasting and licensing around the world.</p>\n\n<p>In 1983, Mr. Checketts was named President and General Manager of the Utah Jazz. At 28 years old, he became the youngest chief executive in the history of the NBA. During his six year tenure, the team captured two Midwest Division titles and enjoyed a multi-million dollar economic turnaround.</p>\n\n<p>Mr. Checketts did his undergraduate studies at the University of Utah and earned his MBA from Brigham Young University (BYU) in 1981, where he graduated with top honors. Upon completion of his studies, he joined the Boston based consulting firm, Bain &amp; Company.</p>\n\n<p>Mr. Checketts serves on the Board of Directors of JetBlue Airways, International Management Group (IMG) and Republic Mortgage. He plays an active role with each company, serving as the Chairman, Compensation Committee for JetBlue.</p>\n\n<p>He resides in Connecticut with his wife Deb. They have six children and three grandchildren.</p>","image":{"available_sizes":[[[117,150],"assets/images/resized/0002/9952/29952v1-max-150x150.jpg"],[[150,192],"assets/images/resized/0002/9952/29952v1-max-250x250.jpg"],[[150,192],"assets/images/resized/0002/9952/29952v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chairman, SCP Worldwide","firm":{"name":"SCP Worldwide","permalink":"scp-worldwide","type_of_entity":"financial_org","image":{"available_sizes":[[[150,47],"assets/images/resized/0002/9946/29946v1-max-150x150.jpg"],[[250,79],"assets/images/resized/0002/9946/29946v1-max-250x250.jpg"],[[271,86],"assets/images/resized/0002/9946/29946v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.revolutionair.com","title":""}]}