{"first_name":"David","last_name":"DeWalt","permalink":"david-dewalt","crunchbase_url":"http://www.crunchbase.com/person/david-dewalt","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Documentum","born_year":null,"born_month":null,"born_day":null,"tag_list":"cyber-security, david-dewalt, david, dewalt","alias_list":null,"created_at":"Sat Jul 25 16:29:27 UTC 2009","updated_at":"Fri Dec 07 17:46:56 UTC 2012","overview":"<p>David DeWalt is chief executive officer and chairman of the board of FireEye, Inc. DeWalt first joined FireEye as the company&#8217;s board chairman in June 2012, and was later appointed chief executive officer in November 2012. DeWalt has more than 20 years in the technology space, holding a series of leadership positions in some of the industry&#8217;s most innovative and successful companies.</p>\n\n<p>Previous to FireEye, DeWalt served as president and chief executive officer of McAfee, Inc. and led the acquisition of McAfee by Intel for $7.7 billion in 2010. This is Intel’s largest acquisition to date.</p>\n\n<p>Prior to McAfee, DeWalt oversaw customer operations and sales at EMC Corporation. His responsibilities included channels, alliances and partners, product sales, global accounts, vertical programs, and field business operations. DeWalt also led EMC’s content management and archiving software business.</p>\n\n<p>At EMC, DeWalt helped form the EMC Software Group (ESG), which in turn helped transform EMC from a hardware vendor to a complete IT provider. Responsible for a more than $4 billion business, DeWalt was promoted three times, ultimately becoming president of software, sales, and services.\nDeWalt joined EMC in 2003 when EMC acquired Documentum, the global leader in enterprise content management. As president and CEO, DeWalt led Documentum through nine consecutive quarters of growth, five record revenue quarters, and four successful acquisitions before leading the sale of the company to EMC for $1.9 billion.</p>\n\n<p>Prior to joining Documentum, DeWalt was founding principal and vice president of Eventus Software. He also held various executive positions as Quest Software, Segue, and Oracle Corporation.</p>\n\n<p>Over the course of his career DeWalt has helped build companies from startup (Eventus, Quest) to midsize (Documentum, Segue) to some of the largest (Oracle, EMC). A true expert in acquisitions, he led the sale of McAfee, Documentum, and Eventus, has been acquired three times, and has acquired more than 50 companies over the course of his career.</p>\n\n<p>DeWalt was named one of the 25 most influential executives in high technology by the readers of the industry publication CRN. He has spoken at the World Economic Forum on the issue of cyber security and keynoted at several technology industry conferences including Interop and Software 2008 and RSA. DeWalt serves as the chairman of the board of directors for FireEye, Polycom, and Mandiant. He is also on the board of directors of Delta Airlines, Jive Software, Five9, and Dassault Systems Enovia. He is a member of the World Economic Forum IT and telecom industry board of governors. In May 2011 he was appointed by President Barack Obama to the National Security Telecommunications Advisory Council (NSTAC). </p>\n\n<p>As a recognized expert on mergers and acquisitions, DeWalt is the author of “Making M&amp;A Work.” He’s a frequent guest on international business programs, and appears regularly on Bloomberg TV, CNBC, CNN and Fox Business.</p>\n\n<p>DeWalt received his Bachelors of Science in computer science and electrical engineering from the University of Delaware. At the University of Delaware, he won a school record three East Coast Conference titles, advanced to the NCAA championships three times, and was the first wrestler to be inducted into the Delaware Athletics Hall of Fame.</p>","image":{"available_sizes":[[[111,150],"assets/images/resized/0005/4281/54281v1-max-150x150.jpg"],[[148,200],"assets/images/resized/0005/4281/54281v1-max-250x250.jpg"],[[148,200],"assets/images/resized/0005/4281/54281v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.S.","subject":"Computer Science","institution":"University of Delaware","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chief Executive Officer and Chairman of the Board","firm":{"name":"FireEye","permalink":"fireeye","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0003/2089/32089v12-max-150x150.jpg"],[[250,81],"assets/images/resized/0003/2089/32089v12-max-250x250.jpg"],[[362,118],"assets/images/resized/0003/2089/32089v12-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"President and CEO","firm":{"name":"Documentum","permalink":"documentum","type_of_entity":"company","image":null}},{"is_past":true,"title":"Chief Executive Officer and President","firm":{"name":"McAfee","permalink":"mcafee","type_of_entity":"company","image":null}}],"investments":[],"milestones":[{"description":"Joined FireEye as Chief Executive Officer","stoned_year":2012,"stoned_month":11,"stoned_day":28,"source_url":"http://www.fireeye.com/news-events/press-releases/read/fireeye-appoints-david-dewalt-chief-executive-officer","source_text":null,"source_description":"FireEye Appoints Board Chairman David DeWalt as Chief Executive Officer","stoneable_type":"Person","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"first_name":"David","last_name":"DeWalt","permalink":"david-dewalt"}}],"video_embeds":[{"embed_code":"<iframe width=\"430\" height=\"242\" src=\"http://www.youtube.com/embed/1ZCHfGE5-cg\" frameborder=\"0\" allowfullscreen></iframe>","description":"<p>A Conversation with David DeWalt - FireEye Chairman of the Board</p>"}],"external_links":[],"web_presences":[]}