{"first_name":"David","last_name":"Sokolic","permalink":"david-sokolic","crunchbase_url":"http://www.crunchbase.com/person/david-sokolic","homepage_url":"http://www.battery.com/people/sokolic.html","birthplace":"Philadelphia USA","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1967,"born_month":8,"born_day":21,"tag_list":"investor-vc","alias_list":null,"created_at":"Thu Mar 31 17:02:27 UTC 2011","updated_at":"Wed Apr 06 18:12:46 UTC 2011","overview":"<p>David joined Battery in 2007 and focuses on Israeli investments. He currently works with Pursway. Prior to Battery, he was the Group Program Manager for Mobility in the Office Communications Group (OCG) at Microsoft and was responsible for driving product strategy and delivering solutions for the mobile components of Microsoft’s Unified Communications products. David also worked in Microsoft’s Mobile and Embedded Devices division on Mobile Information Worker solutions, and was an early contributor to the OCG team’s initial products. </p>\n\n<p>Previously, David was VP of Marketing for the Networking Business Unit at RADVISION, a leading vendor of networking products for voice, video and data conferencing. Before RADVISION, he served as VP of Marketing for Gizmoz, a startup that developed and marketed an innovative solution using IM for viral marketing and media distribution. Prior to that, David was a Product Manager and Marketing Director at VocalTec Communications, a pioneer of the Voice-over-IP market. Before entering the industry, he worked for six years as a strategy consultant, first with Braxton Associates, Deloitte and Touche’s strategy consulting arm, and then with HK Catalyst, a boutique firm focused on telecoms and technology companies. David graduated with honors from the Wharton School of Business at the University of Pennsylvania. </p>","image":{"available_sizes":[[[111,150],"assets/images/resized/0012/8631/128631v2-max-150x150.jpg"],[[111,150],"assets/images/resized/0012/8631/128631v2-max-250x250.jpg"],[[111,150],"assets/images/resized/0012/8631/128631v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}