{"first_name":"David","last_name":"Dodson","permalink":"david-dodson","crunchbase_url":"http://www.crunchbase.com/person/david-dodson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Oct 26 03:23:25 UTC 2012","updated_at":"Fri Oct 26 03:25:59 UTC 2012","overview":"<p>In addition to his duties as Chief Investment Officer, Mr.  David Dodson created and is responsible for SPWM&#8217;s proprietary research process. Mr. Dodson also leads the investment committees of Salem Partners Wealth Management and SW Contego Fund, LLC, a fund of hedge funds established by Salem Partners Wealth Management in 2008.  Mr. Dodson joined Salem after serving as Vice President and Portfolio Manager for Essential Advisers, Inc., a wealth management firm in Denver serving ultra affluent investors.  While at Essential, Mr. Dodson was responsible for the design, implementation and management of Essential&#8217;s client portfolios, deploying a wealth of investment and analytical skills for the benefit of clients.  Additionally, Mr. Dodson designed and managed Essential&#8217;s disciplined Large Cap Growth stock portfolio and played an integral role in serving clients.  Before joining Essential Advisers, David was Director of Investment Planning for a billion dollar investment management firm in Overland Park, Kansas.  Mr. Dodson holds a Masters of Science in Finance degree from the University of Denver and a Bachelor of Science in Business Administration from the University of Kansas, is a Chartered Financial Analyst Charterholder, a Certified Financial Planner® Certificant and a member of the Denver Society of Securities Analysts.</p>","image":{"available_sizes":[[[119,150],"assets/images/resized/0021/7320/217320v1-max-150x150.jpg"],[[120,151],"assets/images/resized/0021/7320/217320v1-max-250x250.jpg"],[[120,151],"assets/images/resized/0021/7320/217320v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Investment Officer","firm":{"name":"Salem Partners","permalink":"salem-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,24],"assets/images/resized/0021/7318/217318v1-max-150x150.jpg"],[[250,40],"assets/images/resized/0021/7318/217318v1-max-250x250.jpg"],[[337,55],"assets/images/resized/0021/7318/217318v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}