{"first_name":"David","last_name":"Steinberg","permalink":"david-steinberg","crunchbase_url":"http://www.crunchbase.com/person/david-steinberg","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 10 22:01:24 UTC 2008","updated_at":"Tue Jul 21 20:27:15 UTC 2009","overview":"<p>David Steinberg, CEO, brings more than twenty years of sales, operations and technical experience in the data communications industry to SwapDrive.</p>\n\n<p>Mr. Steinberg founded bridge2bridge, where he helped companies at all stages with strategy in the areas of business development, channels, and capital formation. Prior to founding bridge2bridge, Steinberg was Vice President of BioNetrix Software where he was responsible for market development through sales and business development world-wide. Mr. Steinberg has been responsible for worldwide vertical sales including OEM, ISP, Distribution and U.S. federal market sales, channel development and support at Check Point Software, Bay Networks and SynOptics, At Check Point, he was responsible for Check Point&#8217;s industry-leading FireWall-1 enterprise security software and Network Management Systems government market.</p>\n\n<p>Steinberg was a founding member of SynOptics and was instrumental in establishing the company&#8217;s Eastern operations. Before joining SynOptics, Steinberg was the regional manager for the U.S. Eastern operation at Industrial Networking, Inc., a start up venture and subsidiary of Ungermann-Bass and General Electric. Mr. Steinberg is an advisor with ASAP Ventures, an early-stage internet business accelerator company and sits on several corporate and non-profit boards&#8217; of directors. Mr. Steinberg has been featured in various publications including The Washington Post, Potomac Tech Journal and Washington Techway Magazine.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"SwapDrive","permalink":"swapdrive","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0002/0220/20220v1-max-150x150.png"],[[175,62],"assets/images/resized/0002/0220/20220v1-max-250x250.png"],[[175,62],"assets/images/resized/0002/0220/20220v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}