{"first_name":"David","last_name":"Molina","permalink":"david-molina-2","crunchbase_url":"http://www.crunchbase.com/person/david-molina-2","homepage_url":"http://bilingualhireco.com","birthplace":"Hood River, OR","twitter_username":"davidcmolina","blog_url":"http://twitter.com/davidcmolina","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"bilingualhire, portland, oregon","alias_list":null,"created_at":"Thu Sep 09 07:15:14 UTC 2010","updated_at":"Mon Sep 13 22:35:17 UTC 2010","overview":"<p>David Molina (born Feb. 8, 1979 in Hood River, Oregon) is a social entrepreneur with community activism, military, political/legislative, non-profit experience and is the founder of BilingualHire, a blog covering career advancement opportunities for bilingual talent.</p>\n\n<p>The son of Mexican immigrants and migrant farm workers who left the State of Nayarit, Mexico in pursuit of the American dream, Molina attended public education throughout and in his youth worked in the fields, picked apples, forklifted in canaries, harvested oysters, and organized farmworkers and students. A former high school drop-out, Molina was the first to graduate high school, apply and earn his college degree, founding MEChA at Skagit Valley College and actively engaged in Sigma Nu, ROTC, MEChA, Kalmekak, Centro and student-government activities at Oregon State University (OSU). Post-Corvallis, he began his career in the non-profit sector at the Susannah Maria Gurule (SMG) Foundation working to close health care disparities in the Latina/o community organizing conferences, summits, educating youth/parents, and raising capital funds to sustain/expand programs. At 26, he and Oregon State alumni founded RED Consulting Group, a bilingual recruitment and consulting firm where he led recruitment and consulting/training assignments for dozens of academic institutions, non-profits, clinics, and small businesses. In pursuit of his passion to find ways to make it easier for bilingual talent to find career advancement opportunities, he morphed RED into BilingualHire, a Portland-based web start-up.</p>\n\n<p>A military veteran, Molina proudly enlisted in the U.S. Army Reserves at the rank of Private First Class and served at the 364th Civil Affairs Brigade (Airborne). In 2004, after receiving his Political Science degree Molina was Commissioned a Second Lieutenant in Infantry through OSU Army ROTC. He served in a variety of company level staff positions in the 104th Division (IT) before being appointed to serve as the Aide-de-Camp to Army Brigadier General Eldon Regua, Assistant Division Commander-Operations, and most recently served an eighteen month deployment in support of Operation Iraqi/Enduring Freedom to the Joint Personal Effects Depot, the nation&#8217;s only post-9/11 operation preserving the memories of America&#8217;s fallen and wounded service members. During the 2009 Oregon Legislative session, Molina served as Committee Administrator of the House Committee on Veterans’ &amp; Emergency Services providing policy, communication and liaison support with members, general public, Veterans&#8217; groups and government agency leaders.</p>\n\n<p>An advocate for the disenfranchised and underserved, Molina selflessly volunteers his time on a variety of community boards and commissions including the Oregon Commission on Hispanic Affairs (governor-appointed), OSU President’s Board of Visitors (president-appointed), and OSU Chicano/Latino Alumni Group (co-founder). Molina lives in Portland, Oregon with his wife, Edith Molina, and their daughters, Maya, Paloma &amp; Citlali. </p>","image":null,"degrees":[{"degree_type":"B.A.","subject":"Political Science","institution":"Oregon State University","graduated_year":2004,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/davidcmolina","title":"Twitter"},{"external_url":"http://www.linkedin.com/in/davidcmolina","title":"LinkedIn"},{"external_url":"http://www.flickr.com/photos/davidcmolina/m","title":"Flickr"},{"external_url":"http://molina.posterous.com/","title":"Posterous"},{"external_url":"http://www.facebook.com/david.molina1","title":"Facebook"}]}