{"first_name":"David","last_name":"Gedye","permalink":"david-gedye","crunchbase_url":"http://www.crunchbase.com/person/david-gedye","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Microsoft","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Aug 21 03:55:23 UTC 2008","updated_at":"Thu Aug 21 03:55:23 UTC 2008","overview":"<p>David Gedye manages the Photosynth project at Microsoft Live Labs, and has done so since its inception in 2006.</p>\n\n<p>Gedye came to Live Labs in 2006 through the Seadragon Software acquisition, where he was vice president of products. Seadragon is the zooming technology for browsing large collections of visual information, without regard to the image size or number of objects, that underlies Photosynth, and which shipped as the Deep Zoom feature of Microsoft Silverlight 2.</p>\n\n<p>Before Seadragon, Gedye had wide experience leading software product teams in large companies (Sun Microsystems Inc. and another stint at Microsoft), and building and founding small companies. He was director of advanced development at Starwave Technologies Inc., one of the earliest Internet content companies, and founding vice president of engineering for Apex Learning Inc., an online high-school solution provider.</p>\n\n<p>Gedye is probably best known as the original founder of the SETI@home project. He developed the idea and put the key scientists and distributed systems people together. At its height SETI@home involved more than 5 million people, whose combined machines provided more than 2 million years worth of computing time looking for faint signs of other intelligent life in the universe.</p>\n\n<p>He has a bachelor of science from the University of Sydney and an master of science in computer science from University of California, Berkeley.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Manager, Photosynth Project","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}