{"first_name":"David","last_name":"Sherbow","permalink":"david-sherbow","crunchbase_url":"http://www.crunchbase.com/person/david-sherbow","homepage_url":"http://www.livemusicmachine.com","birthplace":"Baltimore, MD ","twitter_username":"MusicBizGuy","blog_url":"http://www.musicbizguy.com","blog_feed_url":"","affiliation_name":"LiveMusicMachine.Com","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jul 17 11:01:38 UTC 2009","updated_at":"Fri Jul 17 19:14:47 UTC 2009","overview":"<p>David Sherbow is a visionary in the new music business with a clear understanding of where the record and radio businesses came from, why their current business models are failing, where the new music business needs to go in the digital age &#8211; and the passion to take it there.</p>\n\n<p>Over the last 3 years, David has spent much of the music business expertise and collateral he has amassed to develop technologies and strategies for music discovery, breaking new artists on the Internet, and monetizing the independent music artist community.  Launching in August, 2009, will be his first fully developed product, LiveMusicMachine.Com, a ground-breaking artist booking utility, that can be used from virtually anywhere on the Internet. </p>\n\n<p>David&#8217;s perspective in the rock, pop, R&amp;B and hip-hop music business comes from a deep-seated devotion to the music industry and over forty years of experience with artists and their music. </p>\n\n<p>Watching thousands of concerts from Elvis to Otis, from James Brown to the Rolling Stones and from U2 to Jay-Z, David&#8217;s has lived and breathed America’s popular music scene and culture.  As a young law student, he interviewed and published articles about numerous great rock and R&amp;B artists.  Before graduating, he taught a college-level course on the history of rock and roll. </p>\n\n<p>For the past 14 years, David has been a major cog in the hip-hop hit-making machinery where his independent record promotion companies have broken over 100 No. 1 records nationally.  In addition to acting as the exclusive independent for Def Jam (1995-2004) and E1/Koch Entertainment (2004-2009), where he was responsible for helping to break major artists such as Jay-Z, Ludacris, DMX, Ja Rule, Ashanti, Kanye West, Foxy Brown, Dru Hill, Jim Jones, DJ Khaled, Yung Berg, Sean Kingston, Unk, Dorrough and Ray J, David&#8217;s companies, working for other major labels, have also impacted the careers of iconic artists like Missy Elliott, Janet Jackson, Mariah Carey, T.I., Outkast and Pharrell.  </p>\n\n<p>In his 35 year music business career, David has managed and booked major regional and national rock, R &amp; B, gospel and hip-hop artists, owned and operated a rock-n-roll booking agency, put out over 25 independent releases, made record deals and was head of promotion for WMG&#8217;s Asylum Records (2004). </p>\n\n<p>David writes a regular blog, www.MusicBizGuy.com and has attracted over 1300 followers on Twitter as MusicBizGuy in only 7 months.  Recently, David and his business partner, Cara Peckens, authored a whitepaper entitled, &#8220;MySpace’s Key to Victory: Monetizing the MySpace Independent Music Community&#8221;, which is soon to be published.  </p>","image":{"available_sizes":[[[116,150],"assets/images/resized/0005/3265/53265v2-max-150x150.jpg"],[[193,250],"assets/images/resized/0005/3265/53265v2-max-250x250.jpg"],[[348,450],"assets/images/resized/0005/3265/53265v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO/Founder","firm":{"name":"LiveMusicMachine.Com","permalink":"livemusicmachine-com","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}