{"first_name":"David","last_name":"Jargiello","permalink":"david-jargiello","crunchbase_url":"http://www.crunchbase.com/person/david-jargiello","homepage_url":"http://www.flywheelventures.com","birthplace":"","twitter_username":"davidjargiello","blog_url":"http://www.jargiello.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Aug 11 21:03:08 UTC 2012","updated_at":"Tue Aug 28 08:10:32 UTC 2012","overview":"<p>David Jargiello is the General Counsel and a Venture Partner at Flywheel Ventures, a seed and early-stage venture capital firm focused on information technology and physical sciences ventures. </p>\n\n<p>David is active in structuring and executing Flywheel’s global investment activities, and helps guide its portfolio companies in various transactional and business matters. He is also involved in managing Flywheel’s offices and operations, including fund structuring and administration, partnership matters and risk management. </p>\n\n<p>David joined Flywheel after over 20 years of legal practice, beginning in 1989 in Craig Johnson’s emerging companies group at Wilson Sonsini Goodrich &amp; Rosati. In 1993, he was one of the original 14 lawyers who founded Venture Law Group, a leading Silicon Valley law firm that grew to over 120 lawyers in four offices in major technology markets. As a VLG shareholder (partner), he was also that firm’s General Counsel and part of the management team responsible for the oversight and management of its business and professional matters. When VLG merged with Heller Ehrman in 2003, David became a shareholder in the combined firm’s Corporate/VLG Practice Group. He was a member of Heller Ehrman’s management committee until re-joining Johnson in 2008 to create Virtual Law Partners – the first wholly “virtual” law office of national reach. </p>\n\n<p>Among the most experienced law firm general counsel in the country, he writes, speaks and consults frequently on the spectrum of professional and business matters that confront lawyers and law firms. Independent of Flywheel and leveraging his core business and transactional expertise, he maintains a sophisticated law firm management practice representing individual lawyers, law firms, and LPLI brokers and underwriters around the world.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0020/5616/205616v2-max-150x150.jpg"],[[125,175],"assets/images/resized/0020/5616/205616v2-max-250x250.jpg"],[[125,175],"assets/images/resized/0020/5616/205616v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}