{"first_name":"David","last_name":"Hahn","permalink":"david-hahn","crunchbase_url":"http://www.crunchbase.com/person/david-hahn","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"AdSafe Media","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed May 18 21:18:40 UTC 2011","updated_at":"Mon Sep 12 02:31:02 UTC 2011","overview":"<p>David has worked with a number of startups and mature technology organizations and has over 12 years of executive product management, marketing and strategy experience.</p>\n\n<p>David is currently a member of the executive management team and the Senior Vice President for Product Management at AdSafe Media, an industry leader in online brand protection and risk management. At AdSafe, David is responsible for product management and strategy and oversees many of the day-to-day operations of the organization. </p>\n\n<p>Prior to joining AdSafe Media, David was an executive with Safenet&#8217;s digital media services group, the leading provider of digital protection and measurement services. There he was responsible for managing the group&#8217;s portfolio of digital asset protection services and transforming the portfolio to take advantage of the emerging opportunities in digital media distribution at major studios, record labels and publishers. </p>\n\n<p>At Message Labs, one of the world&#8217;s largest software-as-a-service messaging security organizations, David was responsible for the product management and product strategy for North America and Asia Pacific markets. Before MessageLabs, David ran the product management and marketing for Mail.com, a consumer webmail service. </p>\n\n<p>Outside of AdSafe, David is very active in the NYC startup community. He is a mentor with First Growth Venture Network, a mentoring program for high potential seed and early stage startup tech companies in and around New York City and also sits on the Council for Accountable Advertising, a trade organization for digital media advertising. David often speaks on industry panels and with analysts and media about industry trends.  </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"SVP Product Management","firm":{"name":"Integral Ad Science","permalink":"integralads","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0008/9405/89405v6-max-150x150.png"],[[226,80],"assets/images/resized/0008/9405/89405v6-max-250x250.png"],[[226,80],"assets/images/resized/0008/9405/89405v6-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}