{"first_name":"David","last_name":"Morken","permalink":"david-morken","crunchbase_url":"http://www.crunchbase.com/person/david-morken","homepage_url":"http://www.bandwidth.com","birthplace":"Los Angeles, CA","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Bandwidth.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Nov 15 06:58:16 UTC 2009","updated_at":"Thu Jul 19 19:56:33 UTC 2012","overview":"<p>Morken is the co-founder, CEO and President of Bandwidth.com, Inc.</p>\n\n<p>In 2008 Bandwidth made the Inc. Magazine 500 list for the third consecutive year as the fourth fastest growing privately held company and the fastest growing telecommunications company from 2002 to 2007.  The company is private and profitable.  In 2008 Morken was named one of the Triangle Business Journals 40 Under 40 top business leaders. </p>\n\n<p>In 1994, Morken co-founded the Internets first online tax filing service, efiling.com. He was called to active duty by the Marine Corps in 1995 and served four years as a Judge Advocate, criminal prosecutor and headquarters company commander. Morken is a graduate of the University of Notre Dame Law School and a member of the Virginia Bar Association. He received his undergraduate degree from Oral Roberts University where he also served as President of the student body.</p>\n\n<p>Morken suffers from an addiction to endurance athletics, finishing 22nd in the 2008 Wasatch 100 mile Ultramarathon in under 27 hours. In 2009, he was named the &#8220;Healthiest CEO In The Triangle (Raleigh-Durham)&#8221; by Business Leader Magazine. He was the first finisher from North Carolina in the 2005 Ironman World Championships held in Kona Hawaii, finishing in 9 hours and 43 minutes. Morken was a two-time member of the Marine Corps Triathlon team in 1997-98.</p>\n\n<p>Morken resides in Chapel Hill with his wife Chrishelle and their six, yes six, children.</p>\n\n<p>Morken and Bandwidth.com co-founder Henry Kaestner were each named by American Venture Magazine as one of the Top 40 Under 40, and together were named by Frost and Sullivan as the 2006 CEO of the Year in the North American IP Communications Services industry.</p>\n\n<p>Morken and Kaestner have co-founded two non-profit organizations: DurhamCares, a non-profit charity which seeks to bring awareness of excellent charities that are transforming Durham, and Talent Capital of Durham, which invests in entrepreneurs that would not otherwise be eligible for traditional funding from banks, angel or VC funds.</p>","image":{"available_sizes":[[[96,96],"assets/images/resized/0008/3189/83189v2-max-150x150.jpg"],[[96,96],"assets/images/resized/0008/3189/83189v2-max-250x250.jpg"],[[96,96],"assets/images/resized/0008/3189/83189v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.A. ","subject":"Government","institution":"Oral Roberts University","graduated_year":1991,"graduated_month":null,"graduated_day":null},{"degree_type":"J.D.","subject":"Law","institution":"University of Notre Dame Law School","graduated_year":1994,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Co-Founder, President and CEO","firm":{"name":"Bandwidth.com","permalink":"bandwidth-com","type_of_entity":"company","image":{"available_sizes":[[[150,29],"assets/images/resized/0006/6259/66259v5-max-150x150.png"],[[250,49],"assets/images/resized/0006/6259/66259v5-max-250x250.png"],[[269,53],"assets/images/resized/0006/6259/66259v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}