{"first_name":"David","last_name":"Aslin","permalink":"david-aslin","crunchbase_url":"http://www.crunchbase.com/person/david-aslin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Nov 24 05:21:29 UTC 2008","updated_at":"Mon Nov 24 05:36:22 UTC 2008","overview":"<p>David Aslin has more than 20 years of global Infocom executive and venture creation experience. His business building expertise was developed as General Manager at HP and in small European technology companies; since 2000 he has applied it in Silicon Valley as a venture capitalist, startup coach and entrepreneur.</p>\n\n<p>Alongside his work with Nexit, Mr. Aslin advises and creates new companies in wireless and clean energy applications.  Previously, Mr. Aslin invested in Nexit portfolio company Bitfone while leading early stage investing for 3i Technology Partners, where he was a General Partner.  Other wireless investments he led for 3i include Triage Wireless, Discera, Kineto Wireless and AOptix.</p>\n\n<p>While serving as head of business development for Richtec plc (now L-3 Communications) Mr. Aslin created a new equipment company, Ottercom, and became its first CEO; it was later acquired by EMS Technologies.</p>\n\n<p>Mr. Aslin’s career at HP progressed from sales engineer to UK General Manager and member of the European leadership team. He created and led a new pan-European business opportunity to $30m revenues in under two years.</p>\n\n<p>A frequent speaker on venture and technology topics, Mr. Aslin is a Charter Member at SVASE and EIR at the Center for Entrepreneurship and Technology at University of California, Berkeley.</p>\n\n<p>Mr. Aslin holds an M.S. from Imperial College, London; CBA from Warwick Business School and MSIB from INSEAD, France. </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0002/9367/29367v1-max-150x150.jpg"],[[120,180],"assets/images/resized/0002/9367/29367v1-max-250x250.jpg"],[[120,180],"assets/images/resized/0002/9367/29367v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Venture Partner","firm":{"name":"Nexit Ventures","permalink":"nexit-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,30],"assets/images/resized/0002/9380/29380v1-max-150x150.jpg"],[[233,47],"assets/images/resized/0002/9380/29380v1-max-250x250.jpg"],[[233,47],"assets/images/resized/0002/9380/29380v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}