{"first_name":"David","last_name":"Bostwick","permalink":"david-bostwick","crunchbase_url":"http://www.crunchbase.com/person/david-bostwick","homepage_url":"","birthplace":"","twitter_username":"BostwickD","blog_url":"","blog_feed_url":"","affiliation_name":"Bostwick Laboratories","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jul 20 05:01:56 UTC 2012","updated_at":"Mon Jul 23 06:11:01 UTC 2012","overview":"<p>David Bostwick is an internationally renowned urologic pathologist and entrepreneur.</p>\n\n<p>Dr. David G. Bostwick is Chief Medical Officer of Bostwick Laboratories, Inc. Formerly Professor of Pathology and Urology at the Mayo Clinic (from 1991 to 1999), Dr. Bostwick founded Bostwick Laboratories in 1999, and it is now the leading urologic pathology practice in the US and UK.</p>\n\n<p>An internationally renowned urologic pathologist with more than 30 years of experience and interest in prostate cancer, bladder cancer and urologic diseases, Dr. Bostwick is the most sought-after pathologist for second opinions in urologic pathology. He has presented more than 2000 lectures around the world, is past President of the International Society of Urological Pathology, and currently serves on the editorial board of ten medical journals.</p>\n\n<p>Dr. Bostwick has authored and edited 17 books, more than 30 book chapters and more than 400 professional papers. His book, Urologic Surgical Pathology (WB Saunders, 1997 and 2007) is the bestselling uropathology medical textbook. Other current best-sellers are his books American Cancer Society’s Complete Guide to Prostate Cancer (American Cancer Society, 2005) and Essentials of Pathology, 3rd Edition (Springer 2001, 2006, and 2011). His most quoted works include the first descriptions of prostatic intraepithelial neoplasia (1986) and atypical small acinar proliferation (1998).</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Cheif Medical Officer","firm":{"name":"Bostwick Laboratories","permalink":"bostwick-laboratories","type_of_entity":"company","image":{"available_sizes":[[[150,49],"assets/images/resized/0015/9589/159589v1-max-150x150.jpg"],[[190,63],"assets/images/resized/0015/9589/159589v1-max-250x250.jpg"],[[190,63],"assets/images/resized/0015/9589/159589v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}