{"first_name":"David","last_name":"Barrett","permalink":"david-barrett-2","crunchbase_url":"http://www.crunchbase.com/person/david-barrett-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Polaris Venture Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"egnyte, logmein, confluence, freejit, imprivata, markmonitor, vkernel","alias_list":null,"created_at":"Thu Nov 13 17:49:36 UTC 2008","updated_at":"Thu Jan 06 03:44:39 UTC 2011","overview":"<p>Dave Barrett is a general partner in our Boston office, having joined Polaris in April 2000.  He focuses on investment opportunities in technology, including particular interest in both emerging and growth-stage software and internet businesses.  He is especially focused in on-demand business models, technology-enabled services businesses and financial services technology.</p>\n\n<p>Experience:\nDave joined Polaris after a 22-year operating career.  As a senior executive and board member of publicly-held software and services leaders during their periods of highest growth, he built teams which achieved dominant market share, extraordinary enterprise value and over 20 acquisitions.</p>\n\n<p>Through March 2000, Dave served as chief operating officer of Calico Commerce.  During his leadership, the company evolved from venture-backed startup to a publicly-held corporation with revenues of over $45M and market value in excess of $3B as one of the top-performing IPOs of 1999.</p>\n\n<p>Before, he served as senior vice president of worldwide operations for Pure Atria Software Corporation; a $150M publicly-held market leader in software development automation, continuing in that role after the company was acquired by Rational Software Corporation for $1B in 1997.</p>\n\n<p>Earlier, Dave spent twelve years with Lotus Development Corporation, a $1B enterprise software pioneer, where he served in several executive roles.  As vice president of field sales and services, he led development of the company’s global enterprise sales effort, which served as an industry model and established Lotus Notes as a market-defining standard.  He also served as general manager of worldwide federal systems, which during his leadership was the fastest growing division in the company.  Lotus was acquired by IBM in 1995 for $3.5B, which, at the time, was the largest merger in software industry history.</p>\n\n<p>Boards:\nDave represents Polaris on the boards of 170 Systems, Confluence, Dataupia, Egnyte, Imprivata, LogMeIn, MarkMonitor, mValent, and vKernel, and is a past board member of Centra Software (NASDAQ: CTRA) and Archivas (acquired by Hitachi Data Systems).</p>\n\n<p>He also serves on the Microsoft Venture Capital Advisory Board, the Software &amp; Information Industry Association (SIIA) Private Equity Board, and the Dana-Farber Cancer Institute Board of Trustees.</p>\n\n<p>Education:\nDave holds a B.S. from The University of Rhode Island.</p>","image":{"available_sizes":[[[91,150],"assets/images/resized/0002/8632/28632v2-max-150x150.jpg"],[[117,192],"assets/images/resized/0002/8632/28632v2-max-250x250.jpg"],[[117,192],"assets/images/resized/0002/8632/28632v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Polaris Venture Partners","permalink":"polaris-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,36],"assets/images/resized/0001/1153/11153v1-max-150x150.png"],[[163,40],"assets/images/resized/0001/1153/11153v1-max-250x250.png"],[[163,40],"assets/images/resized/0001/1153/11153v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[{"description":"Board of Directors - Egnyte ","stoned_year":2009,"stoned_month":null,"stoned_day":null,"source_url":"http://www.egnyte.com/corp/management.html","source_text":null,"source_description":"","stoneable_type":"Person","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"first_name":"David","last_name":"Barrett","permalink":"david-barrett-2"}}],"video_embeds":[],"external_links":[],"web_presences":[]}