{"first_name":"David","last_name":"Chie","permalink":"david-chie","crunchbase_url":"http://www.crunchbase.com/person/david-chie","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Palo Alto Staffing ","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Nov 15 06:09:29 UTC 2010","updated_at":"Sun Apr 15 00:34:16 UTC 2012","overview":"<p>David Chie, a staffing executive based out of Palo Alto, California, got his start in staffing in Australia. From 2006 to 2007, he worked for a premier recruiting firm in Australia, Slade Group, as a Recruitment Consultant. He recruited permanent and contract candidates, expanded existing relationships, and discovered new growth opportunities. In 2007, David Chie moved to Glotel, Inc., a U.S.-based staffing solutions firm, as a regional sales executive, where he pursued new business leads as well as participated in staff recruiting. Chie then went to work as a business development manager for Harvey Nash, USA, for one year. Harvey Nash provides international executive searches and technical professional services. There, David Chie learned a great deal about IT staffing as he built new accounts and contributed to candidate recruiting. </p>\n\n<p>David Chie currently serves as the chief operating officer for both Palo Alto Staffing Services and Palo Alto Staffing Technology. Both companies offer recruiting expertise and market insights under two collaborative yet separate businesses. Palo Alto Staffing Services offers corporate staffing solutions and office support in fields such as marketing, finance, and administration. Palo Alto Staffing Technology places IT professionals to support the software development cycle and industry. David Chie directs the day-to-day operations, manages hiring and training, and leads the marketing efforts for both businesses. </p>\n\n<p>David Chie has used his experience in the business world to benefit his community. From 2008 to 2009, Chie served as a board member and the chairman of the development committee for the Mental Health Association of San Francisco, assisting with advocacy, education, and service to improve the mental health of residents in the San Francisco area.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"COO","firm":{"name":"Palo Alto Staffing ","permalink":"palo-alto-staffing-services","type_of_entity":"company","image":{"available_sizes":[[[150,69],"assets/images/resized/0011/0207/110207v2-max-150x150.png"],[[150,69],"assets/images/resized/0011/0207/110207v2-max-250x250.png"],[[150,69],"assets/images/resized/0011/0207/110207v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}