{"first_name":"Dean","last_name":"Jones","permalink":"dean-jones-3","crunchbase_url":"http://www.crunchbase.com/person/dean-jones-3","homepage_url":"http://biblepress.com","birthplace":"London","twitter_username":"biblepress","blog_url":"http://biblepress.com/blog","blog_feed_url":"http://biblepress.com/feed","affiliation_name":"Unaffiliated","born_year":1978,"born_month":5,"born_day":10,"tag_list":"bible, christian, blog, social, church","alias_list":null,"created_at":"Sun Apr 29 18:00:09 UTC 2012","updated_at":"Wed May 09 03:08:17 UTC 2012","overview":"<p>BiblePress.com is an independent, inter-denominational, christian website designed to allow blogging about the Bible in many different languages, including English, Spanish, French, and other non-English languages. BiblePress views all denominations as equal constituents of the body of Christ and in preserving its identity as an inter-denominational christian blogging site, does not promote or demote any denomination and/or christian congregations. BiblePress distributes religious news in English on a daily basis electronically. The website is free for anyone to use. It is currently owned by Dean Jones.</p>\n\n<p>BiblePress.com is built using the popular free and open source dynamic content management system (CMS) WordPress which is based on PHP and MySQL. BiblePress is essentially a WordPress MU powered site a multi-user version of WordPress. It has many features including a plug-in architecture and a template system. The WordPress CMS is used by over 14.7% of Alexa Internet&#8217;s &#8220;top 1 million&#8221; websites making it the most popular CMS in use on the Internet. </p>\n\n<p>BiblePress was first lunched on February 01, 2012, by Dean Jones as a fork of both BuddyBible.org and BiblePress.info. At the time it was thought that the .info domain would have been an ideal solution if the website had remained a static information site to communicate biblical information to people who were looking for it as the .info domain is readily understood in multiple languages and an unrestricted domain not limited to businesses or professionals or any other smaller set of Internet sites. As of April 2012, the site has been  visited over 20,000 times.. BiblePress was initially planned as a static social bookmarking site for the Bible, but gradually expanded into a powerful christian blogging  site with social networking features using BuddyPress a popular Social networking plugin for WordPress.</p>","image":{"available_sizes":[[[150,46],"assets/images/resized/0018/7050/187050v2-max-150x150.jpg"],[[250,78],"assets/images/resized/0018/7050/187050v2-max-250x250.jpg"],[[320,100],"assets/images/resized/0018/7050/187050v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}