{"first_name":"Dean","last_name":"(Kip) Witter III","permalink":"dean-kip-witter-iii","crunchbase_url":"http://www.crunchbase.com/person/dean-kip-witter-iii","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jul 23 05:52:50 UTC 2011","updated_at":"Sat Jul 23 05:55:20 UTC 2011","overview":"<p>Kip Witter&#8217;s finance career started in 1974 with US Leasing International, Inc., after which he spent 12 years in various finance positions with Amdahl Corporation (formerly ASE: AMH), where he served his last 5 years as Vice President and Treasurer. Since Amdahl, Kip was a founder of Eeonyx Corporation and a senior consultant with The Capstone Group and The Brenner Group, where he specialized in providing financial executive consulting to high-growth and early-stage clients. Kip joined Hello Direct, Inc. (formerly NASDAQ: HELO) and served as Chief Financial Officer until the time of its acquisition by GN Great Nordic in 2001. In May of 2003, Kip became President of William D. Witter, Inc., a privately owned Registered Investment Adviser based in New York City, and Chairman in February 2005. Kip rejoined The Brenner Group in January of 2009, serving as a director of Eeonyx Corporation and Provista Software Intl, Inc. Kip received his MBA from the Stanford University Graduate School of Business and his BA in Applied Mathematics from Harvard College (magna cum laude), where he was elected to Phi Beta Kappa. Kip is president of The Dean Witter Foundation and serves as a trustee of the Harvey and Maud Sorensen Foundation. Additionally, Kip is a member of both the Mathematical Association of America and of the Mounted Patrol of San Mateo County. Kip&#8217;s favorite hobbies include recreational mathematics, puzzles and (Western) horseback riding. He is twice Reserve Champion in California State Horsemen&#8217;s Association Trail Trials.</p>","image":null,"degrees":[{"degree_type":"MBA","subject":"","institution":"Stanford University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chief Financial Officer","firm":{"name":"Zenergo","permalink":"zenergo","type_of_entity":"company","image":{"available_sizes":[[[150,51],"assets/images/resized/0010/2418/102418v2-max-150x150.png"],[[250,85],"assets/images/resized/0010/2418/102418v2-max-250x250.png"],[[376,129],"assets/images/resized/0010/2418/102418v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}