{"first_name":"Dean","last_name":"Terry","permalink":"dean-terry","crunchbase_url":"http://www.crunchbase.com/person/dean-terry","homepage_url":"","birthplace":"Bethesda","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1956,"born_month":3,"born_day":29,"tag_list":null,"alias_list":null,"created_at":"Tue Apr 08 19:52:42 UTC 2008","updated_at":"Sat May 03 04:21:46 UTC 2008","overview":"<p>Dean is responsible for iRise&#8217;s strategy, solution offerings, program execution and alliance partnerships in the federal sector. He is also the senior executive responsible for iRise transformation solutions and leads the delivery teams and alliance partners for various client programs. For five years prior, Dean was EVP of Enterprise Solutions for North America, working closely with the nation’s leading corporations in the aerospace / defense, automotive, transportation / logistics and financial / insurance sectors.</p>\n\n<p>Dean has more than 20 years experience in several business and IT disciplines, including business process transformation, software development, performance measurement and technology innovation. His team works with federal agencies and their IT suppliers in the development of strategy and execution of strategic initiatives relating technology, techniques and best practices for software acquisition by implementing visualization.</p>\n\n<p>During his career, Dean has served in various leadership roles starting from software development and sales, and progressing to senior management ranks related to computer-based visualization for airborne reconnaissance, seismic analysis, CAD/CAM, ultrasound, and software development; while employed by Hewlett-Packard, the DoD, and Siemens; and high-tech start-ups Automated Methods, Signal Stream Technologies, and iRise.</p>\n\n<p>Dean completed a BSc-CS from UVM, a MBA from Western New England and a one year post-graduate program in Operations Research &amp; Systems Analysis at UTD. He is an adjunct professor at the University of Maryland and is actively involved with research, educational and nonprofit organizations such as the ACT/IAC, IEEE, MIT Media Lab, CMU SEI (CMMI-ACQ), DoD IMA, AFIO and the BSA Sea Scouts. He is a recipient of the DoD Meritorious Service Medal for exceptional service, and Hewlett-Packard President&#8217;s Circle distinction for exceptional contributions to company success.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"EVP of Federal Solutions","firm":{"name":"iRise","permalink":"irise","type_of_entity":"company","image":{"available_sizes":[[[150,68],"assets/images/resized/0001/7014/17014v1-max-150x150.jpg"],[[176,80],"assets/images/resized/0001/7014/17014v1-max-250x250.jpg"],[[176,80],"assets/images/resized/0001/7014/17014v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}