{"first_name":"Dean","last_name":"Palermo","permalink":"dean-palermo","crunchbase_url":"http://www.crunchbase.com/person/dean-palermo","homepage_url":"http://www.fanbump.com","birthplace":"Huntington Beach","twitter_username":"fanbump","blog_url":"","blog_feed_url":"","affiliation_name":"Fanbump","born_year":1973,"born_month":1,"born_day":24,"tag_list":"fanbump, elettro, stashbox, photo-voting-contest, 100-top-downloads, elettro-promos, best-name-badge","alias_list":null,"created_at":"Sun Jul 24 16:23:42 UTC 2011","updated_at":"Mon Jul 25 17:28:39 UTC 2011","overview":"<p>Founder and president of Fanbump, the mobile digital autograph revolution app.  Fanbump is an Elettro Interactive production.  </p>\n\n<p>After working at Disney Pictures digital marketing, Dean began the Interactive division of Elettro in early 2007.  He has produced contests every business quarter since early 2007, giving away over $200,000 in prizes and over 100,000,000 images rated on the PhotoVotingContest.com platform.  This experience has created a contest strategdy and production expert.  This is where the valuable knowledge exists regarding how to run promotions in todays vast world of new technology.  </p>\n\n<p>A five minute conversation is all it takes to get the sense that Dean is a leader of knowing the in&#8217;s and out&#8217;s of running a promotion that coordinates contests, sweeps, online, mobile, Facebook, on-air, at event, and specializes in strategies for intelligent, scalable crowd growth and crowd sourcing.  </p>\n\n<p>Dean has produced an extensive amount of marketing project wide ranging from Webby Award winning moible alert system for Morgans Hotel Group, multi-year producer for exclusive live red carpet show at IFC Spirit Awards website including producing a broadcast in HD live online via on location remote satelite truck.  He has produced multiple TV networks &#8216;up fronts&#8217; sites,  major tv network corporate communications web production, and many broken highest day/month of web traffic projects later.  Dean has a B.S. in Business Administration from University of Texas at Dallas. </p>\n\n<p>All of these experiences have help shape this concept to make this the most commonly used app for fans and stars.  He understands this eco-system from all the sides of the business, as a fan, working directly with stars in all different forms of star/fan moments, and working with the marketing and ad sales divisions of multiple TV networks, feature film houses and major labels.     </p>","image":{"available_sizes":[[[69,150],"assets/images/resized/0014/5842/145842v2-max-150x150.png"],[[115,250],"assets/images/resized/0014/5842/145842v2-max-250x250.png"],[[205,445],"assets/images/resized/0014/5842/145842v2-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"B.S.","subject":"Business Administration","institution":"University Texas at Dallas","graduated_year":1998,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"President / Founder","firm":{"name":"Fanbump","permalink":"fanbump","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.fanbump.com","title":"President / Founder"},{"external_url":"http://www.elettro.com","title":"President / Founder"},{"external_url":"http://www.photovotingcontest.com","title":"President / Founder"}]}