{"first_name":"Dean","last_name":"Wiltse","permalink":"dean-wiltse","crunchbase_url":"http://www.crunchbase.com/person/dean-wiltse","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Vovici","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed May 13 13:06:15 UTC 2009","updated_at":"Sat May 16 21:40:16 UTC 2009","overview":"<p>Dean Wiltse brings 30 years of knowledge and expertise in the marketing and technology industries. Mr. Wiltse spent the last four years as CEO and President of Greenfield Online. Under Wiltse&#8217;s leadership, Greenfield delivered and sustained an organic growth rate of greater than 70% per year, reached a $90MM run rate in 2005 revenues and $21MM in EBITDA, and completed a successful IPO in July 2004. During his tenure at Greenfield Online, Wiltse led Greenfield&#8217;s strategic shift from a custom marketing research company to an online data and technology company. Under his leadership, Greenfield established the largest community of global online panels, communities, and affiliates, and was a key enabler for the custom marketing research industry to leverage the Internet for surveys and data collection. In recognition of his accomplishments, Wiltse was nominated as the Ernst &amp; Young 2005 Entrepreneur of the Year and nominated by Research Magazine as the &#8220;Marketing Research Industry CEO of the Year&#8221; for 2005.</p>\n\n<p>Prior to his four years with Greenfield, Wiltse served as president of the software division at Engage, Inc. His leadership resulted in the development of online profiling and ad-serving technology-an industry first-that enabled tailoring and targeting online marketing based on an individual&#8217;s specific interests and online behavior. Wiltse also held senior level positions at Avid and Vivo Software, purchased by Real Networks in 1998.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"Vovici","permalink":"vovici","type_of_entity":"company","image":{"available_sizes":[[[105,27],"assets/images/resized/0004/3916/43916v2-max-150x150.png"],[[105,27],"assets/images/resized/0004/3916/43916v2-max-250x250.png"],[[105,27],"assets/images/resized/0004/3916/43916v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}