{"first_name":"Deb","last_name":"Hiner","permalink":"deb-hiner","crunchbase_url":"http://www.crunchbase.com/person/deb-hiner","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue May 01 01:55:17 UTC 2012","updated_at":"Wed May 09 03:36:58 UTC 2012","overview":"<p>Deb Hiner CEO, specializes in recruiting for start-up to mid size, high growth companies. She has been recruiting since 1982, and over the last 15 years, in the medical device &amp; life sciences industries. Her approach to recruiting centers on building strong relationships with her clients and candidates, while understanding the key objectives for both sides. Deb is trained in performance based hiring, Her approach to recruiting is based on, defining top performance, to take the time to understand the companies’ goals, requirements, &amp; culture. She understands that each search and company is unique and she will develop a customized recruiting strategy that will result in hiring the right people every time.</p>\n\n<p>Since our clients often desire flexibility in the search process, we offer hourly and project based search services. We follow the retained search methodology but bill on a project or hourly basis. With the results of our project based search consulting services rivaling the results of traditional retained search, this option often makes the most sense for our discerning clients. This option is generally more cost effective than traditional executive or retained search.\nWe offer an array of services that can be used as building blocks to assemble a multifaceted recruiting strategy. We tailor our services to your specific human resources requirements</p>\n\n<p>• Position-specific recruitment strategy &amp; project plan based on client requirements.\n• Full-service development, implementation and ownership of the recruiting process\n• Comprehensive creative market development, ie. social networks, SMS Text marketing.\n• Strategic sourcing and candidate development to build a strong candidate pipelines.</p>\n\n<p>Our clients utilize our research based search process to identify, select and hire top talent across all departments within the industry.\nSpecialties</p>\n\n<p>Medical device Pharmaceutical Executive Search, Executive Recruiting, Retained Search, Career Coaching,\nExperience\nExecutive Recruiting Consultant\nScout Recruitment Consultants Inc,</p>\n\n<p>Privately Held; 1-10 employees; Medical Devices industry</p>\n\n<p>June 2007 – Present (5 years)</p>\n\n<p>Scout Recruitment Consulting Inc. develops Recruitment and Process Improvement solutions with a West Coast focus (San Francisco Bay Area, Southern California, Washington, Utah, Colorado We partner with clients at all stages. Our clients have enjoyed great success building their teams with the best talent in the industry over the last 10 years.</p>\n\n<p>Deb Hiner, CEO Scout Recruitment Consultants Inc. has been recruiting since 1998, in the medical device pharmaceutical and in vitro diagnostics industries.</p>\n\n<p>Her approach to recruiting centers on building strong relationships with her clients and candidates and developing a thorough understanding the “key objectives” on both sides.</p>\n\n<p>Deb is trained in performance based hiring by Lou Adler.</p>\n\n<p>Performance based hiring is, “defining top performance”, then taking the time to understand the companies’ goals, requirements, &amp; culture. She understands that each search and company is unique and she will develop a customized recruiting strategy that will result in hiring the right people every time.”</p>\n\n<p>Keywords: Executive Recruiting, Retained Search, Career Coaching, medical device pharmaceutical, biotechnology, invitrodiagnostics</p>\n\n<p>Deb has 11 recommendations (9 co-workers, 2 clients) including:</p>\n\n<pre><code>1st Michele Guzman, Consultant, Michele Guzman Consulting\n1st Ratna Tripathi, PHR, Prin. Human Resources Consultant, Boston Scientific Corporation\n</code></pre>\n\n<p>Executive Recruiter\nSimco Electronics</p>\n\n<p>Privately Held; 201-500 employees; Electrical/Electronic Manufacturing industry</p>\n\n<p>2007 – Present (5 years)</p>\n\n<p>Executive Recruiter for Simco Electronics:\nSIMCO Electronics is the nation’s largest company specializing exclusively in calibration and repair services for test and measurement equipment. Instrument calibration and repair is SIMCO’s only business focus and has been for over 40 years.</p>\n\n<p>Deb Hiner is the sole Executive Recruiter filling all types of positions nationwide. Successful searches have included GM of Software development, GM in the Asia Lab. UI Engineer, Calibration technicians at all levels. East coast and west coast Software Sales executives\nCorporate Recruiter\nBoston Scientific Corporation</p>\n\n<p>Public Company; 10,001+ employees; BSX; Medical Devices industry</p>\n\n<p>2005 – 2007 (2 years)</p>\n\n<p>Full-cycle recruitment for largest medical device company in the world. Handled entire west coast recruitment for clinical sales, R&amp;D, clinical operations and regulatory affairs. Consistently place high quality candidates in key roles for the organization Sourced and filled 14 roles for Electrophysiology group within three weeks.\nSenior Recruiter\nScout Executive Search</p>\n\n<p>2004 – 2007 (3 years)</p>\n\n<p>Contract Recruiter:\nFull-cycle recruitment from sourcing to negotiations and final offer, head count planning, direct sourcing and cold calling. Experience in recruiting candidates for sales and marketing as well as other various positions, inside and outside sales positions nationwide.\nRecruited for engineering, finance and accounting positions as a contract recruiter for Supplybase, Iowa Telecom.</p>\n\n<p>Recruited and placed several highly technical engineering accounting and management positions for Medtronic AVE. (Percusurge)\nConducted key executive searches for various pharmaceutical, biotech and medical device companies. Searches include executive level, accounting, regulatory affairs, medical affairs, quality, clinical and facilities positions.</p>\n\n<p>Recruiting consultant:\nDesigned and implemented recruiting program for start-up medical device firm filling multiple positions including finance and accounting recruited and placed accounting manager for Iowa telecom, candidate had to know Sarbanes Oxley to bring the company public. Placed CRAs, mechanical engineers, manufacturing engineers managers, regulatory and manufacturing personnel\nImplemented and developed recruiting programs for SupplyBase.com, an internet company. Recruited in accounting, sales engineering, project management, web designers, inside and outside sales and software developers. Handled Supply-base, job faire, Hot-jobs. Designed all ads for job posting &amp; job fairs. Trained managers on behavioral interviewing techniques.</p>\n\n<p>Clients included:\nPercusurge/ Medtronic AVE, Santa Clara/Santa Rosa CA\nGilead Sciences, Intermune, Aradigm, Metabolex, Abgenix\nSupplyBase.com, San Francisco CA\nDigitalthink, San Francisco CA\nIowa Telecom, Newton, Grinnell Iowa\nIntagio\nQuintegra\nFTI</p>\n\n<p>,Executive Search, Executive Recruiting, Retained Search, Career Coaching, Medical device In vitro diagnostics</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}