{"first_name":"Debbie","last_name":"Moore","permalink":"debbie-moore","crunchbase_url":"http://www.crunchbase.com/person/debbie-moore","homepage_url":"http://www.pickyproofreader.com.au","birthplace":"Australia","twitter_username":"pickyproofer","blog_url":"http://blog.pickyproofreader.com.au/","blog_feed_url":"http://blog.pickyproofreader.com.au/feed/","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"proofreading-careers, proofreading-service, proofreading-help, writing-and-editing-services, online-proofreading, proofreading-jobs--website-proofreading, standard-proofreading","alias_list":null,"created_at":"Mon May 03 05:43:54 UTC 2010","updated_at":"Mon May 03 19:50:23 UTC 2010","overview":"<p>Debbie Moore was utilising her Bachelor of Laws by lovingly pouring over terms and conditions in her job as a Commercial Analyst.  As fascinating as this sounds, it actually provided a unique environment for becoming an expert at attention to detail.  A certain amount of care is required when constructing legally binding contracts - using the wrong word would, at best, be embarrassing; at worst, disastrous!  In addition to this, for some strange reason, the Law Faculty has issues regarding typos in student assessments.  Major issues.  Therefore this finely honed instinct was consistently picking up typos in tender submissions and technical reports - even the odd legal text book!</p>\n\n<p>The Picky Proofreader is the brainchild of two &#8220;somewhat picky&#8221; (that&#8217;s the polite description) professionals who are ready, willing and waiting to eliminate all your spelling and grammatical nightmares.</p>\n\n<p>Why should you feel bad because you&#8217;ve missed one tiny, itty bitty typo? That&#8217;s a good question - and we promise not to make you feel bad. </p>\n\n<p>However, the reality is that those itty, bitty typos just jump out of the page to your readers. They turn your outstanding masterpiece which you&#8217;ve spent houuuuurrrrsss putting together into a &#8220;pretty good job but you really should have used the spell checker&#8221;. The problem is that a spell checker and a grammar checker do not catch all the mistakes! For example - according to most software program spell checkers, &#8220;buoy&#8221; and &#8220;boy&#8221; are both spelt correctly . It&#8217;s just a pity they mean two completely different things!</p>\n\n<p>We understand that we&#8217;re our own worst critics and we have no intention of helping you beat yourself up. What we will provide is friendly, accurate, professional service at a reasonable price.</p>\n\n<p>From a brochure to a thesis; from a website to legal pleadings, we&#8217;re here to help you.</p>\n\n<p>Some of the services we&#8217;ve provided in the past include:</p>\n\n<p>•manuscript proofreading;\n•resume and Cover Letter construction and polishing;\n•proofing of newsletters and newspaper articles;\n•proofing of advertising copy;\n•proofing of web pages;\n•transcription services - hand written notes into presentations and reports;\n•providing assistance to clients for whom English is their second language; and\n•proofing of legal assignments, journal articles and submissions. </p>","image":{"available_sizes":[[[150,60],"assets/images/resized/0008/5722/85722v2-max-150x150.png"],[[225,90],"assets/images/resized/0008/5722/85722v2-max-250x250.png"],[[225,90],"assets/images/resized/0008/5722/85722v2-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"","subject":"Bachelor of Laws","institution":"QUT","graduated_year":2010,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.pickyproofreader.com.au","title":"The Picky Proofreader"},{"external_url":"http://blog.pickyproofreader.com.au/","title":"http://blog.pickyproofreader.com.au/"},{"external_url":"http://www.pickyproofreader.com","title":"The Picky Proofreader"},{"external_url":"http://www.pickyproofreader.asia","title":"The Picky Proofreader"}]}