{"first_name":"Debby","last_name":"Meredith","permalink":"debby-meredith","crunchbase_url":"http://www.crunchbase.com/person/debby-meredith","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 14 13:40:41 UTC 2008","updated_at":"Sun Nov 16 18:56:08 UTC 2008","overview":"<p>Debby Meredith joined JAFCO Ventures as a venture partner in 2003, bringing more than 20 years of experience managing product engineering teams and introducing new technologies to the market. Given her broad set of operational skills and venture experience, Debby provides JAFCO with great insight into the operational capabilities of potential investment opportunities. She also takes on interim executive roles where she works directly with company founders, helping to assemble world-class engineering teams, architect software products and establish initial product roadmaps.</p>\n\n<p>Representative companies that Debby has assisted include BoredAd, Cenzic, Efficient Frontier, Friendster, Good Techology (Motorola), Ketera Technologies, Moka5, NearbyNow, oneREV<br/>\n(Agile Software), Proofpoint, Scribd, Terraspring (Sun Microsystems) and Voltage Security.</p>\n\n<p>Prior to joining JAFCO, Debby was a venture partner with Mohr, Davidow Ventures, where she worked with portfolio companies as an interim CEO or VP of Engineering. Earlier in her career, Debby was with America Online/Netscape where she held several positions including Senior Vice President of Strategic Technologies and Products, Vice President of Browser Products and Chief Quality Officer. Prior to Netscape, she was Vice President of Engineering for Collabra Software and Vice President of Development for Slate. Debby also held key technical positions at Metaphor Computer Systems, Logitech and Bell Laboratories.</p>\n\n<p>Debby earned a Master of Science degree in computer science from Stanford University. She received her Bachelor of Science degree in computer science and mathematics from the University of Michigan.</p>","image":{"available_sizes":[[[150,105],"assets/images/resized/0002/8688/28688v1-max-150x150.jpg"],[[157,110],"assets/images/resized/0002/8688/28688v1-max-250x250.jpg"],[[157,110],"assets/images/resized/0002/8688/28688v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Venture Partner","firm":{"name":"Jafco Ventures","permalink":"jafco-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,30],"assets/images/resized/0000/3562/3562v1-max-150x150.png"],[[175,35],"assets/images/resized/0000/3562/3562v1-max-250x250.png"],[[175,35],"assets/images/resized/0000/3562/3562v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}