{"first_name":"Deborah","last_name":"H. Alderson","permalink":"deborah-h-alderson","crunchbase_url":"http://www.crunchbase.com/person/deborah-h-alderson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Mar 09 07:37:55 UTC 2011","updated_at":"Wed Mar 09 07:42:28 UTC 2011","overview":"<p>Deborah H. Alderson is president of SAIC&#8217;s Defense Solutions Group, headquartered in McLean, Virginia. Comprised of a team of more than 12,500 professionals, the group&#8217;s work is focused on command, control and communications, and systems engineering and integration in support of various federal agencies.\nPrior to joining SAIC in 2005, Alderson was the president of the Systems Engineering Group at Anteon Corporation. Under her leadership, the group supported the U.S. Navy, Missile Defense Agency, the U.S. Army, the U.S. Air Force, the U.S. Marine Corps and the Department of Homeland Security. She was assigned as the corporate executive for all Anteon support to the Department of Homeland Security. Alderson led the Systems Engineering Group to double digit growth each year, and participated in the leadership of Anteon Corporation&#8217;s initial public offering in 2001.\nAlderson&#8217;s belief in and support of her people has resulted in her group becoming one of the highest level technical achievement organizations - not only at SAIC but in the entire country. Her organization has been externally appraised at Maturity Level 5 of the Software Engineering Institute&#8217;s Capability Maturity Model-Integration®, placing it as one of the largest organizations within industry to achieve this elite credential organization-wide.\nAlderson’s commitment to mentoring has been a key driver behind the growth of SAIC’s Women’s Network from roughly 800 members to more than 2,000 in just one year. Alderson is also the executive sponsor of the SAIC Multi-Cultural Network, SAIC New Voices Network, and chairman of the SAIC University Relations Council which focuses on teaming with academia to find customer solutions and introduce young people to careers in technological fields.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0012/5592/125592v1-max-150x150.jpg"],[[192,192],"assets/images/resized/0012/5592/125592v1-max-250x250.jpg"],[[192,192],"assets/images/resized/0012/5592/125592v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Master of Science degrees","subject":"","institution":"Virginia Polytechnic Institute","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President, Defense Solutions Group","firm":{"name":"SAIC","permalink":"saic","type_of_entity":"company","image":{"available_sizes":[[[100,43],"assets/images/resized/0005/7955/57955v1-max-150x150.png"],[[100,43],"assets/images/resized/0005/7955/57955v1-max-250x250.png"],[[100,43],"assets/images/resized/0005/7955/57955v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}