{"first_name":"Deborah","last_name":"Estrin","permalink":"deborah-estrin","crunchbase_url":"http://www.crunchbase.com/person/deborah-estrin","homepage_url":"http://research.cens.ucla.edu/people/estrin/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Wed Oct 14 21:42:32 UTC 2009","updated_at":"Wed Oct 14 21:42:32 UTC 2009","overview":"<p>Deborah Estrin is a Professor of Computer Science and Electrical Engineering at UCLA. She holds the Jon Postel Chair in Computer Networks, and is Founding Director of the National Science Foundation funded Center for Embedded Networked Sensing (CENS). CENS’ mission is to explore and develop innovative, end-to-end, distributed sensing systems, across an array of scientifically and socially relevant applications, from ecosystems to human systems.</p>\n\n<p>Estrin and her colleagues are currently exploring Participatory Sensing systems that leverage the location, motion, image, and attached-sensor data streams increasingly available globally from mobile phones; with particular emphasis on human and environmental health applications and on privacy-aware architectures. </p>\n\n<p>Estrin’s earlier research addressed Internet protocol design and scaling, in particular, inter-domain and multicast routing. She received her PhD in 1985 from MIT and her BS in 1980 from UC Berkeley, both in EECS. Estrin currently serves on the National Research Council’s Computer Science and Telecommunications Board (CSTB) and was previously a member of the NSF National Ecological Observatory Network (NEON) Advisory board, the NSF CISE Advisory Committee, and DARPA-ISAT. </p>\n\n<p>Estrin was selected as the first ACM-W Athena Lecturer in 2006 and was awarded the Anita Borg Institute’s Women of Vision Award for Innovation in 2007. She was elected to the American Academy of Arts and Sciences in 2007 and to the National Academy of Engineering in 2009. She is a fellow of the IEEE, ACM, and AAAS and was granted Doctor Honoris Causa from EPFL in 2008.</p>","image":{"available_sizes":[[[75,100],"assets/images/resized/0006/2727/62727v1-max-150x150.jpg"],[[75,100],"assets/images/resized/0006/2727/62727v1-max-250x250.jpg"],[[75,100],"assets/images/resized/0006/2727/62727v1-max-450x450.jpg"]],"attribution":"<p>Web 2.0 Summit</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}