{"first_name":"Debra","last_name":"Pipines","permalink":"debra-pipines","crunchbase_url":"http://www.crunchbase.com/person/debra-pipines","homepage_url":"http://www.asperiongroup.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"financial-services, debra-pipines, asperion-group","alias_list":null,"created_at":"Thu Oct 25 14:49:18 UTC 2012","updated_at":"Sat Nov 03 22:42:19 UTC 2012","overview":"<p>Ms. Pipines is a Principal and founder of Asperion Group LLC, a FINRA Member firm which has been raising institutional capital for alternative funds since 2002. While at Asperion, Ms. Pipines has been responsible for the successful capital raises of top ranked global hedge fund managers. Throughout her career, Ms. Pipines has focused on fixed income across a broad range of instruments and products, which differentiates Asperion in the capabilities it can offer in this asset class.</p>\n\n<p>In 1997 she joined Deutsche Bank and Bankers Trust, and became Vice President in Global Emerging Markets. Ms. Pipines was responsible for selling emerging markets fixed income products to institutional clients.</p>\n\n<p>Prior to joining Bankers Trust, Ms. Pipines was a 12-year veteran of Salomon Brothers in New York, where she was consistently ranked among its top producers in the Firm’s Fixed Income Sales and Trading Department.</p>\n\n<p>Before that, Ms. Pipines was a Vice President in Salomon Brothers’ Bond Portfolio Analysis Group (BPA), where she served as an Analyst working on index tracking and optimization portfolio strategies for domestic and international fixed income clients, and was involved in the development of the Salomon Brothers World Government Bond Index.</p>\n\n<p>Ms. Pipines holds a B.S. in Business and Finance from Lehigh University.</p>","image":null,"degrees":[{"degree_type":"B.S.","subject":"Business and Finance","institution":"Lehigh University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}