{"first_name":"Deepak","last_name":"Premnarayen","permalink":"deepak-premnarayen","crunchbase_url":"http://www.crunchbase.com/person/deepak-premnarayen","homepage_url":"http://www.icsgroup.co.in/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"ICS Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"ics-group, ics-india, deepak-premnarayen","alias_list":null,"created_at":"Thu Aug 16 11:25:15 UTC 2012","updated_at":"Fri Aug 17 18:51:19 UTC 2012","overview":"<p>Mr. Deepak Premnarayen is an experienced entrepreneur and business leader. He founded the ICS Group in 1998 with interests in real estate, financial services and hospitality. The Group has partnered with international domain leaders like Old Mutual Property (South Africa), Bentel Associates (South Africa) and Secure Parking (Australia) for property development &amp; management services, architectural design services and car park management services respectively. The Group has recently forayed into the luxury boutique hospitality space and has partnered Mantis International (South Africa) for the Indian sub-continent.Mr. Premnarayen has led the Group’s foray into these diverse sectors. He continues to serve as the Executive Chairman of the Group and has had an illustrious career spanning 4 decades, with strong relationships across the Indian corporate sector.</p>\n\n<p>Apart from being on the board of the Group companies, Mr. Premnarayen is also on the board of</p>\n\n<ol>\n<li>FirstRand Limited, a leading banking and financial services group from South Africa listed on the Johannesburg Stock Exchange. He has been instrumental in establishing the India operations of FirstRand Bank.</li>\n<li>Triangle Real Estate India Fund LLC, a FDI compliant fund for India raised in conjunction with Old Mutual Property in South Africa. The fund is listed on Mauritius Stock Exchange.\nNoida Toll Bridge Co. Ltd. (listed in India &amp; AIMS in UK).</li>\n</ol>\n\n<p>His associations with other important committees are:</p>\n\n<p>Convener of India – South Africa CEO’s Forum (CII) &amp; the Co-Chair of National Committee Sports (CII).\nCII National Council and other CII committees such as:\n-Banking Committee\n-National Task Force on Financial Inclusion\n-Services Committee\nCouncil of Management of AIMA (All India Management Association) for 2011-2012\nMr. Premnarayen is a member of the Managing Committee of the IMC (Indian Merchants Chamber).</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Executive Chairman and founder of the ICS Group","firm":{"name":"ICS Group","permalink":"ics-group","type_of_entity":"company","image":{"available_sizes":[[[80,84],"assets/images/resized/0020/1636/201636v2-max-150x150.jpg"],[[80,84],"assets/images/resized/0020/1636/201636v2-max-250x250.jpg"],[[80,84],"assets/images/resized/0020/1636/201636v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}