{"first_name":"Deependra","last_name":"Chumble","permalink":"deependra-chumble","crunchbase_url":"http://www.crunchbase.com/person/deependra-chumble","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Hexaware Technologies","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri May 08 17:46:55 UTC 2009","updated_at":"Sun Sep 06 02:26:25 UTC 2009","overview":"<p>Deependra L. Chumble\nChief People Officer, Hexaware Technologies Ltd. </p>\n\n<p>Deependra brings with him a vast leadership and multi cultural experience of over 23 years in the Human Resources function with an in depth industry knowledge of Hotels, Banking, IT and ITES. In his career with different multinational and transnational companies, he has worked in different capacities and geographies in India and abroad handling complex and sensitive people issues. He has been an integral part of start ups on one hand and on the other, has worked with well established organizations with robust structures and processes. Organization team building and restructuring, Change Management, Aligning HR to Business, Culture building and HR metrics are some of the core strengths he has developed in his exposure as a member of senior management teams for over 18 years. He has managed large HR teams spread over different locations and has transformed the HR function to be an equivalent partner in business thus involved in all business related decision making processes.</p>\n\n<p>In the past, he has worked with companies like Indian Hotels, ANZ Grindlays, HSBC, eFunds, IT 20, Morgan Stanley and JP Morgan.</p>\n\n<p>Deependra, a Commerce graduate and an MBA from Pune is an avid reader and has keen interest in music, photography and spirituality. He prefers spending time with his family and his pets, whenever he is not travelling. Finally, he and his family have made Mumbai their home after living in almost a dozen cities in a span of over two decades.   </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief People Officer","firm":{"name":"Hexaware Technologies","permalink":"hexaware-technologies","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}