{"first_name":"Deepak","last_name":"Mohan, MD","permalink":"deepak-mohan","crunchbase_url":"http://www.crunchbase.com/person/deepak-mohan","homepage_url":"http://www.linkedin.com/in/drmohan","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Oct 13 00:13:53 UTC 2010","updated_at":"Wed Oct 05 07:07:48 UTC 2011","overview":"<p>Deepak Mohan, MD, is the Medical Director of Pathology and Laboratory Medicine &amp; Associate Professor in the Department of Medicine at San Joaquin General Hospital. </p>\n\n<p>Dr. Mohan&#8217;s research activities have included assessment of the clinical application of molecular genotyping from paraffin embedded tissue and assessment of immunohistochemical biomarkers in surgical pathology. This had lead to numerous publications in well known pathology journals: Archives of Pathology &amp; Laboratory Medicine, American Journal of Clinical Pathology, Human Pathology and Modern Pathology. He received the top five scientific abstract award at the CAP 2003 annual meeting, had two proffered platform presentations at the USCAP 2004 annual meeting and won the Pulmonary Pathology Societies best scientific presentation award. He was awarded the Abbott Training in Molecular Technology Award and the College of American Pathologists&#8217; Young Leader Award in 2004.</p>\n\n<p>The College of American Pathologists has selected Dr Mohan as their spokesperson, advocate and as a House of Delegates California state representative. Dr Mohan is a certified CAP Inspector and serves as team leader for numerous laboratory inspections.</p>\n\n<p>Board certified in anatomic and clinical pathology, Dr. Mohan has presented his research at various national meetings and has published numerous articles in peer-reviewed journals. He is actively involved with resident and medical student teaching. </p>\n\n<p>Dr. Mohan received his medical degree from the prestigious Madras (MGR) Medical University and performed visiting clerkships at Harvard University and University of California, Los Angeles hospitals. He completed his anatomic and clinical pathology residency at the University of Pittsburgh Medical Center; followed by surgical pathology fellowship training at Cedars-Sinai in Los Angeles. Dr. Mohan has served on the medical staff of Good Samaritan Hospital, Los Angeles and Little Company of Mary, Torrance &amp; San Pedro.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0010/5320/105320v2-max-150x150.jpg"],[[170,238],"assets/images/resized/0010/5320/105320v2-max-250x250.jpg"],[[170,238],"assets/images/resized/0010/5320/105320v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MD","subject":"Anatomic & Clinical Pathology","institution":"Univ Pittsburgh","graduated_year":2004,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/drmohan","title":"Linkedin"},{"external_url":"http://www.medpedia.com/users/9517","title":"Medpedia"}]}