{"first_name":"Deep","last_name":"Dhillon","permalink":"deep-dhillon","crunchbase_url":"http://www.crunchbase.com/person/deep-dhillon","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Evri","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jun 27 05:31:57 UTC 2008","updated_at":"Thu May 07 16:31:51 UTC 2009","overview":"<p>Deep Dhillon is an accomplished engineer and systems architect with extensive experience conceptualizing, architecting, and deploying multiple advanced networking applications. His areas of expertise include: Internet based search systems; object-oriented and knowledge-based systems, software architecture and audio based search systems.</p>\n\n<p>Before joining evri, Dhillon was Director of Engineering at Insightful Corporation, in the Text Analysis and Search business division. In this role, he led the development efforts for InFact, a large scale natural language-based enterprise text analysis platform and search engine. In the summer of 2007, Dhillon helped oversee incorporating InFact’s intellectual property, core team and technology into evri.</p>\n\n<p>Prior to Insightful, Dhillon was a founder and chief scientist at music search and identification company, Cantametrix. At Cantametrix, Dhillon led a team to build the original prototypes that led to the creation of the world&#8217;s first, large scale, fully automated, digital signal processing based music identification and classification system. This technology has evolved into <a href=\"http://www.crunchbase.com/company/gracenote\" title=\"Gracenote&#8217;s\">Gracenote&#8217;s</a> Music Id technology and is employed daily by millions of users in many diverse applications including Apple&#8217;s iTunes, Yahoo Music Engine and many other audio appliances.</p>\n\n<p>Before founding Cantametrix, Dhillon was a research engineer at Metapath Software International (which became GEC Marconi). Prior to that, Dhillon was a member of the technical staff at GTE Laboratories (now Verizon), in the Advanced Systems Laboratory, where he developed advanced interactive Internet prototypes and served as a consultant to GTE business units.</p>","image":null,"degrees":[{"degree_type":"BS","subject":"Electrical Engineering","institution":"Illinois Institute of Technology","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MS","subject":"Electrical Engineering","institution":"University of Wisconsin - Madison","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Chief Technology Officer","firm":{"name":"Evri","permalink":"evri","type_of_entity":"company","image":{"available_sizes":[[[150,84],"assets/images/resized/0001/9423/19423v1-max-150x150.jpg"],[[250,140],"assets/images/resized/0001/9423/19423v1-max-250x250.jpg"],[[255,143],"assets/images/resized/0001/9423/19423v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}