{"first_name":"Deepak","last_name":"Pareek","permalink":"deepak-pareek","crunchbase_url":"http://www.crunchbase.com/person/deepak-pareek","homepage_url":"http://www.deepakpareek.com","birthplace":"Ahmedabad","twitter_username":"pareekdeepak","blog_url":"","blog_feed_url":"","affiliation_name":"PRIQUITY","born_year":1977,"born_month":9,"born_day":7,"tag_list":"deepak-pareek, priquity, business-opportunity-spotting, technology-start-ups, venture-capital, private-equity, investment--hedge-funds, financial-analysis--modeling, internationalization--globalization, multi-cultural-fluency, fund-management, financial-r","alias_list":null,"created_at":"Wed Jul 27 05:40:06 UTC 2011","updated_at":"Wed Apr 04 04:25:44 UTC 2012","overview":"<p>Deepak has over 15 years of top management experience, and providing advisory at Chief Executive/Board level. He has proven ability to lead and manage multinational teams, operate at Chief Executive/Board levels along with experience of providing consulting to government agencies, multinational corporations, entrepreneurs, start-ups and investors globally. Especially strong network in BRICS (Brazil, Russia, India, China and South Africa), Middle East and the Asia Pacific region.\nDeepak provide comprehensive financial solutions to business enterprises which have a scalable and sustainable business model to enable them realize their full potential at global stage on one hand while he delivers excellent returns to his investors on the other. Having gained an intimate knowledge of the capital markets as a player, analyst, editor, corporate finance consultant and having been associated with funding, financial planning, financial restructuring, disinvestment and initial public offerings (IPOs) and the process of taking entrepreneurs/businesses from concept stage to public, in one way or the other, he brings to table substantial wealth of knowledge.\nDeepak has a strong network across the globe, comprising of Finance Professionals, CEOs, Bankers, Lawyers, Investment (Merchant) Bankers, Policy Makers, Regulators, Financial Market Intermediaries, Operators, PR &amp; Advertising Professionals, VCs &amp; PE Players, HNIs, Equity Research professionals, Journalists and other Strategic Advisors.\nDeepak is a low profile deal maker with exposure of handling many multi-billion dollar M&amp;A, Strategic Investment and Distress Funding Deals, particularly strong in Vision to Execution and Turn-Around scenarios.\nDeepak has leveraged his operational experience, extensive networks and forward-thinking vision to help start and build over 100 companies in fields such as software, semiconductors, mobile and cleantech. Companies supported by him curruntly are poised to become the next global leaders.\nSpecialties</p>\n\n<p>Business Opportunity Spotting, Technology Start-ups, Venture Capital, Private Equity, Investment &amp; Hedge Funds, Financial Analysis &amp; Modeling, Internationalization &amp; Globalization, Multi-Cultural Fluency, Fund Management, Financial Restructuring, Commercial Distress Investment, Technology Sector Investments, Stock Market &amp; Listing, Wealth Creation, Investment Life Cycle Management, Fund Management, Investment Strategy, Strategic Investments, Corporate Board Advisory, Deal Making, Due-Diligence,</p>","image":{"available_sizes":[[[150,147],"assets/images/resized/0014/6360/146360v2-max-150x150.png"],[[250,246],"assets/images/resized/0014/6360/146360v2-max-250x250.png"],[[446,439],"assets/images/resized/0014/6360/146360v2-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"Management","institution":"Regis University","graduated_year":1998,"graduated_month":null,"graduated_day":null},{"degree_type":"BE","subject":"Electronics Engg","institution":"SVNIT","graduated_year":1996,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Mentor & Author","firm":{"name":"HnyB Insights","permalink":"hnyb-insights","type_of_entity":"company","image":null}},{"is_past":true,"title":"Member, Board of Advisers","firm":{"name":"PRIQUITY","permalink":"priquity","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"<iframe width=\"450\" height=\"259\" src=\"http://www.youtube.com/embed/3qHkdl354ZA\" frameborder=\"0\" allowfullscreen></iframe>","description":"<p>About Deepak Pareek</p>"}],"external_links":[{"external_url":"http://www.amazon.com/Deepak-Pareek/e/B001HMROIG","title":"Amazon Author Profile"},{"external_url":"http://www.alacrawiki.com/index.php?title=Deepak_Pareek","title":"Alcara Wiki"}],"web_presences":[{"external_url":"http://www.deepakpareek.com","title":"Website"},{"external_url":"http://ae.linkedin.com/in/socialtechventures","title":"LinkedIn"},{"external_url":"https://twitter.com/pareekdeepak","title":"Twitter"},{"external_url":"https://www.facebook.com/pareek.deepak","title":"FaceBook"}]}