{"first_name":"deepak","last_name":"sharma","permalink":"deepak-sharma-3","crunchbase_url":"http://www.crunchbase.com/person/deepak-sharma-3","homepage_url":"http://in.linkedin.com/in/thedeepaksharma","birthplace":"india","twitter_username":"hrhead","blog_url":"http://hrhead.wordpress.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1966,"born_month":7,"born_day":1,"tag_list":"human, business, industry, hr, life, india","alias_list":null,"created_at":"Thu Dec 16 03:12:46 UTC 2010","updated_at":"Wed Nov 30 04:07:00 UTC 2011","overview":"<p>Deepak is internationally renowned CROSS functional GEN X HR Professional</p>\n\n<ul>\n<li>Rated in 2009 as one of the Most Influential HR Person by International HR Journal.</li>\n</ul>\n\n<p>He was placed in WHO is WHO at Corporate of Asia. -</p>\n\n<p>Having over 19+ years of Balanced Experience in Corporate HR &amp; Unit HR/IR Functions, Outstanding skills at handling multiple functions including Change Management, Organizational Development, Sales Force HR, Culture Building, Business Diagnostic Score Cards, Performance Management, Policies and Procedures, Training and Development, Organization Restructuring to core levels with a strong business and HR acumen.</p>\n\n<p>SKILLED at planning and organizing operations within private and public portfolio organizations with ease, handling the sectors, Manufacturing and other sectors like Services, Software / Technology, etc.</p>\n\n<p>HIGH value capacity resulting in Setting up HR functions, strong knowledge of HR, Law/s &amp; Regulations have churned into an experienced executive in human resources with capabilities to translate business strategies into innovative Human Resources initiatives that help organizations prepare for their future. \nSpecialtiesStrapping leadership, mentoring, communication, facilitation and coaching abilities teamed with adept interpersonal, effective Internal communication traits compose a sturdy and people managing leader. </p>\n\n<p>High value capacity resulting in strong knowledge of HR, laws &amp; regulations have churned into an experienced executive in human resources with capabilities to translate business strategies into innovative Human Resources initiatives that help organizations prepare for their future</p>","image":null,"degrees":[{"degree_type":"MBA","subject":"","institution":"IIM","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"IPM","graduated_year":1990,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}