{"first_name":"Demetri","last_name":"Argyropoulos","permalink":"demetri-argyropoulos-2","crunchbase_url":"http://www.crunchbase.com/person/demetri-argyropoulos-2","homepage_url":"http://primaworldwide.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Prima Worldwide","born_year":null,"born_month":null,"born_day":null,"tag_list":"prima-worldwide, introductions, facilitator, silicon-valley","alias_list":null,"created_at":"Sun Oct 21 02:47:59 UTC 2012","updated_at":"Wed Oct 31 00:38:27 UTC 2012","overview":"<p>In the role of Chief Executive Officer, Demetri&#8217;s principle responsibilities revolve around strategy, performance, implementation and corporate governance for Prima Worldwide.</p>\n\n<p>Demetri is highly regarded in the global business community for his proven track-record in building successful relationships. By establishing value, commonalities and rapport, Demetri creates an atmosphere of trust that enables relationships to flourish. Demetri also performs a vital role in helping to succinctly negotiate and close deals between parties.</p>\n\n<p>Since founding Prima Worldwide, Demetri has been involved in forging relationships creating transactions valued at about $8.1 billion, across a range of projects including introductions to ultra high-net worth individuals and family offices, venture capital groups, and financial institutions, introductions to merger and acquisition opportunities, divestitures of assets, and board of director placements. He has been the catalyst for these deals to come to fruition.</p>\n\n<p>Through Demetri’s direct involvement, Prima has evolved into the three operational entities with the company successfully originating, co-founding, or being involved at seed level in over 36 companies in the last 7 years, across a variety of industries ranging from medical devices to internet advertising. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO, Founder","firm":{"name":"Prima Worldwide","permalink":"prima-worldwide","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}