{"first_name":"Denim","last_name":"Smith","permalink":"denim-smith","crunchbase_url":"http://www.crunchbase.com/person/denim-smith","homepage_url":"","birthplace":"Toronto","twitter_username":"denimsmith","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Mar 23 16:31:51 UTC 2011","updated_at":"Wed Mar 30 22:08:50 UTC 2011","overview":"<p>Denim Smith is the Founder and CEO of My Internet Corporation.</p>\n\n<p>Denim started his career in Toronto, Canada on the trading floor of Canada’s largest investment bank as a fixed income derivatives credit risk compliance officer. From there Denim joined the Corporate Banking Group focusing on corporate credit, derivative and foreign exchange facilities and servicing the credit needs of public and private clients in the North American real estate and diversified industries. During his time in Corporate Banking, Denim was involved\nin arranging and structuring over C$500 million and over USD$500 million of credit and related facilities for his domestic and cross-border clients. Denim then went on to join the firm’s inaugural US Real Estate Investment Banking Group in Boston in 2003 where he was involved with over US$1.3 Billion of capital markets transactions.</p>\n\n<p>Denim then helped form the Capital Markets Real Estate Group of a large regional US bank-owned dealer with a partner in Boston in 2005 where they were involved with over US$3.5 Billion of capital markets transactions and US$600 million of successful sell-side advisory mandates. Denim then moved home to Toronto to marry and was most recently the Vice President of a Canadian independent investment bank’s real estate investment banking practice where he was involved with over $300 million of capital markets transactions and over $3 billion of advisory and valuation mandates. Denim helped to quickly propel the firm to the top of the equity league tables in 2007 and 2008 for raising capital for real estate issuers with a market value under $250 million by successfully creating and structuring three TSX-V real estate IPO’s. Denim currently sits on the board of directors of GT Canada Medical Properties REIT (TSX-V: MOB.un), Canada&#8217;s first publicly traded medical office building company.</p>\n\n<p>Denim founded My Internet Corporation (‘mi’) in 2009 with a focus on bringing the power of the internet back to the people and is currently launching the company’s first product offering, mi Lifemap, a dynamic and interactive web application.</p>\n\n<p>Denim is a graduate of the University of Western Ontario in London, Canada, is a licensed representative, and has completed his CFA Level 2 Exam. He is married and has a one year-old daughter.</p>","image":{"available_sizes":[[[150,102],"assets/images/resized/0012/7456/127456v2-max-150x150.jpg"],[[250,170],"assets/images/resized/0012/7456/127456v2-max-250x250.jpg"],[[450,306],"assets/images/resized/0012/7456/127456v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder & Chief Executive Officer","firm":{"name":"My Internet Corporation ('mi')","permalink":"my-internet-corporation-mi","type_of_entity":"company","image":{"available_sizes":[[[150,115],"assets/images/resized/0013/4038/134038v2-max-150x150.jpg"],[[250,193],"assets/images/resized/0013/4038/134038v2-max-250x250.jpg"],[[450,347],"assets/images/resized/0013/4038/134038v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}