{"first_name":"Dennis","last_name":"R. Costello","permalink":"dennis-r-costello","crunchbase_url":"http://www.crunchbase.com/person/dennis-r-costello","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jan 10 12:25:34 UTC 2009","updated_at":"Wed Jun 03 11:21:14 UTC 2009","overview":"<p>Dennis R. Costello has more than 30 years of experience in the energy and venture capital industries. Mr. Costello was previously a partner with Advent International, an international private equity firm where he rose to be Chief Investment Officer for North America. He was personally responsible for 23 investments, 10 of which were in the energy area. Mr. Costello was also a managing director in Rock Maple Ventures an early stage technology venture fund in Boston and started in the venture capital industry as a general partner of Zero Stage Capital of Pennsylvania. Before embarking on a career in venture capital, Mr. Costello was the first Executive Director of the Colorado Advanced Technology Institute (&#8220;CATI&#8221;) in Denver, Colorado. Mr. Costello began his career in alternative energy, with positions as a project manager at Midwest Research Institute and a member of the original staff of the National Solar Energy Research Institute (&#8220;SERI&#8221;), which is now the National Renewable energy Laboratory (NREL). During that period, Mr. Costello published numerous papers and articles on the economic and market issues of solar energy commercialization. He is also the author of the Dow-Jones Irwin book, New Venture Analysis: Research, Planning and Finance and served on the Board of Directors of the New England Venture Capital Association from 1997-1999. He was a founder and Chairman of the MIT Enterprise Forum of Colorado and he remains active with the national MIT Enterprise Forum. Mr. Costello holds a Master of Science degree in business from the Massachusetts Institute of Technology, where he was an Alfred P. Sloan Fellow. He also holds a M.A. in economics from Ohio State University and a B.A. in economics from the State University of New York (SUNY), College at Fredonia. </p>","image":null,"degrees":[{"degree_type":"Master of Science","subject":"Business","institution":"Massachusetts Institute of Technology","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Braemar Energy Ventures","permalink":"braemar-energy-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,34],"assets/images/resized/0005/1049/51049v1-max-150x150.png"],[[250,57],"assets/images/resized/0005/1049/51049v1-max-250x250.png"],[[262,60],"assets/images/resized/0005/1049/51049v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}