{"first_name":"Dennis","last_name":"Bucko","permalink":"dennis-bucko","crunchbase_url":"http://www.crunchbase.com/person/dennis-bucko","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Aug 11 07:00:50 UTC 2012","updated_at":"Mon Aug 13 01:50:32 UTC 2012","overview":"<p>Dennis Bucko is a respected and reliable plastic surgeon whose practice is based in San Diego, CA. He has performed numerous surgeries over a long and continuing 25-year career. The trend in popularity of plastic surgery has afforded him a great number of patients. Many different people are learning that cosmetic and reconstructive surgery is available on small scales. Dennis Bucko has since had the opportunity to help victims with severe injuries, as well as cancer patients and survivors. </p>\n\n<p>Dennis Bucko trained in several schools, but primarily at the University of Michigan for plastic surgery. Thereafter, he stayed at UM with an assistant professor position. But in 1981, he took his training westward to start his own practice. He still serves on several academic boards across the country. </p>\n\n<p>The practice Dennis Bucko founded specializes in cosmetic and reconstructive surgery. He never compromises the use of the latest technology and information available. Especially with the consistent advancements in cancer treatments, Dr. Bucko finds his practice always evolving. He doesn’t just perform face and neck lifts, or breast augmentations and wrinkle solutions. His discipline now involves mastectomies and other reconstructive procedures for people who have undergone chemotherapy.</p>\n\n<p>Dennis Bucko took to sculpting in medical school, which has had indubitable positive repercussions. This interest gave him aesthetic and artistic sensibilities rarely found among medical practitioners. It taught him about three-dimensional design and form. His manual dexterity benefitted directly, for he learned new and specific ways to use his hands. </p>\n\n<p>Currently, Dennis Bucko continues to enhance and restore patients’ appearances. Since surgery is always a commitment, he is also writing a guide for people thinking about plastic surgery. His specialization in cosmetics and reconstruction has given him an unparalleled breadth of experience. Dennis Bucko possesses rare qualities for a plastic surgeon, and exudes a profound professionalism in turn. </p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/5567/205567v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/5567/205567v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/5567/205567v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}