{"first_name":"Dennis","last_name":"Miloseski","permalink":"dennis-miloseski-2","crunchbase_url":"http://www.crunchbase.com/person/dennis-miloseski-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Milobox","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Sep 04 03:19:24 UTC 2008","updated_at":"Sun Sep 07 23:15:20 UTC 2008","overview":"<p>Born in Detroit, Michigan - Dennis studied computer science and hci at Carnegie Mellon University and interactive media and visual design at the Art Institute of Pittsburgh.</p>\n\n<p>His accumulated design experience incorporates a wide range of projects. As a creative and design director he’s lead graphic design and user experience teams bringing expertise in visual communication, interactive, web, print, and exhibition design.</p>\n\n<p>He currently hold a position of Design and User Experience Mgr. at Google, Inc. where he leads and manages design teams responsible for application design at Google.</p>\n\n<p>Prior to Google, he directed and lead design efforts in brand identity, interactive design, and user experience for DivX, Inc. and it’s fortune 100 partner initiatives. His work and design campaigns have been exhibited online and in retail environments worldwide. Some recent campaigns include work for Philips, LG, Sony, and Casio Electronics.</p>\n\n<p>Prior to DivX, he served as Director of User Experience at General Electric, Healthcare Solutions where he was the design and user experience principal for the business. During his tenure at GE, he planned, directed, and established all user interface, user experience, and usability initiatives for GE Medical Systems. During the ‘Imagination at Work’ re-brand, his contributions were instrumental in establishing the new brand identity in print, web, and interactive media for the medical systems division.</p>\n\n<p>In previous positions and consultancies, he’s worked in many environments. His extensive book of work includes designs for GE, Sony Electronics, America Online, Netscape, and a number of technology start-ups.</p>\n\n<p>Dennis currently resides in San Francisco, CA with his wife Joanne, daughter Adriana, and dog Basil.</p>","image":null,"degrees":[{"degree_type":"B.S.","subject":"C.S.","institution":"Carnegie Mellon University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"A.S","subject":"Design & Multimedia","institution":"Art Institute of Pittsburgh","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder & CEO","firm":{"name":"Milobox","permalink":"milobox","type_of_entity":"company","image":{"available_sizes":[[[140,33],"assets/images/resized/0002/4554/24554v2-max-150x150.png"],[[140,33],"assets/images/resized/0002/4554/24554v2-max-250x250.png"],[[140,33],"assets/images/resized/0002/4554/24554v2-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Sr. UI Architect","firm":{"name":"Intraware","permalink":"intraware","type_of_entity":"company","image":null}},{"is_past":true,"title":"Design Consultant","firm":{"name":"Fortune 500","permalink":"fortune-500","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}