{"first_name":"Dennis","last_name":"E. Murphree","permalink":"dennis-e-murphree","crunchbase_url":"http://www.crunchbase.com/person/dennis-e-murphree","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jun 03 12:28:02 UTC 2009","updated_at":"Wed Jun 03 12:32:36 UTC 2009","overview":"<p>Dennis is the President and CEO of Murphree and Company, Inc. and Managing General Partner of the Murphree Venture Partner Funds. He was educated at Southern Methodist University (B.A. 1969) and The Wharton School (M.B A. 1971). He is also on the faculty of the Jones Graduate School at Rice University where he teaches two second-year M.B.A. courses in creative entrepreneurship and venture capital.</p>\n\n<p>Dennis&#8217; entrepreneurial career began in 1972 when he started his own real estate development company. By 1985, that company was the eleventh largest developer in the U.S. and had offices in twelve cities throughout the Sunbelt .</p>\n\n<p>In 1975, Dennis and a partner put together a group to charter The Commonwealth Bank, located in Houston . Two years later he started the Vail National Bank in Vail, Colorado . This was followed by participation in control groups which bought or started eleven commercial banks throughout Texas and Colorado . In 1986, Dennis sold his real estate firm and then founded Murphree Venture Partners in January 1987.</p>\n\n<p>Many other ventures were put together during these years in a wide variety of industries from restaurants to high tech to construction. Dennis also served on numerous public and private corporate Boards as well as civic, charitable and educational Boards such as: Southern Methodist University; Houston Chamber of Commerce; Greater Houston Partnership; Sadat Peace Foundation; Johns Hopkins School of Advanced International Studies; American Ballet Theatre; The Children&#8217;s Fund; The Texas Institute of Family Psychiatry, the British-American Project, CanCare, Association for Community Broadcasting and the Space Center of Houston.</p>\n\n<p>Currently, he is a Board member of MedServe Inc., Unico Corporation, and Infrastruct Security Inc., and has been a member of the Young Presidents&#8217; Organization and World Presidents&#8217; Organization since 1982. He is also a nationally recognized public speaker and gives 30 to 40 speeches per year throughout the United States on both business and motivational topics. </p>","image":{"available_sizes":[[[101,135],"assets/images/resized/0004/6482/46482v1-max-150x150.jpg"],[[101,135],"assets/images/resized/0004/6482/46482v1-max-250x250.jpg"],[[101,135],"assets/images/resized/0004/6482/46482v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"M.B A.","subject":"","institution":"The Wharton School","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Murphree Venture Partners","permalink":"murphree-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[77,71],"assets/images/resized/0004/6481/46481v1-max-150x150.jpg"],[[77,71],"assets/images/resized/0004/6481/46481v1-max-250x250.jpg"],[[77,71],"assets/images/resized/0004/6481/46481v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}