{"first_name":"Dennis","last_name":"W Shuler","permalink":"dennis-w-shuler","crunchbase_url":"http://www.crunchbase.com/person/dennis-w-shuler","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 21 02:33:58 UTC 2008","updated_at":"Wed May 21 02:41:38 UTC 2008","overview":"<p>Dennis Shuler was named Executive Vice President and Chief Human Resources Officer in April 2008. Shuler is responsible for leading Disney&#8217;s global human resources organization including strategy development, talent attraction, staffing and retention, leadership development, diversity, organizational design and cultural development, employee education and development, compensation and benefits and employee relations.</p>\n\n<p>Prior to joining Disney, Mr. Shuler spent 23 years with the Procter and Gamble Company in the United States and the United Kingdom. His last assignment was as Vice-President of the P&amp;G Beauty and Health &amp; Well Being global business units. In that capacity, he was responsible for providing strategic human resources direction including acquisition and divestiture planning, talent sourcing, leadership identification, development and planning, diversity and employee and labor relations. In particular, he played a significant leadership role in P&amp;G&#8217;s acquisition of the Clairol, Wella and Gillette companies and the creation of the new Folgers&#8217;s Coffee Company.</p>\n\n<p>Mr. Shuler is active in the community having previously served as Board member, College of Mt. St. Joseph in Cincinnati, Ohio and Visiting Professor of Business Administration at Northumbria University in Newcastle, England. He presently serves on three University Boards: The University of Alabama&#8217;s Board of Visitors at Tuscaloosa, Alabama; Xavier University&#8217;s Williams College of Business in Cincinnati, Ohio; and Visiting Professor and Advisory Board member of Durham University in Durham, United Kingdom. He is also a Fellow, Royal Society of Arts in London, England. Mr. Shuler has also played an active role in Junior Achievement, the Greater Cincinnati Fine Arts Fund and a contributor to the diabetes research program at the Cincinnati Children&#8217;s Hospital.</p>\n\n<p>Mr. Shuler is a native of Cayuga, New York and holds a Bachelor of Science degree in Business Administration from the State University of New York at Oswego where he graduated magna cum laude and a Master of Arts in Human Resources Management from the University of Alabama where he graduated summa cum laude. The University of Alabama local Beta Gamma Sigma Chapter recently recognized him as the 2007 distinguished alumni.</p>\n\n<p>He is based in Burbank and is married with two sons.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Executive Vice President, and Chief Human Resources Officer, The Walt Disney Company","firm":{"name":"The Walt Disney Company","permalink":"the-walt-disney-company","type_of_entity":"company","image":{"available_sizes":[[[150,73],"assets/images/resized/0001/0929/10929v1-max-150x150.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-250x250.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}