{"first_name":"Dennis","last_name":"Rhee","permalink":"dennis-rhee","crunchbase_url":"http://www.crunchbase.com/person/dennis-rhee","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"CoRise","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jan 09 19:12:15 UTC 2012","updated_at":"Sat Feb 04 19:57:30 UTC 2012","overview":"<p>Dennis is a seasoned capital markets executive with more than two decades of experience in roles including management, sales and trading, structuring, portfolio and risk management, and the design of trading systems. Dennis’s credentials include leadership positions at bulge bracket institutions and hedge funds.</p>\n\n<p>After completing his graduate business degree in 1992, Dennis joined Goldman, Sachs &amp; Co. in New York as a fixed income derivatives specialist. At Goldman, Dennis structured and sold complex derivative products to major U.S. buy side institutions, including hedge funds. Dennis later served as Head of Goldman’s Korea fixed income operations. </p>\n\n<p>After leaving Goldman in 1996, Dennis and an ex-Goldman colleague created Asia’s very first hedge fund that invested in relative value fixed income strategies. Subsequently, Dennis joined the MBS-TBA trading efforts of Deutsche Bank in New York, where in 1997 he became head of mortgage-backed securities trading at Pedestal, the electronic trading startup that Deutsche Bank sponsored together with Reuters. </p>\n\n<p>Most recently, Dennis was the Co-Founder and is currently a Managing Member of Treesdale Partners, a New York based hedge fund, money management, and trading platform focused on special opportunities in the fixed income and other capital markets. </p>\n\n<p>Dennis serves on Cornell University’s Dyson School of Applied Economics and Management’s Undergraduate Program Advisory Council. He received his M.B.A. in Finance from the University of Chicago’s Graduate School of Business and a B.A. in Government from Cornell University’s College of Arts and Sciences.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0017/2708/172708v2-max-150x150.jpg"],[[168,126],"assets/images/resized/0017/2708/172708v2-max-250x250.jpg"],[[168,126],"assets/images/resized/0017/2708/172708v2-max-450x450.jpg"]],"attribution":"<p>Dennis Rhee CoRise</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Senior Advisor, Capital Markets","firm":{"name":"CoRise","permalink":"corise","type_of_entity":"company","image":{"available_sizes":[[[150,41],"assets/images/resized/0016/9405/169405v2-max-150x150.jpg"],[[179,50],"assets/images/resized/0016/9405/169405v2-max-250x250.jpg"],[[179,50],"assets/images/resized/0016/9405/169405v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}