{"first_name":"Derek","last_name":"K. Rapp","permalink":"derek-k-rapp","crunchbase_url":"http://www.crunchbase.com/person/derek-k-rapp","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 19 19:47:27 UTC 2009","updated_at":"Fri Jun 19 19:48:01 UTC 2009","overview":"<p>Mr. Rapp joined Divergence in January, 2001 after more than twelve years with the Monsanto Company in St. Louis. At Divergence, he has responsibility for strategic planning, financing, business operations, and the formation of alliances. At Monsanto, Mr. Rapp served as Director of Mergers &amp; Acquisitions; Director of Investor Relations; Director of Commercial Partnership &amp; Alliances for the Ceregen business unit; and Director of Strategic Planning within the agricultural group. He led several major acquisitions and licensing transactions in the plant biotechnology area and the completion of a $2 billion divestiture program. He has an M.B.A. from The Wharton School, University of Pennsylvania with concentrations in Finance and Corporate Management, and he has a B.A. from Brown University. He also has investment banking experience, having worked for two years for Lazard Frères &amp; Co. in New York. Mr. Rapp is the founder of the non-profit organization St. Louis Cares, Chairman of the Board of the Greater St. Louis Community Foundation, and a board member of the Missouri Biotechnology Industry Association, the St. Louis Life Sciences Project, and the St. Louis Regional Chamber and Growth Association (RCGA). Mr. Rapp is the Chairman of the Friends&#8217; Committee of the Donald Danforth Plant Science Center. He is a member of the Lay Review Committee and the Research Development Committee of the Juvenile Diabetes Research Foundation.</p>","image":{"available_sizes":[[[73,108],"assets/images/resized/0004/9708/49708v1-max-150x150.jpg"],[[73,108],"assets/images/resized/0004/9708/49708v1-max-250x250.jpg"],[[73,108],"assets/images/resized/0004/9708/49708v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Divergence","permalink":"divergence","type_of_entity":"company","image":{"available_sizes":[[[150,33],"assets/images/resized/0004/9707/49707v1-max-150x150.png"],[[250,55],"assets/images/resized/0004/9707/49707v1-max-250x250.png"],[[259,58],"assets/images/resized/0004/9707/49707v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}