{"first_name":"Derek","last_name":"Norton","permalink":"derek-norton","crunchbase_url":"http://www.crunchbase.com/person/derek-norton","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Watertower Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Mar 08 21:31:16 UTC 2010","updated_at":"Tue Aug 24 21:51:42 UTC 2010","overview":"<p>Derek Norton is a serial entrepreneur and venture capitalist with over 20 years of business building, operational, and investing experience in the technology, internet and digital media industries.  Derek is the founder and Managing Partner of Watertower Group, an industry leading boutique investment bank, and the Managing General Partner of the Watertower Early Opportunity Fund, a seed and early stage venture capital fund.  Prior to founding Watertower Group Derek was with Entertainment Media Ventures, a Michael Milken backed seed and early stage venture capital fund located in Los Angeles, California.  Derek spent the first half of his career as an entrepreneur, founding and building two prominent southern California based internet technology companies.  </p>\n\n<p>Prior to founding Watertower Group Derek was an investment professional at Entertainment Media Ventures, a $120 million dollar seed and early stage venture capital fund focused on investments in broadband infrastructure, consumer internet and digital media sectors.  Having lead investments in Kassena, Matchcraft and Relegence, amongst others, Derek helped guide and support EMV portfolio companies with their growth, business initiatives and capitalization strategies.</p>\n\n<p>Prior to Entertainment Media Ventures, Derek spent the first ten years of his career as an internet technology entrepreneur.  Having founded both Jeffries Technologies and Digital Boardwalk, where he developed a diversified background in technology, internet, media, business building and operational leadership.  From 1991 until 1998, Derek helped build Jeffries into one of Inc. Magazine’s 500 fastest growing privately held U.S. companies providing network enterprise architecture and systems integration to Global 2000 businesses.  </p>\n\n<p>In 1995, he founded Digital Boardwalk, a provider of web based service solutions to traditional businesses and new-media digital business ventures.  As Netscape’s second commercial partner, Digital Boardwalk was a pioneer in the provisioning of internet technologies, e-commerce development, and marketing solutions to a wide range of companies and industries.  Clients included CBS SporstLine, eToys, Office Max, Hughes Global Services, News Corp, and Hewlett Packard.</p>\n\n<p>Derek holds a BA in Communications from the University of Southern California.  He is a frequent speaker and panelist on the subjects of technology, consumer internet and venture capital.  He serves on several corporate boards, and is an advisor to numerous startups.  Derek is the founder of Connex, an ongoing event for entrepreneurs, investors and senior executives.  He supports charities focused on improving the lives and education of under privileged youths, is a past member of the board of directors of The Fulfillment Fund, and was previously Vice President of the Los Angeles Museum of Contemporary Art, Contemporaries.</p>","image":{"available_sizes":[[[150,147],"assets/images/resized/0008/2043/82043v4-max-150x150.png"],[[250,246],"assets/images/resized/0008/2043/82043v4-max-250x250.png"],[[450,442],"assets/images/resized/0008/2043/82043v4-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"Communications","institution":"University of Southern California ","graduated_year":1987,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Partner","firm":{"name":"Watertower Group","permalink":"watertower-group","type_of_entity":"financial_org","image":{"available_sizes":[[[150,28],"assets/images/resized/0008/1979/81979v2-max-150x150.jpg"],[[250,46],"assets/images/resized/0008/1979/81979v2-max-250x250.jpg"],[[450,84],"assets/images/resized/0008/1979/81979v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/dereknorton","title":"linkedin"},{"external_url":"http://www.dereknorton.com","title":"Personal Site"},{"external_url":"http://www.watertowergroup.com","title":"Watertower Group Site"}]}