{"first_name":"Derril","last_name":"Reeves","permalink":"derril-reeves","crunchbase_url":"http://www.crunchbase.com/person/derril-reeves","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Feb 20 12:56:21 UTC 2011","updated_at":"Sun Feb 20 12:59:12 UTC 2011","overview":"<p>Derril holds responsibility for the growth and development of BreatheAmerica. Derril started his healthcare career with Hospital Affiliates, Inc. as the Director of Development. Hospital Affiliates was one of the very early companies in the hospital ownership and management sector. Derril was responsible for the development of contracts with local municipalities for the development and management of not-for-profit hospitals. Derril then joined Hospital Corporation of America as Vice President of Development for HCA Management Company, a new hospital management subsidiary where he led the growth of that company from 6 to 185 hospitals under management. When HCA moved into the managed care business, Derril then moved to HCA&#8217;s new divisions, HCA Health Plans, where he served as Vice President of Marketing and Development. Derril later helped HCA merge HCA Health Plans into a joint venture with Equitable Life Assurance Society of America to form Equicor, a new company generating annual revenues in excess of $2 billion and where he served as Senior Vice President of National Sales. Following the emergence of Equicor, Derril joined Joe Hutts in the founding of Phycor, a private practice management company which achieved revenues up to $1.5 billion. Derril serviced as the Chief Development Officer where, under his guidance, the company grew to 55 multispecialty clinics with over 3,900 physicians, 35 Independent Practice Associations with another 19,000 physicians and a disease management company. Later, Derril co-Founded Surgis, Inc., an outpatient surgery center company where he served as Executive Vice President of Development and quickly grew the company into the largest privately held company in its sector. It was after the sale of Surgis that BreatheAmerica was formed.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0012/3029/123029v1-max-150x150.jpg"],[[200,250],"assets/images/resized/0012/3029/123029v1-max-250x250.jpg"],[[200,250],"assets/images/resized/0012/3029/123029v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"EXECUTIVE VICE PRESIDENT OF DEVELOPMENT","firm":{"name":"BreatheAmerica","permalink":"breathe-america","type_of_entity":"company","image":{"available_sizes":[[[150,24],"assets/images/resized/0012/3024/123024v1-max-150x150.png"],[[250,40],"assets/images/resized/0012/3024/123024v1-max-250x250.png"],[[343,55],"assets/images/resized/0012/3024/123024v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}