{"first_name":"Devesh","last_name":"Garg","permalink":"devesh-garg","crunchbase_url":"http://www.crunchbase.com/person/devesh-garg","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Nov 30 23:41:08 UTC 2009","updated_at":"Mon Nov 30 23:43:13 UTC 2009","overview":"<p>Devesh Garg is a Managing Director of BVP India, based in Mumbai. He serves on the Board of Directors of NetAmbit and Sunil Hitech (BSE:SUNILHITEC.BO). He joined BVP’s Menlo Park office in 2003 as an Operating Partner advising and managing portfolio companies.</p>\n\n<p>With more than 20 years’ experience in high technology, Devesh has invested in, advised, and managed companies across all sizes and stages of development from pre-revenue to worldwide operations. Most recently, he served as the founding President and CEO of Tilera, a multi-core semiconductor company, which he took from its incubation at Bessemer’s office through its outsider-led, over-subscribed B-round and product release. Now a leading provider of embedded processors and software for the networking, video, and wireless markets, Tilera was named the &#8220;Start-Up to Watch&#8221; by the Global Semiconductor Alliance (GSA) in 2008.  Devesh was also involved in  advising BVP’s investments in Avnera, Berkeley Design Automation, K2 Optronics (acquired by Emcore), and PA Semi (acquired by Apple Computer). He has made a number of personal investments in real estate, as well as in retail and Internet companies.</p>\n\n<p>Before he came to BVP, Devesh was General Manager of the Security Business Unit at Broadcom (NASDAQ:BRCM), where he was part of the pre-IPO team and established the offices in Northern California. With executive management responsibilities for technical sales and field application engineering, he led his division to $450 million in revenues as the company grew from a start-up to its current market capitalization of approximately $20 billion.</p>\n\n<p>Previously, Devesh led the sales team at Synopsys, and served in engineering and managerial positions at LSI Logic, National Semiconductor, Bechtel, and Raychem. He holds a B.S.E.E. from San Jose State University and an M.B.A. from Santa Clara University. Devesh resides in Mumbai and is a charter member of  TiE.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Partner","firm":{"name":"Bessemer Venture Partners","permalink":"bessemer-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,39],"assets/images/resized/0001/3853/13853v1-max-150x150.png"],[[250,65],"assets/images/resized/0001/3853/13853v1-max-250x250.png"],[[284,74],"assets/images/resized/0001/3853/13853v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}