{"first_name":"Devra","last_name":"Davis","permalink":"devra-davis","crunchbase_url":"http://www.crunchbase.com/person/devra-davis","homepage_url":"","birthplace":"","twitter_username":"DevraLeeDavis","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Tue Nov 29 01:02:36 UTC 2011","updated_at":"Tue Nov 29 01:03:51 UTC 2011","overview":"<p>Designated a National Book Award Finalist for When Smoke Ran Like Water (2002, Basic Books), Devra Davis founded Environmental Health Trust in 2007 in Teton County, Wyoming to provide basic research and education about environmental health hazards and promote constructive policies locally, nationally and internationally.  Dr. Davis lectures at Georgetown, Harvard, London School of Hygiene and Tropical Medicine and other universities, and was Founding Director, Center for Environmental Oncology, University of Pittsburgh Cancer Institute, and Professor of Epidemiology at the Graduate School of Public Health (2004-2009).  The Secret History of the War on Cancer was a top pick by Newsweek, is forming the basis for national cancer policy revisions by the South African Cancer Society, and is being used at major schools of public health, including Harvard, Emory, and Tulane University.   Dr. Davis also was the founding director of the Board on Environmental Studies and Toxicology of the U.S. National Research Council, National Academy of Sciences and Scholar in Residence, 1983-1993.  Her new book, Disconnect,  selected by TIME magazine as a top pick, provides shocking detail about cell phone radiation and your health, is receiving kudos from experts and policy makers around the world, and is the subject of broad multi-media coverage.</p>\n\n<p>Her career has spanned all areas of academia, public policy, and scientific research.  President Clinton appointed the Honorable Dr. Davis to the newly established Chemical Safety and Hazard Investigation Board, (1994-99) an independent executive branch agency that investigates, prevents, and mitigates chemical accidents. As the former Senior Advisor to the Assistant Secretary for Health in the Department of Health and Human Services, she has counseled leading officials in the United States, United Nations, European Environment Agency, Pan American Health Organization, World Health Organization, and World Bank and served as a member of the Board of Scientific Counselors of the U.S. National Toxicology Program, 1983-86.</p>\n\n<p>She also served as a Lead Author of the Intergovernmental Panel on Climate Change—the group awarded the Nobel Peace Prize in 2007 with the Honorable Al Gore.  </p>\n\n<p>Dr. Davis holds a B.S. in physiological psychology and a M.A. in sociology from the University of Pittsburgh, 1967. She completed a Ph.D. in science studies at the University of Chicago as a Danforth Foundation Graduate Fellow, 1972  and a M.P.H. in epidemiology at the Johns Hopkins University as a Senior National Cancer Institute Post-Doctoral Fellow, 1982.  She has also authored more than 190 publications in books and journals ranging from the Lancet and Journal of the American Medical Association to Scientific American and the New York Times and blogs in Freakonomics for the New York Times, Huffington Post and elsewhere.</p>\n\n<p>Honored for her research and public policy work by various national and international groups, she has been a Fellow of both the American Colleges of Toxicology and of Epidemiology.  She was honored by the Betty Ford Comprehensive Cancer Center and the American Cancer Society with the Breast Cancer Awareness Award, commended by the Director of the National Cancer Institute for Outstanding Service, and appointed a Global Environmental advisor to Newsweek Magazine.</p>\n\n<p>The recipient of a Women’s Leadership Exchange Compass Award, presented by OPEN:  The Small Business Network from American Express, for breaking the paradigms of how women are perceived, Dr. Davis received the first Lisa Zhang Environmental Award from the United Nations in July 2008.  In June 2009, Dr. Davis was honored with the Artemis Award presented by the Euro-American Women&#8217;s Council and the Greek Foreign Ministry in recognition of her outstanding contributions to science and public health policy.  She occasionally discusses avoidable environmental health hazards  on national and local programming with NPR, Fox News, CNN, ABC, PBS, BBC.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0016/4327/164327v1-max-150x150.jpg"],[[167,250],"assets/images/resized/0016/4327/164327v1-max-250x250.jpg"],[[301,450],"assets/images/resized/0016/4327/164327v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MA","subject":"Sociology","institution":"University of Pittsburgh","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}