{"first_name":"Dhiresh","last_name":"Kamodia","permalink":"dhiresh-kamodia","crunchbase_url":"http://www.crunchbase.com/person/dhiresh-kamodia","homepage_url":"http://www.newindiatrading.co.in/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"electrical-equipment, energy-meters, electrical-equipment-india, energy-meters-india, electrical-equipment-supplier, energy-meters-exporter, electrical-products-trader, meters-supplier, switch-gears-exporter, circuit-breakers-trader, electrical-conduits-s","alias_list":null,"created_at":"Tue Apr 17 10:44:25 UTC 2012","updated_at":"Sun Apr 22 07:23:08 UTC 2012","overview":"<p>New India Trading Corporation</p>\n\n<p>Set up in 1920, New India Trading Corporation is one of the leading trading house headed by Mr. Dhiresh Kamodia and Mr Hitesh Kamodia. We are authorized dealers for manufacturers like Havells, HPL Socomec, Western, Jaipur Maxwell, Genus, Elymer, Polycab and Esco. We supply our wide range to various contractors, panel builders, OEMs, Retail Shops, Architects, Interior Designers and Builders. Our clients are spread in various countries such as India, Bangladesh, Dubai, UAE and Malaysia. Our success story can be reflected in our sales figure of Rs 1 to 5 crore. We are equipped with excellent warehousing facilities which enable us to fulfill the bulk requirements of the clients. Our highly qualified team of procuring agents ensures that they procure the best quality products for our clients from our esteemed vendors. Moreover, we test our products and equipments on various parameters before supplying them to the clients. </p>\n\n<p>Our wide range of electrical products and equipments like luminaries, industrial plug sockets, nylon cable ties, pg metal glands etc. are being supplied to various reputed contractors, panel builders, OEMs, Retail Shops, Architects, Interior Designers and Builders. These are procured from various top manufacturers such as Havells, HPL Socomec, Western, Jaipur Maxwell, Genus, Elymer, Polycab and Esco. Our wide range encompasses of the following:</p>\n\n<p>Electronic Meters</p>\n\n<pre><code>Trivector Meters\n\nStatic Energy Meters\n\nAmmeter Voltmeter\n\nPanel Meter\n</code></pre>\n\n<p>To survive and succeed in this highly competitive business environment, it is important to maintain high quality standards. We emphasize to make the quality of our range of products unparalleled. Our quality paradigm operates under the following objective:</p>\n\n<pre><code>To provide the flawless range of products\n\nTo meet the industrial standards\n\nComplete client satisfaction\n</code></pre>\n\n<p>Telephone:+(91)-(22)-22082454 </p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0018/4616/184616v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0018/4616/184616v2-max-250x250.jpg"],[[250,250],"assets/images/resized/0018/4616/184616v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}