{"first_name":"Diala","last_name":"Bank","permalink":"diala-bank-3","crunchbase_url":"http://www.crunchbase.com/person/diala-bank-3","homepage_url":"http://www.dialabank.com/","birthplace":"","twitter_username":"","blog_url":"http://www.dialabank.com/article.cfm/articleid/1550","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"personal-loan-bangalore, personal-loan","alias_list":null,"created_at":"Sat Apr 14 12:28:09 UTC 2012","updated_at":"Thu Apr 19 01:15:10 UTC 2012","overview":"<p>The Indian economy is growing rapidly these days. This rapidity has been accomplished because of the highly available funds and loans from various sources; one of the mostly preferred sources is through banks. When we talk about loans or credit from banks, we get enough information about the different types of loans that are made available to us for future benefits. Advanced loans include educational loans, Personal Loans, gold loans, mortgage loans, automobile loans, and personal loan bangalore.</p>\n\n<p>Although, the most preferred loans for general customer is either gold or personal loan bangalore. If you wish to acquire &lt;a href=&quot;http://www.dialabank.com/article.cfm/articleid/1550&quot;&gt;personal loan bangalore&lt;/a&gt; instantly you can go in for gold loan, whereas personal loans require 2 or 3 days for transaction.</p>\n\n<p>Personal loan Bangalore can be best for those who are willing to meet their daily or monthly expenses. This personal loan bangalore is granted for a span of about 1 to 5 years, and the exact period depends upon the total amount you have loaned.</p>\n\n<p>The most highlighted point in personal loan bangalore is that there is no security against loan like in case of gold loan. This is what attracts most of the loaners or borrowers. But the customers need to be careful regarding the interest rates and should compare the interest rates with maximum banks and move forward making the best deal with the bank that provides least interest rate. </p>\n\n<p>Generally the interest rate lies between 15%-19%. Even though you get an advantage of a no security personal loan bangalore, this characteristic thus increases the interest rates. Also this kind of loan is regarded as the high risk loan. E.g. if a bank provides personal loan bangalore to 10 people and if one of them fails to pay the amount, it automatically shifts to the balance 9 customers. The loss of one person’s amount has to be covered by the remaining 9. Thus, there can be a high interest rate for such loans.</p>\n\n<p>The eligibility criteria of personal loan bangalore is not very specific. But mostly preferred category for such loans are salaried person or businessmen. A person with satisfactory monthly income who can repay the amount on time shall be eligible for such loans.</p>\n\n<p>To know all pros and cons of such personal loan Bangalore you can use the online manuals provided by banks. All information related to every finance, loans types, eligibility criteria, EMI value, interest rate for different loans, etc is made available on your fingertips through online portals like &lt;a href=&quot;http://www.dialabank.com&quot;&gt;www.dialabank.com&lt;/a&gt;</p>\n\n<p>The borrower should be alert and gather all possible information before advancing for any such kind of personal loan bangalore. Even 1% variance in loan rate can make a lot of difference. Go in for banks which are reputed and well known and which provide you discounted rate of interest. The online application for personal loan bangalore has made loan application more convenient with minimal paper work.</p>\n\n<p>Considering the above facts, the borrowers can easily figure out the most convenient deal and select the best personal loan bangalore with available online information and resources. So go in for low interest rates, best and well recognized banks, lowest processing charges and minimal pre payment procedures.</p>","image":{"available_sizes":[[[150,149],"assets/images/resized/0018/4184/184184v2-max-150x150.jpg"],[[250,248],"assets/images/resized/0018/4184/184184v2-max-250x250.jpg"],[[426,424],"assets/images/resized/0018/4184/184184v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.dialabank.com/article.cfm/articleid/1550","title":"Personal Loan Bangalore"}],"web_presences":[]}