{"first_name":"Dick","last_name":"Moley","permalink":"dick-moley","crunchbase_url":"http://www.crunchbase.com/person/dick-moley","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Storm Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Dec 03 13:26:23 UTC 2008","updated_at":"Thu Jul 09 23:32:13 UTC 2009","overview":"<p>Dick Moley is a founding venture partner at Storm Ventures.</p>\n\n<p>Mr. Moley was born and raised in England where he received a BSEE from Manchester University. He worked as an electrical engineer and software developer for a U.K. computer company and a U.S. company on the East Coast before coming to California in 1966. He earned his BSEE from Stanford University and an MBA from Santa Clara University. Between 1966-1973, he worked at Hewlett-Packard and held various positions in Software Development and Marketing. In 1973, he joined ROLM Corporation to lead their Diversification into the telecommunications business. He held the position of Group Vice President before the company was acquired by IBM in 1984. After staying with IBM for 1 1/2 years, he left to join StrataCom. </p>\n\n<p>As Chairman, CEO, and President of StrataCom Inc., he pioneered ATM and Frame Relay technology. StrataCom grew through an IPO in 1992 to a revenue run rate of $380/annum in 1996, when the company was acquired by Cisco Systems. He stayed as a senior VP and Board Member of Cisco before resigning in August 1997 to become a private investor in companies. He currently serves on the board for such companies as Linear Technology, Inc., CMC Industries, Inc., CIDCO Inc., Echelon Inc., Netro Inc., and Nefeour Systems, Inc. He is also on the Board of Trustees for Santa Clara University </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founding Venture Partner","firm":{"name":"Storm Ventures","permalink":"storm-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,64],"assets/images/resized/0001/5089/15089v1-max-150x150.png"],[[250,107],"assets/images/resized/0001/5089/15089v1-max-250x250.png"],[[301,129],"assets/images/resized/0001/5089/15089v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}