{"first_name":"Dick","last_name":"Hardt","permalink":"dick-hardt","crunchbase_url":"http://www.crunchbase.com/person/dick-hardt","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Mar 23 22:27:35 UTC 2008","updated_at":"Mon Aug 15 21:33:40 UTC 2011","overview":"<p>A pioneer in the Internet sector and open source software community, Dick has been active in software development for over two decades.</p>\n\n<p>Prior to founding Sxip Identity, Dick founded ActiveState in 1997. Under his leadership as CEO, ActiveState became a leader in open source programming languages and anti-spam software and was acquired by UK-based software company, Sophos in 2003.</p>\n\n<p>His first commercial software work started in 1986 at Consumers Software where he ported one of the first LAN email packages, the Network Courier, to Windows 1.03. He later joined Paradigm Development, which did software consulting for firms such as Aldus, Adobe and Microsoft. In 1993 Dick connected Paradigm to the Internet and later founded hip Communications, which became one of the larger web development and hosting companies in western Canada. While running hip, Dick led the port of Perl 5 to the Windows platform, which resulted in an interest in open source software. hip was sold to a NASDAQ company.</p>\n\n<p>As a successful entrepreneur and technology expert, Dick is very involved in the technology community giving keynotes at numerous conferences across the globe. A small sampling includes: Web 2.0, the Next Web, ETech, Burton Group Catalyst, Digital ID World, Kuppinger Cole European Identity, Highland Forum, TTI/Vanguard Identity and Trust, W3C, NSA Identity Protection and Management, and the O’Reilly Open Source Conference.</p>\n\n<p>Dick is an active participant in the OpenID community. He co-authored the OpenID 2.0 specification and OpenID Attribute Exchange, is a founding board member of the OpenID Foundation, and is the Treasurer, co-chair of the marketing committee, as well as on the membership committee.</p>\n\n<p>Dick is also very active in the Vancouver community and is on the board of the Vancouver Enterprise Forum. He previously was on the board of the BC Technology Industry Association and Ludicorp, creators of Flickr. He is a Business in Vancouver Top 40 Under 40 award recipient. Dick has also demonstrated leadership in funding the Major Projects Fund for the BC Technology Social Venture Partners, a charitable foundation to support groups serving children, women at risk and people living in Vancouver’s downtown eastside.</p>","image":{"available_sizes":[[[75,75],"assets/images/resized/0001/9190/19190v1-max-150x150.jpg"],[[75,75],"assets/images/resized/0001/9190/19190v1-max-250x250.jpg"],[[75,75],"assets/images/resized/0001/9190/19190v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.sxip.com/dick_hardt\" title=\"Sxip\" rel=\"nofollow\">Sxip</a></p>"},"degrees":[],"relationships":[{"is_past":true,"title":"Founder & CEO","firm":{"name":"Sxip Identity","permalink":"sxip-identity","type_of_entity":"company","image":{"available_sizes":[[[140,79],"assets/images/resized/0001/9189/19189v1-max-150x150.png"],[[140,79],"assets/images/resized/0001/9189/19189v1-max-250x250.png"],[[140,79],"assets/images/resized/0001/9189/19189v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Community Board Member - Treasurer","firm":{"name":"OpenID Foundation","permalink":"openid-foundation","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0001/6257/16257v5-max-150x150.png"],[[250,100],"assets/images/resized/0001/6257/16257v5-max-250x250.png"],[[450,180],"assets/images/resized/0001/6257/16257v5-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Partner Architect","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}