{"first_name":"Dick","last_name":"Glover","permalink":"dick-glover","crunchbase_url":"http://www.crunchbase.com/person/dick-glover","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 23 03:42:00 UTC 2008","updated_at":"Fri May 21 18:22:14 UTC 2010","overview":"<p>Dick Glover is President and Chief Executive Officer (CEO) of the Or Die Networks, which includes FunnyorDie.com, ShredorDie.com, EatDrinkorDie.com, PwnorDie.com and KungFuTodd.com.</p>\n\n<p>FunnyorDie.com, launched in April of 2007, is one of the most visited comedy sites on the web according to publicly available data at www.quantcast.com. FunnyorDie.com was featured in Adweek&#8217;s &#8220;Digital Hot List,&#8221; and since its launch, the site has had over 143 million video views and features and more than 24 thousand videos. The award winning video &#8220;The Landlord,&#8221; featuring Will Ferrell and Adam McKay, is among the top three most-watched videos on the web, having been viewed over 55 million times since its debut. For comedic celebrities, FunnyorDie.com has quickly become the &#8220;place to be seen&#8221; on the Web, and for users, FunnyorDie.com is simply the best place to go online to easily find 20 minutes or more of laughter every day.</p>\n\n<p>Or Die Networks is a rapidly growing group of celebrity-anchored video websites each targeting specific areas of interest. Each site in the network operates as its own venture, but leverages centralized infrastructure, resources, and technology to ensure world-class features, performance, and ad sales. Currently, Or Die Networks includes FunnyorDie.com, ShredorDie.com, EatDrinkorDie.com, PwnorDie.com and KungFuTodd.com.</p>\n\n<p>Prior to Funny or Die, Glover was Vice President of Broadcasting and New Media for the National Association of Stock Car Auto Racing (NASCAR) and for NASCAR Digital Entertainment. At NASCAR, Glover ran the Los Angeles office overseeing all television, new media businesses, entertainment programming and promotion on behalf of the sport. A 20-year veteran of broadcasting and media, Glover was previously an Executive at the Walt Disney Company in various Senior Management roles in their ABC and Internet Groups. Glover also spent seven years with ESPN, most recently as Executive Vice President, Programming where he was responsible for all aspects of ESPN, Inc.’s domestic programming efforts, which included ESPN, ESPN2, ESPNEWS, ESPN Classic and ESPN.com. He was the executive in charge of the planning, development and launch of ESPN.com in 1994 and was instrumental in the site’s impressive growth to its current position as an industry leader. </p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0008/8087/88087v1-max-150x150.jpg"],[[150,227],"assets/images/resized/0008/8087/88087v1-max-250x250.jpg"],[[150,227],"assets/images/resized/0008/8087/88087v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Funny Or Die","permalink":"funny-or-die","type_of_entity":"company","image":{"available_sizes":[[[150,30],"assets/images/resized/0000/1828/1828v5-max-150x150.jpg"],[[250,50],"assets/images/resized/0000/1828/1828v5-max-250x250.jpg"],[[450,90],"assets/images/resized/0000/1828/1828v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}