{"first_name":"Diego","last_name":"Ostrovsky","permalink":"diego-ostrovsky","crunchbase_url":"http://www.crunchbase.com/person/diego-ostrovsky","homepage_url":"http://www.bluefevermedia.com/","birthplace":"Argentina","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"BlueFever Media","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Oct 15 16:51:24 UTC 2009","updated_at":"Sat Apr 09 05:14:02 UTC 2011","overview":"<p>Born in Buenos Aires, Argentina on August 9th, 1979, Diego is graphic designer graduated from ORT Technical School.</p>\n\n<p>He worked in the design and communication department at Canal 9 (Channel 9) for over 7 years where he participated working among groups developing different projects regarding institutional communication and ON AIR products for over 30 top TV shows in Argentina.</p>\n\n<p>In his experience, he participated in several releases for massive consumer products and shows for television, Internet, multimedia, advertising and promotion.\nAlso he was a head professor for the &#8220;Multimedia Design&#8221; and &#8220;Graphic Design&#8221; courses at the UP (University of Palermo). Also, he published articles related to design, effective communication and NLP.</p>\n\n<p>He is a member of the UDGBA (Union of Graphic Designers of Buenos Aires) and was invited as a assistant professor by the architect Roxana Meyjide who is the leader professor of one of the graphic design careers at the UBA (University of Buenos Aires).</p>\n\n<p>In the present he works at BlueFever while participating in the direction, managing and marketing for several companies, not only on strategic issues but also art direction and communication.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0007/8409/78409v2-max-150x150.jpg"],[[177,177],"assets/images/resized/0007/8409/78409v2-max-250x250.jpg"],[[177,177],"assets/images/resized/0007/8409/78409v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}