{"first_name":"Dilawar","last_name":"Syed","permalink":"dilawar-syed","crunchbase_url":"http://www.crunchbase.com/person/dilawar-syed","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Yonja Media Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"social-networking, emerging-markets, enterprise-software","alias_list":null,"created_at":"Sun Dec 27 00:52:38 UTC 2009","updated_at":"Mon Dec 28 12:07:29 UTC 2009","overview":"<p>Dilawar Syed is President &amp; Chief Executive Officer of Yonja Media Group, a leading investor-backed, emerging market internet media company, where he is responsible for the company&#8217;s strategic vision and execution of its global business. Prior to joining Yonja Media, Dilawar was with Yahoo! where he was head of strategy and business operations for the Platform &amp; Infrastructure Division. In this role, Dilawar led business planning for Yahoo!&#8217;s investments in next-generation platforms and infrastructure; managed business operations to support platform adoption across Yahoo!&#8217;s network; and drove business development with the developer and partner community. </p>\n\n<p>Earlier, Dilawar spent several years in the software industry in a variety of leadership roles. At SAP, Dilawar was responsible for positioning and launching SAP&#8217;s Customer Relationship Management solution suite. At Siebel Systems, Dilawar took various products to market for Siebel&#8217;s Communications, Media and Energy business. Most notably, Dilawar launched Siebel&#8217;s enterprise integration platform, and grew the product line to a multi-million dollar business globally. Dilawar started his career as a management consultant with Deloitte Consulting and Ernst &amp; Young. </p>\n\n<p>Dilawar is active in civic and non-profit efforts. Dilawar was a member of the National Finance Committee for Obama for America in 2008. Dilawar was appointed National Co-Chair for South Asian American Leadership Council by Gov. Howard Dean, Chairman DNC.</p>\n\n<p>Dilawar holds an MBA from The Wharton School of the University of Pennsylvania, and a BA in Economics and Computer Science from the University of Texas at Austin. </p>","image":null,"degrees":[{"degree_type":"MBA","subject":"","institution":"Wharton School","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President & CEO","firm":{"name":"Yonja Media Group","permalink":"yonja","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0002/0131/20131v4-max-150x150.png"],[[210,68],"assets/images/resized/0002/0131/20131v4-max-250x250.png"],[[210,68],"assets/images/resized/0002/0131/20131v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/dilawarsyed","title":"LinkedIn Profile"}]}