{"first_name":"Dimitri","last_name":"Snowden","permalink":"dimitri-snowden","crunchbase_url":"http://www.crunchbase.com/person/dimitri-snowden","homepage_url":"http://www.dimitrisnowden.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1981,"born_month":1,"born_day":25,"tag_list":"dimitri-snowden","alias_list":null,"created_at":"Wed Jun 22 13:35:34 UTC 2011","updated_at":"Mon Jun 27 17:46:43 UTC 2011","overview":"<p>Dimitri Snowden is an entrepreneur specializing in innovative solutions to both simple and complex challenges. His firm, ion360, specializes in technology integration  and business strategy, as well as consulting, process management, and creative design.  Dimitri works with his clients to deliver compelling outcomes using clever strategy and smart technology platforms while growing market share.  Snowden is experienced in business intelligence, brand architecture, multi channel marketing strategy, performance tracking and more.</p>\n\n<p>Snowden attended both the Cleveland Institute of Electronics and the ITT Technical Institute, and holds a Six Sigma Certification. He is experienced with a broad spectrum of hardware and software applications, as well as numerous programming languages.</p>\n\n<p>Dmitri Snowden participates in a wide variety of volunteer activities in both his local and the global community.  He is the co-founder of the Paramount School of Excellence, an Indianapolis based charter school designed to teach students about real world problem solving.  He’s also part of the business development program for the Uber Shelter project, creating portable, stable shelters for disaster relief programs. The shelters are designed to be shipped compactly, assembled quickly, and are well suited to a variety of terrains.</p>","image":{"available_sizes":[[[94,150],"assets/images/resized/0014/0474/140474v2-max-150x150.jpg"],[[157,250],"assets/images/resized/0014/0474/140474v2-max-250x250.jpg"],[[180,285],"assets/images/resized/0014/0474/140474v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.dimitrisnowden.com/","title":"Dimitri Snowden"}]}