{"first_name":"Dina","last_name":"Kaplan","permalink":"dina-kaplan","crunchbase_url":"http://www.crunchbase.com/person/dina-kaplan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Blip.tv","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Oct 01 15:16:16 UTC 2007","updated_at":"Mon Nov 14 07:40:16 UTC 2011","overview":"<p>Dina Kaplan is a founder of blip.tv.</p>\n\n<p>Before blip.tv, Dina was a news reporter with WNBC in New York, Wave3 News (NBC) in Louisville Kentucky and News12 Long Island and New Jersey.</p>\n\n<p>Dina won an Emmy for Spot News last summer and in prior years has won Society of Professional Journalists Awards for Deadline Reporting, Service Reporting and Feature Reporting and Associated Press Awards for Best Feature and for Breaking Spot News.</p>\n\n<p>Before reporting, Dina produced stories for MTV News about politics, technology and a range of musical acts from Ozzy Osbourne to The Wu-Tang Clan to Jewel. She also helped coordinate MTV&#8217;s Choose or Lose coverage of the 1996 Presidential Election.</p>\n\n<p>After graduating from college, Dina worked at the White House as Director of Research for the White House Counsel&#8217;s Office and then as Special Assistant to the Director of Presidential Personnel. During college, Dina worked at Rock The Vote, setting up a volunteer network of representatives that registered college students to vote around the country.</p>\n\n<p>Dina graduated from Wesleyan University with a degree in Economics, Government, Philosophy and History. She sits on the National Board of Wesleyan University and is a Founding Board Member of the Women&#8217;s Media Center. She is the Vice Chairman of the IAWTV, a member of the Producers Guild of America and a founder of the Calliope Group, which supports women founders in New York City.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"VP, Marketing","firm":{"name":"Blip","permalink":"blip","type_of_entity":"company","image":{"available_sizes":[[[150,105],"assets/images/resized/0019/1307/191307v1-max-150x150.jpg"],[[250,175],"assets/images/resized/0019/1307/191307v1-max-250x250.jpg"],[[250,175],"assets/images/resized/0019/1307/191307v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}