{"first_name":"Dionizio","last_name":"Bonfim Bach","permalink":"dionizio-bonfim-bach","crunchbase_url":"http://www.crunchbase.com/person/dionizio-bonfim-bach","homepage_url":"http://www.djdjio.com","birthplace":"Curitiba, PR, Brazil","twitter_username":"djio","blog_url":"http://www.djio.com.br","blog_feed_url":"http://www.djio.com.br/feed","affiliation_name":"Unaffiliated","born_year":1974,"born_month":9,"born_day":21,"tag_list":"dj, music, remix, webdesign, web-designer, adobe, ace","alias_list":null,"created_at":"Mon May 10 03:47:55 UTC 2010","updated_at":"Mon May 10 16:00:44 UTC 2010","overview":"<p>Djio, baptized as Dionizio Bonfim Bach, debuted as amateur DJ in 1991, while turning 17, in Florianópolis, Brazil. A little later he started professionally playing in parties and other events around the city. Since then, there are 15 years of history and sound.</p>\n\n<p>Music changed, and Djio got along. Meanwhile he played several genres: Techno, Trance, Progressive House&#8230; Time passed and, as usual, good things last. The good and old House wins new clothing (Electro, Filtered, Disco, Funky, &#8230;) and is still his main work genre. Always searching for a fusion between the classics and news tendencies, researches ethnic rhythms, preferring brazilian, afro and latin sounds. His sets prime for the good musical taste with messages of a fun and optimistic life.</p>\n\n<p>Besides DJing, he has more and more incursions in the musical production field. Already has participated in two CDs, from the Curitiba&#8217;s bands Golgotha and Sentido, produced the soundtrack for the short-length movie &#8216;Merde&#8217; of Lucila Bach, also keeps a partnership with Isaac Varzin in the project called Twist-Cola, among others.</p>\n\n<p>In 2002, moved definitively to Curitiba, where also works as a multimedia developer and designer; activities that adds lots to his musical work.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/djio","title":"DJIO @ Twitter"}]}