{"first_name":"Doc","last_name":"Searls","permalink":"doc-searls","crunchbase_url":"http://www.crunchbase.com/person/doc-searls","homepage_url":"http://searls.com/","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Apr 18 06:55:09 UTC 2008","updated_at":"Mon Mar 05 19:24:08 UTC 2012","overview":"<p>In The World is Flat, Thomas L. Friedman calls Doc &#8220;one of the most respected technology writers in America.&#8221; Searches for Doc on Google tend to bring up piles of results, owing to his work as:</p>\n\n<ul>\n<li>Senior Editor of Linux Journal, the premier Linux monthly and one of the world&#8217;s leading technology magazines.</li>\n<li>Co-author of The Cluetrain Manifesto, a book that was Amazon&#8217;s #1 sales &amp; marketing bestseller for thirteen months, and author of The Intention Economy: When Customers Take Charge, forthcoming (May 2012) from Harvard Business Review Press.</li>\n<li>Fellow with the Center for Information Technology and Society at the University of California, Santa Barbara.</li>\n<li>Alumnus Fellow with the Berkman Center for Internet and Society at Harvard University, where he continues to lead ProjectVRM, which has the immodest ambition of liberating customers from entrapment in vendor silos and improving markets by creating a productive balance of power in relationships between supply and demand.</li>\n<li>A pioneering and highly quoted blogger. J.D. Lasica, author of Darknet, and proprietor of OurMedia calls Doc &#8220;one of the deep thinkers in the blog movement.&#8221; </li>\n</ul>\n\n<p>As a writer, Doc&#8217;s byline has appeared in Harvard Business Review, OMNI, Wired, PC Magazine, The Standard, The Sun, Upside, Release 1.0, Wired, The Globe &amp; Mail and many other publications. He is @dsearls on Twitter and a legacy member of Steve Gillmor&#8217;s Gillmor Gang.</p>","image":{"available_sizes":[[[97,150],"assets/images/resized/0001/7447/17447v1-max-150x150.jpg"],[[162,250],"assets/images/resized/0001/7447/17447v1-max-250x250.jpg"],[[291,450],"assets/images/resized/0001/7447/17447v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}