{"first_name":"Docktur","last_name":"Todd","permalink":"docktur-todd","crunchbase_url":"http://www.crunchbase.com/person/docktur-todd","homepage_url":"http://www.facebook.com/thedrtodd","birthplace":"United States","twitter_username":"thedrtodd","blog_url":"http://contributor.yahoo.com/user/1628166/docktur_todd.html","blog_feed_url":"","affiliation_name":"The Consultants Group","born_year":1978,"born_month":9,"born_day":18,"tag_list":"docktur-todd, the-consultants-group, 30-seconds-to-mars, developer, rock-star, thirty-seconds-to-mars, executive, consultant, drummer, security, visionary, shannon-leto, elite, networking, ceopresident, whos-who, instructor, musician, jared-leto, studio-d","alias_list":null,"created_at":"Sat Oct 20 00:20:15 UTC 2012","updated_at":"Wed Oct 31 00:36:08 UTC 2012","overview":"<p>Docktur Todd is currently the CEO/President/Senior Executive Consultant at international advisory firm The Consultants Group. They specialize in everything from extremely sensitive, High-End Information Security Systems to Media/Entertainment/Management Solutions. Customizing material and ideas to fit all level of modern day consumers, Docktur Todd and his team gives you the factual, tract proven, correct answer the first time. Having the 12th and 13th vote of his own company, he just didn&#8217;t slide into the head of the table without full empowerment of his colleagues, associates, and peers.</p>\n\n<p>Having proven himself as a world traveled musician by primary means of the percussive nature, Todd has seen the globe several times over. Whether on tour with on of his bands, on a movie set, at the head of the boardroom, or personally writing a newer version of detailed code, developing new apps and software, or ultimately just finding solutions is what keeps him at the helm of this extremely proven machine.</p>\n\n<p>Only now is he at the ripe old age of 34, but listing his detailed biography and accomplishments reads more like a &#8220;Who&#8217;s Who&#8221; list of the executive producers and talented celebrities from all across the board. Docktur Todd was (and sometimes still does) a Private Personal Lessons Instructor, as well as a renowned studio musician, touring musician, (FAD: First Assistant Director), and Executive Drum Technician.  As well as being a  highly professional instructor, Todd, actually plays every single modern day instrument (drums, guitar, lead vocals, bass guitar) as well as lending his vocal talents to several unreleased projects.  One of the greatest known to date that Docktur Todd was hand chosen for the multi-platinum, world renowned Los Angeles based band 30 Seconds To Mars (Thirty Seconds To Mars).  This was personally sought out by Jared Leto (Jared is the lead singer and also a proven superstar as an actor).  Jared knew Todd could &#8220;see&#8221; music and his vision as a technical consultant, engineer, and Executive Drum Technician (on tour-production) and was in charge of mixing, tuning, and manipulating the samples, synthesizers, and sounds of Shannon Leto&#8217;s hybrid drum kit.  This beast that was re-designed by the primary and founding drummer (current drummer) Shannon Leto and Docktur Todd. While pictures do not do this justice it was one of very few made up of multiple Roland V-Drums (tunable-mesh heads) and Roland dual triggers, a Roland TD-20 Brain Module,  numerous Sabian cymbals, Tama hardware and DW/Sonor acoustic drums.  The electronics, wires, stands  pads, and a cage-like mechanism that they designed was impressive enough before the real drums and cymbals were even added.  As Docktur Todd being pitch-perfect (having perfect pitch) and an uncanny sense if rhythm, Shannon Leto (well before they even started touring) hired him as his private drum instructor as Todd already had a celebrity client list of current A+ talented drummers he was already committed to.</p>\n\n<p>Fast forwarding to current day, after having a stake in a film production company, Docktur Todd went on to continue conversations with many of the contacts he made world wide as he again could &#8220;see&#8221; the much larger picture.  This is exactly what he did.  Taking several years to put all the pieces in order, again the planets aligned and he formed an advisory board of &#8220;super-specialist&#8221; in the entertainment industry.  Not being blind, Todd, immediately figured out that having all this great knowledge in one room was not enough.  It was&#8217;t until he was at a major television network&#8217;s post award show party, that the last piece was seen.  With his &#8220;whatever it takes&#8221; attitude, he quickly became one of the new up and coming developers (technology/computers) to watch.  Good thing that he has a quest for knowledge, because this and the &#8220;way we communicate&#8221; has become his cretto.  </p>\n\n<p>Finding highly successful examples of business entities, practices, ideals, and the players to back it up, he has become the person to carry the flag, and help recruit for this Elite Networking powerhouse.  Todd, has now made it his company&#8217;s &#8220;New and Primary Objective&#8221; to help assist in the securing of information and the safe addition and retrieval of it, in cyberspace and the internet.  His leadership experience, communicative, and whatever it takes attitude makes Docktur Todd an Executive that rolls up his sleeves, and is not afraid to get dirty.      </p>","image":null,"degrees":[{"degree_type":"Psych.-BA (Arts)","subject":"Psych./Phil.","institution":"Texas Tech University","graduated_year":2001,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO/President/Senior Executive Consultant","firm":{"name":"The Consultants Group","permalink":"the-consultants-group","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/thedrtodd","title":"Docktur Todd - Twitter (personal)"},{"external_url":"http://facebook.com/thedrtodd","title":"Docktur Todd - Facebook (personal)"},{"external_url":"http://facebook.com/DockturTodd","title":"Docktur Todd - Facebook (fan page)"},{"external_url":"http://facebook.com/theconsultants.org","title":"The Consultants Group - Facebook (business/organization page)"},{"external_url":"http://myspace.com/thedrtodd","title":"Docktur Todd - Myspace (personal)"},{"external_url":"http://linkedin.com/pub/docktur_todd/50/805216","title":"Docktur Todd - LinkedIn (personal)"},{"external_url":"http://contributor.yahoo.com/user/1628166/docktur_todd.html","title":"Docktur Todd - Yahoo Contributor Network "}]}