{"first_name":"Dominic","last_name":"Sandifer","permalink":"dominic-sandifer","crunchbase_url":"http://www.crunchbase.com/person/dominic-sandifer","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"ilike","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jul 17 12:03:43 UTC 2007","updated_at":"Fri Mar 21 07:24:24 UTC 2008","overview":"<p>Dominic has been a leader in the branded entertainment field for over fifteen years. He recently partnered with music industry leader Coran Capshaw ( ATO Records, Redlight Management, Music Today, etc) to form GreenLight, an entertainment media and marketing company. Previous to GreenLight, Dominic led the Entertainment &amp; Integrated Brand Marketing Group for TBA Global, a major branded content producer and marketing agency for Fortune 1000 companies including InBev, SAP, Chase, Nestle, Nike and McDonald&#8217;s., as well as having headed Universal Music Group/IGA&#8217;s Strategic Marketing team. While at UMG Dominic helped develop music-driven marketing strategies for major brands including Coca-Cola, XBox, and Apple and aided in the creation of tie-ins between artists and brands such as Sting/AOL Broadband and the innovative Black Eyed Peas/Apple iTunes campaign launch. Dominic led UMG&#8217;s participation in the launch of Coca Cola Classic&#8217;s successful integrated marketing program for its &#8220;Real&#8221; campaign. Dominic has also served as EVP of Mandalay Branded Entertainment, a division of Mandalay Entertainment Group, where he conceived and produced 65 episodes of the award winning &#8220;Go For It&#8221; series on ABC Family. He is the founder of The McSand Group ( before its acquisition by Mandalay), as well as the Men’s Guild for Children’s Hospital Los Angeles. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Advisor","firm":{"name":"iLike","permalink":"ilike","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0000/3487/3487v2-max-150x150.png"],[[250,100],"assets/images/resized/0000/3487/3487v2-max-250x250.png"],[[450,180],"assets/images/resized/0000/3487/3487v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"President","firm":{"name":"GreenLight Media","permalink":"greenlight-media","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}