{"first_name":"Dominique","last_name":"Jaurola","permalink":"dominique-jaurola","crunchbase_url":"http://www.crunchbase.com/person/dominique-jaurola","homepage_url":"http://hunome.com","birthplace":"","twitter_username":"hunome","blog_url":"http://hunome.com/blog","blog_feed_url":"","affiliation_name":"Hunome","born_year":null,"born_month":null,"born_day":null,"tag_list":"hunome, nokia, csc, iiiglobal-com, dominique-jaurola, dojau, founder, ceo","alias_list":null,"created_at":"Mon May 10 14:00:06 UTC 2010","updated_at":"Mon Nov 26 02:56:42 UTC 2012","overview":"<p>Dominique is the Founder and CEO of Hunome</p>\n\n<p>She has 20 years experience in the digital industries. Her experience spans telecommunications networks, telecommunications equipment, mobile devices, IT-services, online B2B and online B2C startups.</p>\n\n<p>Her work is global. She has worked, lived and studied in the US, France, Finland and Australia. Her roles for example as product marketing lead at Nokia (mobile devices) took her to all corners of the world. She speaks three languages fluently. (no code languages unfortunately)</p>\n\n<p>Dominique realised the necessity to understand people, not as consumers but as people, while leading product marketing for the global mobile device platform of devices in the mid 90s at Nokia. This platform shifted the mobile industry from &#8216;business&#8217; device to &#8216;consumer&#8217; device. </p>\n\n<p>She then formed a leading edge multidisciplinary team then called SocialWare (1996) to understand people as humans and draw conclusions, insights and concepts to Nokia strategy. She led a 60-strong team to a vision entitled &#8220;mobile information society 2010&#8221; in 1998. This vision foresaw the development of the industry to life device and application focus and many other developments during the 00s.</p>\n\n<p>The functional skills and expertise span product leadership, marketing, business solution creation and management, strategic foresight, human-centricity, startup leadership (2 startups), financial models for business roadmap, business models, roadmap and portfolio management, digital project product owner, information architectures, web-business design, business design, forward-thinking management consulting, multidisciplinary team leadership and large global organisation change and transformation leadership, values and culture custodianship.</p>\n\n<p>Her achievements include for example: </p>\n\n<p>Leading the product marketing and creation team for a platform of mobile devices that shifted Nokia to the leading player selling large volumes of devices to the consumer market.</p>\n\n<p>A major vision program and authorship and leadership in 1998; this vision took a serious dive into the human-centric side of the business roadmap and its drivers.</p>\n\n<p>A B2B online startup that identified the need to facilitate ideas to commercialisation by bringing together the parties that matter in that process onto one &#8216;innovation community&#8217; platform. The web-business was launched on time, within budget and gained 100 businesses in support of the idea generators. 1999-2001. The Internet crash in 2001 wiped out faith in the market that Internet &#8216;mattered&#8217;.</p>\n\n<p>Two books on strategic foresight; co-author for one with focus on the consumer foresight as well as the discussing the challenges for in-house futurists and contributor for another.</p>\n\n<p>Major across-lines of service business solution framework for &#8216;Mobile Enterprise&#8217;, covering all aspects of mobility business solutions including key partners.</p>\n\n<p>Industry report as a leading thought leader for the &#8216;connected world&#8217;.</p>\n\n<p>Now the best of all: Working on Hunome, which is an online social data platform and application making &#8216;how humanity works&#8217; knowledge accessible to individuals, SMBs and corporations. Hunome is akin to &#8216;genome&#8217; but instead of mapping human DNA we map perspectives into connected and contextualised mind-maps. Our intent is to facilitate this knowledge to help human-centricity to become centre-stage in decision-making.</p>\n\n<pre><code>The best way to activate a future is to co-create it.\n</code></pre>\n\n<p>Dominique is passionate about helping the world become more human-centric. She enjoys philosophy and many other dimensions of being human-centric: design, art, marketing, strategy, foresight, insights&#8230;In addition she reads, skis and treks, including an Oxfam 100km hike with a team of four</p>","image":{"available_sizes":[[[113,150],"assets/images/resized/0008/6574/86574v8-max-150x150.jpg"],[[188,250],"assets/images/resized/0008/6574/86574v8-max-250x250.jpg"],[[339,450],"assets/images/resized/0008/6574/86574v8-max-450x450.jpg"]],"attribution":"<p>Dominique Jaurola</p>"},"degrees":[{"degree_type":"Master of Science","subject":"International business & marketing","institution":"Helsinki School of Economics and Business Administration","graduated_year":1989,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Hunome","permalink":"hunome","type_of_entity":"company","image":{"available_sizes":[[[150,64],"assets/images/resized/0008/6578/86578v4-max-150x150.png"],[[250,106],"assets/images/resized/0008/6578/86578v4-max-250x250.png"],[[450,192],"assets/images/resized/0008/6578/86578v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/hunome","title":"Hunome at Twitter"},{"external_url":"http://twitter.com/dojau","title":"Dominique at Twitter"},{"external_url":"http://hunome.com","title":"Hunome Site"},{"external_url":"http://dominiquejaurola.com","title":"Personal blog"},{"external_url":"http://hunome.com/blog","title":"Hunome blog"}]}