{"first_name":"Thomas","last_name":"Pragias","permalink":"dominic-maggiore","crunchbase_url":"http://www.crunchbase.com/person/dominic-maggiore","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"VectorMAX","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Dec 20 11:50:47 UTC 2008","updated_at":"Wed Aug 15 16:28:50 UTC 2012","overview":"<p>Pioneering a Revolution in IP Communications.    </p>\n\n<p>Founded in 1998, VectorMAX has developed a one-of-a-kind, integrated, end-to-end software platform that enables Carriers to efficiently and cost effectively deliver IP video to any device over a Carrier&#8217;s existing infrastructure.</p>\n\n<p>This technology is protected by nine US patents with 53 patents filed worldwide and naming rights protected by 17 trademarks.</p>\n\n<p>Our headquarters is located in New York, (United States of America) but we also have local amenities for development, demonstration and support in Bogota (Colombia), Linares (Spain) and Shenzhen (China).</p>\n\n<p>Among our own staff and our technology partners, we have more than 1,500 engineers, developers and designers with the most extensive experience in the IP TV market.</p>\n\n<p>We provide the technology necessary for the transmission and administration of both live and on demand television signals via IP. This exclusive focus ensures that our customers stay ahead in the provision of pay TV services to end users, both within their network and remotely.</p>\n\n<p>VectorMAX has developed technology which operate in both multicast and unicast mode for set-top-boxes as well as PCs, MACs, IPhone, IPod and Android devices.</p>\n\n<p>Our attractive business model will allow you be in the vanguard of the pay-TV industry.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"VectorMAX","permalink":"vectormax","type_of_entity":"company","image":{"available_sizes":[[[150,39],"assets/images/resized/0003/2157/32157v1-max-150x150.png"],[[250,65],"assets/images/resized/0003/2157/32157v1-max-250x250.png"],[[285,75],"assets/images/resized/0003/2157/32157v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}