{"first_name":"Don","last_name":"Baer","permalink":"don-baer","crunchbase_url":"http://www.crunchbase.com/person/don-baer","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Feb 01 22:31:24 UTC 2010","updated_at":"Mon Feb 01 22:33:29 UTC 2010","overview":"<p>Donald A. Baer is Chairman of Penn, Schoen &amp; Berland Associates, Washington, D.C.</p>\n\n<p>Don Baer has built a varied career as a leading media and communications executive. He has extensive experience in the strategic, creative and operational sides of the private and public sectors, including senior roles with the White House, global companies and U.S. media organizations. In late 2007, he became Worldwide Vice Chairman of strategic communications firm Burson-Marsteller and Chairman of research firm Penn, Schoen &amp; Berland, both WPP, Inc. companies. Don leads major projects for and provides strategic counsel to a global client base ranging across many industry and not-for-profit sectors.</p>\n\n<p>From 1998 to 2007, Don worked at Discovery Communications, home of the Discovery Channel and media properties in over 170 countries. As Senior Executive Vice President for Strategy and Development, he reported to the CEO and was a member of the executive committee of this multi-billion dollar media business. He oversaw global brand-building efforts; new ventures and acquisitions; new media strategy and operations, and corporate functions including business development, communications, research and public policy.</p>\n\n<p>At Discovery, Don managed a wide range of business, production and communications initiatives to build the company&#8217;s appeal, reach and unparalleled content. These efforts included managing teams that significantly expanded Discovery&#8217;s online offerings, including acquisitions of digital media businesses such as Petfinder.com, Antenna Audio and United Learning; the launch of mobile video operations, the first video partnership with Google Earth, and initiatives with companies including Nokia, Qualcomm and Samsung. His work to expand Discovery&#8217;s public affairs content included managing the Discovery/New York Times Company joint venture in the Discovery Times Channel, helping to hire Ted Koppel, and producing a documentary series with Thomas Friedman of The New York Times. Under his leadership, Discovery and the American Film Institute founded Silverdocs, America&#8217;s top documentary festival.</p>\n\n<p>Before Discovery, Don was in public service, journalism and law. From 1994-97, he was one of President Clinton&#8217;s senior advisers. As Assistant to the President and White House Director of Strategic Planning and Communications and, before that, as Director of Speechwriting and Research and Chief White House Speechwriter, he was widely recognized for his essential role in the Clinton Presidency, including in the historic 1996 re-election. Don managed across multiple government agencies, including domestic and foreign policy, to build coherent message strategies and operations. Among other roles, he spearheaded numerous major Presidential addresses, working on every State of the Union address from 1995 ¡V 2000.</p>\n\n<p>Before the White House, Don was a top editor at U.S. News and World Report, covering national politics, and, as an editor, managing national and international coverage. He also worked at The American Lawyer. His writing has appeared in publications including The New York Times and The Politico. He was a CBS News analyst in 1998 and has appeared on many national television shows. As a writer for the annual Kennedy Center Honors television show since 2000, he has won two Writers Guild of America awards.</p>\n\n<p>In the 1980s, Don was a media lawyer in New York at Patterson, Belknap, Webb &amp; Tyler. He sits on two for-profit boards: Fora.tv and Whitney International University Systems. He serves as an adviser to several new media businesses and is a venture partner in Legend Ventures, a Washington, D.C. investment firm. He serves on not-for-profit boards that include the PBS Foundation, the Georgetown Day School and City Year DC. He is a member of the Council on Foreign Relations.</p>\n\n<p>Don received a B.A. from The University of North Carolina at Chapel Hill (Phi Beta Kappa), a Master&#8217;s in International Relations from the London School of Economics and Political Science (Rotary International Fellowship) and a J.D. from the University of Virginia School of Law. He lives with his wife, Nancy Bard, and two sons in Washington, D.C.</p>","image":{"available_sizes":[[[125,150],"assets/images/resized/0007/5679/75679v1-max-150x150.jpg"],[[125,150],"assets/images/resized/0007/5679/75679v1-max-250x250.jpg"],[[125,150],"assets/images/resized/0007/5679/75679v1-max-450x450.jpg"]],"attribution":"<p>Burston Marsteller</p>"},"degrees":[],"relationships":[],"investments":[{"funding_round":{"round_code":"angel","source_url":"http://paidcontent.org/article/419-social-net-for-gay-men-fabulis-raises-625k-from-wapo-others/","source_description":"Social Net For Gay Men Fabulis Raises $625K From WaPo, Others ","raised_amount":625000,"raised_currency_code":"USD","funded_year":2010,"funded_month":1,"funded_day":28,"company":{"name":"Fab","permalink":"fab-com","image":{"available_sizes":[[[100,100],"assets/images/resized/0007/5592/75592v16-max-150x150.jpg"],[[100,100],"assets/images/resized/0007/5592/75592v16-max-250x250.jpg"],[[100,100],"assets/images/resized/0007/5592/75592v16-max-450x450.jpg"]],"attribution":null}}}},{"funding_round":{"round_code":"a","source_url":"http://www.businessinsider.com/ashton-kutcher-backed-fabcom-raises-another-76-million-2011-8","source_description":"Ashton Kutcher-Backed Fab.com Closes $7.7 Million","raised_amount":7700000,"raised_currency_code":"USD","funded_year":2011,"funded_month":8,"funded_day":11,"company":{"name":"Fab","permalink":"fab-com","image":{"available_sizes":[[[100,100],"assets/images/resized/0007/5592/75592v16-max-150x150.jpg"],[[100,100],"assets/images/resized/0007/5592/75592v16-max-250x250.jpg"],[[100,100],"assets/images/resized/0007/5592/75592v16-max-450x450.jpg"]],"attribution":null}}}}],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}