{"first_name":"Don","last_name":"Tapscott","permalink":"don-tapscott","crunchbase_url":"http://www.crunchbase.com/person/don-tapscott","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 28 20:45:57 UTC 2009","updated_at":"Wed Jan 28 20:45:57 UTC 2009","overview":"<p>Don Tapscott is one of the world&#8217;s leading authorities on business strategy and how information technology changes business, government and society. He served as founder and chairman of the international think tank New Paradigm before its acquisition by nGenera. The Washington Technology Report called him one of the most influential media authorities since Marshall McLuhan.</p>\n\n<p>Tapscott has authored thirteen widely read books including GROWN UP DIGITAL: How the Net Generation is Changing Your World, (2008), sequel to GROWING UP DIGITAL (1997) where he defined the Net Generation, as well as WIKINOMICS: How Mass Collaboration Changes Everything (written with Anthony Williams), the best selling management book on amazon.com in 2007.</p>\n\n<p>Don Tapscott regularly contributes articles to International newspapers and magazines, including the WSJ, New York Times and USA Today, and BusinessWeek Online.</p>\n\n<p>Don Tapscott holds a B.Sc. in Psychology and Statistics, an M.Ed. specializing in Research Methodology, and two Doctor of Laws (Hon) granted from the University of Alberta in 2001 and from Trent University in 2006. He is Adjunct Professor of Management, Joseph L. Rotman School of Management, University of Toronto.</p>\n\n<p>Deeply committed to the issue of mental health, Don Tapscott is a founding member of the Committee of Advisers of the Business &amp; Economic Roundtable on Addiction &amp; Mental Health. </p>","image":{"available_sizes":[[[96,150],"assets/images/resized/0003/5109/35109v1-max-150x150.jpg"],[[160,250],"assets/images/resized/0003/5109/35109v1-max-250x250.jpg"],[[240,373],"assets/images/resized/0003/5109/35109v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}