{"first_name":"DON JR","last_name":"CEO","permalink":"don-jr-ceo","crunchbase_url":"http://www.crunchbase.com/person/don-jr-ceo","homepage_url":"http://impressiveconceptsinc.com","birthplace":"St. Louis, MO","twitter_username":"donjrceo","blog_url":"http://impressiveconceptsinc.blogspot.com/","blog_feed_url":"http://feeds.feedburner.com/ImpressiveConceptsInc","affiliation_name":"Unaffiliated","born_year":1978,"born_month":3,"born_day":22,"tag_list":"ann, ceo, concepts, daley, don, education, impressive, inc-, jr, music, u, ukneekly","alias_list":null,"created_at":"Thu Dec 08 06:46:47 UTC 2011","updated_at":"Thu Dec 15 19:53:50 UTC 2011","overview":"<p>DON JR – CEO was born on 3/22/78 at 4:20 pm in Jewish Hospital located in St. Louis, MO.  He is the eldest of five children.  DON JR – CEO is the son of Don Cody Sr. the CEO of Moses Media Inc.  When DON JR – CEO was 3 months old, his father carried him into KATZ radio station located downtown St. Louis, MO.  That was the beginning to his long history in the entertainment industry.</p>\n\n<p>DON JR – CEO dropped out of high school in the 10th grade.  He was only 16 but he realized that the internet was the wave of the future.  When he turned 22 he started working for his Father at Moses Media Inc.  He interned for 3 months when Don Cody Sr. came up with a new service called the Internet Audio Presentation known throughout the music industry as the IAP.  DON JR – CEO produced the first IAP for Moses Media.  It was for Busta Rhymes J Records, “Break Your Neck.”  He designed IAP’s for 16 out of the top 20 major record companies.  He produced IAP’s for various artists such as TI, Mike Jones, Alicia Keys, 50 Cent and American Idol winners Ruben Stutter, Fantasia and Bo Bryce. </p>\n\n<p>DON JR – CEO worked under his father for 3 years and in 2003 he launched Duet Custom Designs &amp; More.  The mission statement of Duet Custom Designs &amp; More was “We work with individuals and companies to deliver top quality designs to fit any budget.”  The first services offered were CD Artwork, Logos, Business Cards, Website Banners, Websites, Custom Myspace Pages, Booking Shows and getting Radio Airplay.  Once he started speaking to clients they requested other services such as Promotional and Marketing Branding Services, Corporate Identities and Contracts.  After working with so many Major and Independent Artists, DON JR – CEO had a track record for building companies and Brand Names such as Rap Star Promo and MP3Waxxx just to name a few.  He also worked for TBCN – TV Tampa Bay where he produced religious programs.</p>\n\n<p>DON JR – CEO relocated to Los Angeles, CA and changed the name of the company to Impressive Concepts Inc.  His company specialized in Viral Marketing, Website Development, Web Hosting, Internet Audio Presentations (IAP), Voice Over Talents, Professional Beat Production, Publicity, Radio/Record Promotions, Consulting, Corporate Identities, Event Planning and Promoting, Printing, Graphic Designing, CD Pressing (Duplication), Voice on Hold, Radio Commercial Production, Massive Email Campaigns, T.V./Radio Commercials Production, Video Production and File Conversion.   He started consulting more businesses and companies where he selected the top 35 companies to give them opportunities to get the most return for their services.  At night DON JR – CEO worked for Imagitorium Studios learning video production and editing. </p>\n\n<p>After migrating through the industry, DON JR – CEO decided to commence conference calls via the internet. There calls included educating listeners on the business side of the entertainment industry, taking Artists and their careers to the next level, booking shows, setting up interviews and guiding Artists in their development.  DON JR – CEO is considered to be a mogul in his respect by many.</p>\n\n<p>Today DON JR – CEO continues pressing forward by evolving with the times. Still teaching the etiquettes of the arts through his Blog Talk Radio station – Entertainment World Wide Network, he has opened the doors for many by guiding them in the direction that leads to success.  </p>\n\n<p>To some people DON JR – CEO is a tyrant but in all honesty he is a perfectionist.  When he commits to doing a project, whether minor or major his creative juices flow to get the best results for his client.  DON JR – CEO has designed over 1500 IAP’s and 500 Websites.  He has worked on projects with industry legend such as Ken Wilson, Morace Landy, Nicole Sellers, Chris Pringle and Jay King.  DON JR – CEO lives by the motto, “We Make The Impossible Look Easy.”  DON JR – CEO is a God fearing man, a Consultant, Trend Setter, Leader, Father, Brother and DON JR – CEO Is In The Building.</p>\n\n<p>Personal note: Thank you taking the time out to read his Bio.</p>\n\n<p>DON JR – CEO is a man with a vision.</p>\n\n<p>Bio composition by: \nAnn Daley - AR. Impressive Concepts, Inc.\nhttp://www.impressiveconceptsinc.com\nMoses Media Inc.\nhttp://www.mosesmediainc.com</p>\n\n<p>Duet Custom Designs &amp; More\nhttp://www.duetcustomdesigns.com</p>\n\n<p>GM: impressiveconceptsincacct@gmail.com\n818-358-5722  Impressive Concepts, Inc. Office\n208-728-8281 Fax</p>\n\n<p>&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\nDon Jr. - CEO\nEntertainment WorldWide Network\nhttp://www.entertainmentworldwidenetwork.com</p>\n\n<p>Impressive Concepts, Inc.\nhttp://www.impressiveconceptsinc.com</p>\n\n<p>Moses Media Inc.\nhttp://www.mosesmediainc.com</p>\n\n<p>Duet Custom Designs &amp; More\nhttp://www.duetcustomdesigns.com</p>\n\n<p>http://www.myspace.com/donindo\nhttp://www.facebook.com/donjrceo\nhttp://www.twitter.com/donjrceo\nhttp://www.youtube.com/user/donjrceo\nAIM: donjrceo\nYM: donjr_ceo@yahoo.com\nGM: impressiveconceptsinc@gmail.com\n206-600-5935 Impressive Concepts, Inc. Office\n352-333-0889 Desk\n818-358-5722 Direct\n208-728-8281 Fax\n160<em>133</em>12128 Nextel/Boost Mobile Chirp\nText follow DonJrCEO to 40404 in the United States</p>\n\n<p>To see the the future you have to look torwards the light in the direction it coming from!\nFaith sees the invisible, believes the incredible and receives the impossible!</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0016/5667/165667v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0016/5667/165667v2-max-250x250.jpg"],[[299,450],"assets/images/resized/0016/5667/165667v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.entertainmentworldwidenetwork.com","title":"Entertainment WorldWide Network"},{"external_url":"http://www.impressiveconceptsinc.com","title":"Impressive Concepts, Inc."},{"external_url":"http://www.mosesmediainc.com","title":"Moses Media Inc."},{"external_url":"http://www.duetcustomdesigns.com","title":"Duet Custom Designs & More"},{"external_url":"http://ukneeklyu.com/","title":"Ukneekly U"},{"external_url":"http://www.facebook.com/donjrceo","title":"Don Jr - CEO Facebook 1"},{"external_url":"http://www.facebook.com/donjrceo.daking","title":"Don Jr - CEO Facebook 2"},{"external_url":"http://www.twitter.com/donjrceo","title":"Don Jr - CEO Twitter"},{"external_url":"http://www.youtube.com/user/donjrceo","title":"Don Jr - CEO Youtube"}]}