{"first_name":"Don","last_name":"Scifres","permalink":"don-scifres","crunchbase_url":"http://www.crunchbase.com/person/don-scifres","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"SDL Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Nov 28 13:22:37 UTC 2008","updated_at":"Mon Oct 08 06:48:47 UTC 2012","overview":"<p>Don Scifres received a BSEE degree from Purdue University, and M.S. and Ph.D. degrees in Electrical Engineering from the University of Illinois. He then joined the Xerox Palo Alto Research Center to set up a new laboratory for the study of semiconductor lasers and light emitting diodes. While at Xerox, Don held positions of Manager of Optoelectronics and Xerox Research Fellow. Don holds over 140 U.S. patents and has published over 300 technical articles including contributions to the books Molecular Beam Epitaxy (Pergammon Press, 1980) and Diode Laser Arrays (Cambridge University Press, 1994). Among other contributions at Xerox, Don and his colleagues developed very high power semiconductor laser arrays leading to the founding of SDL, Inc., (formerly Spectra Diode Laboratories, Inc.) in 1983. Under his direction as CEO and Chairman of the Board, SDL, Inc. became one of the fastest growing companies in the fiber optics and optoelectronics industries.</p>\n\n<p>In February 2001, SDL, Inc. merged with JDS Uniphase Corporation. At the time the merger was announced in July 2000, SDL, Inc. had grown to approximately $500 million in sales, with over 2,000 employees in eight locations worldwide. SDL&#8217;s market cap was $41 billion, making the merger the largest technology deal ever done at that time. Don was Co-chairman of the Board of JDS Uniphase Corporation, and Chief Strategy Officer, and in charge of Mergers and Acquisitions.</p>\n\n<p>In February 2003, Don left JDS Uniphase and founded SDL Ventures, LLC and SDL Capital, LP, investment companies based in Los Altos, California.</p>\n\n<p>Don has been awarded the IEEE Jack Morton Medal, the IEEE Robert Noyce Medal, the IEEE Third Millennium Medal, the IEEE John Tyndall Award and the IEEE LEOS Award for Engineering Excellence. He also received the Optical Society of America Edward H. Land Medal, the American Physical Society George E. Pake Prize, the Rank Prize from The Rank Foundation, and the Eminent Member Award from Eta Kappa Nu National Honor Society. Don is an elected member of the National Academy of Engineering and a Fellow of IEEE and the Optical Society of America. He is Past President of the Lasers and Electro-Optics Society of IEEE and has served as a member of the LEOS Board of Governors for a number of years. Don also served as President of LEOMA, the Lasers and Electro Optics Manufacturers Association. He is on the Board of Directors of several non-public companies.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":" Managing Director, Chairman","firm":{"name":"SDL Ventures","permalink":"sdl-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[144,128],"assets/images/resized/0002/9959/29959v1-max-150x150.jpg"],[[144,128],"assets/images/resized/0002/9959/29959v1-max-250x250.jpg"],[[144,128],"assets/images/resized/0002/9959/29959v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Advisor","firm":{"name":"250ok","permalink":"250ok","type_of_entity":"company","image":{"available_sizes":[[[150,62],"assets/images/resized/0020/8718/208718v2-max-150x150.jpg"],[[250,103],"assets/images/resized/0020/8718/208718v2-max-250x250.jpg"],[[450,187],"assets/images/resized/0020/8718/208718v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}