{"first_name":"Don","last_name":"Martin","permalink":"don-martin","crunchbase_url":"http://www.crunchbase.com/person/don-martin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Nov 20 04:04:14 UTC 2012","updated_at":"Tue Nov 20 04:06:11 UTC 2012","overview":"<p>Don Martin provides the technical vision that transformed the SecureParser® into a High Availability grid storage solution. His expertise was gained as a 19 year consultant for data availability, disaster recovery and continuity of operations for IBM. Don&#8217;s background as a network engineer lead and facilitated the transition to data replication and continuous availability of mainframe and open systems environments for many Fortune 500 corporations. Prior to joining SFC, Don was the Director of Technical Solutions for EMC Federal. He lead a team of engineers and PhD.s that were responsible for moving and replicating the data out of many U.S. Government facilities after 9/11. Don firmly believes that customer information is becoming too large and disbursed to be backed up. This data must be protected and always accessible regardless of weather, power, sabotage and other vulnerabilities. The data must have policy applied that allows it to exist for decades. Security First Corp. technology has the ability to provide global security that cannot be compromised with non-stop access.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Technology Officer","firm":{"name":"Security First","permalink":"security-first","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0004/9184/49184v1-max-150x150.jpg"],[[250,100],"assets/images/resized/0004/9184/49184v1-max-250x250.jpg"],[[250,100],"assets/images/resized/0004/9184/49184v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}