{"first_name":"Don","last_name":"Mattrick","permalink":"don-mattrick","crunchbase_url":"http://www.crunchbase.com/person/don-mattrick","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Thu Nov 18 20:17:38 UTC 2010","updated_at":"Thu Nov 18 20:18:14 UTC 2010","overview":"<p>As president of the Interactive Entertainment Business, Don Mattrick is responsible for the businesses which develop key entertainment experiences that span gaming, music and video across multiple screens. Mattrick&#8217;s team drives development and marketing of Xbox 360, Xbox LIVE, the controller-free Kinect for Xbox 360, Zune Music and Video, and Mediaroom, as well as PC and mobile interactive entertainment, manufacturing and supply chain management. In addition, his team cultivates relationships with third-party game publishers and developers around the world.</p>\n\n<p>Mattrick joined Microsoft in July 2007, bringing with him more than 23 years of broad industry and development experience, having helped bring to life such celebrated game franchises as &#8220;Need for Speed,&#8221; &#8220;Harry Potter&#8221; and &#8220;The Sims&#8221; during his tenures at Distinctive Software Inc. and Electronic Arts Inc. (EA). Previously, Mattrick had begun working with Microsoft as an external advisor to the Entertainment and Devices Division in February 2007, working with Robbie Bach and his senior leadership team on various initiatives to continue to evolve the Microsoft gaming platform experience.</p>\n\n<p>Before joining Microsoft, Mattrick held several leadership positions at EA, most recently as president of the publisher&#8217;s worldwide studios. Previously, he oversaw EA&#8217;s global studios and research and development in several major sites, including Redwood Shores, Calif. (Silicon Valley), EALA in Los Angeles, EA Tiburon in Florida, EA Canada in Vancouver, British Columbia, and Montreal, and EA UK Studio in Chertsey, England. At the age of 17, Mattrick founded Distinctive Software, which was acquired by EA in 1991 and subsequently became EA Canada.</p>\n\n<p>Raised in Vancouver, British Columbia, Mattrick has been an active member of the province&#8217;s business and educational community. He has served on several public and private boards, including the advisory board for USC School of Cinematic Arts and the Premier&#8217;s Technology Council in British Columbia. In 2003, Mattrick was named one of America&#8217;s &#8220;Top Ten Influentials&#8221; in Fortune magazine&#8217;s annual &#8220;40 Under 40&#8221; list for his contributions to Electronic Arts&#8217; expansion initiatives. In 2005, the World Economic Forum appointed him to its Forum of Young Global Leaders, a group of 100 young leaders chosen to address the challenges of the 21st century. In acknowledgement of his role in building EA&#8217;s business in British Columbia and the active development of industry links with the University of British Columbia, Mattrick received the UBC Award as an Honorary Fellow from the Sauder School of Business in December 2005. In 1999, Simon Fraser University awarded him the highest honor the university can bestow, the Doctor of La</p>","image":{"available_sizes":[[[75,105],"assets/images/resized/0011/0802/110802v1-max-150x150.jpg"],[[75,105],"assets/images/resized/0011/0802/110802v1-max-250x250.jpg"],[[75,105],"assets/images/resized/0011/0802/110802v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}