{"first_name":"Don","last_name":"Drakeman","permalink":"don-drakeman","crunchbase_url":"http://www.crunchbase.com/person/don-drakeman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Advent Venture Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Mar 30 14:56:08 UTC 2008","updated_at":"Sat Jul 10 21:06:37 UTC 2010","overview":"<p>Don Drakeman joined the Advent Ventures Life Sciences Team in 2007 as Venture Partner. He has an exceptional record of success in building Biotechnology companies. Don is involved in assisting several Advent portfolio companies in a variety of Board level and Senior Executive roles and in sourcing and reviewing new investment opportunities in the US and Europe.</p>\n\n<p>Don is an entrepreneur and executive who co-founded two multi-billion dollar biotech companies, Medarex, Inc., and Genmab A/S. Under his leadership as CEO, Medarex raised over a billion dollars, formed alliances with many pharmaceutical companies, developed numerous therapeutic products, and spun-off Genmab, which completed Europe’s largest biotech IPO to date. During his 22 years in the industry, he has overseen the progress of over 30 innovative new medical products for cancer, infectious disease and inflammation from research concept into clinical trials.</p>\n\n<p>He received an A.B. from Dartmouth College, a J.D. from Columbia University, and a Ph.D. in the humanities from Princeton University, where he has served as a member of the faculty. Don is based in Princeton, New Jersey, USA.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Venture Partner","firm":{"name":"Advent Venture Partners","permalink":"advent-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,60],"assets/images/resized/0001/6550/16550v3-max-150x150.png"],[[250,100],"assets/images/resized/0001/6550/16550v3-max-250x250.png"],[[450,181],"assets/images/resized/0001/6550/16550v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}