{"first_name":"Donald","last_name":"Keough","permalink":"donald-keough","crunchbase_url":"http://www.crunchbase.com/person/donald-keough","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Apr 18 23:46:43 UTC 2008","updated_at":"Mon Jul 28 18:44:50 UTC 2008","overview":"<p>Don Keough is chairman of the Board of Allen &amp; Company Incorporated, a New York investment-banking firm. He was elected to that position in April 1993.</p>\n\n<p>Mr. Keough retired as president, chief operating officer and a director of The Coca-Cola Company in April 1993, positions he held since early 1981. His tenure with the Company dates back to 1950. In addition, from 1986 to 1993 he served as chairman of the Board of Coca-Cola Enterprises, Inc., the world’s largest bottling system. From 1985 to 1989, he also served as chairman of Columbia Pictures, Inc., before it was sold to Sony, Inc.</p>\n\n<p>Mr. Keough currently serves on the Boards of IAC/InterActiveCorp, YankeeNets LLC, Convera Corporation, Berkshire Hathaway Inc. and The Coca-Cola Company, to which he was elected in February 2004. In addition, he has served for many years as a member of the Boards of McDonald’s Corporation, The Washington Post Company, H. J. Heinz Company and The Home Depot.</p>\n\n<p>He is chairman emeritus of the Board of Trustees and a Life Trustee of the University of Notre Dame. He is a trustee of several other educational, charitable and civic organizations.</p>\n\n<p>Mr. Keough has received various honors in his career, including honorary doctorates from the University of Notre Dame, his alma mater Creighton University, Emory University, Trinity University in Dublin, Ireland, and Clark University. The University of Notre Dame’s highest honor, the Laetare Medal, was presented to Mr. Keough in May 1993. Mr. Keough was elected a Fellow of the American Academy of Arts &amp; Sciences in 2002 and was inducted into the Junior Achievement National Business Hall of Fame in 2003.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0002/2777/22777v1-max-150x150.jpg"],[[173,215],"assets/images/resized/0002/2777/22777v1-max-250x250.jpg"],[[173,215],"assets/images/resized/0002/2777/22777v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.beverageforum.com/bevforumbios2004.htm\" title=\"Beverage Forum\" rel=\"nofollow\">Beverage Forum</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Non-Executive Chairman","firm":{"name":"Allen & Company","permalink":"allen-and-company","type_of_entity":"financial_org","image":{"available_sizes":[[[150,11],"assets/images/resized/0016/9557/169557v3-max-150x150.png"],[[250,18],"assets/images/resized/0016/9557/169557v3-max-250x250.png"],[[450,33],"assets/images/resized/0016/9557/169557v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}