{"first_name":"Donald","last_name":"Leka","permalink":"donald-leka","crunchbase_url":"http://www.crunchbase.com/person/donald-leka","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Transmedia","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Nov 06 11:01:53 UTC 2007","updated_at":"Thu Sep 17 00:31:31 UTC 2009","overview":"<p>Donald Leka is the founder and CEO of Glide Health Corporation (GHC).</p>\n\n<p>Prior to launching GHC, Mr. Leka founded TransMedia, creator of the award winning cloud-computing platform, the Glide OS. Donald Leka provides the vision and direction for the development of the Glide OS. The most recent version of the Glide OS 3.0 was launched at The Wall Street Journal&#8217;s All Things Digital Conference hosted by Walt Mossberg.</p>\n\n<p>Prior to launching TransMedia, Mr. Leka was a co-founder and Senior Director of Healthscout iTV, for RxRemedy, an online technology and media content producer, distributor and syndicator. At RxRemedy, Mr. Leka propelled the streaming media and cable television program, HealthSCOUT iTV through strategic partnerships with Microsoft and Apple Computer and a distribution network of over 3,000 affiliates (e.g. Yahoo, USA Today, Road Runner, NBC, Juno, AT&amp;T, Prodigy).</p>\n\n<p>Previously, Mr. Leka was a co-founder and the Executive Director of The Open Society Foundation and USAID funded Fultz Foundation in Washington, DC. Mr. Leka developed and directed various international humanitarian projects focused on business development and management training including telecommunications and the Internet as well as arranging shipments of badly needed Hepatitis-B Vaccines and other supplies to Eastern Europe.  </p>\n\n<p>Mr. Leka holds a Masters in Business Administration as well as a Bachelor of Arts degree in International Relations, both from The American University in Washington D.C. During his time at The American University, Mr, Leka was a community organizer and a member of the Student Coalition Against Apartheid &amp; Racism. Mr. Leka is also a composer, arranger, and producer of classical and popular music. Throughout his career, Mr. Leka and his work have been featured in The Wall Street Journal, BusinessWeek, The Washington Post, The New York Times, The All Things Digital D6 Conference, PC Magazine, PC Today, PC World, Crain&#8217;s, InformationWeek, eWEEK, Macworld, and on CNN Financial News, CNBC, Bloomberg, CNET, The G4 Network&#8217;s Attack Of The Show, The Voice Of America and other media outlets.</p>","image":{"available_sizes":[[[129,150],"assets/images/resized/0005/9501/59501v1-max-150x150.png"],[[147,170],"assets/images/resized/0005/9501/59501v1-max-250x250.png"],[[147,170],"assets/images/resized/0005/9501/59501v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":null,"title":"CEO/Chairman","firm":{"name":"Transmedia Corporation","permalink":"transmedia","type_of_entity":"company","image":{"available_sizes":[[[128,39],"assets/images/resized/0000/1870/1870v1-max-150x150.png"],[[128,39],"assets/images/resized/0000/1870/1870v1-max-250x250.png"],[[128,39],"assets/images/resized/0000/1870/1870v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Founder, CEO","firm":{"name":"Glide Health","permalink":"glide-health","type_of_entity":"company","image":{"available_sizes":[[[150,52],"assets/images/resized/0005/8312/58312v2-max-150x150.jpg"],[[250,87],"assets/images/resized/0005/8312/58312v2-max-250x250.jpg"],[[450,156],"assets/images/resized/0005/8312/58312v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}