{"first_name":"Donald","last_name":"Southard","permalink":"donald-southard","crunchbase_url":"http://www.crunchbase.com/person/donald-southard","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Feb 10 05:50:42 UTC 2011","updated_at":"Thu Feb 10 05:52:04 UTC 2011","overview":"<p>Mr. Southard joined InfraReDx as president and chief executive officer in early 2011, bringing more than 40 years of sales, marketing and leadership experience to the company. Most recently, he was chief executive officer of Zonare Medical Systems, a company focused on developing and marketing premium performance ultrasound imaging systems. There from 2004 until 2010, he led the company’s first product launch and successfully grew sales to $50 million. From 1996 to 2004, Mr. Southard served as president of Datascope Corp., a global manufacturing and distribution company for medical capital equipment and disposable products. Prior to that, he was vice president of sales and marketing for Elscint Inc., a worldwide supplier of diagnostic medical equipment, president and chief executive officer of Serviscope Corp., a venture-backed supplier of cost-effective maintenance service and other cost-containment products to the medical imaging industry, and vice president of sales and marketing at Toshiba Medical Systems, Inc., where he oversaw U.S. medical operations. From 1981 to 1989, Mr. Southard worked at Philips Medical Systems, Inc., where he joined as eastern zone sales manager and rose to vice president of sales. He began his career at IBM, spending ten years at the company in sales and marketing positions of increasing responsibility. Mr. Southard holds a B.S. in chemistry from the University of Alabama and an Executive MBA from Babson College.</p>","image":null,"degrees":[{"degree_type":"B.S.","subject":"Chemistry","institution":"University of Alabama","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President and Chief Executive Officer","firm":{"name":"InfraReDx","permalink":"infraredx","type_of_entity":"company","image":{"available_sizes":[[[150,39],"assets/images/resized/0007/3527/73527v1-max-150x150.jpg"],[[237,63],"assets/images/resized/0007/3527/73527v1-max-250x250.jpg"],[[237,63],"assets/images/resized/0007/3527/73527v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}