{"first_name":"Donald","last_name":"Caldwell","permalink":"donald-caldwell","crunchbase_url":"http://www.crunchbase.com/person/donald-caldwell","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 21 20:01:23 UTC 2008","updated_at":"Fri Nov 21 20:12:15 UTC 2008","overview":"<p>Donald Caldwell is the founder, Chairman and Chief Executive Officer of Cross Atlantic Capital Partners Inc. Don oversees the operations of all of Cross Atlantic&#8217;s offices, adds considerable value on our portfolio boards and is involved in the growth of the Cross Atlantic franchise through fund raising, network development, and deal flow.</p>\n\n<p>Don serves on the board of several publicly and privately held companies and civic organizations, including Voxware Incorporated (NASDAQ); Rubicon Technology Incorporated (NASDAQ); Management Dynamics; Pennsylvania Academy of the Fine Arts (Chairman); the Committee for Economic Development and has been a principal in 13 IPOs.</p>\n\n<p>Until March 1, 1999, he was President and Chief Operating Officer of Safeguard Scientifics, Inc. where he also previously served as Executive Vice President. Prior to joining Safeguard in 1993, Mr. Caldwell held a number of executive and financial positions, including Chief Administrative Officer of a predecessor company of Cambridge Technology Partners, Inc. (Massachusetts), a provider of information technology consulting and software development; Executive Vice President and then President of Atlantic Financial; and as a partner in the national office of Arthur Young &amp; Co., a predecessor to Ernst &amp; Young, LLP.  </p>\n\n<p>He is a CPA in the State of New York and holds a Bachelor of Science degree from Babson College and a master of business administration from the Graduate School of Business at Harvard University. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chairman and Chief Executive Officer","firm":{"name":"Cross Atlantic Capital Partners","permalink":"cross-atlantic-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,67],"assets/images/resized/0002/9155/29155v1-max-150x150.jpg"],[[215,97],"assets/images/resized/0002/9155/29155v1-max-250x250.jpg"],[[215,97],"assets/images/resized/0002/9155/29155v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}