{"first_name":"Donald","last_name":"Burnett","permalink":"donald-burnett","crunchbase_url":"http://www.crunchbase.com/person/donald-burnett","homepage_url":"http://www.uxmagic.com","birthplace":"Michigan","twitter_username":"donnyemu","blog_url":"http://blog.donburnett.com","blog_feed_url":"http://feeds.feedburner.com/d4dotnet","affiliation_name":"Unaffiliated","born_year":1967,"born_month":12,"born_day":6,"tag_list":"don-burnett, social-media, social-networks, microsoft, disney, wpf, silverlight, expression-blend, expression-studio, training, user-experience-design, user-experience-development","alias_list":null,"created_at":"Fri Dec 31 15:48:39 UTC 2010","updated_at":"Mon Jan 03 14:59:57 UTC 2011","overview":"<p>Don is a user experience designer and developer who enjoys spending his time creating Rich Internet Applications and Multimedia creations in XAML, with Expression Blend and Expression Studio. </p>\n\n<p>He has worked in the field of Windows Development and Multimedia design for over 20 years. This includes work for such companies as Media Station, Disney Software, Universal, MediaOne, and many others. Don specializes in training and support, design and development, in WPF and Silverlight.. </p>\n\n<p>Don currently offers design and development, consulting, and training services to both individuals and businesses. Don is also a Silverlight, Expression Blend and WPF Insider. </p>\n\n<p>Don was awarded the Microsoft MVP award for Expression Blend for 2009-2010 and now 2010-2011. And formerly the Expression Studio award winner for 2008-2009 and was the former co-moderator and content editor for Microsoft&#8217;s original Phizzpop.com site that Introduced Expression Studio Products and WPF and Silverlight to the world. </p>\n\n<p>Please note that sometimes the MVP link above only works if you click on it a second time. Why? something to do with windows live authentication, not something on my end of things).\nDon is also involved with Real-time Interactive Social Business and Branding consulting with Calder Global Networks.</p>\n\n<p>About the Last Name Burnett</p>\n\n<p>Burnett is Scottish and English surname. It is derived from a nickname, from the Old French burnete, brunette, which is a diminutive of brun meaning &#8220;brown&#8221;, &#8220;dark brown&#8221;. Another proposed origin of the name is from burnete, a high quality wool cloth originally dyed to a dark brown colour.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0011/5882/115882v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0011/5882/115882v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0011/5882/115882v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}