{"first_name":"dongdong","last_name":"chen","permalink":"dongdong-chen","crunchbase_url":"http://www.crunchbase.com/person/dongdong-chen","homepage_url":"http://www.337.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"chendongdong","born_year":null,"born_month":null,"born_day":null,"tag_list":"337games, games","alias_list":null,"created_at":"Fri Jul 13 01:44:43 UTC 2012","updated_at":"Fri Jul 13 08:45:43 UTC 2012","overview":"<p>The face of games and gaming has changed dramatically in the past ten years. Whereas games used to be expensive, big deals put out by multinational companies, it is now possible for independent developers to make games at home. This means that finding well made, fun games that cost nothing to play is actually possible. Many gaming experts believe that the cost of games could very well be trending towards 0, which is great news for gamers, and great news for advertising companies who are now taking advantage of our love for games and slathering free indie games with advertisements.</p>\n\n<p>Here are a few quality (and not so quality) sites where you can play free games online.</p>\n\n<p>Yahoo Games</p>\n\n<p>Yahoo was one of the first companies to really utilize online gaming, and it is for this reason only that they find their way onto this list. I have fond memories of playing Yahoo Billiards against co-workers back in the day. How Yahoo managed to screw up what could have been a very lucrative niche is beyond me, but they really have. You can still go to Yahoo and play the old favorites, like Bejeweled, (with limited features only) and you can even potentially earn money by playing their suspiciously scammy looking &#8216;skill games&#8217;.You can do better than Yahoo games, much better.</p>\n\n<p>Free Game Rating: 4/10</p>\n\n<p>Kongregate</p>\n\n<p>A community site that lets you log in and earn achievements for your online gaming. What Yahoo games would have been if they&#8217;d had half a brain. Kongregate surpasses mere flash fun and takes independent in-browser gaming to a whole new level. You won&#8217;t just find point and click shooters and typical browser game fare here, you&#8217;ll also find incredibly well developed RPGs and many other games that quite frankly, if they&#8217;d been released before this free gaming revolution, would have been worth paying for.</p>\n\n<p>There are a myriad of games to play here, here&#8217;s one I have been playing, Remnants of Skystone, a platformer MMO which takes the concept that browser games have to be limited and simple and throws it in your face with an amazing array of customizable character options that frankly, nigh rival the Sims franchise.</p>\n\n<p>Free Game Rating: 10/10</p>\n\n<p>337games</p>\n\n<p>337games has more typical free flash games, but some of them are done very well and are actually quite challenging and interesting to play. I&#8217;ve been enjoying Mario games,\nhttp://www.337.com\nIt&#8217;s a deceptively simple game, but one that is very enjoyable, and it won&#8217;t demand that you spend your life playing it endlessly in order for you to have fun with it. 337games is a nice alternative to Kongregate if you&#8217;re looking for a litle less involvement in your gaming, but just as much fun.</p>\n\n<p>Free Game Rating: 9/10</p>","image":null,"degrees":[{"degree_type":"","subject":"","institution":"elex","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"","firm":{"name":"chendongdong","permalink":"chendongdong","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.337.com","title":""}],"web_presences":[{"external_url":"http://www.337.com","title":""},{"external_url":"http://br.337.com","title":""}]}