{"first_name":"Dornan","last_name":"In The Mix","permalink":"dornan-in-the-mix","crunchbase_url":"http://www.crunchbase.com/person/dornan-in-the-mix","homepage_url":"http://www.officialdornaninthemix.com","birthplace":"Mothwewll, Scotland","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Dornan In The Mix","born_year":1959,"born_month":6,"born_day":10,"tag_list":"music, mixes, dance, trance, house","alias_list":null,"created_at":"Tue Aug 31 21:54:05 UTC 2010","updated_at":"Tue May 29 10:41:25 UTC 2012","overview":"<p>Since 2000 I have been professionally applying my skills as a deejay, promoter. Fuelled by my own motivation and the love for the music, I excel in helping up and coming new deejays and helping them in any way I can. Having experienced the power of playing some of the best dance music and making people dance, which is absolutely thrilling. </p>\n\n<p>The beats were pounding. My heart races. My pleasure came - from seeing feeling the crowd.</p>\n\n<p>I took the people to a place where the music surges through their veins. For that moment, the music becomes them. They&#8217;re having the time - of their life. </p>\n\n<p>And at the center of it all was me! Spinning and mixing the music that overcomes the venue. It&#8217;s a feeling of fame, fun and fortune, rolled into one emotion. I was into it as much as they were. But I was still in control. And that&#8217;s what drove me. Feeling the crowd and knowing what to mix next. Keeped them going all night. This was my life. This is what it&#8217;s like being a deejay.</p>\n\n<p>I&#8217;m no 51 years of age. As a person I am not so energetic as I used to be, but still motivated by the music, this is a new time for me, moving more into track promotion than deejaying. This new move and website is all about the latest and most popular Dance, House, Trance, Electronic and &#8220;remix&#8221; music. </p>\n\n<p>The idea behind play charts was to fill a gap in the market for music playlists on the Internet. The vision was a music site where you could discover and play popular music genres from all over the world. This site was created as a &#8216;live market research project&#8217; to determine the potential opportunity for the &#8216;music playlist concept&#8217;.</p>\n\n<p>Finally I must say a big thank you everyone that as stayed with me over the years, to my very good friend DJ Val thank you from the bottom of my heart for always being there when I need help and the motivation that as kept me going over the last few years, I could not have done it without you.</p>\n\n<p>To my many fans, without you there would be no point. You are the heart and soul of Dornan In The Mix, and not forgetting Javier de Galloy over at mix.dj again I say thank you for all your help and support over the years. There are so may of out there to name, but you know who you are.</p>\n\n<p>2010 - Now part of UK Mafia Beats. The UK Mafia Beats are four of mix.dj finest Deeyays,  Dornan In The Mix, Paul Dandolion, Tim Angrave and Kris Sharp all coming together as one to bring the best collaboration mixes.</p>\n\n<p>Prepare to be entertained by 4 amazingly skillful Deejays. \nAll our mixes are recorded with a couple of things in mind. Entertaining you &amp; taking you on a journey to a musical wonderland.</p>\n\n<p>Whether it be house or trance, we select the best tunes, old or new and throw them together with attitude &amp; emotion. </p>\n\n<p>In each one of our sets we give 100%. You can hear examples of our work over at: www.officialdornaninthemix.com</p>","image":{"available_sizes":[[[128,128],"assets/images/resized/0010/0479/100479v9-max-150x150.png"],[[128,128],"assets/images/resized/0010/0479/100479v9-max-250x250.png"],[[128,128],"assets/images/resized/0010/0479/100479v9-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Owner","firm":{"name":"Dornan In The Mix","permalink":"dornan-in-the-mix","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"<iframe title=\"YouTube video player\" width=\"640\" height=\"390\" src=\"http://www.youtube.com/embed/0_-xMViGw5Y\" frameborder=\"0\" allowfullscreen></iframe>","description":"<p>Promo Video</p>"}],"external_links":[{"external_url":"http://www.mix.dj/home.html","title":"mix.dj"}],"web_presences":[{"external_url":"http://en-gb.facebook.com/officialdornaninthemix","title":"Facebook"}]}