{"first_name":"Douglas","last_name":"Kreysar","permalink":"douglas-kreysar","crunchbase_url":"http://www.crunchbase.com/person/douglas-kreysar","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":"","created_at":"Sat Mar 26 00:50:21 UTC 2011","updated_at":"Sat Mar 26 08:01:30 UTC 2011","overview":"<p>As Chief Operating Officer at Radiant Imaging, Mr. Douglas Kreysar manages Corporate Operations including production, engineering, product development, finance and accounting, legal, quality and human resources. Mr. Kreysar has utilized his engineering, optics, physics, mathematics, and management background in order to successfully implement new optical technology into production manufacturing systems, reduce design and manufacturing lead times, and improve overall product quality.\nPrior to joining Radiant Imaging, Doug worked as the head of the optical design group at North American Lighting, Inc. (NAL), a major automotive exterior lighting supplier. Mr. Kreysar executed and oversaw the execution of optical designs for vehicle lighting for the US, European, Japanese, and Australian markets. Mr. Kreysar worked with incandescent, tungsten halogen, high intensity discharge (HID), light emitting diode (LED), neon, and fiber optic light source systems. At NAL, Mr. Kreysar was responsible for the creation of design and manufacturing standards that ensured that NAL’s products were able to support the demands of increased performance at lower cost and reduced development time.\nMr. Kreysar’s graduate and undergraduate work centered on optics, spectroscopy, and laser physics. He constructed three different types of lasers, grew crystals for laser spectroscopy, and studied the fluorescence spectrum of vapors, crystals, and rare-earth doped optical fibers.</p>","image":{"available_sizes":[[[110,150],"assets/images/resized/0012/7899/127899v1-max-150x150.jpg"],[[151,205],"assets/images/resized/0012/7899/127899v1-max-250x250.jpg"],[[151,205],"assets/images/resized/0012/7899/127899v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"M.S.","subject":"Applied Physics","institution":"University of Michigan","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"COO","firm":{"name":"Radiant Imaging","permalink":"radiant-imaging","type_of_entity":"company","image":{"available_sizes":[[[150,85],"assets/images/resized/0012/7860/127860v2-max-150x150.jpg"],[[159,91],"assets/images/resized/0012/7860/127860v2-max-250x250.jpg"],[[159,91],"assets/images/resized/0012/7860/127860v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}