{"first_name":"Doug","last_name":"Carlson","permalink":"doug-carlson","crunchbase_url":"http://www.crunchbase.com/person/doug-carlson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Aug 05 05:10:28 UTC 2011","updated_at":"Fri Aug 05 05:30:23 UTC 2011","overview":"<p>Doug Carlson served as the CEO of the FIJI Water Companies from 1996 to 2005, and was responsible for FIJI Water&#8217;s ascent to the second highest selling imported bottled water brand in the U.S. by 2005. In 2003 FIJI Water became an international brand with strong sales in Great Britain, Scotland, France, Caribbean States, Puerto Rico, Mexico, Canada, and Australia. In 2004 FIJI Water was awarded the prestigious U.S. Secretary of State&#8217;s Award for Corporate Excellence for being the top small business in America. Doug was also named as one of the 50 top marketers in the U.S. by Advertising Age magazine in 2004. Prior to joining FIJI, from 1989 to mid 1996, Doug was the senior vice president and chief financial officer for The Aspen Skiing Company, a hospitality and ski resort company with 5,000 employees and $100 million in annual sales. Doug was responsible for all personnel matters, all financial matters for the Company, all risk management programs, and for the Travel Agency and Tour Operations. From 1984 to 1989, Doug served as the president and CEO of Aspen&#8217;s largest leading hospitality company, The Aspen Club Companies, a company that owned and developed the Hotel Jerome, the Aspen Club Lodge, and some 300 other units in Aspen. Doug graduated from college in 1981 with a dual degree in accounting and economics and is a Certified Public Accountant.</p>","image":{"available_sizes":[[[125,150],"assets/images/resized/0014/7968/147968v1-max-150x150.jpg"],[[209,250],"assets/images/resized/0014/7968/147968v1-max-250x250.jpg"],[[300,358],"assets/images/resized/0014/7968/147968v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Zinio","permalink":"zinio","type_of_entity":"company","image":{"available_sizes":[[[150,69],"assets/images/resized/0001/9313/19313v1-max-150x150.png"],[[170,79],"assets/images/resized/0001/9313/19313v1-max-250x250.png"],[[170,79],"assets/images/resized/0001/9313/19313v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}