{"first_name":"Doug","last_name":"Wood","permalink":"doug-wood","crunchbase_url":"http://www.crunchbase.com/person/doug-wood","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Infoglide Software Corporation","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 15 20:16:59 UTC 2008","updated_at":"Thu Jul 30 17:53:56 UTC 2009","overview":"<p>Doug Wood is responsible for all sales activities in the government and commercial markets. He has over 20 years international experience in high-profile sales and marketing roles.</p>\n\n<p>Prior to joining Infoglide Software, Mr. Wood was the senior director of global retail industry sales for Sun Microsystems, where he was responsible for all sales and go-to-market activities within a $750 million business unit.</p>\n\n<p>Prior to joining Sun, Mr. Wood was with Wincor Nixdorf Inc., a $1.8 billion technology solutions provider, as vice president of marketing and business development. In that role, Mr. Wood developed and executed sales and marketing strategies for the retail, financial, and services industries in North America. Previously, he was vice president of partner and business development for NCR Corporation in Canada, where he grew partner business from 11% to 30%. Mr. Wood has also held sales and marketing positions at Pinpoint Retail Systems and NRT Technologies Corporation.</p>\n\n<p>Mr. Wood is a member of the Association of Strategic Alliance Professionals and a five-time recipient of the Presidents Club Award for sales excellence at NCR Corporation. Mr. Wood, a Canadian citizen, holds the equivalent of an U.S. Bachelor of Arts degree in marketing.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Senior Vice President of Global Sales","firm":{"name":"Infoglide Software Corporation","permalink":"infoglide-software-corporation","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0002/2138/22138v2-max-150x150.png"],[[187,43],"assets/images/resized/0002/2138/22138v2-max-250x250.png"],[[187,43],"assets/images/resized/0002/2138/22138v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/dougwood","title":""}]}