{"first_name":"Doug","last_name":"Howard","permalink":"doug-howard","crunchbase_url":"http://www.crunchbase.com/person/doug-howard","homepage_url":"http://www.linkedin.com/in/doughoward","birthplace":"North Carolina","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1969,"born_month":null,"born_day":null,"tag_list":"vbrick, doug-howard, video, vod, live-streaming, fliqz, brightcove","alias_list":null,"created_at":"Tue May 03 23:16:30 UTC 2011","updated_at":"Sun May 08 03:24:04 UTC 2011","overview":"<p>Doug Howard brings over 20 years experience in business development, M&amp;A, operations, engineering, marketing, sales and executive leadership to his chief executive role at VBrick. Howard’s industry background includes senior leadership positions across a number of high-profile global companies in the Internet security and telecommunications sectors. </p>\n\n<p>Prior to joining VBrick, Howard served as President of USA.NET, a wholly owned subsidiary of Perimeter where he also held the Chief Strategy Officer position. While at USA.NET, Howard served as President and oversaw all aspects of the business including sales, marketing, business strategy and service delivery. Under his leadership, USA.NET experienced significant growth in both revenue and EBITDA. </p>\n\n<p>Howard previously served as Chief Operating Officer of BT Counterpane, where he led a global team responsible for the development, implementation, operations and marketing of BT Counterpane&#8217;s product and service lines. Prior to BT Counterpane, he served as Vice President of Security and Business Continuity at AT&amp;T Corp., where he developed and launched new services for each of the company&#8217;s business lines of service. </p>\n\n<p>Howard started his career in the US Air Force working under the direct command of the Joint Chiefs of Staff at the Pentagon. After the military, he moved into the private sector and held executive positions at Sprint, FLAG Telecom, Telenet and Computer Sciences Corporation (CSC). He founded Technology Research International, Inc. in 1989, which was purchased by NBC Broadcasting in 1991. Howard’s impressive business track record and industry thought leader status have earned him accolades from top analyst firms including Frost &amp; Sullivan and The Radicati Group. </p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0013/3089/133089v2-max-150x150.jpg"],[[200,250],"assets/images/resized/0013/3089/133089v2-max-250x250.jpg"],[[360,450],"assets/images/resized/0013/3089/133089v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}