{"first_name":"Douglas","last_name":"Schrier","permalink":"douglas-schrier","crunchbase_url":"http://www.crunchbase.com/person/douglas-schrier","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Rembrandt Venture Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Nov 24 04:38:05 UTC 2008","updated_at":"Wed Nov 10 18:51:35 UTC 2010","overview":"<p>Prior to joining Rembrandt Venture Partners Douglas Schrier was at Argo Global Capital since 2001 where he was a Senior Partner. Doug has been involved in funding, managing, and developing technology companies for over 20 years. His prior experience includes being Senior Vice-President for Acquisitions and Strategic Ventures at SAIC in La Jolla, CA. While at SAIC, Doug was responsible for investing over $90 million in nine companies, as well as being responsible for commercial, acquisitions and joint ventures. Doug was co-founder, COO and CFO of Multum Information Services and President of Ceon Corporation where collectively he raised over $75 million. Doug has also held positions at Salomon Brothers Inc., where he was an Associate in Venture Capital and at Prudential-Bache Capital Funding where he worked as an Associate in Corporate Finance.</p>\n\n<p>Doug has been a member of private and public boards including; Solect Technology Group (acquired by Amdocs), Multum Information Systems (acquired by Cerner Corporation), VocalData (acquired by Tekelec), Conita (acquired by Avaya), ODS networks (ODSN/NASDAQ), Ceon, Narad Networks, Digital Bridges, World Wide Packets, Cosmocom and uReach. Doug was also a board observer for investments in Nuance Communications (NUAN/NASDAQ), Nuera Communications (acquired by Audio Codes (AUDC/NASDAQ) and Convio (CNVO/NASDAQ). Doug currently sits on the boards of Electric Cloud, Proximetry, Aptana, and Zenprise. Also, Doug currently mentors through Columbia’s Private Equity Mentorship Program.</p>\n\n<p>Doug received his MBA from Columbia Business School in 1990 and his undergraduate degree in Economics/Pre-Med from DePauw University in 1986.</p>\n\n<p>When Doug is not looking for new investments, working with his portfolio companies, or spending time with his wife and two children, he spends time cycling and skiing.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0010/9235/109235v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0010/9235/109235v2-max-250x250.jpg"],[[200,300],"assets/images/resized/0010/9235/109235v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"Economics/Pre Med","institution":"De Pauw University","graduated_year":1986,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"MBA Finance","institution":"Columbia Business School","graduated_year":1990,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Rembrandt Venture Partners","permalink":"rembrant-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,48],"assets/images/resized/0002/9350/29350v5-max-150x150.png"],[[191,62],"assets/images/resized/0002/9350/29350v5-max-250x250.png"],[[191,62],"assets/images/resized/0002/9350/29350v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}