{"first_name":"Douglas","last_name":"Pulitzer","permalink":"douglas-pulitzer","crunchbase_url":"http://www.crunchbase.com/person/douglas-pulitzer","homepage_url":"http://www.ingramllp.com","birthplace":"New York","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1964,"born_month":3,"born_day":15,"tag_list":"","alias_list":null,"created_at":"Thu Oct 07 21:03:27 UTC 2010","updated_at":"Thu Oct 07 21:22:51 UTC 2010","overview":"<p>Mr. Pulitzer has practiced law for over 19 years and has expertise concentrated in technology law and related intellectual property issues. He represents a broad range of clients, from start-up entrepreneurs to multinational corporations. He has extensive experience in structuring, drafting and negotiating a wide range of transactions in the e-commerce and information technology industries, including strategic alliances, joint ventures and other partnership arrangements; trademark, copyright, patent, trade secret and technology licensing agreements; design, development and distribution agreements; agreements for technology-related services (including data center lease agreements and SLAs), outsourcing due diligence and agreements, marketing and co-branding agreements; and agreements related to the conduct of business in electronic forms and media. His practice includes strategic intellectual property asset purchases, sales, use and protection.</p>\n\n<p>Mr. Pulitzer also advises companies on issues of moving to a web-based environment and implementing an e-commerce infrastructure, setting up of and maintaining of a web presence, cloud computing, software as a service, social media issues, business and compliance issues, open source issues, privacy and data security matters and branding issues.</p>\n\n<p>Representative Matters \nProjects on which Mr. Pulitzer has worked include the representation of:</p>\n\n<p>•Bear Stearns &amp; Co. Inc.</p>\n\n<p>•Deloitte LLP </p>\n\n<p>•RiskMetrics Group, Inc. (formerly a division of JPMorgan Chase)</p>\n\n<p>•Glaceau Water Company, Inc. (predecessor entity of Energy Brands, Inc. (Vitamin Water®) that was acquired by Coca-Cola® for $4.2 Billion dollars in 2008;</p>\n\n<p>•Wild Oats Markets, Inc. (Wild Oats® was the world’s second largest natural foods retail market chain store prior to being acquired by Whole Foods in 2008)</p>\n\n<p>•Iqons, Ltd. (the world’s largest online network of creatives and professionals in fashion.)</p>\n\n<ul>\n<li>The Swatch Group</li>\n</ul>","image":null,"degrees":[{"degree_type":"BA","subject":"Economics","institution":"New York University","graduated_year":1987,"graduated_month":null,"graduated_day":null},{"degree_type":"JD","subject":"Law","institution":"Cardozo Law School","graduated_year":1991,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}