{"first_name":"Douglas","last_name":"Strasnick","permalink":"douglas-strasnick","crunchbase_url":"http://www.crunchbase.com/person/douglas-strasnick","homepage_url":"http://eqal.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"EQAL","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jul 23 15:17:57 UTC 2012","updated_at":"Wed Jul 25 10:28:23 UTC 2012","overview":"<p>As Senior Vice President for Business Development and Partner Strategy, Doug supervises all of EQAL&#8217;s current and future business development, leads the business affairs department and oversees the development and launch of all EQAL Media Networks. He is responsible for handling a diverse slate slate of business development projects, including all partner agreements and associations as well as managing all business affairs issues for EQAL&#8217;s owned and operated YouTube Channel, &#8220;U Look Haute.&#8221;</p>\n\n<p>Doug is a member of the New York and California bars, and has held past positions with prestigious law firms in both cities. Doug has also gained experience working for a top television network and a leading talent agency. His past legal career includes developing a specialty in labor, employment and executive compensation issues, and counseling various clients including corporate, media and entertainment organizations, as well as professional sports franchises and leagues. Doug has also assisted clients with all forms of development and production agreements for the acquisition, licensing, development, production and marketing of both unscripted and scripted television series, features, digital projects, and branding and marketing endeavors.</p>\n\n<p>Originally from a small town in Massachusetts, Doug graduated Phi Beta Kappa and Magna Cum Laude from Duke University and was the inaugural Frank Rothman Scholar at the University of Southern California Law School. When he&#8217;s not rooting for his Duke Blue Devils or proudly wearing his Boston sports paraphernalia, Doug can be found running on the Santa Monica beach or climbing one of LA&#8217;s fantastic hiking trails. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"SVP, Business Development and Partner Strategy","firm":{"name":"EQAL","permalink":"eqal","type_of_entity":"company","image":{"available_sizes":[[[64,90],"assets/images/resized/0001/7414/17414v8-max-150x150.png"],[[64,90],"assets/images/resized/0001/7414/17414v8-max-250x250.png"],[[64,90],"assets/images/resized/0001/7414/17414v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}