{"first_name":"Doug","last_name":"Perlson","permalink":"doug-perlson","crunchbase_url":"http://www.crunchbase.com/person/doug-perlson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"TargetSpot","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Aug 08 14:49:06 UTC 2008","updated_at":"Wed Jun 09 22:11:24 UTC 2010","overview":"<p>Doug is the Founder and CEO of RealDirect, a next generation real estate marketing platform that allows individuals and real estate professionals to harness the power of the web to sell residential real estate more efficiently, effectively and transparently.</p>\n\n<p>Prior to launching RealDirect, Doug was the Founding CEO of TargetSpot, Inc., the largest internet radio ad network and a leading online audio technology platform. Doug co-founded TargetSpot in January of 2007 with CBS Corp and Union Square Ventures and raised $10.6 million from Union Square Ventures, Bain Capital, CBS Corp and Milestone Venture Partners. </p>\n\n<p>Prior to co-founding TargetSpot, Doug served as Chief Operating Officer of Seevast, Inc. Under Doug’s leadership, his team authored complex yield optimization algorithms, designed and launched an innovative behavioral targeting network called BrightAds Cookies, and built a highly acclaimed advertiser interface. In addition, Doug led Seevast’s corporate development efforts and sourced, diligenced and closed two major acquisitions. </p>\n\n<p>Before joining Seevast, Doug was Senior Vice President, Partner Development and Operations for About.com. While there, he helped grow the Luna Network, to over one billion ad impressions per month. The Luna Network later merged into the Sprinks division, where Perlson was responsible for developing and managing the Sprinks distribution network as well as other key partnerships and operational responsibilities. At the end of 2003, Sprinks was acquired by Google.</p>\n\n<p>Prior to his career in business, Perlson had a legal career in government and private practice. An admitted attorney, he served as Counsel and Chief of Staff to a NYC Council Member and New York State Senator. Additionally, he served as an Assistant Attorney General for the State of New York in the Investor Protection and Securities bureau. Doug started his career as a real estate lawyer with the firm Allison, Kaufman and Greenberg. </p>","image":{"available_sizes":[[[103,150],"assets/images/resized/0003/7469/37469v2-max-150x150.jpg"],[[173,250],"assets/images/resized/0003/7469/37469v2-max-250x250.jpg"],[[311,450],"assets/images/resized/0003/7469/37469v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO & Co-Founder","firm":{"name":"RealDirect","permalink":"realdirect","type_of_entity":"company","image":{"available_sizes":[[[150,30],"assets/images/resized/0011/6745/116745v3-max-150x150.png"],[[250,51],"assets/images/resized/0011/6745/116745v3-max-250x250.png"],[[268,55],"assets/images/resized/0011/6745/116745v3-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"CEO","firm":{"name":"TargetSpot, Inc.","permalink":"targetspot","type_of_entity":"company","image":{"available_sizes":[[[150,111],"assets/images/resized/0002/0726/20726v1-max-150x150.jpg"],[[215,160],"assets/images/resized/0002/0726/20726v1-max-250x250.jpg"],[[215,160],"assets/images/resized/0002/0726/20726v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}