{"first_name":"Doug","last_name":"Bend","permalink":"doug-bend","crunchbase_url":"http://www.crunchbase.com/person/doug-bend","homepage_url":"http://www.bendlawoffice.com","birthplace":"","twitter_username":"DougBend","blog_url":"","blog_feed_url":"","affiliation_name":"The Law Office of Doug Bend","born_year":null,"born_month":null,"born_day":null,"tag_list":"start-up-attorney, business-lawyer, corporate-law-firm, small-business-attorney, san-francisco, california, bay-area, northern-california","alias_list":null,"created_at":"Mon Mar 07 14:35:57 UTC 2011","updated_at":"Wed May 25 17:07:41 UTC 2011","overview":"<p>Doug Bend is the principal of The Law Office of Doug Bend, a law firm focused on start-up and small businesses.  He is also the General Counsel for Modify Industries, Inc. and tIFc LLC and a Legal Mentor in The Hub Ventures Program, which provides funding and resources to a community of social entrepreneurs, and for the Young Entrepreneur Council, a non-profit dedicated to helping young entrepreneurs start successful businesses.  He prides himself in providing individuals and businesses with quality legal representation in forming, maintaining and growing business entities of many types, including corporations, limited liability companies and limited partnerships and in providing general legal advice and counsel.</p>\n\n<p>Prior to opening The Law Office of Doug Bend, Doug was a corporate attorney for a law firm in New York City before relocating to San Francisco where his brother lives.  He also served as a Judicial Clerk for the Nebraska Supreme Court and the Superior Court of the U.S. Virgin Islands. Before law school, Doug was a Legislative Assistant for U.S. Representative David Price, where he managed a portfolio of issues including tax and small business.</p>\n\n<p>Education</p>\n\n<p>Raised in Omaha, Doug is a graduate of Drake University in Des Moines, Iowa, where he graduated summa cum laude and Phi Beta Kappa with his bachelor’s degree in Political Science and History.  After completing his undergraduate studies, Doug went on to receive his master’s degree in Political Science from the University of Nebraska at Lincoln.  He later received his law degree from Georgetown University Law Center in Washington, D.C.  Consistently ranked among the top law schools in the country, Georgetown provided Doug with a superb legal education which has served him and his clients tremendously in all aspects of his work.</p>\n\n<p>Admissions</p>\n\n<p>Doug is admitted to practice law in California, New York, Nebraska, and the U.S. Virgin Islands.</p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0012/5307/125307v2-max-150x150.jpg"],[[80,80],"assets/images/resized/0012/5307/125307v2-max-250x250.jpg"],[[80,80],"assets/images/resized/0012/5307/125307v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"JD","subject":"Law","institution":"Georgetown University Law Center","graduated_year":2006,"graduated_month":null,"graduated_day":null},{"degree_type":"MA","subject":"","institution":"University of Nebraska","graduated_year":2001,"graduated_month":null,"graduated_day":null},{"degree_type":"BA","subject":"","institution":"Drake University","graduated_year":1999,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Attorney","firm":{"name":"The Law Office of Doug Bend","permalink":"the-law-office-of-doug-bend","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.bendlawoffice.com","title":"Firm webpage"},{"external_url":"http://www.linkedin.com/in/dougbend","title":"LinkedIn"}]}