{"first_name":"Doug","last_name":"Kelly","permalink":"doug-kelly","crunchbase_url":"http://www.crunchbase.com/person/doug-kelly","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Alloy Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Aug 04 13:32:15 UTC 2007","updated_at":"Thu Mar 26 20:37:54 UTC 2009","overview":"<p>Doug Kelly has worked with the partners of Alloy Ventures since 1993 and was a founding member of the firm. He currently focuses on investments in medical device companies.</p>\n\n<p>Operating experience\nTrained as a physician, Doug is a long-time venture investor with 15 years of experience in bridging the needs of the business and medical communities with novel applications of technology to create world-class companies. Prior to joining Alloy Ventures, he worked for two European venture capital firms, in business development at Ligand Pharmaceuticals, and as an independent consultant. Additionally, Doug teaches &#8220;Business 16 – Financing The Startup&#8221; at Stanford Univeristy. Doug received a BA in Biochemistry and Molecular Biology from the University of California at San Diego (1983), an MD from the Albert Einstein College of Medicine in 1988, and an MBA from Stanford University (1990).</p>\n\n<p>Current board seats\nDoug serves on the board of directors of Aegea, Arbor Surgical, Barrx, Crux Biomedical, Innvotec Surgical, KaloBios, and Novasys, and Restoration Robotics.</p>\n\n<p>Past Board Seats \nDoug has invested in many leading medical device and biotech companies, and previously served on the boards of Adiana (acquired by Cytyc/Hologic), Camitro (acquired by Arqule), Fusion Medical (acquired by Baxter), Integrated Biosystems (acquired by Stedim SA), Pharsight (acquired by Tripos), and Sapient Health Network (acquired byWebMD/Healtheon).</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Alloy Ventures","permalink":"alloy-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[113,53],"assets/images/resized/0000/3916/3916v1-max-150x150.png"],[[113,53],"assets/images/resized/0000/3916/3916v1-max-250x250.png"],[[113,53],"assets/images/resized/0000/3916/3916v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}