{"first_name":"Doug","last_name":"Durham","permalink":"doug-durham-2","crunchbase_url":"http://www.crunchbase.com/person/doug-durham-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Oct 13 23:20:22 UTC 2011","updated_at":"Sun Feb 19 20:40:06 UTC 2012","overview":"<p>Doug Durham is a 20+ year veteran of software engineering and development. Creating complex software systems has been the core of his work experience. He has held a wide variety of software development roles in industries such as aerospace and defense, healthcare practice management, manufacturing and enterprise resource planning, consumer software utilities, ecommerce, consumer web applications, internet network services, content delivery systems, and online video distribution.</p>\n\n<p>Doug’s diverse skills, education, and various leadership opportunities have shaped his career, where he has built many successful teams to solve problems using software. He applies his extensive experience and unique ability to adapt a variety of best practices, patterns, and methodologies to the software development process. Combined with rigorous engineering discipline, these factors are essential to the quality and effectiveness of the teams and products he has developed.</p>\n\n<p>In addition to his civilian career, Doug served in the Air National Guard for 21 years, retiring at the rank of Major in 2006. As a Civil Engineering officer, he performed a variety of roles worldwide in operational, theatre-level engineering resource management. Most recently, he served five months in Afghanistan in 2005 as a Design Engineer in support of Operation Enduring Freedom, and was awarded the US Army Commendation medal for his service there.</p>\n\n<p>Doug holds a B.S.E.E. degree from the University of Nebraska-Lincoln and an M.A. in Finance and Management from Webster University in St.Louis, where he graduated with distinction.</p>\n\n<p>Doug was born and raised in Omaha, Nebraska. He and his wife Shana have lived in Lincoln since 1995, and have three children.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0017/4944/174944v1-max-150x150.jpg"],[[250,250],"assets/images/resized/0017/4944/174944v1-max-250x250.jpg"],[[400,400],"assets/images/resized/0017/4944/174944v1-max-450x450.jpg"]],"attribution":"<p>Nebraska Global Management Team</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Principal & CTO","firm":{"name":"Nebraska Global","permalink":"nebraska-global","type_of_entity":"financial_org","image":{"available_sizes":[[[150,51],"assets/images/resized/0017/4941/174941v1-max-150x150.jpg"],[[250,86],"assets/images/resized/0017/4941/174941v1-max-250x250.jpg"],[[252,87],"assets/images/resized/0017/4941/174941v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}