{"first_name":"Douig","last_name":"Heise","permalink":"douig-heise","crunchbase_url":"http://www.crunchbase.com/person/douig-heise","homepage_url":"","birthplace":"Belmont, CA","twitter_username":"dnheise","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1967,"born_month":10,"born_day":29,"tag_list":"coremedia, panvidea, the-content-group, ixl, hp, hewlett-packard, clickability, bbc, web-content-management, digital-asset-management, mobile","alias_list":null,"created_at":"Mon Sep 17 15:17:36 UTC 2012","updated_at":"Mon Sep 24 18:03:18 UTC 2012","overview":"<p>Doug is the Product Marketing Director at CoreMedia, a global Web Content Management vendor with offices in Hamburg, Germany and San Francisco. Doug has over 15 years of experience as a digital media strategist and marketing specialist. Doug began his career as a co-founder and Senior Analyst with The Content Group, a San Francisco-based consulting and professional services firm that was one of the first companies to focus exclusively on the burgeoning field of digital media management. Following The Content Group, Doug served as Director of Strategy for iXL’s global Digital Media and Broadband Solutions practice where he managed teams of digital media consultants and led the development of new solution offerings for the practice. He subsequently served as Head of Strategy for BBC Technology’s North American digital media team and led product marketing efforts for Hewlett-Packard’s Digital Media Platform and Digital Content Services offering. Doug has extensive experience developing and marketing on-demand sutions and recently served as Senior Product Marketing Manager for Clickability, a leading cloud-based web content management solution, and as VP of Marketing for Panvidea, a New York based digital video software service. As an independent consultant, Doug has worked for a range of Fortune 100 companies including Visa, Microsoft, and Cisco. Doug holds a Bachelor of Arts from Stanford University and a Master of Philosophy degree from the University of Glasgow in Scotland.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0021/1668/211668v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0021/1668/211668v2-max-250x250.jpg"],[[299,450],"assets/images/resized/0021/1668/211668v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}