{"first_name":"Dr.","last_name":"Abraham Ludomirski","permalink":"dr-abraham-ludomirski","crunchbase_url":"http://www.crunchbase.com/person/dr-abraham-ludomirski","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jun 20 05:43:38 UTC 2009","updated_at":"Sat Jun 20 05:44:11 UTC 2009","overview":"<p>Dr. Ludomirski is the founder of the Vitalife Life Sciences Fund. He is an internationally renowned physician with more than 20 years experience in life sciences, with particular expertise in medical devices, eHealth, and bioinformatics.  Dr. Ludomirski founded and developed the SafeKeeping Company (remote monitoring of high risk pregnancies), which was later acquired by a leading corporation active in this area. He has been a consultant to a number of Israeli and American venture capital funds and large medical and pharmaceutical companies, including GE Medical, ATL - Philips, Medison, Matria Healthcare, and QED Technologies. He has instructed and has led several start-ups through the process of raising capital, creating strategic partnerships, establishing joint ventures, and successfully achieving regulatory clearances. He was the chairman of Sightline Technologies Ltd., a Vitalife I portfolio company sold to Stryker Corporation, and he also serves as a director of several other portfolio companies.</p>\n\n<p>Dr. Ludomirski earned his M.D. at the Sackler Tel-Aviv University Medical School and specialized in OB-GYN. Following medical school, he completed his fellowship at the University of Pennsylvania in maternal fetal medicine. He was one of the founders of the fetal surgery program and established an internationally known fetal blood-sampling registry. He served as the Director of the Maternal Fetal Medicine Division and as a Professor of OB-GYN at Temple University Medical School for three years. Dr. Ludomirski has published numerous articles in peer-reviewed journals and has lectured around the world. He has also served as a reviewer for several leading medical journals.</p>","image":{"available_sizes":[[[130,150],"assets/images/resized/0004/9811/49811v1-max-150x150.jpg"],[[136,156],"assets/images/resized/0004/9811/49811v1-max-250x250.jpg"],[[136,156],"assets/images/resized/0004/9811/49811v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"SCP Vitalife Partners","permalink":"scp-vitalife-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,70],"assets/images/resized/0004/9810/49810v1-max-150x150.jpg"],[[210,99],"assets/images/resized/0004/9810/49810v1-max-250x250.jpg"],[[210,99],"assets/images/resized/0004/9810/49810v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}