{"first_name":"Dr.","last_name":"Andrew Viterbi","permalink":"dr-andrew-viterbi","crunchbase_url":"http://www.crunchbase.com/person/dr-andrew-viterbi","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jan 02 11:53:33 UTC 2009","updated_at":"Fri Jan 02 12:07:56 UTC 2009","overview":"<p>Andrew James Viterbi, Ph.D. (Bergamo (Italy) March 9, 1935) is an Italian-American electrical engineer and businessman.</p>\n\n<p>Viterbi was born in Bergamo, Italy to Jewish parents and emigrated with them in 1939 to the United States as a refugee. His original name was Andrea, but when he was naturalized in the US, his parents changed it to Andrew, since Andrea is a female name in many English-speaking countries. Viterbi attended the Boston Latin School, and then entered MIT in 1952, studying electrical engineering. Distinguished faculty members contemporary to his education included Claude Shannon, Norbert Wiener, Robert Fano and Bruno Rossi. After receiving both his BS and his MS in Electrical Engineering in 1957 from MIT, Viterbi received his Ph.D. in digital communications from the University of Southern California.</p>\n\n<p>Viterbi was later a professor of electrical engineering at UCLA and UCSD. In 1967 he invented the Viterbi algorithm, which he used for decoding convolutionally encoded data. It is still used widely in cellular phones for error correcting codes, as well as for speech recognition, DNA analysis, and many other applications of Hidden Markov models. On advice of a lawyer, Viterbi did not patent the algorithm.[1] Viterbi also helped to develop the CDMA standard for cell phone networks.</p>\n\n<p>Viterbi was the cofounder of Linkabit Corporation, with Irwin Jacobs in 1968, a small military contractor. He was also the co-founder of Qualcomm Inc. with Dr. Jacobs in 1985. As of 2003, he is the president of the venture capital company The Viterbi Group. In 2000, Viterbi ranked 386th on the Forbes 400 list of the richest Americans, with an estimated worth of $640 million.</p>\n\n<p>In 2002, Viterbi dedicated the Andrew Viterbi &#8216;52 Computer Center at his alma mater, Boston Latin School. On March 2, 2004, the University of Southern California School of Engineering was renamed the Viterbi School of Engineering in his honor, following his $52 million donation to the school.[2] He is a member of the USC Board of Trustees.[3]. He is also on the Board of Trustees at The Scripps Research Institute.</p>\n\n<p>In September 2008, he was awarded the National Medal of Science for developing &#8220;the &#8216;Viterbi algorithm,&#8217; and for his contributions to Code Division Multiple Access (CDMA) wireless technology that transformed the theory and practice of digital communications.&#8221;</p>","image":null,"degrees":[],"relationships":[],"investments":[{"funding_round":{"round_code":"d","source_url":"http://deals.venturebeat.com/2007/05/04/provigent-system-on-a-chip-for-wireless-raises-more-cash/","source_description":"Provigent, system-on-a-chip for wireless, raises more cash","raised_amount":17000000,"raised_currency_code":"USD","funded_year":2007,"funded_month":3,"funded_day":7,"company":{"name":"Provigent","permalink":"provigent-inc","image":{"available_sizes":[[[150,31],"assets/images/resized/0003/2868/32868v3-max-150x150.jpg"],[[207,43],"assets/images/resized/0003/2868/32868v3-max-250x250.jpg"],[[207,43],"assets/images/resized/0003/2868/32868v3-max-450x450.jpg"]],"attribution":null}}}}],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}