{"first_name":"Dr","last_name":"Chris Hand","permalink":"dr-chris-hand","crunchbase_url":"http://www.crunchbase.com/person/dr-chris-hand","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Mar 26 13:51:47 UTC 2012","updated_at":"Mon Mar 26 13:52:38 UTC 2012","overview":"<p>Dr Chris Hand has over 20 years experience in the medical diagnostics industry in both in the development and commercialisation of in vitro diagnostic products. He is a director of Abingdon Health Ltd, Bioscience Ventures Ltd and Alta Bioscience Ltd and is CEO of Molecular Vision Ltd, a spin-out of Imperial College, London. </p>\n\n<p>Chris founded the medical diagnostics company Cozart Bioscience Ltd and was Chief Executive of Cozart plc, following IPO on AIM in 2004, until October 2007 when the company was sold to Concateno plc for £65 million. During this time Cozart won three SMART awards from the Department of Trade and Industry, won Millennium Product Status for its ground breaking Cozart® RapiScan on-site saliva drug testing system and acquired companies in Sweden, Spain and the UK. Chris was a non-executive director of Concateno plc until its sale to US listed Alere Inc for £147m in August 2009 and stayed with the company as consultant until June 2010. </p>\n\n<p>Prior to founding Cozart, Chris was Director of Research for the European base of DPC (now part of Siemens Healthcare Solutions) developing a wide range of immunodiagnostic kits in a variety of formats.</p>\n\n<p>He has a DPhil from the Faculty of Medicine, University of Oxford and a BSc in Applied Biochemistry from Brunel University.</p>","image":null,"degrees":[{"degree_type":"BSc","subject":"Applied Biochemistry","institution":"Brunel University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chairman and CEO","firm":{"name":"Abingdon Health ","permalink":"abingdon-health","type_of_entity":"company","image":{"available_sizes":[[[129,100],"assets/images/resized/0018/1109/181109v1-max-150x150.jpg"],[[129,100],"assets/images/resized/0018/1109/181109v1-max-250x250.jpg"],[[129,100],"assets/images/resized/0018/1109/181109v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}