{"first_name":"Dr. David","last_name":"I. Cohen","permalink":"dr-david-i-cohen","crunchbase_url":"http://www.crunchbase.com/person/dr-david-i-cohen","homepage_url":"http://www.drdavidicohennanirx.biz","birthplace":"","twitter_username":"","blog_url":"http://drdavidicohennanirx.wordpress.com","blog_feed_url":"","affiliation_name":"National Institutes of Health (NIH)","born_year":null,"born_month":null,"born_day":null,"tag_list":"dr--david-i--cohen, nanirx-therapeutics, hiv, breast-cancer, immunology","alias_list":null,"created_at":"Sun Oct 28 09:02:29 UTC 2012","updated_at":"Sat Nov 03 22:44:44 UTC 2012","overview":"<p>Dr. David I. Cohen; CEO of NaniRx</p>\n\n<p>Resident New Yorker and Harvard graduate Dr. David I. Cohen is presently the Chief Executive Officer of NaniRx in New York. The therapeutics company is at the fore-front of groundbreaking research concentrated on immunology. Most recently Dr. Cohen has made landmark discoveries in relation to finding a solution to the global problem of recurring breast cancer in women. Prior to NaniRx, Dr. David I. Cohen made constructive discoveries in the research he was conducting with his previous start-up; Inist. At this facility Dr. Cohen worked towards finding HIV vaccines as well as developing pharmaceuticals for autoimmune diseases.</p>\n\n<p>Medical training and education</p>\n\n<p>Dr. David I. Cohen spent 8 years at the oldest higher learning institute in the United States; Harvard. Here Dr. Cohen achieved his Bachelor of Arts degree majoring in Biochemistry (summa cum laude) before continuing at Harvard Medical School where he earned the status of medical doctor. After leaving Harvard, Dr. Cohen completed his residency in the field of Internal Medicine at Barnes Hospital and then continued on to complete his postdoc in Immunology at the Laboratory of Immunology, NIAID NIH. </p>\n\n<p>Professional positions and entrepreneurial ventures</p>\n\n<p>After working for the National Health Institutes for close to two decades, Dr. David I. Cohen worked for a while at Queens College conducting an ambitious research program geared at the bold task of producing a vaccine for the Human Immunodeficiency Virus (HIV). Fiscal challenges sadly thwarted the efforts of Dr. Cohen and his team of research scientists. Using this as an opportunity to venture into entrepreneurship, Dr. David I. Cohen established his first enterprise; Inist, where his research in immunology continued for some years. Presently, Dr. Cohen is the President and CEO of NaniRx Therapeutics; a New York based company, in the process of bringing leading edge scientific discoveries aspiring to a cure for cancer to fruition. Under the lead of Dr. Cohen, the company has validated and filed patents for two items relating to therapeutics for breast cancer; both suitable for further clinical development.</p>\n\n<p>Publications and patents filed</p>\n\n<p>The professional expertise of Dr. Cohen has been recorded in writing on many an occasion. He has been actively publishing since the early eighties and has a range of peer-reviewed publications in print. Dr. Cohen’s publications cover some of his substantial research in the field of immunology and awards extensive coverage of anti-HIV vaccine research conducted as well as exploration of T-cells and Tat in the fight for finding a pharmaceutical weapon against the virus. Throughout his career Dr. Cohen has filed for over thirty patents, some of which were issued nationally and internationally; including promising patents for matters in metastatic breast cancer.</p>\n\n<p>Personal</p>\n\n<p>Dr. David I. Cohen supports the Lauder Foundation and is also an avid benefactor of various charitable causes in aid of cancer research like the Komen Race for the Cure. He has two children; a daughter aged 16 and a son aged 13, both keen scholars. To keep active, Dr. Cohen enjoys playing tennis.</p>","image":null,"degrees":[{"degree_type":"BA","subject":"Biochemistry","institution":"Harvard College","graduated_year":1972,"graduated_month":null,"graduated_day":null},{"degree_type":"MD","subject":"Medicine","institution":"Harvard Medical School","graduated_year":1976,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"President and CEO","firm":{"name":"Inist","permalink":"inist","type_of_entity":"company","image":null}},{"is_past":true,"title":" President and CEO","firm":{"name":"NaniRx Therapeutics","permalink":"nanirx-therapeutics","type_of_entity":"company","image":null}},{"is_past":true,"title":"Principal Investigator","firm":{"name":"National Institutes of Health (NIH)","permalink":"national-institutes-of-health-nih","type_of_entity":"company","image":null}},{"is_past":true,"title":"Professor","firm":{"name":"Queens College","permalink":"queens-college","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.drdavidicohennanirx.info","title":"This is Dr. David I. Cohen"},{"external_url":"http://www.visualcv.com/drdavidicohennanirx","title":"Dr. David I. Cohen NaniRx Visual CV Profile"},{"external_url":"http://drdavidicohennanirx.com/","title":"Dr. David I. Cohen NaniRx on LookupPage"}]}