{"first_name":"Donald","last_name":"Spero","permalink":"dr-donald-don-spero","crunchbase_url":"http://www.crunchbase.com/person/dr-donald-don-spero","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"New Markets Growth Fund","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 26 14:54:37 UTC 2008","updated_at":"Sun Nov 30 08:45:02 UTC 2008","overview":"<p>Don is a General Partner and Co-Founder of New Markets Venture Partners. He has over 10 years of venture experience as Co-Founder and Managing Director of New Markets Venture Partners, directing the Dingman Center for Entrepreneurship, and founder and of Spero Quality Strategies (SQS), a venture capital fund that provides seed capital and mentoring for entrepreneurs. During Don’s tenure at the Dingman Center the program was ranked as the best entrepreneurial center in the country.</p>\n\n<p>While working for SQS Don took many appointments to corporate and non-profit boards at the companies which he assisted.</p>\n\n<p>Prior to starting SQS in 1992, Don served for 21 years as the founder, president and CEO of Fusion Systems Corporation, which provides high technology manufacturing systems to global customers in telecommunications, semiconductor, printing, packaging, automotive and other industries. The company conducted a successful IPO and was later acquired by Eaton Corporation. Don directed the development of Fusion’s technology, business model and operational structure. He led the company’s global strategy, built the company to over 300 employees, established 3 global offices, and took an aggressive approach to protection of intellectual property, on which he published an article in The Harvard Business Review. Don has since served as a Professor of the Practice of Entrepreneurship at UMCP.</p>\n\n<p>Don earned his bachelor’s degree in Engineering Physics from Cornell University and his Ph.D. in Physics from Columbia University. He did post-doctoral work in Physics at the University of Maryland, where his research led to the development of high intensity microwave lamps that became the core technology for Fusion Systems.</p>\n\n<p>Don is a world class rower, a U. S. national champion several times over, a member of the U. S. 1964 Olympic team, and he won the 1966 World Championships in single sculls.</p>\n\n<p>He is married and has two children.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founding Partner","firm":{"name":"New Markets Venture Partners","permalink":"new-markets-venture-partners-2","type_of_entity":"financial_org","image":{"available_sizes":[[[150,30],"assets/images/resized/0002/9665/29665v3-max-150x150.jpg"],[[250,51],"assets/images/resized/0002/9665/29665v3-max-250x250.jpg"],[[450,92],"assets/images/resized/0002/9665/29665v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}