{"first_name":"Dr. Francisco","last_name":"J Martin","permalink":"dr-francisco-j-martin","crunchbase_url":"http://www.crunchbase.com/person/dr-francisco-j-martin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"MyStrands","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jun 17 08:18:30 UTC 2007","updated_at":"Mon May 26 19:52:25 UTC 2008","overview":"<p>Francisco J Martin is a scientist, entrepreneur and specialist in artificial cognitive systems. He is the founder and former CEO of the AI firm iSOCO-Intelligent Software Components, SA. He holds a Ph.D. in Computer Science with highest honors from Technical University of Catalonia. His main research and entrepreneurial interest lies in the broad areas of distributed systems, machine learning, software engineering, and security. He is primarily devoted to the development of artificial cognitive systems and large-scale distributed systems that are highly autonomous and reliable. He is also concerned with the effective transfer of technology in today&#8217;s emerging markets.</p>\n\n<p>From 1992 to 1994, Martin was a research scholar for the Spanish Ministry of Education and Science (MEC) at the Information Systems and Computing Department (DSIC) of the Technical University of Valencia (UPV).</p>\n\n<p>In 1995, while finishing his five-year degree in computer science at the Computer Science Faculty (FIV) of the Technical University of Valencia (UPV), the Spanish Council for Scientific Research (CSIC) awarded Martin a young investigator grant (&#8220;beca de la bicicleta&#8221;) to study at the Artificial Intelligence Research Institute (IIIA-CSIC).</p>\n\n<p>During the fall of 1996, Martin was a research scholar at the School of Mathematical Sciences at the University of Bath in the United Kingdom. There he developed Noostoo, a representation language that demonstrated both that Youtoo was a useful tool to develop artificial intelligence applications, such as Noos, and that Common Lisp applications could be translated relatively easily into EuLisp.</p>\n\n<p>From 1996 to 1999, Martin received a pre-doctoral grant from the Catalan Government (DGR-CIRIT), and he worked on his Ph.D. thesis at the Artificial Intelligence Research Institute. His doctoral research was supervised by Dr. Enric Plaza. This was primarily concerned with distributed machine learning and problem-solving integrated techniques. He focused on the development of decentralized case-based reasoning agents. He implemented Plural Noos, a platform for knowledge and experience reuse among peer agents. Martin was also an active member of the Fishmarket project. He developed its first prototype and contributed a number of papers and software articles: conversation protocols, interagents, tournaments, and others.</p>\n\n<p>In 1999, nearing completion of his Ph.D., Martin founded iSOCO-Intelligent Software Components, SA, which was the first spin-off of the IIIA-CSIC. iSOCO has been specializing in developing business solutions that take full advantage of internet technology. iSOCO was awarded several prizes. These included the best R &amp; D enterprise of 2003 by the Internet Global Congress, and the 2003 first prize in the Agent Technology Competition, selected by Agentcities. iSOCO currently employs around 100 people and has offices in Barcelona, Madrid, and Valencia.</p>\n\n<p>After four years of guiding iSOCO as President &amp; CEO, he decided to step down, taking a sabbatical leave in September of 2002. He went back to the IIIA-CSIC and finished his Ph.D. in case-based sequence analysis.</p>\n\n<p>In 2003, Martin moved to Corvallis, Oregon. There he worked at the School of Electrical Engineering and Computer Science (EECS) at Oregon State University (OSU) with Professor Thomas Dietterich. With Prof. Dietterich he pursued methods for autonomous problem determination and distributed diagnosis in networked systems.</p>","image":{"available_sizes":[[[49,66],"assets/images/resized/0001/9390/19390v1-max-150x150.jpg"],[[49,66],"assets/images/resized/0001/9390/19390v1-max-250x250.jpg"],[[49,66],"assets/images/resized/0001/9390/19390v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.strands.com/corp/team.vm\" title=\"Strands\" rel=\"nofollow\">Strands</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Founder ","firm":{"name":"Strands Labs","permalink":"strands","type_of_entity":"company","image":{"available_sizes":[[[150,22],"assets/images/resized/0000/4489/4489v2-max-150x150.png"],[[217,33],"assets/images/resized/0000/4489/4489v2-max-250x250.png"],[[217,33],"assets/images/resized/0000/4489/4489v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}