{"first_name":"Dr.Gosse","last_name":"Bruinsma","permalink":"dr-gosse-bruinsma","crunchbase_url":"http://www.crunchbase.com/person/dr-gosse-bruinsma","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 19 13:30:30 UTC 2009","updated_at":"Sat Jun 20 02:31:02 UTC 2009","overview":"<pre><code>*  Dr. Bruinsma has more than 20 years experience in the biotechnology and pharmaceutical industries. Dr. Bruinsma most recently served as Executive Chairman of Curidium Medica plc, an AIM-listed company in London and prior to that as Director, President and CEO of Axonyx Inc. a publically traded company in New York until he successfully merged the company with a private USA-based company in October 2006. He was also President of Axonyx Europe BV between October 2000 and October 2006.\n* In addition, he was European Medical Director for Zambon, Milan; VP for Medical and Regulatory Affairs for ClinTrials Research, UK; Medical Director for Forest Laboratories in New York; General Manager and VP Development for Chrysalis Clinical Services Europe, Switzerland and VP Development for Crucell BV Leiden Netherlands.\n* Dr. Bruinsma received his undergraduate degree from McGill University, Montreal and his medical degree from the University of Leiden, The Netherlands. He currently also serves as Director on the Supervisory Board of Agendia BV based in Amsterdam as well as non-executive Director with Curidium Medica plc, London.\n</code></pre>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Executive Director","firm":{"name":"Vivendy Therapeutics","permalink":"vivendy-therapeutics","type_of_entity":"company","image":{"available_sizes":[[[150,58],"assets/images/resized/0004/9649/49649v1-max-150x150.png"],[[150,58],"assets/images/resized/0004/9649/49649v1-max-250x250.png"],[[150,58],"assets/images/resized/0004/9649/49649v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}