{"first_name":"Dr. Gordon","last_name":"T. Austin","permalink":"dr-gordon-t-austin","crunchbase_url":"http://www.crunchbase.com/person/dr-gordon-t-austin","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jul 16 10:09:03 UTC 2012","updated_at":"Mon Jul 16 21:00:21 UTC 2012","overview":"<p>Dr. Gordon T. Austin Recommends Georgia Medicaid </p>\n\n<p>It&#8217;s important to have dental insurance because dental work can be very expensive. Most dental work is necessary for your health, so you can&#8217;t afford not to be able to pay for it. Retired dentist Dr. Gordon T. Austin recommends that low income patients in Georgia use Medicaid to cover their dental needs.</p>\n\n<p>Medicaid is a government-run insurance program. The rules and requirements vary from state to state, so you have to check with your state&#8217;s Medicaid office to find out if you qualify. This insurance allows low-income patients to pay little or nothing for insurance and for doctor&#8217;s and dentists&#8217; visits.</p>\n\n<p>There are several advantages to applying for Medicaid if you have limited financial resources.</p>\n\n<ol>\n<li>Medicaid can help you afford health care. Nobody should skip doctor&#8217;s or dentist&#8217;s visits because of limited income. </li>\n<li>Doctors and dentists that accept Medicaid probably care about the health of low income people. Doctors who care more about money than patients usually don&#8217;t accept Medicaid.</li>\n<li>Medicaid usually reimburses doctors and dentists quickly. This makes health care professionals more likely to work with this program.</li>\n</ol>\n\n<p>The major disadvantage of the Medicaid program is that you have to use health care professionals who are part of this program. Since not all dentists take Medicaid, you may be more limited in terms of what dentists you can visit.</p>\n\n<p>Dr. Gordon T Austin: Medicaid Supporter</p>\n\n<p>Dr. Gordon T Austin always accepted Medicaid when he was in practice in Georgia. Medicaid reimbursed him within a few days for every procedure he did. This convinced him that it&#8217;s possible for insurance companies to pay dentists in a timely manner.</p>\n\n<p>As a result of his experiences with the Georgia Medicaid system, patient advocate Dr. Gordon T. Austin got involved in health care reform. Retired dentist Dr. Gordon T. Austin testified before Congress, saying that if Medicaid could pay quickly, other insurance companies can too. Georgia dentist Dr. Gordon T Austin supports legislation requiring all insurance to pay dentists on time so that dentists can provide all patients with quality care. </p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/1139/201139v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/1139/201139v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/1139/201139v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}