{"first_name":"Dr.","last_name":"Ganesh Devaraj","permalink":"dr-ganesh-devaraj","crunchbase_url":"http://www.crunchbase.com/person/dr-ganesh-devaraj","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Soliton Technologies","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Feb 25 17:52:44 UTC 2009","updated_at":"Mon Jul 27 20:50:44 UTC 2009","overview":"<p>Ganesh founded Soliton in 1998, and has since established the company as the leader in India in the business areas in which it operates.</p>\n\n<p>Ganesh was selected as one of the ‘101 Successful Entrepreneurs of Tamil Nadu’ by CII in 2008 based on the innovative work done by Soliton. He also was profiled by the India Today magazine as a new economy player to watch in 2001. Ganesh also serves on the Board of Directors of ELGI Equipments Ltd (www.elgi.com) and on the Board of Trustees of the PSG &amp; Sons Charities, which manages the well known PSG College of Technology (www.psgtech.edu).</p>\n\n<p>Previously, Ganesh worked as a Project Scientist at V I Engineering, Inc., Michigan, a leading National Instruments Alliance Member in the US. Ganesh received his Ph.D. in Theoretical Particle Physics (1996) and M.S. in Electrical Engineering (1992), both from the University of Michigan, Ann Arbor, and his B.E. in Electronics and Communication Engineering from the PSG College of Technology, Coimbatore.</p>\n\n<p>From the age of 15, for a period of six years, Ganesh was fully involved in tuning racing engines and racing cars and he won the Grand Prix in the most competitive racing category in India in 1987, 88, and 89. Today his interest is in education, and he is keen to understand how multimedia could be used to improve the quality of education in areas where there is a scarcity of teachers. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Soliton Technologies","permalink":"soliton-technologies","type_of_entity":"company","image":{"available_sizes":[[[146,71],"assets/images/resized/0004/2545/42545v1-max-150x150.png"],[[146,71],"assets/images/resized/0004/2545/42545v1-max-250x250.png"],[[146,71],"assets/images/resized/0004/2545/42545v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}