{"first_name":"Dr.","last_name":"Holly Atkinson","permalink":"dr-holly-atkinson","crunchbase_url":"http://www.crunchbase.com/person/dr-holly-atkinson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Dec 17 13:16:52 UTC 2008","updated_at":"Wed Dec 17 13:19:01 UTC 2008","overview":"<p>Dr. Holly G. Atkinson is a physician, award-winning medical journalist and noted professional speaker who has engaged national audiences on a wide range of medical topics for more than 20 years. She holds degrees in both medicine and journalism and has had extensive experience as a medical correspondent, including assignments with NBC&#8217;s Today show and The CBS Morning News. She has worked in print, broadcast television and online media for both medical professional and consumer audiences.</p>\n\n<p>Dr. Atkinson is an assistant clinical professor in the Department of Medicine and Co-director of the Advancing Idealism in Medicine Program at Mount Sinai School of Medicine, and an adjunct professor of public health at Weill Medical College of Cornell University. In addition, she is medical editor-in-chief of www.everydayhealth.com, a leading health website. She is also past president and a member of the board of directors of Physicians for Human Rights, a Nobel Peace Prize-winning health and human rights organization.</p>\n\n<p>Dr. Atkinson was the Chairwoman of iVillage Health Initiatives and resident physician on iVillage.com. She was also a founder as well as President and CEO of Reuters Health Information, Inc. Prior to joining Reuters, Dr. Atkinson was at Lifetime Medical Television for 10 years where she served as Senior Vice President of Programming, overseeing all of the continuing medical education programs aired on the network.</p>\n\n<p>Dr. Atkinson was also the founding editor of the consumer newsletter HealthNews for the Massachusetts Medical Society, publisher of the New England Journal of Medicine, and served as its editor-in-chief for more than 12 years. Dr. Atkinson has also been a columnist for New Woman magazine and a resident physician on DrWeil.com and iVillagehealth.com.</p>\n\n<p>Dr. Atkinson has an MD from the University of Rochester School of Medicine and Dentistry, and an MS from the Columbia University Graduate School of Journalism. She graduated Phi Beta Kappa from Colgate University with a BS in biology. She is a Fellow of the American College of Physicians.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Advisor","firm":{"name":"Health Venture Group, LLC","permalink":"health-venture-group-llc","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}