{"first_name":"Dr.","last_name":"Hosein Khajeh-Hosseiny","permalink":"dr-hosein-khajeh-hosseiny","crunchbase_url":"http://www.crunchbase.com/person/dr-hosein-khajeh-hosseiny","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Nov 24 23:43:55 UTC 2008","updated_at":"Mon Nov 24 23:47:24 UTC 2008","overview":"<p>Dr. Khajeh-Hosseiny has served as Managing Director and Head of Global Private Equity Investments of Northgate since 2004. In addition, he leads Northgate&#8217;s London office. Prior to Northgate, Dr. Khajeh-Hosseiny served as Head of Global Private Equity Investments at the McKinsey Investment Office (&#8220;MIO&#8221;), an organization with $3 billion under management and a wholly owned subsidiary of McKinsey &amp; Company. Prior to MIO, Dr. Khajeh-Hosseiny was a senior management consultant with the Private Equity and Asset Management Practices of McKinsey &amp; Company. While at McKinsey, he advised top global and European investment firms and government agencies on their respective investment strategies and capabilities; advised top global and European investment firms on acquisitions, alliances, and restructurings; and co-led McKinsey&#8217;s Excellence in U.S. and European Private Equity Initiative. He is a frequent speaker at, and has served as chairman for, certain leading industry events on private equity, real estate, and risk management. In addition, he serves as a Senior Advisor to McKinsey &amp; Company.</p>\n\n<p>Dr. Khajeh-Hosseiny holds a Ph.D. in Applied Mathematics and Econometrics from Cambridge University. From Cambridge University he also received an honorary research position and lectured on research methods, finance, and investments.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Head of Global Private Equity Investments","firm":{"name":"Northgate Capital","permalink":"northgate-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,44],"assets/images/resized/0002/9482/29482v1-max-150x150.jpg"],[[250,74],"assets/images/resized/0002/9482/29482v1-max-250x250.jpg"],[[357,106],"assets/images/resized/0002/9482/29482v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}