{"first_name":"Dr.","last_name":"Ingo Potthof","permalink":"dr-ingo-potthof","crunchbase_url":"http://www.crunchbase.com/person/dr-ingo-potthof","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Dec 01 08:50:10 UTC 2008","updated_at":"Mon Dec 01 08:55:04 UTC 2008","overview":"<p>Prior to co-founding smac partners, Ingo was investment partner within Siemens Acceleration in Communications from its inception in 2001. He led numerous first and follow-on investments, mainly in Europe and Israel, and in particular was responsible for all investment activities in Israel. His exits include GoNetworks (acquired by Nextwave Inc.), scaraboo (acquired by BGT AG) and Ki-Bi Technologies (LSE: KIB).</p>\n\n<p>Earlier Ingo worked with the telecom operator O2 in Munich. He was involved in overall strategy development and strategic business planning. As project manager he developed the UMTS auction strategy. As head of Mergers &amp; Acquisitions he took corporate wide responsibility for all equity investments. His project experience spans investments in a variety of segments, including city carriers, cable carriers and Internet start-ups.</p>\n\n<p>Previous to that, Ingo was a management consultant for various international companies such as RWE, IBM, SAP and institutions such as the World Bank in the areas of IT, finance and strategy. During this period he was also a lecturer and researcher at the University of Erlangen-Nuremberg, where he gained his doctorate in the analysis and assessment of investment decisions in the IT sector. Ingo received a degree in computer science and business administration from the University of Mannheim.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0003/0392/30392v1-max-150x150.jpg"],[[165,247],"assets/images/resized/0003/0392/30392v1-max-250x250.jpg"],[[165,247],"assets/images/resized/0003/0392/30392v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Partner and Co-Founder","firm":{"name":"Smac Partners","permalink":"smac-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,80],"assets/images/resized/0003/0388/30388v1-max-150x150.jpg"],[[215,115],"assets/images/resized/0003/0388/30388v1-max-250x250.jpg"],[[215,115],"assets/images/resized/0003/0388/30388v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}