{"first_name":"Dr","last_name":"John R. Busch","permalink":"dr-john-r-busch","crunchbase_url":"http://www.crunchbase.com/person/dr-john-r-busch","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jan 01 12:32:35 UTC 2009","updated_at":"Thu Jan 01 12:33:21 UTC 2009","overview":"<p>Dr Busch is a co-founder of Schooner Information Technology.\nPrior to Schooner, Dr Busch was Research Director of Computer System Architecture and Analysis at Sun Microsystems laboratories from 1999 through 2006, where he led research explorations in chip-multi-processing, advanced multi-tier clustered systems for deployment of internet based services, and advanced HPC systems.\nDr Busch received the top Presidents Award for Innovation at Sun, and effected many division technology transfers. Prior to Sun, John was VP of Engineering and Business Partnerships with Diba Inc, and was general manager of the Diba Division after Sun acquired Diba in 1997. From 1989 to 1994, John was co-founder and CTO/VP of Engineering of Clarity Software, and led creation of advanced multi-media composition and communication products for Sun, HP, and IBM computer systems (awarded Unix World Product of the Year). From 1976 to 1993, Dr Busch lead many successful R&amp;D programs at Hewlett Packard in Computer Systems Research and Development. John holds a Ph.D. in Computer Systems Architecture from UCLA, a Masters degree in Mathematics from UCLA, a Masters degree in Computer Science from Stanford University, and attended the Sloan Program at Stanford University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chairman and CTO","firm":{"name":"Schooner Information Technology","permalink":"schooner-information-technology-inc","type_of_entity":"company","image":{"available_sizes":[[[150,31],"assets/images/resized/0003/2823/32823v4-max-150x150.jpg"],[[250,52],"assets/images/resized/0003/2823/32823v4-max-250x250.jpg"],[[450,94],"assets/images/resized/0003/2823/32823v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}