{"first_name":"DR.","last_name":"JERZY W. BALA","permalink":"dr-jerzy-w-bala","crunchbase_url":"http://www.crunchbase.com/person/dr-jerzy-w-bala","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Apr 25 13:26:36 UTC 2011","updated_at":"Mon Apr 25 13:28:58 UTC 2011","overview":"<p>Dr. Jerzy Bala is the key architect of InferX&#8217;s product suite and is a noted expert in decision support systems, distributed data mining, machine learning, automatic target recognition, genetic algorithms, advanced visualization and intelligent information retrieval and extraction. During his 12 year career, he served as a Principle Investigator engaged in a number of projects supporting the Navy, Air Force, DARPA, MDA and the National Imagery and Mapping Agency.</p>\n\n<p>Dr. Bala has conceived several new data mining techniques; among them, a distributed machine learning-based mining approach (InferAgent), a data mining approach geared towards the interactive acquisition and display of visual knowledge representations (InferView), data mining approaches for rule induction from computer vision generated data, a Genetic Algorithms-based approach for knowledge model refinement, and a machine learning-based cleansing approach for highly contaminated data environments. His Ph.D. thesis described a class of symbolic machine learning-based mining techniques for inferring visual concept descriptions from low-level sensory databases. His research has produced 90 publications in the form of book chapters, journals and conference proceedings.</p>","image":null,"degrees":[{"degree_type":"Master of Science ","subject":"Electrical Engineering","institution":"AGH University of Science and Technology","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CHIEF TECHNOLOGY OFFICER & CO-FOUNDER","firm":{"name":"InferX","permalink":"inferx","type_of_entity":"company","image":{"available_sizes":[[[150,59],"assets/images/resized/0013/1903/131903v1-max-150x150.jpg"],[[177,70],"assets/images/resized/0013/1903/131903v1-max-250x250.jpg"],[[177,70],"assets/images/resized/0013/1903/131903v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}