{"first_name":"Dr. Jesse","last_name":"Stoff","permalink":"dr-jesse-stoff","crunchbase_url":"http://www.crunchbase.com/person/dr-jesse-stoff","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 24 11:18:47 UTC 2012","updated_at":"Thu Jul 26 04:34:08 UTC 2012","overview":"<p>Dr. Jesse Stoff is widely known as an expert immunologist who is passionate about treating all of his patients with care and compassion. Early in his career, he established himself as a doctor who could effectively work with patients who suffer from difficult diseases and chronic illnesses like cancer. Recently, Dr. Stoff has turned his studies towards Applied Clinical Immunology. This type of medicine combines both Western and holistic remedies to strengthen people&#8217;s immune systems and help their bodies fight off disease.</p>\n\n<p>Education</p>\n\n<p>Dr. Stoff believes that education is the key to providing expert care to his patients. Applied Clinical Immunology requires the latest up to date information and an advanced knowledge of how the human body reacts to certain treatments. Without continually learning, Dr. Stoff believes that you cannot judge how the human body will react to both holistic and Western treatments.</p>\n\n<p>Dr. Stoff started his career in 1976 when he graduated from Adelphi University in New York. After graduation he attended New York Medical College where he got his doctorate in 1981. He is constantly looking to broaden his horizons through work experience and continuing his education.</p>\n\n<p>Experience</p>\n\n<p>Family Practice Residency – Dr. Jesse Stoff was a resident physician at Glen Cove Community Hospital where he stayed from 1981-1982. Here he learned the ins and outs of the healthcare system. It was an educational experience which helped mold him into what he is today.</p>\n\n<p>Fellowship In Emergency – Dr. Stoff spent 1982-1983 in Frankfurt Michigan working on his fellowship of emergency medicine and emergency surgery. He spent those years at the Paul Oliver Memorial Hospital. This period of training helped him develop his specialty; after he graduated this program he was knowledgeable enough to practice medicine without direct supervision.</p>\n\n<p>Fellowship in Clinical Medicine – Dr. Stoff was not satisfied with being an expert in just emergency procedures. He decided to take part in another fellowship in clinical medicine at Bloomsbury Health Authority in London. This study abroad program let Dr. Stoff expand his horizons and take a worldly view of how medicine is studied.</p>\n\n<p>Dr. Jesse Stoff works hard to educate himself so that he can treat his patients in the most effective manner. He believes that constant studying and worldly experiences can benefit him, which in turn benefits his patients with up to date treatment options. He diligently studies the immune system to try to thwart disease by enabling the body to fight it more effectively. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}