{"first_name":"Dr","last_name":"Lily CHAN","permalink":"dr-lily-chan","crunchbase_url":"http://www.crunchbase.com/person/dr-lily-chan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Nov 22 07:06:44 UTC 2008","updated_at":"Sun Nov 23 08:19:14 UTC 2008","overview":"<p>Dr Lily Chan is Chief Executive Officer of NUS Enterprise at the National University of Singapore. She leads NUS Enterprise with vision to inject an enterprise dimension to NUS teaching and research involving the University&#8217;s students, staff and alumni. In particular, Dr Chan spearheads strategies and initiatives to promote industry collaboration and business ventures for the University. She oversees the functions of the Enterprise Cluster which complements the academic cluster of the University to nurture talents with an entrepreneurial and global mindset. The Enterprise Cluster comprises three main divisions – NUS Overseas Colleges (NOC), Industry Liaison Office (ILO) and NUS Entrepreneurship Centre (NEC), which are supported by Corporate Services and the following Business units – NUS Extension (NEX), NUS Press and NUS Technology Holdings Pte Ltd (NTH).</p>\n\n<p>Prior to joining NUS in 2006, Dr Chan held the position of Managing Director, Investments, of Bio*One Capital Pte Ltd, an investment arm of the Singapore Economic Development Board with focus in expanding the growth of biomedical science industry in Singapore. Dr Chan brings with her more than 20 years of biomedical industry experiences, from initiating start-ups, venture investments and active Board involvements in many biotech companies. A company founded under her leadership included ES Cell International Pte Ltd, founded with technologies licensed from NUS, Universities of Monash (Australia) and Hadassah (Israel).</p>\n\n<p>Dr Chan obtained her honours degree in Biology, at the Agnes Scott College, Atlanta, Georgia, USA. She completed her PhD (Microbiology and Immunology) in 1981, at the University of Illinois at the Medical Center, Chicago, Illinois, USA. Dr Chan started her career as a research scientist with the NUS Department of Medicine (1981-1983). One of the first research scientists to be hired in the Department, her research focus areas then were hepatitis and liver cancer, epidemiology, tumour markers and diabetes. She went on to become the QC/Technical Manager for Singapore Biotech Pte Ltd, Singapore (1984-1986) and was a postdoctoral research associate with the Department of Pathology, Tufts University, Boston, Massachusetts, USA (1986-1987). During 1987-1995, she assumed positions of increasing responsibilities, from a Manager in product development to subsequently becoming the General Manager (S&#8217;pore) and Director of Product Development (USA) for Genelabs Diagnostics Pte Ltd Singapore. Between 1995-1998, she was the Deputy Director, Bioprocessing Technology Centre, NUS (1995-1998).</p>\n\n<p>Dr Chan holds two US patents &#8211; for HIV1/HIV2 viral detection kit and method as well as for dengue virus peptides and methods. Both are now commercial products and one has become the confirmatory gold standard for retroviral testings in Europe. She has another patent pending for tuberculosis antigens and novel liver antigens. She has published more than 20 international journal publications.</p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0002/9222/29222v1-max-150x150.jpg"],[[80,80],"assets/images/resized/0002/9222/29222v1-max-250x250.jpg"],[[80,80],"assets/images/resized/0002/9222/29222v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Executive Officer ","firm":{"name":"National University of Singapore","permalink":"national-university-of-singapore","type_of_entity":"financial_org","image":{"available_sizes":[[[139,63],"assets/images/resized/0002/9218/29218v1-max-150x150.jpg"],[[139,63],"assets/images/resized/0002/9218/29218v1-max-250x250.jpg"],[[139,63],"assets/images/resized/0002/9218/29218v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}