{"first_name":"Dr Laith","last_name":"Barnouti","permalink":"dr-laith-barnouti","crunchbase_url":"http://www.crunchbase.com/person/dr-laith-barnouti","homepage_url":"http://www.drbarnouti.org.au/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Sydney Plastic Surgery","born_year":1973,"born_month":null,"born_day":null,"tag_list":"dr-barnouti, plastic-surgery, sydney, cosmetic-surgery, australia, breasts, beauty","alias_list":null,"created_at":"Sun Aug 26 12:33:47 UTC 2012","updated_at":"Thu Aug 30 11:22:00 UTC 2012","overview":"<p>The present plastic surgery era has distinctly shaped facial beauty today by specific measurements and angles which in turn enhance and beautify a face. Dr Barnouti&#8217;s minimally invasive surgery has brought upon a global approach to facial rejuvenation and in turn creates the most significant results.\nPatients approach Dr Barnouti&#8217;s clinics looking tired, unhealthy, sad or lethargic and Dr Barnouti feels it is his mission to identify where improvement is required in the facial areas. A comprehensive facial analysis is consequently carried out based on beauty dimensions and a plan is formulated and presented to the patient.\nFor many, Dr Barnouti offers them his experience and words of wisdom and closely guides them as they embark upon their cosmetic surgery journeys from the surgery itself and his care and advice to the follow up consultations. Dr Barnouti guarantees to put a smile on his patients&#8217; faces and give them the confidence to return for further surgery in the future.  </p>\n\n<p>Dr Barnouti says his accomplishments are all due to the four important aspects that guide him in his success. The main aspect he stresses is the emphasis he places on short scar methods and is accompanied by his competence in forming an understanding of his patients&#8217; desires and realization of these desires. Another aspect is whereby Dr Barnouti plays a significant role in keeping up to date with all the modern and highly esteemed methods and techniques that are performed worldwide and in providing the Australian public with this latest information.<br/>\nBy placing great importance on minimal invasion and short scaring in the surgical procedures he performs, Dr Barnouti strongly highlights the natural beauty of the breast, body and face in cosmetic surgery with safety of his patients as the leading consideration at\n all times. Dr Barnouti consults in Broadway, Chatswood and Burwood in Australia.</p>","image":null,"degrees":[{"degree_type":"MBBS, FRACS(plastic).","subject":"Plastic Surgery","institution":"FRACS","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Surgeon","firm":{"name":"Sydney Plastic Surgery","permalink":"sydney-plastic-surgery","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.drbarnouti.net.au/","title":"Who is Dr Barnouti"}]}