{"first_name":"Dr.","last_name":"Mark Campbell","permalink":"dr-mark-campbell","crunchbase_url":"http://www.crunchbase.com/person/dr-mark-campbell","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri May 15 11:09:38 UTC 2009","updated_at":"Fri May 15 12:52:33 UTC 2009","overview":"<p>As CTO, Campbell leads Unitrends’ solution roadmap, technology architecture, and strategic product and business planning.\nPrior to joining Unitrends, Campbell co-founded mindAmp after several years of individual high-technology business and software development consulting. Previously, he worked as the Senior Vice President of the Systems Management Business at Legent Corporation, where he was responsible for all of Legent&#8217;s Systems Management products (which constituted over 90% of Legent&#8217;s $500M+ in revenue) and thus led over one thousand marketing, product managers, project managers, and software developers in the United States and Europe. Mark left Legent after successfully helping steer the company in its acquisition by Computer Associates.\nBefore joining Legent, Mark was a vice president at NCR Corporation where he had profit and loss responsibility for its $1.5B+ server business. He was also responsible for over fifteen hundred developers in the United States, India, and China.</p>\n\n<p>Mark earned a bachelor’s degree (cum laude), a master’s degree, and a doctoral degree in electrical and computer engineering from the University of South Carolina. He also graduated from leadership and international management training at INSEAD (France).</p>\n\n<p>The doctoral work that Mark completed, coupled with his corporate software engineering leadership and development work, form much of the basis of the internal practices of mindAmp Corporation. This doctoral work concerned the pursuit of a new framework for quantitatively determining and understanding the behavioral differences between the very best software developers and all other software developers. mindAmp Corporation has an on-going research relationship with the University of South Carolina to further develop this important area of software engineering. </p>","image":{"available_sizes":[[[109,150],"assets/images/resized/0004/4231/44231v1-max-150x150.jpg"],[[125,171],"assets/images/resized/0004/4231/44231v1-max-250x250.jpg"],[[125,171],"assets/images/resized/0004/4231/44231v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"doctoral degree","subject":"electrical and computer engineering","institution":"University of South Carolina","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chief Operating Officer and Chief Technology Officer","firm":{"name":"Unitrends Software","permalink":"unitrends-software","type_of_entity":"company","image":{"available_sizes":[[[150,75],"assets/images/resized/0004/4197/44197v1-max-150x150.jpg"],[[250,125],"assets/images/resized/0004/4197/44197v1-max-250x250.jpg"],[[300,150],"assets/images/resized/0004/4197/44197v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}