{"first_name":"Dr.","last_name":"Marion Blank","permalink":"dr-marion-blank","crunchbase_url":"http://www.crunchbase.com/person/dr-marion-blank","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Mojo Learning","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jul 11 21:32:00 UTC 2012","updated_at":"Sun Jul 15 11:57:19 UTC 2012","overview":"<p>Dr. Blank is a developmental psychologist with a specialization in language (both spoken and written) and learning. She is on the faculty of the Department of Child Psychiatry at Columbia University where she serves as Director of the Light on Learning Program. In December 2010, she received the Upton Sinclair Award in Education  which honors individuals who have made a significant contribution to education. She has worked extensively overseas and has served as a consultant to government bureaus in England, Holland, Israel and Australia. In addition, she serves as a consultant to a wide range of school districts in the tri-state area of New York, New Jersey and Connecticut.  </p>\n\n<p>Dr. Blank has spent over forty years studying how children learn to read and is recognized by her peers as one of the top experts in literacy. She is the creator of the online reading program, the Reading Kingdom which is the only program available that teaches the full set of skills children need to learn how to read and write. She has lectured extensively around the world, authored over sixty articles and six books on language, and developed the award-winning and highly successful “Sentence Master” computer program that teaches reading. She has used her reading system to help thousands of children – both strong and struggling readers – learn how to read.  Her most recent book The Reading Remedy: The Six Essential Skills to Turn Your Child into a Reader. Described by Kirkus Reviews as &#8220;an invaluable resource,&#8221; The Reading Remedy explains Dr. Blank&#8217;s reading system in depth.</p>\n\n<p>In 1994 and 1995, she was selected as the New Jersey nominee for the Frank R. Kleffner Clinical Career Award of the American Speech-Language Hearing Association.  In 1990, she developed a software reading program, Sentence Master, which received the Special Education Software Award of 1990 from the Software Publishers Association and a Certificate of Achievement in the Johns Hopkins University National Search.  In 1991, she  co-authored a book, A Parent&#8217;s Guide to Educational Software (Microsoft Press) that reviewed over 200 software programs parents may use at home to foster their children&#8217;s education.  Her books Directing School Discourse (1994) and Directing Early Discourse (1995) provide unique methods for fostering language skills in children who are experiencing school difficulties.  She is also the principal author of the Preschool Language Assessment Instrument (PLAI), a test published in both in English and Spanish, that is designed to assess the verbal communication skills of children in the preschool years.</p>\n\n<p>For 10 years (from 1973 to 1983), she was a Professor in the Department of Psychiatry at Rutgers Medical School.  In that capacity, she served as the director of a research unit in reading disabilities.  From 1960 to 1973, she was on the faculty of the Department of Psychiatry at the Albert Einstein College of Medicine in New York.  Her work there included serving as the Director of the teaching program of the Interdisciplinary Training Program, participating in a research unit on human behavioral development (with a focus on poverty and handicapped populations) and service on the Women&#8217;s Rights Committee.</p>\n\n<p>Dr. Blank has had a long-standing interest in designing large scale programs that can effectively and economically address significant social (health and education) problems.  To help her pursue this goal, she completed a Masters Degree in Public Health in 1988.</p>","image":{"available_sizes":[[[101,150],"assets/images/resized/0020/0828/200828v2-max-150x150.jpg"],[[169,250],"assets/images/resized/0020/0828/200828v2-max-250x250.jpg"],[[305,450],"assets/images/resized/0020/0828/200828v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"","institution":"City College of New York","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"BA","subject":"","institution":"City College of New York","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chairperson","firm":{"name":"Mojo Learning","permalink":"mojo-learning","type_of_entity":"company","image":{"available_sizes":[[[150,84],"assets/images/resized/0020/0309/200309v2-max-150x150.png"],[[250,140],"assets/images/resized/0020/0309/200309v2-max-250x250.png"],[[296,166],"assets/images/resized/0020/0309/200309v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}