{"first_name":"Dr. Marc","last_name":"Torrens","permalink":"dr-marc-torrens","crunchbase_url":"http://www.crunchbase.com/person/dr-marc-torrens","homepage_url":"http://www.marctorrens.com","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"MyStrands","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jun 17 08:21:27 UTC 2007","updated_at":"Mon May 26 20:00:34 UTC 2008","overview":"<p>Marc Torrens is an innovator and engineer specializing in huge volume data-processing. Co-founder and CTO of Iconomic Systems acquired by i:FAO AG. Ph.D. Computer Science from Swiss Federal Institute of Technology</p>\n\n<p>He graduated in 1997 from the Technical University of Catalonia in Barcelona with a degree in Computer Science. From September 1996 to June 1997 he was completing his studies as an exchange student at the Artificial Intelligence Lab of the Swiss Federal Institute of Technology in Lausanne (EPFL), Switzerland . During that period, he developed the first version of the well-known Java Constraint Library which is currently used by many public and private institutions around the world.</p>\n\n<p>He obtained a Ph.D. degree in 2002 from the Swiss Federal Institute of Technology with a thesis entitled &#8220;Scalable Intelligent Electronic Catalogs&#8221;. His Ph.D. research was focused on electronic catalogs and constraint-based techniques, and raised a relevant business interest in the e-commerce field.</p>\n\n<p>In 1999, he co-founded Iconomic Systems S.A., a company that commercialized and developed further the concepts of his research applied to the travel domain. Iconomic Systems was financed with venture capital. From April 2000 to May 2001, besides his duties as co-founder of Iconomic Systems, he worked for the company as Technology Officer. Following the successful sale of Iconomic Systems to i:FAO A.G., he has been working for the company heading the i:FAO Future Lab. Since December 2002, he came back to the Swiss Federal Institute of Technology as a half-time postdoctoral researcher while still pursuing his i:FAO duties. At i:FAO, he was working on a cutting-edge software for supporting the business traveler which benefits from advanced techniques of Artificial Intelligence and Usability fields. As a result of that research and development, he was inventor and co-inventor of two patents currently owned by i:FAO. His research mainly focused on context-aware computing and how to apply user models to mobile devices by using constraint-based reasoning.</p>\n\n<p>From 2002 to 2003, he completed his educational background with a postgraduate Certificate in Entrepreneurship, organized by Create Switzerland , Chair of Entrepreneurship and Innovation. He was member of the team who won the first phase of the business plan competition Venture 2002 organized by ETH Zurich and McKinsey &amp; Company, Switzerland . Their business plan summary was selected as one of the 10 best among 207 other participating teams.</p>\n\n<p>He is member of the American Association for Artificial Intelligence and the Catalan Association for Artificial Intelligence. Marc has published more than 20 referred papers on his work in international conferences and journals on Artificial Intelligence and Usability. He fluently communicates in Catalan, Spanish, English and French.</p>","image":{"available_sizes":[[[49,66],"assets/images/resized/0001/9398/19398v1-max-150x150.png"],[[49,66],"assets/images/resized/0001/9398/19398v1-max-250x250.png"],[[49,66],"assets/images/resized/0001/9398/19398v1-max-450x450.png"]],"attribution":"<p><a href=\"http://www.strands.com/corp/team.vm\" title=\"Strands\" rel=\"nofollow\">Strands</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Technology Officer","firm":{"name":"Strands Labs","permalink":"strands","type_of_entity":"company","image":{"available_sizes":[[[150,22],"assets/images/resized/0000/4489/4489v2-max-150x150.png"],[[217,33],"assets/images/resized/0000/4489/4489v2-max-250x250.png"],[[217,33],"assets/images/resized/0000/4489/4489v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}