{"first_name":"Dr. Neri","last_name":"Cohen","permalink":"dr-neri-cohen","crunchbase_url":"http://www.crunchbase.com/person/dr-neri-cohen","homepage_url":"","birthplace":"","twitter_username":"NeriCohen","blog_url":"","blog_feed_url":"","affiliation_name":"GroupMD","born_year":null,"born_month":null,"born_day":null,"tag_list":"groupmd, mhealth, ehealth","alias_list":null,"created_at":"Wed Jun 27 15:54:50 UTC 2012","updated_at":"Wed Jun 27 21:48:39 UTC 2012","overview":"<p>Neri Cohen, MD, PhD is Medical Director of Greater Baltimore Medical Associates, Chief of the Division of Thoracic surgery at Greater Baltimore Medical Center and Co-Founder and Chief Medical Officer of GroupMD.  </p>\n\n<p>In those capacities he maintains an active surgical practice, oversees the practice administration of the largest non-university multispecialty medical group in Baltimore and as Chief Medical Officer of GroupMD where Dr. Cohen leads the clinical strategy. </p>\n\n<p>Dr Cohen has previously served several life sciences and information technology companies, large and small, as well as regional and national healthcare systems, on matters of strategic growth and development.</p>\n\n<p>Prior to his current appointments, Dr Cohen was the Head of the Section of General Thoracic Surgery, Surgical Director of Lung Transplantation, Director of the Cardiovascular and Thoracic Residency Training Program and Chief of Cardiovascular and Thoracic Research at the Medical College of Virginia of Virginia Commonwealth University in Richmond, VA.  He was concurrently Chairman of the Medical Advisory Committee of the LifeNet Organ Procurement Organization.</p>\n\n<p>Dr Cohen completed the Honors Masters program with a BA in Biochemistry &amp; Molecular Biology and an MS in Neurobiology &amp; Physiology from Northwestern University.  From there he went to the University of Maryland at Baltimore where he completed the Medical Scholars (combined MD/PhD) program with a PhD in Physiology &amp; Biophysics, as well as postdoctoral fellowship research as an American Heart Association Research Fellow.</p>\n\n<p>Dr Cohen completed a General Surgery internship and residency, additional NIH funded post-doctoral research fellowship training, and a Cardiovascular &amp; Thoracic Surgery fellowship at the Medical College of Virginia.  His research in cardiac electrophysiology led to the discovery of novel electrical protection strategies for cardiac surgery and thoracic organ transplantation for which he was awarded a US Patent.  Choosing to subspecialize in General Thoracic Surgery, Dr Cohen then completed an advanced fellowship in minimally invasive thoracic surgery and lung transplantation at the Cleveland Clinic Foundation.</p>\n\n<p>Dr Cohen is a board certified in both General Surgery and Cardiovascular &amp; Thoracic Surgery.  He is a fellow of the American College of Surgeons, and the American College of Chest Physicians and is a member of most major General Surgery, Surgical Research, Cardiothoracic Surgery and Chest Medicine associations.  He was awarded the Joel J Roslyn Faculty Research Award from the Association for Academic Surgery and continued a basic science research programs on the molecular biology and biophysics of transplant organ failure and protection, and carcinogenesis and mechanisms of cancer metastasis, concurrent with his attending surgeon and fellowship director appointment at Virginia Commonwealth University.</p>\n\n<p>Dr Cohen completed the Leadership Program in Healthcare Policy &amp; Management at the Heller School of Public Policy at Brandeis University under an Alley-Sheridan scholarship from the Thoracic Surgery Foundation for Research &amp; Education.  While maintaining an active thoracic surgery practice, he remains actively involved in both clinical trials research as an investigator for the American College of Surgeons Oncology Group (ACOSOG) and in clinical outcomes research formulating algorithms to validate mathematical models using computer simulations to define ‘best clinical practices’ and outcome and performance metrics.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0019/7691/197691v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0019/7691/197691v2-max-250x250.jpg"],[[299,450],"assets/images/resized/0019/7691/197691v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"Biochemistry & Molecular Biology","institution":"Northwestern University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MD","subject":"Medicine","institution":"University of Maryland at Baltimore","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"PhD","subject":"Physiology & Biophysics","institution":"University of Maryland at Baltimore","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Co-Founder & Chief Medical Officer","firm":{"name":"GroupMD","permalink":"groupmd-2","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0019/7674/197674v2-max-150x150.png"],[[250,250],"assets/images/resized/0019/7674/197674v2-max-250x250.png"],[[400,400],"assets/images/resized/0019/7674/197674v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/neri-cohen/10/79/931","title":"LinkedIn"},{"external_url":"https://twitter.com/#!/nericohen","title":"Twitter"}]}