{"first_name":"Dr. Phil","last_name":"Golinsky","permalink":"dr-phil-golinsky","crunchbase_url":"http://www.crunchbase.com/person/dr-phil-golinsky","homepage_url":"http://www.RxWellness.net","birthplace":"New York","twitter_username":"drphilgolinsky","blog_url":"http://www.RxWellness.net","blog_feed_url":"http://www.RxWellness.net","affiliation_name":"Unaffiliated","born_year":1968,"born_month":8,"born_day":7,"tag_list":"natural-bodybuilding, nutrition, health-related-subjects, chiropractor","alias_list":null,"created_at":"Thu Sep 22 22:40:52 UTC 2011","updated_at":"Wed Nov 16 23:21:26 UTC 2011","overview":"<p>Dr. Phil Golinsky was born in New York City and raised on Long Island, New York, where he pursued his undergraduate studies at the State University of New York at Oneonta. He was awarded the Doctor of Chiropractic degree in 1995 from Life Chiropractic College in Atlanta, Georgia. He immediately went into private practice in Northern Virginia. </p>\n\n<p>As a student at Chiropractic College, Dr. Golinsky sought to master upper cervical techniques, some of the more difficult and more effective techniques used by very few chiropractors in practice. To help solidify his expertise, Dr. Golinsky, along with 17 other doctors and students, traveled to Moldova, Russia, where upper cervical adjustments were given to 39,000 people in a 2 week period. Dr. Golinsky still uses the Upper Cervical Specific technique in his practice, as well as Cranial-Sacral work to assist people on their road to recovery. </p>\n\n<p>His practice is dedicated to serving families, and a large portion of the practice consists of children under 16 years of age.  Since 1996, Dr. Golinsky has written numerous articles on health and healing which have appeared in professional publications. He is a past President of the Northern Virginia Chiropractic Society, and presently a member of the Federation of Straight Chiropractic Organization.</p>","image":{"available_sizes":[[[150,120],"assets/images/resized/0015/5222/155222v2-max-150x150.jpg"],[[180,145],"assets/images/resized/0015/5222/155222v2-max-250x250.jpg"],[[180,145],"assets/images/resized/0015/5222/155222v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}