{"first_name":"Dr.","last_name":"Bo Q. Zhu","permalink":"dr-qingbo-zhu","crunchbase_url":"http://www.crunchbase.com/person/dr-qingbo-zhu","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Pattern Insight","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 05 15:34:44 UTC 2009","updated_at":"Wed Aug 08 23:14:12 UTC 2012","overview":"<p>Dr. Zhu is currently working in VMware, building its log search and analytics solution for the cloud. VMware acquired log insight product, together with its team and technology from Pattern Insight in July 2012. </p>\n\n<p>Dr. Zhu co-founded Pattern Insight in Sept 2006. He was VP of Product who was responsible for all products in Pattern Insight from strategic product planning to execution through the entire product lifecycle from 2009 to 2012. Before 2009, He was head of Engineering in Pattern Insight who was responsible for all engineering activities in Pattern Insight from product development, QA  to support and sales engineering. </p>\n\n<p>His passion lies in the intersection of innovative technology and business needs. He previously worked at National Laboratory of Novel Software Technology in China and IBM Almaden Research Center.</p>\n\n<p>Bo obtained his Ph.D. in computer science from University of Illinois at Urbana-Champaign and M.S. and B.S. in computer science from Nanjing University, China. Bo has published pioneering research papers on system architecture in top computer science conferences and journals and holds several patents. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-founder, VP of Product","firm":{"name":"Pattern Insight","permalink":"pattern-insight","type_of_entity":"company","image":{"available_sizes":[[[150,84],"assets/images/resized/0005/5382/55382v4-max-150x150.png"],[[250,140],"assets/images/resized/0005/5382/55382v4-max-250x250.png"],[[288,162],"assets/images/resized/0005/5382/55382v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}