{"first_name":"Dr. Robert","last_name":"Armstrong","permalink":"dr-robert-armstrong","crunchbase_url":"http://www.crunchbase.com/person/dr-robert-armstrong","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1987,"born_month":6,"born_day":8,"tag_list":"dr--robert-armstrong-general-orthopedics","alias_list":null,"created_at":"Fri Jul 13 14:22:50 UTC 2012","updated_at":"Sat Jul 14 11:33:26 UTC 2012","overview":"<p>Dr. Robert Armstrong is an orthopedic surgeon that has been helping others for many years. Robert has tremendous credentials that help him to make a difference in the lives of his patients. </p>\n\n<p>Education Background </p>\n\n<p>He received a biology from Wilkes University, and moved onto University of Medicine and Dentistry of New Jersey School of Osteopathic Medicine, which is one of the largest schools for orthopedic studies. </p>\n\n<p>Experience</p>\n\n<p>Robert had the unique opportunity to work with the Philadelphia Eagles. He acted as the doctor for this professional team. The Eagles have made it to the Super Bowl twice. </p>\n\n<p>He has also worked with college ski teams. He volunteered as physician for college athletics giving him tremendous experience in orthopedics. This has helped to shape his career, and he has seen and treated many sports related injuries. </p>\n\n<p>Affiliations</p>\n\n<p>• Arthroscopy Association of North America</p>\n\n<p>• American Osteopathic Orthopedic Society for Sports Medicine</p>\n\n<p>• American Osteopathic Academy of Orthopedics</p>\n\n<p>Participation With Studies </p>\n\n<p>Robert has worked with the FDA with the study of knee replacements and other knee related studies. This information has helped improve patient knee and hip replacements. Thousands of patients have been helped by Robert to overcome knee and hip pain. Robert has a less invasive technique that many patients feel more comfortable with. </p>\n\n<p>Some people experience years of pain before they seek out treatment. Robert can help you to resolve this pain. Whether you are dealing with an injury, or arthritis or any other condition, Robert can help you to overcome painful symptoms. </p>\n\n<p>Sometimes the cause of pain is irrelevant. Many doctors spend time finding the origin of pain, but treating the pain can help the patient to overcome pain much faster. Robert treats patients of all ages from infants, to elderly patients. You can find a great deal of feedback from patients that Robert has helped to overcome pain. Ridding the body of pain can be an essential part of living a full and healthy life. </p>\n\n<p>Dr. Robert Armstrong has many solutions that can help bone, muscle and joint chronic pain. Sometimes surgery is necessary. When you need surgery, you will want an orthopedic surgeon on your side that has performed thousands of other surgeries. This will help to relieve your fears, but more importantly overcome your pain.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}