{"first_name":"Dr.","last_name":"Ramiro Jordan","permalink":"dr-ramiro-jordan","crunchbase_url":"http://www.crunchbase.com/person/dr-ramiro-jordan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jul 01 04:08:21 UTC 2009","updated_at":"Wed Jul 01 04:09:27 UTC 2009","overview":"<p>Age 50.   Dr. Jordan received his BS in Telecommunications from the National University of La Plata, Argentina, and his Masters and PHD in Electrical and Computer Engineering from Kansas State University. Dr. Jordan has a vast array of experience and expertise in both the academic and commercial enterprise arenas. He is a tenured Professor in the Electrical and Engineering Department of the University of New Mexico. From 2002-2003 Ramiro served as the Associate Chair and Director of Undergraduate program of the ECE department, University of New Mexico.</p>\n\n<p>Ramiro was the originator and primary driving force behind the Ibero American Science and Technology Consortium (ISTEC) created in 1990. ISTEC is a non-profit organization composed of more than one hundred member institutions (industrial, academic, multilateral, and governmental) in the Americas and Iberian Peninsula. The Consortium fosters common goals regarding the promotion of education, technology transfer, and research and development. Our partnership seeks to provide access to the talent available in universities and R&amp;D centers in many countries, to enhance a quality-trained workforce, and to explore new business opportunities. The benefits to the countries that participate in the consortium are enhanced educational levels in science and engineering, investment opportunities, support for existing industries, enriched economic development, access to international scientific communities, access to R&amp;D centers, and self-sufficiency using the latest technology.</p>\n\n<p>From 2000 to 2002 Dr. Jordan was with Global Software Group, Motorola Inc., serving as the University Relations Manager. He is a Senior Member of the Institute of electrical and Electronic Engineers (IEEE) and served in multiple roles for a variety of technical undertakings in many national and international programs. He has authored/co-authored multiple scientific and technical publications and recipient of many Awards and Recognitions for his works and contributions to the growth of scientific and technical programs world wide.</p>\n\n<p>During his entire career Dr. Jordan has remained actively involved in the development and expansion of science and technology throughout Latin America through his fostering of close partnerships between industry and academic institutions. Ramiro also serves on the Editorial Board of Computers and Software Engineering magazine.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Executive Vice President, CDO","firm":{"name":"Gridline Communications","permalink":"gridline-communications","type_of_entity":"company","image":{"available_sizes":[[[150,141],"assets/images/resized/0004/6429/46429v2-max-150x150.jpg"],[[250,235],"assets/images/resized/0004/6429/46429v2-max-250x250.jpg"],[[382,360],"assets/images/resized/0004/6429/46429v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}