{"first_name":"Dr.","last_name":"Rodney Brooks","permalink":"dr-rodney-brooks","crunchbase_url":"http://www.crunchbase.com/person/dr-rodney-brooks","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jul 24 16:50:24 UTC 2008","updated_at":"Tue Oct 06 21:14:03 UTC 2009","overview":"<p>Dr. Rodney Brooks is a robotics entrepreneur and Founder, Chairman and CTO of <a href=\"/company/heartland-robotics\" title=\"Heartland Robotics, Inc.\" rel=\"nofollow\">Heartland Robotics, Inc.</a>. He is also a Founder, Board Member and former CTO (1991 - 2008) of iRobot Corp (Nasdaq: IRBT) and the Panasonic Professor of Robotics (on leave) at MIT. Dr. Brooks is the former Director (1997 - 2007) of the MIT Artificial Intelliigence Laboratory and then the MIT Computer Science &amp; Artificial Intelligence Laboratory (CSAIL). </p>\n\n<p>He received degrees in pure mathematics from the Flinders University of South Australia and a Ph.D. in Computer Science from Stanford University in 1981. He held research positions at Carnegie Mellon University and MIT, and a faculty position at Stanford before joining the faculty of MIT in 1984. He has pubished many papers in computer vision, artificial intelligence, robotics, and artificial life.\nDr. Brooks serves as a member of the International Scientific Advisory Group (ISAG) of National Information and Communication Technology Australia (NICTA), and on the Global Innovation and Technology Advisory Council of John Deere &amp; Co. He is an Xconomist at Xconomy and a regular contributor to the Edge.</p>\n\n<p>Dr. Brooks is a Member of the National Academy of Engineering (NAE), a Founding Fellow of the Association for the Advancement of Artificial Intelligence (AAAI), a Fellow of the American Academy of Arts &amp; Sciences (AAAS), a Fellow of the American Association for the Advancement of Science (the other AAAS), a Fellow of the Association for Computing Machinery (ACM), a Corresponding Member of the Australian Academy of Science (AAS) and a Foreign Fellow of the Australian Academy of Technological Sciences and Engineering (ATSE). </p>\n\n<p>He won the Computers and Thought Award at the 1991 IJCAI (International Joint Conference on Artificial Intelligence). He has been the Cray lecturer at the University of Minnesota, the Mellon lecturer at Dartmouth College, and the Forsythe lecturer at Stanford University. He was co-founding editor of the International Journal of Computer Vision and is a member of the editorial boards of various journals including Adaptive Behavior, Artificial Life, Applied Artificial Intelligence, Autonomous Robots and New Generation Computing. He starred as himself in the 1997 Errol Morris movie &#8220;Fast, Cheap and Out of Control&#8221; named for one of his scientific papers, a Sony Classics picture, available on DVD. </p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0006/1857/61857v1-max-150x150.png"],[[200,250],"assets/images/resized/0006/1857/61857v1-max-250x250.png"],[[360,450],"assets/images/resized/0006/1857/61857v1-max-450x450.png"]],"attribution":"<p>http://people.csail.mit.edu/brooks/</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"CTO, Co-Founder","firm":{"name":"iRobot","permalink":"irobot","type_of_entity":"company","image":{"available_sizes":[[[150,38],"assets/images/resized/0002/2799/22799v1-max-150x150.png"],[[204,53],"assets/images/resized/0002/2799/22799v1-max-250x250.png"],[[204,53],"assets/images/resized/0002/2799/22799v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}