{"first_name":"Dr.","last_name":"Ritu Shrivastava","permalink":"dr-ritu-shrivastava","crunchbase_url":"http://www.crunchbase.com/person/dr-ritu-shrivastava","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat May 30 05:32:53 UTC 2009","updated_at":"Sat May 30 05:33:51 UTC 2009","overview":"<p>Ritu Shrivastava brings more than 24 years of semiconductor industry experience to the company. He is responsible for guiding the company’s molecular technology integration and manufacturing strategy, as well as building relationships with semiconductor manufacturers and foundries. He comes to ZettaCore from Alliance Semiconductor Corp., where he held positions of increasing responsibility, culminating in his role as vice president and general manager, technology development and operations. At Alliance, Shrivastava was responsible for technology development, initial ramp-up, and volume manufacturing of SRAM, DRAM and Flash memories, as well as mixed signal and logic products. He negotiated and executed numerous foundry technology and production agreements, enabling both Alliance and its foundry partners to successfully ramp up new processes, products and fabs. Prior to Alliance, Shrivastava worked at Cypress Semiconductor for more than 10 years, where he held various senior technology management positions during the company’s growth from a startup to an established and respected company .</p>\n\n<p>Dr. Shrivastava began his industry career at Mostek Corporation/United Technologies, after serving on the faculty at Louisiana State University for three years. He earned a B.E. and an M.E. with distinction in electrical engineering from the Indian Institute of Science, and a Ph.D. in electrical engineering from Louisiana State University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP of Manufacturing Technology","firm":{"name":"ZettaCore","permalink":"zettacore","type_of_entity":"company","image":{"available_sizes":[[[150,70],"assets/images/resized/0004/6021/46021v1-max-150x150.png"],[[220,104],"assets/images/resized/0004/6021/46021v1-max-250x250.png"],[[220,104],"assets/images/resized/0004/6021/46021v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}