{"first_name":"DR.","last_name":"RAKESH KUSHWAHA","permalink":"dr-rakesh-kushwaha","crunchbase_url":"http://www.crunchbase.com/person/dr-rakesh-kushwaha","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Mar 30 09:28:35 UTC 2011","updated_at":"Wed Mar 30 09:32:22 UTC 2011","overview":"<p>Dr. Rakesh Kushwaha founded Mformation Technologies in 1999, and has served as their chief technology officer since that time. He has devoted most of the last decade exclusively to device management issues and the advancement of management technologies for mobile and wireless environments. As a device management pioneer, he has evolved with the industry as it has grown. He believes that the more than 700 billion objects that most analysts predict will be connected wirelessly by 2017 will all need to be managed.\nPrior to founding Mformation, Dr. Kushwaha spent more than ten years building leading-edge operational support systems (OSS) to manage wireless, IP and telecommunication services. He designed and implemented service management systems for telecommunications companies including AT&amp;T, Concert Communications and Millicom Cellular International. He was Vice President of Engineering at Savera Systems, where he managed the design, development and deployment of highly scaleable, real-time operational support systems. Before Savera, he was a senior member of the technical staff at Bell Laboratories and an Assistant Professor in Computer Science at the New Jersey Institute of Technology.</p>","image":null,"degrees":[{"degree_type":"Bachelor’s degree","subject":"Engineering","institution":"Delhi University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CTO AND FOUNDER","firm":{"name":"Mformation Technologies","permalink":"mformation-technologies","type_of_entity":"company","image":{"available_sizes":[[[150,28],"assets/images/resized/0007/7213/77213v1-max-150x150.jpg"],[[237,45],"assets/images/resized/0007/7213/77213v1-max-250x250.jpg"],[[237,45],"assets/images/resized/0007/7213/77213v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}