{"first_name":"Dr.","last_name":"Robert Schwarzberg","permalink":"dr-robert-schwarzberg","crunchbase_url":"http://www.crunchbase.com/person/dr-robert-schwarzberg","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Sensei ","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Mar 15 18:36:14 UTC 2010","updated_at":"Mon Mar 15 23:41:33 UTC 2010","overview":"<p>Dr. Robert Schwarzberg is the president and chief executive officer of Sensei Inc., a pioneer in mobile and web-based wellness solutions.\nRegarded for nearly 20 years as an expert in disease management and telemedicine, Dr. Schwarzberg has served with Sensei since helping found the company in 2005. He also helped forge its strategic mission – to empower consumers to use technology that helps them make healthy lifestyle changes. Today at Sensei, Dr. Schwarzberg is working to realize this vision with a professional team that brings experience in behavior psychology, nutrition, software development and mobile technology.\nBefore joining Sensei, Dr. Schwarzberg served as chief medical officer for Card Guard AG, a wireless healthcare technology company based in Switzerland. In addition, he was chief medical officer of Ralin Medical Inc. and its subsidiary, Cardiac Solutions (now CorSolutions), one of the first disease management companies in the United States.\nPrior to joining Ralin, Dr. Schwarzberg was the chief medical officer and chairman for Cardiolife, a cardiac monitoring vendor. Before its acquisition by Ralin, Dr. Schwarzberg led Cardiolife from start-up to annual revenue generation of more than $18 million.\nDr. Schwarzberg is a board-certified cardiologist and a fellow of the American College of Cardiology. He received his medical degree from Wayne State University and holds an undergraduate degree from Columbia University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO, President","firm":{"name":"Sensei ","permalink":"sensei","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0008/0413/80413v2-max-150x150.png"],[[250,76],"assets/images/resized/0008/0413/80413v2-max-250x250.png"],[[450,137],"assets/images/resized/0008/0413/80413v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}