{"first_name":"Dr.","last_name":"Robert Krasner","permalink":"dr-robert-krasner","crunchbase_url":"http://www.crunchbase.com/person/dr-robert-krasner","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Dec 17 13:16:52 UTC 2008","updated_at":"Wed Dec 17 13:18:14 UTC 2008","overview":"<p>Dr. Krasner is an outside advisor to Health Venture Group, LLC. He brings more than 30 years experience as an internist with concentrated expertise in information gathering, analysis and presentation. As a Rear Admiral in the Medical Corps, US Navy, Robert Krasner served for nearly ten years as the Attending Physician to Congress, where he attended to the world wide care of the members of the United States Senate, House of Representatives, and Supreme Court. He has also served on the President&#8217;s Task Force to Improve Health Care Delivery for our Nation&#8217;s Veterans.</p>\n\n<p>Dr. Krasner was awarded the Legion of Merit for his clinical work and subsequently the Distinguished Service Medal for his &#8220;outstanding performance as physician, advisor, administrator, and confidant for the Executive, Legislative and Judicial branches of government.&#8221;</p>\n\n<p>In addition to his service to the United States government, Dr. Krasner has broad international experience. He has served in Ethiopia helping to care for Emperor Haile Selassie and his family; under three ambassadors at the American Embassy in London; and as clinician, field and bench researcher in Panama and Indonesia. Dr. Krasner is a Clinical Professor of Medicine at New York University School of Medicine and Adjunct Assistant Professor of Medicine at Cornell University Medical Center.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Advisor ","firm":{"name":"Health Venture Group, LLC","permalink":"health-venture-group-llc","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}