{"first_name":"Dr.","last_name":"Sanjiva Weerawarana","permalink":"dr-sanjiva-weerawarana","crunchbase_url":"http://www.crunchbase.com/person/dr-sanjiva-weerawarana","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"WSO2","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jun 04 07:47:46 UTC 2008","updated_at":"Sat Mar 27 07:41:04 UTC 2010","overview":"<p>Sanjiva is Founder, Chairman &amp; CEO of WSO2.</p>\n\n<p>Sanjiva founded WSO2 after having spent nearly 8 years in IBM Research, where he was one of the founders of the Web services platform. During that time, he co-authored many Web services specifications including WSDL, BPEL4WS, WS-Addressing, WS-RF and WS-Eventing. In recognition for his company-wide technical leadership, Sanjiva was elected to the IBM Academy of Technology in 2003.</p>\n\n<p>Sanjiva has been involved with open source for many years. Sanjiva was the original creator of Apache SOAP and has been part of Apache Axis, Apache Axis2 and most Apache Web services projects. He is a member of the Apache Software Foundation.</p>\n\n<p>In 2003, Sanjiva founded the Lanka Software Foundation, a non-profit organization formed with the objective of promoting Open Source development, not usage, by Sri Lankan developers. He is currently its Chief Scientist and a Director. LSF&#8217;s success stories include many Apache Web services projects and Sahana, the predominant disaster management system in the world.</p>\n\n<p>In recognition of Sanjiva’s role in promoting Open Source participation from developing countries, Sanjiva was elected to the Board of the Open Source Initiative (OSI) in April 2005, where he served for 2 years.</p>\n\n<p>Sanjiva also teaches and guides student projects part-time in the Computer Science &amp; Engineering department of the University of Moratuwa. He&#8217;s a member of the Faculty of Engineering Industry Consultative Board of the university.</p>\n\n<p>Prior to joining IBM, Sanjiva spent 3 years at Purdue University as visiting faculty, where he received his Ph.D. in Computer Science in 1994.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder & CEO","firm":{"name":"WSO2","permalink":"wso2","type_of_entity":"company","image":{"available_sizes":[[[150,79],"assets/images/resized/0001/9941/19941v4-max-150x150.jpg"],[[250,132],"assets/images/resized/0001/9941/19941v4-max-250x250.jpg"],[[450,237],"assets/images/resized/0001/9941/19941v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}