{"first_name":"Dr.","last_name":"Thomas McWilliams","permalink":"dr-thomas-mcwilliams","crunchbase_url":"http://www.crunchbase.com/person/dr-thomas-mcwilliams","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jan 01 12:32:35 UTC 2009","updated_at":"Thu Jan 01 12:33:40 UTC 2009","overview":"<p>Tom is a co-founder of Schooner Information Technology.\nHe has previously successfully founded three companies. His most recent company, PathScale, developed a very low latency, high bandwidth infiniband system interconnect, and was acquired by QLogic in 2006. Prior to founding PathScale, from 1996 to 2001, Tom was a Distinguished Engineer and Principal Investigator at Sun Microsystems, working on Server Architecture and advanced CAD tools. From 1993 to 1996, he was a Director in the MIPS division of Silicon Graphics managing microprocessor development and the MIPS architecture group. From 1989 to 1992, he was a Vice President at Amdahl in the Systems Architecture group. Before Amdahl, he founded Key Computer Laboratories in 1987. Amdahl acquired Key Computer, a company that designed of one of the first superscalar pipelined architecture computers, in 1989. In 1981 Tom co-founded Valid Logic Systems, whose products were based around his Ph.D. thesis work at Stanford University. He won the 1984 IEEE &#8220;W. Wallace McDowell Award&#8221; for the creation of the SCALD design methodology, which is the basis for many of the successful computer-aided engineering systems used in the industry. From 1983 to 1989 he was a Vice President at Valid. Prior to Valid, he was at the Lawrence Livermore National Laboratory (LLNL), where he was one of the principal designers of the S-1 supercomputer, a joint effort between LLNL and Stanford University. Dr. McWilliams received his Ph.D. in Computer Science from Stanford. He received his B.S.E.E and M.S.E.E. in Electrical Engineering from Carnegie Mellon University.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Co-founder and Schooner Fellow","firm":{"name":"Schooner Information Technology","permalink":"schooner-information-technology-inc","type_of_entity":"company","image":{"available_sizes":[[[150,31],"assets/images/resized/0003/2823/32823v4-max-150x150.jpg"],[[250,52],"assets/images/resized/0003/2823/32823v4-max-250x250.jpg"],[[450,94],"assets/images/resized/0003/2823/32823v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}