{"first_name":"Dr. Vladimir","last_name":"Grigoryants","permalink":"dr-vladimir-grigoryants","crunchbase_url":"http://www.crunchbase.com/person/dr-vladimir-grigoryants","homepage_url":"http://www.vgplasticsurgery.com","birthplace":"","twitter_username":"grigoryants","blog_url":"http://drvladimirgrigoryants.wordpress.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"los-angeles-plastic-surgeon","alias_list":null,"created_at":"Thu Oct 07 20:56:52 UTC 2010","updated_at":"Thu Oct 07 21:23:10 UTC 2010","overview":"<p>Dr. Grigoryants is a board certified plastic surgeon specializing in cosmetic plastic surgery of the body and face. His practice is located at the Verdugo Hills Hospital in Glendale.  Dr. Grigoryants provides his patients with effective and most advanced plastic surgery procedures in the safest possible environment. Patients come to Dr. Grigoryants from all over the United States as well as from other countries.</p>\n\n<p>Dr. Grigoryants is following in the footsteps of his father and grandfather who were both surgeons.</p>\n\n<p>After graduating from Dartmouth Medical School with Honors in Hanover, NH, he completed prerequisite training in General Surgery at the University of Michigan in Ann Arbor. Dr. Grigoryants accomplished additional fellowship training in Surgical Critical Care at the University of Michigan.</p>\n\n<p>Dr. Grigoryants completed a busy and comprehensive training in Plastic and Reconstructive Surgery at the University of Virginia in Charlottesville, VA. Throughout his training, Dr. Grigoryants has been a recipient of many awards for academic excellence and his research contributions to the field of surgery. Dr. Grigoryants has conducted basic science and clinical research. His work has been featured in scientific journals and medical conferences</p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0010/4622/104622v2-max-150x150.jpg"],[[187,250],"assets/images/resized/0010/4622/104622v2-max-250x250.jpg"],[[200,267],"assets/images/resized/0010/4622/104622v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}