{"first_name":"DR.","last_name":"WOLFRAM JOST","permalink":"dr-wolfram-jost","crunchbase_url":"http://www.crunchbase.com/person/dr-wolfram-jost","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jul 25 12:14:18 UTC 2011","updated_at":"Mon Jul 25 12:15:48 UTC 2011","overview":"<p>Dr. rer. nat. Wolfram Jost, born in 1962, has been a member of the Management Board of Software AG since August 2010. He is responsible for Research &amp; Development as well as Product Management and Product Marketing.\nDr. Wolfram Jost studied business economics, majoring in economic information science and marketing, at the University of the Saarland, from October 1983 to April 1988. After graduation in 1988 he worked for the Institute of Economic Information Science (IWi) at the University of the Saarland, where his duties included supervising and holding classes, heading projects in the field of Computer Integrated Manufacturing and organizing scientific congresses.\nDr. Wolfram Jost completed his doctoral thesis at the Law and Economics Faculty at the University of the Saarland in November 1992 on the topic of &#8220;Computer-based CIM Planning - Conception and Realization of a Tool for Analyzing and Planning CIM Systems&#8221;.\nIn 1992 Dr. Wolfram Jost joined IDS Prof. Scheer GmbH, Saarbrücken. Here he was initially the head of ARIS Product Development before taking over as the head of ARIS Product Strategy in 1998.\nIn 1994 he was promoted to a senior management position, a post he held until he was appointed to the Executive Board of IDS Scheer AG in 2000. He will remain a member of the IDS Scheer Board until the takeover of IDS Scheer AG by Software AG has been completed.</p>","image":{"available_sizes":[[[150,97],"assets/images/resized/0014/5929/145929v1-max-150x150.png"],[[150,97],"assets/images/resized/0014/5929/145929v1-max-250x250.png"],[[150,97],"assets/images/resized/0014/5929/145929v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Technology Officer","firm":{"name":"Software AG","permalink":"software-ag","type_of_entity":"company","image":{"available_sizes":[[[150,58],"assets/images/resized/0011/7328/117328v1-max-150x150.png"],[[234,92],"assets/images/resized/0011/7328/117328v1-max-250x250.png"],[[234,92],"assets/images/resized/0011/7328/117328v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}