{"first_name":"Dr. William","last_name":"Boothe","permalink":"dr-william-boothe-2","crunchbase_url":"http://www.crunchbase.com/person/dr-william-boothe-2","homepage_url":"","birthplace":"","twitter_username":"BootheWIlliam","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Jul 14 07:33:01 UTC 2012","updated_at":"Sun Jul 15 02:25:11 UTC 2012","overview":"<p>Dr. William Boothe - Laser Eye Surgeon</p>\n\n<p>Are you sick and tired of the hassles of wearing contacts or glasses? Are you ready to take the next step towards crystal clear vision? Before you take that step, make sure to seek out an experienced and qualified professional like Dr. William Boothe, the founder of the Boothe Eye Care and Laser Center. Since opening in 1987, the Boothe Eye Center has distinguished itself as one of the leading corrective services in the country. </p>\n\n<p>Have Confidence In Your Doctor</p>\n\n<p>Part of being comfortable with your surgery is having the utmost confidence in your doctor. Dr. Boothe is among the world’s most experienced and talented laser surgeons. He has performed over 115,000 LASIK surgeries and 69,000 INTRLASIK procedures over the course of his 25 year career. </p>\n\n<p>Dr. Boothe is willing to meet with his patients and discuss any concerns they may have before their procedure. He has extensive experience in laser surgeries and has worked in the field since the early 1990&#8217;s when the technology originally broke through. If you have any questions or concerns, there is no one more experienced and qualified to answer them than Dr. Boothe.</p>\n\n<p>Qualified Surgeon Dr. William Boothe</p>\n\n<p>When you get a procedure done by Dr. Boothe, you can rest assured that you are in good hands. Dr. Boothe is a pioneer in his field. He was one of the first surgeons to be trained on laser vision correction techniques and pioneered microkeraatome which all laser eye surgeons use today. </p>\n\n<p>Dr. Boothe is a certified member of the American Board of Ophthalmology and a prominent member of many professional associations. Dr. Boothe always strives to be on the cutting edge of laser technology and tries to improve results for the thousands of patients who come to him on a yearly basis. </p>\n\n<p>Top Quality Equipment</p>\n\n<p>Dr. William Boothe is not only an experienced and skilled laser surgeon, he also uses the best equipment in the industry. This cutting edge technology guarantees that patients always get the best and most advanced procedures on the market. Some of the top line equipment Dr. Boothe uses includes:</p>\n\n<p>VISX WavScan – This tool allows Dr. Boothe to gauge eye imperfections and irregularity that may cause complications during a procedure. The WavScan tool creates a detailed map of the patients eyes so problems can be avoided.</p>\n\n<p>IFS Advanced Femtosecond Laser – This laser is the most precise instrument on the market today. This computer controlled laser lessens recovery time while lowering the risk of complications down to almost zero.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0020/0947/200947v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0020/0947/200947v2-max-250x250.jpg"],[[259,194],"assets/images/resized/0020/0947/200947v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}