{"first_name":"Drew","last_name":"Moynihan","permalink":"drew-moynihan","crunchbase_url":"http://www.crunchbase.com/person/drew-moynihan","homepage_url":"http://www.drewmoynihan.com","birthplace":"San Antonio, TX","twitter_username":"drewmoynihan","blog_url":"","blog_feed_url":"","affiliation_name":"Docuda","born_year":1968,"born_month":8,"born_day":16,"tag_list":"drew-moynihan, docuda, mekkis, techarati, smartphone, mobile-apps, apps, mit, esl, investor","alias_list":null,"created_at":"Mon May 09 18:08:16 UTC 2011","updated_at":"Fri Nov 30 05:23:55 UTC 2012","overview":"<p>Drew Moynihan has a rich and diversified background in Information Technology, Mobile Product Development, and Operations Management. He is known as a proactive, solutions-driven, innovative business technology leader, with an eye toward innovation, simplicity, and eco-responsibility. </p>\n\n<p>Experience:\nDrew co-founded Docuda Inc. in 2008, and as President and COO lead the company&#8217;s daily operations through the end of 2009, while working with Docuda&#8217;s partners to extend consumer reach while achieving shareholder value.</p>\n\n<p>In 2010, Drew founded Techarati to helps startups and businesses address their most complex and unique technical challenges. Techarati&#8217;s focus is primarily on large scale and high availability enterprises with an emphasis on smart phone app development, web-enabled applications, and Cloud computing.  Drew was nominated for &#8220;Technology Innovator of the Year&#8221; in 2010 by the Austin Business Journal.  He sold Techarati in September of 2012 to Snake Head Software in a private acquisition.</p>\n\n<p>After selling Techarati in 2012, Drew joined daily operations of a company he had been a board advisor to for the past two years, The Daily Sales Exchange.  With over 800k in funding, the DSE is poised to disrupt the B2B space forever changing the heavy equipment landscape. His daily role is as a senior member of the executive management team serving as CITO, as such he leads all the IT and development related; business strategy, strategic planning, technology initiatives, direction, hiring, etc for the enterprise.</p>\n\n<p>The Daily Sales Exchange is a web marketplace that accelerates sales transactions by qualifying and enhancing buyer-seller relationships at the right time. For buyers shopping for heavy industrial equipment, the DSE makes finding the right products fast and easy with smart search through a huge database of pre-qualified suppliers. The DSE is headquartered at the Rocket-Space Accelerator in downtown San Francisco, Ca.</p>\n\n<p>In addition to the DSE (2012), Drew is creating a new startup in Austin, TX with his cofounder Andrew Blair, Mekkis Labs.  Mekkis creates ESl (English as a Second Language) software for the iPhone and Android smart phone platforms.  Mekkis is unique in that it spans the handheld, tablet, and the living room space, offering and end to end solution for language learners. In early 2011 Mekkis was a second place finalist in the MIT Global Startup Workshop in Seoul, South Korea. </p>\n\n<p>Background, Vision:\nWith more than 19 years experience in Information Technology, Operations management, CRM development, new web technologies, traditional media technologies, social media, Drew&#8217;s vision is focused on instilling the operational philosophy, &#8220;client-focused, service-oriented, and team-based&#8221;. He is Passionate about technology and its possibilities, and he supports open development models that stimulate communication, creativity and innovation across all divisions within an enterprise. </p>\n\n<p>Drew&#8217;s experience spans the range of industries, from start up to fortune 200, with expertise in operations, business development, information technology, engineering, and management in eCommerce, Traditional Media, New &amp; Social Media, CRM development, Healthcare Systems, Massive Scale Data Warehousing, and Mobile Applications. </p>\n\n<p>Drew&#8217;s educational background is in electronics from Texas A&amp;M University and Business Technology from Texas State University, and maintains ties to Texas State to this day.</p>\n\n<p>Drew divides his time between his home in Austin, TX and his work in San Francisco, Ca.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO, Cofounder","firm":{"name":"Mekkis Labs","permalink":"mekkis-labs","type_of_entity":"company","image":null}},{"is_past":false,"title":"CITO","firm":{"name":"The Daily Sales Exchange","permalink":"the-daily-sales-exchange","type_of_entity":"company","image":null}},{"is_past":false,"title":"CITO","firm":{"name":"DSE","permalink":"dse","type_of_entity":"company","image":null}},{"is_past":true,"title":"Founder, President","firm":{"name":"Techarati","permalink":"techarati","type_of_entity":"company","image":null}},{"is_past":true,"title":"President, COO","firm":{"name":"Docuda","permalink":"docuda","type_of_entity":"company","image":{"available_sizes":[[[150,87],"assets/images/resized/0005/7807/57807v2-max-150x150.png"],[[250,146],"assets/images/resized/0005/7807/57807v2-max-250x250.png"],[[450,263],"assets/images/resized/0005/7807/57807v2-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Principle","firm":{"name":"Drew Moynihan  Labs, Investments, Properties and Interest","permalink":"drew-moynihan-labs-investments-properties-and-interest","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.drewmoynihan.com","title":"HomePage"},{"external_url":"http://www.linkedin.com/home?trk=logo","title":"LinkedIn"},{"external_url":"http://twitter.com/#!/drewmoynihan","title":"Twitter"}]}