{"first_name":"Druh","last_name":"Farrell","permalink":"druh-farrell","crunchbase_url":"http://www.crunchbase.com/person/druh-farrell","homepage_url":"http://druhfarrell.ca","birthplace":"Calgary, Alberta","twitter_username":"DruhFarrell","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"city-of-calgary, alderman, ward-7, druh-farrell","alias_list":null,"created_at":"Tue Mar 27 18:01:28 UTC 2012","updated_at":"Tue Mar 27 23:45:59 UTC 2012","overview":"<p>City of Calgary Alderman for Ward 7.</p>\n\n<p>Druh Farrell was elected to Calgary City Council in 2001. Her experience as a community advocate for the Hillhurst Sunnyside Community Association and the Kensington Business Revitalization Zone, along with a track record as the owner of a clothing manufacturing business, provided Druh with a strong background for entering municipal politics.</p>\n\n<p>Druh Farrell, now in her fourth term as Alderman for Ward 7, brings a dynamic and constructive approach to her role on City Council. Her impressive track record of accomplishments shows a deep caring for the communities she represents, and a vision for a high quality of life for all Calgarians. </p>\n\n<p>Druh Farrell introduced Calgary&#8217;s first Urban Design Panel, and spearheaded leading-edge initiatives such as sustainable Transit Oriented Development, the award-winning East Village and Centre City Plans, as well as the Calgary Heritage Strategy. From curbside recycling, to LRT upgrades, to the downtown police beat, she advocates for long-term investment in our city. </p>\n\n<p>Recognized as a leader on land use planning, the environment and social issues, Druh Farrell&#8217;s trademark is her passion for urban beauty, safe walkable neighbourhoods and sustainable solutions to growth. </p>\n\n<p>She encourages constructive discussion with Ward 7 residents, and is a vocal champion for increased citizen participation in the processes and debates that are shaping the future of Calgary. Druh believes that great communities build great cities.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.druhfarrell.ca","title":""}]}