{"first_name":"Duane","last_name":"Kinnon","permalink":"duane-kinnon","crunchbase_url":"http://www.crunchbase.com/person/duane-kinnon","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue May 31 12:52:35 UTC 2011","updated_at":"Fri Jun 03 17:54:37 UTC 2011","overview":"<p>While many community leaders may do a couple things to increase awareness or make a positive impact, Duane Kinnon has built an impressive portfolio of programs and initiatives to make his community a much better place. From spending countless hours serving on advisory boards and committees for the Boys and Girls Club of America, to Onondaga County counseling, Duane has built a reputation as an influential and involved member of the community. Duane has been given the Onondaga County District Attorney’s Office Community Service Award (2006); Boys &amp; Girls Club of America’s National Youth Diversity Award (2009) for the public housing program he developed in conjunction with the Syracuse Housing Authority. As a John F. Marsellus Sabbatical Award recipient (2009-2010), which is awarded to nonprofit leaders in Syracuse who have done exemplary work, is one his proudest accomplishments. This rare award is presented by the Community Foundation of Central New York and it provides funding for nonprofit leaders the ability to create their on sabbatical experience. While he has been recognized by many of his peers, the positive impact he has made within his community can hardly be measured and summed up by a series of awards. </p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0013/7115/137115v2-max-150x150.jpg"],[[80,80],"assets/images/resized/0013/7115/137115v2-max-250x250.jpg"],[[80,80],"assets/images/resized/0013/7115/137115v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}