{"first_name":"Dustin","last_name":"Mooney","permalink":"dustin-mooney-2","crunchbase_url":"http://www.crunchbase.com/person/dustin-mooney-2","homepage_url":"http://www.dustinmooney.com","birthplace":"","twitter_username":"DustinMooney","blog_url":"http://blog.dustinmooney.com","blog_feed_url":"http://dustinmooney.com/feed/","affiliation_name":"Unaffiliated","born_year":1989,"born_month":5,"born_day":27,"tag_list":"dustin-mooney, news, journalism, reporting, columnist, dustin, mooney","alias_list":null,"created_at":"Sun Jun 29 03:29:49 UTC 2008","updated_at":"Wed Jan 18 20:32:32 UTC 2012","overview":"<p>Born in North Carolina on May 27th, 1989 to a loving family, Dustin has always faced challenges. After birth Dustin&#8217;s real challenges began with medical complications resulting from being born without an esophagus. To date he has endured more than three hundred surgeries to correct that complication and others. These challenges have shaped and formed him into who he is today, as have the people around him. \nIn early 2000, Dustin moved with his family to Tampa, Florida where he lived until he graduated with honors from Bishop McLaughlin Catholic High School. Dustin now splits his time between Tampa and Orlando where he attends college. Dustin considers himself not just to be a student, but also a writer, journalist and entrepreneur. </p>\n\n<p>In early 2011, Dustin founded Daily Swipe, a new type of news and opinion site that focuses on presenting all sides of the story in a new and distinct way. Daily Swipe brings together varying viewpoints and ideals in order to spark a robust debate on breaking news and current events. Daily Swipe covers politics, business, culture, national and world news. But covering all ideological sides of the story isn&#8217;t the only thing that sets them apart, what also sets them apart is the design. Daily Swipe also aims to present the news in a stylish design reflecting newspapers of the past using the technology of today.</p>\n\n<p>Dustin is fascinated with politics, writing and journalism, media, business and technology. It was his interest in technology that led to his interest in entrepreneurship and business, which is what led to him starting Daily Swipe. These interests began when Dustin was a child and have remained strong ever since.</p>\n\n<p>He hopes too, and is already working toward careers in politics, journalism, media and business. Dustin continues to work hard and push forward so that he can reach the goals he has set for himself; never yielding, never resting, never giving in.</p>","image":{"available_sizes":[[[150,122],"assets/images/resized/0002/1231/21231v2-max-150x150.png"],[[250,204],"assets/images/resized/0002/1231/21231v2-max-250x250.png"],[[450,367],"assets/images/resized/0002/1231/21231v2-max-450x450.png"]],"attribution":"<p>Dustin Mooney</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.facebook.com/home.php#/profile.php?id=703373207","title":"Facebook"},{"external_url":"http://www.flickr.com/photos/dustinmooney/","title":"Flickr"},{"external_url":"http://twitter.com/DustinMooney","title":"Twitter"}]}