{"first_name":"E.","last_name":"Barry Smith","permalink":"e-barry-smith","crunchbase_url":"http://www.crunchbase.com/person/e-barry-smith","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue May 20 23:31:32 UTC 2008","updated_at":"Tue May 20 23:41:30 UTC 2008","overview":"<p>E. Barry Smith joined Aria as the Chief Financial Officer of Aria in December 2006. Prior to joining Aria, Barry was CFO of Telkonet (AMEX: TKO). He is a CPA and senior financial executive with diversified experience in both public and private companies. From September 1987 to February of 2003, Barry was employed as a financial partner and retained as a consultant with Safeguard Scientifics (NYSE: SFE) and its subsidiary companies, including ThinAirApps, Inc. (a wireless application provider that was sold to Palm, Inc.), Interactive Marketing Venture (a database marketing company) and Tangram Enterprise Solutions (a developer of software/hardware for PC/LAN mainframe connectivity and enterprise software management). His professional background also includes big-four public accounting experience with the accounting firm of Deloitte &amp; Touche. Barry has also served as Vice President of Finance and Administration for US Golf Management (a public/private golf course and restaurant management company), Vice President of Finance for International Communications Research (a market research and database services company) and Treasurer for The Chilton Company (a publishing company).</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"CFO","firm":{"name":"Aria Systems","permalink":"aria-systems","type_of_entity":"company","image":{"available_sizes":[[[150,94],"assets/images/resized/0001/8968/18968v8-max-150x150.png"],[[150,94],"assets/images/resized/0001/8968/18968v8-max-250x250.png"],[[150,94],"assets/images/resized/0001/8968/18968v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}