{"first_name":"E.","last_name":"Rogers Novak, Jr","permalink":"e-rogers-novak-jr","crunchbase_url":"http://www.crunchbase.com/person/e-rogers-novak-jr","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Nov 25 07:09:37 UTC 2008","updated_at":"Tue Nov 25 07:11:33 UTC 2008","overview":"<p>Roger Novak brings over 25 years of experience as a venture capitalist, &#8220;angel&#8221; investor, and operating principal. Novak Biddle Venture Partners is a premier early stage venture capital firm backed by some of the country’s most prestigious investors. Each of NBVP’s first three funds are ranked in the top quartile of all venture funds for returns.</p>\n\n<p>Prior to co-founding NBVP, Roger was a private investor. In 1984, he was co-founder and three-fund general partner of Grotech Partners, where he was principally focused on information technology, with two of his investments, Verity and Secure Computing, among the top 10 performing IPOs of 1995. Earlier in his career Roger led the investment banking effort at Baker, Watts &amp; Co., where he served on the firm’s executive committee.</p>\n\n<p>During his career, Roger has served on many public, private and civic boards. Currently, he serves on the boards of Blackboard, Inc. (NASDAQ: BBBB) where he is lead director, SpectrumK12, Trusted Computer Solutions, Digital Signal Corporation, StackSafe, Cdigix, Intelliworks and Centrifuge Systems. He also serves on the advisory boards of several venture funds, the Department of Homeland Security’s PREDICT (Protected Repository for the Defense of Infrastructure Against Cyber Threats) advisory board, and is a member of the OSD’s (Office of Secretary of Defense) DeVenCI program. He is currently a trustee of The Walters Art Museum and serves on the board of the National Venture Capital Association where he is Treasurer and a member of the Executive committee.</p>\n\n<p>Previous NBVP boards include LifeMinders.com, Entevo, Simplexity and N.E.W. Customer Service Companies</p>\n\n<p>Over the years Roger has served on the State of Virginia’s Joint Commission on Science and Technology, where he served on an advisory committee to examine the digital divide, as well as telecommunications, workforce shortages, and education issues. He also served as a member of Harvard’s John F. Kennedy School of Government’s project to examine the funding gap between innovation and commercialization.</p>\n\n<p>In addition, Roger participated in President Bush’s High Technology Summit at the White House. The summit was a forum of the nation’s top business and technology executives, who discussed strategies for a national technology agenda.</p>\n\n<p>A frequent speaker on venture capital, risk and innovation issues, Roger has spoken before the National Institute of Science and Technology, the World Bank/IFC, DARPA, and many other institutions. He has also advised members of Congress and government agencies, about ways the public and private sector can work together to improve the nation’s high-tech economy. A frequent contributor to the local and national media on technology and investment issues, Roger has appeared on The McNeil Lehrer Newshour, CNN, CNNfN, Wall Street Week and other programs.</p>\n\n<p>Recently, Roger was named the winner of the 2007 Early Stage East Sal Buccieri Memorial Venture Impact Award. The honor recognizes an individual who has clearly impacted early stage technology and fast growth opportunities.</p>","image":{"available_sizes":[[[122,145],"assets/images/resized/0002/9525/29525v1-max-150x150.jpg"],[[122,145],"assets/images/resized/0002/9525/29525v1-max-250x250.jpg"],[[122,145],"assets/images/resized/0002/9525/29525v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Novak Biddle Venture Partners","permalink":"novak-biddle-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,69],"assets/images/resized/0000/3475/3475v1-max-150x150.png"],[[200,93],"assets/images/resized/0000/3475/3475v1-max-250x250.png"],[[200,93],"assets/images/resized/0000/3475/3475v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}