{"first_name":"Eamonn","last_name":"Flynn","permalink":"eamonn-flynn","crunchbase_url":"http://www.crunchbase.com/person/eamonn-flynn","homepage_url":"","birthplace":"Dublin, Ireland","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1966,"born_month":6,"born_day":28,"tag_list":"","alias_list":null,"created_at":"Fri May 25 22:24:55 UTC 2012","updated_at":"Sat Jun 02 02:06:04 UTC 2012","overview":"<p>Eamonn Flynn is a Director of Business Development at ividence, a new technology company in the email space. </p>\n\n<p>Winner of the Red Herring Top 100 global companies in 2011, ividence has offices in Paris, San Francisco and New York. The ividence platform is a disruptive technology that transforms the email acquisition market’s traditional practices, bringing to email what is available in the Display and Search markets. </p>\n\n<p>Prior to ividence, Eamonn was with internet radio pioneer Live365. He worked with agencies and brands including Scion, Kraft, Bacardi, Calvin Klein, Captain Morgan, Country Financial, Red Bull, Walmart and Cherry Tree Records to develop custom marketing solutions using the Live365 internet radio platform. </p>\n\n<p>Before that he was with Liquid Air Lab, an iPhone, Android, Blackberry and NOKIA Smartphone specialist who develop mobile multimedia applications and mobile advertising solutions. Based in Stuttgart, Germany with additional offices in Berlin, Germany; and Berkeley, California, Liquid Air Lab was acquired by Stockholm-based 24MAS, a specialist in mobile ads.</p>\n\n<p>Eamonn also worked as a session and recording keyboard player, touring and recording with Michael Franti and Spearhead, The Commitments (12 million selling soundtrack), Elvin Bishop, Michelle Shocked, Zigaboo Modeliste, Pee Wee Ellis, Donald Harrison, Coco Montoya, Evelyn &#8216;Champagne&#8217; King, and Maria Muldaur.</p>\n\n<p>He lives in San Francisco.</p>","image":{"available_sizes":[[[150,114],"assets/images/resized/0019/1867/191867v2-max-150x150.jpg"],[[250,190],"assets/images/resized/0019/1867/191867v2-max-250x250.jpg"],[[305,232],"assets/images/resized/0019/1867/191867v2-max-450x450.jpg"]],"attribution":"<p>Eamonn Flynn</p>"},"degrees":[{"degree_type":"Communications and Media","subject":"Communications","institution":"Colaiste Dhulaigh","graduated_year":1989,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/eamonnflynn","title":""}]}