{"first_name":"easymedia","last_name":"network","permalink":"easymedia-network","crunchbase_url":"http://www.crunchbase.com/person/easymedia-network","homepage_url":"http://www.easysubmission.net","birthplace":"usa","twitter_username":"easysubmission","blog_url":"http://blog.easysubmission.net/","blog_feed_url":"http://blog.easysubmission.net/feed/","affiliation_name":"Unaffiliated","born_year":1980,"born_month":7,"born_day":2,"tag_list":"seo, sem, web, internet-marketing, software","alias_list":null,"created_at":"Thu Nov 10 15:32:00 UTC 2011","updated_at":"Wed Nov 30 16:45:45 UTC 2011","overview":"<p>We are Easy Media Network INC, based out of USA. Our 3 offices UK ,  India &amp; Australia  continents. Our development staff in the U.S. and India allows us the ability to offer a 24 hour development environment and speed to market that was once only imaginable. We cut our teeth on the Net and dreamed of the day we would be right up there with the Internet greats.</p>\n\n<p>Today, we have a well deserved reputation for providing exciting multimedia content, creating innovative Internet business applications, providing top-of-the-line Internet Marketing Services, and offering high quality, low cost solutions. Our professional IT services aim at empowering your enterprise. From getting e-businesses up, creating enticing and powerful multimedia content, managing technology infrastructure, and getting top-notch search engine rankings for your web sites, we are focused on helping your business do better.</p>\n\n<p>We help you to achieve your desired goals on time and within budget. We address the specialized needs of this market to offer a complete business and technology offering; including Development, Hosting, Network Management, and Search Engine Marketing.</p>\n\n<p>Our team numbers over 95 and with our varied skill sets are a committed bunch of people who, most definitely, know what they are doing.</p>","image":{"available_sizes":[[[150,26],"assets/images/resized/0016/1776/161776v2-max-150x150.jpg"],[[250,44],"assets/images/resized/0016/1776/161776v2-max-250x250.jpg"],[[450,80],"assets/images/resized/0016/1776/161776v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.easysubmission.net/contact-us.php","title":"Internet Marketing Company"}],"web_presences":[{"external_url":"http://www.easysubmission.net","title":"seo and sem company"}]}