{"first_name":"Ed","last_name":"Anuff","permalink":"ed-anuff","crunchbase_url":"http://www.crunchbase.com/person/ed-anuff","homepage_url":"http://www.anuff.com/","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Mar 13 05:03:49 UTC 2008","updated_at":"Mon Jul 28 19:21:53 UTC 2008","overview":"<p>Ed Anuff is the Founder of <a href=\"http://www.crunchbase.com/company/widgetbox\" title=\"Widgetbox\">Widgetbox</a> and was the company&#8217;s CEO for the first 18 months of operations. He originated the concept of a widget marketplace and brought the company to market, securing two rounds of funding from Sequoia Capital and Hummer Winblad.</p>\n\n<p>Previously, he was the Co-Founder of Epicentric and served as the company’s first CEO, later assuming the roles of Chairman and Chief Strategy Officer. Mr. Anuff oversaw all product management responsibilities for the company, providing the vision and direction which resulted in the company being the recognized leader in portal technologies. Through his efforts, the company grew to over $40 million in annual revenues, with 300+ employees in offices around the world.</p>\n\n<p>Epicentric was acquired by Vignette in late 2002 and he joined that company’s leadership team, managing their efforts in the portal and collaboration markets and was instrumental in positioning the company as a leader in the portal space in all the major analyst rankings. At Vignette, Mr. Anuff was part of the company’s executive strategy council, which was the group which formulated the company’s aggressive acquisition strategy.</p>\n\n<p>Prior to co-founding Epicentric, he was the Director of Product Management at Wired Digital (HotWired) where he launched and managed the HotBot search engine, managing partnerships with Inktomi, Microsoft, BellSouth, among others. Prior to Wired Digital, he was VP of Product Marketing at Motion Works, a publisher of multimedia software. Mr. Anuff joined Motion Works after the company acquired Vision Software, a multimedia tools start-up he founded in 1992.</p>\n\n<p>A graduate of Rensselaer Polytechnic Institute, Ed has contributed to publications such as Wired magazine, EAI Journal, and the Web Services Journal and has spoken at numerous conferences. He is the author of the best selling Java Sourcebook, published by J. Wiley and Sons, one of the first books on Java programming. An accomplished technologist, Mr. Anuff has experience with a number of programming languages, is a proficient software architect, and has fluent understanding of computer and hardware design. In 2001, he was granted a key patent (US Patent # 6,327,628) related to portal server software</p>","image":{"available_sizes":[[[100,133],"assets/images/resized/0001/5701/15701v1-max-150x150.jpg"],[[100,133],"assets/images/resized/0001/5701/15701v1-max-250x250.jpg"],[[100,133],"assets/images/resized/0001/5701/15701v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Founder & CEO","firm":{"name":"Usergrid","permalink":"usergrid","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0017/0800/170800v1-max-150x150.png"],[[250,74],"assets/images/resized/0017/0800/170800v1-max-250x250.png"],[[386,115],"assets/images/resized/0017/0800/170800v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}