{"first_name":"Ed","last_name":"Blomeley","permalink":"ed-blomeley","crunchbase_url":"http://www.crunchbase.com/person/ed-blomeley","homepage_url":"http://www.blomeley.com","birthplace":"","twitter_username":"","blog_url":"http://blomeley.com/blog","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"blomeley, blomeley-communications, ed-blomeley, donna-blomeley, kardio-knockout, truckguystv, iptv, personal-media, canadian","alias_list":null,"created_at":"Tue May 29 17:46:34 UTC 2012","updated_at":"Wed Jun 06 01:34:09 UTC 2012","overview":"<p>Ed Blomeley is the CEO of the Blomeley Group of Companies.</p>\n\n<p>Blomeley TransMedia Inc. (BTM) is the broadcast and interactive television production subsidiary of Blomeley Communications Inc.</p>\n\n<p>Specializing in IPTV, Online VOD, and Multi-Platform media development BTM was launched in 2000 to address the amalgamation between broadcasting, the internet, and the personal user/viewer experience.  As such BTM has developed and implemented proprietary applications and content that has been purchased interntionally. </p>\n\n<p>With the worldwide proliferation of media entities: i.e. public media servers, personal media technologies, social networks, speciality channels, cable and satellite networks, and the integration of internet technologies into people’s everyday lives, Blomeley TransMedia concentrates on the innovative creation and delivery of niche business and consumer programming and applications that work in the global Direct-To-User marketplace.</p>\n\n<p>Our first project was the re-development of our international hit television series Kardio Knockout® into an interactive digital media franchise with website networks, IPTV, online VOD, DVD, and Podcasts. Since then Blomeley TransMedia has further evolved to currently owning and operating numerous multi-platform media franchises, with programming and content enjoyed worldwide.</p>\n\n<p>In addition to our proprietary programming, software, and application development we partner with broadcasters, media, and content stakeholders to develop and implement next generation media and distribution methodologies.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}