{"first_name":"Ed","last_name":"Fassio","permalink":"ed-fassio","crunchbase_url":"http://www.crunchbase.com/person/ed-fassio","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Mar 08 10:40:28 UTC 2011","updated_at":"Mon Mar 14 22:58:17 UTC 2011","overview":"<p>Ed Fassio has accumulated two decades of IT and business experience working for companies such as Adobe Systems, Microsoft Corporation, Nextel Communications and Apple Computer. His history includes responsibilities as a systems engineer, technology consultant, business development manager, enterprise sales rep and entrepreneur. </p>\n\n<p>Over the course of his career Fassio has been a featured presenter at several technology related trade-shows and forums including MacWorld, COMDEX, CES, NAB, NAMM and SIGGRAPH. He is best known for showcasing the latest IT developments in hardware and software for the entertainment, print, gaming, hospitality, manufacturing and legal industries. </p>\n\n<p>In tandem with technology-based solution providers, Fassio often educates and participates in think-tank focus groups for independent entrepreneurs, small-to-medium businesses and corporate factions, helping clients explore ways to combine branding, sales and marketing strategies ewith emerging technologies. </p>\n\n<p>In mid-2008, Fassio launched Las Vegas-based Itchy Metal Entertainment. Initially a PR firm, he expanded the company’s capabilities to support and accelerate the growth of indie music projects. By late 2010 Itchy Metal re-branded as IME Records, an independent record label, relocated to Los Angeles, CA.</p>","image":{"available_sizes":[[[148,150],"assets/images/resized/0012/5446/125446v2-max-150x150.jpg"],[[149,151],"assets/images/resized/0012/5446/125446v2-max-250x250.jpg"],[[149,151],"assets/images/resized/0012/5446/125446v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/edfassio","title":"Twitter"},{"external_url":"http://www.linkedin.com/pub/ed-fassio/2/32a/661","title":"LinkedIn"},{"external_url":"http://www.facebook.com/efassio","title":"Facebook"}]}