{"first_name":"Ed","last_name":"Kania","permalink":"ed-kania","crunchbase_url":"http://www.crunchbase.com/person/ed-kania","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Flagship Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Nov 10 16:17:38 UTC 2008","updated_at":"Mon Mar 14 22:11:37 UTC 2011","overview":"<p>Ed has 25 years of experience in the venture capital industry. Prior to co-founding Flagship Ventures in 2000, he spent 14 years as General Partner of OneLiberty Ventures and of its predecessor firm, Morgan, Holland Ventures.</p>\n\n<p>From 1983-1984 he served as an Investment Officer at First Capital Corporation of Boston, the venture capital subsidiary of Bank of Boston, and, previously, as Research Associate at Harvard Business School and as General Manager at J. Cunningham, Inc.  He is a frequent speaker on venture capital and entrepreneurship.  Ed earned his undergraduate degree in physics from Dartmouth College and his MBA from Harvard Business School. While at Dartmouth and HBS, he was an All-American Track and Field athlete, a national and collegiate record holder, and a member of the Pacific Coast Club, a track club based in Long Beach, CA.</p>\n\n<p>Throughout his professional career, Ed has operated both as an investor and as an active partner to entrepreneurs in company building.  His direct investment experience covers over 100 companies.  In addition, he has been intimately involved in the launch and development of more than a dozen companies as the founding, lead or co-lead investor, and on occasion has assumed operating roles in support of management.  Several of these companies are now publicly traded while others have been acquired by significant publicly-traded companies. The total value of the companies in which Ed has participated as founding or lead investor is currently several billion dollars.</p>\n\n<p>Ed has served as a Director of Adolor (Nasdaq: ADLR), Alere Corp., Anesta Corp. (Nasdaq: NSTA, purchased by Cephalon, Nasdaq: CEPH), AudioLogic (purchased by Cirrus Logic, Nasdaq: CRUS), ChemGenics Pharmaceuticals (purchased by Millennium, Nasdaq: MLNM), Cytyc Corp. (Nasdaq: CYTC), Ontogeny (merged into Curis, Nasdaq: CRIS), PerSeptive Biosystems (Nasdaq: PBIO, purchased by Applera, NYSE: ABI), Somatogen (Nasdaq: SMTG, purchased by Baxter, NYSE: BXT), Star Semiconductor (purchased by Logic Devices, Nasdaq: LOGC), and as a founding investor in IDEXX Laboratories (Nasdaq: IDXX) and TripAdvisor (purchased by InterActive Corp (Nasdaq: IACI).  He is currently a Director of Flagship portfolio companies Abla-Tx, Acceleron Pharma, Aspect Medical (Nasdaq: ASPM), CERTUS Biomedical Inc, DataCore Software, EXACT Sciences (Nasdaq: EXAS), Interactive Supercomputing and Pervasis Therapeutics, and is Chairman of the Boards of TransMedics and VisEn Medical.  Ed also serves as Chairman of the Board of Directors of Common Impact, a non-profit organization that provides information technology solutions for other non-profits and has been sponsored by Flagship Ventures. He is currently a director of the Massachusetts Biotechnology Council, a not-for-profit organization that provides services and support for the Massachusetts biotechnology industry, and a member of The Johns Hopkins Medicine Alliance for Science and Technology Development Industry.</p>","image":{"available_sizes":[[[103,150],"assets/images/resized/0004/5473/45473v1-max-150x150.jpg"],[[160,232],"assets/images/resized/0004/5473/45473v1-max-250x250.jpg"],[[160,232],"assets/images/resized/0004/5473/45473v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Partner and Chairman","firm":{"name":"Flagship Ventures","permalink":"flagship-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,79],"assets/images/resized/0002/8188/28188v1-max-150x150.jpg"],[[250,131],"assets/images/resized/0002/8188/28188v1-max-250x250.jpg"],[[450,237],"assets/images/resized/0002/8188/28188v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Director","firm":{"name":"Acceleron Pharma","permalink":"acceleron-pharma","type_of_entity":"company","image":{"available_sizes":[[[150,82],"assets/images/resized/0006/9823/69823v1-max-150x150.png"],[[233,128],"assets/images/resized/0006/9823/69823v1-max-250x250.png"],[[233,128],"assets/images/resized/0006/9823/69823v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Director","firm":{"name":"TARIS Biomedical","permalink":"taris-biomedical","type_of_entity":"company","image":{"available_sizes":[[[150,54],"assets/images/resized/0005/1078/51078v1-max-150x150.jpg"],[[219,80],"assets/images/resized/0005/1078/51078v1-max-250x250.jpg"],[[219,80],"assets/images/resized/0005/1078/51078v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}