{"first_name":"Ed","last_name":"Lee","permalink":"ed-lee-2","crunchbase_url":"http://www.crunchbase.com/person/ed-lee-2","homepage_url":"http://sfmayor.org/","birthplace":"","twitter_username":"mayoredlee","blog_url":"","blog_feed_url":"","affiliation_name":"San Francisco Mayor","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Fri Sep 02 19:46:08 UTC 2011","updated_at":"Tue Sep 11 17:07:33 UTC 2012","overview":"<p>Edwin M. Lee, 58, is the 43rd Mayor of the City and County of San Francisco. The former City Administrator, Lee was appointed unanimously as successor mayor by the Board of Supervisors on January 11, 2011 to fill the remaining year of former Mayor Gavin Newsom&#8217;s term, who was sworn in as California&#8217;s Lieutenant Governor on January 10, 2011. Lee is the first Asian-American mayor in San Francisco history.</p>\n\n<p>In 2010, Mayor Lee was appointed to a second term as City Administrator by Mayor Newsom and his appointment was confirmed unanimously by the Board of Supervisors. As City Administrator, Mayor Lee spearheaded government efficiency measures and reforms that reduced the size and cost of government, from reducing the vehicle fleet to consolidating departments and back office functions to save tax dollars.  He implemented the City&#8217;s move to cleaner vehicles and an infrastructure to support electric vehicles and green City government.  Mayor Lee also developed and oversaw implementation of the City&#8217;s first ever Ten Year Capital Plan to guide our capital priorities and infrastructure investment. </p>\n\n<p>Working with the Department of Emergency Management, Mayor Lee has overseen the City&#8217;s disaster recovery and response planning efforts, bringing every department together to coordinate response and recovery for the next major earthquake or emergency. With the Fire Chief, Mayor Lee led efforts to work with PG&amp;E to assess the City&#8217;s gas and electric infrastructure and ensure its safety and reliability.  For the 2010 U.S. Census, Mayor Lee organized the outreach efforts to ensure our City continues to make progress on inclusion and cultural competency.</p>\n\n<p>Mayor Lee first began working for the City and County of San Francisco in 1989 as the Investigator for the City&#8217;s first Whistle Blower Ordinance and has since served as the Executive Director of the Human Rights Commission, Director of City Purchasing, and Director of the Department of Public Works before he was first appointed as City Administrator in 2005.  </p>\n\n<p>Prior to his employment with the City and County of San Francisco, Mayor Lee was the Managing Attorney for the San Francisco Asian Law Caucus, for which he worked from 1979 to 1989. Mayor Lee was born in Seattle, Washington. He graduated Summa Cum Laude from Bowdoin College in 1974 and from Boalt Hall School of Law, University of California, Berkeley, in 1978. Mayor Lee is married to his wife Anita and is the father of two daughters Brianna and Tania.</p>","image":{"available_sizes":[[[116,150],"assets/images/resized/0015/2449/152449v1-max-150x150.jpg"],[[194,250],"assets/images/resized/0015/2449/152449v1-max-250x250.jpg"],[[235,302],"assets/images/resized/0015/2449/152449v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}