{"first_name":"Ed","last_name":"Lang","permalink":"ed-lang-2","crunchbase_url":"http://www.crunchbase.com/person/ed-lang-2","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"SAP","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Aug 21 19:06:15 UTC 2011","updated_at":"Fri Aug 26 21:28:03 UTC 2011","overview":"<p>As executive vice president for SAP America, Inc., Ed Lange is responsible for managing \nthe company’s largest customers in the United States and Canada.  His responsibilities \ninclude advising customers on SAP’s Global Industry Solutions, coordinating SAP, \nPartner, Industry and Solution resources and providing direction on all customer \nprograms.<br/>\nSince joining SAP in 1993, Lange has held many leadership positions. Most recently, \nLange was executive vice president of Sales for the United States, responsible for US \nsales, channels, hosting and consulting management activities for SAP America, Inc.<br/>\nPrior to that, he was senior vice president and general manager for the Manufacturing \nSector, where he was responsible for US sales operations, presales and consulting for the \nHigh Tech, Aerospace and Defense, Engineering and Construction, Automotive, Mill \nProducts, Oil and Gas, Chemicals and Pharmaceuticals market segments.  Lange’s \nresponsibilities at SAP America also included serving as the lead executive for the \ncompany’s Supply Chain Management initiative in the region. Additionally, Lange was \nthe senior executive of global business development for the company’s supply chain \nmanagement solution, mySAP SCM.<br/>\nPrior to joining SAP, Lange had more than 20 years experience in the enterprise software \nindustry, holding various sales and management positions.  Lange worked at Firepond, \nInc., as senior vice president of the North American sales and alliances organization.  He \nalso worked at Accenture (formerly Anderson Consulting) as a sales director for the \nsoftware products division where he advised clients on manufacturing, distribution and \nfinancial software decisions.<br/>\nLange earned a Bachelor of Science degree in General Business from Michigan State \nUniversity. In 2002, Lange was appointed to the Board of the National Association of \nManufacturers (NAM).   </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Customer Officer and Executive Vice President for SAP Americas & Asia Pacific Japan","firm":{"name":"SAP","permalink":"sap","type_of_entity":"company","image":{"available_sizes":[[[66,33],"assets/images/resized/0003/1474/31474v4-max-150x150.png"],[[66,33],"assets/images/resized/0003/1474/31474v4-max-250x250.png"],[[66,33],"assets/images/resized/0003/1474/31474v4-max-450x450.png"]],"attribution":null}}}],"investments":[{"funding_round":{"round_code":"seed","source_url":"","source_description":"","raised_amount":null,"raised_currency_code":"USD","funded_year":2011,"funded_month":2,"funded_day":1,"company":{"name":"Syapse","permalink":"syapse","image":{"available_sizes":[[[150,43],"assets/images/resized/0008/6976/86976v2-max-150x150.jpg"],[[250,72],"assets/images/resized/0008/6976/86976v2-max-250x250.jpg"],[[324,94],"assets/images/resized/0008/6976/86976v2-max-450x450.jpg"]],"attribution":null}}}}],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.sap.com/company/pdf/Lange_05-03.pdf","title":"Bio"}]}