{"first_name":"Ed","last_name":"Mercadante","permalink":"ed-mercadante","crunchbase_url":"http://www.crunchbase.com/person/ed-mercadante","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Feb 22 14:09:15 UTC 2011","updated_at":"Tue Feb 22 14:13:23 UTC 2011","overview":"<p>Ed Mercadante has over 25 years of experience in the prescription health care industry, including significant experience in all facets of pharmacy, including retail, specialty and long term care.  Most recently, in addition to being President and Founder of Dante Capital Management LLC and its business and consulting operations, Mr. Mercadante served as Chairman, President and CEO of Familymeds Group, Inc, a Nasdaq traded, $250+ million, 80+ location specialty pharmacy group, and medical specialty product provider.  Previously, Mr. Mercadante was the CEO of APP a pharmacy benefit management company sold to a major distributor and COO for the Arrow Pharmacy Franchise System which operated locations in major supermarket chains and with independent pharmacy &amp; long term care pharmacy operators. Additionally Mr. Mercadante has significant experience in Long Term Care Pharmacy and chain pharmacy operations.  Mr. Mercadante received his B.S. degree in Pharmacy from the Philadelphia College of Pharmacy and is a registered pharmacist in numerous U.S. states.  He also serves as a member on the Board of Directors for ProHealth Physicians, Inc. in Connecticut, and was formerly on the board of MTS Medication Technologies in Florida (Nasdaq: MTSI), and is a  former member of the Board of Trustees for the University of Sciences in Philadelphia.  He has also served as a member on the Board of Directors for GNC Corporation and Med-i-Bank.</p>","image":{"available_sizes":[[[108,150],"assets/images/resized/0012/3378/123378v1-max-150x150.jpg"],[[130,180],"assets/images/resized/0012/3378/123378v1-max-250x250.jpg"],[[130,180],"assets/images/resized/0012/3378/123378v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Executive Officer","firm":{"name":"NuScriptRx","permalink":"nuscriptrx","type_of_entity":"company","image":{"available_sizes":[[[150,47],"assets/images/resized/0012/3375/123375v2-max-150x150.jpg"],[[244,77],"assets/images/resized/0012/3375/123375v2-max-250x250.jpg"],[[244,77],"assets/images/resized/0012/3375/123375v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}