{"first_name":"Ed","last_name":"McCarthy","permalink":"ed-mccarthy-2","crunchbase_url":"http://www.crunchbase.com/person/ed-mccarthy-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 08 11:55:25 UTC 2009","updated_at":"Mon Jun 08 11:56:28 UTC 2009","overview":"<p>Ed entered the venture capital industry in 1984 and joined the River Cities team in 1999. He heads River Cities&#8217; Raleigh office where he maintains an extensive network of contacts through the Southeastern and Mid-Atlantic states.</p>\n\n<p>During the five years before joining River Cities, Ed served as executive vice president and director of the corporate general partner of a private equity/venture capital partnership in North Carolina. Previously, Ed was a principal with a venture capital firm with offices in Virginia and North Carolina. Ed began his career in the Information Systems Sector of the Harris Corporation in Melbourne, Florida. Initially serving as a design engineer, Ed went on to spend twelve years in engineering management and product-line management positions. He has extensive experience on a number of boards of directors of private and public companies. He has served as a member of the Board of Governors of the National Association of Small Business Investment Companies (NASBIC) and is a past President of the Southern Regional Association of Small Business Investment Companies. He has also been a speaker and panelist at NASBIC Annual Conferences and other industry events. Ed holds a BSEE from Northeastern University, an MSEE from Florida Institute of Technology, and an MBA from Stetson University.</p>\n\n<p>Ed also serves on board of the Atlanta Venture Forum and is also the current chair of the board of Follow the Child Montessori school in Raleigh, NC.</p>","image":{"available_sizes":[[[134,138],"assets/images/resized/0004/7354/47354v1-max-150x150.jpg"],[[134,138],"assets/images/resized/0004/7354/47354v1-max-250x250.jpg"],[[134,138],"assets/images/resized/0004/7354/47354v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"","institution":"Stetson University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"River Cities Capital Funds","permalink":"river-cities-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,44],"assets/images/resized/0004/7346/47346v1-max-150x150.png"],[[250,73],"assets/images/resized/0004/7346/47346v1-max-250x250.png"],[[255,75],"assets/images/resized/0004/7346/47346v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}