{"first_name":"Ed","last_name":"Rensi","permalink":"ed-rensi","crunchbase_url":"http://www.crunchbase.com/person/ed-rensi","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Viridis Learning","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jul 19 14:38:46 UTC 2012","updated_at":"Thu Jul 26 10:03:19 UTC 2012","overview":"<p>Edward H. Rensi, retired president and chief executive officer of McDonald’s USA, currently serves as an executive consultant to McDonald’s Restaurant Systems. He has been a member of McDonald’s Board of Directors since 1982.</p>\n\n<p>Ed Rensi has devoted his entire professional career to McDonald’s, joining the company in 1966 as a grill man and part-time manager trainee in Columbus, Ohio. He was promoted to restaurant manager within a year, and went on to hold nearly every position in the restaurant and field offices, including franchise service positions in Columbus and Washington, D.C.</p>\n\n<p>In 1972, he was named Philadelphia district manager, and later became regional manager and regional vice president. In 1978, he transferred from the field to the company’s home office in Oak Brook, Illinois, as vice president of Operations and Training, where he was responsible for personnel and product development. In 1980, he became executive vice president and chief operations officer, and was appointed senior executive vice president in 1982. Ed Rensi was promoted to president and chief operating office of McDonald’s USA in 1984. In 1991, he was named chief executive officer.</p>\n\n<p>As president and chief executive officer, his responsibilities included overseeing all domestic company-owned and franchisee operations, in addition to providing direction relative to sales, profits, operations and service standards, customer satisfaction, product development, personnel, and training. Ed Rensi was directly responsible for management of McDonald’s USA, which consisted of eight geographic zones and 40 regional offices.</p>\n\n<p>Rensi’s enthusiasm and commitment to the company during his 31-year tenure helped establish McDonald’s as the world’s most successful quick service restaurant. In 1985, Rensi marked a major McDonald’s milestone by serving the 50 Billionth McDonald’s hamburger with Ronald McDonald, a character known to children around the world, and Dick McDonald, one of the two brothers who created the McDonald’s concept in the late 1940s in San Bernardino, California.</p>\n\n<p>Major innovations spearheaded and overseen by Ed Rensi include the: \n-Enhancement of McDonald’s breakfast menu \n-Development of Chicken McNuggets in 1983, fresh-tossed salads in 1987, the McChicken sandwich in 1989, lowfat frozen yogurt in 1990, and the McGrilled Chicken Classic in 1994 \n-McRib \n-Expansion of the drive-thru concept, which accounts for nearly half of all of McDonald’s restaurant sales today \n-Development of the Extra Value Meal concept, a key sales driver for the company.</p>\n\n<p>During his 13-year term as president, McDonald’s experienced phenomenal growth. U.S. sales doubled to more than $16 billion, the number of the U.S. restaurants grew from nearly 6,600 to more than 12,000, and the number of U.S. franchisees grew from 1,600 to more than 2,700. Today, 19 million customers are served each day in the U.S. at McDonald’s. Under Ed Rensi’s leadership, McDonald’s became the most recognized brand in the world*, the next being Coca-Cola, the only soft drink supplier to McDonald’s today.</p>\n\n<p>Known for his speaking ability to motivate an audience of any size, Rensi enjoys visiting McDonald’s employees in the field and encouraging them to deliver McDonald’s famed operating principle of “QSC&amp;V” or Quality, Service, Cleanliness, and Value.</p>\n\n<p>An article on Ed Rensi once noted that his operations expertise was so startling, he can “recite verbatim product procedures, cooking times, holding times, quality guidelines, even Operations and Training Manuel page numbers. If you’re looking for someone with the answers, Ed Rensi has them, and he thinks every operations person in the McDonald’s system should have them as well.”</p>\n\n<p>At one point, Rensi had business cards printed up that identified his position as “Chief Hamburger Griller, French Fryer, Shakemaker, and Cheerleader.” He believed that those were his responsibilities, because “our business is to operate great restaurants…we manage restaurants for the benefit of the customer.”</p>\n\n<p>When asked about his level of involvement in the field, Ed Rensi once said, “It’s so important for us all to get to those places where the real work gets done, where the unheralded heroes of this organization really are. I feel privileged and honored to shake the hands of these people in the restaurants who are so dedicated and care so much. I really believe they are the heroes of McDonald’s.”</p>\n\n<p>While working in McDonald’s Philadelphia region in the 1970s, Rensi was instrumental in the development of the first Ronald McDonald House, a temporary residence for families of children with serious illnesses that has grown to include 165 houses in 12 countries. He is a member of the International Advisory Board for the Ronald McDonald House Program, and previously served as its chairman.</p>\n\n<p>In 1988, Ed Rensi received the distinguished President’s Volunteer Award from President Ronald Reagan for his extensive volunteer efforts with Ronald McDonald Children’s Charities and Ronald McDonald House.</p>\n\n<p>He has been active in the rights of America’s disabled, lobbying for the American’s with Disabilities Act. He was the keynote speaker on the President’s Council on Employing the Disabled. This involvement was in part motivated by the fact that 75 percent of all McDonald’s U.S. restaurants employ at least one person with a physical or mental disability.</p>\n\n<p>Over the years, Ed Rensi has been extremely supportive of Hispanic causes, serving as the chairman of the National Hispanic Corporate Council Institute. He also served on the Board of Governors of the American National Red Cross, and is involved with the League Against Child Abuse.</p>\n\n<p>Rensi received various awards during his career at McDonald’s, including the 1988 Leadership Award from Restaurant Business magazine. He was named one of six “Multi-Unit 1991 Golden Chain Operators of the Year” by Nation’s Restaurant News. In 1985 he was presented with the Porvello Award by The University of Steubenville for humanitarianism, in 1989 he received the Prince Matchabelli National Hero Award, and in 1991 her received the Good Samaritan of the Year Award from Good Samaritan Hospital. In 1994 he received the Italian-American Award and in 1995 he received the Chicago Italian-American Man of the Year Award. He has been listed in Who’s Who in American since 1976.</p>\n\n<p>His special interests include antique trucks, fishing, aviation, photography, and motorsports. Today Ed Rensi serves on the boards of directors for Snap On Tools, Ronald McDonald House Charities, The National Italian American Foundation and the International Speedway Corporation.</p>\n\n<p>After 14 years as a President and CEO, Ed retired to pursue one of his greatest passions, auto racing. From that very first auto race until today, Rensi has been instrumental in the development of Team Rensi Motorsports. Rensi has always been a huge supporter of NASCAR and makes many appearances throughout the year to promote the sport. During the 2003 NASCAR Busch season, TRM won 4 wins, posted 13 top-five and 22 top 10 finishes. In a single season on the Craftsman Truck Series Team Rensi scored two top five and seven top 10 finishes.</p>\n\n<p>A graduate of Ohio State University in Columbus, Ohio, he holds a B.S. in Business Education. Ed Rensi and his wife, Anne, have one daughter and live in suburban Chicago, Illinois</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Board","firm":{"name":"Viridis Learning","permalink":"viridis-learning","type_of_entity":"company","image":{"available_sizes":[[[150,33],"assets/images/resized/0020/0051/200051v2-max-150x150.jpg"],[[181,40],"assets/images/resized/0020/0051/200051v2-max-250x250.jpg"],[[181,40],"assets/images/resized/0020/0051/200051v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}