{"first_name":"Ed","last_name":"St John","permalink":"ed-st-john","crunchbase_url":"http://www.crunchbase.com/person/ed-st-john","homepage_url":"http://about.me/edstjohn","birthplace":"","twitter_username":"","blog_url":"http://edstjohn.tumblr.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"ed-st-john, ed-st-john-australia, warner-music-australia, music-industry, casting-consultant, ceo","alias_list":null,"created_at":"Thu Jul 12 14:54:26 UTC 2012","updated_at":"Thu Jul 12 20:39:27 UTC 2012","overview":"<p>In 1960 Ed St John was born and grew up in Sydney, Australia. By 1977 he had begun working as contributing news editor for Australia&#8217;s highly popular music magazine &#8216;Rolling Stone&#8217; and also worked as a freelance music journalist and editor.  St John wrote a weekly music column in the leading Australian publication, the Sunday Telegraph as well as contributing to the Sydney Morning Herald and other publications. St John wrote and produced for many well-known television programs on various Australian networks.</p>\n\n<p>In 1993 St John was appointed role of Manager of Advertising and Special Products at Sony Music Australia, overseeing Sony’s $10 million and TV advertising account.  St John was responsible for the success of multi-platinum artists and negotiated lucrative royalty deals with TV networks and was eventually promoted to Director of Marketing for the Columbia label.</p>\n\n<p>In 1998, St John began working for BMG Australia and New Zealand and in 2001 was selected as Managing Director reporting directly to the President of Asia Pacific. St John led the company via an excellent period of outstanding performance and managed the integration of Zomba (worldwide acquisition).  </p>\n\n<p>St John worked closely with the launch of the Australian Idol franchise and was responsible for the spectacular early success of Guy Sebastian and Shannon Noll where first year results were noted as sales of 1.9 million units of CD&#8217;s and DVD&#8217;s.  Due to St John&#8217;s success, BMG was named as Affiliate of the Year in 2003.  </p>\n\n<p>In his role as CEO at Warner Music, specifically at the entry into an era of vast modification in 2005, St John handled the Australian and New Zealand operations.  During his time at Warner Music, he demonstrated the ability to swiftly respond to the revolution in consumer behavior and elevated the paradigm shift in marketing and media buying, away from conventional media. St John exercised his entrepreneurial skills and oversaw many successful distribution deals at the pre-acquisition stage via a challenging period of global decline in profits.  </p>\n\n<p>In 2000, as BMG Managing Director, Ed St John was elected to the PPCA and ARIA boards. After the move to Warner Music in 2005, he also retained seats on both boards and held the position of Chairman of the ARIA Awards Committee for a decade. ARIA is the Australian Recording Industry Association that has introduced artists into its ARIA Hall of Fame by honoring the increasing amount of renowned songwriters, producers and performers and those who leave their mark on the Australian music culture.  </p>\n\n<p>In 2008, St John received the great privilege in being elected as the new Chairman of ARIA in 2008 and replacing the legendary Denis Handlin who stepped down from this role. As Chairman of ARIA, St John has delivered keynote speeches on the state of the music industry in Australia.  </p>\n\n<p>After an assortment of colorful roles, Ed St John became a star casting professional in 2011 and was accountable for providing Australia viewers with The Voice, the highly popular and entertaining TV show.</p>","image":{"available_sizes":[[[116,150],"assets/images/resized/0020/0496/200496v2-max-150x150.jpg"],[[160,206],"assets/images/resized/0020/0496/200496v2-max-250x250.jpg"],[[160,206],"assets/images/resized/0020/0496/200496v2-max-450x450.jpg"]],"attribution":"<p>Ed St John Australia</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.edstjohn.org.au","title":"Ed St John's Biography"},{"external_url":"http://www.edstjohn.com.au","title":"Ed St John's Wiki Page"},{"external_url":"http://www.edstjohn.com","title":"Ed St John's Look up Psge"},{"external_url":"http://www.songsummit.com.au/program/speakers-artists/ed-st-john/","title":"Ed St John on Song Summit"}],"web_presences":[{"external_url":"http://www.visualcv.com/edstjohn","title":"Ed St John Resume"},{"external_url":"http://au.linkedin.com/pub/ed-st-john/25/893/a77","title":"Ed St John on Linkedin"}]}