{"first_name":"EDC","last_name":"Oakbrook","permalink":"edc-oakbrook","crunchbase_url":"http://www.crunchbase.com/person/edc-oakbrook","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"http://edcoakbrook.livejournal.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 26 11:21:51 UTC 2012","updated_at":"Tue Jun 26 21:02:15 UTC 2012","overview":"<p>EDC is recognized as one of the best recruiting firms in the field today.  For more than 20 years, the Oakbrook Terrace, IL-based firm has been actively assisting professionals in finding good jobs or transitioning to new career paths.</p>\n\n<p>EDC works in a twofold manner for the benefit of both career seekers and the companies searching for employees.  Primarily, it combines technique and technology using state-of-the-art business intelligence in order to offer professionals highly advanced career search methods, increasing their exposure to lucrative career opportunities.  Apart from this, the firm assists professionals in assessing their skills and in negotiating improved incentive packages.</p>\n\n<p>Meanwhile, EDC helps employers find highly qualified candidates to fill any job vacancy across a wide variety of industries and functional backgrounds.  By utilizing its nationwide presence, the firm is able to help client companies save resources and time.  Over the years, EDC has worked with prominent and familiar names in business, such as Target, Atlantis Foods, Florida Hospital, DHL, and others.</p>\n\n<p>More information is available at www.edcweb.net.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0019/7388/197388v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0019/7388/197388v2-max-250x250.jpg"],[[400,400],"assets/images/resized/0019/7388/197388v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://twitter.com/#!/edcoakbrook","title":"Twitter"},{"external_url":"http://www.linkedin.com/in/edcoakbrook","title":"Linkedin"}]}