{"first_name":"Edgar","last_name":"Bronfman, Jr","permalink":"edgar-bronfman-jr","crunchbase_url":"http://www.crunchbase.com/person/edgar-bronfman-jr","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Nov 07 01:02:54 UTC 2008","updated_at":"Tue Jan 25 21:20:44 UTC 2011","overview":"<p>Edgar Bronfman, Jr. is Chairman and Chief Executive Officer of Warner Music Group, one of the world’s major music companies and home to a collection of some of the best-known record labels in the music industry.  Warner Music Group also includes Warner Music International, a leading company in national and international repertoire operating through 37 affiliates and numerous licensees in more than 50 countries, and Warner/Chappell Music, one of the world&#8217;s leading music publishers, with a catalog of more than one million copyrights worldwide.</p>\n\n<p>Mr. Bronfman also serves as general partner at Accretive, LLC, a private equity firm specializing in the business process outsourcing area.  Before joining Warner Music Group, Mr. Bronfman served as Chairman and CEO of Lexa Partners LLC, a management venture capital group based in New York City. </p>\n\n<p>Mr. Bronfman was appointed Executive Vice Chairman of Vivendi Universal in December 2000.  He resigned from his position as an officer and executive of Vivendi Universal on March 31, 2002, and resigned as Vice Chairman of Vivendi Universal’s Board of Directors on December 2, 2003. </p>\n\n<p>Prior to the December 2000 formation of Vivendi Universal, Mr. Bronfman was President and CEO of The Seagram Company Ltd., a post he held since June 1994.  During his tenure as the CEO of Seagram, he consummated 85 billion dollars in transactions and transformed the company into one of the world’s leading media and communications companies.  He was the chief architect behind the leadership positions achieved by Universal’s entertainment business in music, film and recreation. </p>\n\n<p>From 1989 until June 1994, Mr. Bronfman served as President and Chief Operating Officer of Seagram.  Between 1982 and 1989, he held a series of senior executive positions for The Seagram Company Ltd. in the U.S. and in Europe.</p>\n\n<p>Mr. Bronfman serves on the board of InterActiveCorp.  He is Chairman of the Board of Endeavor Global, a non-profit organization pioneering a new approach to international development.  Mr. Bronfman also serves on the boards of New York University Elaine A. and Kenneth G. Langone Medical Center; The Collegiate School; and the Board of Governors of The Joseph H. Lauder Institute of Management and International Studies at the University of Pennsylvania.  He is a member of JPMorgan&#8217;s National Advisory Board and the Council on Foreign Relations.</p>\n\n<p>Mr. Bronfman is married and resides in New York City.  He has seven children.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0002/7994/27994v3-max-150x150.jpg"],[[106,160],"assets/images/resized/0002/7994/27994v3-max-250x250.jpg"],[[106,160],"assets/images/resized/0002/7994/27994v3-max-450x450.jpg"]],"attribution":"<p>WMG</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Warner Music Group","permalink":"warner-music-group","type_of_entity":"company","image":{"available_sizes":[[[150,30],"assets/images/resized/0003/3761/33761v1-max-150x150.png"],[[250,50],"assets/images/resized/0003/3761/33761v1-max-250x250.png"],[[323,65],"assets/images/resized/0003/3761/33761v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://en.wikipedia.org/wiki/Edgar_Bronfman_Jr.","title":"Wikipedia entry for Edgar Bronfman, Jr"}],"web_presences":[]}