{"first_name":"Edmund","last_name":"Truell","permalink":"edmund-truell","crunchbase_url":"http://www.crunchbase.com/person/edmund-truell","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Nov 05 05:53:18 UTC 2012","updated_at":"Mon Nov 05 05:53:42 UTC 2012","overview":"<p>Edmund Truell has 28 years of financial services experience in private equity and debt markets. Edmund trained at Bankers Trust Co in New York, following which he was appointed a director of the Hambros Bank in 1991; Chief Executive of Hambro European Ventures in 1994; led the 1998 buyout and formation of Duke Street Capital; and was responsible in 2000 for creating and building Duke Street Capital Debt Management. He was Chairman of the British Venture Capital Association from 2001 to 2002. With his brother Danny Truell, in 2006 he co-founded Pension Corporation, a leading provider of risk management solutions to defined benefit pension funds. Its FSA-authorised and regulated insurance company, Pension Insurance Corporation, has over £4 billion in assets under management and has insured 50,000 pension fund members and amongst other achievements was the first to insure the benefits of a public sector pension scheme, as well as transacting the largest ever UK corporate pension insurance buyout. He is qualified as a Chartered Financial Adviser and a Trustee of The Truell Charitable Foundation and the Charles Darwin Foundation.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chairman","firm":{"name":"Disruptive Capital Finance","permalink":"disruptive-capital-finance","type_of_entity":"financial_org","image":{"available_sizes":[[[150,61],"assets/images/resized/0021/8753/218753v1-max-150x150.jpg"],[[213,87],"assets/images/resized/0021/8753/218753v1-max-250x250.jpg"],[[213,87],"assets/images/resized/0021/8753/218753v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}