{"first_name":"Eduardo","last_name":"Arcos","permalink":"eduardo-arcos","crunchbase_url":"http://www.crunchbase.com/person/eduardo-arcos","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Hipertextual","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 28 20:46:55 UTC 2009","updated_at":"Fri Jun 17 18:08:59 UTC 2011","overview":"<p>Eduardo Arcos is the founder of Hipertextual one of the biggest commercial blog networks in Spain and Latinamerica; he is considered one of the most read and influential bloggers in spanish publishing posts and articles everyday in ALT1040.com, which covers technology and the geek culture. Hipertextual has 16 blogs focused on niches and popular subjects.</p>\n\n<p>Born in Guayaquil, Ecuador on 1978, Eduardo started with tecnology at a very early stage of his life: 5 years, one year later he learned his first programming language. He&#8217;s been online since 1995 and very interested in the social aspect of the net. After moving to Mexico in 1997 when he created Ecuatorianos.com, one of the most popular websites of his country which spawned a very big community of ecuadorians outside their home country. In 1999 he was an designer and advisor for the Vicente Fox&#8217;s (Mexico&#8217;s ex-president) online campaign.</p>\n\n<p>In 2001 he accepted a position as media director in noiselab, a very popular multidisplinary company focused on music, internet, and real life events in Mexico. He eventually became a partner when he was just 23 years old.</p>\n\n<p>On 2002 he created ALT1040 which rapidly became one of the most popular blogs in spanish, realizing their big impact and commercial success, he founded Hipertextual in 2005. In november 2007 Martin Varsavsky acquired 10% of the blog network and became an investor.</p>\n\n<p>Other projects include Enchilame.com, a local-mexican version of Meneame.net and Sunday Morning, an informal meeting around the world for internet entrepeneurs.</p>","image":{"available_sizes":[[[96,150],"assets/images/resized/0003/5110/35110v1-max-150x150.jpg"],[[160,250],"assets/images/resized/0003/5110/35110v1-max-250x250.jpg"],[[240,373],"assets/images/resized/0003/5110/35110v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[{"is_past":true,"title":"TituloTest","firm":{"name":"GooTest","permalink":"gootest","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}