{"first_name":"Edward","last_name":"Shen","permalink":"edward-shen","crunchbase_url":"http://www.crunchbase.com/person/edward-shen","homepage_url":"http://web.media.mit.edu/~edward","birthplace":"Taipei","twitter_username":"aniki1225","blog_url":"http://edwardshen.blogspot.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1979,"born_month":12,"born_day":25,"tag_list":"storysense, artificial-intelligence, ai, storytelling, whatsthenumber","alias_list":null,"created_at":"Fri Sep 02 08:47:43 UTC 2011","updated_at":"Wed Sep 21 16:22:23 UTC 2011","overview":"<p>Edward Shen is a big fan of creating stories and technologies. Holding a master&#8217;s degree from the MIT Media Laboratory, he has a cross-disciplinary expertise in filmmaking and story understanding technologies. His technical papers were published in major academic conferences, including ACM SIGGRAPH, ACM CHI and IUI, and he also participated in several documentary films, including his independent production, Life. Research. (officially selection in Plymouth Film Festival 2007), and Go Grandriders, where he worked as an assistant editor and associated producer. In 2009, he founded a software company, StorySense Computing Inc, aiming to help people organize and utilize content more easily with its artificial intelligence technology. The first product this company is working on is called WhatsTheNumber, a cloud-based service that extracts contact information from your email texts, and syncs into your iPhone phonebook. It saves users from the trouble of organizing or looking for phone numbers in emails, especially when the contact person&#8217;s name is forgotten. WhatsTheNumber is developed based on the artificial intelligence engine developed in StorySense, which is, to put it simply, a brain that can read and write. Shen envisions to create applications that summarize and re-edit information for the users (semi-)automatically, which reduce the amount of data and lead to better user experience, in this age of information explosion.   </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://tw.linkedin.com/pub/edward-shen/0/a12/b22","title":""},{"external_url":"http://edwardshen.blogspot.com/","title":""}]}