{"first_name":"Edward","last_name":"Swiderski","permalink":"edward-swiderski","crunchbase_url":"http://www.crunchbase.com/person/edward-swiderski","homepage_url":"http://www.swiderski.info","birthplace":"","twitter_username":"eswiderski","blog_url":"http://www.swiderski.info","blog_feed_url":"","affiliation_name":"Kambio Group","born_year":1979,"born_month":7,"born_day":20,"tag_list":"swiderski, kambio, chicago, cloud, social-media","alias_list":null,"created_at":"Wed Jan 18 04:23:51 UTC 2012","updated_at":"Fri Jan 27 10:48:13 UTC 2012","overview":"<p>Ed Swiderski is a technology industry enthusiast with over 12 years of consulting and business development in the commercial and enterprise space. Ed&#8217;s unique background in business solutions and technology strategy have attributed to much of his success, in addition to his continuous education and industry event support around the country.\nWikipedia Entry: http://en.wikipedia.org/wiki/Ed_Swiderski\nProfessional History</p>\n\n<p>Mr. Swiderski began his career with Voyager.net as an intern while attending Michigan State University. Upon graduating, he immediately joined Analysts International in various software development capacities. He was involved in software projects from small commercially focused, to large-scale systems integration. In the midst of his entry level experience, Ed started up GreenCanyon, a professional web services consulting firm.  Mr. Swiderski has also driven business solutions for Magenic and NuSoft, national leaders of Microsoft consulting services. Mr. Swiderski&#8217;s more recent role has been Enterprise Services Executive, with Microsoft Consulting Services, where he was responsible for managing 10 states in the Midwest region, specifically focused on enterprise services. Ed&#8217;s core responsibilities included sales, account management and orchestrating enterprise application and infrastructure deployments.</p>\n\n<p>Ed recently co-founded Kambio Group, a Chicago-based technology, social media and cloud computing consultancy.  Kambio is a combination of GreenCanyon&#8217;s enterprise web solutions and IT automation, and Mix Media LLC&#8217;s creative marketing and new media expertise. </p>\n\n<p>Community Involvement\nKey activities and organizations include serving as a founding Board Member of the International Association of Microsoft Certified Partners (IAMCP), serving as an active member of the Illinois Technology Association (ITA), serving as a general member of the Chicago Technology Executives Club, serving as the Vice President of the MSU Alumni Association of Metropolitan Chicago and currently serves on the board of the MSU College of Communication Arts and Sciences.\nGEOTF\nEd is also a founding director of the Global Education Open Technology Foundation, which partners up with other technology organizations around the globe to bring technology to less privileged students.</p>\n\n<p>Education\nHe received a Bachelor of Science in Information Technologies Management from Michigan State University, and is currently pursuing his Masters in Information Systems from DePaul University.</p>\n\n<p>Television\nOutside of his professional career, Ed has also co-starred on ABC&#8217;s The Bachelorette, where he was selected as the final contestant.</p>\n\n<p>Journalism/Media\nEd writes for the Tribune Company&#8217;s ChicagoNow blog EdorAlive - a weekly blog spanning from consumer electronics to enterprise technology.</p>\n\n<p>Ed currently hosts the nationally-focused startup, SocialTechPop, which covers pop culture, technology news and events around the country.</p>","image":{"available_sizes":[[[150,147],"assets/images/resized/0017/0648/170648v2-max-150x150.jpg"],[[250,245],"assets/images/resized/0017/0648/170648v2-max-250x250.jpg"],[[300,294],"assets/images/resized/0017/0648/170648v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelors","subject":"Information Management","institution":"Michigan State University","graduated_year":1997,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Partner","firm":{"name":"Kambio Group","permalink":"kambio-group","type_of_entity":"company","image":{"available_sizes":[[[150,88],"assets/images/resized/0016/9717/169717v2-max-150x150.jpg"],[[200,118],"assets/images/resized/0016/9717/169717v2-max-250x250.jpg"],[[200,118],"assets/images/resized/0016/9717/169717v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}