{"first_name":"Edward","last_name":"Rivas","permalink":"edward-rivas","crunchbase_url":"http://www.crunchbase.com/person/edward-rivas","homepage_url":"http://www.goldenkeymanagement.com","birthplace":"Dominican Republic","twitter_username":"dominicanvillas","blog_url":"http://dominicanrepublicvillas.blogspot.com/","blog_feed_url":"","affiliation_name":"Golden Treasures Real Estate","born_year":null,"born_month":null,"born_day":null,"tag_list":"dominican-republic-villas, sosua-villas, luxury-villas, oceanfront-properties, cabarete, puerto-plata, private-villas, fractional-ownership, wheelchair-access","alias_list":null,"created_at":"Mon Sep 13 02:03:42 UTC 2010","updated_at":"Tue Jun 14 21:09:00 UTC 2011","overview":"<p>Edward Rivas is the sales manager of Golden Treasures Real Estate, a luxury villa sales and rental agency in the Dominican Republic. </p>\n\n<p>Golden Treasures is one of the top villa rental and luxury real estate providers in the towns of Sosua, Cabarete, Puerto Plata, Cabrera and Cofresi. Previously known as Golden Key Management, the company started operations in 2008 and soon became one of the favorite providers of self catering accommodations in the area, with special introductions such as the Villa Ultima in Casa Linda.</p>\n\n<p>This pioneer of Dominican Republic villas for sale and rent also introduced fractional ownership real estate in the North Coast, partnering and cooperating with well known villa residential projects in the island, customizing and advising clients based on their specific requests.</p>\n\n<p>Recently, Golden Treasures introduced the first wheelchair accessible vacation rentals and real estate ( universal access homes ) service in the Dominican Republic.  Now, handicap travelers have the first agency that truly dedicates their time and effort to make it barrier-free to disabled persons.</p>\n\n<p>Another important pioneering effort of this agency is the property management for one year given free to all new villa owners, and also the title insurance guarantee to those purchasing Dominican Republic villas. A series of bonus services has positioned this agency in the right direction, always following a customer-oriented service philosophy never seen before in this Caribbean island.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0010/1457/101457v4-max-150x150.jpg"],[[250,187],"assets/images/resized/0010/1457/101457v4-max-250x250.jpg"],[[450,337],"assets/images/resized/0010/1457/101457v4-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Sales Manager","firm":{"name":"Golden Treasures Real Estate","permalink":"golden-treasures-real-estate","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.scribd.com/doc/33700761/Buying-Dominican-Republic-Villas-for-Sale","title":"Buying Dominican Republic Villas For Sale"},{"external_url":"http://www.prlog.org/10821393-dominican-republic-title-insurance-implemented-by-golden-treasures-real-estate.html","title":"Title Insurance Dominican Republic"}],"web_presences":[{"external_url":"http://www.goldenkeymanagement.com","title":"Dominican Republic Villas"}]}