{"first_name":"Edward","last_name":"Chatlos","permalink":"edward-chatlos","crunchbase_url":"http://www.crunchbase.com/person/edward-chatlos","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"PeerPort.us","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jun 24 12:09:55 UTC 2009","updated_at":"Wed Jun 24 18:43:37 UTC 2009","overview":"<p>Ed is the CEO and co-founder of PeerPort, a leading innovator of collaborative social networks for businesses.</p>\n\n<p>PeerPort.us is an online collaboration and communications platform that enables virtual teams to work together more effectively. Designed to meet the needs of small and medium sized businesses, PeerPort&#8217;s integrated suite of services includes unlimited audio and web conferencing, messaging, calendaring, action item tracking and document management.</p>\n\n<p>Prior to forming PeerPort in 2008, Ed was President of GI since 2002. GI builds and manages market-based Communities for technology companies. </p>\n\n<p>Prior to this, Ed was at AT&amp;T in a number of positions including most recently Vice President and General Manager of AT&amp;T’s WorldNet Service. Ed had P&amp;L responsibility for AT&amp;T&#8217;s consumer ISP service including all Marketing, Sales, Product Management, and Operations functions. During his tenure Ed led the team to more than double its subscriber base to the 4th largest ISP in the US and become a profitable business for AT&amp;T. Prior to January 1999, Ed was Vice President of Internet Strategy and Business Development for AT&amp;T. </p>\n\n<p>Prior to joining AT&amp;T he was at Novell, Inc. as the leader of Business Development and Mergers and Acquisitions for the OS Platform business. He joined Novell as a result of Novell’s acquisition of Unix System Laboratories, Inc. (USL). While at USL he was responsible for Business Planning and Development and managed the transition of USL from separate organizations within AT&amp;T to a standalone partially owned subsidiary of AT&amp;T through to the acquisition of USL by Novell. From 1987 - 1990 he was located in London, England and was responsible for Sales and Marketing throughout Europe for Unix System software.</p>\n\n<p>Ed has a Bachelors of Science in Electronic Engineering and a Masters of Science in Computer Science from Johns Hopkins University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"PeerPort.us","permalink":"peerport-us","type_of_entity":"company","image":{"available_sizes":[[[150,36],"assets/images/resized/0005/0490/50490v10-max-150x150.png"],[[244,60],"assets/images/resized/0005/0490/50490v10-max-250x250.png"],[[244,60],"assets/images/resized/0005/0490/50490v10-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}