{"first_name":"Edward","last_name":"M. Perry","permalink":"edward-m-perry","crunchbase_url":"http://www.crunchbase.com/person/edward-m-perry","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Murphree Venture Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jun 03 12:28:02 UTC 2009","updated_at":"Mon Sep 12 00:35:48 UTC 2011","overview":"<p>Ed Perry, 50, joined MVP as a Venture Partner in 2004 and will run the Austin, Texas office. Mr. Perry is currently the President and CEO of Advent Networks, one of the Firm&#8217;s portfolio investments. He also serves on the board of directors of two companies and the advisory boards of two others. In addition, he guest teaches entrepreneurship and venture finance at several universities in Texas.</p>\n\n<p>Mr. Perry has served in venture finance for four years, first as a Venture Fellow for AV Labs, the incubator arm of Austin Ventures, then as Managing Director of Koch Ventures. He is an EIR for STARTech Early Ventures and BCMT - the venture investment fund of Baylor College of Medicine.</p>\n\n<p>While at AV Labs, Mr. Perry served as founding CEO for 3 new start-ups. He also served as interim CEO for TriActive, re-directing the company and returning it to prosperity. Prior to joining AV Labs, Ed was the CEO/Managing Partner of four successful technology start-ups. Each returned back to its investors at least 10X their investment. The latest was Human Code that was sold to Sapient Corporation for $135M less than 2 years following a $5M re-start investment.</p>\n\n<p>Mr. Perry has served as an executive in McDermott, Apple, Sapient, and Versant Technology - all as a result of assimilation of start-ups he has led. While at McDermott, he managed IT for the engineering division of the company. At Apple, he managed business marketing for North America and South America.</p>\n\n<p>Mr. Perry received his Bachelor&#8217;s and Master&#8217;s degrees in Chemical Engineering from Rice University, graduating with honors. He has received leadership training from Strozzi Institute. He has studied Technology Marketing at the Haas School of Business at the University of California at Berkeley. Once an active member of Global Business Network, he has provided scenario planning consulting to the Saudi Arabian government, Cemex, Bank of America, Wells Fargo Bank, DHL and others. </p>","image":{"available_sizes":[[[101,135],"assets/images/resized/0004/6483/46483v1-max-150x150.jpg"],[[101,135],"assets/images/resized/0004/6483/46483v1-max-250x250.jpg"],[[101,135],"assets/images/resized/0004/6483/46483v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Master's degrees","subject":"Chemical Engineering","institution":"Rice University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Murphree Venture Partners","permalink":"murphree-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[77,71],"assets/images/resized/0004/6481/46481v1-max-150x150.jpg"],[[77,71],"assets/images/resized/0004/6481/46481v1-max-250x250.jpg"],[[77,71],"assets/images/resized/0004/6481/46481v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}