{"first_name":"Edwin","last_name":"Moses","permalink":"edwin-moses","crunchbase_url":"http://www.crunchbase.com/person/edwin-moses","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 28 20:47:43 UTC 2009","updated_at":"Wed Jan 28 20:47:43 UTC 2009","overview":"<p>Edwin Moses will always be remembered for one of the most dominant reigns in world sport. For a remarkable nine years, nine months and nine days, he remained invincible in the 400 metres hurdles, being unbeaten in 122 consecutive races (107 finals). Bounding over the 10 three-foot obstacles, he took an unprecedented 13 steps in between the hurdles instead of the usual 14 and managed to produce a rare winning mix of speed, grace and stamina.</p>\n\n<p>By the time he retired from the sport in 1989, Moses had won two Olympic gold medals, in Montreal in 1976 and Los Angeles in 1984 and a bronze in Seoul in 1988. He would almost certainly have won a third gold, but for the American boycott of the 1980 Olympics in Moscow. In 1983 he broke the world record for the fourth time in Koblenz, Germany, with a time of 47.02, a mark which stood for the next nine years. During his career he won three World Cup titles and two World Championships.</p>\n\n<p>A qualified physicist, Moses has been a member of the International Olympic Committee Ethics Commission since 2000. In 2000, he was elected by his fellow members to become the inaugural Chairman of the Laureus World Sports Academy. He is an accomplished public speaker and motivator, and has been speaking to corporations and other organisations for over 20 years. </p>","image":{"available_sizes":[[[96,150],"assets/images/resized/0003/5111/35111v1-max-150x150.jpg"],[[160,250],"assets/images/resized/0003/5111/35111v1-max-250x250.jpg"],[[240,373],"assets/images/resized/0003/5111/35111v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}