{"first_name":"Edwin A.","last_name":"Goodman","permalink":"edwin-a-goodman","crunchbase_url":"http://www.crunchbase.com/person/edwin-a-goodman","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Milestone Venture Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Nov 22 18:12:33 UTC 2008","updated_at":"Wed Feb 09 01:04:35 UTC 2011","overview":"<p>Mr. Goodman co-founded Milestone Venture Partners in 1999, as he was energized by the opportunities he saw being created by the Internet in the New York metropolitan area. He currently sits on the board of Medidata Solutions, Inc. and SkillSurvey, Inc.  He supervises MVP II’s investment in ExpertPlan, Inc. and MVP III’s investment in M5 Networks and Outside.in.</p>\n\n<p>Prior to founding Milestone, Mr. Goodman was with the U.S. office of Hambros, a London-based merchant bank. He joined the firm in 1981 and supervised the growth of the business from $5 million of paid-in-capital to $150 million.  The Hambros venture team invested in more than 100 companies in a wide variety of businesses, including computer hardware, software, healthcare, retailing, waste disposal and traditional manufacturing businesses.  Some of the more visible successes that became public companies or were profitably sold include Allied Waste (NYSE: AW), Corporate Software, Komag (Nasdaq:KOMG), PCA International, Petsmart, Inc (Nasdaq: PETM), RASNA Corporation, Solectron Corporation (NYSE: SLR), Staples (Nasdaq: SPLS), Telematics, and Veeco Instruments (Nasdaq: VECO). </p>\n\n<p>Prior to Hambros, Mr. Goodman worked at Patricof &amp; Co. (now Apax Partners), which he joined in 1974 as its third employee.  During his seven years with the organization, he participated in all aspects of the business.  The most prominent of its investments was a $250,000 commitment to the final private financing round raised by Apple Computer in the summer of 1977.</p>\n\n<p>From 1970 through 1973, Mr. Goodman managed WBAI FM, an educationally licensed, listener-sponsored FM radio station in NYC. Before managing WBAI, Mr. Goodman joined the Bedford Stuyvesant Development &amp; Services Corporation in Brooklyn, NY in 1967 and became its co-chief executive.  The group made SBA-guaranteed loans to dozens of small businesses to encourage entrepreneurship and job creation.</p>\n\n<p>Mr. Goodman started his business career by joining his family’s high-fashion retailing business, Bergdorf Goodman, in New York City.  He spent five years with the firm and worked with his father on the sale of the business to Carter Hawley Hale Stores, a New York Stock Exchange company, in 1972.  The Goodman family retains ownership of the land and building.</p>\n\n<p>In addition to these venture capital responsibilities, Mr. Goodman is a former board chair and a current life trustee of the Board of the Choate Rosemary Hall School and is Chairman of the Board of FIT (The Fashion Institute of Technology), an 11,000-student college within the State University of New York system. Mr. Goodman is also a founding director of Donors Choose (www.donorschoose.org).</p>","image":{"available_sizes":[[[103,150],"assets/images/resized/0004/5149/45149v1-max-150x150.jpg"],[[138,200],"assets/images/resized/0004/5149/45149v1-max-250x250.jpg"],[[138,200],"assets/images/resized/0004/5149/45149v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MS","subject":"","institution":"Columbia University Business School","graduated_year":1979,"graduated_month":null,"graduated_day":null},{"degree_type":"BA","subject":"English literature","institution":"Yale College","graduated_year":1962,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"","firm":{"name":"Milestone Venture Partners","permalink":"milestone-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[98,112],"assets/images/resized/0002/9383/29383v1-max-150x150.jpg"],[[98,112],"assets/images/resized/0002/9383/29383v1-max-250x250.jpg"],[[98,112],"assets/images/resized/0002/9383/29383v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}