{"first_name":"Edwin","last_name":"Hernandez","permalink":"edwin-hernandez","crunchbase_url":"http://www.crunchbase.com/person/edwin-hernandez","homepage_url":"http://edwinhernandez.com/","birthplace":"Honduras","twitter_username":"edwinhe","blog_url":"http://edwinhernandez.com/","blog_feed_url":"","affiliation_name":"EGLA COMMUNICATIONS","born_year":null,"born_month":null,"born_day":null,"tag_list":"mobile, wireless, smart-tv, iptv, emulation, mobility-protocols, patents","alias_list":null,"created_at":"Thu Jun 07 13:06:02 UTC 2012","updated_at":"Sat Jun 09 20:37:58 UTC 2012","overview":"<p>Dr. Edwin Hernandez was born in Tegucigalpa, Honduras, BSEE’95, MSECE’99, and PhD’02. Edwin has worked in many telecommunication companies in Central America including RACSA and COMTELCA.  Dr. Hernandez became one of the Internet pioneers in Honduras, when in 1996-started COMPUNET, one of Honduras first Internet Service Providers.</p>\n\n<p>Edwin has been working on mobile systems since early 1999 when Motorola released the first J2ME smart phone. Dr. Hernandez has been a researcher at the University of Florida at the High-Performance Computing and Simulation Research Lab and Harris Mobile Computing Lab investigating the effects of speed in mobile devices handoff and mobile operating systems.</p>\n\n<p>Dr. Hernandez research conducted to the creation of a “Drive Testing Simulation and Emulation” tool called RAMON. RAMON is a mobility emulator in where developers may test mobility protocols in RF and Networking realistic emulation environments. Dr. Hernandez joined Microsoft in 2002 contributing in several technologies and submitted several patents on Bluetooth and WiFi mobility. In 2003 moved to Florida and for seven years was a member of the technical staff at Motorola in Plantation FL, where he contributed to J2ME in CDMA and iDEN smart phones, as well as Android.</p>\n\n<p>Dr. Hernandez also works as s reviewer to multiple IEEE conferences, workshops and journals, has submitted over 12 patent applications and issued 8 different patents most in the areas of wireless and mobile communications.</p>\n\n<p>In 2007, he was invited to join the editorial board for the International Journal of Network Management, Edwin also volunteers with the organization committee for Mobile Mondays Miami, as well as committee for many others including entrepreneurship events in the area.</p>\n\n<p>Dr. Hernandez is co-founder of Rapid Mobile Technologies, Inc (dba/ RAMOBITECH), a company with exclusive licensing agreements with the University of Florida Research Foundation and University of three of his patents now being commercialized as MobileCAD and MobileIPP   Recently, Dr. Hernandez is a VP and owner of EGLA COMMUNICATIONS a mobile and IPTV media platforms company focusing on mobile and multimedia products with customers in the US and Latin America.</p>","image":null,"degrees":[{"degree_type":"PhD","subject":"Computer Engineering","institution":"University of Florida","graduated_year":2002,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Owner","firm":{"name":"EGLA COMMUNICATIONS","permalink":"egla-communications","type_of_entity":"company","image":null}},{"is_past":true,"title":"Principal Staff Software Engineer","firm":{"name":"Motorola","permalink":"motorola-2","type_of_entity":"company","image":null}},{"is_past":true,"title":"Technical Program Manager","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://edwinhernandez.com","title":"Personal Site/Blog"}],"web_presences":[{"external_url":"http://twitter.com/edwinhm","title":"Twitter"}]}