{"first_name":"Ekkehard","last_name":"Barchewitz","permalink":"ekkehard-barchewitz","crunchbase_url":"http://www.crunchbase.com/person/ekkehard-barchewitz","homepage_url":"http://www.solux.org","birthplace":"Hamburg","twitter_username":"","blog_url":"http://www.blog.en.solux.org","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1948,"born_month":null,"born_day":null,"tag_list":"solar-lantern, led, cell-phone-charging","alias_list":null,"created_at":"Tue Feb 09 09:52:32 UTC 2010","updated_at":"Tue Feb 09 18:25:21 UTC 2010","overview":"<p>Solux e.V. is a charity organisation based in Munich/Taufkirchen. We produce and sell eco-friendly solar lights for developing countries.</p>\n\n<p>In large parts of the world it is difficult to read, study or work after dark. Solux provides an easy to use alternative to kerosene-lamps. Our aim is to provide reliable, eco-friendly lighting for people in areas without a stable power supply, although you can also purchase and use Solux solar lights in industrial countries.</p>\n\n<p>Our photovoltaic lanterns are extremely robust and easy to handle. They are designed for long lasting, everyday use and the handy solar panel used to charge the lamp, can also be used to charge a large variety of mobile phones. The lamps are available as ready-to-use sets (solar panel, lamp, cable), or as kits for assembly in workshops in the countries of destination.</p>\n\n<p>Solux was founded in 2003 and is run primarily by volunteers. In this short time Solux has developed and improved its products through several generations and, working in close cooperation with Non Government Organisations (NGOs), has rolled out multiple projects in South America and Africa, shipping thousands of lamps in the process.</p>\n\n<p>In 2008 we won the Worldbank award &#8216;Development Marketplace Lighting Africa&#8217; and started a project in Ghana: &#8216;One Child One Solar Light&#8217;, where we target schools in rural areas. For more information please visit www.solux.org</p>","image":{"available_sizes":[[[122,150],"assets/images/resized/0007/6425/76425v2-max-150x150.jpg"],[[140,172],"assets/images/resized/0007/6425/76425v2-max-250x250.jpg"],[[140,172],"assets/images/resized/0007/6425/76425v2-max-450x450.jpg"]],"attribution":"<p>Ekkehard</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}