{"first_name":"Elad","last_name":"Yoran","permalink":"elad-yoran","crunchbase_url":"http://www.crunchbase.com/person/elad-yoran","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Oct 29 05:25:45 UTC 2008","updated_at":"Sat Nov 29 07:40:03 UTC 2008","overview":"<p>Elad Yoran is the CEO and founder of Security Growth Partners. At SGP, Mr. Yoran advises leading companies in the security market and helps guide emerging companies with innovative technology to rapid growth. Mr. Yoran also advises government and infrastructure organizations on security and business risk matters.</p>\n\n<p>Prior to founding SGP, Mr. Yoran served as Executive Director at MediaSentry, the leading provider of Anti-Piracy technology services to the motion picture, music, video game and software industries. MediaSentry was sold to Safenet, Inc. (NASDAQ: SFNT) for more than $20 million in June 2005.</p>\n\n<p>Prior to MediaSentry, Mr. Yoran co-founded, managed, and led Riptech, Inc., a leading managed security services provider. Ernst &amp; Young recognized Mr. Yoran for his success with the &#8220;Entrepreneur of the Year&#8221; award in 2001.</p>\n\n<p>Symantec Corporation (NASDAQ: &#8220;SYMC&#8221;) acquired Riptech for $145 million in 2002, ranking in the top 2% in transaction value of all technology merger and acquisition transactions of that year. From 2002 to 2003, Mr. Yoran served as Vice President, Global Business Development at Symantec.</p>\n\n<p>Prior to Riptech, Mr. Yoran served as Vice President at Broadview International, an investment bank that focuses on mergers and acquisitions in the technology industry. At Broadview, Mr. Yoran spearheaded the firm’s security industry initiative, offering strategic insights to senior executives of both publicly traded and privately held companies across numerous segments of the security industry.</p>\n\n<p>Mr. Yoran is a pioneer and a recognized expert in the security industry. He authored the Internet Security Threat Report, which was cited in briefings to the US Congress. He is also a regular speaker at key industry events and has been quoted in various media outlets, including Associated Press, Reuters, USA Today, the Wall Street Journal, and The Washington Post. Mr. Yoran has appeared on ABC News, BBC, CNN, and other prominent media networks.</p>\n\n<p>Mr. Yoran’s other boards and advisory boards include Jasubhai Digital Media (JDM), a leading new media company in Mumbai, India, KoolSpan, Inc., a pioneering developer of network security products in Bethesda, MD, HiWired, Inc., an emerging provider of managed technology services in Cambridge, MA, and the Jewish Chapel Fund, US Military Academy, West Point. Previously, Mr. Yoran served as a Senior Advisor to the Urban Utility Center (UUC) on security initiatives and a director at Monolith Security, an emerging database security provider.</p>\n\n<p>Mr. Yoran is a MBA graduate of the Wharton School of the University of Pennsylvania and holds a BS with honors from the United States Military Academy at West Point. He also spent several years as an officer and a paratrooper in the United States Army and is a veteran of Operation Restore Hope in Somalia.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO and Founder","firm":{"name":"Security Growth Partners","permalink":"security-growth-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,92],"assets/images/resized/0003/0131/30131v1-max-150x150.png"],[[160,99],"assets/images/resized/0003/0131/30131v1-max-250x250.png"],[[160,99],"assets/images/resized/0003/0131/30131v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Director","firm":{"name":"KoolSpan","permalink":"koolspan","type_of_entity":"company","image":{"available_sizes":[[[150,66],"assets/images/resized/0004/4149/44149v1-max-150x150.png"],[[203,90],"assets/images/resized/0004/4149/44149v1-max-250x250.png"],[[203,90],"assets/images/resized/0004/4149/44149v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}