{"first_name":"Eleanor","last_name":"Lockwood","permalink":"eleanor-lockwood","crunchbase_url":"http://www.crunchbase.com/person/eleanor-lockwood","homepage_url":"","birthplace":"","twitter_username":"LockwoodEleanor","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Aug 24 08:59:47 UTC 2012","updated_at":"Thu Aug 30 10:38:27 UTC 2012","overview":"<p>Eleanor Lockwood has developed a versatile and well-rounded resume with her long career in finance. Beginning over 40 years ago, Eleanor graduated with a Bachelor’s Degree in finance from Auburn University. Her first job came in 1970 from the Colonial Mortgage Company with an outstanding promise. She stayed with the company for 26 years, having performed countless tasks with abundant responsibilities in a number of positions. Her role at Colonial Mortgage encompassed more than one; as she was promoted several times until she was appoint VP Branch Manager.</p>\n\n<p>Eleanor Lockwood now has, perhaps, the most versatile breadth of experience in finance and accounting than any professional in her field. She developed her incredible focal knowledge and extensive list of professional skills over such a long career. Eventually, she left Colonial Mortgage to utilize and develop more of her expertise in finance and accounting. She started her own business in Las Vegas, and thereafter succeeded with an array of undertakings. </p>\n\n<p>Self-employing herself as an independent loan manager, auditor and trainer truly afforded Eleanor Lockwood her financial expertise. Eleanor Lockwood never sacrificed philanthropic work throughout her long and arduous career. She has always played a notable role in several local churches. She taught Sunday school in Montgomery and ran a church thrift shop in Las Vegas. Additionally, Eleanor has taught finance and accounting professionally at some remarkable educational institutions. </p>\n\n<p>Eleanor Lockwood instructed finance and accounting courses at the Air War College. From 1980 to 1992, she guided and shaped many careers for military officers after their national service. If anything, teaching prepared her immensely for her entrepreneurial endeavor as an independent loan manager. Needless to say, Eleanor Lockwood has dexterity in the industry of finance accounting that goes unparalleled. Not many professionals have kept such a remarkable, diverse tenure in those industries. </p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/7917/207917v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/7917/207917v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/7917/207917v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}