{"first_name":"Eli","last_name":"Pariser","permalink":"eli-pariser","crunchbase_url":"http://www.crunchbase.com/person/eli-pariser","homepage_url":"http://www.elipariser.com","birthplace":"","twitter_username":"elipariser","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Tue Jun 14 17:20:48 UTC 2011","updated_at":"Tue Jun 14 17:20:48 UTC 2011","overview":"<p>Shortly after the September 11th terror attacks, Eli created a website calling for a multilateral approach to fighting terrorism. In the following weeks, over half a million people from 192 countries signed on, and Eli rather unexpectedly became an online organizer.\nThe website merged with MoveOn.org in November of 2001, and Eli -– then 20 years old &#8211; joined the group to direct its foreign policy campaigns. He led what the New York Times Magazine called the &#8220;mainstream arm of the peace movement&#8221; &#8211; tripling MoveOn&#8217;s member base in the process, demonstrating for the first time that large numbers of small donations could be mobilized through online engagement, and developing many of the practices that are now standard in the field of online organizing.</p>\n\n<p>In 2004, Eli co-created the Bush in 30 Seconds online ad contest, the first of its kind, and became Executive Director of MoveOn. Under his leadership, MoveOn.org Political Action has grown to 5 million members and raised over $120 million from millions of small donors to support advocacy campaigns and political candidates &#8211; helping Democrats reclaim the House and Senate in 2006. Eli focused MoveOn on online-to-offline organizing, developing phone-banking tools and precinct programs in 2004 and 2006 that laid the groundwork for Barack Obama’s remarkable campaign. MoveOn was one of the first major progressive organizations to endorse Obama for President in the presidential primary.</p>\n\n<p>In 2008, Eli transitioned the Executive Director role at MoveOn to Justin Ruben and became President of MoveOn’s board.</p>\n\n<p>Eli has appeared as a commentator on &#8220;Good Morning America,&#8221; &#8220;World News Tonight,&#8221; the Colbert Report, and all of the major cable news channels except Fox News. His Op-Eds have appeared in the Washington Post, LA Times, and other periodicals. And he’s appeared three times on Details’ annual Power List –- though that and $1.00 can buy you a cup of coffee. He co-founded Avaaz.org, a global MoveOn-style organization with 3 million members, and helped launch the New Organizing Institute, which has trained thousands of organizers to bring people together online and off for political change.</p>\n\n<p>Eli grew up in Lincolnville, Maine, and graduated summa cum laude in 2000 with a B.A. in Law, Politics, and Society from Simon&#8217;s Rock College. He was lucky enough to give the Commencement Address there in 2005, and to receive an honorary high school diploma &#8211; one of very few given to non-high-school-graduates &#8211; from Camden-Rockport High School. He lives in Brooklyn, NY.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0013/9168/139168v1-max-150x150.jpg"],[[250,187],"assets/images/resized/0013/9168/139168v1-max-250x250.jpg"],[[254,191],"assets/images/resized/0013/9168/139168v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}