{"first_name":"Celik","last_name":"Nimani","permalink":"elik-nimani","crunchbase_url":"http://www.crunchbase.com/person/elik-nimani","homepage_url":"http://www.digjitale.com","birthplace":"Prishtina","twitter_username":"celiknimani","blog_url":"http://www.celiknimani.wordpress.com","blog_feed_url":"http://celiknimani.wordpress.com/feed/1","affiliation_name":"www.itbmgroup.com","born_year":1987,"born_month":11,"born_day":2,"tag_list":"celik-nimani, celik, nimani, startup-kosovo, startup-weekend, innovation-centre-kosovo","alias_list":null,"created_at":"Thu Jul 21 22:08:24 UTC 2011","updated_at":"Fri Jun 22 20:37:39 UTC 2012","overview":"<p>Generalist, innovative thinker, skilled writer &amp; startup enthusiast.</p>\n\n<p>Working as Training and Events Manager at the Innovation Centre Kosovo, the first of its kind in Kosovo aiming to create new jobs through business support of entrepreneurs, startups and growing companies. A former tech journalist turned entrepreneur, with 5 years of solid experience in media production and one of the first IT journalists in Kosovo &amp; Albanian, working as editor in chief for CIO Albanian Magazine and PC World Albanian. Çelik is focused on building a startup-ecosystem in Kosovo, where he is local Startup Weekend Organizer, ambassador for Pirate Summit for Kosovo, Albania and Macedonia and above all he has in-depth relationships with leaders, media, public relations, agencies of the IT industry and freelancers all around.</p>\n\n<p>Çelik has written over thousands of IT related and technical articles published in IT magazines and online media. He has a good and in-depth relationship with leaders, media, public relations, agencies of IT industry and freelancers all around the market. </p>\n\n<p>Even though a skilled journalist, Çelik is now doing a Masters degree in Engineering at the Universty of Pristina and a Masters Degree at the Universum University, in Kosovo.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.pcworld.al","title":""}],"web_presences":[{"external_url":"http://www.twitter.com/celiknimani","title":""},{"external_url":"http://al.linkedin.com/in/celiknimani","title":""}]}