{"first_name":"Elin","last_name":"Mulron","permalink":"elin-mulron-2","crunchbase_url":"http://www.crunchbase.com/person/elin-mulron-2","homepage_url":"http://www.linkedin.com/in/elineifler","birthplace":"New York, NY","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"digital-media, social-media, consultant, strategy, strategy-consultant, business-consultant, management-consultant, mba","alias_list":null,"created_at":"Thu May 14 23:43:38 UTC 2009","updated_at":"Mon May 18 18:19:37 UTC 2009","overview":"<p>Elin Eifler Mulron is Managing Partner of Digital Edge. Through Digital Edge, Elin provides independent management consulting services to businesses and business leaders, supplying them with targeted problem solving across a spectrum of critical business challenges. She specializes in digital and social media strategy, products and marketing, essentially continuing the work she&#8217;s been doing since 2000 for previous employers and McKinsey clients, except now as an independent entity. </p>\n\n<p>Elin has also played a lead role in founding Digital Nashville, a networking organization for digital media professionals in Nashville. Digital Nashville combines online social networking with offline meetings and events, connecting hundreds of members on digitalnashville.net, as well as additional members on Facebook and LinkedIn. Elin manages Digital Nashville&#8217;s advisory board and, with her Executive Director, its growing leadership team. Through events, job boards, educational series, directories, library, discussion forums, focus groups and other initiatives, Digital Nashville is rapidly empowering and strengthening Nashville&#8217;s growing digital media community.</p>\n\n<p>Before moving to Nashville in 2007, Elin was Director, Digital Media Strategy for Turner Broadcasting System in Atlanta, GA. She provided senior management and internal clients throughout Turner with strategic analyses, assessments of consumer and technology trends, opportunity identification and evaluation, and the development of strategic recommendations, with a focus on digital media opportunities. Elin supported all of Turner&#8217;s entertainment and news businesses, including Cartoon Network, Adult Swim, TNT, TBS, CNN, Turner Sports and GameTap, working with them to understand, assess and help prepare for their future in the digital media marketplace.</p>\n\n<p>Elin&#8217;s areas of focus included community, user-generated content, social networks and virtual worlds, broadband video distribution, consumer Internet strategy, organizing for digital development, digital operations and strategy, ad networks, metadata, video aggregation, destination vs. syndication strategies, short-form content, and online business models.</p>\n\n<p>Prior to Turner, Elin was Product Manager for the Worldwide Digital Media Group at Amazon.com in Seattle. She focused on product design – developing the strategic vision, customer value proposition, content sources, website features and product roadmap – for a next-generation digital content product. Her work also included the day-to-day product management of Amazon&#8217;s eDocs &amp; eBooks Store.</p>\n\n<p>Before earning her MBA from the Stanford Graduate School of Business, Elin was a Senior Manager at Asurion (a cell phone services provider) in Nashville and a management consultant for McKinsey &amp; Company in San Francisco. Elin holds a BA in Economics from Yale University.</p>\n\n<p>Elin is a member of CMA, ACM, NSAI, NASE, WICT, 85 Broads, Society of Industry Leaders, Guidepoint Global Advisors and the Nashville Chamber of Commerce.</p>\n\n<p>A more detailed CV for Elin Mulron, as well as professional recommendations, can be found on LinkedIn.</p>","image":{"available_sizes":[[[73,100],"assets/images/resized/0004/4154/44154v2-max-150x150.jpg"],[[73,100],"assets/images/resized/0004/4154/44154v2-max-250x250.jpg"],[[73,100],"assets/images/resized/0004/4154/44154v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"Economics","institution":"Yale University","graduated_year":2000,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"General Management","institution":"Stanford Graduate School of Business","graduated_year":2005,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://digitaledgellc.googlepages.com/bios","title":"Bio"},{"external_url":"http://www.linkedin.com/in/elineifler","title":"LinkedIn"},{"external_url":"http://www.digitalnashville.net/profile/Elin","title":"Digital Nashville"},{"external_url":"http://www.facebook.com/profile.php?id=633747712#/profile.php?id=216009","title":"Facebook"}]}