{"first_name":"Elizabeth","last_name":"Stoner","permalink":"elizabeth-stoner","crunchbase_url":"http://www.crunchbase.com/person/elizabeth-stoner","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Mar 16 03:45:54 UTC 2010","updated_at":"Wed Nov 28 03:51:07 UTC 2012","overview":"<p>Dr. Elizabeth Stoner is Chief Development Officer and a Founder of Rhythm, and a Managing Director of MPM Capital. Previously, she had a 22-year career at Merck Research Laboratories that culminated in the position of Senior Vice President of Global Clinical Development Operations, with responsibility for the company&#8217;s clinical development activities in more than 40 countries. Dr. Stoner also oversaw the clinical development activities of Merck&#8217;s Japanese partner, Banyu; led clinical development for the Merck/Schering-Plough Joint Venture for Zetia/Vytorin; and played a critical leadership role in Merck&#8217;s efforts to transform its worldwide clinical development operations. Earlier in her career at Merck, Dr. Stoner led the Proscar clinical development program from inception, establishing Merck as a leader in the field of prostate disease. As Endocrine Therapeutic Head, Dr. Stoner&#8217;s responsibilities included steroid and lipid metabolism as well as clinical research programs focused on the growth hormone, secretagogue. Prior to her tenure at Merck, Dr. Stoner was an Assistant Professor of Pediatrics at Cornell University Medical College. She received a BS in Chemistry from Ottawa University (KS), an MS in Chemistry from the State University of New York at Stony Brook, and an MD from Albert Einstein College of Medicine.</p>","image":null,"degrees":[{"degree_type":"MD","subject":"","institution":"Albert Einstein College of Medicine","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chief Development Officer & Founder","firm":{"name":"Rhythm Pharmaceuticals","permalink":"rhythm-pharmaceuticals","type_of_entity":"company","image":{"available_sizes":[[[150,70],"assets/images/resized/0008/0469/80469v10-max-150x150.jpg"],[[168,79],"assets/images/resized/0008/0469/80469v10-max-250x250.jpg"],[[168,79],"assets/images/resized/0008/0469/80469v10-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}