{"first_name":"Ellen","last_name":"Salisbury","permalink":"ellen-salisbury","crunchbase_url":"http://www.crunchbase.com/person/ellen-salisbury","homepage_url":"","birthplace":"Minneapolis, MN","twitter_username":"esalisbury","blog_url":"","blog_feed_url":"","affiliation_name":"TimeBridge","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 15 03:52:51 UTC 2007","updated_at":"Thu Dec 03 19:32:19 UTC 2009","overview":"<p>Ellen Salisbury is the Founder and Managing Director of Cambridge West Ventures (www.cambridgewestventures.com). She was previously the Vice President of Engineering and Operations at TimeBridge, where she integrated and managed the engineering, operations and support organizations in San Francisco and Israel. In this role, she drove the improved performance, functionality and support of the TimeBridge meeting scheduling product. She is currently a member of the Advisory Boards of TimeBridge and an interesting stealth-mode startup.</p>\n\n<p>Prior to joining TimeBridge, Ellen spent several years at Yahoo!, where she most recently served as director of Yahoo! Research Berkeley, a unique research and development facility, a joint venture of Yahoo! and the University of California - Berkeley. At Y!RB, she assembled a great team of researchers, developers and interns who gave the world forward-looking prototypes, such as ZoneTag, Zurfer, TagMaps, Remixer, Fire Eagle and Zync.</p>\n\n<p>Ellen joined Yahoo! with the company&#8217;s acquisition of Stata Labs, where she was senior vice president of products and services and most notably introduced new development processes (Agile, Scrum) to improve the organization&#8217;s overall product quality and timely delivery. Ellen also served as the vice president of engineering at Softrax, Silicon Energy and Brightmail, and as vice president of data warehousing at Sybase, Inc. where she directed a team responsible for delivering leading edge, high quality products on time and driving partnerships with major technology vendors. Ellen graduated from the University of Minnesota with a BA in Humanities and attended the MBA program at Loyola University of Chicago.</p>","image":null,"degrees":[{"degree_type":"MBA","subject":"","institution":"Loyola University of Chicago","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"BA","subject":"Humanities","institution":"University of Minnesota","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}