{"first_name":"Ellen","last_name":"Fishbein","permalink":"ellen-fishbein","crunchbase_url":"http://www.crunchbase.com/person/ellen-fishbein","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Equidity","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Feb 09 23:17:14 UTC 2011","updated_at":"Wed Apr 27 04:42:08 UTC 2011","overview":"<p>After a successful career in private corporate practice followed by an invigorating tenure of lobbying on Capitol Hill and in Europe, helping define tax policy for internet access services, Ellen was inspired by Equidity’s mission to help worthy companies successfully navigate the broken capital markets so they can again contribute to economic growth.  Ellen has known Mona for over 30 years and closely followed her capital markets’ and investor relations successes, and she quickly jumped on board Equidity’s team to help bring its timely products and services to market, adding her expertise and commitment.</p>\n\n<p>Prior to joining Equidity, Ellen was in the private practice of law for 10 years in Northern Virginia and Washington, D.C, focusing on business and tax law.  After private practice, Ellen went in-house with America Online (which later became AOL Time Warner) as Vice President of Tax Policy and Associate General Counsel where she lobbied on Capitol Hill for tax bills preventing taxation on internet access services, lobbied in Europe to prevent US companies from having to collect VAT on internet access services, represented AOL in meetings with the Organization of Economic Cooperation and Development in Paris to discuss VAT collection on internet access, negotiated with US state and county economic development partnerships to obtain tax incentives for AOL and handled a myriad of tax issues for the company.  Ellen graduated from Brandeis University (B.A. 1983), Duke University School of Law (J.D. 1986), and Georgetown University Law Center (LL.M. Taxation 1990). In the past 10 years, she has served on the Wolf Trap Foundation Board, the Wolf Trap Associates Board (as a member and Chairman) and is currently serving on The Art League Board at the Torpedo Factory in Alexandria, Virginia as Treasurer and Chairman of the Finance Committee.</p>","image":null,"degrees":[{"degree_type":"B.A.","subject":"","institution":"Brandeis","graduated_year":1983,"graduated_month":null,"graduated_day":null},{"degree_type":"J.D.","subject":"","institution":"Duke University School of Law","graduated_year":1986,"graduated_month":null,"graduated_day":null},{"degree_type":"LL.M. Taxation","subject":"","institution":"Georgetown University Law Center","graduated_year":1990,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CFO, General Counsel, Co-Founder","firm":{"name":"Equidity","permalink":"equidity","type_of_entity":"company","image":{"available_sizes":[[[150,28],"assets/images/resized/0012/0687/120687v4-max-150x150.png"],[[239,46],"assets/images/resized/0012/0687/120687v4-max-250x250.png"],[[239,46],"assets/images/resized/0012/0687/120687v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}