{"first_name":"Emil","last_name":"Sayegh","permalink":"emil-sayegh-2","crunchbase_url":"http://www.crunchbase.com/person/emil-sayegh-2","homepage_url":"http://www.codero.com","birthplace":"","twitter_username":"esayegh","blog_url":"http://www.codero.com/blog","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"cloud, hosting, codero, rackspace, hewlett-packard, computing, infrastructure, saas, paas, iaas","alias_list":null,"created_at":"Sat Jun 09 10:14:46 UTC 2012","updated_at":"Sat Jun 09 21:52:05 UTC 2012","overview":"<p>Emil Sayegh is the President and Chief Executive Officer (CEO) of Codero Hosting. Emil joined Codero in January 2012, after launching and pioneering successful Cloud Computing and hosting businesses for Hewlett-Packard, and Rackspace.</p>\n\n<p>At HP, Emil was the Vice President of Cloud Service where he led HP&#8217;s entry into public cloud services. Prior to HP, Emil was the Vice President, and General Manager of the Cloud Computing Division at San Antonio-based Rackspace, the leading global provider of hosted IT services. During his tenure at the helm of the Rackspace Cloud, Emil led the company&#8217;s entry into the public cloud market, and positioned it to effectively compete with the likes of Amazon AWS. At Rackspace, Emil also served as the Vice President of the Product Group, where he oversaw the global product roadmap, and lead the successful launch of the Private Cloud service and the Hosted Exchange service.</p>\n\n<p>Prior to joining Rackspace, Emil spent more than 15 years in the IT industry in various successful roles. Emil was Services Marketing Director at Dell where he oversaw the global services roadmap development and marketing organization. Additionally, he served in leadership positions at several notable companies including RLX Technologies (acquired by HP), Compaq Computers (acquired by HP) and W.L. Gore and Associates. Emil holds nine patents. He earned a Bachelor Degree from the School of Engineering at the University of Texas at Austin, and a Master Degree in Technology Commercialization from the School of Business at the University of Texas at Austin. Emil lives in Austin, Texas with his wife and four children. He is an avid Texas Longhorns fan, and an active outdoorsman who loves to ski, hunt, fish, boat, and travel.</p>","image":{"available_sizes":[[[130,150],"assets/images/resized/0019/4628/194628v2-max-150x150.jpg"],[[133,153],"assets/images/resized/0019/4628/194628v2-max-250x250.jpg"],[[133,153],"assets/images/resized/0019/4628/194628v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://twitter.com/#!/esayegh","title":""},{"external_url":"http://www.linkedin.com/in/emilsayegh","title":""}]}