{"first_name":"Emily","last_name":"Gimmel","permalink":"emily-gimmel","crunchbase_url":"http://www.crunchbase.com/person/emily-gimmel","homepage_url":"http://www.emilygimmel.com","birthplace":"Louisville, KY","twitter_username":"emilygimmel","blog_url":"http://www.emilygimmel.com","blog_feed_url":"http://emilygimmel.com/?feed=rss2","affiliation_name":"WKYT-TV","born_year":1984,"born_month":5,"born_day":17,"tag_list":"emily-gimmel, media, american-television-journalist, university-of-kentucky, las-vegas-reporter","alias_list":null,"created_at":"Wed Jan 06 04:00:12 UTC 2010","updated_at":"Wed Jan 06 04:07:30 UTC 2010","overview":"<p>Emily Gimmel (born May 17, 1984) is an American media producer, journalist and TV personality. Throughout her career, her reports usually focus on positivity and progression in culture.</p>\n\n<p>Gimmel grew up in Louisville, KY. There she first learned about television broadcasting at her high school, the nationally recognized Sacred Heart Academy. Gimmel started working in TV at age 15, as an intern at WDRB TV. At 17, she began contributing reports on teen issues to WAVE TV. Simultaneously, she began hosting a daily radio show for 98.9 KISS FM. During her senior year of high school she became the state&#8217;s first CNN Student News Bureau certified reporter.</p>\n\n<p>Upon graduation, Emily attended the University of Kentucky, majoring in broadcast journalism. Two weeks before she started her first Freshman class, she was hired as the daily morning features reporter for WKYT-TV, the CBS affiliate in Lexington, Kentucky. At age 18, the unusual hiring thrust her into the national spotlight and sparked debate among industry insiders and professionals.</p>\n\n<p>In addition this job, Emily also hosted a weekly music show called Louisville Live. She also traveled regularly as a weekend pit reporter for The Speed Channel, and hosted a weekly radio show on HOT 102.5 in Lexington.</p>\n\n<p>After college and working at WKYT, Emily moved to Indianapolis to work as an entertainment reporter for ABC affiliate, WRTV Channel 6. Her work consisted of Hollywood interviews, covering the Indy 500, Indianapolis Colts, and lifestyle stories in the Hoosier State. She also contributed to The Big Ten Network and The Indianapolis Star.</p>\n\n<p>In 2008, Emily went to Las Vegas to cover the World Series of Poker and produce viral video features for the global gaming network, PokerNews. After the series, Greenspun Media Group announced Emily as a host and producer for its new multimedia broadband TV show, 702.tv. The entertainment/lifestyle program produces broadband video content for TV and internet distribution. Content corresponds with articles in the Pulitzer Prize Award Winning Las Vegas Sun, Las Vegas Weekly and VEGAS Magazine.</p>\n\n<p>Emily is now producing a number of interactive channels at WENDOH Media.</p>","image":null,"degrees":[{"degree_type":"Bachelor","subject":"Broadcast Journalism","institution":"University of Kentucky","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Reporter","firm":{"name":"WKYT-TV","permalink":"wkyt-tv","type_of_entity":"company","image":null}},{"is_past":true,"title":"Host & Producer","firm":{"name":"Greenspun Media Group","permalink":"greenspun-media-group","type_of_entity":"company","image":{"available_sizes":[[[150,75],"assets/images/resized/0012/1062/121062v1-max-150x150.jpg"],[[250,126],"assets/images/resized/0012/1062/121062v1-max-250x250.jpg"],[[343,173],"assets/images/resized/0012/1062/121062v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Entertainment Reporter","firm":{"name":"WRTV","permalink":"wrtv","type_of_entity":"company","image":null}},{"is_past":true,"title":"Host & Producer","firm":{"name":"WENDOH Media","permalink":"wendoh-media","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/emilygimmel","title":""},{"external_url":"http://www.facebook.com/emilygimmel","title":""},{"external_url":"http://www.youtube.com/emilygimmel","title":""}]}