{"first_name":"Emmanuel","last_name":"Garcin","permalink":"emmanuel-garcin","crunchbase_url":"http://www.crunchbase.com/person/emmanuel-garcin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Jahia","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Feb 17 13:27:25 UTC 2009","updated_at":"Sun Jul 26 02:40:02 UTC 2009","overview":"<p>Emmanuel has 11 years of international general management experience within the software and Content Management industry, working in the US, Europe and Asia. Before joining Jahia, Emmanuel was the Vice President, Digital Publishing and CRM Solutions for Boston–based Houghton Mifflin, a leading US publisher. During his tenure, Emmanuel defined and implemented the Digital Publishing and CRM projects for Houghton Mifflin and its divisions, managing and co-ordinating a staff of up to 100 people. With his team, Emmanuel allowed Houghton Mifflin to dramatically improve its publishing efficiency and extend its offering to Digital goods, leveraging cutting edge Content Management and eCommerce technologies. Prior to Houghton Mifflin, Emmanuel hired and led the presales team for Reef North America, a Web Content Management company. Before moving to the US, he also worked as a Financial Controller for L’Oreal in Shanghai and as a consultant for IBM Global Services in Paris. Emmanuel is French and American and holds a MSc in Engineering from the Institut National Polytechnique de Grenoble (France), a MSc in Economics &amp; Finance from Science Po Grenoble (France) and a MBA from Insead -delivered in the US (at the Wharton Business School), Europe and Asia.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP & GM North America","firm":{"name":"Jahia","permalink":"jahia","type_of_entity":"company","image":{"available_sizes":[[[100,100],"assets/images/resized/0003/6360/36360v2-max-150x150.png"],[[100,100],"assets/images/resized/0003/6360/36360v2-max-250x250.png"],[[100,100],"assets/images/resized/0003/6360/36360v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}