{"first_name":"Emmanuel","last_name":"Keller","permalink":"emmanuel-keller","crunchbase_url":"http://www.crunchbase.com/person/emmanuel-keller","homepage_url":"http://www.linkedin.com/profile/view?id=13060323&authType=name&authToken=i_g1&trk=tyah","birthplace":"Strasbourg","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1969,"born_month":9,"born_day":3,"tag_list":"","alias_list":null,"created_at":"Fri Jul 01 14:42:49 UTC 2011","updated_at":"Fri Jul 01 17:42:34 UTC 2011","overview":"<p>In his last job, Emmanuel was the GISI Interactive CIO. GISI is the IT division of Infopro Group a French B2B media group with online and offline activities. \nEmmanuel initiated and led a project at GISI to provide a better quality of online activities. In 2008, he and his team succeeded in developing advanced software which allows Infopro Group to run many strategic applications that represent several tens of millions of dollars in yearly revenues for them. Emmanuel left this position in December 2009, made a deal to acquire the software, and started a new company to launch OpenSearchServer. \nIn his 15 years career, Emmanuel has held every position in programming teams, including managing a team of 25 engineers.\nSince a very young age, Emmanuel has been fond of programming and for him creating software always brings advantages and adds more value for users.</p>\n\n<p>His past jobs with technology leaders such as Lagardère, Club Internet and EBP taught him to manage a team under pressure and meet delivery goals while maintaining high quality standards. </p>\n\n<p>In the OpenSearchServer project, Emmanuel is in charge of all technical and programming activities (Product development, R&amp;D, Support, SaaS and hosting, Professional services).\nEmmanuel has a degree in Computer Engineering.</p>","image":{"available_sizes":[[[124,150],"assets/images/resized/0014/2113/142113v2-max-150x150.jpg"],[[207,250],"assets/images/resized/0014/2113/142113v2-max-250x250.jpg"],[[373,450],"assets/images/resized/0014/2113/142113v2-max-450x450.jpg"]],"attribution":"<p>CTO, Founder</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}