{"first_name":"Emmet","last_name":"Seibels","permalink":"emmet-seibels","crunchbase_url":"http://www.crunchbase.com/person/emmet-seibels","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Feb 20 20:49:48 UTC 2011","updated_at":"Sun Feb 20 20:50:51 UTC 2011","overview":"<p>Prior to forming FrontStream Payments, Emmet was a Senior Vice President for Verus Financial Management. In this capacity, he led the company’s acquisition efforts. Emmet was the fourth employee and part of the founding team at Verus Financial Management. He sourced two of Verus’ four largest acquisitions and was the leader for the majority of Verus’ acquisition activities including sourcing, valuation, financial and legal due diligence. In 2004, Emmet created a strategy of purchasing agent residuals while securing contractual commitments for new business from agents. Using just over $10MM in capital, this residual purchase recruitment strategy contributed 20% of Verus’ EBITDA in 2005. Additionally, more than 18% of Verus’ monthly new merchant referrals in 2005 were from agents whose residuals had been purchased by Mr. Seibels (including four of Verus’ top ten agents). Prior to Verus’ $325MM sale to Sage in 2006, Mr. Seibels had acquisition or portfolio purchase discussions with over 100 credit card ISOs and agents and executed over 20 portfolio purchases (i.e., residual purchases) from agents.\nPrior to Verus, Emmet worked in investment banking at Robinson-Humphrey Company, started his own software company and led product management and business development for another venture-capital backed software company. Emmet graduated from the Honors College at the University of Mississippi with a perfect 4.0 grade point average and received his Masters in Business Administration (MBA) at Harvard University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chairman of the Board and Founder  ","firm":{"name":"FrontStream Payments","permalink":"frontstream-payments","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0012/3105/123105v1-max-150x150.png"],[[250,81],"assets/images/resized/0012/3105/123105v1-max-250x250.png"],[[255,83],"assets/images/resized/0012/3105/123105v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}