{"first_name":"Emory","last_name":"Thomas Jr","permalink":"emory-thomas-jr","crunchbase_url":"http://www.crunchbase.com/person/emory-thomas-jr","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Oct 30 02:33:49 UTC 2008","updated_at":"Thu Oct 30 02:35:28 UTC 2008","overview":"<p>EMORY THOMAS JR. is publisher of the Puget Sound Business Journal and TechFlash. Thomas served as editor of the Business Journal for two years before becoming publisher in April 2006.</p>\n\n<p>During his varied career, Thomas has served as a business journalist in both the print and online arenas, and as a publishing entrepreneur. He first moved to Seattle in 1996, when he was recruited from The Wall Street Journal to join MSNBC at its launch. As MSNBC.com rose to become the web’s top rated news site, Thomas produced frequent online reports and did regular on-air segments with CNBC. He left MSNBC in 1999, co-founding two small publishing companies and serving as vice president of Business.com, later acquired by publishing giant RH Donnelly for $360 million. Immediately prior to joining the Business Journal, Thomas was an editor at MSN Money, Microsoft’s leading financial web site. Early in his career, Thomas joined the Atlanta Business Chronicle, where he twice won the prestigious national Gerald Loeb Award for Distinguished Business and Financial Journalism.</p>\n\n<p>Today, he lives in the Capitol Hill neighborhood of Seattle with his wife, Laura, and their two children. He has been active for years in youth sports coaching and serves on numerous community boards, including the Greater Seattle Chamber of Commerce, the Bellevue Chamber of Commerce, ArtsFund and Junior Achievement.</p>","image":{"available_sizes":[[[106,150],"assets/images/resized/0002/7586/27586v1-max-150x150.jpg"],[[106,150],"assets/images/resized/0002/7586/27586v1-max-250x250.jpg"],[[106,150],"assets/images/resized/0002/7586/27586v1-max-450x450.jpg"]],"attribution":"<p>http://www.techflash.com/about</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Publisher, Puget Sound Business Journal & TechFlash","firm":{"name":"bizjournals","permalink":"bizjournals","type_of_entity":"company","image":{"available_sizes":[[[150,30],"assets/images/resized/0002/7584/27584v1-max-150x150.png"],[[250,50],"assets/images/resized/0002/7584/27584v1-max-250x250.png"],[[300,60],"assets/images/resized/0002/7584/27584v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}