{"first_name":"Enrique","last_name":"Posner","permalink":"enrique-posner","crunchbase_url":"http://www.crunchbase.com/person/enrique-posner","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"The IOU Project","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Feb 14 08:13:04 UTC 2012","updated_at":"Sat Feb 18 22:03:42 UTC 2012","overview":"<p>Enrique Posner is an entrepreneur with experience in media, telecom and technology. </p>\n\n<p>In the 90&#8217;s Enrique played a role in the financing, distribution, marketing and PR for filmmaker Pedro Almodovar and also worked with other high profile filmmakers including Roman Polanski, Milos Forman and Guillermo del Toro.</p>\n\n<p>In 1996 Enrique become MD for CCI -Convergence an Internet/media/telecom company offering IP-based telephony, data and Cable TV services. In 1999 he founded Thinkchain, LLC a software company that built digital supply chain software.</p>\n\n<p>In 2001 he become managing director of Warner Bros. Int´l Pictures Spain. There he was responsible for theatrical distribution and marketing of over 130 WB films including the Harry Potter series.</p>\n\n<p>In 2007 he become a more active investor. He founded The IOU Project, a manufacturer of traceable apparel, 6 Sales, an international sales agent of film and TV (sold in 2009). He was involved in the founding of Cyvek, a US-based bio-tech company that developed a novel, automated protein-based diagnosis tool. He is a founding shareholder of Kaleidos, a company that builds software using open source tools. </p>\n\n<p>In 2012 he became a director of Anglo Scientific, a London based venture firm that identifies disruptive scientific research projects in the bio technology, energy and communications fields and brings them to market.</p>\n\n<p>Enrique is an Advisory Board member of The Lifeboat Foundation, a nonprofit nongovernmental organization dedicated to encouraging scientific advancements while helping humanity survive existential risks and possible misuse of increasingly powerful technologies, including genetic engineering, nanotechnology, and robotics/AI.</p>\n\n<p>He remains involved in media in partnership with Hollywood star Antonio Banderas and his Kandor Graphics, a company that makes 3D computer-animated films, including the short he produced in 2010 short film “The Lady and the Reaper” which received an Academy Award nomination.</p>","image":{"available_sizes":[[[145,150],"assets/images/resized/0017/4180/174180v2-max-150x150.jpg"],[[233,240],"assets/images/resized/0017/4180/174180v2-max-250x250.jpg"],[[233,240],"assets/images/resized/0017/4180/174180v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor of Science","subject":"Communication Studies","institution":"Northwestern University","graduated_year":1987,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"","firm":{"name":"The IOU Project","permalink":"the-iou-project","type_of_entity":"company","image":null}},{"is_past":false,"title":"Director","firm":{"name":"AngloScientific","permalink":"angloscientific","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/profile/view?id=198604&trk=tab_pro","title":"LinkedIn"}]}