{"first_name":"Epic","last_name":"Research","permalink":"epic-research","crunchbase_url":"http://www.crunchbase.com/person/epic-research","homepage_url":"http://www.epicresearch.co/","birthplace":"Indore","twitter_username":"epicresearchind","blog_url":"http://www.epicresearch.co/blog/","blog_feed_url":"http://www.epicresearch.co/blog/index.php/feed/","affiliation_name":"Unaffiliated","born_year":1984,"born_month":7,"born_day":5,"tag_list":"stock-tips--currency-tips--forex-tips--free-stock-tips--commodity-tips--ncdex-tips--mcx-tips--free-share-tips--bse-nse-nifty-tips--future-options-tips--cash-tips--nifty-trading-tips--epic-research","alias_list":null,"created_at":"Thu Nov 22 05:35:49 UTC 2012","updated_at":"Sun Nov 25 01:03:06 UTC 2012","overview":"<p>Epic Research is a leading financial services provider with presence in Indian and other global capital markets. With its full fledged research operations, Epic Research has proven itself as Investment Advisory Company that produces and delivers high accuracy tips and recommendations for –</p>\n\n<p>Equity Tips\nDerivatives Tips - Futures and Options\nCommodity Tips - MCX, NCDEX and COMEX\nForex Tips - Domestic and International</p>\n\n<p>Product First!</p>\n\n<p>Epic Research believes that its existence depends upon its product. Keeping that in mind, Epic dedicates more than 70% of its revenues toward its research, product and services. Epic stresses on maintaining a high standard in its research practice, its research team and its research systems and makes investments in constant system up-gradations, training and development and top of the line software subscriptions.</p>\n\n<p>Epic focuses on providing only the BEST to our precious clients and that reflects in our tracksheets.</p>\n\n<p>Customer Satisfaction</p>\n\n<p>A great product gains acceptance and recognition if it is delivered correctly and at the end, the customer is satisfied. The sales force at Epic treats its customers with high regard. We realize what our clients are looking for and we strive to meet their financial goals in a smooth manner. Right after the first contact is made with a client, our sales professionals maintain touch with the client and support them in making the right choice with regards to the product and the payment plan that fits exactly with the client&#8217;s risk-bearing capacity and  short/long term financial targets. We go a step further for our premium and HNI clients and dedicate a sales professional to assist them at every step during payments, trading and post-trading.</p>\n\n<p>We at Epic believe in product samples and hence invite our first time web visitors and callers to try our services absolutely free for 2 days before subscribing to our services. We are proud of a high conversion and retention rate of our clients.</p>\n\n<p>Epic Vision</p>\n\n<p>&#8220;To consistently develop and deliver high quality and high precision financial products and services to our customers and create Wealth for our clients, employees and shareholders&#8221;</p>","image":{"available_sizes":[[[150,73],"assets/images/resized/0022/1598/221598v2-max-150x150.png"],[[200,98],"assets/images/resized/0022/1598/221598v2-max-250x250.png"],[[200,98],"assets/images/resized/0022/1598/221598v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}