{"first_name":"Eric","last_name":"Berg","permalink":"eric-berg","crunchbase_url":"http://www.crunchbase.com/person/eric-berg","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Okta","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jun 14 17:56:09 UTC 2010","updated_at":"Sat Dec 25 02:46:09 UTC 2010","overview":"<p>Eric is a seasoned product strategist and business leader with over 18 years of experience across engineering, marketing and business development roles. He has successfully driven product, business, and go to market strategy for both early stage SaaS companies and high growth software businesses within larger organizations. </p>\n\n<p>Eric joined Okta in early 2010 to drive the product and business strategy necessary to rapidly acquire customers and effectively position Okta in the market.</p>\n\n<p>Most recently Eric was the VP of Product Management and Marketing for Apptio, the market leading SaaS provider of IT Financial Management Solutions. As the first business hire, Eric drove inbound product strategy and outbound go to market efforts to define the product, acquire marquee enterprise customers, position the company as the leading vendor of IT Financial Management software, and deliver the sales enablement, lead gen, PR, and AR efforts necessary to rapidly ramp revenue.</p>\n\n<p>Prior to Apptio Eric spent 6 years at Microsoft where he most recently built and ran the product management and marketing organization for Microsoft’s System Center family of systems management products.  There he played a key role in growing revenue and share to surpass CA and become the fourth largest systems management business in the world.  Earlier Eric worked in the Windows Server business where he was responsible for the cross company product and marketing strategy for Microsoft’s Dynamic Systems Initiative. Before Microsoft Eric held a variety of engineering, marketing and business development roles at Intel and Ensim, an NEA backed infrastructure software company.   </p>\n\n<p>Eric received a BSEE from University of Washington and an MBA from Northwestern University.</p>","image":{"available_sizes":[[[150,107],"assets/images/resized/0009/2239/92239v2-max-150x150.png"],[[250,179],"assets/images/resized/0009/2239/92239v2-max-250x250.png"],[[290,208],"assets/images/resized/0009/2239/92239v2-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"BS","subject":"Electrical Engineering","institution":"University of Washington","graduated_year":1992,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"Business","institution":"Kellogg Graduate School of Management","graduated_year":1999,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Vice President, Products","firm":{"name":"Okta","permalink":"okta","type_of_entity":"company","image":{"available_sizes":[[[150,42],"assets/images/resized/0005/8973/58973v8-max-150x150.png"],[[196,55],"assets/images/resized/0005/8973/58973v8-max-250x250.png"],[[196,55],"assets/images/resized/0005/8973/58973v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.okta.com","title":"Okta, Inc"}]}