{"first_name":"Eric","last_name":"W. Linsley","permalink":"eric-w-linsley","crunchbase_url":"http://www.crunchbase.com/person/eric-w-linsley","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jun 17 22:38:49 UTC 2009","updated_at":"Wed Jun 17 22:39:57 UTC 2009","overview":"<p>Eric is an experienced operating executive and venture capital investor who prior to joining Pappas in 2000 served as Chief Financial Officer of TriPath Imaging, Inc. (Nasdaq: TPTH), a medical device company that was acquired in 2006 by Becton Dickinson. Eric played a key role in the three-way merger between AutoCyte, NeoPath and Neuromedical Systems that created TriPath. Prior to the formation of TriPath, he served as Chief Financial Officer and Vice President of Operations at AutoCyte where he led the company in a successful public equity offering in 1997. From 1991 to 1997, Eric worked as an investment professional with Ampersand Ventures, a leading venture capital firm based in Boston. As a partner at Ampersand, he held interim management positions in operating and financial roles for various industrial products and healthcare companies. He previously served as a management consultant with Bain &amp; Co. and McKinsey &amp; Co., and was a certified public accountant with Arthur Andersen LLP. Eric is a director of BioSyntech (TSX: BSY), Emerald BioAgriculture, Cequent Pharmaceuticals and FlowCardia. He was also a director of Panacos Pharmaceuticals (Nasdaq: PANC), and played a key role in its successful reverse merger with a publicly-traded company. He was directly responsible for the investment by Pappas Ventures II in Peninsula Pharmaceuticals, which Johnson &amp; Johnson acquired in 2005 at a substantial premium, and later Cerexa, which was acquired by Forest Laboratories. He is also a board observer at Anthera Pharmaceuticals and LipoScience.</p>","image":{"available_sizes":[[[132,132],"assets/images/resized/0004/9248/49248v1-max-150x150.jpg"],[[132,132],"assets/images/resized/0004/9248/49248v1-max-250x250.jpg"],[[132,132],"assets/images/resized/0004/9248/49248v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Pappas Ventures","permalink":"pappas-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,131],"assets/images/resized/0004/9245/49245v1-max-150x150.png"],[[164,144],"assets/images/resized/0004/9245/49245v1-max-250x250.png"],[[164,144],"assets/images/resized/0004/9245/49245v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}