{"first_name":"Eric","last_name":"Rand","permalink":"eric-rand-2","crunchbase_url":"http://www.crunchbase.com/person/eric-rand-2","homepage_url":"http://Virsona.com","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Aug 28 21:49:34 UTC 2008","updated_at":"Thu Aug 28 22:06:09 UTC 2008","overview":"<p>As president of Virsona, Inc. Mr. Rand is responsible for the day-to-day operations of the company as well as developing the company¹s overall direction and vision. Mr. Rand also is a member of Virsona¹s Board of Directors. Prior to co-founding Virsona, Mr. Rand¹s professional experience exceeds 17 years in the finance industry, having participated in all aspects of the capital, public and private securities markets. During his career, Mr. Rand has led and participated in the raising of approximately $300 million in capital in the form of private placements and funding of public companies. He also has structured and participated in initial public offerings for companies listed on The NASDAQ Stock Market and the American Stock Exchange. In addition to Virsona, Mr. Rand also serves as managing director of private equity for Sandgrain Securities, Inc., a broker-dealer company. Mr. Rand previously served as managing director of sales of vFinance Investments, Inc. also a broker-dealer company, where his responsibilities included being the lead interface with senior management of publicly traded companies and the corporate/securities attorneys representing those companies. Mr. Rand also was co-founder, partner and managing director of First Level Capital, focusing on sales and investment banking. Prior to that, he was a member and served as managing director of the Chairman&#8217;s Council for Commonwealth Associates.  Mr. Rand holds an A.A. in Accounting and a B.S. in Communications from the State University of New York at Buffalo.</p>","image":null,"degrees":[{"degree_type":"A.A. in Accounting and a B.S. in Communications","subject":"Accounting and Communications","institution":"State University of New York at Buffalo.","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}