{"first_name":"Eric","last_name":"Brooke","permalink":"eric-brooke","crunchbase_url":"http://www.crunchbase.com/person/eric-brooke","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Professional You","born_year":null,"born_month":null,"born_day":null,"tag_list":"recruitment, psychology, career-management, web, marketing","alias_list":null,"created_at":"Wed Mar 23 02:13:22 UTC 2011","updated_at":"Mon Apr 11 19:57:56 UTC 2011","overview":"<p>The founder, Eric Brooke, has worked in private, nonprofit and government sectors with responsibility for budgets upto to £71 million and 400 staff.   </p>\n\n<p>He is known for seeing around corners, creating innovative environments, developing strategy and telling a good story.  It was during his time on a leadership team, which merged 7 organizations including 22,000 staff, with £1.15 billion turnover that led him down the path to create Professional You.  </p>\n\n<p>Since 2008 he has being interviewing leaders, industrial psychologists, human resource specialists and learning their pains.  Through this knowledge he has being developing an ecology of  product and services that will seriously disrupt and drastically improve the way we all manage our professional lives.</p>\n\n<p>Leadership &amp; Strategic Advisor to Leaders</p>\n\n<p>Eric has 12 years of leadership experience, 8 years at a senior exec level. He has led several divisions in communications, marketing and service delivery (both corporate and consumer-facing). As an executive he has been responsible for, in one instance, departments of £71 million in revenues and 400 staff. His board level experience includes service as Governor for a British university.</p>\n\n<p>Marketing &amp; Communications</p>\n\n<p>Eric has worked in communications for 18 years, in both Europe and North America. This has included the B2B and B2C marketing for businesses, brands, products, services, policies and individuals in the private, non-profit and government sectors.</p>\n\n<p>In addition to leading divisions responsible for delivering core marcoms strategy and execution, nationally and internationally, Eric has also held roles responsible for advertising (print &amp; digital), social media, employee comms, stakeholder comms, market research, information systems, information technology, product development, sales, fundraising, branding, public relations, CRM, VoC, public affairs and campaigns (political &amp; charitable). This rare diversity of experience has facilitated Eric’s success in breaking down silos and building strong inter-linkages between practices.</p>\n\n<p>Eric does not just work behind the scenes, but has been a public spokesperson for organizations and campaigns in countless media appearances and print interviews, and has frequently addressed audiences both large and small as a public speaker.</p>\n\n<p>Alliances &amp; Change Management</p>\n\n<p>Eric has led and helped build a number of key alliances and strategic partnerships spanning private, public, non-profit and government sectors. Through these, Eric has developed an unparalleled understanding of organizational culture and its development, change management and alliance forming techniques. On the implementation executive that merged 7 organizations (with a total of 22,000 staff and £1.15 billion in revenues), Eric’s particular achievement was to realise a culture shift from bureaucratic to customer-centric throughout the new organization. He also led an award-winning public-private partnership in Digital innovation, and a nationally recognized programme to reduce overlap and wastage between multiple service delivery organizations.</p>\n\n<p>Mentoring, Training and Facilitation</p>\n\n<p>Eric has trained many hundreds of individuals: from business leaders &amp; executives, to campaigners, candidates and politicians, to youth &amp; students. Eric’s training includes management and communication skills, media training, public speaking, negotiation, organization development, and conflict resolution, as well as desktop publishing, IT networks… and scuba diving. Eric has accreditations from a number of national organizations in training and also in training trainers.</p>\n\n<p>Eric has also facilitated multiple strategic management sessions including one recently to establish a vision for an alliance between Petrochemical businesses in Canada as well as having acted as an independent chair for alliances.</p>\n\n<p>Eric frequently takes on mentoring as a fundamental aspect to his management style, and helping mentorees understand their key drivers and values, and to make fundamental decisions their own way.</p>\n\n<p>Technology</p>\n\n<p>Eric‘s passion for new technology is part of his DNA. He gained his first degree from the University of Hertfordshire in Computer Science BSc Hons, and the IT consultancy he set up at that time with a friend paid off his University debts and allowed him to travel the world. Since then, he has been responsible for an IT department serving 18,000 staff and during the merger described, was leader of the associated IT program. He is currently the CEO of a technology startup. Eric’s head is regularly buried in the latest sci-tech publication, in his spare time he builds new applications.</p>\n\n<p>Politics, Government and Communities</p>\n\n<p>Eric’s keen sense of social justice in communities is borne of his personal experience being brought up in the foster care system. He has himself been an advocate and elected official in a number of capacities – as well as political adviser to Government Leaders and Parliamentary MPs. As an elected politician for over three years, Eric both campaigned at grassroots level to build solutions for his constituent communities, as well as working at the macro level as a Cabinet Member responsible for delivering Communities and Cultural Services to a region of 500,000 individuals. Consequently, Eric is uniquely placed to provide strategic advice, understanding the total picture of the inter-relationships between individuals, communities, representatives and business. His insight into community-building has particular pertinence today for clients looking to understand the formation of virtual communities.</p>\n\n<p>Innovation &amp; Creativity</p>\n\n<p>Eric has been described as someone whose thinking simply cannot be put ‘into the box’, and who refuses to be limited by disciplines or dogmas.</p>\n\n<p>His diversity of experience and active imagination enables him to make connections where other people do not. As a result, he has a reputation for encouraging creativity in people and challenges to innovate new ways to meet needs, whether formally or informally. Some of his favourite ‘out of the box’ accomplishments include putting libraries on beaches, getting marketers to learn from gamers on engagement techniques, harnessing Digital TV’s to deliver health services, having run the most recognised charity campaign in the UK, and the idea behind his latest project Professional You which anticipates will make the resume redundant. It is worth noting that he is a very good cook, essentially because he is willing to try new things.</p>\n\n<p>Success &amp; Drive</p>\n\n<p>Eric’s energy knows no bounds. Constantly striving to innovate and create, Eric brings vision, as well as his passion for developing both people and technology to every project. Campaigning and advocacy is in his blood – and it is this drive to succeed, as well as diverse experience and exceptional ability to see the big picture, that makes him a considerable asset to any organization.</p>\n\n<p>Eric left school at 16 and started his working life in a restaurant kitchen.</p>","image":{"available_sizes":[[[110,147],"assets/images/resized/0012/8508/128508v2-max-150x150.jpg"],[[110,147],"assets/images/resized/0012/8508/128508v2-max-250x250.jpg"],[[110,147],"assets/images/resized/0012/8508/128508v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bsc Hons","subject":"Computer Science (Information Systems)","institution":"University of Hertfordshire, UK","graduated_year":1996,"graduated_month":null,"graduated_day":null},{"degree_type":"Bsc Hons","subject":"Computer Science (Information Systems)","institution":"University of Hertfordshire, UK","graduated_year":1996,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder & CEO","firm":{"name":"Professional You","permalink":"professional-you","type_of_entity":"company","image":{"available_sizes":[[[150,54],"assets/images/resized/0012/6394/126394v2-max-150x150.png"],[[250,91],"assets/images/resized/0012/6394/126394v2-max-250x250.png"],[[450,164],"assets/images/resized/0012/6394/126394v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://ca.linkedin.com/in/ericbrooke","title":"Linkedin"},{"external_url":"http://twitter.com/ericbrooke","title":"Twitter"}]}