{"first_name":"Eric","last_name":"Kuhn","permalink":"eric-kuhn-2","crunchbase_url":"http://www.crunchbase.com/person/eric-kuhn-2","homepage_url":"","birthplace":"","twitter_username":"Kuhn","blog_url":"","blog_feed_url":"","affiliation_name":"UTA ","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Mon Mar 19 19:26:14 UTC 2012","updated_at":"Wed Apr 04 02:22:55 UTC 2012","overview":"<p>Eric Kuhn is Hollywood’s first social media agent, working at United Talent Agency, one of the entertainment industry’s leading talent and literary agencies. Constantly building bridges between Silicon Valley and Hollywood, he represents emerging technology companies and provides advisory services to Fortune 500 corporations and some of the biggest writers, directors, actors and producers.</p>\n\n<p>Prior to UTA, Kuhn was the first-ever Audience Interaction Producer at CNN, where he ran social media and focused on television-web integration for the network.  While at CNN he brokered high-profile partnerships with digital companies such as: Facebook, Twitter, LinkedIn, Foursquare, Tumblr and GetGlue. During the 2010 presidential campaign, Kuhn reported predictions of the race by utilizing trending topics and live twitter feeds. His reporting has appeared on CNN, MSNBC, CBS News, The Washington Post, MediaBistro.com, and CNBC.</p>\n\n<p>Kuhn has produced original programming focused on two-screen experiences, including creating “Rick’s List” with Rick Sanchez, launching the live streaming premiere of “John King, USA” on Facebook, and two worldwide Larry King Live telethons featuring a “social suite” with stars such as Ryan Seacrest, Will.i.am and Alyssa Milano.</p>\n\n<p>He has spoken and moderated numerous industry conference panels including this year’s Business Insider’s Social Analytics, Digital Hollywood, Variety’s Venture Capital &amp; New Media Summit, South By South West, The Meeting (Aspen, Colorado), and the 92nd Street Y’s Twitter 140 Character conference. He also serves on the leadership committee of the Washington DC-based AMP (Activism, Media and Politics) Summit.</p>\n\n<p>Fast Company and TechCrunch recently profiled Kuhn’s innovative work inside Hollywood and Silicon Valley. He has been named to Forbes 30 under 30, Variety’s “Hollywood&#8217;s New Leaders” and Vanity Fair’s Next Establishment list which featured “rising talent in tech, media, policy, and business.”\nKuhn majored in government at Hamilton College, where he proudly sits on the alumni council, and studied at the London School of Economics. Raised in New York, Kuhn now resides in Los Angeles.</p>","image":{"available_sizes":[[[150,138],"assets/images/resized/0018/0049/180049v1-max-150x150.jpg"],[[250,230],"assets/images/resized/0018/0049/180049v1-max-250x250.jpg"],[[450,414],"assets/images/resized/0018/0049/180049v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"","subject":"Government","institution":"Hamilton College","graduated_year":2009,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Head of Social Media","firm":{"name":"UTA ","permalink":"uta","type_of_entity":"company","image":null}},{"is_past":true,"title":"Audience Interaction Producer","firm":{"name":"CNN","permalink":"cnn-2","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.fastcompany.com/1755802/hollywoods-first-social-media-agent-talks-the-future-of-entertainment","title":"Hey Hollywood Moguls, Are You Following The First Social Media Agent @Kuhn On Twitter? "},{"external_url":"http://www.mediaite.com/online/gone-hollywood-eric-kuhn-leaves-cnn-behind-for-las-united-talent-agency/","title":"Gone Hollywood: Eric Kuhn Leaves CNN Behind For LA’s United Talent Agency"},{"external_url":"http://rypple.com/mwm/2010/06/21/eric-kuhn-cnns-justin-bieber-of-social-networking/","title":"Eric Kuhn, CNN’s Justin Bieber of Social Networking"}],"web_presences":[]}