{"first_name":"Eric","last_name":"Hoffert","permalink":"eric-hoffert-2","crunchbase_url":"http://www.crunchbase.com/person/eric-hoffert-2","homepage_url":"","birthplace":"Brooklyn, New York","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Worldwide Magnifi","born_year":1962,"born_month":10,"born_day":7,"tag_list":"","alias_list":null,"created_at":"Sun Feb 17 15:27:58 UTC 2008","updated_at":"Sun Oct 09 21:54:15 UTC 2011","overview":"<p>Eric Hoffert has more than twenty five years of experience leading product and technology development in digital media, software-as-a-service, mobile services, and cloud computing. His background includes key roles at Apple Computer, AT&amp;T Bell Labs, and a number of new ventures.</p>\n\n<p>Eric serves as the Chairman of Versatility Software Inc., a digital media consultancy with clients including The Walt Disney Company, SONY, Scripps Network, Stanford University, Carnegie-Mellon, Corbis, and others. </p>\n\n<p>Eric is the CTO of Thwapr, a platform enabling brands to mobilize and monetize video content, extending distribution reach while delivering a high quality user experience independent of device, OS, browser, carrier, or bandwidth. Hybrid transcoding, adaptive rendering, and video SMS are combined in a cloud platform compatible with 300+ mobile devices. The solution has been used by the National Football League, National Hockey League, two of the largest music festivals in the US (Vans Warped &amp; Rockstar Mayhem), Photobucket, etc. with coverage in the New York Times, TechCrunch, Mashable, VentureBeat, StreamingMedia, ESPN, Billboard, etc.</p>\n\n<p>He co-founded ShareMethods, a document sharing and collaboration service with clients including CBS Interactive, Broadcom, Synopsys, HID, Airspan Networks, etc.; it is integrated with salesforce.com, EchoSign, and Oracle and has users in 40 countries.</p>\n\n<p>Previously, he was Chairman and CTO for Magnifi, a digital asset management platform deployed by Coca-Cola and P&amp;G, where he received the Computerworld Honors Award. </p>\n\n<p>Prior to Magnifi, Eric managed Apple Computer’s Multimedia Communications Group, where he co-founded the QuickTime software project and led development of the first real-time software video compression algorithm which is now used on more than 500 million computers.  He was also a project leader for QuickTime Conferencing, a video conferencing Internet and telecom platform for Apple that included alliances with AT&amp;T, IBM, Cisco, and NTT. While at Apple, Eric received the CEO Technical Award for the development of QuickTime software.</p>\n\n<p>Prior to Apple, Eric was a research scientist at AT&amp;T Bell Labs where he was co-founder of a venture that developed a parallel graphics supercomputer called the AT&amp;T Pixel Machine used by NASA, CalTech, and R/Greenberg. He also worked as a programmer at Broadway Video, a leading video production house in New York City where he created visual effects for music videos showcased on MTV and in the Museum of Modern Art.</p>\n\n<p>Eric holds sixteen US patents; has authored and co-authored papers for the ACM and IEEE; and has lectured widely around the world. Eric has been quoted in the press and his work covered in the media including the New York Times, TechCrunch, Mashable, the Wall Street Journal, Forbes, The Financial Times, CIO, InfoWorld, eWeek, RedHerring, Who&#8217;s Who in America 2007, etc. He serves on the Editorial Board for the Journal of Digital Asset Management.</p>\n\n<p>For fun, Eric has played as the lead guitarist and songwriter for the Speedies, a NYC power pop band whose music has been licensed by Hewlett Packard (for a Global TV Advertising Campaign for digital photography with 500 million impressions) and NBC Universal, with digital albums available in Spotify and Apple iTunes. Eric also produced the Beastie Boys&#8217; early hard core tracks on Capitol Records. When time permits, Eric works on research for large-scale renewable energy technologies that can deliver terawatts of clean power on a global basis.</p>","image":{"available_sizes":[[[103,150],"assets/images/resized/0001/4386/14386v1-max-150x150.jpg"],[[103,150],"assets/images/resized/0001/4386/14386v1-max-250x250.jpg"],[[103,150],"assets/images/resized/0001/4386/14386v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.versatility-inc.com\" title=\"Versatility Software\" rel=\"nofollow\">Versatility Software</a></p>"},"degrees":[{"degree_type":"M.S.","subject":"Computer Science","institution":"New York University, Courant Institute of Mathematical Sciences","graduated_year":1989,"graduated_month":null,"graduated_day":null},{"degree_type":"B.S.M.E.","subject":"Mechanical / Aerospace Engineering","institution":"Cooper Union","graduated_year":1985,"graduated_month":null,"graduated_day":null},{"degree_type":"B.S.C.S.","subject":"Computer Science","institution":"New York University, Courant Institute of Mathematical Sciences","graduated_year":1985,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"ShareMethods","permalink":"sharemethods","type_of_entity":"company","image":{"available_sizes":[[[150,62],"assets/images/resized/0001/2566/12566v1-max-150x150.png"],[[202,84],"assets/images/resized/0001/2566/12566v1-max-250x250.png"],[[202,84],"assets/images/resized/0001/2566/12566v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"CTO","firm":{"name":"Thwapr","permalink":"thwapr","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0007/0365/70365v1-max-150x150.png"],[[200,59],"assets/images/resized/0007/0365/70365v1-max-250x250.png"],[[200,59],"assets/images/resized/0007/0365/70365v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"CTO","firm":{"name":"Worldwide Magnifi","permalink":"worldwide-magnifi","type_of_entity":"company","image":null}},{"is_past":true,"title":"Manager, Multimedia Communications","firm":{"name":"Apple","permalink":"apple","type_of_entity":"company","image":{"available_sizes":[[[124,150],"assets/images/resized/0005/4061/54061v1-max-150x150.jpg"],[[206,250],"assets/images/resized/0005/4061/54061v1-max-250x250.jpg"],[[372,450],"assets/images/resized/0005/4061/54061v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Research Scientist","firm":{"name":"AT&T","permalink":"at-t","type_of_entity":"company","image":{"available_sizes":[[[150,75],"assets/images/resized/0001/0875/10875v1-max-150x150.png"],[[159,80],"assets/images/resized/0001/0875/10875v1-max-250x250.png"],[[159,80],"assets/images/resized/0001/0875/10875v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://techcrunch.com/2009/12/18/thwapr-beta-launch/","title":"Quicktime Vets Bring Mobile Video And Photo Sharing With Thwapr (Beta Launch)"},{"external_url":"http://www.fiercedeveloper.com/pages/developer-workshop-thwapr","title":"Developer Workshop: Thwapr CTO Eric Hoffert"},{"external_url":"http://www.adweek.com/news/advertising/goodby-keeps-hp-picture-81261","title":"Goodby Keeps HP in the Picture (Speedies)"}],"web_presences":[]}