{"first_name":"Eric","last_name":"Korman","permalink":"eric-korman","crunchbase_url":"http://www.crunchbase.com/person/eric-korman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"The Active Network","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Aug 24 05:14:08 UTC 2007","updated_at":"Thu Apr 09 00:47:50 UTC 2009","overview":"<p>Eric Korman is President of Ticketmaster, the diversified live entertainment and marketing company.  In this position, Eric leads a variety of global functions and operations for Ticketmaster.</p>\n\n<p>Prior to joining Ticketmaster, Eric served as Senior Vice President of Mergers and Acquisitions for IAC from January 2005 to April 2006.  He joined IAC in September 2001 as Vice President of Business Development and Strategy for Ecommerce Services (ECS), a former subsidiary of IAC.  Subsequently, he was promoted to Vice President of Strategic Planning for IAC in February 2002, and was appointed vice president of Mergers and Acquisitions in September 2003.</p>\n\n<p>Before taking on his roles with IAC, Eric served in the Customer Marketing group of Coca-Cola USA from 1993 to 1995 before joining the Corporate Business Development group of The Coca-Cola Company, where he remained until 1997, managing the mergers, acquisitions, and divestitures of nonalcoholic beverage companies primarily located in Europe and South America.  In January 2000, Eric joined Digital Convergence Corporation as Vice President, assisting the start-up with various activities such as raising private equity and signing distribution partners.  Eric left Digital Convergence later that year to become a principal in epartners, a $650 million venture fund backed by SOFTBANK and News Corporation.</p>\n\n<p>Eric is an honors graduate from Emory University with a bachelor of arts degree in Economics and earned an MBA from the J.L. Kellogg Graduate School of Management at Northwestern University with a concentration in Finance.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Board","firm":{"name":"ACTIVE Network","permalink":"activenetwork","type_of_entity":"company","image":{"available_sizes":[[[150,42],"assets/images/resized/0001/1037/11037v5-max-150x150.png"],[[250,70],"assets/images/resized/0001/1037/11037v5-max-250x250.png"],[[450,126],"assets/images/resized/0001/1037/11037v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}