{"first_name":"Eric","last_name":"Garner","permalink":"eric-garner","crunchbase_url":"http://www.crunchbase.com/person/eric-garner","homepage_url":"http://www.managetrainlearn.com","birthplace":"Kent, UK","twitter_username":"","blog_url":"http://managetrainlearn.blogspot.com/","blog_feed_url":"","affiliation_name":"ManageTrainLearn","born_year":1955,"born_month":8,"born_day":17,"tag_list":"manage, train, learn, management-training-materials, management-training-resources, management-training-products, free-management-training, mobile-management-training","alias_list":null,"created_at":"Fri Nov 05 14:42:36 UTC 2010","updated_at":"Wed Nov 10 19:26:24 UTC 2010","overview":"<p>Eric Garner is Managing Director of ManageTrainLearn and wants to offer you a very special learning experience.</p>\n\n<p>How do we do that?</p>\n\n<ol>\n<li>By offering you high-quality content based on our years of delivering management courses.</li>\n<li>By using the power of e-learning to deliver unique solutions right to your desktop at any time of the day or night.</li>\n</ol>\n\n<p>From our ManageTrainLearn website, you can enjoy these kinds of learning experience:</p>\n\n<ol>\n<li><p>Access to Great Resources. Take a tour of the 20 management skills that are at the heart of the MTL experience. Then look at our wide range of articles, and our weekly newsletter and blog. With back copies and archives, this adds up to a wealth of material right at your fingertips.</p></li>\n<li><p>Free E-learning for Instant Download. We love to show you just what e-learning can do and that&#8217;s why we offer free resources, free samplers, free quizzes and free demos, delivered as instant downloads, subscriptions, and daily email tips.</p></li>\n<li><p>Outstanding E-learning Products. Our mission at ManageTrainLearn is to leverage the power of e-learning to create very special learning experiences for you and your organisation. Our current portfolio consists of nearly 300 products including:</p></li>\n<li><p>The MTL Online Courses: 100 e-learning courses available on instant subscription, or as SCORM-compliant course material</p></li>\n<li>MTL E-Manuals: 20 resource-rich manuals full of content, worksheets, quizzes, and exercises.</li>\n<li>MTL Step by Step Series: 20 e-books that will show you how to master the skills of management</li>\n<li>MTL 1daycourseplans: 60 ready-made course plans using Powerpoint slides and pdf guides.</li>\n<li>MTL Mini-Courses: 80 Flash-based courses delivering what we call &#8220;nutshell&#8221; training.</li>\n<li>Stories that Coach: 3 volumes of the very best training tales around.\nand many more.</li>\n</ol>\n\n<p>Why not enjoy the ManageTrainLearn experience yourself?</p>\n\n<p>Just go to www.managetrainlearn.com\n&#8220;The best management training material on the Internet&#8221;</p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0010/8831/108831v2-max-150x150.jpg"],[[80,80],"assets/images/resized/0010/8831/108831v2-max-250x250.jpg"],[[80,80],"assets/images/resized/0010/8831/108831v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MA","subject":"Modern Languages","institution":"Cambridge University","graduated_year":1972,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"ManageTrainLearn","permalink":"managetrainlearn","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.managetrainlearn.com","title":"ManageTrainLearn"}]}