{"first_name":"Eric","last_name":"Morgan","permalink":"eric-morgan-3","crunchbase_url":"http://www.crunchbase.com/person/eric-morgan-3","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"AtTask","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 16 23:23:03 UTC 2011","updated_at":"Sat Oct 27 01:35:55 UTC 2012","overview":"<p>Eric joined AtTask in September 2011 and has an extensive track record in building cohesive teams around a powerful vision, exceeding established goals and creating world-class organizations. &#8220;Success as an enterprise SaaS business, more than traditional software providers, requires that we deliver value to our clients everyday if we expect to keep them as a client. This intense focus on client success is very exciting and drives us to constantly improve the value we deliver to them &#8221; says Morgan.\nEric&#8217;s career in tech includes experiences in early-stage start-ups, high-growth businesses and publicly traded companies. In each of these roles, he has found ways to beat expectations while leading organizations through periods of high growth. The diverse lessons he learned at industry leading companies like NCR, Lawson Software and AdvancedMD have given him a unique toolset to tackle the Chief Executive role at AtTask where he says, &#8220;I have had the pleasure of working with some great companies and believe that we are poised for the greatest market potential of any I have experienced&#8221;.\nA native of New Jersey, Eric has made his home in Park City, Utah since 2008. He describes Utah as &#8220;…one of the best kept secrets in the country.&#8221; In addition to enjoying Utah&#8217;s world-famous skiing, he is an avid mountain and road biker and enjoys exploring the amazing outdoor splendor that Utah has to offer.\nEric graduated from New England College in 1983.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0021/7456/217456v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0021/7456/217456v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0021/7456/217456v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"AtTask","permalink":"attask","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0002/0501/20501v4-max-150x150.png"],[[250,75],"assets/images/resized/0002/0501/20501v4-max-250x250.png"],[[450,135],"assets/images/resized/0002/0501/20501v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}