{"first_name":"Erica Lynn","last_name":"Young","permalink":"erica-lynn-young","crunchbase_url":"http://www.crunchbase.com/person/erica-lynn-young","homepage_url":"http://truthandfashion.com/","birthplace":"","twitter_username":"EricaLynnYoung","blog_url":"","blog_feed_url":"","affiliation_name":"Postings Plus","born_year":1984,"born_month":3,"born_day":17,"tag_list":"socia-media, entrepreneur, marketing, affiliate-marketing, brand-development, intergrated-marketing, strategy, higher-education, public-speaking, fashion, tech","alias_list":null,"created_at":"Fri Mar 23 13:00:29 UTC 2012","updated_at":"Tue Mar 27 06:13:01 UTC 2012","overview":"<p>Erica Lynn Young is a serial entrepreneur and social media strategist. </p>\n\n<p>Erica&#8217;s current venture is called Truth + Fashion which is a media company that focuses on plus models that will launch in the next month. Her first company is MadisonPlus.com which is an affiliate marketing company with over 200 different brands and 100,000 products on one contemporary shopping platform. After the company appeared on The Today Show and numerous media publications, Erica sold her stake in the company to pursue the next void she saw in plus fashion with Truth + Fashion.  </p>\n\n<p>Erica&#8217;s social media clients include institutions of higher education, nonprofits, fashion companies, authors, and more. Erica works with each client to access their marketing needs and then develops a strategy to best integrate their goals with social media platforms.  Erica is extremely goal oriented and also seeks to surpass her client&#8217;s expectations.</p>\n\n<p>Erica has been recognized by her peers for her dedicated work with the LIM College &#8220;Rising Star Award&#8221; as well as for her philanthropic work with an &#8220;Inspiring Member&#8221; feature on NYCInv.com.</p>\n\n<p>She also enjoys public speaking and has lectured for groups of 30 to auditoriums of over a 1,000 at Emerson College, Bryant University, Johnson &amp; Wales University, Five Towns College, Stephens College, and LIM College. She is also an adjunct professor at LIM College, a member of their Alumni Steering Committee, and a part or their Strategic Planning Committee.</p>\n\n<p>Erica loves to meet new people to talk about fashion tech, entrepreneurship, new ideas, and opportunities.  </p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0018/0734/180734v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0018/0734/180734v2-max-250x250.jpg"],[[450,300],"assets/images/resized/0018/0734/180734v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BBA and Valedictorian","subject":"Fashion Merchandising","institution":"LIM College","graduated_year":2006,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Board Advisor","firm":{"name":"Postings Plus","permalink":"postings-plus","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}