{"first_name":"Eric","last_name":"N. Olson","permalink":"eric-n-olson","crunchbase_url":"http://www.crunchbase.com/person/eric-n-olson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 08 07:48:33 UTC 2009","updated_at":"Mon Jun 08 07:50:45 UTC 2009","overview":"<p>Eric N. Olson, Ph.D., miRagen’s Co-Founder and Chief Scientific Advisor, has dedicated his career to deciphering the mechanisms that control muscle gene regulation and development. His most recent work has focused on the genetic pathways responsible for congenital and acquired cardiovascular disease.</p>\n\n<p>Dr. Olson attended Wake Forest University receiving a B.A. in Chemistry and Biology, a Ph.D. in Biochemistry and an honorary doctorate. After postdoctoral training at Washington University School of Medicine, he joined the Department of Biochemistry and Molecular Biology at The M.D. Anderson Cancer Center in 1984 and became Professor and Chairman. He later founded the Department of Molecular Biology at The University of Texas Southwestern Medical Center at Dallas where he holds the Robert A. Welch Distinguished Chair.</p>\n\n<p>Dr. Olson’s honors include: the Basic Research Prize, the Founding Distinguished Scientist Award, and the Research Achievement Award from the American Heart Association; the Pasarow Medical Research Award in Cardiovascular Disease; the Gill Heart Institute Award; the Lucian Award for Research in Cardiovascular Disease; the Outstanding Investigator Award from the International Society for Heart Research; and the Pollin Prize for Lifetime Contributions to Pediatric Research. He is a member of the American Academy of Arts and Sciences and the National Academy of Sciences and its Institute of Medicine.</p>\n\n<p>Dr. Olson is a member of numerous editorial boards including Circulation, Circulation Research, and Science and belongs to the Scientific Review Board of the Howard Hughes Medical Institute. He was a Co-Founder and Scientific Advisor of Myogen, Inc., a biotechnology company focusing on therapies for heart muscle disease, acquired by Gilead Pharmaceuticals in 2006.</p>","image":{"available_sizes":[[[116,150],"assets/images/resized/0004/7294/47294v1-max-150x150.jpg"],[[136,175],"assets/images/resized/0004/7294/47294v1-max-250x250.jpg"],[[136,175],"assets/images/resized/0004/7294/47294v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder and Chief Scientific Advisor","firm":{"name":"Miragen Therapeutics","permalink":"miragen-therapeutics","type_of_entity":"company","image":{"available_sizes":[[[150,79],"assets/images/resized/0004/7290/47290v1-max-150x150.jpg"],[[243,129],"assets/images/resized/0004/7290/47290v1-max-250x250.jpg"],[[243,129],"assets/images/resized/0004/7290/47290v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}