{"first_name":"Eric","last_name":"Best","permalink":"eric-best","crunchbase_url":"http://www.crunchbase.com/person/eric-best","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Mercent Corporation","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jun 18 20:12:00 UTC 2008","updated_at":"Fri Feb 04 23:58:53 UTC 2011","overview":"<p>Eric Best is a veteran entrepreneur and experienced manager of strategy, people, and technology.  In the span of his career, Best has founded five successful technology product and service companies.</p>\n\n<p>Best is the founder and current Chairman and CEO of Mercent Corporation, a SaaS software company that enables retailers to be more visible, competitive, and profitable where consumers shop online. He also serves as director of Bellevue-based ITEX (ITEX.OB), a technology company that provides a business-to-business payment system for non-cash transactions.</p>\n\n<p>Best is co-founder of Seattle-based Impresys Corporation, provider of DemoMate SaaS platform for building and distributing software demos, presentations, and online tutorials. Prior, he founded Seattle-based Morse Best Innovation, a technical marketing agency serving Microsoft, Intel, Unisys, Lexmark and other global technology brands.  </p>\n\n<p>Founding MindCorps in 1996, Best created a profitable, high-growth software consultancy that served the Internet and Fortune 500 markets before its acquisition by Amazon.com. Joining Amazon.com, Best managed business development for the Amazon.com Commerce Network, working on the deal teams for Amazon&#8217;s first major brick-and-mortar partnerships.</p>\n\n<p>Best founded the software product firm Emercis Corporation in 1998 to provide e-commerce infrastructure tools to enterprise businesses. Emercis was acquired by Impressa, Inc. in 2000.</p>\n\n<p>Serving as Director of Ubarter.com, Best helped facilitate the sale of the business to Network Commerce in 2000 for $45 million.</p>\n\n<p>Best is a graduate of Seattle Pacific University and a member of the SPU Entrepreneurial Studies Council and Society of Fellows. </p>","image":{"available_sizes":[[[95,150],"assets/images/resized/0012/0224/120224v2-max-150x150.jpg"],[[158,250],"assets/images/resized/0012/0224/120224v2-max-250x250.jpg"],[[285,450],"assets/images/resized/0012/0224/120224v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Mercent Corporation","permalink":"mercentcorporation","type_of_entity":"company","image":{"available_sizes":[[[150,49],"assets/images/resized/0002/0617/20617v1-max-150x150.png"],[[182,60],"assets/images/resized/0002/0617/20617v1-max-250x250.png"],[[182,60],"assets/images/resized/0002/0617/20617v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}