{"first_name":"Eric","last_name":"Guillaume","permalink":"eric-guillaume","crunchbase_url":"http://www.crunchbase.com/person/eric-guillaume","homepage_url":"","birthplace":"","twitter_username":"eguillaume","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"itv, bbc-worldwide, content, news, media, e-commerce, products, tv, mobile, digital","alias_list":"","created_at":"Sat Nov 29 22:17:37 UTC 2008","updated_at":"Thu Sep 23 20:51:09 UTC 2010","overview":"<p>Currently Project Director for ITV, the largest commercial broadcaster in the UK, he leads the strategic review around ITV news business on digital platforms, including Canvas/YouView (the UK IPTV/connected TV platform).</p>\n\n<p>Formerly Consumer Director for BBC Worldwide, the commercial arm of the BBC. Also a board member of BBC.com. </p>\n\n<p>Part of the team that launched the commercial site outside the UK in 2007 and  responsible for all consumer activities for BBC.com and on mobile: product strategy, trade and consumer marketing, branding, editorial and content strategy (News, Sports, Weather, Lifestyle, Entertainment), research and customer service.</p>\n\n<p>He also served as Product Director for BBC World News, the commercial TV channel, distributed outside the UK (BBC World News is the largest BBC TV channel), responsible for defining the long term consumer experience as TV content becomes interactive and assessing its impact on the marketing and distribution of the channel.</p>\n\n<p>He was previously European Product Marketing Director for AOL Europe, with responsibility for the European Paid Services P&amp;L, that included security products and entertainment services. He was also in charge of innovation across Europe and product coordination with the AOL HQ in the US.</p>\n\n<p>He also had stints with Bertelsmann in their e-commerce and book publishing business, as well as with GUS (Great Universal Stores), one of the largest UK retail groups where he led product, marketing and e-commerce for the launch of their online direct marketing activities in 2000.</p>\n\n<p>He spent eight years in San Francisco in the 1990s working for various Silicon Valley start-ups.</p>","image":null,"degrees":[{"degree_type":"Post Master's degree - Ph.D. program","subject":"Social Sciences","institution":"Ecole Normale Superieure Cachan","graduated_year":1992,"graduated_month":null,"graduated_day":null},{"degree_type":"Master's degree","subject":"Social Sciences","institution":"University Paris X","graduated_year":1991,"graduated_month":null,"graduated_day":null},{"degree_type":"Master Program","subject":"Social Sciences","institution":"San Francisco State University","graduated_year":1994,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/eguillaume","title":"LinkedIn"}]}