{"first_name":"Eric","last_name":"Zeng","permalink":"eric-zeng","crunchbase_url":"http://www.crunchbase.com/person/eric-zeng","homepage_url":"http://www.oxy-concentrator.com","birthplace":"","twitter_username":"","blog_url":"http://www.flixya.com/blog/2990501/With-Oxygen-TherapyNo-More-Worry-About-COPDChronic-Obstructive-Pulmonary-Disease","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"oxygen-concentrator, beauty-care, health-care","alias_list":"","created_at":"Fri May 27 06:33:58 UTC 2011","updated_at":"Sat Jul 09 23:30:39 UTC 2011","overview":"<p>Legend China Medical Technology Co.,Ltd. is an emerging leader in the research,development, assembly, marketing of medical products in South China, including beauty care and health care products like oxygen concentrators. In 2007, we were re-organized and become a subsidiary of Contec Medical System(CMS),who was founded in 1993,with 33 branch offices,1500 employees and 35,000 square meters factory in China mainland.This change has brought us with great support from CMS, now we are developing fast towards a leading supplier of health&amp; beauty care products in China Mainland. \nThe company has been certified with TUV ISO9001,ISO13485, and products got CE,FDA,COS/VIOS certifications.Products such as fetal dopper,pulse oximeter,ultrasonic were awarded with National Key New Product and National Torch Program. \n&#8220;TLC4000 Dynamic ECG&#8221; was chosen as brand-name products.\n&#8220;CMS9000 Multi-parameter monitoring system&#8221; was chosen as the top ten software products\nNamed by the National Development and Reform Commission, Ministry of Information Industry and other ministries as a &#8220;state planning key software enterprises. &#8221;\nChina’s aggressive stimulus package totaling RMB 4 trillion for 2009 – 2010 has boosted growth and development in many industries including the medical equipment manufacturing sector. In January 2009, the Chinese government has passed a long-awaited plan to improve healthcare for more than 90% of the population by 2011. With a government investment of RMB850 billion (US$123 billion), China’s medical equipment industry appears to be positioned for growth. At the same time, China’s trade of medical equipment has been strongly outpacing the growth in the country’s overall trade.\n \nThanks to improved production capability and ongoing technology innovations, China has started to carve a name as an important medical equipment manufacturing center. Under this circumstance, Legend China Medical Technology Co.,Ltd.has successfully upgraded its standards to meet international markets’ demand for more high-end products with the aim of entering the European and American markets in the future.\nWe hope that in the near future we will develop to be a world known product and service provider in the field of beauty care, medical and technical service.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.oxy-concentrator.com","title":"oxygen concentrator"}],"web_presences":[{"external_url":"http://www.oxy-concentrator.com","title":"portable oxygen concentrator"}]}