{"first_name":"Erik","last_name":"van Hoof","permalink":"erik-van-hoof","crunchbase_url":"http://www.crunchbase.com/person/erik-van-hoof","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"CWR Mobility","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jan 17 23:11:05 UTC 2011","updated_at":"Fri Jan 28 03:51:07 UTC 2011","overview":"<p>Erik van Hoof has 15 years of experience in software development, systems integration and sales, marketing and partner recruitment.  He co-founded CWR Mobility BV in January 2006 and is responsible for EMEA sales and partner management as well as global consulting and support services.</p>\n\n<p>After studying Computer Science, Erik van Hoof started his career in 1996 as a technical specialist for a systems integrator that specialized in ERP and Service Management back office solutions.  In this role, Erik saw customers’ need for mobility and soon took on a role as development manager of a solutions group, developing mobility solutions for field service.  </p>\n\n<p>During this time, van Hoof gained extensive hands-on experience in mobilizing field sales and field service workforces.  His mobile solutions expertise ranges from small installations to those of large multi-national organizations.  His experience has spanned technical, sales, marketing, and partner recruitment roles.</p>\n\n<p>In 2005, Erik decided to start a company focused on mobility solutions and co-founded CWR Mobility in January, 2006. The company has focused on development of innovative, highly configurable mobile solutions based on the Microsoft Dynamics® CRM platform.  The company’s flagship product, CWR Mobile CRM, has grown to become the leading mobile client for Microsoft Dynamics CRM.</p>\n\n<p>Erik has a passionate interest in the ongoing evolution of CRM and mobile technologies.  He actively seeks to develop partnerships with companies that understand and have expertise in CRM and mobility.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"CWR Mobility","permalink":"cwr-mobility","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0011/7749/117749v6-max-150x150.png"],[[200,200],"assets/images/resized/0011/7749/117749v6-max-250x250.png"],[[200,200],"assets/images/resized/0011/7749/117749v6-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}