{"first_name":"Erika","last_name":"Shaffer","permalink":"erika-shaffer","crunchbase_url":"http://www.crunchbase.com/person/erika-shaffer","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"SutherlandGold Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Dec 22 03:26:01 UTC 2009","updated_at":"Thu Mar 04 18:49:57 UTC 2010","overview":"<p>Erika has been working in the technology sector for more than a decade. Before joining SutherlandGold, she spent five years leading the corporate public relations team at RealNetworks, where she helped guide communications surrounding the company’s transformation from streaming media technology pioneer into a consumer-focused business. She has launched major products and initiatives, handled crisis communications, financial communications, acquisitions and mergers, and managed major business stories that put RealNetworks on the map. Prior to RealNetworks, Erika worked at Microsoft in the Investor Relations group where she communicated with leading financial analysts on a daily basis. With strong business and technology contacts, and a unique skill for making technical stories relevant to a consumer audience, Erika is an asset to the SutherlandGold team. She is based in Seattle. </p>\n\n<p>Erika holds a B.A. in History from Bowdoin College in Brunswick, Maine and a Masters in Library and Information Science from the University of Washington in Seattle, Washington. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"SutherlandGold Group","permalink":"sutherlandgold","type_of_entity":"company","image":{"available_sizes":[[[150,105],"assets/images/resized/0007/0663/70663v3-max-150x150.png"],[[250,175],"assets/images/resized/0007/0663/70663v3-max-250x250.png"],[[450,316],"assets/images/resized/0007/0663/70663v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}