{"first_name":"Erik","last_name":"Aeyelts Averink","permalink":"erik-aeyelts-averink","crunchbase_url":"http://www.crunchbase.com/person/erik-aeyelts-averink","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Qelp","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Feb 25 20:17:20 UTC 2012","updated_at":"Tue Feb 28 09:45:11 UTC 2012","overview":"<p>Erik Aeyelts Averink has been a non-executive board member at Qelp since 2009. He acts as a sounding board for the executive team on all aspects of growing Qelp. In addition to his role at Qelp, Erik holds non-executive board member positions at ADAM Software and Arco Information, is a venture partner at Newion Investments, and a trusted advisor to a number of software companies. Prior to his current roles, he was President at (SDL) Tridion, a company that provides web content management software where he was responsible for corporate and product strategy and played a significant role in helping Tridion to become a global leader. Tridion was acquired in 2007 by SDL. Prior to Tridion, Erik was a general partner at Gilde IT Fund, a venture firm responsible for more than 15 investments over a period of 11 years.</p>\n\n<p>He is frequent lecturer on entrepreneurship, strategy for early stage companies and venture capital. Erik holds a masters degree in economics from Erasmus University in Rotterdam, The Netherlands.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Non-executive board member","firm":{"name":"Qelp","permalink":"qelp","type_of_entity":"company","image":{"available_sizes":[[[145,150],"assets/images/resized/0017/7442/177442v2-max-150x150.png"],[[243,250],"assets/images/resized/0017/7442/177442v2-max-250x250.png"],[[437,450],"assets/images/resized/0017/7442/177442v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}