{"first_name":"Erik","last_name":"Rasmussen","permalink":"erik-rasmussen-2","crunchbase_url":"http://www.crunchbase.com/person/erik-rasmussen-2","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Safeguard Scientifics","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Apr 23 03:37:53 UTC 2010","updated_at":"Fri Apr 23 20:44:20 UTC 2010","overview":"<p>Erik works closely with Safeguard’s technology partner companies to provide operational and strategic support as well as market analysis and industry insight. He focuses on Internet/New Media, Software and Technology-enabled Services companies, and currently sits on the board of directors for Safeguard’s partner companies   Beyond.com   ,   MediaMath   and Swaptree.com.</p>\n\n<p>Before joining Safeguard in 2006, Erik was a partner at WWC Capital Group, LLC , an investment banking and venture capital firm. Erik joined WWC Capital in 2001 and managed WWC Capital’s venture capital investments. He targeted investments in a broad range of areas, including Internet/New Media, software and technology-enabled services. He led the Firm’s investments in DoublePositive, Lightningcast (acquired by AOL), Lighthammer (acquired by SAP), Sentori (acquired by MIND CTI), and ServiceBench, Inc. (acquired by NEW), and was involved with other WWC Capital investments including WeatherBug and First Equity Card.</p>\n\n<p>Erik came to WWC from The Aurora Funds , a venture capital fund based in Durham, NC. He managed Aurora’s Washington, DC office, focusing on Internet, software, and wireless investments. Erik had primary responsibility for several of Aurora’s most successful investments including Blackboard (Nasdaq: BBBB), DataFlux (acquired by SAS) and Accipiter (acquired by Engage). In addition, he served as a director or board observer for Mobile-Mind, InterAdNet, Vetcentric, Engenia and Alerts.com.</p>\n\n<p>Earlier, Erik was a Business Development manager for RISCManagement , a network and systems integrator whose customers included Fortune 500 companies. Prior to joining RISCManagement, Erik was a Product Manager for a line of TCP/IP products at Beame &amp; Whiteside Software, Inc., a private networking software company that was acquired by Hummingbird Communications, Ltd.</p>\n\n<p>Erik currently serves on the Board of Directors for the Mid-Atlantic Capital (MAC) Alliance, on the Steering Committee for the Mid-Atlantic Venture Association (MAVA) and was a Co-Chair for MAVA’s Capital Connection Venture Conference in 2009, one of the largest venture conferences on the East Coast. Erik earned a BA degree in Economics from Lake Forest College and an MBA from Boston College’s Carroll School of Management.</p>\n\n<p>EXPERIENCE</p>\n\n<pre><code>* WWC Capital Group, LLC  – Partner\n* Aurora Funds, Inc.   –  Principal\n* RISCManagement, Inc.  – Business Development Manager\n* Hummingbird Communications, Inc. – Business Development Manager\n* Beame &amp;amp; Whiteside Software, Inc. – Product Line Manager\n</code></pre>\n\n<p>BOARD MEMBER\nSafeguard Partner Companies</p>\n\n<pre><code>* Beyond.com, Inc.\n* MediaMath, Inc.\n* Swaptree, Inc.\n</code></pre>\n\n<p>EDUCATION</p>\n\n<pre><code>* BA, Economics – Lake Forest College\n* MBA – Carroll Graduate School of Management, Boston College\n</code></pre>","image":{"available_sizes":[[[108,150],"assets/images/resized/0008/4665/84665v2-max-150x150.jpg"],[[159,220],"assets/images/resized/0008/4665/84665v2-max-250x250.jpg"],[[159,220],"assets/images/resized/0008/4665/84665v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"VP and Managing Director, Technology Group","firm":{"name":"Safeguard Scientifics","permalink":"safeguard-scientifics","type_of_entity":"company","image":{"available_sizes":[[[150,31],"assets/images/resized/0006/7104/67104v3-max-150x150.jpg"],[[250,51],"assets/images/resized/0006/7104/67104v3-max-250x250.jpg"],[[450,93],"assets/images/resized/0006/7104/67104v3-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Principal","firm":{"name":"The Aurora Funds","permalink":"the-aurora-funds","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}