{"first_name":"Erik","last_name":"Hoffmann","permalink":"erik-hoffmann","crunchbase_url":"http://www.crunchbase.com/person/erik-hoffmann","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Mirror42","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Apr 16 12:27:12 UTC 2008","updated_at":"Thu Jul 22 00:00:08 UTC 2010","overview":"<p>Erik Hoffmann is co-founder of Mirror4 and responsible for all product development at Mirror42. Erik Hoffmann graduated in Computer Science with a minor in Business Administration from the University of Twente, The Netherlands. He has spent his professional career providing the vital role as software architect between product management and software engineering in corporate environments and (Internet) start-ups. Erik Hoffmann began his career as an software architect at Dutch software startup PROLIN Automation B.V.. PROLIN provided software applications to support IT processes based on ITIL. After the company was acquired by Hewlett-Packard in 1997 he focused on integrating PROLIN’s software into HP OpenView’s product portfolio. In 1999, seeking new career challenges a startup would provide, Erik Hoffmann co-founded Moonshake Technologies and served as CEO. Moonshake provides bespoke software engineering for Internet-enabled company critical solutions. With his knowledge of and interest in IT process management he joined Mirror42 to run research and product development.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP Products","firm":{"name":"Mirror42","permalink":"mirror42","type_of_entity":"company","image":{"available_sizes":[[[140,60],"assets/images/resized/0001/7381/17381v1-max-150x150.png"],[[140,60],"assets/images/resized/0001/7381/17381v1-max-250x250.png"],[[140,60],"assets/images/resized/0001/7381/17381v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}