{"first_name":"Ernest","last_name":"Orticerio","permalink":"ernest-orticerio","crunchbase_url":"http://www.crunchbase.com/person/ernest-orticerio","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Nov 18 14:29:06 UTC 2012","updated_at":"Sun Nov 18 14:31:36 UTC 2012","overview":"<p>Ernest Orticerio joined Quanterix in early 2012 as Vice President, Finance and Administration and Chief Financial Officer (CFO) to lead the company&#8217;s accounting, finance, treasury, human resources and procurement functions. He is also responsible for developing the Quanterix Capital profile as the company transitions to commercial operations. Mr. Orticerio has over 13 years of experience in the Life Sciences industry. Prior to joining Quanterix, he served in a number of accounting, finance and operations capacities with Millipore Corporation (a Life Science leader within Bioscience Research and Biopharmaceutical Manufacturing), most recently as Vice President, Finance, leading Global Operations Finance and International Finance. In addition to managing a number of critical organizational initiatives during his tenure with Millipore Corporation, Mr. Orticerio served as Controller for Latin America, and Vice President, Global Customer Service and Global Operations Strategy Development. Mr. Orticerio started his career with McDonald&#8217;s Corporation, holding a number of progressive accounting and finance positions supporting Operations, Marketing and Real Estate functions. He holds a BSBA from Bryant College.</p>","image":{"available_sizes":[[[129,150],"assets/images/resized/0022/0900/220900v1-max-150x150.png"],[[150,174],"assets/images/resized/0022/0900/220900v1-max-250x250.png"],[[150,174],"assets/images/resized/0022/0900/220900v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Vice President of Finance and Administration and CFO","firm":{"name":"Quanterix","permalink":"quanterix","type_of_entity":"company","image":{"available_sizes":[[[150,39],"assets/images/resized/0003/2397/32397v1-max-150x150.png"],[[250,66],"assets/images/resized/0003/2397/32397v1-max-250x250.png"],[[260,69],"assets/images/resized/0003/2397/32397v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}