{"first_name":"Erwin","last_name":"T. Allado","permalink":"erwin-t-allado","crunchbase_url":"http://www.crunchbase.com/person/erwin-t-allado","homepage_url":"http://www.seniorcarehomes.com","birthplace":"Santa Monica","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"SeniorCareHomes.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"senior-care","alias_list":null,"created_at":"Fri Aug 27 00:27:44 UTC 2010","updated_at":"Thu Feb 02 06:07:53 UTC 2012","overview":"<p>Erwin has been a corporate executive and entrepreneur with a proven track record building Internet companies and growing customer-service and product-related corporations. It all began in college when Erwin was Founding Father of a community service-based fraternity where he was elected the 1st Chapter President for a 2-year term. After college, Erwin joined PeopleSupport, Inc. (NASDAQ: PSPT), a California-based leading provider of customer care and business process outsourcing (BPO). He was promoted to Operations Supervisor after 3 weeks on the job and was later sent overseas to build-out PeopleSupport&#8217;s global operation.</p>\n\n<p>At the age of 21, Erwin was the Department Head of Customer Service Operations and played an intricate role in growing the center from approximately 20 to 400 employees. One of the primary responsibilities included transitioning over 20 U.S. accounts (leading Fortune 500 Companies such as GE Capital, Expedia, Nokia, Network Solutions/VeriSign, EarthLink) to the Asia center and supporting its growth in becoming profitable in the 1st year of operation.</p>\n\n<p>After his tenure at PeopleSupport, Erwin consulted directly for the CEO of Linksys (NASDAQ: CSCO) and was key in the build out of their customer care center in Asia. Erwin then returned to California where he switched careers in search of challenging himself and learning a completely different side of business. Erwin joined Beverly Hills Financial Group, a premier brokerage firm providing financing for major entertainment and sport celebrities. As Vice President, Erwin built his business from the ground up and achieved numerous accolades such as &#8220;Highest Gross Sales Revenue&#8221; since 2000, &#8220;Top Sales Producer&#8221; and &#8220;Hardest Worker&#8221; awards all in the same year.</p>\n\n<p>Born in Southern California, Erwin holds a Bachelor of Business Administration degree in Management Information Systems (MIS) from Loyola Marymount University. Erwin is married and is a proud father of 2 wonderful children. He is also a third-degree member of the Knights of Columbus, a global organization based on charity and service for others.</p>\n\n<p>Erwin has always had a deep respect for elders and a devotion to always take care of them in appreciation of how they raised him. SeniorCareHomes.com is a perfect fit for Erwin as he brings forth his experience and passion to give back to the community including the less fortunate.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"SeniorCareHomes.com","permalink":"la-dolce-living","type_of_entity":"company","image":{"available_sizes":[[[130,150],"assets/images/resized/0009/9539/99539v2-max-150x150.jpg"],[[217,250],"assets/images/resized/0009/9539/99539v2-max-250x250.jpg"],[[391,450],"assets/images/resized/0009/9539/99539v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}