{"first_name":"Eswar","last_name":"Mani","permalink":"eswar-mani","crunchbase_url":"http://www.crunchbase.com/person/eswar-mani","homepage_url":"http://www.eswar.net","birthplace":"Tokyo, Japan","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"masdar, cleantech, vc","alias_list":null,"created_at":"Wed May 19 10:03:37 UTC 2010","updated_at":"Thu May 17 17:31:41 UTC 2012","overview":"<p>Eswar Mani has been a part of the finance industry for over ten years with a specialization in M&amp;A, corporate finance, equity-linked structuring and private equity with deal experience in North America, Europe, Middle East and Asia.  Eswar is currently an Investment Manager in Masdar Capital tasked with analyzing investment opportunities globally in a wide variety of industries related to clean technologies, in addition to raising funds from Japanese investors.  Eswar was instrumental in raising capital for DB Masdar Clean Tech Fund from Development Bank of Japan, Mitsubishi Heavy Industries, Japan Bank for International Cooperation, JX Nippon Oil &amp; Energy Corporation and INPEX.</p>\n\n<p>Before joining Masdar Capital, Eswar consulted for the World Health Organization in reviewing commercial business sustainability of social entrepreneurs within the household water treatment systems supply chain in Sub-Saharan Africa.  The resulting best practices of his team’s report highlighted the importance of strategic relationships with local experts and trusted organizations, a deep market understanding, customer education and smart inventory practices.  Eswar has also spoken at various industry events on emerging fund structures in clean technology and renewable energy power generation.</p>\n\n<p>Previously, Eswar was a Senior Associate in the equity-linked origination team at Credit Suisse, where he managed firm’s daily equity-linked pricing and structuring needs for European, Middle Eastern, Russian and Japanese issuers.  Key transaction experience include the origination, structuring and execution of the €2bn Mandatory Convertible Offering for Bayer AG, €825m Weather Investments Collateralized Going Public Exchangeable into Orascom, National Bank of Abu Dhabi Private Placement Convertible Bond and €250m Credit Suisse Exchangeable Bond into Q-Cells.</p>\n\n<p>Eswar holds an M.B.A. from M.I.T. Sloan School of Management, where he was a Henry J. Ford Scholar and has a B.Sc. dual degree in Philosophy and Economics from the London School of Economics and.  At MIT, Eswar was a teaching assistant for the Lab for Sustainability (S-Lab) course and an organizer of the MIT Energy Conference.  Eswar has spent over 20 years in Japan and has native fluency in Japanese.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0008/7729/87729v2-max-150x150.jpg"],[[200,250],"assets/images/resized/0008/7729/87729v2-max-250x250.jpg"],[[360,450],"assets/images/resized/0008/7729/87729v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"Sustainability","institution":"MIT Sloan","graduated_year":2008,"graduated_month":null,"graduated_day":null},{"degree_type":"BSc","subject":"Philosophy & Economics","institution":"London School of Economics","graduated_year":2001,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}