{"first_name":"Ethan","last_name":"Zweig","permalink":"ethan-zweig","crunchbase_url":"http://www.crunchbase.com/person/ethan-zweig","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Mar 19 03:18:52 UTC 2008","updated_at":"Fri May 13 14:37:14 UTC 2011","overview":"<p>Ethan Zweig is a Managing Director of Credit Suisse in the Technology M&amp;A group, based in San Francisco. Mr. Zweig first joined Credit Suisse in 1998 and has advised both multi-national and domestic clients on numerous complex M&amp;A assignments including mergers, acquisitions, divestitures, reverse IPO&#8217;s, spin-offs, joint ventures, significant equity investments (governance issues), special committee assignments, proxy contests and hostile transactions.</p>\n\n<p>Mr. Zweig has advised companies such as Adva, Alcatel, Ameritrade, Bankrate, Blackboard, Chromatis Networks, Consorte Media, Concur Technologies, Cyras Systems, DataChannel, DoubleClick, EarthLink Networks, Efficient Networks, Focus Media, Google, iNest, InfoSpace, Island ECN, JAMDAT Mobile, Kintana Software, Laurel Networks, Next Level Communications, Numerical Technologies, Onetime, Orbitz, Openwave, Pixar, Priceline, Siara, Skillsoft, Smartforce, Ticketmaster, Trillium Software, UT Starcom, VirtualTourist, Vista Equity Partners, Vivace Networks, and Zhone Technologies</p>\n\n<p>Mr. Zweig graduated Magna Cum Laude from Washington University with degrees in Political Science and Finance. </p>","image":{"available_sizes":[[[90,90],"assets/images/resized/0001/5947/15947v1-max-150x150.jpg"],[[90,90],"assets/images/resized/0001/5947/15947v1-max-250x250.jpg"],[[90,90],"assets/images/resized/0001/5947/15947v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"Political Science and Finance","institution":"Washington University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}