{"first_name":"Eugene","last_name":"Shatsman","permalink":"eugene-shatsman","crunchbase_url":"http://www.crunchbase.com/person/eugene-shatsman","homepage_url":"http://eugeneshatsman.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"National Strategic Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"eugene-shatsman-business-marketing-consulting-management-small-business-national-strategic-wickliffe-cleveland-ohio","alias_list":null,"created_at":"Thu Sep 20 18:18:45 UTC 2012","updated_at":"Tue Sep 25 02:34:46 UTC 2012","overview":"<p>Eugene Shatsman is well known for creative and engaging strategies. </p>\n\n<p>Eugene acquired his first residential property while attending attending the University of Michigan, Ann Arbor. Between classes and work, he was able to make the property profitable within 90 days and his residential company quickly gained a waiting list of tenants (a practically unheard-of circumstance in the Ann Arbor market).  After a few short years, he helped other investors with his methods and he started managing and consulting other real estate transactions. He eventually ventured into the world of sales and marketing consulting.</p>\n\n<p>Eugene’s education at the University of Michigan, Ann Arbor centered on consumer behavior.  Thus, he acquired a keen understanding of the subtle market forces, and psychological and emotional phenomena that drive people to shun some products while gravitating to others.</p>\n\n<p>At National Strategic, he oversees client management and the services division. He also is a key contributor in the National Strategic Education Division which helps small business owners understand how to become strategic marketers. He helps clients discover profitable pursuits while constantly optimizing every piece of marketing.</p>\n\n<p>Eugene is a published contributor to publications such as Cleveland Society Magazine, and a highly sought-after speaker with top-ratings from the likes of Council of Small Enterprises, Lakeland Business Education, and Small Business Development Centers of Ohio.</p>\n\n<p>To book Eugene for a speaking engagement, email archie@nationalstrategic.com.</p>","image":{"available_sizes":[[[123,150],"assets/images/resized/0021/2283/212283v2-max-150x150.jpg"],[[204,247],"assets/images/resized/0021/2283/212283v2-max-250x250.jpg"],[[204,247],"assets/images/resized/0021/2283/212283v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Partner and Business Growth and Marketing Consultant ","firm":{"name":"National Strategic Group","permalink":"national-strategic-group","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.linkedin.com/in/eugeneshatsman","title":"Linkedin Profile"},{"external_url":"http://eugeneshatsman.com/","title":"Homepage"},{"external_url":"http://nationalstrategic.com/","title":"National Strategic Group"}],"web_presences":[]}