{"first_name":"Eugene","last_name":"Seymour","permalink":"eugene-seymour","crunchbase_url":"http://www.crunchbase.com/person/eugene-seymour","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Apr 21 04:07:52 UTC 2011","updated_at":"Thu Apr 21 04:10:36 UTC 2011","overview":"<p>Dr. Eugene Seymour began practicing medicine in Los Angeles/ Beverly Hills in the late 1960&#8217;s. In late 1981, he began treating patients with a strange new disease affecting primarily the gay population. In 1986, he was requested by the US government to establish a testing laboratory and run a large-scale surveillance program for HIV prevalence in the Hispanic population in Los Angeles. His laboratory ended up testing over 50,000 people. Because of his belief that prevention, in the absence of a cure, was critical to stem the rising tide of HIV infections, he founded a company, now called Stat-Sure, Inc, in 1989. He raised the capital and oversaw the development of a rapid HIV antibody blood test (Hema-Strip). In 1993, as Chief Executive Officer, he took the company public as a NASDAQ company. Under his direction, the company conducted research studies in Africa, Asia, South and North America. The Hema-Strip was approved in a number of countries including Canada, Great Britain and Vietnam. Dr. Seymour left the company in 1996 to run a non-profit foundation, which funded both testing and training programs for health workers in Asia and Africa. He became a consultant to the UN Global Program on AIDS and was sent to a number of different countries, (Lithuania, Latvia, Estonia and Russia) to interact with local physicians and assist them in setting up testing programs. Two years later, he became Director of Strategic Alliances at a medical education startup called medschool.com that was later acquired by a group of investors.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Executive Officer","firm":{"name":"NanoViricides","permalink":"nanoviricides","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0013/1440/131440v1-max-150x150.jpg"],[[231,70],"assets/images/resized/0013/1440/131440v1-max-250x250.jpg"],[[231,70],"assets/images/resized/0013/1440/131440v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}