{"first_name":"Eugene","last_name":"Yoo","permalink":"eugene-yoo","crunchbase_url":"http://www.crunchbase.com/person/eugene-yoo","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 06 00:26:18 UTC 2009","updated_at":"Fri Nov 06 00:28:07 UTC 2009","overview":"<p>Eugene Yoo is the Vice President of Globespan Capital Partners.   Eugene focuses on investments in Communications, Internet/Infrastructure, and Systems and Peripherals.  Based in Palo Alto, he also leads the firm&#8217;s effort to help portfolio companies expand their businesses into Korea. </p>\n\n<p>Eugene is board member of Challenge Games, Nurien Software, Strata8 and Wirefree Partners.  He is also currently a board observer of Amalfi, Analogix, Hatteras Networks, Quartics, and Sonics. </p>\n\n<p>Prior to joining Globespan, Eugene was in the Corporate Development Group at <a href=\"/company/cisco\" title=\"Cisco Systems\" rel=\"nofollow\">Cisco Systems</a> where he focused on venture investments and acquisitions in the video, consumer, wireless and optics markets.  Eugene also worked on strategic planning for emerging businesses within Cisco and as a product manager in the Metro Ethernet business unit. </p>\n\n<p>Prior to Cisco, Eugene worked for Mercer Management Consulting and spent time at a number of Internet start-ups. </p>\n\n<p>At the start of his career, Eugene worked for US Cellular as a Network Engineer, helping to build the first CDMA wireless network in his hometown of Chicago. While driving around and testing the new network&#8217;s coverage and climbing on rooftops and up towers to fix gaps - much like the now-famous &#8220;can you hear me now&#8221; guy.  Eugene learned a lesson that guides him everyday as he works with the firm&#8217;s entrepreneurs. He realized then that regardless of how innovative it may be, to &#8220;never lose sight of the fact that behind any new technology are people - developers, implementers, and evangelists - who ultimately decide its success or failure.&#8221;</p>\n\n<p>Eugene builds relationships with the firm&#8217;s entrepreneurs based on &#8220;a shared vision and team work.&#8221; He observes that &#8220;while we work together to achieve successful outcomes, often it is more accurate to say that we work for the entrepreneurs to ensure that they are well-equipped to take on the challenges that lie ahead.&#8221; He enjoys working with &#8220;highly motivated entrepreneurs, co-workers and partners who are not satisfied with the status quo.&#8221;</p>\n\n<p>Eugene earned a Bachelor of Science degree in Mathematical and Computational Science, with honors, from Stanford University and holds an MBA from the Wharton School of the University of Pennsylvania. He serves as the Vice President of the Korean IT Network (KIN).  Eugene is striving to play bogey golf and for semi-proficiency in foreign languages.</p>","image":{"available_sizes":[[[75,100],"assets/images/resized/0006/5124/65124v1-max-150x150.png"],[[75,100],"assets/images/resized/0006/5124/65124v1-max-250x250.png"],[[75,100],"assets/images/resized/0006/5124/65124v1-max-450x450.png"]],"attribution":"<p>Globspan Capital Partners</p>"},"degrees":[],"relationships":[{"is_past":true,"title":"Vice President","firm":{"name":"Globespan Capital Partners","permalink":"globespan-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,47],"assets/images/resized/0001/9343/19343v8-max-150x150.jpg"],[[250,79],"assets/images/resized/0001/9343/19343v8-max-250x250.jpg"],[[450,142],"assets/images/resized/0001/9343/19343v8-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Corporate Development","firm":{"name":"Cisco","permalink":"cisco","type_of_entity":"company","image":{"available_sizes":[[[110,73],"assets/images/resized/0001/8309/18309v6-max-150x150.png"],[[110,73],"assets/images/resized/0001/8309/18309v6-max-250x250.png"],[[110,73],"assets/images/resized/0001/8309/18309v6-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}