{"first_name":"Evan","last_name":"Walker","permalink":"evan-walker","crunchbase_url":"http://www.crunchbase.com/person/evan-walker","homepage_url":"http://www.fusionpmg.com","birthplace":"United States","twitter_username":"evanwalker","blog_url":"","blog_feed_url":"","affiliation_name":"Fusion PMG","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 01 02:23:13 UTC 2012","updated_at":"Sat Aug 04 14:02:17 UTC 2012","overview":"<p>Evan is the founder and CEO of the W Group, a digital media company doing business in the areas of social commerce, online advertising, and celebrity endorsed products.</p>\n\n<p>BIO\nEvan Walker started his first company “Netsoft” at age 15 with a computer and $1,000. With a lot of hard work (and “great timing” he says), Netsoft went on to become a multi-million dollar business within 3 years. Evan sold Netsoft in 1999 at age 19 to pursue other passions. </p>\n\n<p>Having spent some time on the runway as a professional model, Evan saw an opportunity to create a high profile model management company in 2003, placing models around the globe in eventually over 20 cities. </p>\n\n<p>With the success of the agency, an additional company was created to bring more of an international modeling presence in smaller city markets. The new company grew 800% in the first year and reached million dollar revenues within months. Evan then led both talent companies through a major partnership with one of the biggest modeling agency networks in the world. </p>\n\n<p>The W Group now consists of a digital media network, celebrity endorsed products, social commerce, and health &amp; beauty products sold internationally. </p>\n\n<p>Evan is also involved in charity and community service projects and founded The W Group’s charity division (W1). He has served on the board of Operation Smile, an international charity working in over 40 countries. He is among the youngest recipients of the Utah Business Magazine “Top 40 Under 40 Business Award”. Evan is also a frequent featured guest speaker at many youth oriented entrepreneurship seminars, including YEA (Young Entrepreneurs of America) amongst several others.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0020/3819/203819v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0020/3819/203819v2-max-250x250.jpg"],[[450,450],"assets/images/resized/0020/3819/203819v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Fusion PMG","permalink":"fusion-pmg","type_of_entity":"company","image":{"available_sizes":[[[150,30],"assets/images/resized/0020/6297/206297v2-max-150x150.jpg"],[[250,51],"assets/images/resized/0020/6297/206297v2-max-250x250.jpg"],[[450,91],"assets/images/resized/0020/6297/206297v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/evanwalker","title":"Linkedin"},{"external_url":"http://www.twitter.com/evanwalker","title":"Twitter"}]}