{"first_name":"Evan","last_name":"Neufeld","permalink":"evan-neufeld","crunchbase_url":"http://www.crunchbase.com/person/evan-neufeld","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jan 25 22:27:07 UTC 2010","updated_at":"Fri May 04 01:53:15 UTC 2012","overview":"<p>Evan Neufeld is the VP of Marketing at Ground Truth.</p>\n\n<p>Evan Neufeld is a well-respected analyst in the fields of mobile, new media and interactive marketing. Neufeld’s experience includes senior-level roles at comScore, M:Metrics, NPD Techworld and Jupiter Research, where he was a founding analyst of Jupiter’s well-known digital advertising research practice.</p>\n\n<p>Evan was most recently Vice President and Senior Analyst at comScore Mobile (formerly M:Metrics), where he oversaw comScore’s products and services focused on mobile advertising and marketing, including the areas of effectiveness, placement and planning.</p>\n\n<p>Earlier, Evan was vice president of industry analysis at NPDTechworld. There, he focused on developing advisory services analyzing technological convergence and its impact on key consumer and business sectors for clients such as AOL, Sony and Hewlett-Packard.</p>\n\n<p>Beginning in 1996, Neufeld was part of the research and management team at Jupiter Research, most recently as senior vice president of global research. In that role he managed Jupiter’s research charter for marketing and media, industries, international research and overseeing all research operations. Neufeld was a founding analyst of Jupiter’s well-known digital advertising research practice, where he was both a senior analyst and practice director. In this capacity, he developed the first online advertising forecasts and analysis anywhere.</p>\n\n<p>Before Jupiter, Evan was a principal analyst at WebTrack, covering the first developments in interactive advertising and marketing, as well as holding a variety of marketing positions in the publishing industry. He has been quoted in major media outlets such as The New York Times, Business Week, The Wall Street Journal, Ad Age, Media Week and CNET, and has appeared on CNBC, Wall Street Week and ABC News. Evan is an active participant in industry associations such as the MMA and IAB, and is a member of ad:tech’s advisory board.</p>\n\n<p>Evan has a master’s degree in American studies from New York University and a bachelor’s degree in English from Vassar College.</p>","image":{"available_sizes":[[[116,150],"assets/images/resized/0007/4803/74803v1-max-150x150.jpg"],[[140,180],"assets/images/resized/0007/4803/74803v1-max-250x250.jpg"],[[140,180],"assets/images/resized/0007/4803/74803v1-max-450x450.jpg"]],"attribution":"<p>Ground Truth</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"CMO","firm":{"name":"Ground Truth","permalink":"ground-truth","type_of_entity":"company","image":{"available_sizes":[[[150,51],"assets/images/resized/0007/4796/74796v2-max-150x150.jpg"],[[150,51],"assets/images/resized/0007/4796/74796v2-max-250x250.jpg"],[[150,51],"assets/images/resized/0007/4796/74796v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}