{"first_name":"Evgeny","last_name":"Morozov","permalink":"evgeny-morozov-3","crunchbase_url":"http://www.crunchbase.com/person/evgeny-morozov-3","homepage_url":"http://www.evgenymorozov.com","birthplace":"","twitter_username":"","blog_url":"http://www.evgenymorozov.com/blog","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Tue Jan 11 18:20:21 UTC 2011","updated_at":"Fri Jul 08 20:22:25 UTC 2011","overview":"<p>Evgeny Morozov is a Belarus-born researcher and blogger who works on the political effects of the internet. Morozov expresses skepticism about the Internet&#8217;s ability to provoke change in authoritarian regimes, believing it is also a powerful conduit for authoritarian and nationalist ideas.[1]\nHe is visiting scholar at Stanford University,[2] a fellow at the New America Foundation, and a contributing editor of and blogger for Foreign Policy magazine, for which he writes the blog Net Effect. He has previously been a Yahoo! fellow at Georgetown University&#8217;s Walsh School of Foreign Service, a fellow at the Open Society Institute, director of new media at the NGO Transitions Online, and a columnist for the Russian newspaper Akzia.\nHis writings have appeared in various newspapers and magazines around the world, including The Economist, Newsweek International, International Herald Tribune, Boston Review, Slate, and the San Francisco Chronicle.[3] He has been chosen as a TED fellow where he spoke about how the Web influences civic engagement and regime stability in authoritarian, closed societies or in countries &#8220;in transition.&#8221;[4] He is a critic of the impact of the internet and other technologies in bringing about social or political change, sometimes even aiding dictatorships.[5]\nHis ideas are reflected in the book The Net Delusion: The Dark Side of Internet Freedom, published in January 2011.</p>","image":{"available_sizes":[[[150,120],"assets/images/resized/0011/6870/116870v1-max-150x150.jpg"],[[250,200],"assets/images/resized/0011/6870/116870v1-max-250x250.jpg"],[[300,241],"assets/images/resized/0011/6870/116870v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder/Publisher","firm":{"name":"Polymeme","permalink":"polymeme","type_of_entity":"company","image":{"available_sizes":[[[150,25],"assets/images/resized/0002/1487/21487v4-max-150x150.png"],[[250,41],"assets/images/resized/0002/1487/21487v4-max-250x250.png"],[[317,53],"assets/images/resized/0002/1487/21487v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}