{"first_name":"Eyal","last_name":"Gever","permalink":"eyal-gever","crunchbase_url":"http://www.crunchbase.com/person/eyal-gever","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Gizmoz","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jun 01 19:36:48 UTC 2007","updated_at":"Wed Jun 08 13:59:02 UTC 2011","overview":"<p>Eyal is dedicated to leading the convergence of technology and art. Having earned his reputation in the high-tech industry as a visionary, Eyal has received numerous awards for his innovation in multimedia design and technology. Gever is frequently invited to speak at leading industry events, and has been featured many times in the press, including the cover of the Red Herring, articles in Wall Street Journal, Newsweek, appearances on CNNfn and others.</p>\n\n<p>Eyal Gever attended Jerusalem&#8217;s renowned Betzalel Academy of the Art and Design.</p>\n\n<p>Eyal has over a 19 years experience implementing his design ideas into web-based products, primarily in the area of interactive real time multimedia communication software as well as 3D design and animation.</p>\n\n<p>Eyal had founded and was the CEO of few technology companies - Zapa Digital Arts, Gizmoz and Co founded Daz3D after the merger of Daz3D and Gizmoz in January 2010.</p>\n\n<p>Eyal has 8 patents and hundreds of claims in Internet\nmultimedia technologies as well as in 3D computer graphics animation, design and transmission of rich media.</p>\n\n<p>Since September 2010 Eyal focus only on creating his art.</p>\n\n<p>Companies Background:</p>\n\n<p>Daz3D (Board Memebr)\nPrivately Held; Animation industry\nJanuary 2010 – Present</p>\n\n<p>Co Founder and President Daz3D\nPrivately Held; Animation industry\nJanuary 2010 – September 2010 (9 months)</p>\n\n<p>On December 16, 2009 DAZ 3D and Gizmoz Merge to Become Premier Publisher of Personalized 3D Characters, Software and Accessories.</p>\n\n<p>Seizing the opportunity to meet the increasing and diversified expectations of the virtual goods market, DAZ 3D and Gizmoz announced a merger that will create the foremost online marketplace for high-quality and inter-compatible digital characters and accessories. With the largest community of active digital character artists, the merged company will allow users to experience personalized digital goods and identities across any platform.</p>\n\n<p>The combination of Gizmoz&#8217;s consumer-friendly, photo-realistic head reconstruction and online personalization service with DAZ 3D&#8217;s sophisticated full-figure content, desktop software tools and thriving community will provide creative professionals, gamers and consumers alike with a substantially more expansive virtual goods design center and marketplace.</p>\n\n<p>DAZ 3D, developers of renowned 3D software and highly supported 3D content, and Gizmoz, the leader in 3D face detection, mapping, and manipulation technology, have merged to form a new company that will deliver the highest-quality personalized 3D digital characters, accessories and environments ever assembled. The new company will allow users to experience their digital goods and identities in the platform of their choice by combining ultra-realistic interoperable 3D characters and avatars with easy-to-use tools that are perfect for gamers, consumers, and creative professionals.</p>\n\n<p>Founder and CEO Gizmoz\nPrivately Held; Internet industry\nAugust 2003 – August 2010 (7 years 1 month)</p>\n\n<p>Founded in 2003, Gizmoz has developed proprietary patented 3D and animation technology to let users express themselves by creating realistic 3D characters made from a single face photo. Gizmoz is the leader in 3D face-mapping technology, face manipulation and automatic face detection with several patents and pending patents in this field. Gizmoz provides a central service to design, manage and transport digital avatars that can be deployed in virtual worlds, online games, PC and console 3D games, social networks, video clips, greeting cards, mobile apps, as well as professional modeling and animation tools.</p>\n\n<p>Founder and CEO Zapa Digital Arts\nInternet industry\n1993 – August 2002 (9 years)</p>\n\n<p>About Zapa Digital Arts, Ltd.\nZapa Digital Arts, develops visual communication solutions consisting of complementary authoring environments and servers based on proprietary Java and 3D technologies. Founded in 1993, (In 94 Yossi Amossy joined Eyal as Co founder). Zapa has emerged as an industry leader in its efforts to fuse art and technology. Skilled technology and creative design teams work in unison to produce unique, innovative visual communications solutions for the rapidly developing Internet marketplace.</p>\n\n<p>Education\nBezalel Academy of Art and Design</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Spankin'Apps","permalink":"spankinapps","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0006/6530/66530v2-max-150x150.png"],[[250,83],"assets/images/resized/0006/6530/66530v2-max-250x250.png"],[[450,150],"assets/images/resized/0006/6530/66530v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Board member","firm":{"name":"Daz3D post merger","permalink":"daz3d-post-merger","type_of_entity":"company","image":null}},{"is_past":true,"title":"Co founder and President","firm":{"name":"Daz3D|Gizmoz (merger)","permalink":"daz3d-gizmoz-merger","type_of_entity":"company","image":null}},{"is_past":true,"title":"CEO & Founder","firm":{"name":"Gizmoz","permalink":"gizmoz","type_of_entity":"company","image":{"available_sizes":[[[150,55],"assets/images/resized/0000/3031/3031v12-max-150x150.png"],[[200,74],"assets/images/resized/0000/3031/3031v12-max-250x250.png"],[[200,74],"assets/images/resized/0000/3031/3031v12-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Founder and CEO","firm":{"name":"Zapa Digital Arts","permalink":"zapa-digital-arts","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}