{"first_name":"F.","last_name":"Carl Grumet","permalink":"f-carl-grumet","crunchbase_url":"http://www.crunchbase.com/person/f-carl-grumet","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 22 10:01:12 UTC 2009","updated_at":"Mon Jun 22 10:03:03 UTC 2009","overview":"<p>Dr. Grumet is Emeritus Professor of Pathology and Emeritus Director Stanford Histocompatibility Laboratory, Stanford University. He earned his M.D. at the University of Pennsylvania in 1965 and received his postgraduate clinical and research training at Stanford and the N.I.H.. Shortly after joining the Stanford Medical School Faculty in 1972, he founded the Stanford University Blood Center and the Stanford University Hospital Transfusion Service and served as the first Director of Stanford&#8217;s Specialized Center of Research in Transfusion Medicine. He and the late Professor Rose Payne co-directed the Stanford Histocompatibility Laboratory for two decades until her retirement in 1990; thereafter Dr. Grumet was sole Director until his retirement from clinical responsibilities in 2006. He has over 160 scientific research publications to his credit and has served on the editorial boards of several scientific journals in the field of transplant immunology. Included among Dr. Grumet&#8217;s professional activities has been his membership on numerous councils, boards, and committees in the field of solid organ and stem cell transplantation. Outside of academia, he has also served as a scientific consultant to the International Atomic Energy Agency of the U.N. and several life science companies including Cetus and Sangsat, and he was a co-founder of both Cetus Immune Inc and of Genelabs Technologies Inc.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Linkage Biosciences","permalink":"linkage-biosciences","type_of_entity":"company","image":{"available_sizes":[[[150,54],"assets/images/resized/0005/0073/50073v1-max-150x150.jpg"],[[191,70],"assets/images/resized/0005/0073/50073v1-max-250x250.jpg"],[[191,70],"assets/images/resized/0005/0073/50073v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}