{"first_name":"Fadi Ali","last_name":"Ghandour","permalink":"fadi-ali-ghandour","crunchbase_url":"http://www.crunchbase.com/person/fadi-ali-ghandour","homepage_url":"","birthplace":"Beirut, Lebanon","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1959,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Thu Sep 16 00:24:46 UTC 2010","updated_at":"Wed Sep 22 23:41:36 UTC 2010","overview":"<p>Fadi Ali Ghandour is an entrepreneur mostly known for being the founder and CEO of Aramex, one of the global logistics and transportation providers. Ghandour co-founded Aramex in Amman, Jordan and has served as CEO since then. Aramex was the first company from the Arab world to go public on the NASDAQ stock exchange. The company now trades on the Dubai Financial Market.</p>\n\n<p>Ghandour is a Founding Partner of Maktoob.com, the world’s largest Arab online community. Maktoob was acquired by Yahoo! in 2010. Ghandour is also a member of the Board of Abraaj Capital, the largest private equity firm in the Middle East and South Asia, is a Founding Board Member of Endeavor Jordan, and serves on the Advisory Board of the Suliman S. Olayan School of Business at the American University of Beirut. He is also a member of the board of Al Faisaliah Group, a leading business conglomerate in Saudi Arabia, Chairman of the Board of Brinks Jordan, and Abercrombie &amp; Kent Jordan. Between 2003 and 2005, he was the Middle East and North Africa Area Chairman of the Young Presidents&#8217; Organization.</p>\n\n<p>Ghandour is passionate about social entrepreneurship. He is the founder of Ruwwad for Development, a regional private sector-led community empowerment initiative that helps disadvantaged communities overcome marginalization through youth activism, civic engagement and education. He serves as a Member of the Board of Business for Social Responsibility, and is a Member of the Board of the National Microfinance Bank in Jordan. He has also served as Vice Chair of the Board of Trustees of the Jordan River Foundation for over 10 years.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0010/1922/101922v1-max-150x150.jpg"],[[166,250],"assets/images/resized/0010/1922/101922v1-max-250x250.jpg"],[[220,331],"assets/images/resized/0010/1922/101922v1-max-450x450.jpg"]],"attribution":"<p>Joi Ito</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}