{"first_name":"Fadly","last_name":"Novryansyah","permalink":"fadly-novryansyah","crunchbase_url":"http://www.crunchbase.com/person/fadly-novryansyah","homepage_url":"","birthplace":"Jakarta","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1991,"born_month":11,"born_day":22,"tag_list":"volunteer, children, thailand, kids, help","alias_list":null,"created_at":"Thu Jul 29 12:56:41 UTC 2010","updated_at":"Thu Jul 29 22:58:07 UTC 2010","overview":"<p>Volunteer to help children in Thailand</p>\n\n<p>The International Humanity Foundation is looking for work-study volunteers to manage our orphanage in Chiang Rai, Thailand, and be friends and teachers to our children. By bringing together disadvantaged children of Thailand and volunteers from across the world, there is a learning opportunity for both. As both sides discover more about each other, their lives and their cultures and go on to teach their own friends what they learned in this exchange, we hope to create a world of greater understanding and compassion.</p>\n\n<p>Our Thailand centre works especially with the hill tribes, the indigenous people who live in the tumultuous borderlands between Thailand, Myanmar (Burma) and Laos and as far as China and Vietnam. The hill tribes in northern Thailand face many challenges, and it is part of our mission to arm our children with the skills, attitudes and knowledge that they will need to have equal opportunities in their future like other Thai citizens. The children at our centre are from the Lahu and Akha tribes.</p>\n\n<p>Work</p>\n\n<p>IHF needs people with all skills. No matter your experience, whether a student or retired professional, IHF needs you. At the centre, work-study volunteers divide their time between playing with and teaching the children and working on international projects . The centre host English, computer and math classes, and the children often seek tutoring for their homework, all tasks which work-study volunteers take part in.</p>\n\n<p>The IHF work study program is an intensive learning experience.  It provides you with the opportunity to gain hands-on experience working with an international non-profit and in myriad scenes of poverty.  All volunteers participate on one or more of our international task teams such as university relations, photography and child watch. To qualify to serve at a centre, volunteers must complete 12 hours of work on one of the teams, and they continue to participate on the team once at the centre. In the rare case where you lack the ability to complete these hours but possess certain trade skills in agriculture, construction or others needed at one of our centres, you may be exempt from these pre-trip hours. If this is the case, be sure to immediately get in contact with the centre director to discuss your situation and possible alternative tasks.</p>\n\n<p>It is important to note that these are intensive experiences.  Even before your arrival at the center, you must work 12 hours on international tasks to demonstrate your work ethic.  Once at the center, IHF requires its work-study volunteers to work eight hours a day on at-center and international tasks, six day a week.  There is time to sightsee and tour the nation, but work is always the first priority.  IHF depends on its volunteers to function and to love the children.  If you are not prepared to devote this time to work, you should look elsewhere for your service experience.</p>\n\n<p>All work-study volunteers will be on probation for their first week at the center.  During this time you will be evaluated by the children. If you are deemed abusive or not safe or the children are fearful for any reason, you will be asked to leave. This does not happen often but sadly has had to be implemented to protect the children.</p>\n\n<p>Upon the completion of your term of service at the center, you will receive an IHF Certificate of Graduation from our CEO, Carol Sasaki.  The certificate will detail your work and experiences while at the center and grade your performance.</p>\n\n<p>Cost: IHF is committed to offering a flexible, affordable service experience. Upon acceptance as a work-study volunteer, you will be required to pay a non-refundable deposit of USD $75 which will be credited toward your weekly fee upon arrival.  Once at the center, work-study volunteers pay only USD $75 per week for the first four weeks, USD $55 per week for the fifth through twelfth weeks, and nothing from the thirteenth week on.  These costs are to cover and room and board, both very simple.</p>\n\n<p>Volunteer Type: Building schools, community development, childcare/children, culture, curriculum planning, disability issues, economic development education, English teaching, health, health care, health education, homelessness, hospital, housing, human rights, literacy, marketing, medicine, nutrition, orphans, popular education, primary education, street kids, teaching, women, water, writing, youth, youth development, academic reinforcement, AIDS/HIV, appropriate technology</p>\n\n<p>Typical Volunteer: Our volunteers have a passion for immersion in foreign cultures, an openness to new experiences and flexible approach to work. At our centres they will work with local staff and directly with the local population in conditions very different from the Western world. Special projects constantly arise, from moving food during famine feeds to monitoring children during breaks. Our volunteers have a lot of say in what they do and designing projects as long as it is approved by the director and promotes the mission of IHF.</p>\n\n<p>Available To Participants: World wide</p>\n\n<p>Typical Living Arrangement: Group living</p>\n\n<p>Participants Travel: Independently</p>\n\n<p>Typically Participants Work: Independently or in groups, depending on site</p>\n\n<p>Application Requires: Resume, online application</p>\n\n<p>Qualifications:</p>\n\n<p>Before beginning to serve at a center, all work-study volunteers are required to complete 12 hours of online work with our international task teams such as Community Outreach, Fundraising and Photography.</p>\n\n<p>Volunteers with IHF must speak English fluently and have a great attitude. They must also be mature, responsible, team players, fast learners, flexible and interested in global change through education and service.</p>\n\n<p>Most importantly, our volunteers must have an open heart and a willingness to help others and a passion to make a difference!</p>\n\n<p>Mission Statement:</p>\n\n<p>IHF focuses on educating and feeding children who come from the most marginalized and disadvantaged backgrounds. IHF has set up orphanages in Kenya, Indonesia and Thailand. We seek to provide a way for children to get an education that they desperately desire and are not able to receive. By educating and teaching these children that they are significant and competent, we also teach them that everyone has a voice that matters. IHF promotes self-sufficiency in the communities we work in, primarily focusing on the education, nutrition, and care of children. IHF encourages understanding and caring between people of all nations and religions in order to better prepare the leaders of future generations. We believe that by promoting communication and understanding between students from the poorest of the poor and students in America, we will all be better educated by this exchange. We desire for every student in the United States to have communication with students abroad who are different both culturally and socioeconomically, in order for all students to be educated about the world they live in.</p>\n\n<p>Please visit www.ihfonline.org or send us an email at volunteering@ihfonline.org if you want to learn more or have questions about volunteering with IHF.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}