{"first_name":"Fahad","last_name":"Khan","permalink":"fahad-khan","crunchbase_url":"http://www.crunchbase.com/person/fahad-khan","homepage_url":"http://www.linkedin.com/in/fahad","birthplace":"","twitter_username":"fahadkhan","blog_url":"","blog_feed_url":"","affiliation_name":"Telephony Media","born_year":1981,"born_month":7,"born_day":18,"tag_list":"fahad, fahad-khan, organic-spread, gotham, gotham-innovation, telephony-media, chalmers","alias_list":null,"created_at":"Sat Jul 09 18:51:11 UTC 2011","updated_at":"Wed Jan 18 00:00:33 UTC 2012","overview":"<p>Fahad Khan is a successful serial entrepreneur driven by a set of larger-than-life ambitions and goals and an abiding desire to understand how the world works. </p>\n\n<p>Fahad is the Founder &amp; CEO of One Public. He conceived and founded the company in October of 2007, at a Facebook Developer Garage in New York City, roughly a month after he immigrated to United States from Pakistan. He bootstrapped the company from his apartment with few hundred dollars.   </p>\n\n<p>In 2009, Fahad secured first external investment in One Public to fuel growth. One Public has grown to become one of the largest Facebook Preferred Developer Consultants (PDC) in the world and a Facebook Ads API vendor. It employs an all-star team of 60+ full-time employees, works with major brands, agencies, publishers, and retailers in almost every category and has a few million dollars in revenues. Fahad is at helm of the company’s overall vision, mission, strategic direction and product development.   </p>\n\n<p>In 2008, Fahad also founded a small pure-play mobile design and engineering services company, Telephony Media. Telephony’s most significant client projects include iOS apps and software interface engineering for an external iOS device, iGrill, which won the Bluetooth SIG Best New Product Award at CES 2011. </p>\n\n<p>An aspiring venture capitalist, Fahad is the Managing Partner of Gotham Innovation, a  global venture capital and innovation syndicate investing in and incubating international new ventures (Oviatt &amp; McDougall, 1994) fostering the born global phenomenon (McKinsey &amp; Company, 1993). </p>\n\n<p>Before immigrating to United States, Fahad headed up WiMAX telephony product development division at a multi-billion-dollar Abu Dhabi Group backed telecommunication venture, spread across MENA. He was part of the core team that launched the world’s first and largest 4G Mobile WiMAX (802.16e) network, with Motorola, Inc. In his early career, at the age of 21, he grew a New York based telecom startup from 15 to 100+ employees in less than a year. He was responsible for starting, scaling, growing and managing multi-country captive BPO operations for telecom providers based in New York and Florida. </p>\n\n<p>Fahad went to Sweden to pursue his education. A scholarly expert in the area of International Entrepreneurship, Fahad holds M.Sc. Engineering degree in Management and Economics of Innovation, from Chalmers University of Technology in Göteborg, Sweden.</p>","image":{"available_sizes":[[[113,150],"assets/images/resized/0014/3920/143920v2-max-150x150.jpg"],[[189,250],"assets/images/resized/0014/3920/143920v2-max-250x250.jpg"],[[340,450],"assets/images/resized/0014/3920/143920v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MSc. Engineering","subject":"Management and Economics of Innovation","institution":"Chalmers University of Technology","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chairman","firm":{"name":"Gotham Innovation","permalink":"gotham-innovation","type_of_entity":"company","image":null}},{"is_past":false,"title":"Chairman & CEO","firm":{"name":"One Public","permalink":"one-public","type_of_entity":"company","image":{"available_sizes":[[[150,31],"assets/images/resized/0017/7075/177075v2-max-150x150.png"],[[250,52],"assets/images/resized/0017/7075/177075v2-max-250x250.png"],[[450,94],"assets/images/resized/0017/7075/177075v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Founder & CEO","firm":{"name":"Telephony Media","permalink":"telephony-media","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}