{"first_name":"Faisal","last_name":"Galaria","permalink":"faisal-galaria","crunchbase_url":"http://www.crunchbase.com/person/faisal-galaria","homepage_url":"http://www.kayak.com","birthplace":"Bradford, UK","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1973,"born_month":10,"born_day":5,"tag_list":"","alias_list":null,"created_at":"Fri Oct 03 16:10:50 UTC 2008","updated_at":"Wed Aug 10 18:00:28 UTC 2011","overview":"<p>Mr. Galaria serves as Global Head of Business Development at Spotify Limited. He served as General Manager and Vice President of Corporate Development for Jaman. He has extensive international experience across media, telecommunications and finance sectors. Prior to Jaman, he ran global online business development and was Director of Europe at Skype, which was acquired by eBay for $3 billion in 2004. Mr. Galaria served as Managing Director of Europe and Asia at Kayak Software Corporation since September 2008. </p>\n\n<p>At Skype/eBay, he was responsible for key partnerships across the US, Europe the Middle East, with companies such as Sony, Bebo, British Telecom, Dixons and HP. Prior to joining Skype, he was a member of the Policy Executive of Britain’s telecom and media regulator Ofcom. </p>\n\n<p>At Ofcom, he played a senior role in the high-profile negotiation and valuation of distribution rights for Premier League Football and co-authored the Telecoms Strategy Review. He started his career in wireless and Internet consulting and was a senior member of Cluster Consulting, which was acquired by Diamond Technology Partners (NASDAQ: DTPI) for $930 million in 2000. </p>\n\n<p>He has been educated across Europe and graduated with honors from UMIST (University of Manchester Institute of Science and Technology) with a Bachelor’s in Management Sciences in the UK. He also holds an MBA from IESE in Spain.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Global Head of Business Development","firm":{"name":"Spotify","permalink":"spotify","type_of_entity":"company","image":{"available_sizes":[[[97,114],"assets/images/resized/0001/7768/17768v3-max-150x150.jpg"],[[97,114],"assets/images/resized/0001/7768/17768v3-max-250x250.jpg"],[[97,114],"assets/images/resized/0001/7768/17768v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}