{"first_name":"Faraj","last_name":"Aalaei","permalink":"faraj-aalaei-2","crunchbase_url":"http://www.crunchbase.com/person/faraj-aalaei-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Aug 01 12:24:19 UTC 2011","updated_at":"Mon Aug 01 12:28:29 UTC 2011","overview":"<p>Faraj Aalaei is a 27-year veteran of the communications industry. Prior to joining Aquantia, Faraj was the guiding force behind Centillium’s successful track record as a leading innovator of high performance, cost effective semiconductor solutions for broadband access networks. Under his leadership, Centillium went from seed financing to NASDAQ IPO in 3 years, the fastest ever for a semiconductor company. An industry pioneer and holder of two patents, Aalaei has spent the last three decades at the forefront of technical advancements - from helping develop the world&#8217;s first broadband modem for CATV networks to the introduction of Centillium&#8217;s high capacity convergent technology for DSL, optical and VoIP applications. Prior to co-founding Centillium in 1997, Aalaei held a variety of management and engineering positions at leading technology providers, where he applied his expertise to the development of DSLAM, Digital Loop Carrier and Fiber-to-the-Curb products at Fujitsu; the first SONET system and the first high speed two way systems for CATV networks at Bell Labs. He began his career at MA/COM designing very high speed satellite communications systems. Aalaei holds an BSEE from Wentworth Institute of Technology, MSEE from University of Massachusetts and an MBA from University of New Hampshire. Faraj is a member of the board of directors of TranSwitch Corporation and a Trustee of his alma mater Wentworth Institute of Technology.</p>","image":{"available_sizes":[[[115,150],"assets/images/resized/0014/7249/147249v1-max-150x150.jpg"],[[192,250],"assets/images/resized/0014/7249/147249v1-max-250x250.jpg"],[[251,326],"assets/images/resized/0014/7249/147249v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"","institution":"University of New Hampshire","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President and CEO","firm":{"name":"Aquantia","permalink":"aquantia","type_of_entity":"company","image":{"available_sizes":[[[150,40],"assets/images/resized/0002/2524/22524v2-max-150x150.jpg"],[[250,67],"assets/images/resized/0002/2524/22524v2-max-250x250.jpg"],[[282,76],"assets/images/resized/0002/2524/22524v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}