{"first_name":"Farley","last_name":"Cahen","permalink":"farley-cahen","crunchbase_url":"http://www.crunchbase.com/person/farley-cahen","homepage_url":"http://www.facebook.com/farleyc","birthplace":"Cleveland, OH","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Digital Playground","born_year":null,"born_month":null,"born_day":null,"tag_list":"coo, chief-operating-officer, entertainment, business-development","alias_list":null,"created_at":"Thu Dec 30 20:06:44 UTC 2010","updated_at":"Wed Oct 10 13:55:02 UTC 2012","overview":"<p>Farley Cahen is the Chief Operating Officer at Treats! Media. Treats! Producers a quarterly limited edition collectible periodical along with web properties www.treatsmagazine.com and www.treatsart.com as well as exclusive experiential events.</p>\n\n<p>Farley is the former Chief Operating Officer at Digital Playground.</p>\n\n<p>During his 4 year tenure, he was responsible for oversight of the day-to-day operations, revenue, corporate strategy and positioning.</p>\n\n<p>Prior to his COO position at DP, he was the EVP of New Media and Product Development.</p>\n\n<p>Mr. Cahen was formally both the VP of Licensing and Business Development for AVN Media Network from 2000-2008.</p>\n\n<p>Within 2 years, he transformed the AVN ntwk of sites into the most visited adult B2B news and information resource on the Web while at the the same time tripling the revenue. Additionally, he re-vamped AVN&#8217;s sales team as Dir. of Corp. sales &amp; ascended to the Publisher role of AVN Online Magazine.</p>\n\n<p>Mr. Cahen created AVNads, the worlds largest online Adult Ad Network which delivered over 300 Million targeted daily hits on over 17,000 websites.</p>\n\n<p>In Jan. &#8216;07, Mr. Cahen organized the first ever Adult Domain Auction held at the Internext-Expo at Mandalay Bay Hotel &amp; Casino. The auction was extremely successful &amp; yielded more than $2MM in domains sold. Since then, he has produced two additional Auctions yielding over $3MM in domain sales - making the Inernext Adult Domain Auction one of the highest grossing domain auctions.</p>\n\n<p>Farley has an extensive background in Content Distribution (both online and offline), IPTV &amp; VOD, Online &amp; Traditional advertising, Licensing and Branding, New Media, Database Systems, Web Dev., Domain monetization &amp; Magazine operations/publishing.</p>\n\n<p>Farley is a frequent panel moderator and speaker at industry and tech-related events such as Digital Hollywood and Internext-Expo. Mr. Cahen and has been interviewed and quoted as a media expert by numerous news and media organizations including Time, CNN, Business 2.0 and The LA Times.</p>\n\n<p>His recent projects include an exclusive licensing agreement with VUDU, Inc - widely considered the prevailing set-top-box solution in the US, development of some of the most profitable web properties as well as launching a cutting edge product line for DP.</p>\n\n<p>Specialties\nChief Operating Officer\nCOO\nExecutive level negotiations and sales\nProduct concept to development\nMergers and acquisitions\nStrategic relationship building\nHigh level marketing and PR strategies\nContent licensing\nWeb development architecture and design\nSEO/SEM\nBusiness development and consultation\nPremium Domain acquisitions, development and sales\nProduct development, merchandising, marketing &amp; sales</p>","image":{"available_sizes":[[[115,150],"assets/images/resized/0011/5830/115830v2-max-150x150.jpg"],[[192,250],"assets/images/resized/0011/5830/115830v2-max-250x250.jpg"],[[268,348],"assets/images/resized/0011/5830/115830v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"COO","firm":{"name":"Digital Playground","permalink":"digital-playground","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://ori.cnbc.com/id/15840232?video=1174441625&play=1","title":"CNBC Interview"},{"external_url":"http://www.linkedin.com/in/farley","title":"LinkedIn"}]}