{"first_name":"Farrah","last_name":"Gray","permalink":"farrah-gray","crunchbase_url":"http://www.crunchbase.com/person/farrah-gray","homepage_url":"http://www.drfarrahgray.com/","birthplace":"California","twitter_username":"RealFarrahGray","blog_url":"http://farrahgray.tumblr.com/profile","blog_feed_url":"","affiliation_name":"Farrah Gray Foundation","born_year":1984,"born_month":9,"born_day":9,"tag_list":"dr-farrah-gray, farrah-gray, celebrity-entrepreneur, columnist, bestselling-author, public-speaker","alias_list":null,"created_at":"Tue Jun 26 13:48:24 UTC 2012","updated_at":"Thu Jul 12 21:51:12 UTC 2012","overview":"<p>Dr Farrah Gray, celebrity entrepreneur, investor, American businessman, philanthropist, international bestselling author, syndicated columnist, and motivational speaker, was a self-made millionaire by the time he was 14 years old. He grew up on the impoverished south side of Chicago, and reality drove him to start helping with the family finances when he was a mere 6 years old. Dr Gray has many “firsts” and “the youngest” to his name – at the age of 15 he was the youngest member of the Board of Advisor for the Las Vegas Chamber of Commerce; at the same age he was elected to sit on the Board of Directors of the United Way of Southern Nevada, becoming the youngest director ever to sit on a United Way board across the nation; at the age of 20 he was elected a member of the National Association of Real Estate Brokers’ Board of Directors of Region 15, becoming its  youngest member; at 21 he became the youngest person to receive an honorary doctorate from South Carolina’s Allen University; when he set up his Wall Street office he was the youngest businessman to have an office at this significant address. In other instances Dr Farrah Gray is proud to be included in an elite group of people such as being named one of the “20 Modern History Makers” in a special issue for the anniversary of Upscale Magazine; a Living Legend by Who’s Who in Black Las Vegas; and one of the Top Ten Sexiest Black CEOs by Black Voices, together with Tiger Woods, Kenneth Chenault and Sean Combs. And last but not least by any means – making his first million dollars at the age of 14!</p>\n\n<p>Farrah Gray has been active in various fields of business. He is a real estate investor and co-founded an asset management company called Realty Pros, which has reached more than $30 million in assets managed. In the field of education, he established an entrepreneurship school, the University of Business Futures (UBF), which was developed in partnership with the Ewing Marion Kauffman Foundation. Gray is also an AOL money coach. The Farrah Gray Foundation is one of the many ways in which Gray gives back to the community by providing scholarships for Black students from poor neighborhoods. Gray is also involved in the publishing world, both as a published and acclaimed author and as the CEO of his publishing company, Farrah Gray Publishing (FGP). He has a number of best-selling books to his credit, the first of which, Reallionaire was on the best-seller lists before it was published nationally. His books have been sold in several countries around the world and translated into the Korean, Vietnamese, Indonesian and Russian languages. Other literary achievements include being a contributing author to “Chicken Soup for the African-American Soul” and a syndicated columnist with the National Newspapers Publishers Association. </p>\n\n<p>Gray has had many honor awarded to him, among them the keys to several cities – Shreveport, Cincinnati and Dallas – as well as receiving proclamations from many governors and mayors across the nation. </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0020/0495/200495v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0020/0495/200495v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0020/0495/200495v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Honorary Doctorate Degree","subject":"Humane Letters","institution":"Allen University, Columbia, South Carolina","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder and Chairman","firm":{"name":"Farrah Gray Publishing","permalink":"farrah-gray-publishing","type_of_entity":"financial_org","image":null}},{"is_past":false,"title":"Founder and Chairman","firm":{"name":"Farrah Gray Foundation","permalink":"farrah-gray-foundation","type_of_entity":"company","image":null}},{"is_past":false,"title":"Spokesman ","firm":{"name":"National Coalition for the Homeless","permalink":"national-coalition-for-the-homeless","type_of_entity":"company","image":null}},{"is_past":false,"title":"Spokesman ","firm":{"name":"National Bone Marrow Donor Program","permalink":"national-bone-marrow-donor-program","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://jobs.aol.com/articles/2011/08/24/how-inner-city-kid-farrah-gray-became-a-millionaire-by-age-14/","title":""},{"external_url":"http://abcnews.go.com/2020/Business/story?id=2247424&page=1","title":""},{"external_url":"http://books.google.co.il/books/about/Reallionaire.html?id=3LywJ5yJdTwC&redir_esc=y","title":""},{"external_url":"http://www.youtube.com/watch?v=2f1TNgJ5mF0","title":""}],"web_presences":[{"external_url":"http://www.farrah-gray.com","title":"LookupPage Profile"},{"external_url":"http://www.farrahgray.net","title":"Dr Farrah Gray - Wiki Page"},{"external_url":"http://www.visualcv.com/farrahgray","title":"Dr Farrah Gray's Career"},{"external_url":"http://en.wikipedia.org/wiki/Farrah_Gray","title":"Farrah Gray - Wikipedia"},{"external_url":"https://www.twitter.com/RealFarrahGray","title":"Farrah Gray - Twitter"},{"external_url":"http://www.facebook.com/RealFarrahGray","title":"Farrah Gray - Facebook"}]}