{"first_name":"Faseeh","last_name":"Shams","permalink":"faseeh-shams","crunchbase_url":"http://www.crunchbase.com/person/faseeh-shams","homepage_url":"http://www.adthena.co.uk","birthplace":"UK","twitter_username":"adthena","blog_url":"http://www.adthena.co.uk/Blog.aspx","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"adthena, competitor-intelligence, competitive-intelligence","alias_list":null,"created_at":"Mon Nov 14 15:11:11 UTC 2011","updated_at":"Mon Nov 21 04:52:10 UTC 2011","overview":"<p>Adthena is an ingenious and the most comprehensive cutting edge, patent-pending Competitor Analysis Search Intelligence Solution which is used to deliver the most in-depth and thorough results available for benchmarking, campaign improvement and infringement monitoring.</p>\n\n<p>Rather than settling for pre-packaged batches of industry-wide data, or having to painstakingly choose only a few keywords to represent your vertical, this application automatically reports on the competitive landscape relevant to each client site, with a minimum of input and effort demanded from the marketer. Simply specify your domain name, and let Adthena’s wisdom do the rest.</p>\n\n<p>Whether looking at your whole market, or drilling down to different keyword subsets or competitors, the information revealed will turn into actions that help you shave costs and improve campaign performance, whilst also increasing efficiency.</p>\n\n<p>Traffic Smart have been in the web marketing business since 2003, when it developed the UK’s first shared traffic network for major retail brands. In 2005, Traffic Smart launched its own PPC affiliate programme and subsequently developed proprietary automated bid management technology. In 2007, Traffic Smart launched new self-optimising Yahoo search powered ad units for publishers.</p>\n\n<p>Deciding to take the business in a new direction, the developers commenced work on an innovative search engine intelligence technology in 2009. Recognising the limitations of similar products and identifying an opening in the market for a new methodology, the developers crafted an application that provides extensive and in-depth data in an intelligent and intuitive way, whilst requiring almost no start-up effort</p>","image":{"available_sizes":[[[150,32],"assets/images/resized/0016/2286/162286v2-max-150x150.png"],[[250,53],"assets/images/resized/0016/2286/162286v2-max-250x250.png"],[[276,59],"assets/images/resized/0016/2286/162286v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.adthena.co.uk","title":"Official Website"}],"web_presences":[]}