{"first_name":"Federico","last_name":"Murrone","permalink":"federico-murrone","crunchbase_url":"http://www.crunchbase.com/person/federico-murrone","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Oct 30 15:13:22 UTC 2009","updated_at":"Thu Oct 07 06:46:23 UTC 2010","overview":"<p>Federico Murrone is Chief Technology Officer of Bling Nation. In this role, Murrone is responsible for the design and implementation of Bling Nation&#8217;s network and processes. Murrone started his career as a technology-Internet expert in 1995 when he was responsible for the implementation of the first ISP in Argentina. He has worked on Internet related business projects specializing in the design and implementation of optimized technological solutions and processes for the financial industry. Murrone worked for the World Bank and the Inter-American Development Bank as a consultant on projects for the United Nations Development Program. Those projects included the redesign and implementation of a new tax collection system in Argentina for the governmental organization Administracion Federal de Ingresos Publicos and leading the design and implementation of a new customs management system for the Argentinean government. In 1998 Murrone joined Patagon a leading financial portal in Latin America as CTO and was responsible for the design and implementation of a trading and banking solution in Argentina, Brazil, Chile, Mexico, USA and Venezuela. Murrone holds an engineering degree in computer science from the Universidad de Belgrano in Buenos Aires, Argentina, and a sociology degree from the Universidad de Buenos Aires. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CTO","firm":{"name":"Bling Nation","permalink":"bling-nation","type_of_entity":"company","image":{"available_sizes":[[[150,100],"assets/images/resized/0005/1717/51717v13-max-150x150.jpg"],[[165,110],"assets/images/resized/0005/1717/51717v13-max-250x250.jpg"],[[165,110],"assets/images/resized/0005/1717/51717v13-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"CTO","firm":{"name":"Patagon.com","permalink":"patagon-com","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}