{"first_name":"Federico","last_name":"Garza-Bueron","permalink":"federico-garza-bueron","crunchbase_url":"http://www.crunchbase.com/person/federico-garza-bueron","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1962,"born_month":2,"born_day":25,"tag_list":"","alias_list":null,"created_at":"Tue Jul 17 11:23:55 UTC 2012","updated_at":"Wed Jul 18 05:00:34 UTC 2012","overview":"<p>An experienced investor, Federico Garza-Bueron excels in the field of finance. Passionate about making investments and watching them grow into profitable returns, he also invests in local communities, families and the education of our young people. </p>\n\n<p>The Early Years</p>\n\n<p>Born and raised in Monterrey, Mexico, his early years play a role in who he is and what his goals are. Over the years, his family’s travels took him around the world. As an adult, he choose to come to America to attend Columbia University. After being a student in the country, he made the decision to call New York his permanent home.</p>\n\n<p>Professional History</p>\n\n<p>Currently an investment representative serving several clients in New York, Federico spent more than a decade guiding investors. He has helped entrepreneurial ventures move from their startup stage to profitable, sustainable levels. Holding an MBA from Columbia, he serves as the event co-chair for the Private Equity Committee of Columbia Business School. He also serves on the board for Friends in Deed, a non-profit relief agency.</p>\n\n<p>Always looking for opportunities that can benefit his clients, he stays informed of important events in politics and around the world. He started Senovia Inc., a consulting firm specializing in generating capital for business ventures and restructuring businesses. Playing an important role in helping companies succeed, they also help struggling companies find success.</p>\n\n<p>Current Events</p>\n\n<p>Currently working as an internal consultant and CFO on a project that will help prestigious companies in the area of fine art, he is lending his skills and considerable expertise to creating a new Art Fund. Once the project is completed, he will turn his focus and considerable skills to private wealth management.</p>\n\n<p>The Personal Side</p>\n\n<p>Committed to local communities, Federico Garza-Bueron is dedicated to giving something back. His zeal for helping the community is well known, and he is involved in several activities that take him out into community he lives in. In addition to assisting with charities, he also loved kite surfing and is a scholar of world history. </p>\n\n<p>Highly experienced, dedicated to his customers and passionate about his community, this man is both a philanthropist and financial planner. Very successful and skilled in his work, he is dedicated to helping others expand their investments and find success in their business ventures.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/1442/201442v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/1442/201442v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/1442/201442v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}