{"first_name":"Felipe","last_name":"Barousse","permalink":"felipe-barousse","crunchbase_url":"http://www.crunchbase.com/person/felipe-barousse","homepage_url":"http://www.piensa.com","birthplace":"Mexico City, Mexico","twitter_username":"febb","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1965,"born_month":12,"born_day":28,"tag_list":"","alias_list":null,"created_at":"Wed Sep 28 00:48:15 UTC 2011","updated_at":"Mon Dec 19 01:34:15 UTC 2011","overview":"<p>Founder, CEO and Director General of Piensa Technologies Bufete Consultor de Mexico - www.piensa.com - a Mexican firm operating in Mexico,the Caribbean and Latin America since 1994. </p>\n\n<p>PIENSA was originally a consulting and project management company in the fields of Information Technology, Internet Business Development, Business Processes Management and ERP/SCM/CRM/MRP for the Supply Chain Industry: logistics, transportation, distribution, warehousing. Today, PIENSA.COM is a multi-industry brand.</p>\n\n<p>Mr. Barousse co-hosts a weekly live radio show about Internet and Technology, also produces several Internet podcasts and digital media web sites.</p>\n\n<p>He has 28+ years of experience having served as Senior Executive for multinational firms such as DHL Airways-Worldwide Express, Nortel Networks Periphonics, KPMG Bearing Point, Lockheed Martin OAO, Televisa and others, as well as on private practice. </p>\n\n<p>He has been involved in many UNIX related professional organizations, regularly writes on publications such as Linux Journal www.linuxjournal.com and publishes the e-zines: La Gaceta de Linux www.gacetadelinux.com and Gazeta do Linux www.gazetadolinux.com; assesed the Linux Professional Institute in their web portal development in Spanish.</p>\n\n<p>He is member of the Council of Supply Chain Management Professionals - CSCMP, former -CLM-.</p>\n\n<p>Mr. Barousse has participated, both as attendee and as keynote speaker,on many international events such as:The Santa Cruz Forum and Comdex in the U.S.; CeBit in Europe, The Havana International fair, Linux Expo Brazil; Mexico Linux National Congress, ITESM Annual Logistics Day, CSCMP Encuentros Logisticos, TRAFFIC CCtld Amsterdam &#8230;</p>\n\n<p>Since the early 90s Mr. Barousse has been active in the Internet Industry as Domain Investor by acquiring high valued generic domain names and developing them as high value and profitable Internet Properties on various industries. He frequently attends Domain Names and technology related events.</p>","image":{"available_sizes":[[[150,149],"assets/images/resized/0015/5867/155867v4-max-150x150.jpg"],[[250,248],"assets/images/resized/0015/5867/155867v4-max-250x250.jpg"],[[367,365],"assets/images/resized/0015/5867/155867v4-max-450x450.jpg"]],"attribution":"<p>FELIPE BAROUSSE</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Piensa Technologies","permalink":"piensa-technologies","type_of_entity":"company","image":{"available_sizes":[[[150,62],"assets/images/resized/0017/0281/170281v2-max-150x150.png"],[[167,70],"assets/images/resized/0017/0281/170281v2-max-250x250.png"],[[167,70],"assets/images/resized/0017/0281/170281v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}