{"first_name":"Felix","last_name":"Sim","permalink":"felix-sim","crunchbase_url":"http://www.crunchbase.com/person/felix-sim","homepage_url":"http://www.felixsim.com","birthplace":"Singapore","twitter_username":"felixsim","blog_url":"http://www.felixsim.com/blog","blog_feed_url":"http://feeds.feedburner.com/TheNewAlternative","affiliation_name":"Apache Advisors","born_year":null,"born_month":null,"born_day":null,"tag_list":"felix-sim, dubai, hedge-funds, investments","alias_list":null,"created_at":"Wed Jan 13 07:32:27 UTC 2010","updated_at":"Tue Jul 05 17:42:13 UTC 2011","overview":"<p>Felix Sim, the Co-Founder and Managing Director of Apache Advisors, is a well-connected professional with expertise in regulatory advisory work, hedge fund management and capital introduction, corporate finance and Islamic finance.\nPreviously, Felix worked with a leading regulatory, compliance and client advisory firm in the Dubai International Financial Center that provides a wide range of services globally to a substantial and diversified client base that includes corporations, financial institutions and governments.</p>\n\n<p>Felix was the Principal of Alternative Investments Business at an Australian asset management company, where he managed its hedge fund incubation business. Prior to that, at GCI Investment Management, a Japanese asset management firm, Felix was active in all aspects of the firm’s US$400million hedge fund business. He headed the investment group and managed the trading activities, risk management and back-office operations for single strategy hedge funds. His experience included manager selection, risk/return analysis, asset allocation and hedge fund structuring for GCI’s fund of hedge funds business.</p>\n\n<p>Felix started his career in finance with Mizuho Corporate Bank, the corporate and investment banking subsidiary of Mizuho Financial Group, the second-largest Japanese financial services conglomerate, where he was based in the Singapore Treasury Department.</p>\n\n<p>Felix is the President of the Singapore Business Council (UAE), a non-profit organisation in the UAE that assists Singaporean entities and individuals seeking opportunities with other entities in the Gulf. The Singapore Business Council also assists in positioning Singapore as a base for foreign businesses to expand into, in partnership with Singaporean entities and individuals. He also runs the Global Hedge Fund Groups on LinkedIn, which is a conglomerate of hedge fund groups made up of more than 10,000 investment professionals based globally.</p>\n\n<p>Felix graduated with a Bachelor’s Degree in Finance (Hons) from University College Dublin. He also received a Diploma in Wealth Management accredited by the American Academy of Financial Management, and a Diploma in Business and Information Technology from Temasek Polytechnic in Singapore.</p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0007/3140/73140v2-max-150x150.png"],[[250,167],"assets/images/resized/0007/3140/73140v2-max-250x250.png"],[[347,232],"assets/images/resized/0007/3140/73140v2-max-450x450.png"]],"attribution":"<p>Felix Sim</p>"},"degrees":[{"degree_type":"BSc","subject":"Finance","institution":"University College Dublin","graduated_year":2009,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Apache Advisors","permalink":"apache-advisors","type_of_entity":"company","image":{"available_sizes":[[[150,89],"assets/images/resized/0015/1448/151448v1-max-150x150.jpg"],[[164,98],"assets/images/resized/0015/1448/151448v1-max-250x250.jpg"],[[164,98],"assets/images/resized/0015/1448/151448v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/felixsim","title":""},{"external_url":"http://www.linkedin.com/in/simfelix","title":""}]}