{"first_name":"Feng","last_name":"Xue","permalink":"feng-xue","crunchbase_url":"http://www.crunchbase.com/person/feng-xue","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"EngXi","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 21 22:16:07 UTC 2011","updated_at":"Tue Jun 28 14:43:48 UTC 2011","overview":"<p>Feng Xue, Chair of the Katten’s Asia/China Practice, concentrates on private equity, mergers and acquisitions, securities regulations, and general corporate transactions, with an emphasis on China-related investment transactions. Mr. Xue has worked with major international law firms in Chicago, Shanghai, and Beijing, and has extensive experience in a wide variety of the legal issues that affect investing in China.</p>\n\n<p>He has negotiated and documented the establishment of numerous joint ventures, WFOEs, and distribution/franchise relationships, as well as cross-border acquisitions in China in a variety of industries. Increasingly, his practice consists of representing Chinese companies in their acquisition and expansion efforts overseas. </p>\n\n<p>Also a seasoned practitioner of corporate law in the United States, Mr. Xue focuses his U.S. corporate practice on complex merger and acquisition transactions, securities offerings, middle market buyout fund acquisitions, and venture capital investments.</p>\n\n<p>An experienced writer, he co-wrote Laws of the People&#8217;s Republic of China, Volumes III, IV, and V, published by China Science Press, and Western Corporate Laws, published by China Law Press. In addition, he has been quoted in numerous Chinese and US media on issues related to doing business in China, including the Street.com of Wall Street Journal on Chinese legal framework for foreign investors.  He is a frequent speaker on the legal issues affecting foreign investment in China.</p>\n\n<p>Mr. Xue&#8217;s speaking engagements include:</p>\n\n<pre><code>Great Chicago China Business Conference, Kellogg School of Management, April 18, 2008, on China Outbound Investments and Chinese Law and Government.\nHarvard China Review 2008 Conference: Building China Confidence (March 29, Harvard University), on China PE investments.\nKellogg School of Management Global Initiative Clinical Course (February 27, 2008), on doing business in China.\nPWC China-India Road Show (November 2007, Chicago), on China-related legal due diligence and structuring issues.\nMilestone 2007 Conference (October 2007, Beijing), on oversea IPOs for Chinese company and legal requirements.\nWorld Trade Center Chicago China Promise to Profit Conference (October 2007, Chicago), on evolving legal issues of doing business in China (impact of new tax, labor and M&amp;amp;A laws in China.\nPWC Doing Business in China Press Conference (September 2007, New York), on legal issues of doing business in China.\nACG New York Chapter China Forum (August 2007, New York), on China M&amp;amp;A issues.\nChina Real Estate Forum (May 11, 2007, New York), on Chinese real estate companies public offerings in HK and the US.\nChina VC Summit (April 25, 2007, Palo Alto, CA), on US VC’s investment in Chinese companies and the impact of Chinese MOFCOM Circular 10.\nUS-China Investment and M&amp;amp;A Summit (April 10, 2007, Shanghai), on China- related cross border M&amp;amp;A.\n</code></pre>\n\n<p>Mr. Xue earned his B.A. from Beijing University in 1990, his LL.M. from Duke University School of Law in 1995 and his J.D. from Duke University School of Law in 1998. Prior to attending law school, Mr. Xue worked as a senior legislative officer for the Legislative Affairs Commission and Law Committee of the Chinese National People’s Congress, where he participated in the drafting of Chinese national legislation. </p>","image":null,"degrees":[{"degree_type":"LLM","subject":"Law","institution":"Duke University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"JD","subject":"Law","institution":"Duke University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"BA","subject":"","institution":"Peking University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Member, Advisory Board","firm":{"name":"engxi","permalink":"engxi","type_of_entity":"company","image":{"available_sizes":[[[150,61],"assets/images/resized/0019/9873/199873v2-max-150x150.png"],[[245,100],"assets/images/resized/0019/9873/199873v2-max-250x250.png"],[[245,100],"assets/images/resized/0019/9873/199873v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Partner and Chair of Asia/China Practice","firm":{"name":"Katten Muchin Rosenman","permalink":"katten-muchin-rosenman","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}