{"first_name":"Feng","last_name":"Jun","permalink":"feng-jun","crunchbase_url":"http://www.crunchbase.com/person/feng-jun","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 28 20:50:41 UTC 2009","updated_at":"Wed Jan 28 20:50:41 UTC 2009","overview":"<p>Feng Jun was born in the city of Xi&#8217;an in Shaanxi Province in June 1969 and spent his university years at Tsinghua University&#8217;s Faculty of Architecture pursuing a B.Eng. Upon graduation, he founded aigo and led the company through its phenomenal years of growth. Later on he enrolled in the EMBA program at Peking University, graduating in 2004. Currently, Feng is working towards a PhD in psychology from Beijing Normal University.</p>\n\n<p>Aside from his commitments as the President and only shareholder of aigo, Mr. Feng is active in many government associated groups and associations. Mr. Feng joined the China National Democratic Construction Association in 2002 and is also currently a member of Beijing&#8217;s Political Consultative Committee, the National Young Leader&#8217;s Association, among many other associations. Mr. Feng is Chairman of the Tshinghua Entrepreneur &amp; Executive Club as well as a member of the Chinese Entrepreneurs Club. He often participates at high level political events and is an active contributor to the Beijing business community.</p>\n\n<p>Mr. Feng has won many awards in the last several years including one of the Top 10 Outstanding Chinese Entrepreneurs in 2005 &amp; 2006, named one of Beijing&#8217;s 10 Distinguished Youth, recipient of 2006 CCTV&#8217;s China Economic Annual Innovative Individual Award. Mr. Feng was also named a Davos World Economic Forum Young Global Leader in 2007.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0003/5114/35114v1-max-150x150.jpg"],[[166,250],"assets/images/resized/0003/5114/35114v1-max-250x250.jpg"],[[240,361],"assets/images/resized/0003/5114/35114v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}