{"first_name":"Fergus","last_name":"Cleaver","permalink":"fergus-cleaver","crunchbase_url":"http://www.crunchbase.com/person/fergus-cleaver","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1967,"born_month":11,"born_day":16,"tag_list":"","alias_list":null,"created_at":"Wed Jul 18 15:38:02 UTC 2012","updated_at":"Thu Jul 19 09:49:37 UTC 2012","overview":"<p>Fergus Cleaver is a professional, certified Senior Accountant at Cleaver Richards Accounting Firm in Auckland, New Zealand. He is experienced in business start up planning, fringe benefit tax planning and goods and services tax among other things. Fergus is known for providing professional and customized services to his clients. He&#8217;s dedicated to his client&#8217;s needs and develops relationships with his clients earning their trust. </p>\n\n<p>Fergus is committed to his personal development and education as an accountant. He received his higher education from University of Auckland earning his Bachelor’s of Commerce Degree in Accounting and Economics. He later went on to study in Canada at Simon Fraser University giving him a unique international perspective on business, history and economics. He went back to University of Auckland to study for his graduate degree and received his Graduate diploma of Commerce in Taxation and Commercial Law. He also has received specialized training at the New Zealand Institute of Chartered Accountants. </p>\n\n<p>With Fergus Cleaver his clients will find a true professional dedicated to what is most important to them. Fergus personalizes his services to the client’s needs. His specialties include the following services: </p>\n\n<p>• Fringe Benefit Tax Planning</p>\n\n<p>• Goods and Services Tax</p>\n\n<p>• Personal and professional tax return preparation</p>\n\n<p>• Tax Payment Advice</p>\n\n<p>• IRD Dispute and Audit Management</p>\n\n<p>• Business Start Up Planning</p>\n\n<p>• Payroll Services</p>\n\n<p>• Management Consulting</p>\n\n<p>• Estate Planning</p>\n\n<p>• Rental and Commercial Property Assistance</p>\n\n<p>As a proud resident of Auckland, Fergus is committed to his community. He is actively involved in charitable organizations and giving back to his community. He is a trustee and personally invested in the Y for Youth organization that helps fund programming for New Zealand’s youth and aspires to create a better future for them through programs and education. He also offers free accounting services to the organizations such as the Southern Stars Charitable Trusts. This organization supports causes relating to children with special needs. </p>\n\n<p>Fergus Cleaver is a caring accountant. His desire is to serve his clients through his accounting skills and help them build better businesses and futures for themselves. It&#8217;s rare to find a professional who puts his heart in what he does. His education and experience speak for itself, but his clients sing his praise as a person they&#8217;ve come to trust with their accounting needs. </p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/1712/201712v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/1712/201712v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/1712/201712v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}