{"first_name":"Finny","last_name":"Kuruvilla","permalink":"finny-kuruvilla","crunchbase_url":"http://www.crunchbase.com/person/finny-kuruvilla","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 22 08:02:56 UTC 2009","updated_at":"Mon Jun 22 08:07:06 UTC 2009","overview":"<p>Finny Kuruvilla, MD, PhD joined Clarus Ventures from the Broad Institute of Harvard and MIT where he led a collaborative effort with Affymetrix (NASDAQ: AFFX) in medical and population genetics.  This work resulted in the development of  novel analytical tools and software that allow the massively parallel interrogation of clinical DNA samples, which has been used to study billions of genotypes in academic and industrial settings globally.  Prior to joining the Broad, Dr. Kuruvilla’s research focused on the elucidation of the mechanism of action of rapamycin.</p>\n\n<p>Dr. Kuruvilla has cared for adult and pediatric patients suffering from a variety of hematologic, oncologic, and autoimmune disorders at the Brigham &amp; Women’s Hospital, Children’s Hospital Boston, the Dana-Farber Cancer Institute, the Beth Israel Deaconess Medical Center, and the Massachusetts General Hospital.  He completed his residency at the Brigham &amp; Women’s Hospital and his fellowship in transfusion medicine at Harvard Medical School. He received his M.D. from Harvard Medical School, his Ph.D. in chemistry and chemical biology from Harvard University, his master’s degree in electrical engineering and computer science from MIT, and his bachelor’s degree in chemistry from Caltech.</p>\n\n<p>Dr. Kuruvilla is a Board observer for Lycera, Nanostring, and Virdante.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0005/0050/50050v1-max-150x150.jpg"],[[112,156],"assets/images/resized/0005/0050/50050v1-max-250x250.jpg"],[[112,156],"assets/images/resized/0005/0050/50050v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Principal","firm":{"name":"Clarus Ventures","permalink":"clarus-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,82],"assets/images/resized/0005/0042/50042v1-max-150x150.png"],[[181,100],"assets/images/resized/0005/0042/50042v1-max-250x250.png"],[[181,100],"assets/images/resized/0005/0042/50042v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}