{"first_name":"Flag","last_name":"Foundation Of India","permalink":"flag-foundation-of-india","crunchbase_url":"http://www.crunchbase.com/person/flag-foundation-of-india","homepage_url":"http://www.flagfoundationofindia.in/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"indian-flag, indian-national-flag, flag-of-india, national-flag-of-india, indian-flags, indian-national-flags, flags-of-india, national-flags-of-india, tiranga-run","alias_list":null,"created_at":"Fri May 11 07:50:48 UTC 2012","updated_at":"Wed May 16 23:44:28 UTC 2012","overview":"<p>Flag Foundation Of India</p>\n\n<p>Flag Foundation Of India was set up as a registered society under the societies registration act of 1980, a non-profit body in January 2002, after Mr. Naveen Jindal won a seven-year long court battle that enabled all Indians to display our National Flag with honour and pride at their homes, offices and factories on all days of the year. </p>\n\n<p>The current age has seen an increasing trend of nationalism and patriotism becoming mere slogans. We are slowly loosing the sense of pride and love that we had for our country. The Flag Foundation Of India is an attempt to rekindle that spirit of nationalism. By choosing the path of striving to uphold the dignity of the Tiranga, this project aims at regenerating that sense of pride and removing those layers of hesitation which keep us from living a life of a true nationalist. </p>\n\n<p>Our primary vision is to popularize the display of the Tiranga by more and more Indians, with a great sense of pride. When we display the flag we rise above narrow considerations of religion, caste, language, region, etc. and it reminds us of being, first and foremost, an Indian. At the same time, it represents every Indian religion, language, culture and region. It celebrates our rich diversity. It is, thus, the greatest symbol of our &#8216;unity in diversity&#8217;. </p>\n\n<p>Flag Code although is not a law within the meaning of Article 13(3)(a) of the Constitution of India for the purpose of clause (2) of Article 19 thereof, it would not restrictively regulate the free exercise of the right of flying the national flag. However, the Flag Code to the extent it provides for preserving respect and dignity of the National Flag, the same deserves to be followed.</p>\n\n<p>Tel : +(91)-(11)-23012253 / 23795299</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}