{"first_name":"FLİGHTTOHEALTH","last_name":".COM","permalink":"flghttohealth-com","crunchbase_url":"http://www.crunchbase.com/person/flghttohealth-com","homepage_url":"http://www.flighttohealth.com","birthplace":"Turkey","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1977,"born_month":12,"born_day":20,"tag_list":"","alias_list":null,"created_at":"Fri Mar 30 15:16:48 UTC 2012","updated_at":"Fri Mar 30 16:33:56 UTC 2012","overview":"<p>ABOUT US</p>\n\n<p>Flighttohealth is an Istanbul/ Turkey origin institution, which establishes a connection between institutions which give high quality health services and patients demanding diagnosis- treatment and provides transportation, accommodation and interpreter while patients receive the treatment, also gives online advisory service with doctors who are specialist in their fields. Basic principle of Flighttohealth is TRUST. Flighttohealth’s job is to provide high-quality health services to patients and to support in every respect within this period.</p>\n\n<p>There are 157 private and 52 state hospitals in Istanbul. Flighttohealth works with only ten hospitals among these hospitals. The hospitals and health institutions which Flighttohealth works with are institutions which are certified by the ministry of health and international institutions in their fields, have knowledgeable and experienced specialists in their fields and in which the latest health technology is used. The unites in which these health institutions provide service are inspected by authorized organizations according to efficiency, sterility, equipment and personnel. Flighttohealth, which offers you more than one choice of treatment institution, will provide detailed information about the frequency and the success of the examination and treatment of planned illness in these hospitals. If it is cared, all-inclusive tours may be organized while deciding, on the purpose of evaluating and observing the doctors and the hospitals.</p>\n\n<p>Flighttohealth will offer you with its basic principle trust, high quality health services with relevant costs no matter wherever you are. While these health services are provided to you, you will not face any difficulty of a foreign country, because Flighttohealth will arrange your flight ticket, airport transfer, the hotel you will accommodate, transfer to the hospital, appointment to the doctor, return transfer and ticket. Besides, your companion will also benefit from the mentioned services apart from the ones about treatment.</p>\n\n<p>While providing you safe, modern, high standardized and affordable health services, Flighttohealth will also accompany you for anything apart from medicine</p>","image":{"available_sizes":[[[150,54],"assets/images/resized/0018/1897/181897v2-max-150x150.jpg"],[[250,90],"assets/images/resized/0018/1897/181897v2-max-250x250.jpg"],[[275,100],"assets/images/resized/0018/1897/181897v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}