{"first_name":"Florentina","last_name":"Moise","permalink":"florentina-moise","crunchbase_url":"http://www.crunchbase.com/person/florentina-moise","homepage_url":"http://ca.linkedin.com/in/florentinamoise","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Aequilibrium","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 05 23:05:28 UTC 2012","updated_at":"Tue Jun 12 13:16:57 UTC 2012","overview":"<p>1</p>\n\n<p>Florentina’s achievements in Finance, Engineering, and Project Management were cultivated in a career stretching over 15 years, making her a valuable member of the Aequilibrium Senior Management team.</p>\n\n<p>A versatile professional, Florentina is a General Specialist in human resources, payroll, and accounts payables and receivables. Her work in IT, the financial industry and educational institutions has also given her progressive experience in the areas of financial reporting, budgeting and forecasting, as well as planning and advising on budget policies, procedures and practices.</p>\n\n<p>The common denominator to Florentina’s success is her strong ability to evaluate situations and make decisions which support the goals of the organizations, while mitigating the financial risks. Organizational objectives are further propelled by her exceptional customer service, conflict management and problem solving skills.</p>\n\n<p>While Florentina continually hones her professional skills, her qualifications are reinforced with a Bachelor of Arts in Accounting from Simon Fraser University, a degree in Engineering from Polytechnic University of Bucharest, and a certification in Project Management.</p>\n\n<p>Always seeking a well-balanced life outside of work, when she’s not wandering around Europe with her family, you can find Florentina spending time with her 2 children or curling up with a good English or French novel.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Director, Finance","firm":{"name":"Aequilibrium","permalink":"aequilibrium","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}