{"first_name":"Frank","last_name":"Cioffi","permalink":"frank-cioffi","crunchbase_url":"http://www.crunchbase.com/person/frank-cioffi","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Tech Investor News","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 21 18:42:44 UTC 2009","updated_at":"Thu Jul 23 18:58:17 UTC 2009","overview":"<p>Frank Cioffi is a news media specialist and self-professed news junkie. He spends his professional time as a media relations and marketing communications consultant to high-tech companies. He is also founder and editor of Tech Investor News, a network of vertical news aggregation websites.</p>\n\n<p>Frank spent most of his 20s working in the news media. He was a radio broadcaster in college, a reporter for AP Radio in New York, and a television news producer at WNYW-TV in New York and KRON-TV in San Francisco.</p>\n\n<p>He founded The Medialink Group, a small media relations agency which he still heads today. With twenty-five years of media and marketing experience, he has devised and implemented PR strategies for clients ranging from startups to former Chrysler Chairman Lee Iacocca. He has received awards from the Public Relations Society of America and spearheaded campaigns which helped shift government policy.</p>\n\n<p>In 2007 Frank launched Apple Investor News, his beta site to test a new concept in news aggregation he calls Intelligent News Search. This led to the May, 2009 launch of Tech Investor News, a technology sector news site and network of single-company news aggregators for each of the top 20 technology stocks.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Tech Investor News","permalink":"tech-investor-news","type_of_entity":"company","image":{"available_sizes":[[[150,35],"assets/images/resized/0005/3743/53743v2-max-150x150.png"],[[250,59],"assets/images/resized/0005/3743/53743v2-max-250x250.png"],[[304,72],"assets/images/resized/0005/3743/53743v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}