{"first_name":"Frank","last_name":"Foster","permalink":"frank-foster","crunchbase_url":"http://www.crunchbase.com/person/frank-foster","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Nov 03 21:45:45 UTC 2008","updated_at":"Mon Dec 01 13:02:27 UTC 2008","overview":"<p>Frank Foster is currently the Managing General Partner of the Gideon Hixon Fund, the early stage venture capital investment vehicle for the Hixon family and a Venture Partner of Southern Cross. Frank has served as a Fund Manager of the Gideon Hixon Fund since its inception in 1990. The Fund currently consists of approximately 10 direct investments and investments into eight regional managers representing 18 funds. The Gideon Hixon Fund and its predecessor entities (HixVen and Southwest Venture Fund) have a long history in venture capital beginning in the 1970s. The group’s venture capital investments include Apple Computer (NASDAQ &amp; NYSE: AAPL) and Dell (NASDAQ: DELL) as well as more recent successes including Medior (acquired by AOL), Security Dynamics (acquired by RSA), WebCal (acquired by Yahoo) and Xiotech (acquired by Seagate). He is a General Partner of Allen &amp; Buckeridge III fund where he led the firm’s investments in Hitwise, eKit, Wishlist and Next Generation Entertainment. Frank currently serves as Chairman of eKit Inc. and a director of Hixon Properties, Inc. and the Pacer Foundation (Charitable).</p>\n\n<p>Prior to joining Allen &amp; Buckeridge in 1999, Frank was the SVP of Virtual Music Entertainment (Boston) where he ran the company’s operations up through its successful acquisition by Namco Entertainment (Japan). Before VME, Frank was the founder of Contexture Systems (tools for Unix workstations), where he managed the company through its eventual sale to Bridge Builder Technologies and Decalog (now part of Sunguard Financial).</p>\n\n<p>Recently, Frank has been an independent director and consultant to YellowPages.com where he led the company through its successful sale to SBC Communications (NYSE: SBC) and Bell South (NYSE: BLS) in November 2004. He was also a director of Cogent Data technologies through its sale to Adaptec Inc (NASDAQ: ADPT) in June 1996. Both of these transactions represented significant returns for the shareholders.</p>\n\n<p>Frank received his MBA from Harvard University as well as a BA (cum laude) from Harvard University.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0003/0460/30460v1-max-150x150.jpg"],[[100,150],"assets/images/resized/0003/0460/30460v1-max-250x250.jpg"],[[100,150],"assets/images/resized/0003/0460/30460v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"DFJ Frontier","permalink":"dfj-frontier","type_of_entity":"financial_org","image":{"available_sizes":[[[150,40],"assets/images/resized/0001/9359/19359v1-max-150x150.png"],[[250,68],"assets/images/resized/0001/9359/19359v1-max-250x250.png"],[[305,83],"assets/images/resized/0001/9359/19359v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Venture Partner","firm":{"name":"Southern Cross Venture Partners","permalink":"southern-cross-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,39],"assets/images/resized/0003/0451/30451v1-max-150x150.jpg"],[[250,65],"assets/images/resized/0003/0451/30451v1-max-250x250.jpg"],[[320,84],"assets/images/resized/0003/0451/30451v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}