{"first_name":"Frank","last_name":"Bursic","permalink":"frank-bursic","crunchbase_url":"http://www.crunchbase.com/person/frank-bursic","homepage_url":"http://www.rentricity.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Rentricity","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Aug 19 19:44:50 UTC 2010","updated_at":"Thu Aug 19 23:25:53 UTC 2010","overview":"<p>Mr. Bursic has nearly thirty years of experience in the energy and power industries and has held high-level positions such as COO and Senior Vice President in a variety of companies, ranging from small organizations to Fortune 500 companies. Mr. Bursic has held positions of responsibility in a variety of disciplines, including Training, Machining Operations, Project Management, Engineering Design, Operations, Business Development, and Sales and Marketing. He has extensive experience in engineering design, field and machining operations, and new product development.</p>\n\n<p>Prior to joining the Rentricity team in May 2007, Mr. Bursic owned his own company for more than six years, and consulted in a variety of different markets and industries. He has served as Project Manager/Liaison for the construction of a large athletic/performance/dining facility, and has introduced and assisted in the establishment of a Masters Program in Nuclear Operation and Management as well as several Certificate programs in Nuclear Operations at the School of Engineering at the University of Pittsburgh.</p>\n\n<p>Originally from Pittsburgh, Pennsylvania, Mr. Bursic has a Master of Science Degree in Industry Engineering (Engineering Management and Manufacturing Systems) and a Bachelor of Science in Electrical Engineering (Academic Minor: Mathematics) from the University of Pittsburgh. Mr. Bursic also obtained his MBA Essentials Certificate from the Katz Graduate School of Business at the University of Pittsburgh.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Regional Director","firm":{"name":"Rentricity","permalink":"rentricity","type_of_entity":"company","image":{"available_sizes":[[[100,100],"assets/images/resized/0004/2525/42525v1-max-150x150.jpg"],[[100,100],"assets/images/resized/0004/2525/42525v1-max-250x250.jpg"],[[100,100],"assets/images/resized/0004/2525/42525v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}