{"first_name":"Frank","last_name":"Ganis","permalink":"frank-ganis","crunchbase_url":"http://www.crunchbase.com/person/frank-ganis","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jul 29 17:53:25 UTC 2008","updated_at":"Tue Jul 29 17:56:26 UTC 2008","overview":"<p>As Vice President of Business Development at <a href=\"http://www.crunchbase.com/company/event-innovation\" title=\"Event Innovation\">Event Innovation</a>, Frank Ganis is focused on developing strategic partnerships, marketing, branding, public relations, event management and generating sales leads. He has also been involved with refining product concepts and prototypes for both venues and attendees.</p>\n\n<p>Frank has spent the past 15 years developing, launching and growing a series of innovative eLearning and eCommerce ventures for education, financial services, media and retail companies. Most recently, Frank was the head of business development at Blackboard Inc. {link to www.blackboard.com} (NASDAQ: BBBB) where he was responsible for creating and managing strategic partnerships with leading technology providers, content publishers and services companies.</p>\n\n<p>Prior to Blackboard Frank gained extensive executive experience in marketing, business development, and product management at Sylvan Learning Systems, MCI, News Corp, Capital One, The St. Paul Companies and USF&amp;G. He was the first Vice President of Marketing for eSylvan which offered online tutoring with live voice instruction between teachers and students, as well as an online social network for parents of tutored students. At Capital One, Frank launched a series of leading-edge Web-based products for teens and young adults, including Visa Buxx, the first national stored-value card for students, OneRamp, a free Internet access and Web portal service for cardholders, and LoanMobile, the company&#8217;s first Web site for auto loans. At USF&amp;G Insurance, which was later acquired by The St. Paul Companies, he founded the Multimedia Commerce group and introduced online insurance sales through a series of Web sites for consumers, business-to-business and independent sales agents.</p>\n\n<p>While at MCI/News Corp. Internet Ventures, Frank led the development of YourMoney.com, a pioneering Web-based personal finance community. In addition, he also helped create the first Web properties for several Twentieth Century Fox and Fox Network entertainment properties. At MCI Communications, he managed a series of interactive entertainment multimedia trials and directed the design of the first Web sites for retailers such as Macy&#8217;s, Brooks Brothers and Neiman Marcus&#8217; Horchow Catalog. Also at MCI, Frank had the privilege of working on a team led by Vinton Cerf who is regarded as the &#8220;Father of the Internet.&#8221;</p>\n\n<p>Frank began his career as a Member of Technical Staff at AT&amp;T Bell Labs where he developed software for distributed database systems, interactive ISDN applications for consumers, and Viewtron, an interactive television venture funded by AT&amp;T, Knight-Ridder and CBS. During this same period Frank became an active member of several regional theatre groups, appearing in leading roles in shows such as Deathtrap, Alone Together, Catch Me if You Can, Once Upon a Mattress and Murder in the Cathedral. This led to his involvement in producer&#8217;s and playwright&#8217;s workshops for reviewing and developing new plays and musicals, sponsored by the Theatre Development Fund, The New York State Council on the Arts, and The New Jersey State Council on the Arts.</p>\n\n<p>Frank earned a Bachelor of Science degree in Computer Science from Penn State and an MBA from The Wharton School. A popular public speaker, he is a member of the Wharton Club of Washington. During high school and college Frank performed weekly as a popular church organist. An avid writer, Frank authored 119 Days: From Sputnik to Explorer which comments on the cultural influences of the space race. He was the youngest winner of the Spirit essay contest sponsored by KYW Newsradio in Philadelphia during the United States Bicentennial. His essay is one of twenty that are slated to be read on Independence Mall in Philadelphia during the country&#8217;s tricentennial celebration in 2076.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"VP Business Development","firm":{"name":"Event Innovation","permalink":"event-innovation","type_of_entity":"company","image":{"available_sizes":[[[115,48],"assets/images/resized/0002/2892/22892v1-max-150x150.png"],[[115,48],"assets/images/resized/0002/2892/22892v1-max-250x250.png"],[[115,48],"assets/images/resized/0002/2892/22892v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}