{"first_name":"Frances","last_name":"Himes Cairns","permalink":"frances-himes-cairns","crunchbase_url":"http://www.crunchbase.com/person/frances-himes-cairns","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Myriad Tech","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Sep 01 17:58:46 UTC 2008","updated_at":"Wed Sep 03 00:36:10 UTC 2008","overview":"<p>Frances has held several executive positions in the technology industry as Sr. Vice President of Education at Audible, Sr. Director of Apple Education, Associate VP of Education at Macromedia, General Manager of Dell Learning and Director Global Commercial Marketing Services, Dell.  </p>\n\n<p>Frances has developed and brought to market several successful product lines at Apple, Audible, Dell and for Thomson Inc.  She has held P&amp; L responsibility ranging from $250m to $1 billion and has demonstrated experience in building new revenue streams and growing both channel and direct businesses.  She has the ability to create and deliver on new ground breaking product categories with demonstrated results in delivering profitable go to market strategies including iTunes U, Audible Ed, ichapters.com to name a few.</p>\n\n<p>Prior to her industry experience Frances served as an administrator in higher education at the University of Arizona, University of Wisconsin Eau Claire, Western Michigan University and University of Findlay.  She is a recipient of a Fulbright scholarship and raised over $10 million in federal and private grants to support technology research and international development.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Board Member","firm":{"name":"Myriad Tech","permalink":"myriad-tech","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0002/4447/24447v2-max-150x150.png"],[[250,100],"assets/images/resized/0002/4447/24447v2-max-250x250.png"],[[417,167],"assets/images/resized/0002/4447/24447v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}