{"first_name":"Frank","last_name":"Langston","permalink":"frank-langston","crunchbase_url":"http://www.crunchbase.com/person/frank-langston","homepage_url":"http://paybygroup.com","birthplace":"","twitter_username":"franklangston","blog_url":"","blog_feed_url":"","affiliation_name":"Root Orange","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Mar 01 21:55:26 UTC 2010","updated_at":"Mon Oct 31 20:26:56 UTC 2011","overview":"<p>Frank is founder and President of PayByGroup where he is responsible for product development and all day-to-day operations. </p>\n\n<p>PayByGroup is a group payment platform that means no single person is on the hook for group purchases like vacation rentals, concerts, sporting events, etc. PayByGroup integrates directly with merchants and employs a Kickstarter model where payments only go through once a minimum number of people have bought in. PayByGroup is a 500 Startups company and Frank&#8217;s second venture with Camilo Acosta.</p>\n\n<p>In 2008 Frank co-founded Root Orange, a domain-splitting business that allowed a different business in every city to use the exact same domain name at the same time.</p>\n\n<p>Before starting Root Orange, Frank oversaw Mr. Pride, a chain of four full-service, headache-full car washes owned by his family.  Prior to that, Frank worked for technology startup Vehicle IP, where he assisted the successful negotiation of contingency litigation agreements, which he somehow found interesting.  To this day it is unclear how anyone could find this interesting.  He has also worked for Pittco Management, a private family office.  During his young days of untarnished idealism, Frank tried to resolve partisan bickering by working for both Congressman Harold Ford Jr.(D-TN) and former Senate Majority Leader Bill Frist (R-TN).  Congress is still debating the success of his efforts.</p>\n\n<p>When he has time off, Frank enjoys flag football and games of pick-up basketball.  Frank is passionate about education reform and hopes to see the day when everyone can get a quality education like he did.</p>\n\n<p>Frank received his B.A. in Public and International Affairs from Princeton University, where he was captain of the Sprint Football team, which contrary to popular belief is a varsity sport, and received Academic All-Ivy honors.  </p>","image":null,"degrees":[{"degree_type":"A.B.","subject":"Woodrow Wilson School of Public and International Affairs","institution":"Princeton University","graduated_year":2006,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder & President/COO","firm":{"name":"PayByGroup","permalink":"paybygroup","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0015/9844/159844v2-max-150x150.png"],[[250,250],"assets/images/resized/0015/9844/159844v2-max-250x250.png"],[[450,450],"assets/images/resized/0015/9844/159844v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"co-President","firm":{"name":"Root Orange","permalink":"root-orange","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}