{"first_name":"Francis","last_name":"Pickworth","permalink":"francis-pickworth","crunchbase_url":"http://www.crunchbase.com/person/francis-pickworth","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 31 07:15:46 UTC 2012","updated_at":"Sat Aug 04 13:41:43 UTC 2012","overview":"<p>Francis Pickworth is an experienced media and marketing professional who lends his consulting experience to numerous companies throughout the world. The young professional has unique insights into the needs and workings of online marketing methods. He’s been referred to as a guru for his innate sense of reaching customers electronically.\nLike most people, Pickworth started on the path of his current career while in college. Attending a prominent school in New Zealand, he graduated with a bachelor’s degree in media studies and international relations. Three years later he completed more schooling, this time with a degree in business, where he received joint honors in marketing and management. Early on, Pickworth realized that, in order to succeed, he needed to take schooling very seriously. \nAfter graduating, Pickworth took a position at Oglivy PR. Here, he was in charge of recruiting and interviewing potential team members. As team leader, he built up a strong and dedicated marketing staff. His efforts catapulted the company into a new level of success. He was also in charge of promotional events and staff management and financial programs.\nPickworth moved on from that position to become marketing coordinator for Calvin Klein Jeans. While working for the fashion giant, he orchestrated international deals and marketing strategies. Along with increasing the company’s revenue and attention, he assisted in establishing the second largest retailer in New Zealand. This position proved to be a keystone in his knowledge of large-scale ad campaigns.\nHis success with Calvin Klein propelled him into an even more exciting position. He graduated to work with Google Adwords, taking part in huge viral ad campaigns. This was a chance for Francis Pickworth to really utilize the material he had been accumulating for years. As an account manager, he earned the chance to work directly with companies, helping them reach their desired customer base.\nFrancis Pickworth is an in demand marketing professional. His diverse training and skill set makes him ideal for any position that involves contacting consumers. He knows the ins and outs of the industry. For Pickworth, marketing and advertising is the foundation of business.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/3632/203632v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/3632/203632v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/3632/203632v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}