{"first_name":"Frank","last_name":"Cooper","permalink":"frank-cooper","crunchbase_url":"http://www.crunchbase.com/person/frank-cooper","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"PepsiCo  Frito-Lay","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Fri May 14 20:27:25 UTC 2010","updated_at":"Fri May 14 20:27:25 UTC 2010","overview":"<p>As Senior Vice President, Chief Consumer Engagement Officer of PepsiCo Americas Beverages, Frank Cooper III is charged with leading the development of a new consumer engagement model for PAB and creating breakthrough marketing programs across the PAB portfolio.  In addition, he has direct oversight of key operational areas across PAB that determine consumer engagement, including Digital, Media, Sports, Multicultural and Entertainment.  Prior to his current position, Cooper served as Chief Marketing Officer, Sparkling Beverages for Pepsi-Cola North America (PCNA), where he played a critical role in transforming the company’s soft drink portfolio.   </p>\n\n<p>Before joining Pepsi, Cooper worked in other entertainment and technology businesses for some of the world’s most iconic brands including Senior Executive at Motown, Tommy  Boy &amp; Def Jam Records; co-founded UBO.com; and Vice President of Interactive Marketing at AOL.  Cooper holds a Juris Doctorate degree from the Harvard Law School, where he served as the Supreme Court Editor of the Harvard Law Review and currently serves as Chairman of the American Advertising Federation (a leading advertising trade association with over 40,000 members) and is a member of the Board of Directors for Business for Diplomatic Action. </p>","image":{"available_sizes":[[[140,150],"assets/images/resized/0008/7213/87213v1-max-150x150.jpg"],[[234,250],"assets/images/resized/0008/7213/87213v1-max-250x250.jpg"],[[388,413],"assets/images/resized/0008/7213/87213v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"SVP, Chief Consumer Engagement Officer","firm":{"name":"PepsiCo  Frito-Lay","permalink":"pepsico-frito-lay","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}