{"first_name":"Frank","last_name":"Lin","permalink":"frank-lin","crunchbase_url":"http://www.crunchbase.com/person/frank-lin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Nov 23 16:05:00 UTC 2008","updated_at":"Sun Nov 23 16:10:24 UTC 2008","overview":"<p>Frank is a Principal in Newbury&#8217;s Redwood Shores office, focusing on software, Internet, and wireless investments. He has been with the firm since 2004. Frank is a Board observer at NextBio and Sensor Platforms, and helped make the firm&#8217;s investments in MetaLINCS (acquired by Seagate), Andigilog (acquired by Standard Microsystems), BDNA, and Echovox.</p>\n\n<p>Prior to joining Newbury, Frank was a Principal at Panasonic Ventures, the venture capital arm of Matsushita Electric, where he helped drive investments in P-Cube (acquired by Cisco), Premier Retail Networks (acquired by Thomson), Raindance (RNDC), MontaVista Software, and Intacct. While at Panasonic Ventures and Panasonic Internet Incubator, Frank structured numerous revenue-generating partnerships between Panasonic&#8217;s business units and other technology companies.</p>\n\n<p>Prior to Panasonic Ventures, Frank was at Salomon Smith Barney&#8217;s Technology Investment Banking Group in San Francisco with deal experience in M&amp;A, equity offerings and private placements for software, semiconductor, and networking equipment companies. Previously, Frank was a Financial Analyst in the M&amp;A Group of Salomon Smith Barney in New York. He was also a Summer Associate at Goldman Sachs Investment Banking Division in Hong Kong.</p>\n\n<p>Frank holds an A.B. with honors in Applied Mathematics from Harvard and an M.B.A. from the Haas School of Business at the University of California at Berkeley.</p>\n\n<p>Frank enjoys architecture, hiking, and jazz. He and his wife currently live in San Mateo. </p>","image":{"available_sizes":[[[110,150],"assets/images/resized/0002/9270/29270v1-max-150x150.jpg"],[[110,150],"assets/images/resized/0002/9270/29270v1-max-250x250.jpg"],[[110,150],"assets/images/resized/0002/9270/29270v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Principal ","firm":{"name":"Newbury Ventures","permalink":"newbury-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,47],"assets/images/resized/0002/9265/29265v1-max-150x150.jpg"],[[250,78],"assets/images/resized/0002/9265/29265v1-max-250x250.jpg"],[[254,80],"assets/images/resized/0002/9265/29265v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}