{"first_name":"Frank","last_name":"Adams","permalink":"frank-adams-2","crunchbase_url":"http://www.crunchbase.com/person/frank-adams-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Grotech Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Nov 17 09:16:43 UTC 2008","updated_at":"Wed Jun 29 14:11:11 UTC 2011","overview":"<p>Frank Adams is the Managing General Partner and founder of Grotech Ventures. He is the principal architect of the Grotech Ventures structure, investment strategy and portfolio management. Frank’s investment activities focus on Information Technology including healthcare IT, e-commerce, and Digital Media. He is responsible for a number of successful Grotech Ventures investments, including but not limited to DIGEX, Fieldglass, Global Software, HealthScribe, Interspec, Master Power, United BioSource Corp. and USinternetworking. Frank is also active on several current portfolio company boards, including Hillcrest Labs and iBiquity Digital.</p>\n\n<p>Prior to joining Grotech Ventures, Frank had hands-on operating experience with small and moderate sized firms in start-up, rapid growth, turnaround and international situations. He has held senior executive positions with NYSE/OTC public and private firms including PHH Group, Inc.; RLC/Matlack, Inc.; Westinghouse Electric Corporation; and TMS, Inc.</p>\n\n<p>Frank is Chairman Emeritus of the Mid-Atlantic Venture Association (MAVA), which he co-founded and managed as president from 1986 to 1999 and as chairman from 1999 to 2002. Under Frank’s leadership, MAVA became one of the most active and influential venture organizations in the nation, growing to 375 venture professionals in 127 firms and 265 service provider leaders. In addition, Frank has also served as the Chairman of the Maryland Technology Development Corporation (TEDCO), an organization fostering technology commercialization in the state of Maryland.</p>\n\n<p>Frank graduated from the University of Baltimore in 1967 and 1972 with a B.S. in Business Administration and a Juris Doctor degree, respectively, and has also successfully completed advanced management programs at Stanford University in Finance and the Harvard Business School in Information Technology. He is a past member of the Pennsylvania and American Bar Associations and the Board of Visitors of the University of Maryland at College Park, UMBC and the University of Baltimore, as well as a director of the University of Maryland, University of Baltimore and Lyric Opera Foundations.</p>","image":{"available_sizes":[[[75,94],"assets/images/resized/0014/1740/141740v2-max-150x150.jpg"],[[75,94],"assets/images/resized/0014/1740/141740v2-max-250x250.jpg"],[[75,94],"assets/images/resized/0014/1740/141740v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner and Founder","firm":{"name":"Grotech Ventures","permalink":"grotech-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,78],"assets/images/resized/0002/9090/29090v1-max-150x150.png"],[[167,87],"assets/images/resized/0002/9090/29090v1-max-250x250.png"],[[167,87],"assets/images/resized/0002/9090/29090v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}