{"first_name":"Frank","last_name":"A. Bennack, Jr","permalink":"frank-a-bennack-jr","crunchbase_url":"http://www.crunchbase.com/person/frank-a-bennack-jr","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Oct 09 05:24:34 UTC 2009","updated_at":"Fri Oct 09 05:24:58 UTC 2009","overview":"<p>Frank A. Bennack, Jr. is the chief executive officer of Hearst Corporation, one of the nationís largest private companies engaged in a broad range of publishing, broadcasting, cable networking and diversified communications activities. He is in his second tenure as CEO and in his first, served as Hearstís CEO for more than 23 years. He is also presently vice chairman of the Hearst Board of Directors and chairman of the Corporationís Executive Committee.</p>\n\n<p>Bennack is also a director of Hearst Corporation and a Trustee of The Hearst Family Trust established under the Will of William Randolph Hearst. In addition, he sits on a number of corporate committees and The Hearst Foundation boards where he has served for more than 25 years. </p>\n\n<p>After his first tenure as president and CEO began in 1979, Bennack directed the Company through an unprecedented period of growth, increasing revenues sevenfold and growing earnings to 13 times what they had been, through investments, acquisitions and start-ups. Today, the Company comprises some 200 separate businesses with approximately 20,000 employees.</p>\n\n<p>Under Bennackís leadership, the company launched with ABC three leading cable networks, A&amp;E, History and Lifetime, plus its investments in the ESPN family of networks. On his watch, Hearst acquired 11 newspapers, including two of the nationís largest, the Houston Chronicle and the San Francisco Chronicle, two trade publishing companies, three major consumer magazines, a television production operation, various syndication and distribution businesses and multiple television stations. Bennack also led the company into expanded investments outside of the United States. During his tenure, Hearst has launched such magazines as Country Living, O, The Oprah Magazine, Marie Claire and SmartMoney.</p>\n\n<p>Bennack was instrumental in the decision to create what today is Hearst Television Inc., one of the nationís largest non-network owned television station groups which operates 29 television stations. In 2009, he directed a merger between Hearst Broadcasting and Hearst-Argyle Television resulting in Hearst-Argyle becoming a wholly-owned private subsidiary of Hearst Corporation. Bennack was an original board member of Hearst-Argyle Television, and before being named chairman in 2008 was presiding director. Hearst folded its television holdings into Hearst-Argyle Television in 1997, forming a public company.\nPrior to his first tenure as chief executive, Bennack served as executive vice president and chief operating officer of the Corporation and, prior to that, as vice president and general manager of the Hearst Newspaper Group. He also served in a variety of management posts, including a seven-year tenure (1967-1974) as publisher and editor of the San Antonio Light.</p>\n\n<p>Bennack is a director of Polo Ralph Lauren Corporation. He is chairman of The National Magazine Company Limited of Great Britain, a wholly-owned subsidiary of Hearst Corporation. Bennack is also a governor and vice chairman of New York-Presbyterian Hospital and its Healthcare System, a managing director of the Metropolitan Opera of New York, chairman of Lincoln Center for the Performing Arts, and chairman of The Paley Center for Media (formerly The Museum of Television &amp; Radio). He was the 1992-93 chairman of the Newspaper Association of America (formerly the American Newspaper Publishers Association).\nAs a teenager, the San Antonio native was host of both television and radio programs. He eventually entered publishing in his hometown, and rose from classified advertising salesman to newspaper publisher by the age of 34.</p>\n\n<p>Bennack has received honors for his charitable work from such organizations as the American Heart Association, United Cerebral Palsy and the Inner City Scholarship Fund of New York. His industry awards include the Gold Medal from the International Radio &amp; Television Society in 1991, the Trusteesí Award (Emmy) from the National Academy of Television Arts and Sciences in 1993, the 1997 Center for Communication Award, the Distinguished Public Service Award from the Advertising Council in 1999, and the 1999 Distinguished Service Award from the National Association of Broadcasters. In 2007, he was elected into the American Academy of Arts and Sciences.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Vice Chairman and Chief Executive Officer","firm":{"name":"Hearst Corporation","permalink":"hearstcorporation","type_of_entity":"company","image":{"available_sizes":[[[150,15],"assets/images/resized/0002/1009/21009v1-max-150x150.png"],[[250,25],"assets/images/resized/0002/1009/21009v1-max-250x250.png"],[[266,27],"assets/images/resized/0002/1009/21009v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}