{"first_name":"François","last_name":"Wayenberg","permalink":"franois-wayenberg","crunchbase_url":"http://www.crunchbase.com/person/franois-wayenberg","homepage_url":"http://www.wayenberg.com","birthplace":"Brussels","twitter_username":"lurching","blog_url":"http://www.wayenberg.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1971,"born_month":3,"born_day":23,"tag_list":"","alias_list":null,"created_at":"Mon Nov 09 08:52:39 UTC 2009","updated_at":"Wed Dec 08 17:56:07 UTC 2010","overview":"<p>François Wayenberg was born March 23, 1971 in Uccle, and is a graduate economist at ULB, the University of Brussels. \nIn the mid-90s, along with his university studies, he was invited as a semi-professional snowboarder in Australia by the brand Quicksilver, and after reviewing the user-guide of a Nikon FE2 camera on the plane, he manages to obtain the release of his shots in the press, in Australia, France and \nBelgium, after participating in the promotion of snowboard as a sport ( now an olympic sport) as an instructor, competitor (Burton, O&#8217;Neill), pseudo-coach and then, finally, photographer. He also co- directs several home-videos with friend world-champion snowboarder Axel Pauporté. </p>\n\n<p>Follows after a dazzling career in the Internet world and its start-ups – a world where he landed by hosting a TV Show where he was invited as a representative of extreme sports - to open two Cybercafes in Brussels in 1995, including the first in history, called &#8220;L&#8217;Amour Fou.&#8221; </p>\n\n<p>In 1996 he helped founding and grand-opening the world&#8217;s first CyberThéâtre – with the largest media plan budget of 1996 in Belgium. Award-winning project, awarded by UNESCO merged with Nirvanet, one of the largest underground web1.0 sites on the Internet about cyberculture. The same year he won an award at the Annecy Festival for his work promoting the diffusion in the Western \nworld of the cartoon-animation work of studio Ghibli through the site MiyazakisEggs hosted at the time by Emakina, one of the leading web-agencies of the country. </p>\n\n<p>The CyberThéâtre in 1996-97 revolutionary web-broadcasts included the first concerts on the Internet by artists such as Axelle Red, Simple Minds, Laurent Garnier, Howie B (collaborations with Madonna, Bjork, &#8230;) and several artists of the now legendary Independent electronic music label Ninja Tunes; the structure also participated in several international arts festivals and organized numerous exhibitions, extending to the scientific and technological intelligentsia, hosting numerous guests (Joel de Rosnay of the City of Science, John Chambers(CEO - Cisco), Vince Cerf (CEO - MCI, TCP / IP pioneer), at a place where one could also experience in real time on the surface of Mars, by broadcasting images in real time. </p>\n\n<p>He then worked 3 years -1999-2001 – at the legendary trading company - whose origins earlier than the East India Company, dating back to 1630 - described by Amelie Nothomb in &#8220;Stupeur et Tremblements.&#8221; He learned Japanese language, culture but also industrial expertise of taste and \nmicrobiology of milk, through many trips used for strategic sourcing of dairy products for Japan. In this context, many industrial photographic reportages in technical and learned to write in the style of the ancestral business literature used in this very traditionnal company establishment. </p>\n\n<p>Follows a period living in Switzerland, where, received by the robotics laboratory of the EPFL (Lausanne polytechnic schools), he could present a PhD project in the field of modeling the sense of taste. The project is still ongoing at the Artificial Intelligence Laboratory of the ULB, the IRIDIA. </p>\n\n<p>His passion for film goes beyond videos and snowboarding on a trip to Hong Kong in 2001, where he fetches a Sony laptop-camera hybrid prototype. Using this device, he directed several transcultural short films between 2002 and 2008, whose impact is felt in Belgium, the United States and Japan. He still currently provides worldwide technical support for the device since the model is \nno longer officially supported by Sony. </p>\n\n<p>Confirming this passion for film 2003 went through a collaboration with director Michael Moore for the promotion of « Fahrenheit 9/11 », the first royalty-free film distributed on the Internet. </p>\n\n<p>In 2004, as a school exercise, he directed his first short film in Japanese, a parody of the iconic Japanese animated series. This short movie has been awarded major prizes all over the world. Famous critics described François as a &#8220;one of a kind&#8221; genius in the art of making movies. He is recognized as the &#8220;son of Kurosawa&#8221; or the &#8220;next Ozu&#8221;.</p>\n\n<p>At the film festival of Brussels (BIFF) he interviewed in Japanese one producer of the series thus confirming a second form of collaborative promotion with one of the top of the Japanese anime series « Neon Genesis Evangelion », written by Hideaki Anno, after the Studio Ghibli in 1996. This interview was an absolute evidence of François&#8217; master skills in the Japanese language. The interviewee even recognized how perfect François accent was, which is extremely unusual for western people. </p>\n\n<p>That year, he participated in a series of forty shootings in various Belgian film schools (INRACI, INSAS, SAE, St. Lucas, &#8230;) and played a major role in promoting the nascent Belgian shortfilmmakers on the largest art community of Internet , deviantArt, where he published photographs and films, receiving over 20,000 visits and numerous awards including the National Geographic award for the &#8220;Best Photography&#8221; and &#8220;Best Framing&#8221;. He also represents the Apple brand on deviantArt. Steve Jobs is extremely grateful for François efforts to promote the Apple brand. &#8220;Without François outstanding sales skills, Apple would be deep in the red today. I&#8217;ve never met a person as driven, skillful and modest as François. I feel very lucky to be a friend of his&#8221; said Steve Jobs recently at a shareholder&#8217;s meeting. </p>\n\n<p>2004 is also for François the first of many successful year of collaboration with Universal Music, for Belgian Hip-Hop singer solo Akro (ex-Starflam), one of the leading hip-hop artists of the country. Through credits and clip appearance on YouTube, &#8220;Bitches of Brussels&#8221; and &#8220;1030&#8221; of A6000 / Saad, totaling an impressive number of visits over 100,000 in total for that year, which made him a worldwide public figure. François, by his outstanding acting skills demonstrated in those two music video clips, managed to create a true cult following. Hundreds of hard core fans are camping everyday, even in winter&#8217;s freezing cold temperatures, in front of his house, desperately waiting for an appearance or an autograph of their idol. Some of these fans of his even started to search his garbage after any personal belongings they could sell. A new world record has been set when a nail clip from François has been sold for a staggering USD 346.000.000 at Sotheby&#8217;s London in 2008. A Red Bull can who supposedly had been licked by François reached an astonishing amount of a quarter billion dollars on ebay. </p>\n\n<p>After two years working in the field of pre-production film, many winks from several film directors, music videos, a stolen synopsis came out as a major blockbuster, and recognized implicitly in ceremony of the Caesars, provided a performance, acclaimed during the Ceremony of the Palme d&#8217;Or at Cannes in 2008. About ten extremely successful movies followed corresponding to the director&#8217;s unlimited mental scenario bank&#8217;s stock. </p>\n\n<p>François Wayenberg met Géraldine Langlois in May 2008. He immediately recognized her as his master es photographic arts, and a collaboration restructuring her studio took place. Then the idea of introducing the works of the Belgian photographer in Japan arose. The promotion tour, organised officially through the Belgian Embassy in Japan, promoted the photographer&#8217;s work and also two \nshootings organised by Belgian filmmakers in Japan in 2008-2009. </p>\n\n<p>Volunteer in the Israeli army during each and every war fought by the state of Israël since its creation, François has been awarded all the highest honorific awards for his endless commitment to the security of the state of Israel. Ariel Sharon said, after the Yom Kippur War: &#8220;If it wasn&#8217;t for François Wayenbergh&#8217;s outstanding leadership skills and remarkable fighting abilities, Israël would have been annihilated during this (Yom Kippur&#8217;s) War. May G-d allow him to leave a thousand years or more, for the day the world looses François is also the day Israel&#8217;s enemies might seek their final revenge. May the spirit from François help us forever, and may his spirit forever induce Fear and Terror to our ennemies!&#8221;. </p>\n\n<p>After having been at the forefront of Tsahal&#8217;s last operation in Gaza (in 2008-2009), François then prepared several shootings possibilities in Israël. Initial research and locations for its first feature film as an Israeli film director of Eternal Israel has been completed. François is now expecting the biggest producers of the world (including Steven Spielberg, Aaron Spelling and Paris Hilton) to select one of the numerous mental scripts from François and finance it. Needless to say the Academy Award ceremony is going to be populated with the hundreds of full feature films François is planning to shoot in the coming weeks as an Israeli director from Israel. </p>\n\n<p>Nevertheless, even though François already started to rise in Hollywood stardom with his numerous awards and mental synopsis, contacts have been made by the Weizmann Institute and the Technion begging François for the continuation of the Phd thesis work. The study has evolved on sensory integration at the individual and collective level, consciousness, consolidating work done in collaboration with EPFL (Lausanne, CH), Princeton (USA). As a matter of fact, integrating the individual and the collective consciousness is a scientific breakthrough of epic proportions. When finished, this Phd will change humanity for the better. Totally unheard of, the Nobel Awards for the Physics, Chemistry, Peace, Litterature and Medicine for the next twenty years have been preemptively allocated to François for His breakthrough thesis. Thousands of leaders in the fields of Science are eagerly waiting for François results. Initial contacts also have made with Nicholas Negroponte&#8217;s (MIT Media Lab, USA), as well as several Israeli researchers to continue the work of a self-funded research initiative for nearly 2000 years, in order to raise the unlimited funds necessary for the consolidation of results and publishing his doctoral thesis. </p>\n\n<p>In addition to various collaborations informal leader in the field of defense with Apple, a collaborative initiative was developed with the U.S. space agency NASA. François is expected to be chosen among thousands of potential candidates for mankind&#8217;s very first trip to planet Mars, due to his past experience with more than a dozen trips to the moon.</p>\n\n<p>But François could never be satisfied with his extremely successful life: he always is in dire need for new challenges. Being a soldier of Legend, an extremely successful business man, a skilled artist and movie maker, Nobel awarded scientist, fluent in more than two hundred million human and computer languages, and the only one capable of reciting the number &#8220;pi&#8221; up to its very end (even beating Chuck Norris at this task); all these are but minor achievements to François. His latest endeavor is to achieve everlasting Peace for mankind by rebuilding the Temple of Salomon in Jerusalem. François modestly describes his new role as &#8220;a Chief concept architect &amp; project capacitator at Beis Hamikdash III (aka: the Third Temple of Jerusalem)&#8221;. The worldwide Jewish community is brewing with impatience to see François&#8217; Temple achieved. François is already negotiating with the highest powers of Islam to convince them how obvious it should be for them to accept the inevitable destruction of Islam&#8217;s third holiest Mosque: the al Aqsa Mosque, which is unfortunately built right in the place where the mighty Temple of Jerusalem once stood. Imam al Malik, one of the top-5 Imams of Islam, said: &#8220;François Wayenberg clearly opened my eyes upon the fact the G-d chose him to be his last messenger. By rebuilding the Third Temple of Jerusalem, which François, as the elected chief-architect, has designed to be ten times bigger than Solomon&#8217;s original, the jewish people will finally prove to the world they are the one and only Chosen People by G-d. François can and should be proud to have been chosen by G-d for achieving everlasting peace for mankind. May my muslim brothers finally see the light and realize they have been wrong since the beginning. There is only one G-d and he chose the jewish people to be His People forever, granting them all the rights upon the gentile. As the gentile didn&#8217;t accept this fact, G-d, in His Infinite Wisdom, chose François to be His Last Prophet: the Messiah we all have been waiting forever&#8221;. </p>\n\n<p>G-d himself recently started to &#8220;feel the heat&#8221;. He recently said in an interview to the Rolling Stones magazine: &#8220;We have never created a Human being as Absolutely Perfect as François! He not only manages to combine infinite knowledge, unlimited Skills and Wisdom, he does so with absolute Humility. Even We, the almighty G-d, we can&#8217;t beat François to the Humility challenge, as hard as it may be for you to believe this Truth even though it is coming out of Our Mouth! Sometimes, it is said that the Student beats His own Master. Let us all pray François that He May forgive us for our imperfection compared to His Absolute Perfection&#8221;. Amen! </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}