{"first_name":"Francis","last_name":"Pelland","permalink":"francis-pelland","crunchbase_url":"http://www.crunchbase.com/person/francis-pelland","homepage_url":"http://www.socialgameuniverse.com","birthplace":"","twitter_username":"francispelland","blog_url":"http://www.pelland.me","blog_feed_url":"","affiliation_name":"Social Game Universe","born_year":1986,"born_month":1,"born_day":15,"tag_list":"","alias_list":null,"created_at":"Sat Sep 25 01:42:26 UTC 2010","updated_at":"Wed Oct 13 18:28:59 UTC 2010","overview":"<p>Francis Pelland is a born innovator and passionate about technology, a recent Carleton University Graduate with a B.A in Law and a minor in Computer Science, starting his first company (FP Cyber Design) at the age of 16 with the support from the Ontario Ministry of Economic Development.  With FP Cyber Design, he successfully launched a number of CMS portals used in various environments ranging from Banking to Academia.   From there, began his focus in e-Commerce, aiding with the creation of the Paypal Developer Certification and becoming one of the first certified Paypal Developers, which then lead to the creation of a company called cy-Mall, an e-Commerce portal that would redefine the way people sold items online through various technologies and social networks.</p>\n\n<p>Social media became a big interest for Francis when he launched his first Facebook application days of the platform launching, which lead to the creation of cy-Designer and various applications, some applications achieving top 100 in Daily Active Users.  Francis has since been heavily involved with the Facebook community, helping other developers and creating connections. cy-Designer created the first request platform on Facebook, that allowed users to submit ideas, have them developed and share the revenue. Francis has also worked along the side of large corporations such as General Motors to develop a social strategy that would raise awareness for customers and helping corporations learn more about their potential customers.  This technology has earned Francis the fbFund prize, awarded by Facebook in 2009.</p>\n\n<p>Francis&#8217; goals are to revolutionize the way people interact with each other and help developers work together to see increased growth.  This goal is coming closer to becoming a reality. He looks forward to the future of social interactions between people and how developers will begin to work together in different ways that were never before possible.</p>","image":null,"degrees":[{"degree_type":"BA","subject":"Law and Computer Science","institution":"Carleton University","graduated_year":2010,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Technical Lead","firm":{"name":"Social Game Universe","permalink":"social-game-universe","type_of_entity":"company","image":{"available_sizes":[[[150,55],"assets/images/resized/0010/2385/102385v2-max-150x150.jpg"],[[250,92],"assets/images/resized/0010/2385/102385v2-max-250x250.jpg"],[[450,166],"assets/images/resized/0010/2385/102385v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.socialgameuniverse.com","title":"Social Game Universe"},{"external_url":"http://www.cy-designer.com","title":"cy-Designer"}],"web_presences":[]}