{"first_name":"Frank","last_name":"D'Amelio","permalink":"frank-damelio","crunchbase_url":"http://www.crunchbase.com/person/frank-damelio","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 27 07:47:40 UTC 2009","updated_at":"Wed May 27 07:50:11 UTC 2009","overview":"<p>Frank D’Amelio is the Chief Financial Officer of Pfizer. Before joining the company in September 2007, he was Senior Executive Vice President of Integration and Chief Administrative Officer of Alcatel-Lucent, responsible for the integration of the combined Alcatel-Lucent, in addition to the supply chain, information technology, real estate, marketing, legal and U.S. labor relations operations of the company.</p>\n\n<p>Prior to the merger of Alcatel and Lucent Technologies in 2006, Frank was the Chief Operating Officer of Lucent Technologies, responsible for leading business operations, including sales, the product groups, the services business, the supply chain, information technology operations and labor relations. In 2001, he was appointed Executive Vice President and Chief Financial Officer of Lucent, where he helped lead the company through one of the most challenging periods in the telecom industry’s history and returned the company to profitability.</p>\n\n<p>When Lucent was spun off from AT&amp;T in 1996, Frank helped establish the financial structure of the new company as the CFO of Lucent’s Network Systems Business and was a critical member of the team that met with investors around the world during Lucent’s initial public offering.  After the IPO, he was appointed the Group President of Lucent’s Switching Solutions Group, where he led the manufacturing, research and development, marketing and product management of Lucent’s multibillion-dollar, global Switching, Access and Application Software businesses.</p>\n\n<p>Born and raised in New Jersey, Frank earned his MBA in Finance from St. John’s University and his bachelor’s degree in Accounting from St. Peter’s College. He started his career in 1979 at Bell Labs, holding a variety of financial, accounting and general management positions, and moved within AT&amp;T, commanding a series of positions with increasing responsibility.</p>\n\n<p>In 2005 and 2006, Frank was ranked among America’s top CFOs by Institutional Investor magazine, and in 2002, he was selected one of the top 10 leaders in his field by Treasury &amp; Risk Management magazine.</p>\n\n<p>He serves on the Board of Directors of Humana, Inc., the Independent College Fund of New Jersey and the JPMorgan Chase National Advisory Board.</p>","image":{"available_sizes":[[[116,150],"assets/images/resized/0004/5642/45642v1-max-150x150.jpg"],[[126,162],"assets/images/resized/0004/5642/45642v1-max-250x250.jpg"],[[126,162],"assets/images/resized/0004/5642/45642v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CFO","firm":{"name":"Pfizer Strategic Investments","permalink":"pfizer-strategic-investments","type_of_entity":"financial_org","image":{"available_sizes":[[[82,55],"assets/images/resized/0004/5639/45639v1-max-150x150.png"],[[82,55],"assets/images/resized/0004/5639/45639v1-max-250x250.png"],[[82,55],"assets/images/resized/0004/5639/45639v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}