{"first_name":"Frank","last_name":"Pho","permalink":"frank-pho","crunchbase_url":"http://www.crunchbase.com/person/frank-pho","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Feb 10 23:28:14 UTC 2008","updated_at":"Thu Jun 04 10:47:10 UTC 2009","overview":"<p>Frank is Head of the Fund Investments Group which currently has commitments to 18 Canadian private capital funds.</p>\n\n<p>Within his new role, Frank will also promote our portfolio companies in Asia, helping them to take advantage of these large markets. In his capacity as the Asia liaison for the Venture Capital division, Frank leads Technology missions to introduce Canadian companies and to help them commercialize their products in Asia. He also advises portfolio companies in their go to Asia market strategy.</p>\n\n<p>Frank was responsible for Venture Capital investments in Information Technology at BDC Capital. Before BDC Capital he was with the Corporate Finance Group at CP Rail. Prior to CP Rail, he was with Ernst &amp; Young (E&amp;Y), involved in planning, design and implementation of Strategic Information Technology plan and Systems Conversion.</p>\n\n<p>Frank had been a guest lecturer at SFU for the Executive MBA program and MBA Information Technology. He is the current Chair of Monte Jade Science Technology Association (2008-2010). Monte Jade is an international organization with 15 chapters in North America and Asia with the mission of promoting the commercialization of Technology companies.</p>\n\n<p>Frank Pho holds a Bachelor of Commerce, a Diploma of Accountancy (graduate degree) from Concordia University and is a member of the Institute of Chartered Accountants of British Columbia.</p>","image":{"available_sizes":[[[81,64],"assets/images/resized/0004/6644/46644v1-max-150x150.jpg"],[[81,64],"assets/images/resized/0004/6644/46644v1-max-250x250.jpg"],[[81,64],"assets/images/resized/0004/6644/46644v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"VP of Fund Investments","firm":{"name":"BDC Venture Capital","permalink":"bdc-venture-capital-2","type_of_entity":"financial_org","image":{"available_sizes":[[[115,57],"assets/images/resized/0001/1190/11190v1-max-150x150.png"],[[115,57],"assets/images/resized/0001/1190/11190v1-max-250x250.png"],[[115,57],"assets/images/resized/0001/1190/11190v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}