{"first_name":"Frederick","last_name":"Tecce","permalink":"frederick-tecce","crunchbase_url":"http://www.crunchbase.com/person/frederick-tecce","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 21 20:01:24 UTC 2008","updated_at":"Fri Nov 21 20:07:54 UTC 2008","overview":"<p>Frederick Tecce is a managing director and counsel of Cross Atlantic. Fred works closely with Don Caldwell on fundraising, as well as overseeing the Cross Atlantic&#8217;s legal issues, including contracts and intellectual property rights and assisting our portfolio where appropriate. Prior to joining, he shared his time between Buchanan, Ingersoll, and Rooney, where he served as of counsel to the firm and the Pennsylvania Public School Employees&#8217; Retirement System Board, where he was appointed by Governor Tom Ridge in 1995, serving as chairman of the finance committee for five years.  </p>\n\n<p>Most of Fred&#8217;s professional career has been spent as a principal in a company that pioneered and licensed new technology in the textile industry. This involved managing a long-term, complex, multi-party lawsuit directed to enforcing the company&#8217;s patent rights. His experience in managing complex litigation was also the basis for his engagement with two other significant businesses whose existence was threatened by lawsuit disputes. In addition, Fred has launched several new businesses from the seed stage as well as having been an investor and active participant in several emerging growth companies.  </p>\n\n<p>Fred holds a B.A. from the University of Pennsylvania and J.D. from the Dickinson School of Law of Pennsylvania State University. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"managing director and counsel","firm":{"name":"Cross Atlantic Capital Partners","permalink":"cross-atlantic-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,67],"assets/images/resized/0002/9155/29155v1-max-150x150.jpg"],[[215,97],"assets/images/resized/0002/9155/29155v1-max-250x250.jpg"],[[215,97],"assets/images/resized/0002/9155/29155v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}