{"first_name":"Fred","last_name":"Luddy","permalink":"fred-luddy","crunchbase_url":"http://www.crunchbase.com/person/fred-luddy","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Service-now.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jul 30 06:48:45 UTC 2008","updated_at":"Sat Sep 06 22:53:40 UTC 2008","overview":"<p>Fred founded Service-now.com in early 2004 and has served as Chief Executive and Technology Officer since inception.  Prior to Service-now.com, Fred was employed at Peregrine Systems from 1990 to 2003 where he held the position of Chief Technology Officer (note that during that time Peregrine also owned the Remedy Corporation, subsequently sold to BMC). Prior to Peregrine, Fred founded Enterprise Software Associates (ESA), and worked at Boole and Babbage, and the Amdahl Corporation.  His products are used by thousands of corporations worldwide and have generated revenue well in excess of one billion dollars. </p>\n\n<p>At the age of eighteen, his very first software program automated supply chain and maintenance purchasing processes for a business unit of American Standard. Later work involved writing an operating system competing with IBM&#8217;s mainframe offering, performance and management improvements to the IBM mainframe environment, a PC video conferencing / collaboration system, and UNIX / Linux based application development environments. Fred tried to attend Indiana University and Sir George Williams University, but found part-time programming for these institutions to be far more compelling than the classroom experience.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Product Officer","firm":{"name":"ServiceNow","permalink":"service-now-com","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0002/3004/23004v8-max-150x150.png"],[[250,84],"assets/images/resized/0002/3004/23004v8-max-250x250.png"],[[450,151],"assets/images/resized/0002/3004/23004v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}