{"first_name":"freedocast","last_name":"freedocast","permalink":"freedocast-freedocast","crunchbase_url":"http://www.crunchbase.com/person/freedocast-freedocast","homepage_url":"http://www.freedocast.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"live-broadcasting, live-streaming","alias_list":null,"created_at":"Fri Oct 01 08:55:34 UTC 2010","updated_at":"Thu Jul 07 14:15:29 UTC 2011","overview":"<p>Live Broadcasting is the distribution of audio and/or video signals which transmit programs to an audience. The audience may be the general public or a relatively large sub-audience, such as children or young adults.</p>\n\n<p>There are wide varieties of broadcasting systems, all of which have different capabilities. The largest broadcasting systems are institutional public address systems, which transmit nonverbal messages and music within a school or hospital, and low-powered broadcasting systems which transmit radio stations or television stations to a small area. National radio and television broadcasters have nationwide coverage, using retransmitted towers, satellite systems, and cable distribution. Satellite radio and television broadcasters can cover even wider areas, such as entire continents, and Internet channels can distribute text or streamed music worldwide. Any person can also broadcast sound or video through podcasting or live through internet broadcasting services.</p>\n\n<p>Freedocast.com is giving a service that which can create his/her own Live broadcasting channel and start making friends, celebrate all your wonderful moments, live chat your family and friends, showcase all your talents online, become a reporter and do much more.</p>\n\n<p>Freedocast.com is a first of its kind service, an effort to break the barriers of traditional online networking and watching videos online. Live broadcasting, live webcasting, which was only affordable by big media corporations, is past now we welcome you to the whole new world of broadcasting, where all you need is a camera and a laptop or a pc and you are all set to start broadcasting.</p>\n\n<p>Start your live broadcasting birthdays, Marriages, broadcasting college events, conferences, and any other special occasion and let your loved once watch you live.</p>","image":{"available_sizes":[[[150,46],"assets/images/resized/0010/3809/103809v2-max-150x150.png"],[[170,53],"assets/images/resized/0010/3809/103809v2-max-250x250.png"],[[170,53],"assets/images/resized/0010/3809/103809v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.freedocast.com","title":"Make your own Live Broadcasting!"}],"web_presences":[]}