{"first_name":"Funky","last_name":"Bid","permalink":"funky-bid","crunchbase_url":"http://www.crunchbase.com/person/funky-bid","homepage_url":"http://www.funkybid.com/","birthplace":"New Delhi","twitter_username":"funkybid","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1982,"born_month":1,"born_day":1,"tag_list":"auction-live, live-auctions, ebid, auction-net, liveauctions, online-live-auction, proxybid","alias_list":null,"created_at":"Sat Oct 29 12:10:59 UTC 2011","updated_at":"Sat Nov 05 02:27:19 UTC 2011","overview":"<p>Funkybid is a fast and fun online auctions site that provides opportunity to the bidders to win cool gadgets and other consumer durables at incredibly low price. The latest range of products that is available for bidding on Funkybid will not only save you time but money and effort also. The online auctions site provides you full control over your finances, and you can win your choicest item at really cool prices from its online auctions. All the latest and trendiest products that are offered by Funkybid come with manufacturer’s warranty. </p>\n\n<p>The site provides you an exciting shopping experience and once you register on it through a fast and simple process; you will be entitled to avail the benefits of great deals that are exclusively available to the registered members of Funkybid only. Participate in the ongoing online auctions now and win your choicest goods at a fraction of the price of their market value. Have fun, save money and save time with Funkybid online auctions. </p>\n\n<p>For more information you may click at: http://www.funkybid.com/</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0016/0025/160025v2-max-150x150.jpg"],[[225,225],"assets/images/resized/0016/0025/160025v2-max-250x250.jpg"],[[225,225],"assets/images/resized/0016/0025/160025v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.funkybid.com/","title":"Funkybid"}]}