{"first_name":"G.H.D. Chinthaka","last_name":"Sanjeewa","permalink":"g-h-d-chinthaka-sanjeeewa","crunchbase_url":"http://www.crunchbase.com/person/g-h-d-chinthaka-sanjeeewa","homepage_url":"","birthplace":"Galle","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1980,"born_month":2,"born_day":2,"tag_list":"","alias_list":null,"created_at":"Fri Dec 19 06:26:04 UTC 2008","updated_at":"Fri Dec 02 22:20:42 UTC 2011","overview":"<p>I am Gardi Hewawasam Dange Chinthaka Sanjeewa. I am a Sri Lankan. I would like to share my knowledge with others around the world. That is why I have designed this site.\nI invite you to visit my web site.</p>\n\n<p>I have been working as a animation and graphic designer in \nNational Online Distance Education Service, Content Development Unit : CDU</p>\n\n<p>FAVORITE LINKS.\n:: Search with MSN\n:: ICT for Professional Education.\n:: LBS for Higher Education.\n:: Sri Lanka&#8217;s No.1 Footwear.</p>\n\n<p>MY PORTFOLIO.\nThis is just a few professional performances that I have done so far.\nI have designed the banner of NODES web. Some of the Universities and institutions to which I have supported.,\n:: University of Colombo\n:: Sri Lanka Institute of Marketing (SLIM)\n:: Post Graduate institute of Medicine\n:: Ladies College\n:: Winston College\n:: Indination Institute</p>\n\n<p>ACADEMIC QUALIFICATION.\n:: University of Colombo - UCSC - I was awarded a certificate for Computer Advanced Multimedia Web Design and Development Techniques at the Institute of Computer Technology in the University of Colombo.</p>\n\n<p>:: Raytronics Computers (Pvt) Ltd - I was awarded a Diploma in Network Administration Course at Raytronics Computers (Pvt) Ltd. (Windows 2000/XP/NT, Server and workstation, Installations, Caballing, LAN/WAN TCP/IP, Backup network with Unattended installation, Disk management, Internet information web server(IIS), Domain naming server(DNS), DHCP, Proxy server setting up Active directory servers-mail server and Remote access server)</p>\n\n<p>:: IDM (Pvt) Ltd - I was awarded a Diploma In Computer Studies at IDM (MS Excel, MS Word, MS Access, Java, Visual Basic, HTML, SQL Server Database Management)</p>\n\n<p>:: Master Works (Pvt) Ltd - I was awarded a certificate for Diploma in Computer  Graphics at Master Works Education Center.(Adobe Illustrator ver 10, Adobe Photoshop ver 7.0, Adobe PageMaker ver 7.1, Scanning and Printing.)</p>","image":{"available_sizes":[[[118,150],"assets/images/resized/0003/2072/32072v2-max-150x150.jpg"],[[148,187],"assets/images/resized/0003/2072/32072v2-max-250x250.jpg"],[[148,187],"assets/images/resized/0003/2072/32072v2-max-450x450.jpg"]],"attribution":"<p>National Online Distance Education Service - Content Development Unit</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}