{"first_name":"Gabe","last_name":"Martinez","permalink":"gabe-martinez","crunchbase_url":"http://www.crunchbase.com/person/gabe-martinez","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jun 29 07:39:12 UTC 2011","updated_at":"Wed Jun 29 07:43:17 UTC 2011","overview":"<p>Gabe Martinez has more than 15 years in the security industry, Martinez has served as a consultant, instructor, engineer and thought leader. He has a wide range of experience from designing and implementing security architectures to performing risk assessments for government and classified environments, Fortune 500, financial services, utility companies, telecommunications, and health care companies. Prior to Invincea, he served as Vice President, Customer Success Organization at NetWitness, which was acquired by EMC earlier this year. There he built a global services organization from the ground up that delivered a world class customer experience, while facilitating rapid product growth and development and supporting sales efforts. At ArcSight (now part of HP), Martinez was a founding member of the company’s renowned Professional Services and Customer Success organizations. In a career of many firsts, prior to ArcSight, Martinez also helped to architect the Managed Security Service Provider (MSSP) program at Riptech, which was later acquired by Symantec.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP of Client Services","firm":{"name":"Invincea","permalink":"invincea","type_of_entity":"company","image":{"available_sizes":[[[150,39],"assets/images/resized/0014/1682/141682v1-max-150x150.jpg"],[[250,66],"assets/images/resized/0014/1682/141682v1-max-250x250.jpg"],[[298,79],"assets/images/resized/0014/1682/141682v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}