{"first_name":"Gabi","last_name":"Campos","permalink":"gabi-campos","crunchbase_url":"http://www.crunchbase.com/person/gabi-campos","homepage_url":"http://il.linkedin.com/in/gabicampos","birthplace":"Argentina","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1975,"born_month":8,"born_day":3,"tag_list":"","alias_list":null,"created_at":"Fri Jan 01 11:07:06 UTC 2010","updated_at":"Sun Jan 10 06:20:17 UTC 2010","overview":"<p>Gabi Campos serves as the Managing Director of Dragonfish, the Total Gaming Services company of 888 Holdings Plc group (LSE: 888.L), one of the world’s largest online gaming entertainment groups. Gabi’s prior role in the group was Senior Vice President - Head of Offering, in charge of all 888.com business units, including Gaming, E-Payments, Fraud and Risk Management, as well as commercial direction and regional marketing responsibility over emerging territories for 888. Prior to joining 888 Holdings Plc , Gabi was Managing Director of Avaya Israel and Avaya’s Global SIP &amp; Distributed Enterprise Business where he was responsible for the Sales, Marketing, Supply Chain, Services and R&amp;D of a $170M run-rate business. Earlier in his career Gabi led Sales and Technology teams for Amdocs (NYSE: DOX), a billing and CRM systems vendor, in North America and Israel. \nGabi is also a non-exec board member at First Life Research, a start-up company that is building a comprehensive database of unsolicited patient-reported outcomes on the internet, and he is advisor to the board and management of Radware (NASDAQ:RDWR), a provider of integrated application delivery solutions. \nGabi holds an MBA from the Kellogg School of Management (Northwestern University).</p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0007/1774/71774v2-max-150x150.jpg"],[[80,80],"assets/images/resized/0007/1774/71774v2-max-250x250.jpg"],[[80,80],"assets/images/resized/0007/1774/71774v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"Kellogg School of Management","institution":"Northwestern University","graduated_year":2005,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}