{"first_name":"Ganesh","last_name":"Kumar","permalink":"ganesh-kumar","crunchbase_url":"http://www.crunchbase.com/person/ganesh-kumar","homepage_url":"","birthplace":"Chennai","twitter_username":"ganrex77","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1977,"born_month":6,"born_day":7,"tag_list":"iso, cmmi, cmm, gxp, csv, 21-cfr, sqa, process, quality, km, knowledge-management, project-management","alias_list":null,"created_at":"Wed Jul 06 04:07:09 UTC 2011","updated_at":"Thu Jul 07 00:11:46 UTC 2011","overview":"<p>Over eleven years of experience in SQA, Testing, Pharma, Multimedia and in-house product working on multiple roles such as project management, quality management, knowledge management, product management, client relationship management and business operations. Extensive exposure to various quality standards such as CMMI, CMM, ISO, ITIL, Six Sigma, BPM, Testing, and Pharma processes such as electronic data capture of clinical trials, clinical data management, and information technology. Have been trained on various Pharma protocols and guidance such as GxP, CSV, Validation, and 21 CFR.</p>\n\n<p>Ability to connect and communicate strategic thinking and tactical action items with senior executives. Envision end-to-end solutions for clients by mixing knowledge, experience, and skills gained from business operations, analytics and IT applications</p>\n\n<p>Relationship building – Have built relationships with business and IT clients at various levels in the organizations ranging from functional SME’s through Sr. Directors and VPs. Very pleasant personality who can think broad and be able to address needs quickly</p>\n\n<p>Global delivery exposure – extensive experience working with global teams that are culturally and geographically separated. Have worked with people from various cultures and traveled internationally to destinations such as North America, Switzerland and India.</p>","image":{"available_sizes":[[[82,110],"assets/images/resized/0014/2635/142635v2-max-150x150.jpg"],[[82,110],"assets/images/resized/0014/2635/142635v2-max-250x250.jpg"],[[82,110],"assets/images/resized/0014/2635/142635v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"PG Diploma","subject":"Quality Management","institution":"Anna University","graduated_year":2000,"graduated_month":null,"graduated_day":null},{"degree_type":"Bachelors of Engineering","subject":"Electrical and Electronics Engineering","institution":"University of Madras","graduated_year":1998,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}