{"first_name":"Ganesh","last_name":"Kumar Bangah","permalink":"ganesh-kumar-bangah","crunchbase_url":"http://www.crunchbase.com/person/ganesh-kumar-bangah","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"MOL Global","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed May 04 07:24:55 UTC 2011","updated_at":"Thu Jul 05 19:09:28 UTC 2012","overview":"<p>Ganesh Kumar Bangah is the Group Chief Executive Officer at MOL Global, the parent company of MOL AccessPortal and Friendster, Inc. Ganesh co-founded MOL AccessPortal in 2000 and became the youngest Chief Executive Officer of a public-listed company when MOL was listed in 2003. The Company was subsequently privatized in 2008. In 2009, backed by Tan Sri Vincent Tan, Chairman and Chief Executive of Berjaya Corporation Berhad, Ganesh led MOL Global in acquiring Friendster, the pioneer in social networking site. Ganesh was twice nominated for the Ernst &amp; Young Emerging Entrepreneur of the Year in the last 7 years. He was also the Winner of JCI 2009 Creative Young Entrepreneur Award, recipient of the PIKOM Technopreneur Excellence Award at the ICT Leadership Awards 2009 and is acknowledged by Society Magazine as one of the 100 people you must know in Asia. He has been recognized as a Key Industry Leader by the Association of Computer and Multimedia Industry of Malaysia (PIKOM). Today, Ganesh is a PIKOM Councillor and is the Chairman of the Export Promotion Committee of PIKOM and Chairman of the PIKOM Southern Chapter. He is also an active industry player in the promotion of information and communication technology activities in Southern Malaysia and has been appointed as the Secretariat of the Johor Broadband Stakeholder Group and the Chief Executive Officer of MSC Cyberport Sdn Bhd, a public private partnership spearheaded by the State Government of Johor to expand the MSC Malaysia roll-out to the Iskandar Malaysia</p>","image":{"available_sizes":[[[80,116],"assets/images/resized/0013/3145/133145v1-max-150x150.jpg"],[[80,116],"assets/images/resized/0013/3145/133145v1-max-250x250.jpg"],[[80,116],"assets/images/resized/0013/3145/133145v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"MOL Global","permalink":"mol-global","type_of_entity":"company","image":{"available_sizes":[[[150,49],"assets/images/resized/0007/2859/72859v2-max-150x150.png"],[[250,83],"assets/images/resized/0007/2859/72859v2-max-250x250.png"],[[450,149],"assets/images/resized/0007/2859/72859v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}