{"first_name":"Gareth","last_name":"Lewis","permalink":"gareth-lewis","crunchbase_url":"http://www.crunchbase.com/person/gareth-lewis","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"The GO Global Brand","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jun 02 18:14:27 UTC 2011","updated_at":"Mon Jun 20 15:26:46 UTC 2011","overview":"<p>A highly experience and accomplished business develop professional with years of experience at executive Vice President level in both public and private sectors. A track record of successfully negotiations with Fortune 500 companies expanding global operations. Competent at think strategically and being analytically minded through the complex project requirements. Significant awareness of innovation opportunities and triumph in navigating strategic partnerships, acquisition targets and funding. Very entrepreneurially driven and demonstrate enthusiasm and flexibility in a fast paced business environment. </p>\n\n<p>A fluent negotiator in both the private and public sector with senior executives. Widely travelled both internationally and domestically within the US alongside a deep understanding of the international markets. A broad comprehension on number of sectors and specialize in highly commercial key account management. A tremendous track record in team management and budget management across complex projects. </p>\n\n<p>Highly competent at creating new strategies to identify new market opportunities and effectively execute on these strategies. Successfully lead, analyze and communicate detailed integration and go to market plans which include building and managing cross-functional teams to successfully complete the project lifecycle. Illustrate experience in the implementation of new product development and program design and solving. </p>\n\n<p>Specialties\nBuilding startup companies, business development, economic development, strategic risk assessment and forecasting, account management, strategic planning at top management, sustainability scaling for growth in the private and public sector. Analyzing integration models, new acquisition deals, partnerships and equity investments. Executive level engagement and negotiation forte.</p>","image":{"available_sizes":[[[141,150],"assets/images/resized/0013/9819/139819v2-max-150x150.jpg"],[[165,175],"assets/images/resized/0013/9819/139819v2-max-250x250.jpg"],[[165,175],"assets/images/resized/0013/9819/139819v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Executive Director","firm":{"name":"The GO Global Brand","permalink":"the-go-global-brand","type_of_entity":"company","image":{"available_sizes":[[[150,120],"assets/images/resized/0014/0805/140805v2-max-150x150.png"],[[250,201],"assets/images/resized/0014/0805/140805v2-max-250x250.png"],[[450,361],"assets/images/resized/0014/0805/140805v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.variety.com/events/2011/venture-capital-new-media-summit/","title":"Variety partnership with Geeks GO Global to host a Royal Prince William and New Media Venture Summit"},{"external_url":"http://newsguide.us/index.php?path=/technology/computer/Geeks-Going-Global-Forges-Collaboration-Between-Silicon-Valley-Entrepreneurs-and-the-North-of-England/","title":"Geeks GO Global company win UK's Innovation Award with Dragons Den Investor"},{"external_url":"http://www.liverpooldailypost.co.uk/liverpool-news/regional-news/2010/07/26/liverpool-software-city-goes-to-finland-and-california-92534-26929319/","title":"Trip to the UK for Investment Opportunities"},{"external_url":"http://www.daresburysic.co.uk/news/edid=4274","title":"Daresbury Labs UK partner with Go Global companies "},{"external_url":"http://geeksgoingglobal.eventbrite.com/","title":"Geeks GO Global Pitch Session"}]}