{"first_name":"Garen","last_name":"Armstrong","permalink":"garen-armstrong","crunchbase_url":"http://www.crunchbase.com/person/garen-armstrong","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"MindSpring Software","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 05 01:11:00 UTC 2008","updated_at":"Sat Jun 11 00:29:17 UTC 2011","overview":"<p>Mr. Armstrong facilitates growth and oversees the integration of each division. While staying cognitive of the competitive landscape looking for opportunities for growth, he continues to chip away at the competition by empowering the MindSpring Team and providing them with the necessary tools needed to succeed. He is an excellent leader, manager, and team builder. Through the application of a &#8220;make sense&#8221; business valuation and modeling process he has repeatedly been made the managing member of several companies. Once on board, in whatever capacity, he excels at maximizing corporate growth and optimization by leveraging his broad set of proven skills and tempered talents.\nMr. Armstrong&#8217;s history lies in business incubation and creative professional solutions. As the President of Armstrong Capital Inc. he focused on efficient corporate structuring while honing his ability to encourage growth through the development of increased market share. During the down-trending mortgage market, he successfully navigated KC Mortgage Group through numerous perils all the while enhancing their bottom line and growing their competitive advantage through multiple acquisitions and utilizing in-house software to maximize and automate the mortgage sales process.</p>\n\n<p>Mr. G. Armstrong oversaw executive managerial teams &amp; he has guided the design and implementation of quality control plans and procedural documentation initiatives. He is intimately familiar with the intricacies of guiding any sized organization so that they are fully compliant with requisite federal and state laws and regulations. Be it finance, marketing, staff/client relations, project coordination, or product implementation; he has met each challenge head on and overcame it successfully - learning and growing in each instance as he did so. </p>\n\n<p>Mr. Armstrong credits his continued success to his take-no-prisoners approach, unrivaled tenacity, and a fine-tuned propensity for surrounding himself with only the best. </p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0013/8339/138339v2-max-150x150.jpg"],[[187,250],"assets/images/resized/0013/8339/138339v2-max-250x250.jpg"],[[337,450],"assets/images/resized/0013/8339/138339v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"Business","institution":"School of Hard Knocks","graduated_year":2003,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"MindSpring Software","permalink":"mindspring-software","type_of_entity":"company","image":{"available_sizes":[[[150,76],"assets/images/resized/0002/7850/27850v2-max-150x150.jpg"],[[212,108],"assets/images/resized/0002/7850/27850v2-max-250x250.jpg"],[[212,108],"assets/images/resized/0002/7850/27850v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.mindspringsoftware.com","title":""},{"external_url":"http://www.hotelsmartsuite.com","title":""},{"external_url":"http://www.linkedin.com/in/garenarmstrong","title":"LinkedIn"},{"external_url":"http://twitter.com/#!/SmartSuite","title":"Twitter"}]}