{"first_name":"Garry","last_name":"McGuire","permalink":"garry-mcguire-2","crunchbase_url":"http://www.crunchbase.com/person/garry-mcguire-2","homepage_url":"","birthplace":"USA","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1970,"born_month":11,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Jun 18 15:35:46 UTC 2011","updated_at":"Mon Jun 20 21:45:21 UTC 2011","overview":"<p>Garry McGuire is the CEO of RMG Networks. </p>\n\n<p>Garry joined RMG as Chief Executive officer in July of 2009. Garry is responsible for all aspects of the company&#8217;s profitable growth and market expansion strategy. McGuire joined RMG with more than 15 years of advertising, marketing and general business experience on the client-side as a chief marketing officer and on the agency-side as president of several domestic and international advertising agencies. Most recently, McGuire was the Chairman of Icon Internet Ventures, which owns and publishes affinity websites that aggregate target audiences. McGuire also served as President of Gyro HSR, a leading independent, London based, digital marketing agency. McGuire&#8217;s career has spanned senior leadership roles at several multi-national Silicon Valley companies as well as start-up media and advertising ventures. McGuire is a frequent lecturer at advertising and media industry events. McGuire is a board member at True Insider, a social networking job research site, and at Posh Planet, a luxury online publisher. He was educated at The University of Dayton, and attended the Advanced Management Program at The Harvard Business School.</p>","image":{"available_sizes":[[[81,89],"assets/images/resized/0013/9868/139868v2-max-150x150.jpg"],[[81,89],"assets/images/resized/0013/9868/139868v2-max-250x250.jpg"],[[81,89],"assets/images/resized/0013/9868/139868v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"","institution":"University of Dayton","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}