{"first_name":"GARRY","last_name":"GROWER","permalink":"garry-grower","crunchbase_url":"http://www.crunchbase.com/person/garry-grower","homepage_url":"http://www.mygodisable.com","birthplace":"Canada","twitter_username":"","blog_url":"http://www.mygodisable.com","blog_feed_url":"http://www.mygodisable.com","affiliation_name":"Unaffiliated","born_year":1946,"born_month":3,"born_day":24,"tag_list":"love-is-a-journey, never-a-destination","alias_list":null,"created_at":"Wed Nov 09 23:51:16 UTC 2011","updated_at":"Tue Nov 29 23:13:28 UTC 2011","overview":"<p>I am Garry and there is nothing so special about me even though with time you could find something special lol.. Well why i joined the site,i did because it has come to a time in life where i have to settle down and have my own family and when i say settle down i mean settle down with the right woman a woman who is loving, honest and caring, someone who knows what it is to be married, someone who does not cheat.I will like to know  what your intentions are.I hope i don&#8217;t scare you away from the part where i said am a missionary as i know not everyone likes what i do reaching out to the poor and needy etc.Basically i minister to the motherless babies, hiv/aids victims and the beggers on the streets.I took a step with the site, because a friend of mine made it with a wonderful woman in his life 2months ago and are now happily married, i must say i truly admire their success so far and they are both Christians to crown it up so that&#8217;s why i took a step forward and joined the site.\nHow did this all start, i was at the age of 6 when my mom came to pick me up at the motherless babies home and took me as her Son since she never got married and liked kids so i happened to be her only child if you know what i mean. At my age of 11 when mom died a friend of hers who stays in Canada came and took me over to her place where i joined the ministery and became a missionary and was later chosen to be one of those who will be traveling abroad to minister.I was firstly in SPAIN to minister for 2wks after which i was taken to London where i am presently to do the Lords work. well London is a wonderful place and its my first time coming here, i will be here for 2months after which i will be going back to Canada where i reside but if by his grace i find a special woman on this dating site and things work for good for us then i will relocate for her. As the bible says.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0016/1671/161671v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0016/1671/161671v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0016/1671/161671v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}