{"first_name":"Gary","last_name":"Seeger","permalink":"gary-seeger","crunchbase_url":"http://www.crunchbase.com/person/gary-seeger","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Infoglide Software Corporation","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 15 20:16:59 UTC 2008","updated_at":"Thu Jul 30 17:53:57 UTC 2009","overview":"<p>Mr. Seeger manages all contractual activity dealing with customers, partners, and vendors, and is responsible for developing and maintaining the company’s extensive library of software licenses, partner agreements, and other legal documents. He possesses over 25 years of contracting and supplier management experience, with expertise spanning federal and commercial markets as well as substantial experience in both domestic and international environments.</p>\n\n<p>Prior to joining Infoglide Software, Mr. Seeger was the vice president of operations for Vadem, Ltd where his responsibilities included the planning and management of overseas contract manufacturing activities. Mr. Seeger selected manufacturing partners, negotiated multi-million dollar service agreements, and wrote and reviewed purchasing contracts. He was responsible for cost of goods sold, management of inventory levels, and conversion of sales forecasts to production plans.</p>\n\n<p>Before Vadem, Mr. Seeger spent 10 years with Pacific Monolithics rising to the position of vice president of manufacturing operations. His responsibilities encompassed contracts management, production control, purchasing/supply chain, material planning, quality assurance, inventory control, and customer service. Mr. Seeger acted as the company change agent and managed key relationships with vendors and external manufacturing partners. Earlier in his career, Mr. Seeger held various positions in contracting and program management.</p>\n\n<p>Mr. Seeger holds a Bachelor of Arts degree with honors from the University of California at Santa Barbara, graduating with a major in economics. Mr. Seeger is a current member of National Contracts Management Association (NCMA) and holds two nationally recognized Association of Operations Management (APICS) certifications.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Vice President of Contracts and Administration","firm":{"name":"Infoglide Software Corporation","permalink":"infoglide-software-corporation","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0002/2138/22138v2-max-150x150.png"],[[187,43],"assets/images/resized/0002/2138/22138v2-max-250x250.png"],[[187,43],"assets/images/resized/0002/2138/22138v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/gary-seeger/2/411/808","title":""}]}