{"first_name":"Gary","last_name":"Read","permalink":"gary-read","crunchbase_url":"http://www.crunchbase.com/person/gary-read","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Nimsoft","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Mar 31 23:01:30 UTC 2009","updated_at":"Wed Feb 03 22:27:40 UTC 2010","overview":"<p>A 20+ year high-tech veteran, Gary Read has established a track record of successful business leadership, building organizations that have achieved, and sustained, long-term growth and profitability. </p>\n\n<p>Mr. Read founded Converse Software in 2002 and in 2004, he merged Converse Software with Nimbus Software to form Nimsoft. </p>\n\n<p>Nimsoft has realized sustained growth, both in prosperous economic times and during the global recession of recent years. Read also navigated the cultural challenges of managing a distributed team with offices in the US, UK, Germany, Scandinavia and Australia at the same time building an impressive executive team of industry veterans that are ready to scale Nimsoft. </p>\n\n<p>Prior to Converse Software and Nimsoft, Read was VP of Sales and Marketing at RiverSoft, a provider of advanced network management products, where he was a key member of the executive team that led the company to a successful IPO and its eventual acquisition by Micromuse. With a long tenure in monitoring and systems management, Read served as VP of Marketing at BMC Software, where he oversaw product strategy, definition, and execution as well as go-to-market plans for all distributed systems management products. Read also held sales and marketing leadership roles at Boole &amp; Babbage and MAXM Systems.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President and CEO","firm":{"name":"Nimsoft","permalink":"nimsoft","type_of_entity":"company","image":{"available_sizes":[[[150,58],"assets/images/resized/0003/9904/39904v2-max-150x150.png"],[[230,89],"assets/images/resized/0003/9904/39904v2-max-250x250.png"],[[230,89],"assets/images/resized/0003/9904/39904v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}