{"first_name":"Gary","last_name":"Franks","permalink":"gary-franks","crunchbase_url":"http://www.crunchbase.com/person/gary-franks","homepage_url":"","birthplace":"","twitter_username":"GaryFranks2","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1983,"born_month":6,"born_day":10,"tag_list":"","alias_list":null,"created_at":"Thu Sep 06 09:40:20 UTC 2012","updated_at":"Sun Sep 09 19:27:19 UTC 2012","overview":"<p>Gary A. Franks, the youngest of six children, went on to become a prominent figure in politics and his community.<br/>\nFranks started as a student at Sacred Heart High School in Waterbury, Connecticut, where he racked up many basketball accolades.  He made the All-State basketball team and was chosen for the All-New England basketball team as well.  Additionally, he received the All-American Mention. \nMr. Gary Franks could have gone to any college to simply play basketball on a scholarship, receiving many offers to do so. However, he chose instead to go to Yale University on an academic scholarship. \nFrom early on, his father instilled in him a love of education. Still playing basketball as captain of the freshman and varsity teams, he graduated in 1975 with a B.A. in Sociology. During this time, he also played professional basketball with the New Orleans Jazz in the NBA until the summer of 1975. \nHis education propelled him forward to assume executive positions with three Fortune 500 companies for a period of 10 years. But he did not stop there. A political stint as a Waterbury, Connecticut alderman ended up taking him all the way to the House of Representatives. In 1990, Gary A. Franks won the Republican nomination for Connecticut. He ended up winning the election for the United States House of Representatives that year for his mostly all-white district. He was the first African American Republican to serve in the U.S. House in almost six decades and first from Connecticut. \nHe served on many committees, including the Commerce, Armed Services, and Small Business Committees. He proposed and wrote much legislation, including the Urban Entrepreneurial Opportunities Bill. Today, he is managing director of clean renewable energy company AEST, Inc. He also is an Amateur Athletic Union (AAU) basketball coach and visiting professor at two prestigious universities.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0021/0035/210035v2-max-150x150.png"],[[250,153],"assets/images/resized/0021/0035/210035v2-max-250x250.png"],[[260,160],"assets/images/resized/0021/0035/210035v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}