{"first_name":"Gary","last_name":"C. Evans","permalink":"gary-c-evans","crunchbase_url":"http://www.crunchbase.com/person/gary-c-evans","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Dec 18 02:07:19 UTC 2009","updated_at":"Fri Dec 18 02:11:00 UTC 2009","overview":"<p>Gary C. Evans is the Chairman and Chief Executive Officer and founder of GreenHunter. Mr. Evans is also a principal in Global Hunter Holdings, L.P., the parent of Global Hunter Securities, LLC., entities active in both direct capital investments and investment banking activities for numerous high growth Chinese-based enterprises.</p>\n\n<p>During the prior 20 years until April 2005, Mr. Evans served as Chairman, President and Chief Executive Officer of Magnum Hunter Resources, Inc. (an NYSE-listed company) and Chairman and Chief Executive Officer of all of the Magnum Hunter subsidiaries since their formation or acquisition dating back to 1985. Mr. Evans founded the predecessor company, Hunter Resources, Inc., that was merged into and formed Magnum Hunter Resources, Inc. until its merger with Cimarex Energy, Inc. (NYSE: XEC) during 2005 in a $2.2 billion transaction. From 1978 to 1985, Mr. Evans was employed in the banking profession and was associated with the Mercantile Bank of Canada, where he held various positions, including Vice President and Manager of the Energy Division of the Southwestern United States, and BancTexas, N.A. f/k/a National Bank of Commerce.</p>\n\n<p>Mr. Evans currently serves as the Lead Director of Novavax, Inc., a NASDAQ-listed pharmaceutical company. Mr. Evans serves as an Individual Trustee of TEL Offshore Trust, a NASDAQ-listed oil and gas trust. Mr. Evans was recognized by Ernst and Young as the Southwest Area 2004 Entrepreneur of the Year for the Energy Sector and was subsequently inducted into the World Hall of Fame for Ernst &amp; Young Entrepreneurs.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chairman, CEO","firm":{"name":"GreenHunter Energy","permalink":"greenhunter-energy","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0007/0244/70244v3-max-150x150.jpg"],[[250,75],"assets/images/resized/0007/0244/70244v3-max-250x250.jpg"],[[290,87],"assets/images/resized/0007/0244/70244v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}