{"first_name":"Gary","last_name":"Urteaga","permalink":"gary-urteaga","crunchbase_url":"http://www.crunchbase.com/person/gary-urteaga","homepage_url":"","birthplace":"Peru","twitter_username":"urteaga","blog_url":"","blog_feed_url":"","affiliation_name":"Cinepapaya.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Nov 13 03:14:39 UTC 2012","updated_at":"Wed Nov 14 06:32:30 UTC 2012","overview":"<p>Education Background:\nGary is a Ph.D. candidate and holds a Master of International Political Economy from Tsukuba University in Japan. He holds a Master of Economics from Florida State University and has completed the Master Program in Governability from the Universidad San Martin de Porres and the Master in Development and Defense from the Peruvian Ministry of Defense’s Centro de Altos Estudios Nacionales (CAEN). Gary is a fellow of the Center for Hemispheric Defense Studies of the National Defense University of the United States. He is an alumnus from the London School of Economics and Political Science Summer School in Economics and from Sophia University in Tokyo Summer School in Asian Economic Development.</p>\n\n<p>Professional Background:\nGary is a serial entrepreneur with a passion for technology. Gary has been an economic consultant for the United Nations Industrial Development Organization specializing in the formulation and evaluation of investment projects and business plans. In 2005, he won the Japan Market Expansion Competition with a biotech project client from Sweden. He is an active member of the APEC business community and is a local agent representative in Peru and advisor in Business Development for various companies from around the world. Gary received the SME PRIZE from the President of Peru in 2010, being the highest recognition of the State to an entrepreneur as a benchmark in entrepreneurship, effort and development.  The prize is awarded on demonstrated merits on innovation, vision of the future, social responsibility and the adoption of association strategies in its business model. </p>\n\n<p>Since 2011, Gary has been actively involved in building a bridge between the StartUp Community in Peru and Silicon Valley, having organized several missions for entrepreneurs and investors to visit companies like Facebook, Google, Twitter, Apple, Microsoft and other key players like Plug and Play Tech Center, Stanford University, the University of San Francisco, UC Berkeley and the Singularity University. Gary is a member of Founders Network in Silicon Valley and is currently an advisor to Peru Capital Network, which groups the most active angel investors and venture capitalist of Peru.  </p>\n\n<p>In January 2011, Holosens received a R&amp;D Grant from the Innovation Program of the Government of Peru for the development of an IT platform for IP distribution of video content. The project was a finalist in INTEL CHALLENGE COMPETITION for Latin America, among more than 300 projects presented, and then pivoted into a spin-out startup called “papaya.pe” which by November of 2011 was selected by WAYRA, the IT Accelerator from Spain’s Telefonica Group, among more than 1,200 projects presented in Peru.  In December 2011, the project was selected by the Government of Chile’s accelerator program called Start-Up Chile (CORFO) from more than 650 projects presented from all over the world.  </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder","firm":{"name":"Cinepapaya.com","permalink":"cinepapaya-com","type_of_entity":"company","image":null}},{"is_past":false,"title":"Entrepreneur","firm":{"name":"Telefonica Wayra","permalink":"telefonica-wayra","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}