{"first_name":"Gary","last_name":"Martino","permalink":"gary-martino","crunchbase_url":"http://www.crunchbase.com/person/gary-martino","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jun 13 04:47:08 UTC 2009","updated_at":"Sat Jun 13 04:54:45 UTC 2009","overview":"<p>Prior to Gary joined Tangoe as its Chief Financial Officer in July 2007, Gary was an active board member and advisor to Tangoe, utilizing his extensive corporate development, financing, and M&amp;A experience working with Riverside Advisors, LLC and helped Tangoe (among others) develop and implement its business plan and secure funding. Gary has been a key executive on the management team at a time when Tangoe has completed a merger and experienced considerable growth.</p>\n\n<p>Prior to Tangoe, Gary co-founded (with Al Subbloie) and helped develop Buyersedge.com, an Internet reverse auction company focused on high-end consumer goods. At Buyersedge, he secured an equity investment round of $10 million and helped build the initial company from start-up mode to over 65 employees. He later negotiated and assisted in the merger of the company into another B2B Internet company. Prior to that, while serving as the CFO of Information Management Associates (IMA), he helped transition the IT services and software company (which he also had helped start and grow beginning in 1984) into a leading enterprise software company focused on call center automation. He was instrumental in raising private equity (totaling $15 million) and bank funding (over $10 million), taking the company public in a $50 million offering, completing three acquisitions, and helping to manage the growth of the company to over 350 employees and $50 million in revenue.Prior to 1984, Gary worked with Arthur Anderson and Company as a senior consultant responsible for software programming and project management for accounting and decision support software for Fortune 500 clients.Gary received his BSBA from Georgetown University in 1982 where he majored in accounting and computer science.</p>","image":null,"degrees":[{"degree_type":"BSBA","subject":"","institution":"Georgetown University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chief Financial Officer","firm":{"name":"Tangoe","permalink":"tangoe","type_of_entity":"company","image":{"available_sizes":[[[136,82],"assets/images/resized/0004/8337/48337v2-max-150x150.png"],[[136,82],"assets/images/resized/0004/8337/48337v2-max-250x250.png"],[[136,82],"assets/images/resized/0004/8337/48337v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}