{"first_name":"Gavin","last_name":"Varejes","permalink":"gavin-varejes","crunchbase_url":"http://www.crunchbase.com/person/gavin-varejes","homepage_url":"http://www.gavinvarejes.co.za/","birthplace":"Durban, South Africa","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"gavin-varejes, richmarck-holdings, sport, philanthropist, south-africa","alias_list":null,"created_at":"Tue Nov 06 14:33:31 UTC 2012","updated_at":"Fri Nov 09 06:16:38 UTC 2012","overview":"<p>Gavin Varejes is a businessman, sports lover and philanthropist. He is well known for his penchant to collect sports memorabilia at home, but he takes this love beyond just his family&#8217;s enjoyment. He directs his love of sports for the good in South Africa, working hard not only in business, but using his skills to help provide sports as an outlet for those who have less. </p>\n\n<p>The professional path</p>\n\n<p>Gavin Varejes studied for his marketing degree at the University of Durban, after completing national service as a life guard in the South African military establishment. He began his career as a salesman in his hometown, but later moved to Johannesburg to seek more options in a broader market. He initially found jobs in cellular companies, but set off on his own in 2000, founding his company Richmarck Holdings. Richmarck Holdings is a unique brand of venture capital firms. Although its main goal is, of course, the funding of companies in order to earn profits, Richmarck focuses on the entire business interaction, not just the lending of money. Gavin Varejes and his team work directly with the start-ups they choose to invest in, offering both capital to work from and consulting to help the company succeed. The concept is that a company on the start of its path not only needs money to work of off, but also needs experienced business persons to help strategize the best way to monetize the initial capital investment and grow the company. Currently working only in South Africa, Gavin Varejes and his executive staff have considered expanding into Kenya with their work as well. </p>\n\n<p>Using business skills for philanthropy</p>\n\n<p>Gavin Varejes is not just about earning money and building successful companies. He is also interested in leveraging his skills to better society. Hi major focus is underprivileged children of South Africa. That said, he is also a sports buff, so Gavin Varejes found a way to channel his passion and talents for good. Sports are both a challenge and a way for children to feel successful and help them to strive higher. To this end, he founded the South African Rugby Legends Association. The concept of the project was to utilize the big names in the rugby world as a tool for increasing fundraising at gala events. These funds would then be directed towards scholarship funds, sports funds for underprivileged areas and other initiatives to help struggling kids get ahead in a tough world. In addition to his work in sports philanthropy, Gavin Varejes also uses his connections and reputation in the business world to raise funds. He has enlisted major companies such as BMW, Tsogo Sun and Hifi Corporation to organize fundraising events and sponsorships. Some of the causes Gavin Varejes has worked for include the Kirsty Watts Foundation and the joint Aid Management, which deals with nutrition issues in the Americas and Africa.     </p>\n\n<p>A Family man</p>\n\n<p>In addition to his successful business and philanthropic pursuits, Gavin Varejes finds plenty of time to spend with his loving wife of over twenty years and their two children. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.gavinvarejeGavinVarejess.com/","title":"Gavin Varejes - Wiki Page"},{"external_url":"http://gavinvarejes.gather.com/","title":"Gavin Varejes profile on Gather"},{"external_url":"http://gavinvarejes.tumblr.com/","title":"Gavin Varejes - Business Profile "},{"external_url":"http://gavinvarejes.wordpress.com","title":"Gavin Varejes, CEO of Richmark Holdings (PTY) LTD "}],"web_presences":[]}