{"first_name":"Gavin","last_name":"Tollman","permalink":"gavin-tollman","crunchbase_url":"http://www.crunchbase.com/person/gavin-tollman","homepage_url":"http://www.gavintollman.com/","birthplace":"South Africa","twitter_username":"gavintollman","blog_url":"http://www.gavintollmanblog.com/","blog_feed_url":"","affiliation_name":"Trafalgar","born_year":1963,"born_month":10,"born_day":14,"tag_list":"gavin-tollman, trafalgar, travel-industry, tourism, leisure, the-travel-corporation, innovating-travel","alias_list":null,"created_at":"Thu May 24 12:26:52 UTC 2012","updated_at":"Tue May 29 10:40:52 UTC 2012","overview":"<p>Gavin Tollman is a professional in the international travel and leisure market and serves as CEO of Trafalgar Tours. He is also Chairman of The Travel Corporation S.A., where he oversees the South African operations of the global travel group The Travel Corporation. He puts his own unique ideas into the tours that he offers, creating unforgettable experiences for the traveler. This South African native continues to put a strong emphasis on travel to South Africa, as well as newer destinations in Asia and Australia.</p>\n\n<p>Entry into the Travel and Leisure Market</p>\n\n<p>After obtaining a degree in finance from the American University, Gavin Tollman entered the travel and leisure industry with a position at Buckhead Hotel Management Company in the US. He was the Executive Vice President of the company and handled the hotel&#8217;s operations and ownership negotiations with third parties. During a massive downturn in the hotel industry, he was also involved in negotiating debt restructuring and refinancing deals. After nine years, he went to Red Carnation Hotels,. He was in charge of sales, marketing and operations for the luxury boutique hotels, which at that time numbered four. A year later he was offered the title of President of Trafalgar Tours USA. He took charge of the company and grew it to be the largest European tour service working in the US. He also led Trafalgar into new markets that became very popular travel destinations, such as New Zealand, Asia, South America, Hawaii, Canada and the US. He initiated changes in travel packages that were revolutionary, in that they provided many new options to the guided traveler. Trafalgar&#8217;s reach expanded considerably under his direction, and its reputation for consistent quality, good value and reliable touring remained constant. </p>\n\n<p>Joining The Travel Corporation in North America</p>\n\n<p>In 2001, Gavin Tollman became the President of The Travel Corporation, North America. With this new position, in addition to maintaining control over Trafalgar Tours, he was also responsible for the operations, sales and marketing of other companies managed by The Travel Corporation NA, such as Insight Vacations, Destination America, Contiki Holidays and AAT Kings. As he continued in these roles, he also became a non-executive director at Cullinan Holdings, Limited as well as a non-executive director at Wilderness Safaris. </p>\n\n<p>Current Positions of Leadership in the Travel Industry</p>\n\n<p>As current Chairman of The Travel Corporation (South Africa), Gavin Tollman oversees the international strategy of TTC. He identifies and develops new business opportunities while promoting South Africa as a popular tourist destination. Under his leadership, TTC signed a two year agreement with the SA Tourism Ministry to help market and promote South African tourism through Destination South Africa when TTC held its annual conference in Cape Town in 2010. He also continues his association with Trafalgar Tours as CEO and oversees marketing, sales, product development and delivery as well as all operations. He has developed programs such as Be My Guest and Hidden Treasures to provide more intimate and in-depth travel experiences, which have changed the face of typical coach tours.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0019/2067/192067v3-max-150x150.jpg"],[[178,250],"assets/images/resized/0019/2067/192067v3-max-250x250.jpg"],[[300,420],"assets/images/resized/0019/2067/192067v3-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"","subject":"Finance","institution":"The American University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Trafalgar","permalink":"trafalgar","type_of_entity":"company","image":null}},{"is_past":false,"title":"Chairman","firm":{"name":"The Travel Corporation S.A.","permalink":"the-travel-corporation-s-a","type_of_entity":"company","image":null}},{"is_past":false,"title":"Non-Executive Director","firm":{"name":"Cullinan Holdings Limited","permalink":"cullinan-holdings-limited","type_of_entity":"company","image":null}},{"is_past":false,"title":"Non-Executive Director","firm":{"name":"Wilderness Safaris","permalink":"wilderness-safaris","type_of_entity":"company","image":null}},{"is_past":true,"title":"Global Head of Sales","firm":{"name":"Trafalgar Tours (before name change)","permalink":"trafalgar-tours-before-name-change","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.travelwires.com/wp/travel-agents-stay-trafalgar/","title":"Travel Agents Are Here To Stay – Trafalgar"},{"external_url":"http://www.travelweekly.co.uk/Articles/2011/10/20/38570/price+focus+is+plain+dumb+how+trafalgars+tollman+turned+coach+tours+around.html","title":"'Price focus is plain dumb': How Trafalgar's Tollman turned coach tours around"},{"external_url":"http://www.timeslive.co.za/lifestyle/travel/article1048849.ece/My-Kind-of-Holiday--Gavin-Tollman-Global-CEO-Trafalgar-Tours","title":"My Kind of Holiday: Gavin Tollman, Global CEO, Trafalgar Tours"}],"web_presences":[{"external_url":"http://gavintollman.emurse.com/","title":"Gavin Tollman - Emurse Profile"},{"external_url":"http://www.visualcv.com/gavintollman","title":"Gavin Tollman - Visual CV Profile"},{"external_url":"http://www.gavintollman.net/","title":"Gavin Tollman - Businessman"},{"external_url":"http://www.linkedin.com/in/gavintollman","title":"Gavin Tollman - LinkedIn"}]}