{"first_name":"Gavin","last_name":"Poolman","permalink":"gavin-poolman-2","crunchbase_url":"http://www.crunchbase.com/person/gavin-poolman-2","homepage_url":"http://www.apollomedia.net","birthplace":"Toronto","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1967,"born_month":11,"born_day":13,"tag_list":"","alias_list":null,"created_at":"Mon Jan 11 19:01:23 UTC 2010","updated_at":"Mon Jan 11 21:03:58 UTC 2010","overview":"<p>Gavin Poolman – Director</p>\n\n<p>Born in Canada, Gavin gained an Honours B.A. in French Literature from Trinity College, University of Toronto. After 3 years as a programmer/ systems analyst on government and corporate projects, he moved to the UK to attend the London Film School. After graduating, he spent 10 years working as a motion picture executive for companies including Oscar-Winning producer Jeremy Thomas’s Glinwood Films/ Films Trustees, and Mayfair Entertainment International. In 1996, together with investment banker Mark Beilby, Gavin founded independent media finance and production company Apollo Media, where he has produced and/ or financed over 20 movies. </p>\n\n<p>Apollo Mobile was formed in 2006 via a merger with Sveng Interactive, a Finnish company that had developed a proprietary interactive content management system called RE4CTOR, a unique Java-based system that uses apps to deliver a similar user experience across virtually all mobile platforms.</p>\n\n<p>RE4CTOR was originally developed to enable real-time viewer interaction with live TV broadcasts, and was the basis of Sveng&#8217;s ground-breaking game show, Ursäkta Birgitta, which won Best Children’s Programme in the 2009 Finnish TV Awards. RE4CTOR clients include broadcasters, music distributors, market research and digital polling groups, newspapers, online communities, travel suppliers, medical technology suppliers, and a live musical in Helsinki.</p>","image":{"available_sizes":[[[110,150],"assets/images/resized/0007/2892/72892v2-max-150x150.jpg"],[[184,250],"assets/images/resized/0007/2892/72892v2-max-250x250.jpg"],[[240,326],"assets/images/resized/0007/2892/72892v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}