{"first_name":"Gayle","last_name":"Meyers","permalink":"gayle-meyers-2","crunchbase_url":"http://www.crunchbase.com/person/gayle-meyers-2","homepage_url":"","birthplace":"New York","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1971,"born_month":8,"born_day":15,"tag_list":"gayle-meyers, dmr-partners, digital-media-rountable","alias_list":null,"created_at":"Tue Aug 16 13:10:57 UTC 2011","updated_at":"Wed Aug 17 22:36:16 UTC 2011","overview":"<p>With over 15 years of digital media experience, Gayle has a proven ability to maximize value within strategic sales, marketing and business development services through her deep professional network and personal relationships with digital media leaders. Over the last year, some of her consulting clients have included Advertiser Perceptions, Evidon, Aperture Audience, Operative Media, myThings and Maxifier.</p>\n\n<p>Before 2010, Gayle served as a Vice President of Strategic Partnerships and Agency Relations at ValueClick Media, where she has built and led national sales efforts and business development initiatives spanning digital agencies since 2005.</p>\n\n<p>Prior to joining ValueClick, Gayle headed up a number of strategic accounts at 24/7 Real Media since 1998. She went on to be the top producer companywide in 1999, based mainly on her strategic sales efforts and relationships she managed with companies such as AT&amp;T, Travelocity, Earthlink and others.</p>\n\n<p>Prior to that, Gayle was in strategic sales at AOL, where she was responsible for creating the Digital Cities Computer Channel, while managing relationships with Egghead, Dell Computer and others. Prior to AOL, Gayle was one of the top sales executives at Microsoft Sidewalk in 1996.</p>\n\n<p>Early in her career, Gayle launched a restaurant business, which now consists of more than 36 restaurants in the San Francisco Bay Area, including Firewood Café, Lou’s Pier 47 and a partnership with Peet’s Coffee.</p>","image":{"available_sizes":[[[150,125],"assets/images/resized/0014/9699/149699v2-max-150x150.jpg"],[[250,209],"assets/images/resized/0014/9699/149699v2-max-250x250.jpg"],[[285,239],"assets/images/resized/0014/9699/149699v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}