{"first_name":"GCPL","last_name":"Technologies","permalink":"gcpl-technologies","crunchbase_url":"http://www.crunchbase.com/person/gcpl-technologies","homepage_url":"http://gcpltechnologies.com/","birthplace":"India","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1990,"born_month":2,"born_day":2,"tag_list":"gcpl-technologies","alias_list":null,"created_at":"Wed Nov 09 09:20:15 UTC 2011","updated_at":"Sun Nov 20 07:47:50 UTC 2011","overview":"<p>GCPL Technologies is a offshore software development company headquartered in INDIA.., with office in New Delhi. The cornerstone of the company&#8217;s outsourcing strategy is a balancing combination of onsite presence and offsite service delivery. GCPL Technologies develops custom software solutions based on a range of platforms and technologies, including Windows, Macintosh, Unix, Linux, .Net, J2EE, J2SE, J2ME, Symbian OS, Windows Mobile 2003 and other mobile embedded systems.</p>\n\n<p>For companies around the world that consider global outsourcing as critical for their growth, competitiveness or survival, GCPL Technologies offers a unique combination of exceptional price/performance, flexibility of engagement processes, focus on immediate client needs, collaborative problem solving and sophisticated data analysis. For each customer or business partner engagement GCPL Technologies quickly and effectively provides the required resources and expertise performing the task in the shortest time and with excellent efficiencies.</p>\n\n<p>GCPL Technologies &#8216;s client support and delivery facilities in Vancouver(INDIA..) and Kharkov (New Delhi) provide Executive, Sales, Account and Project Management functions, Legal and Contracting issues as well as high-level System Architecture design and specialized consulting and deployment services. The main part of the software development operations is carried out in GCPL Technologies &#8216;s offsite development facilities in Russia, Belarus and New Delhi.</p>\n\n<p>A unique set of corporate values; skilled, enthusiastic and experienced staff; software development processes and quality assurance systems fully comply with ISO 9001:2000 standards and certified against the requirements of SEI SW-CMM and SEI CMMI SW/SE up to Level 4 - are the key differentiation factors in providing advanced technology solutions, services and products to customers worldwide. Our integrated solution - oriented approach clearly defines GCPL Technologies as a leader in interactive and online application development.</p>\n\n<p>GCPL Technologies employs several service delivery models to provide the perfect fit for client&#8217;s contractual needs and specific technology. The cornerstone of the company&#8217;s proven methodology is a balancing combination of onsite presence and offsite service delivery. This creates a great capability to solve complex business and technology issues - in a distributed project management environment - at affordable cost.</p>","image":{"available_sizes":[[[150,73],"assets/images/resized/0016/1546/161546v2-max-150x150.jpg"],[[154,75],"assets/images/resized/0016/1546/161546v2-max-250x250.jpg"],[[154,75],"assets/images/resized/0016/1546/161546v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://gcpltechnologies.com/","title":"GCPL Technologies"}]}