{"first_name":"Geir","last_name":"Magnusson","permalink":"geir-magnusson","crunchbase_url":"http://www.crunchbase.com/person/geir-magnusson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jul 22 01:25:07 UTC 2008","updated_at":"Thu Jan 20 01:55:55 UTC 2011","overview":"<p>With a diverse background as both a technical executive and an internationally known leader in open source software, Geir comes to us from Joost, where he led software development and had responsibility for platform architecture, implementation and delivery. Prior to Joost, he held positions as Director of Middleware Architecture and Open Source Technology at Intel, and Vice President of Products and Strategy at Gluecode, an open source application server startup that was acquired by IBM. He was VP, Engineering and Chief Architect of Adeptra, an innovating communications service provider, and as CTO, guided technology FitLinxx during it&#8217;s rapid growth years. Geir began his commercial career as an architectural and product lead at Bloomberg Financial Markets where he developed the company&#8217;s real-time, multi-platform financial data delivery and presentation system. He is also a member of the board of advisors for WSO2, an open source SOA middleware vendor.</p>\n\n<p>In addition to his commercial software experience, Geir is a Director of the Apache Software Foundation, currently represents the ASF on the Executive Committee of the Java Community Process, the organization that governs the evolution of the Java platform, and helped found major open source projects, including Apache Geronimo and Apache Harmony, and has been recognized for his work in the Java ecosystem through a Google-O&#8217;Reilly Open Source Award. </p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":" Jr, VP of Engineering","firm":{"name":"10gen","permalink":"10gen","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0002/2463/22463v7-max-150x150.png"],[[250,57],"assets/images/resized/0002/2463/22463v7-max-250x250.png"],[[307,71],"assets/images/resized/0002/2463/22463v7-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[{"description":"Chief Architect","stoned_year":2010,"stoned_month":12,"stoned_day":null,"source_url":"","source_text":null,"source_description":"","stoneable_type":"Person","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"first_name":"Geir","last_name":"Magnusson","permalink":"geir-magnusson"}}],"video_embeds":[],"external_links":[],"web_presences":[]}