{"first_name":"Geneen","last_name":"Stuart","permalink":"geneen-stuart-2","crunchbase_url":"http://www.crunchbase.com/person/geneen-stuart-2","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 14 13:23:10 UTC 2012","updated_at":"Thu Nov 22 04:24:44 UTC 2012","overview":"<p>Geneen Stuart is a mother of four and on a mission to help people across the country. She knows that raising a family the correct way is not an easy task to accomplish. Children must have the proper nutrition, exercise, shelter, love and guidance to end up well-rounded. In order to help other children receive the proper nutrition, Geneen volunteers with many religious groups and other organizations that put together food-drives.</p>\n\n<p>Stuart has participated in Boston’s Walk for Hunger. She feels that the less fortunate should have the same access to healthy foods as she does. Geneen does her best to make sure those in the Philadelphia area are receiving healthy food tips as well as nutritious foods.</p>\n\n<p>While children need the basic food, clothing and shelter to survive, Geneen Stuart also believes they need an active play time. She is very passionate about artwork, and encourages children of all ages to participate in the activity. Not all kids will end up loving painting or end up sculpting an amazing statue. Even so, Geneen knows that children need the arts to hone their creativity.</p>\n\n<p>Because she is so encouraging of children expressing their thoughts or dreams through artwork, she offers parents tips on how to help their child’s creativity grow. Geneen Stuart provides many tips for parents who feel as though they are lost throughout the sometimes difficult journey of parenthood. </p>\n\n<p>As an active member of her community, Stuart knows that communities can help each other out through hard times and guide each other in the right direction. Geneen Stuart took the responsibility upon herself to provide tips for healthy nutrition, proper exercise, and creativity development. Each of these is crucial to raising a well-balanced child. For more tips on how to guide your children down the right path, visit Geneen’s website at geneenstuart.org. </p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0022/0357/220357v2-max-150x150.png"],[[250,153],"assets/images/resized/0022/0357/220357v2-max-250x250.png"],[[260,160],"assets/images/resized/0022/0357/220357v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}