{"first_name":"Gene","last_name":"Lynch","permalink":"gene-lynch","crunchbase_url":"http://www.crunchbase.com/person/gene-lynch","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Mar 19 21:50:20 UTC 2008","updated_at":"Wed Mar 19 22:00:10 UTC 2008","overview":"<p>Gene Lynch joined Quadrangle Group LLC in 2006 and is an Executive Director focused on the firm’s asset management business. Prior to joining the firm, Mr. Lynch was a Managing Director of Reservoir Capital Group, a $3 billion opportunistic investment fund, where he oversaw the firm’s wealth management initiative. Prior to joining Reservoir, Mr. Lynch was a co-founder and Managing Director of two private equity funds with over $1 billion of committed capital, The Clipper Group and Monitor Clipper Partners. During his investment career at Clipper from 1991 through 2003, he was responsible for evaluating, making and managing many of the Clipper private equity investments as well as the successful management of a $1.2 billion merchant banking portfolio (private equity, venture capital and bridge loans). He has served as a member of the Board of Directors of ten public and private companies in industries including retail, transportation services, financial services, information services, home furnishings and industrial gases. Prior to forming Clipper, Mr. Lynch began his career at Credit Suisse First Boston in its Mergers &amp; Acquisitions Group and later became a Vice President in the Merchant Banking Group. Mr. Lynch graduated with honors and received an AB in Economics from Harvard College and received an MBA from Stanford University’s Graduate School of Business.</p>","image":{"available_sizes":[[[131,150],"assets/images/resized/0001/5992/15992v1-max-150x150.jpg"],[[167,190],"assets/images/resized/0001/5992/15992v1-max-250x250.jpg"],[[167,190],"assets/images/resized/0001/5992/15992v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":null,"title":"Executive Director","firm":{"name":"Quadrangle Group","permalink":"quadrangle","type_of_entity":"financial_org","image":{"available_sizes":[[[150,32],"assets/images/resized/0001/5980/15980v1-max-150x150.png"],[[250,53],"assets/images/resized/0001/5980/15980v1-max-250x250.png"],[[450,96],"assets/images/resized/0001/5980/15980v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}