{"first_name":"Geneen","last_name":"Stuart","permalink":"geneen-stuart","crunchbase_url":"http://www.crunchbase.com/person/geneen-stuart","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 14 13:02:35 UTC 2012","updated_at":"Thu Nov 22 04:24:25 UTC 2012","overview":"<p>Geneen Stuart is the proud parent of four children. As the mother of so many children, she understands what it takes to raise them into smart, healthy adults. Geneen has seen firsthand how the suitable amount of exercise, nutrition and education can help them grow up. As a participant of the surrounding community in the Philadelphia area, she strives to help other families achieve the same goals she has for her children.</p>\n\n<p>There are many churches and countless organizations that participate in food drives throughout her community. Geneen finds it essential that she help other families receive the proper nutrition. As a volunteer for many of these organizations and religious groups, she has helped allocate food to families in need. </p>\n\n<p>With four children of her own, she knows how expensive it is to feed a large family. She wants to help those that are less fortunate feed their families as well. Through her church, there is a “food pantry” that members can donate food items to. This pantry is responsible for helping feed families in their community. Geneen Stuart knows that many of her fellow church members feel drawn to helping the disadvantaged receive a healthy meal.</p>\n\n<p>Along with helping her community support the less fortunate by donating food items, Geneen also encourages her community members to educate themselves on proper exercise. While it is important for adults to stay active, it is even more important for children to stay active. This is why Geneen Stuart strives to get whole families moving together. She knows that children follow examples provided to them by their parents. If the parents stay active, the kids will be more inclined to participating in games that exert physical effort.</p>\n\n<p>Geneen Stuart encourages families to play a game such as basketball, so that each family member can get up and moving. Not only will the family receive exercise for that day, but they will also grow closer as a family. As Geneen knows, family bonding can happen over simple things such as playing a game together.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0022/0350/220350v2-max-150x150.png"],[[250,153],"assets/images/resized/0022/0350/220350v2-max-250x250.png"],[[260,160],"assets/images/resized/0022/0350/220350v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}