{"first_name":"Geoffrey","last_name":"Prentice","permalink":"geoffrey-prentice-2","crunchbase_url":"http://www.crunchbase.com/person/geoffrey-prentice-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Atomico","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jul 30 17:50:00 UTC 2008","updated_at":"Wed May 25 17:09:04 UTC 2011","overview":"<p>Geoffrey Prentice is a Partner at Atomico, the technology venture capital firm. He was previously Chief Strategy Officer at Skype, and also the first employee, where he worked with founders Niklas Zennström and Janus Friis to build a leading global telecommunications platform company. He oversaw the expansion of Skype into Asia and Latin America and was responsible for its initial business plan development and fundraising activities. Geoffrey played an instrumental role in the $3.1bn exit to eBay inc in 2005.\nPrior to Skype, Geoff was director of investments at Target Investments AB, Stockholm, a publicly traded investment company focused on new media and telecommunications. Earlier in his career, Geoff oversaw the North American operations for a venture-backed competitive intelligence company based in Amsterdam, and started his career in San Francisco at Robertson Stephens, a boutique investment bank, where he worked with a wide range of public and private companies.\nHe currently serves on the board of WooMe.\nGeoffrey received his Bachelors degree from the University of Michigan.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Atomico","permalink":"atomico-investments","type_of_entity":"financial_org","image":{"available_sizes":[[[150,44],"assets/images/resized/0001/0914/10914v9-max-150x150.jpg"],[[250,74],"assets/images/resized/0001/0914/10914v9-max-250x250.jpg"],[[450,133],"assets/images/resized/0001/0914/10914v9-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}