{"first_name":"Geoff","last_name":"farris","permalink":"geoff-farris-2","crunchbase_url":"http://www.crunchbase.com/person/geoff-farris-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"tracx","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 08 10:52:29 UTC 2012","updated_at":"Fri Aug 17 07:29:29 UTC 2012","overview":"<p>Geoff Farris is the Executive Vice President of Sales and Sales Operations for tracx. </p>\n\n<p>Geoff is responsible for global sales and sales operations and has over 18 years of experience in technology services and software sales.</p>\n\n<p>Over his career, he has held various executive management roles in sales, strategy, operations and general management. He brings extensive experience in sales and operations for new business segments, as well as a strong background in expanding business development in new and emerging markets.</p>\n\n<p>Before joining Tracx, Mr. Farris was EVP of Sales and Strategic Agency Relations for Visible Technologies. His responsibilities included the development and execution of sales strategy that leveraged all direct and agency channel sales resources. In addition, Mr. Farris was responsible for implementing core business process disciplines to enhance sales predictability and accountability across the sales teams. In 2010, under his sales leadership, Visible was among Inc. 500’s fastest growing companies with multiyear growth above 1700%.</p>\n\n<p>Prior to that, Mr. Farris was the Regional Vice President for Enterpulse a national technology services firm focused on process improvement solutions leveraging portal, content management and BPM technologies within a SOA environment. In addition, Mr. Farris held the position of Regional Vice president with Groundswell a national services firm and was an integral part of the merger between Groundswell and Enterpulse. Mr. Farris also held leadership positions in interactive marketing services firms Syllogy Partners and e-Media.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0020/6417/206417v2-max-150x150.jpg"],[[200,200],"assets/images/resized/0020/6417/206417v2-max-250x250.jpg"],[[200,200],"assets/images/resized/0020/6417/206417v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Executive Vice President, Sales","firm":{"name":"tracx","permalink":"tracx","type_of_entity":"company","image":{"available_sizes":[[[150,37],"assets/images/resized/0004/0257/40257v12-max-150x150.png"],[[250,63],"assets/images/resized/0004/0257/40257v12-max-250x250.png"],[[250,63],"assets/images/resized/0004/0257/40257v12-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}