{"first_name":"Geoff","last_name":"Smith","permalink":"geoff-smith","crunchbase_url":"http://www.crunchbase.com/person/geoff-smith","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"StumbleUpon","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jun 01 10:01:20 UTC 2007","updated_at":"Thu Oct 27 04:21:35 UTC 2011","overview":"<p>Geoff worked for many years in Front Line and Executive Management and more latterly Organisation Development Leadership roles. His focus has been organisation and leadership development; change management; retention and recruitment strategy, and building high performance organisations which are also great places to work. </p>\n\n<p>He began working life as a teacher then worked in many industries such as textiles, high turnover consumer goods, food processing, motor vehicle assembly, distribution, hospitality, retailing and Public Health. </p>\n\n<p>In his early years in retailing, Geoff also had a parallel career in the Trade Union movement as a Union President;  Federation of Labour (now CTU) representative on an Industry Training Board, and also as a National Moderator for industry training qualifications.</p>\n\n<p>Geoff speaks at conferences, educational, including MBA programmes and seminars on Managing People; Restructuring &amp; Change; Strategic Remuneration; Managing People’s Performance; Customer Service; Motivation; Creating Positive Working Cultures and Leadership. He usually rate highly for both content of material and presentation. Geoff chairs conferences and small business meetings. </p>\n\n<p>Prior to establishing his consultancy business in December 2001, he was General Manager of Patient &amp; Staff Safety and Human Resources with South Auckland Health, and chair of Executive Committee of the Northern Clinical Training Network. Geoff was one of the early leaders of Manager Review, e-recruiting, employment branding, and e-performance management in NZ.</p>\n\n<p>As a consultant Geoff had small business development assignments in the engineering, equestrian and freight fields. Professional Services, Science Research, Transport, Financial Services, Public &amp; Private Health providers, Public Library and Agricultural Produce organisations use his consultancy to assist in developing their Business Culture, Leadership, Performance and Teamwork competencies.</p>\n\n<p>Geoff chaired the establishment of a farmer based primary produce organisation set up to re-establish an export industry into Europe.</p>\n\n<p>In Franklin Geoff facilitated the merger of three organisations into the new Enterprise Franklin Development Trust. He was also a founding trustee of the Auckland Region Economic Development Association Inc.</p>\n\n<p>Voluntary involvement in the Franklin District is an important part of his life with a range of interests which include Community &amp; Social Services; A &amp; P (Agricultural &amp; Pastoral); Arts &amp; Culture; Libraries &amp; Learning and Equestrian. </p>\n\n<p>Geoff lives with his partner John in Pukeoware (Waiuku NZ) at Hazeldene Farm where they breed sport horses.</p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0009/4920/94920v2-max-150x150.jpg"],[[80,80],"assets/images/resized/0009/4920/94920v2-max-250x250.jpg"],[[80,80],"assets/images/resized/0009/4920/94920v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"VP / GM of Business Development","firm":{"name":"Moontoast","permalink":"moontoast","type_of_entity":"company","image":{"available_sizes":[[[150,89],"assets/images/resized/0010/4210/104210v12-max-150x150.png"],[[250,149],"assets/images/resized/0010/4210/104210v12-max-250x250.png"],[[250,149],"assets/images/resized/0010/4210/104210v12-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}