{"first_name":"Geoff","last_name":"Rees","permalink":"geoff-rees","crunchbase_url":"http://www.crunchbase.com/person/geoff-rees","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":"","created_at":"Fri Jun 05 11:06:13 UTC 2009","updated_at":"Tue Jun 16 23:25:54 UTC 2009","overview":"<p>Mr Geoff Rees is one of the founding partners of specialist law firm, Brian Ward &amp; Partners and serves on the board of directors at Uniseed. He was one of the first Accredited Business Law Specialists in Victoria, meeting the requirements of the Law Institute in 1991. Before joining Brian Ward &amp; Partners, Geoff was with Hedderwicks Fookes and Alston (now Arthur Robinson &amp; Hedderwicks).</p>\n\n<p>Geoff graduated from The University of Melbourne with degrees in Commerce and Law, with specialist interests in accounting, finance and commercial law. During his time at the University, he rowed regularly for Australia and was a member of the first Australian crew to win a gold medal at a World Rowing Championship. During the course of the 70&#8217;s, he also won silver and bronze medals at World Rowing Championships held throughout Europe. His interests in sport have continued in the law, with Brian Ward &amp; Partners being one of the premier practices in the field of Sports Law.</p>\n\n<p>In 1989, he was asked to join the Board of one of the two major publicly listed radio networks. His appointment was part of the initiation and implementation of a major restructuring and change in strategic direction. The restructuring was completed and the new direction was successfully implemented prior to takeover by one of the large national radio groups.</p>\n\n<p>In April 1995 Professor David Pennington, in his capacity as Vice Chancellor of The University of Melbourne, invited Geoff to join the Board of the University technology transfer company (Unimelb Limited). The company was responsible for commercialising the intellectual property of the University, however work was required to redefine its strategic direction and establish itself as a successful contributor to the activities and finances of The University of Melbourne.</p>","image":{"available_sizes":[[[100,120],"assets/images/resized/0004/6908/46908v1-max-150x150.jpg"],[[100,120],"assets/images/resized/0004/6908/46908v1-max-250x250.jpg"],[[100,120],"assets/images/resized/0004/6908/46908v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Graduate","subject":"Commerce and Law","institution":"The University of Melbourne","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"","firm":{"name":"Uniseed Pty","permalink":"uniseed-pty","type_of_entity":"financial_org","image":{"available_sizes":[[[144,150],"assets/images/resized/0004/6906/46906v1-max-150x150.jpg"],[[159,165],"assets/images/resized/0004/6906/46906v1-max-250x250.jpg"],[[159,165],"assets/images/resized/0004/6906/46906v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}