{"first_name":"Geoffrey","last_name":"Fahey","permalink":"geoffrey-fahey","crunchbase_url":"http://www.crunchbase.com/person/geoffrey-fahey","homepage_url":"","birthplace":"Long Branch, NJ","twitter_username":"GeoffFahey","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1980,"born_month":11,"born_day":29,"tag_list":"","alias_list":null,"created_at":"Tue Jul 05 20:47:56 UTC 2011","updated_at":"Sat Jan 21 01:12:32 UTC 2012","overview":"<p>Geoffrey Fahey is Founder and CEO of Qoggo, which was initially founded in Tampa, FL in 2011. He is responsible for the overall direction and product strategy for Qoggo. Geoff leads the vision of Qoggo&#8217;s team, and provides creative ways to bring ideas into reality. He believes Qoggo presents a unique way to connect consumers with decision makers using a fun, centralized platform, and will simplify marketing methods as we know them today.</p>\n\n<p>Earlier in his life, Fahey was a First-Team All-State Cross Country/Track High School Athlete in New Jersey. He then went on to attend Saint Joseph&#8217;s University in Philadelphia, PA where he studied Finance and Food Marketing, and helped lead the Hawks to win the 2000 Atlantic 10 Conference Cross Country Championship.</p>\n\n<p>While attending, and after graduating from Saint Joseph&#8217;s University, Fahey held various  full time positions. He helped operate and manage a small business called DJ&#8217;s Cycles and Fitness in Long Branch, New Jersey for several years, and is well versed in areas of consumer product goods, retail sales and management, B2B and B2C sales. Most recently, he held positions focusing on sales, marketing, management, and account management of national, regional and local accounts such as 7-11, Circle-K, Wawa, and Sam&#8217;s Club, while working at Philip Morris USA/Altria Group Distribution Company for seven years.</p>","image":{"available_sizes":[[[115,150],"assets/images/resized/0014/2562/142562v4-max-150x150.jpg"],[[127,165],"assets/images/resized/0014/2562/142562v4-max-250x250.jpg"],[[127,165],"assets/images/resized/0014/2562/142562v4-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BS","subject":"Finance","institution":"Saint Joseph's University","graduated_year":2003,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/geoffrey-fahey/29/33/837","title":"Linked In Profile"},{"external_url":"http://twitter.com/geofffahey","title":"Twitter Profile"}]}