{"first_name":"George","last_name":"Kurtz","permalink":"george-kurtz","crunchbase_url":"http://www.crunchbase.com/person/george-kurtz","homepage_url":"http://www.georgekurtz.com","birthplace":"New Jersey","twitter_username":"george_kurtz","blog_url":"http://www.georgekurtz.com","blog_feed_url":"http://www.georgekurtz.com","affiliation_name":"McAfee","born_year":null,"born_month":null,"born_day":null,"tag_list":"security-malware-mcafee-foundstone","alias_list":null,"created_at":"Tue Feb 21 19:53:56 UTC 2012","updated_at":"Sat Feb 25 10:53:18 UTC 2012","overview":"<p>George Kurtz is an internationally recognized security expert, author, entrepreneur and speaker. He has almost twenty years of experience in the security space and has helped hundreds of large organizations and government agencies around the world tackle the most demanding security problems. His entrepreneurial background and ability to commercialize nascent technologies have enable him to drive innovation throughout his career by identifying market trends and correlating them with customer feedback, resulting in rapid growth for the businesses he has run. </p>\n\n<p>George previously was McAfee’s Worldwide Chief Technology Officer. As McAfee’s CTO, Kurtz was responsible for driving the integrated security architectures and platforms across the entire McAfee portfolio.  Kurtz also helped drive the acquisition strategy that allowed McAfee to grow from $1b in revenue to over $2.5b.  In one of the largest tech M&amp;A deals in 2011, Intel (INTC) acquired McAfee for nearly $8b.   He helped to transform McAfee from a point product company to a provider of security risk management and compliance optimization solutions.   Kurtz formerly held the position of SVP McAfee Enterprise, where he was responsible for helping to drive the sales growth of the enterprise product portfolio on a worldwide basis.  </p>\n\n<p>Prior to joining McAfee, Kurtz was Chief Executive Officer of and founder of Foundstone, Inc., which was acquired by McAfee in October 2004.  As CEO he brought to Foundstone a unique combination of business acumen and technical security know-how.  Kurtz positioned the company for rapid growth.  His entrepreneurial spirit positioned Foundstone as one of the fastest growing &#8220;pure play&#8221; security solutions providers in the industry.   </p>\n\n<p>Before Foundstone, he served as a senior manager and the national leader of Ernst &amp; Young’s Security Profiling Services Group. Prior to joining Ernst &amp; Young, he was a manager at Price Waterhouse, where he was responsible for developing their network-based attack and penetration methodologies used around the world.  </p>\n\n<p>Under his direction as CEO, Foundstone received numerous awards, including Inc.’s “Top 500 Companies.”  Kurtz has been awarded Software Council of Southern California’s “Software Entrepreneur of the Year 2003” and “Software CEO of the Year 2005,” as well as Fast Company’s “Fast 50,” American Electronics Association’s “Outstanding Executive,” Deloitte’s “Fast 50,” Ernst &amp; Young’s “Entrepreneur of the Year Finalist,” Orange County’s “Hottest 25 People” and others.  In addition to co-authoring the best-selling security book ever published (McGraw-Hill, Hacking Exposed: Network Security Secrets &amp; Solutions), Kurtz has written for many other industry publications.  </p>\n\n<p>He has also been quoted or featured in many major publications, media outlets and television programs, including CNN, Fox News, ABC World News, Associated Press, USA Today, Wall Street Journal, The Washington Post, Time, ComputerWorld, eWeek, CNET and others.  </p>\n\n<p>Kurtz holds a Bachelor of Science degree from Seton Hall University and has earned several industry designations, including Certified Information Systems Security Professional (CISSP), Certified Information Systems Auditor (CISA) and Certified Public Accountant (CPA).  Kurtz was recently granted patent numbers 7,152,105 and 7,543,056 - “System and method for network vulnerability detection and reporting.”  </p>\n\n<p>Additional patents are pending. You can follow George on Twitter @george_kurtz </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0017/5257/175257v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0017/5257/175257v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0017/5257/175257v2-max-450x450.jpg"]],"attribution":"<p>George Kurtz</p>"},"degrees":[{"degree_type":"BS","subject":"Accounting","institution":"Seton Hall University","graduated_year":1992,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"Foundstone","permalink":"foundstone","type_of_entity":"company","image":null}},{"is_past":true,"title":"CTO","firm":{"name":"McAfee","permalink":"mcafee","type_of_entity":"company","image":null}},{"is_past":true,"title":"Sr. Manager","firm":{"name":"E&Y","permalink":"e-y","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://twitter.com/#!/George_Kurtz","title":"Twitter"},{"external_url":"http://www.linkedin.com/in/georgekurtz","title":"Linked-In"},{"external_url":"http://www.securitybattlefield.com","title":"Blog"}]}