{"first_name":"George","last_name":"Chruch","permalink":"george-chruch","crunchbase_url":"http://www.crunchbase.com/person/george-chruch","homepage_url":"http://arep.med.harvard.edu/gmc/","birthplace":"MacDill Air Force Base, Florida","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1954,"born_month":8,"born_day":28,"tag_list":"","alias_list":null,"created_at":"Sat May 07 01:19:31 UTC 2011","updated_at":"Sun May 08 23:16:36 UTC 2011","overview":"<p>George Church is an American molecular geneticist. He is currently Professor of Genetics at Harvard Medical School, Professor of Health Sciences and Technology at Harvard and MIT, and a core faculty member at the Wyss Institute for Biologically Inspired Engineering at Harvard University.</p>\n\n<p>With Walter Gilbert he developed the first direct genomic sequencing method in 1984 and helped initiate the Human Genome Project in 1984 while he was a Research Scientist at newly-formed Biogen Inc. He invented the broadly-applied concepts of molecular multiplexing and tags, homologous recombination methods, and DNA array synthesizers. Technology transfer of automated sequencing &amp; software to Genome Therapeutics Corp. resulted in the first commercial genome sequence, (the human pathogen, Helicobacter pylori) in 1994,</p>\n\n<p>He initiated the Personal Genome Project (PGP) in 2005, and, in 2007, he founded the U.S. personal genomics company Knome (with Jorge Conde and Sundar Subramaniam). He does research on synthetic biology and is director of the U.S. Department of Energy Center on Bioenergy at Harvard &amp; MIT and director of the National Institutes of Health (NHGRI) Center of Excellence in Genomic Science at Harvard.</p>\n\n<p>He has been advisor to 22 companies, co-founding (with Joseph Jacobson, Jay Keasling, and Drew Endy) Codon Devices, a biotech startup dedicated to synthetic biology, which produces DNA sequences to order. With Chris Somerville, Jay Keasling, Noubar Afeyan, and David Berry he founded LS9, which is focused on biofuels or renewable petroleum technologies. He is a senior editor for Nature EMBO Molecular Systems Biology.</p>\n\n<p>In September 2010, Dr. Church was honored for his work in Genetics with the Mass High Tech All-Star Award.</p>","image":{"available_sizes":[[[150,145],"assets/images/resized/0013/3591/133591v2-max-150x150.jpg"],[[250,243],"assets/images/resized/0013/3591/133591v2-max-250x250.jpg"],[[252,245],"assets/images/resized/0013/3591/133591v2-max-450x450.jpg"]],"attribution":"<p>(http://arep.med.harvard.edu/gmc/)</p>"},"degrees":[{"degree_type":"BA","subject":"Zoology & Chemistry","institution":"Duke University","graduated_year":1974,"graduated_month":null,"graduated_day":null},{"degree_type":"Ph.D.","subject":"Biochemistry and Molecular Biology","institution":"Harvard University","graduated_year":1984,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}