{"first_name":"George","last_name":"S. Davis","permalink":"george-s-davis","crunchbase_url":"http://www.crunchbase.com/person/george-s-davis","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Nov 18 11:51:12 UTC 2008","updated_at":"Tue Nov 18 11:52:59 UTC 2008","overview":"<p>George Davis is senior vice president and chief financial officer of Applied Materials, Inc., the global leader in nanomanufacturing technology solutions for the electronics industry. He was named to this position on November 1, 2006.</p>\n\n<p>Davis had been head of Applied Materials’ Corporate Business Development group since February 2005. In that position, he was responsible for merger and acquisition activities, strategic planning, and management of the Company’s venture investments. From November 1999 to February 2005, Davis served as corporate treasurer, where he managed Applied’s worldwide treasury operations and was responsible for investments, tax, financial risk management, and trade and export matters.</p>\n\n<p>Prior to joining Applied Materials, Davis served as vice president of finance, Europe, Middle East and Africa for Atlantic Richfield Company (ARCO), where he was chief financial officer for ARCO’s operations throughout that region. He is chairman of the North American Advisory Board of Semiconductor Equipment and Materials International (SEMI), the global industry association serving companies that provide equipment, materials and services used to manufacture semiconductors, displays and other technology. He is also a member of the Board of Trustees of the San Jose Repertory Theatre.</p>\n\n<p>Davis received his undergraduate degree in economics and political science from Claremont McKenna College and his master&#8217;s in business administration from the University of California, Los Angeles.</p>","image":{"available_sizes":[[[105,150],"assets/images/resized/0002/8810/28810v1-max-150x150.jpg"],[[140,200],"assets/images/resized/0002/8810/28810v1-max-250x250.jpg"],[[140,200],"assets/images/resized/0002/8810/28810v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Senior Vice President, Chief Financial Officer","firm":{"name":"Applied Ventures","permalink":"applied-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[111,46],"assets/images/resized/0002/8809/28809v1-max-150x150.jpg"],[[111,46],"assets/images/resized/0002/8809/28809v1-max-250x250.jpg"],[[111,46],"assets/images/resized/0002/8809/28809v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}