{"first_name":"George","last_name":"Hansen","permalink":"george-hansen","crunchbase_url":"http://www.crunchbase.com/person/george-hansen","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Sep 03 05:12:24 UTC 2011","updated_at":"Sat Sep 03 05:17:37 UTC 2011","overview":"<p>Mr. Hansen has more than 30 years experience managing businesses in multiple industries in both North America and Europe. Hansen has managed in publically traded businesses as well as private equity backed organizations. He has also been involved in startups, acquisitions, demergers and exits in both the public and private markets. </p>\n\n<p>Most recently, George Hansen was a Director of TGP Investments, a $56.5M private equity investment firm in Kansas City, Missouri. Immediately prior to joining TGP Investments, Hansen was the CEO and President of Corporate Lodging Consultants, Inc., a market leading business process outsourcing company serving Fortune 100 companies and the US government. From 1999 to 2004, he was the CEO and President of CARSTAR, Inc. the nation’s largest collision repair aggregator. Hansen held senior general management positions at Thorn EMI, PLC in both North America and Europe from 1988 to 1998. Hansen began his career in the food service business, holding senior positions at Denny’s, Inc. and Wendy’s International. </p>\n\n<p>A graduate of the University of Maine he also holds a certificate in Management from Columbia University. Hansen has served on a number of charitable boards and currently sits on the Board of Advisors to the Business School at the University of Kansas, where he regularly lectures on strategy.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President, CEO","firm":{"name":"Zave Networks","permalink":"zave-networks","type_of_entity":"company","image":{"available_sizes":[[[150,88],"assets/images/resized/0015/2491/152491v1-max-150x150.jpg"],[[250,147],"assets/images/resized/0015/2491/152491v1-max-250x250.jpg"],[[450,264],"assets/images/resized/0015/2491/152491v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}