{"first_name":"George","last_name":"C. Kenney","permalink":"george-c-kenney","crunchbase_url":"http://www.crunchbase.com/person/george-c-kenney","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Nov 30 17:45:02 UTC 2008","updated_at":"Sun Nov 30 17:47:02 UTC 2008","overview":"<p>George Kenney,  a Managing Director and co-founder of Shepherd Ventures, has a strong technical background combined with extensive Wall Street and financial industry experience. George has been a successful manager in rapid growth environments, turning around struggling operations and developing and mentoring high technology companies. He specializes in information systems, semiconductors, components and networking, and pioneered optical recording technology.</p>\n\n<p>Before forming Shepherd Ventures, George was CTO and Partner at Nicholas-Applegate, a money management firm in San Diego, where he directed the technology infrastructure expansion necessary to grow the company from a local presence to a network of international locations. Prior to Nicholas-Applegate, George was CTO and Managing Director at Kidder Peabody in New York City. Previously he held top information technology positions at Swiss Bank, Salomon Brothers and the American Stock Exchange. As Director of Research for North American Philips and co-founder of Digital Measurements Corp., George obtained numerous US and foreign patents.</p>\n\n<p>George holds an MBA in Finance from Columbia University, an MSEE from Stanford University and a BS in Electrical Engineering from Rensselaer Polytechnic Institute. Additionally, he attended the Optic’s Program at London’s Imperial College and is a graduate of Harvard University’s Industrial Management Program. A noted technology futurist, George has been a keynote speaker at financial conferences on The Future of Technology. He has served as a Trustee for the San Diego Museum of Art and as pro-bono Chairman of the museum&#8217;s Investment Committee.  He has also served on the Board of Governors of the National Association of Small Business Investment Companies and is currently  a board member of several technology companies.</p>","image":{"available_sizes":[[[126,150],"assets/images/resized/0003/0253/30253v1-max-150x150.jpg"],[[186,220],"assets/images/resized/0003/0253/30253v1-max-250x250.jpg"],[[186,220],"assets/images/resized/0003/0253/30253v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Shepherd Ventures","permalink":"shepherd-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[108,150],"assets/images/resized/0003/0252/30252v1-max-150x150.jpg"],[[146,202],"assets/images/resized/0003/0252/30252v1-max-250x250.jpg"],[[146,202],"assets/images/resized/0003/0252/30252v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}