{"first_name":"George","last_name":"Whitehead","permalink":"george-whitehead","crunchbase_url":"http://www.crunchbase.com/person/george-whitehead","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"NESTA","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu May 21 02:03:01 UTC 2009","updated_at":"Mon Nov 15 18:55:48 UTC 2010","overview":"<p>George is NESTA&#8217;s Business Development Director and heads up NESTA&#8217;s Economic Programmes.</p>\n\n<p>George heads up all of NESTA&#8217;s programmes related to supporting growing companies. These range from our investments in early stage funds like Seedcamp, to our support of networks such as the British Business Angels Association, Business Leaders Network, The British Library IP Centre, Springboard and the Microelectronics Acadey. A key part of his role is to bring together NESTA&#8217;s robust research agenda alongside a number of programmes aimed at supporting high growth companies to ensure NESTA is a credible and positive influence in the wider entrepreneurial market.\nWith a £50million investment fund targeted at early stage technology companies, George is also involved in all aspects of investment with particular focus on promoting the investment fund and providing NESTA&#8217;s portfolio companies with effective business-building expertise and support.\nDuring his career, George has led numerous projects working with government and commercial organisations to help solve funding, management and skills problems facing companies trapped in the equity gap. Prior to NESTA, George set up a biotechnology incubator, and managed an ICT incubator in Canada on behalf of the University of Toronto. He began his career as an Investment Manager at Oxford Innovation, where he built up one of the most successful business angel networks in Europe. He is a Director of the British Business Angels Association and sits on the Advisory/investment committees of UK Sport and Health Launchpad.</p>","image":{"available_sizes":[[[105,105],"assets/images/resized/0004/4905/44905v1-max-150x150.jpg"],[[105,105],"assets/images/resized/0004/4905/44905v1-max-250x250.jpg"],[[105,105],"assets/images/resized/0004/4905/44905v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Business Development Director","firm":{"name":"NESTA Investments","permalink":"nesta","type_of_entity":"financial_org","image":{"available_sizes":[[[130,79],"assets/images/resized/0004/4899/44899v1-max-150x150.jpg"],[[130,79],"assets/images/resized/0004/4899/44899v1-max-250x250.jpg"],[[130,79],"assets/images/resized/0004/4899/44899v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}