{"first_name":"George","last_name":"S. Reichenbach","permalink":"george-s-reichenbach","crunchbase_url":"http://www.crunchbase.com/person/george-s-reichenbach","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jan 10 12:25:34 UTC 2009","updated_at":"Wed Jun 03 11:10:02 UTC 2009","overview":"<p>George S. Reichenbach has more than 30 years of venture capital and operating experience. Prior to co-founding Braemar Energy Ventures, he worked as a partner at Advent International, a venture capital firm with $4.5 billion under management, where he was in charge of the industrial sector group. While at Advent, Dr. Reichenbach was responsible for the firm&#8217;s 17 investments in power technology and related areas. Prior to working for Advent, Dr. Reichenbach was an executive at the Norton Company, an industrial products company, where he ran two divisions. Before joining the Norton Company, Dr. Reichenbach was a professor of mechanical engineering at the Massachusetts Institute of Technology. Dr. Reichenbach has a Masters and a Ph.D. degree, from the Massachusetts Institute of Technology in mechanical engineering and a Bachelor of Engineering from Yale. He currently serves on the board of directors of Questair Technologies Inc., Auripay Inc., Capital Management Associates, Cerion Corporation and Stion Corporation. He has also served on various committees for the Department of Energy and the National Energy Renewable Laboratory and the Governor of Massachusetts appointed him to the Steering Committee for the Emerging Technology Fund for the State of Massachusetts. </p>","image":null,"degrees":[{"degree_type":"Ph.D.","subject":"Mechanical engineering","institution":"Massachusetts Institute of Technology","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Braemar Energy Ventures","permalink":"braemar-energy-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,34],"assets/images/resized/0005/1049/51049v1-max-150x150.png"],[[250,57],"assets/images/resized/0005/1049/51049v1-max-250x250.png"],[[262,60],"assets/images/resized/0005/1049/51049v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}