{"first_name":"George","last_name":"Assimakopoulos","permalink":"george-assimakopoulos","crunchbase_url":"http://www.crunchbase.com/person/george-assimakopoulos","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Mar 24 09:13:43 UTC 2011","updated_at":"Thu Mar 24 09:15:44 UTC 2011","overview":"<p>As founder and CEO of EyeTraffic Media, George is responsible for defining the strategic vision of the firm and delivering effective solutions to clients. George has recently worked closely with several Fortune 500 organizations – including MazdaUSA and National Geographic – to provide strategic interactive marketing program direction and management of interactive marketing initiatives as part of an integrated advertising approach. Prior to starting EyeTraffic Media, George served as Director of Client Services at PROXICOM, Inc. where he managed the implementation of marketing, branding, and commerce programs through the Internet. At Proxicom, George was an integral part for several strategic web engagements to Fortune 500 companies, including: ExxonMobil, NIKE, Merrill Lynch, Chase Bank, DuPont Company, and Home Box Office (HBO). George enjoys working closely with clients to develop new strategic internet marketing services. George received a B.S. in marketing from the University of Maryland, and an M.B.A. in international marketing and information systems from The American University. With more than 15 years of online marketing experience, George is a frequent speaker at industry conferences on topics for Internet marketing, branding strategies and emerging media. In addition, he regularly teaches classes at the University of Maryland, The American University, and The University of Virginia on topics of Interactive and Integrated Marketing.</p>","image":null,"degrees":[{"degree_type":"B.S.","subject":"Marketing","institution":"University of Maryland","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO & Principal Manager","firm":{"name":"EyeTraffic Media","permalink":"eyetraffic-media","type_of_entity":"company","image":{"available_sizes":[[[150,72],"assets/images/resized/0012/7533/127533v1-max-150x150.jpg"],[[212,103],"assets/images/resized/0012/7533/127533v1-max-250x250.jpg"],[[212,103],"assets/images/resized/0012/7533/127533v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}