{"first_name":"George","last_name":"Donovan","permalink":"george-donovan","crunchbase_url":"http://www.crunchbase.com/person/george-donovan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Gogii Games","born_year":null,"born_month":null,"born_day":null,"tag_list":"president","alias_list":null,"created_at":"Tue May 03 17:10:52 UTC 2011","updated_at":"Wed Jul 06 19:06:18 UTC 2011","overview":"<p>Founder and President</p>\n\n<p>George Donovan approaches casual game publishing and development with the strong business acumen and creative spirit often associated with successful entrepreneurship. Only thirty-eight, Donovan is already considered a pioneer in the online marketplace. His career in the digital market began after acquiring a degree in international software marketing. Soon after he established and sold his first IT company Internet Communities. Naturally, he launched another company thereafter, iNFiknowledge, a firm that expanded to include a full time staff of 90 individuals before it too was sold to Traffix Inc., a NASDAQ publicly traded corporation, in 2001.</p>\n\n<p>Founded in 2006, Gogii Games has since expanded to include a full time staff of thirty individuals. As a developer and publisher, Donovan has also established strong relationships with a variety of international studios. Donovan ensured at the outset that Gogii Games was positioned to compete in an international market, by releasing games in multiple formats and in multiple languages. With more than ten Number 1 games currently in their extensive product library, the company publishes an average of ten games a year. Constantly striving to better the organizational model and increase revenues, Donovan has focused on the mobile market with the addition of a dedicated team of IOS developers in house, geared toward the creation of original and twinned content for mobile platform consumption.</p>\n\n<p>When not focused on streamlining and managing the business, Donovan can be found spending the majority of his free time with his most important venture, an expanded family – one that now includes three children. Limited in time, his sole other passions include trend analysis and golf. On a very good day, he can be found on a golf course, mobile phone in hand of course. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO and Founder","firm":{"name":"Gogii Games","permalink":"gogii-games","type_of_entity":"company","image":{"available_sizes":[[[150,90],"assets/images/resized/0013/3038/133038v2-max-150x150.png"],[[250,150],"assets/images/resized/0013/3038/133038v2-max-250x250.png"],[[450,270],"assets/images/resized/0013/3038/133038v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}