{"first_name":"George","last_name":"W. Bodenheimer","permalink":"george-w-bodenheimer","crunchbase_url":"http://www.crunchbase.com/person/george-w-bodenheimer","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 21 02:33:58 UTC 2008","updated_at":"Wed May 21 02:52:20 UTC 2008","overview":"<p>An ESPN and cable industry pioneer, George Bodenheimer, 46, was named ESPN&#8217;s fifth President on November 19, 1998. Bodenheimer&#8217;s path to leadership mirrors that of ESPN itself - with his sharp focus on creativity and cutting-edge innovation, his emphasis on always enhancing value for ESPN&#8217;s fans and business partners, and his conviction for teamwork. On March 3, 2003, he was also appointed President of ABC Sports, overseeing all the multimedia sports assets of The Walt Disney Company. The role of co-chairman, Disney Media Networks was added on April 20, 2004.</p>\n\n<p>As President of ESPN, Inc., Bodenheimer leads one of the world&#8217;s premier brands with more than 40 business entities and counting - including seven domestic (ESPN, ESPN2, ESPN Classic, ESPNEWS, ESPN Deportes, ESPN Today and ESPN Now) and 25 international television networks, ESPN HD, a simulcast service of ESPN in high-definition, ESPN Regional Television, ESPN.com, ESPN Radio, ESPN The Magazine and books, SportsTicker, the ESPN Zones (sports-themed restaurants), and other growing new businesses including ESPN Broadband, ESPN Wireless, ESPN Video-on-Demand, ESPN Interactive and ESPN Pay-Per-View.</p>\n\n<p>As President of ABC Sports, he plans to grow its tradition of excellence. ABC Sports has the most comprehensive sports programming schedule and is the broadcast home of Monday Night Football, the NBA Finals, Stanley Cup, the BCS Championship, World Cup Soccer, British Open, Little League World Series, U.S. and World Figure Skating Championships, the IRL featuring the Indy 500, PGA TOUR and more. ABC Sports is Championship Television.</p>\n\n<p>Bodenheimer, who joined the company in January 1981, had served as Executive Vice President, Sales and Marketing for ESPN since September 1996. </p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/8993/18993v1-max-150x150.jpg"],[[200,200],"assets/images/resized/0001/8993/18993v1-max-250x250.jpg"],[[200,200],"assets/images/resized/0001/8993/18993v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://corporate.disney.go.com/corporate/management_team.html\" title=\"Disney\" rel=\"nofollow\">Disney</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Co-Chairman, Disney Media Networks, President, ESPN, Inc. and ABC Sports, Chairman, ESPN Board of Directors","firm":{"name":"The Walt Disney Company","permalink":"the-walt-disney-company","type_of_entity":"company","image":{"available_sizes":[[[150,73],"assets/images/resized/0001/0929/10929v1-max-150x150.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-250x250.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}