{"first_name":"George","last_name":"Abraham","permalink":"george-abraham","crunchbase_url":"http://www.crunchbase.com/person/george-abraham","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 28 09:33:20 UTC 2008","updated_at":"Sat Nov 29 11:44:21 UTC 2008","overview":"<p>Prior to co-founding SAS Investors, George was a founding officer of Zurich Payroll Solutions (ZPS), serving as vice president of mergers, acquisitions, and strategic alliances. He also served as a founding vice president of NYC2008, a committee established to bring the Summer Olympic Games to New York City. In 1990, George was hired to run Ajax Capital Corporation and grew the business to become an active private equity investing and real estate development company. As part of his activity at Ajax, he led the acquisition and financing of the NHL&#8217;s Winnipeg Jets and the team&#8217;s relocation to Phoenix where they became the Phoenix Coyotes. He started his career in public accounting with Richard A. Eisner &amp; Co., CPA, and is a graduate of Lehigh University with a B.S. in Finance.</p>\n\n<p>George is a member of the Board of Directors of Textronics and RNT, and previously served on the Boards of Tacit Networks, Protonex, Kirusa and Predictive Power. He is a frequent speaker and guest lecturer on entrepreneurship and early stage investing.</p>\n\n<p>George is active in community-related activities, and sits on the Board of The Montclair Cooperative School in Montclair, N.J.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner and Co-Founder","firm":{"name":"SAS Investors","permalink":"sas-investors","type_of_entity":"financial_org","image":{"available_sizes":[[[102,80],"assets/images/resized/0002/9871/29871v1-max-150x150.jpg"],[[102,80],"assets/images/resized/0002/9871/29871v1-max-250x250.jpg"],[[102,80],"assets/images/resized/0002/9871/29871v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}