{"first_name":"George","last_name":"Zaloom","permalink":"george-zaloom-2","crunchbase_url":"http://www.crunchbase.com/person/george-zaloom-2","homepage_url":"http://www.goplay.com","birthplace":"Brooklyn","twitter_username":"goplay","blog_url":"","blog_feed_url":"","affiliation_name":"GoPlay","born_year":null,"born_month":null,"born_day":null,"tag_list":"social-games, gaming, family-entertainment, kids, social-networks","alias_list":null,"created_at":"Sat Aug 07 22:45:27 UTC 2010","updated_at":"Thu Jan 12 03:29:51 UTC 2012","overview":"<p>George Zaloom is the founder and CEO of Playgistics, Inc. a Los Angeles-based new media company. Playgistics develops and operates online consumer Internet products. </p>\n\n<p>In January of 2012 the company released GoPlay.com &#8211; the first online destination created exclusively for social games.  Other sites operated by Playgistics include: gamestamper.com – a social game distribution platform and giantHello.com &#8211; a safe social network for tweens (ages 7 to 13).  </p>\n\n<p>Before starting Playgistics, Zaloom ran business development for the leading Internet celebrity news service: x17online.com.  At x17 he negotiated a financing agreement, created and developed new platforms and micro sites.  He was also instrumental in growing traffic from 4m monthly unique visitors to 10m.  </p>\n\n<p>Zaloom has also provided financial modeling services for leading children’s media sites Kidsvideos.com and kidmango.com.   Prior to that he managed the re-build of the entertainment website Sexliesandvideotape.com.  Zaloom rewrote SLV’s business plan and secured new creative management for the company.</p>\n\n<p>Prior to that he was the Executive Producer of MediaEdge/Group M Entertainment’s bandinabubble.com.  Zaloom supervised the multi-platform (TV, web, mobile) MTV event for media agency’s clients: Dr Pepper, Wal*Mart and KFC.  Band in a Bubble also marked the launch of WP’s branded entertainment division.  Zaloom was also instrumental in the launch of the Green online shoppers guide Greenopia.com and provided business management for the start up.</p>\n\n<p>Prior to entering the new media field, Zaloom held senior executive positions with Walden Media and DreamWorks Animation where he supervised the production of Kung Fu Panda.  Prior to that, Zaloom ran ZM Productions, a major Hollywood production company, which produced the motion picture Encino Man, numerous movies of the week for ABC’s Wonderful World of Disney, the Back to the Future Animated Series and the Emmy Award winning Images of Life. </p>\n\n<p>While at ZM, George Zaloom incubated the early Internet content provider: Spin Cycle Entertainment (later sold to iXL).  Spin Cycle was credited with creating Universal Studio’s first Java-enabled online game.  The company also produced the Microsoft television special on the launch of Windows 95.  </p>\n\n<p>George Zaloom has lectured at USC, UCLA, and the American Film Institute.  Recently he has spoken at the U.S. Senate on the topic of Cyber Bullying, DCM-LA, GDC and the Toy Fair Engage! Expo panel on Social Media and Kids. </p>\n\n<p>He is a member in good standing of the Directors Guild of America, and the Writers Guild of America.  He has participated in the Palisades/Malibu YMCA Indian Guides Program.  He also proudly served as a firefighter with the Millburn, New Jersey Fire Department.</p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0009/6652/96652v2-max-150x150.jpg"],[[187,250],"assets/images/resized/0009/6652/96652v2-max-250x250.jpg"],[[336,448],"assets/images/resized/0009/6652/96652v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"School of Cinema","subject":"Production","institution":"University of Southern California","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"GoPlay","permalink":"goplay","type_of_entity":"company","image":{"available_sizes":[[[150,146],"assets/images/resized/0014/8956/148956v4-max-150x150.jpg"],[[250,244],"assets/images/resized/0014/8956/148956v4-max-250x250.jpg"],[[450,440],"assets/images/resized/0014/8956/148956v4-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"CEO","firm":{"name":"giantHello","permalink":"gianthello-com","type_of_entity":"company","image":{"available_sizes":[[[150,129],"assets/images/resized/0009/9847/99847v2-max-150x150.png"],[[250,216],"assets/images/resized/0009/9847/99847v2-max-250x250.png"],[[450,389],"assets/images/resized/0009/9847/99847v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}