{"first_name":"Gerardo","last_name":"Betancourt","permalink":"gerardo-betancourt","crunchbase_url":"http://www.crunchbase.com/person/gerardo-betancourt","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"The Geeworld Studios","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Dec 10 20:41:36 UTC 2008","updated_at":"Fri Jan 23 11:51:36 UTC 2009","overview":"<p>Founder of Geeworld.com, a social utility that connects filmmakers and musicians with fans and industry executives. Develops concepts into marketable motion pictures and music albums, designs and develops promotional websites for independent films, identifies 3rd party concepts and screenplays with marketing potential, coordinates casting of film projects, edits video and sound for film projects, composes scores and assorted musical tracks, authors DVDs, masters CDs, and designs product packaging.</p>\n\n<p>Gerardo Betancourt (also known as Gee and Geebee) was raised &#8220;a child of television and cinema.&#8221; He was born on September 9, 1974 in Bayamon, Puerto Rico, to a middle class home. Throughout his childhood, and into his early teens, he spent most of his time in front of a television screen. Drama, mystery, and science-fiction became his favorite genres. He also became particularly interested in black-and-white films such as &#8220;Casablanca&#8221;, &#8220;Citizen Kane&#8221;, &#8220;To Have And Have Not&#8221;, &#8220;The Roaring Twenties&#8221;, and &#8220;Key Largo&#8221;, which today remain among his favorites. Though at that time he was already a fan of names such as Bogart, Bacall, Cagney, and Edward G. Robinson, his passion for film and story telling would only become apparent later in college.</p>\n\n<p>In early 1990, he moved to Orlando, Florida to further his education. He graduated from Winter Park H.S. in 1992, and was accepted to the University of Central Florida that same summer. While in college, he developed an affinity, not just for film, but for music, writing and design. These elements remained an intricate part of his life, becoming key in his ability to show others his vision. Five years after his acceptance to UCF, he graduated with a B.A. in Film (Motion Picture Technology and Computer Animation).</p>\n\n<p>In 2004, he wrote a children&#8217;s book called &#8220;The Castaway Clocks Of The Castle At Northwind,&#8221; and composed a score for it (&#8220;Castaway Clocks&#8221;) which he self-published on-line and in-stores the following year. In July of 2006, his first film, &#8220;That One Moment&#8221; (a semi-autobiographical monologue of a man recalling and explaining an answer given to a friend in regard to a question about life), was accepted to the Los Angeles International Shorts Festival (L.A. Shorts Fest), held at the ArcLight Cinemas in Hollywood, where it premiered. This film became a large stepping stone for him, as not only did it make him a public figure in the world of filmmaking, it also gave him a chance to show the world what really drives him in life.</p>\n\n<p>In February of 2008, he completed his second film, &#8220;The Hollywood Informant&#8221; (a black-and-white film noir production that delves into murder, deceit, and corruption in prohibition-era Los Angeles), which was produced in collaboration with Habit Forming Films and A.P. Stack. He currently resides near Beverly Hills, but is known to truly live in the heart of Hollywood.</p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0003/2986/32986v2-max-150x150.jpg"],[[187,250],"assets/images/resized/0003/2986/32986v2-max-250x250.jpg"],[[300,400],"assets/images/resized/0003/2986/32986v2-max-450x450.jpg"]],"attribution":"<p>The Geeworld Studios</p>"},"degrees":[{"degree_type":"Bachelor of Arts","subject":"Motion Picture Technology / Computer Animation","institution":"University of Central Florida","graduated_year":1997,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"The Geeworld Studios","permalink":"the-geeworld-studios","type_of_entity":"company","image":{"available_sizes":[[[150,25],"assets/images/resized/0003/1492/31492v2-max-150x150.jpg"],[[250,43],"assets/images/resized/0003/1492/31492v2-max-250x250.jpg"],[[435,75],"assets/images/resized/0003/1492/31492v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.myspace.com/gerardobetancourt","title":"MySpace"},{"external_url":"http://www.facebook.com/people/Gerardo-Betancourt/502510581","title":"Facebook"},{"external_url":"http://www.linkedin.com/in/gerardobetancourt","title":"LinkedIn"},{"external_url":"http://phobos.apple.com/WebObjects/MZStore.woa/wa/viewArtist?id=134740365","title":"iTunes"}]}