{"first_name":"Gerard","last_name":"Callaghan","permalink":"gerard-callaghan","crunchbase_url":"http://www.crunchbase.com/person/gerard-callaghan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Feb 16 12:14:16 UTC 2012","updated_at":"Thu Feb 16 12:15:47 UTC 2012","overview":"<p>Gerard Callaghan was a founder member of the Leighton Group in 1992 having previously worked in business consulting for a variety of organisations. During 1992-1997 Gerard held a number of senior positions within the Leighton Group, managing several projects and products.\nDuring 1997 Gerard became CEO of Domainnames.com a company created by Leighton to exploit the growing demand in domain name registration and related services. This company grew rapidly, and by 2000 had sales and customer service centres in North and South America, Australia, the Far East and Europe.\nDuring late 2000 Leighton entered into a trade sale of the company Domainnames.com to VeriSign Inc., the world&#8217;s largest domain registrar and leading software security company. After the disposal of Domainnames.com to VeriSign, Gerard was appointed as the Managing Director of Mass Markets for VeriSign within Europe.\nHe rejoined the Leighton Group in the autumn of 2002 and operated as Commercial Director and General Manager for 4Projects Ltd., a company specialising in the development of secure collaborate software for the Construction Sector. Gerard was an original investor in 4Projects and left the company in 2006 following a takeover of the organisation by a Private equity Company.\nIn addition to Gerard&#8217;s responsibility for Zimo&#8217;s financial management, Gerard is an investor in the company. He has vast experience of forming and growing new businesses, mergers and acquisitions within the IT sector. Gerard has spent time working in North America and UK, has a degree in Economics and an MSc. in Software Engineering.</p>","image":{"available_sizes":[[[83,100],"assets/images/resized/0017/4524/174524v1-max-150x150.jpg"],[[83,100],"assets/images/resized/0017/4524/174524v1-max-250x250.jpg"],[[83,100],"assets/images/resized/0017/4524/174524v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Finance Officer","firm":{"name":"Zimo Communications","permalink":"zimo-communications","type_of_entity":"company","image":{"available_sizes":[[[144,60],"assets/images/resized/0017/4521/174521v1-max-150x150.jpg"],[[144,60],"assets/images/resized/0017/4521/174521v1-max-250x250.jpg"],[[144,60],"assets/images/resized/0017/4521/174521v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}