{"first_name":"Gerard","last_name":"Delaney","permalink":"gerard-delaney-2","crunchbase_url":"http://www.crunchbase.com/person/gerard-delaney-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"NewBay","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Sep 20 21:21:28 UTC 2011","updated_at":"Mon Oct 03 01:58:42 UTC 2011","overview":"<p>As EVP Global Field Operations Gerard is responsible for the build out of global operations.  He has 15 years global telecoms experience having lived and  worked in Japan, China, Singapore, India, Sweden and the US.  His experience ranges from managing high growth to turnarounds and includes large corporations such as Ericsson as well as the scaling of smaller companies such as DIlithium Networks.\nPrior to joining NewBay, Gerard was President of Acision North America, where he was instrumental in driving organistaional change and strategic growth in the region and building a strong customer base with Service Providers and Cable Operators. During his three year tenure at Acision Gerard also ran operations in South West Asia.\nBefore Acision, Gerard held the position of SVP Global Sales and Services at DIlithium Networks in California, where he established and grew a global team through several high growth quarters.\nPreviously, Gerard was General Manager for Mobile Wholesale at BT Wholesale in the UK. He also held several senior management positions at Ericsson in Japan, China and Sweden where he worked in the Global Services and Systems Business Units\nGerard is a graduate of University College Cork and was the recipient of a prestigious EU Scholarship to study at Naganuma Insititute/Sophia University in Japan. He is an alumni of several Executive Education Programs at the Harvard Business School.</p>","image":{"available_sizes":[[[132,150],"assets/images/resized/0015/5865/155865v2-max-150x150.jpg"],[[206,233],"assets/images/resized/0015/5865/155865v2-max-250x250.jpg"],[[206,233],"assets/images/resized/0015/5865/155865v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":" EVP Global Field Operations","firm":{"name":"NewBay","permalink":"newbay","type_of_entity":"company","image":{"available_sizes":[[[150,54],"assets/images/resized/0009/0869/90869v2-max-150x150.png"],[[250,90],"assets/images/resized/0009/0869/90869v2-max-250x250.png"],[[450,162],"assets/images/resized/0009/0869/90869v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}