{"first_name":"Gerard","last_name":"von Dohlen","permalink":"gerard-von-dohlen","crunchbase_url":"http://www.crunchbase.com/person/gerard-von-dohlen","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Apr 04 07:02:20 UTC 2012","updated_at":"Wed Apr 04 07:03:03 UTC 2012","overview":"<p>Gerard von Dohlen co-founded Broadhaven in 2009. Prior to Broadhaven, he served as Managing Director in the Investment Banking Division at Goldman, Sachs &amp; Co. where he was the Global Head of the Exchange, Brokerage and Trading sector.  His exclusive area of focus has been the financial technology sector, including financial exchanges and stock markets, securities and derivatives brokers, online brokers, electronic trading platforms and technology, market structure companies, payment processing, bank processing and emerging financial technology companies. During his career, Jerry has advised on over $45 billion in completed M&amp;A transactions and raised over $9 billion in capital for clients. He was also involved in originating, evaluating and executing strategic investment opportunities on behalf of Goldman, Sachs &amp; Co. Prior to Goldman, Sachs, Jerry was at UBS Investment Bank and Credit Suisse First Boston with similar banking and client responsibilities. Prior to his career in investment banking, Jerry was a technology consultant for Anderson Consulting (now known as Accenture) where he designed and implemented integrated information technology systems. He holds a B.S. in Industrial Engineering from Columbia University and an M.B.A. from Columbia Business School.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner and Co-Founder","firm":{"name":"Broadhaven Capital Partners","permalink":"broadhaven-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,57],"assets/images/resized/0018/2553/182553v1-max-150x150.jpg"],[[226,87],"assets/images/resized/0018/2553/182553v1-max-250x250.jpg"],[[226,87],"assets/images/resized/0018/2553/182553v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}