{"first_name":"Geronimo","last_name":"Aguilar","permalink":"geronimo-aguilar-2","crunchbase_url":"http://www.crunchbase.com/person/geronimo-aguilar-2","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jul 16 08:04:14 UTC 2012","updated_at":"Mon Jul 16 10:04:43 UTC 2012","overview":"<p>Geronimo Aguilar - A Life of Miracles </p>\n\n<p>Glancing at the first couple of decades of Pastor Geronimo Aguilar’s life, you would come to the conclusion that he would never amount to much. His life started with heartache, betrayal and sadness. Deserted by his father and led into a life of crime, Geronimo was spiraling into a life of death and destruction. However, this all changed when the very man who left him returned to save him. Since his father led Geronimo to the Lord, his life has never been the same. </p>\n\n<p>Outreach and Charity are His Vision</p>\n\n<p>There has never been a man more committed to reaching out to the underbelly of society than Geronimo. Due to his upbringing, he has a fiery passion to assist and help those that society deems “un-savable.” The following is only a sampling of the accomplishments this man has the performed for inner-city communities: </p>\n\n<p>• Youth Outreach - Geronimo understands that the future of our country lies within the hands of our children and youth. It’s with this understanding that he has organized an array of resources and programs specifically designed for inner-city and impoverished youth.</p>\n\n<p>• Love of Jesus Thriftique - Part of outreaching to the impoverished is to offer useful items at little to no cost. The Love of Jesus Thriftique offers a safe haven where the community can gather and select needed items for their daily lives.</p>\n\n<p>• Neighborhood Cleanup - Geronimo Aguilar believes that an effective way of altering people’s lives is to alter the environment they live in. It’s with this belief that he and The Richmond Outreach Center began the “Adopt-A-Block” program. This program works to clear streets and make neighborhoods aesthetically pleasing for its inhabitants.</p>\n\n<p>• Supporting U.S. Troops - Freedom is a value Geronimo cherishes. Spiritual freedom comes from the Lord while physical freedom comes from the dedication and sacrifices of the U.S. Troops. Geronimo and The ROC continually work to send care packages to our soldiers both at home and overseas.</p>\n\n<p>Works to Improve the Lives of Children</p>\n\n<p>Children do not chose to live in a world of poverty or hardship. The core belief system of Geronimo and The ROC is to actively be involved in the lives of children. This is accomplished by: </p>\n\n<p>• Annually filling 1,400 backpacks with necessary school supplies.\n• Organizing athletic and dance teams for community youth.\n• Offering youth and family counseling services.</p>\n\n<p>Although the aforementioned is only the tip of the iceberg, Geronimo Aguilar is a man who strives to empower those around him who feel powerless. Geronimo has truly led a life of miracles, and he strives to give miracles to those around him. </p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/1108/201108v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/1108/201108v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/1108/201108v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}