{"first_name":"Geronimo","last_name":"Aguilar","permalink":"geronimo-aguilar","crunchbase_url":"http://www.crunchbase.com/person/geronimo-aguilar","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri May 25 15:06:14 UTC 2012","updated_at":"Thu May 31 01:45:05 UTC 2012","overview":"<p>Pastor Geronimo Aguilar, or “Pastor G” as he is known by his friends and loved ones, is one of Richmond’s most beloved and esteemed leaders. As founder and head pastor of the Richmond Outreach Center (the ROC), Pastor G has worked tirelessly to transform the lives of thousands of people.</p>\n\n<p>The Richmond Outreach Center was founded to help assist local residents in various community outreach programs. From an early time in his life, Pastor G says he felt called by God into community service and outreach. </p>\n\n<p>What Pastor G noticed was the tribulations of inner city cultures. Many of these residents were stuck in extremely difficult living conditions due to poverty, lack of education, addiction, and multiple other factors. Additionally, they had little community support or programs to help their sons, daughters, and loved ones from continuing to suffer.</p>\n\n<p>This heartbreaking situation, directly in the heart of our own country, was Pastor G’s call to action. He founded the ROC and immediately began developing multiple programs and outreach initiatives to provide assistance directly where it was needed.</p>\n\n<p>With Pastor G’s help, the ROC began to transform communities and perspectives in Richmond. With the loving hand of God and the mission of Christ guiding him, Pastor G worked tirelessly to continue the ROC’s outreach initiatives. Currently, the ROC provides ministry, outreach services, and other community support to over 11,000 people every week.</p>\n\n<p>Of course, this impressive growth was not done by Pastor G alone! With his devoted following of administrators, community leaders, and other church professionals, the ROC continues to thrive.</p>\n\n<p>In addition to his congregation and fellow ROC leaders, Pastor G serves both God and his community alongside his wife, Samantha Aguilar. They have been blessed with five beautiful children. The Aguilars remain devoted to their calling from God. They take their mission with the utmost sincerity, and they work passionately every single day to continue enriching the lives of Richmond residents.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}