{"first_name":"Gerry","last_name":"Langeler","permalink":"gerry-langeler","crunchbase_url":"http://www.crunchbase.com/person/gerry-langeler","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 07 20:08:29 UTC 2008","updated_at":"Fri Nov 07 20:34:16 UTC 2008","overview":"<p>Gerry Langeler joined OVP Venture Partners in 1992 and focuses on investments in the semiconductor, software, imaging and digital biology sectors. His investments include 800.com, Captivate Network, Carbonflow, djangos.com, Elekom, EnerG2, Foundstone, Max-Viz, M2E Power, Now Software, Portland Software, Preview Systems, Surplus Software, TView, Unify, Vascular Solutions, Viral Logic Systems Technology (VLST), and Webridge. He currently serves on the Board of Directors of Ambric, Carbonflow, Collaborative Software Initiative, EnerG2, Max-Viz, M2E Power and Viral Logic Systems Technology (VLST) and is a Board Observer to Advanced Inquiry Systems, SafeHarbor, and Serus.</p>\n\n<p>Prior to joining OVP, Gerry was co-founder of Mentor Graphics Corporation (NASDAQ: MENT) in Portland, OR in 1981. There he served as President, and over eleven years helped lead Mentor through its IPO to over $400M in worldwide sales and over $1B in market capitalization. He began his technology career at Tektronix.</p>\n\n<p>Gerry received his AB in Chemistry from Cornell University and his MBA from Harvard University. He is the author of The Vision Trap (Harvard Business Review, 3/92). He also authored a chapter in Venture Capital Best Practices (Aspatore Books, 2005). Gerry serves on the Advisory Board of Highway 12 Ventures in Boise, Idaho.</p>\n\n<p>He is the father of two boys, and enjoys skiing (when his knees can stand it) and golf. </p>","image":{"available_sizes":[[[150,139],"assets/images/resized/0002/8047/28047v2-max-150x150.jpg"],[[250,233],"assets/images/resized/0002/8047/28047v2-max-250x250.jpg"],[[252,235],"assets/images/resized/0002/8047/28047v2-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.ovp.com/the-team/managing-directors/gerry-langeler.html\" title=\"OVP\" rel=\"nofollow\">OVP</a></p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}