{"first_name":"Gerri","last_name":"Elliott","permalink":"gerri-elliott","crunchbase_url":"http://www.crunchbase.com/person/gerri-elliott","homepage_url":"http://www.gerrielliott.com","birthplace":"New York City","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Microsoft","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Feb 22 06:00:13 UTC 2009","updated_at":"Mon Feb 23 23:41:33 UTC 2009","overview":"<p>Since 2004, as corporate vice president of Microsoft&#8217;s Worldwide Public Sector organization, Gerri Elliott led a team of more than 2000 sales and marketing professionals serving government, education and non-privatized healthcare customers in more than 100 countries. In this key leadership role, Elliott oversaw Microsoft&#8217;s work in providing innovative technology solutions and forward-thinking programs to help public sector organizations provide efficient and effective public services to their citizens and build the capacity of their populations. Under her leadership, Elliott improved customer satisfaction and Microsoft’s image among government elites, grew share across all product lines, and increased revenues from $4.7B in 2004 to $8B in 2008. Elliott was a member of the board for Microsoft Unlimited Potential, which develops new business models and technologies to help close the digital divide and bring social and economic opportunity to the estimated five billion people not yet realizing the benefits of technology. Building on a long-standing commitment to provide genuine business value to customers, Elliott also led the World Class Selling initiative across the entire company. Prior to October 2004, Elliott was co-head of Microsoft&#8217;s North American subsidiary and led the U.S. Enterprise Sales segment, which includes some of Microsoft&#8217;s largest and most strategic customers. In this role, she also developed and implemented a global strategy to establish Microsoft&#8217;s first vertical industry sales and marketing organizations, such as retail, manufacturing, healthcare, professional services and media and entertainment. Elliott joined Microsoft in September 2001 after 22-year tenure at IBM, where she held several senior executive positions in the US and internationally. She served as vice president, Distribution Sector, Asia Pacific based out of Tokyo, and subsequently was promoted to a larger role as vice president, Distribution Sector, Americas. In that capacity, she led the team responsible for IBM&#8217;s largest customers in the retail, wholesale and consumer goods, travel, and transportation industries across North and South America. During her tenure at IBM, Elliott had executive and management positions in strategy development, services and consulting, product management and sales field and headquarter leadership. \nAs a Microsoft executive, Elliott was a member of the Western Region Advisory Board of Catalyst, a global organization promoting opportunities for women in business, and the National Board of Operation Hope Inc., a nonprofit organization promoting economic empowerment in underserved communities. She also serves on the Steering Board of the World Economic Forum&#8217;s Global Education Initiative and recently served on the U.S. Commission on Higher Education appointed by the Secretary of Education. Elliott also participates in Fortune&#8217;s Most Powerful Women Conferences and their MPW Global Mentoring Program where she has served as a mentor and a judge for their inaugural award. She serves on the board of SynapticMash, a software plus services company focused on connecting educators with&amp;nbsp;the critical information needed to improve learning outcomes. Elliott holds a bachelor&#8217;s degree in international politics from New York University and currently participates in the Women&#8217;s Senior Leadership Program at the Kellogg School of Management, where she serves on their board. </p>","image":null,"degrees":[{"degree_type":"Bachelors","subject":"Political Science","institution":"New York University ","graduated_year":1980,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Corporate Vice President, Worldwide Public Sector","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Vice President, Distribution Sector, Americas","firm":{"name":"IBM","permalink":"ibm","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0002/1370/21370v1-max-150x150.png"],[[170,68],"assets/images/resized/0002/1370/21370v1-max-250x250.png"],[[170,68],"assets/images/resized/0002/1370/21370v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://postcards.blogs.fortune.cnn.com/2009/01/09/this-week-power-shifts-at-merrill-microsoft-and-beyond/","title":"Power Shifts at Microsoft"},{"external_url":"http://www.microsoft.com/presspass/exec/elliott/default.aspx","title":"Microsoft Press Pass"},{"external_url":"http://www.timeinc.net/fortune/conferences/women08/women_participants.html","title":"Fortune's Most Powerful Women's Conference"}],"web_presences":[{"external_url":"http://www.gerrielliott.com","title":"Gerri Elliott"},{"external_url":"http://www.linkedin.com/profile?viewProfile=&key=15898290&trk=tab_pro","title":"LinkedIn"}]}