{"first_name":"Giampiero","last_name":"Ambrosi","permalink":"giampiero-ambrosi-2","crunchbase_url":"http://www.crunchbase.com/person/giampiero-ambrosi-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"VirtualTourist","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jun 15 22:28:57 UTC 2012","updated_at":"Fri Jun 29 21:50:54 UTC 2012","overview":"<p>Giampiero Ambrosi is General Manager of VirtualTourist.com (VT), one of the largest user-generated travel content websites.  He has been a key part of VirtualTourist since early 2000, initially serving as Director of Content before serving as GM.  As GM, he has helped grow the community to more than 1,300,000 members and generate 1,870,000 tips and reviews, and 4,300,000 photos on over 61,000 locations. Not only can members share travel reviews, travel photos and travel advice, but they can connect with each other through its social networking platform.  </p>\n\n<p>In addition to his role as General Manager of the site, Giampiero also appears frequently on NBC&#8217;s top-rated “Today” show as a travel expert. He has appeared internationally on numerous radio programs and has been quoted countless times in various print and Internet articles including Forbes.com, Boston Herald, Financial Times, and Canada’s National Post, to name a few.</p>\n\n<p>A lifelong traveler, Giampiero spent much of his childhood shuttling between Kansas City, the Italian Alps, and Sardinia. Before joining forces with VirtualTourist, he created TravelAddict, one of the internet&#8217;s first user generated travel sites, for Digital Entertainment Network.  Prior, he was a field producer making investigative and social issue documentaries for NHK, Japan&#8217;s National Broadcaster.</p>\n\n<p>He counts as his greatest travel achievement winning the 2008 CEAT Indian AutoRickshaw Challenge from Chennai to Kanyakumari, an event dubbed “A Race for the Clinically Insane,” in which he competed against 27 other teams from around the world.  Giampiero is a magna cum laude graduate of Brown University where he was captain of the soccer team, a sport which has served as a guaranteed conversation ice breaker in taxi cabs and restaurants around the world. He currently lives in Southern California, but fondly recalls the space age design of the 1970s TWA Terminal at LaGuardia.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"General Manager","firm":{"name":"VirtualTourist","permalink":"virtualtourist","type_of_entity":"company","image":{"available_sizes":[[[141,66],"assets/images/resized/0002/1382/21382v1-max-150x150.png"],[[141,66],"assets/images/resized/0002/1382/21382v1-max-250x250.png"],[[141,66],"assets/images/resized/0002/1382/21382v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}