{"first_name":"Gian","last_name":"Caterine","permalink":"gian-caterine","crunchbase_url":"http://www.crunchbase.com/person/gian-caterine","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 03 18:34:47 UTC 2008","updated_at":"Tue Jun 03 18:38:34 UTC 2008","overview":"<p>Gian Caterine is a CPA by training, having spent the initial years of his career (1982-1989) in public accounting, principally with Coopers and Lybrand in Boston, as an audit manager, where he focused on clients in the venture capital industry. Gian then worked briefly in executive search, which led to the formation of an environmental services start-up for which he became CFO. In time, the company went went public. In 1992 Gian joined a venture-funded start-up in the signal technology business as CFO and later became the General Manager of a unit of that business which he bought in a management buyout. In 1998, Gian joined eMusic.com as Director of Business Development for the east coast and Europe, where he consummated many of eMusic&#8217;s early licensing deals, including Rykodisk, Elvis Costello and Phish. Gian spent a concurrent eighteen month of his eMusic career with NetVentures, an early-stage venture fund in Cambridge, Massachusetts, evaluating media deals before leaving in mid-2001 to focus on music publishing and independent consulting. Gian earned his Bachelor&#8217;s in Accounting from New Hampshire College in 1982.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CFO/Treasurer","firm":{"name":"TuneCore","permalink":"tunecore","type_of_entity":"company","image":{"available_sizes":[[[150,121],"assets/images/resized/0001/9897/19897v1-max-150x150.png"],[[250,202],"assets/images/resized/0001/9897/19897v1-max-250x250.png"],[[285,231],"assets/images/resized/0001/9897/19897v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}