{"first_name":"Gil","last_name":"Zapata","permalink":"gil-zapata","crunchbase_url":"http://www.crunchbase.com/person/gil-zapata","homepage_url":"http://www.lendinero.com","birthplace":"Nicaragua","twitter_username":"lendinero","blog_url":"http://www.insidemoneytoday.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1972,"born_month":11,"born_day":27,"tag_list":"entrepreneurship, lendinero, minority-business-loans, business-loans-for-women, business-loans-for-hispanics, business-loans-for-afro-america, bank-denial-loans, alternative-financing, crowd-funding, finance-your-sales","alias_list":null,"created_at":"Sun Apr 15 01:17:23 UTC 2012","updated_at":"Mon Apr 23 23:01:15 UTC 2012","overview":"<p>Gil Zapata is the co-founder and CEO of Lendinero owned by KGFA Capital Ventures LLC. Gil initiated Lendinero with the objective to assist minority small business owners resolve the business funding dilemma. He developed relationships with many of the on-line funding portals and alternative finance companies to provide multiple funding solutions.  </p>\n\n<p>Currently, he plays every hat on a day to day basis to include technological integration with his team, b2b business development relations, grassroots marketing, on-line branding, lead generation, application overviews, and is out securing capital and raising capital to scale up Lendinero. </p>\n\n<p>Gil has been in the alternative financing and financial service industry since he graduated from College. After working 1 year with a Big Firm he decided to venture off on his own and become an entrepreneur in the world of finance. As a result he has worked as a broker, investor, equity partner, consultant, and funding advisor across several industries.  </p>\n\n<p>Gil holds numerous professional designations in the financial service industry and has numerous college degrees including executive education from Harvard Business School.  Gil attended undergraduate and graduate school at Florida State University and subsequently Florida International University. </p>","image":{"available_sizes":[[[90,150],"assets/images/resized/0018/4225/184225v2-max-150x150.jpg"],[[96,160],"assets/images/resized/0018/4225/184225v2-max-250x250.jpg"],[[96,160],"assets/images/resized/0018/4225/184225v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}