{"first_name":"Ginny","last_name":"Cain","permalink":"ginny-cain","crunchbase_url":"http://www.crunchbase.com/person/ginny-cain","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Mercury Global Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 11 22:46:04 UTC 2010","updated_at":"Thu Aug 12 14:46:15 UTC 2010","overview":"<p>Ginny Cain joined Mercury Global Partners in 2009, and has a focus on online media, marketing plans, advertising and public relations support. Since 1989, Ginny has refined her management experience in all aspects of marketing using traditional media channels and Internet technologies in the Silicon Valley. Her diversified experience includes high tech PR, residential real estate services, mortgage lending, retail mortgage operations, mortgage and real estate technology and ABA/joint venture mortgage relationships. </p>\n\n<p>Prior to joining Mercury Global Partners, Ginny founded and ran her own marketing consultancy firm, Cain Communications, where she worked with a variety of clients in the technology, real estate and mortgage industries. She was VP, Marketing at Alain Pinel Realtors, the 9th largest residential brokerage firm in the US, where she managed a multi-million annual marketing budget that included print and online advertising, collateral support materials, digital print shop, emerging technology initiatives, corporate events and public relations. Previously, she was VP, Marketing for Prudential California, Texas and Nevada Realty where she managed all aspects of marketing for the company’s 140 offices and over 4,000 sales associates in three states. An early adapter of technology, Ginny spent four years with mortgage.com as their VP, Marketing during a transition from conventional brick-and-mortar operations as First Mortgage Network to the online mega-keyword, mortgage.com. </p>\n\n<p>Ginny holds a Bachelor’s Degree in Business Marketing from Cameron University in Oklahoma. </p>","image":null,"degrees":[{"degree_type":"Bachelor's degree","subject":"Business Marketing","institution":"Cameron University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Mercury Global Partners","permalink":"mercury-global-partners","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0009/7191/97191v4-max-150x150.png"],[[250,100],"assets/images/resized/0009/7191/97191v4-max-250x250.png"],[[375,150],"assets/images/resized/0009/7191/97191v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}