{"first_name":"Gino","last_name":"Coutu","permalink":"gino-coutu","crunchbase_url":"http://www.crunchbase.com/person/gino-coutu","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"BV! Media","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri May 07 14:17:15 UTC 2010","updated_at":"Wed Oct 12 00:45:26 UTC 2011","overview":"<p>Gino Coutu was Vice-President, Business Development at Rogers Digital Media until May 2011.</p>\n\n<p>Gino joined Rogers in September 2010, as part of Rogers take-over of BV! Media, where he was President and Co-CEO since 2005. Under his tenure, Gino lead BV! Media to grow yearly sales from a $1M to $17M by building the largest Canadian online fully bilingual ad network, reaching over 16 million unique visitors monthly on a network of over 500 websites in exclusive representation. BV! Media was also recently ranked in Profit-100 as one of the fastest growing company in Canada. In September 2010, BV! Media announced that it was acquired by Rogers Media for $25 Million in cash. </p>\n\n<p>Gino has also held senior executive positions at Zero-Knowledge Systems (now RadialPoint), where he led worldwide sales and business development efforts. Under his 3-year tenure, Gino formulated and was the key driving force behind RadialPoint&#8217;s new go-to-market strategy, introducing a new &#8220;service provider&#8221; distribution model for SME security solutions, which catapulted yearly sales from $200K to $15M. In the process, Gino also helped establish RadialPoint as the leading consumer security solution vendor to service providers, closing major ISP&#8217;s such as Bell Canada, Telus, Videotron, France Telecom, and Adelphia. </p>\n\n<p>Prior to RadialPoint, Gino led the Service Provider sales, support and engineering team at Cisco Systems where he grew revenue from $10M to $60M while increasing customer satisfaction, and has held other influential sales and management positions at Nortel Networks, Ungermann-Bass and 3Com. </p>\n\n<p>Gino is now enjoying a 1-year sabbatical where he&#8217;ll be traveling and improving his golf game, and will be looking at new opportunities in early 2012!</p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0015/6870/156870v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0015/6870/156870v2-max-250x250.jpg"],[[450,300],"assets/images/resized/0015/6870/156870v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President & Co-CEO","firm":{"name":"BV! Media","permalink":"bv-media","type_of_entity":"company","image":{"available_sizes":[[[150,25],"assets/images/resized/0008/6365/86365v2-max-150x150.png"],[[250,43],"assets/images/resized/0008/6365/86365v2-max-250x250.png"],[[312,54],"assets/images/resized/0008/6365/86365v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://ca.linkedin.com/in/ginocoutu","title":""}]}