{"first_name":"Girish","last_name":"S. Paranjpe","permalink":"girish-s-paranjpe","crunchbase_url":"http://www.crunchbase.com/person/girish-s-paranjpe","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Aug 07 17:47:26 UTC 2009","updated_at":"Fri Aug 07 17:48:49 UTC 2009","overview":"<p>Girish S Paranjpe is the new Jt. Chief Executive Officer of Wipro’s IT Business alongside Suresh Vaswani and is an Executive Director in the Board of Wipro Limited. He jointly carries the overall responsibility for the strategy and operations of Wipro’s IT Business. He takes over this new role effective April 2008 and will report into the Chairman of the Company Mr. Azim Premji.</p>\n\n<p>Girish’s direct responsibilities include the following Business Units - Finance Solutions, Communication, Media and Technology vertical and e-enabling service line. Girish is also directly responsible for driving Consulting and the functions under him are Global Delivery, CTO and CIO office &amp; Operations.</p>\n\n<p>Girish joined Wipro in 1990 and has held a broad range of leadership positions in critical portfolios across the Wipro Corporation during his tenure in Wipro for the last 17+ years.</p>\n\n<p>In his last role from year 2000-March 2008, he was the President of Wipro Technologies Financial Solutions division and a member of Wipro’s Corporate Executive Council. Financial Solutions division provides IT and business process services and solutions to global customers in Banking, Insurance, and Securities and in diversified Financial Services. Under Girish’s leadership, Finance Solutions has grown at 45% per annum on a compounded basis over the past five years, established valuable customer relationships and significantly deepened domain expertise within Finance Solutions. During Girish’s tenure, the share of Wipro’s revenue from Financial Services clients more than doubled going up from 12% to 25%.</p>\n\n<p>Girish also had additional responsibility and was overseeing marketing for the technology business and was heading strategic council.</p>\n\n<p>He became the head for the consulting practice from the year 2007 and this still continues to be part of his direct responsibility.</p>\n\n<p>Girish has represented Wipro and the IT Industry in various public forums including the Prime Minister’s Task Force on Information Technology and at the Nasscom.</p>","image":{"available_sizes":[[[56,61],"assets/images/resized/0005/5653/55653v1-max-150x150.jpg"],[[56,61],"assets/images/resized/0005/5653/55653v1-max-250x250.jpg"],[[56,61],"assets/images/resized/0005/5653/55653v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"Wipro Technologies","permalink":"wipro","type_of_entity":"company","image":{"available_sizes":[[[80,95],"assets/images/resized/0005/5650/55650v1-max-150x150.png"],[[80,95],"assets/images/resized/0005/5650/55650v1-max-250x250.png"],[[80,95],"assets/images/resized/0005/5650/55650v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}