{"first_name":"GIS","last_name":"Crossing","permalink":"gis-crossing","crunchbase_url":"http://www.crunchbase.com/person/gis-crossing","homepage_url":"http://www.giscrossing.com/","birthplace":"","twitter_username":"GISXing","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"gis-jobs, jobs-in-gis, gis-mapping, geology-jobs, gis-clearinghouse, geography-jobs, gis-job-clearinghouse","alias_list":null,"created_at":"Sat Apr 21 05:01:42 UTC 2012","updated_at":"Wed Apr 25 21:10:05 UTC 2012","overview":"<p>The World&#8217;s Premier Job Aggregation Service</p>\n\n<p>Job opening research, job opening reporting, technological innovation</p>\n\n<p>Headquartered in Pasadena, California, with offices throughout the world, GISCrossing locates and classifies jobs on every source it can find and provides its highly specialized research to job seekers, recruiters and other job sites throughout North America.</p>\n\n<p>GISCrossing is the world leader in &#8220;pure&#8221; monitoring and reporting of jobs, through its active and growing research into all employers throughout the world. We take no money from employers or advertisers so our research results remain &#8220;pure&#8221; and uninfluenced by others.</p>\n\n<p>GISCrossing serves consumer job seekers, recruiting firms, university career service offices, unemployment offices and outplacement firms, bringing job opening research, employer information, and more to GISCrossing&#8217;s clients.</p>\n\n<p>EmploymentCrossing has over 120 geographic and location-specific &#8220;Crossing&#8221; sites that service most professions and geographic areas in North America, Asia, the Middle East and Europe.</p>\n\n<p>EmploymentCrossing has over 300 employees. Its site LawCrossing has been on the Inc. 500 twice.</p>\n\n<p>GISCrossing is a company owned by Employment Research Institute, one of the world&#8217;s largest conglomerates of job search-related companies.</p>\n\n<p>GISCrossing has been exceptionally effective at what it does, consistently increasing the number of jobs on its site year after year, even in down economies.</p>","image":{"available_sizes":[[[144,108],"assets/images/resized/0018/5307/185307v2-max-150x150.jpg"],[[144,108],"assets/images/resized/0018/5307/185307v2-max-250x250.jpg"],[[144,108],"assets/images/resized/0018/5307/185307v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.giscrossing.com/","title":"GIS jobs"}]}