{"first_name":"Glenn","last_name":"Beck","permalink":"glenn-beck","crunchbase_url":"http://www.crunchbase.com/person/glenn-beck","homepage_url":"http://www.glennbeck.com","birthplace":"Everett, Washington","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Mercury Radio Network","born_year":1964,"born_month":2,"born_day":10,"tag_list":"glenn-beck","alias_list":null,"created_at":"Sun Jan 22 03:44:21 UTC 2012","updated_at":"Mon Jan 23 07:19:43 UTC 2012","overview":"<p>Glenn Edward Lee Beck (born February 10, 1964) is an American conservative radio host, vlogger, author, entrepreneur, political commentator and former television host. He hosts the Glenn Beck Program, a nationally syndicated talk-radio show that airs throughout the United States on Premiere Radio Networks. He formerly hosted the Glenn Beck television program, which ran from January 2006 to October 2008 on HLN and from January 2009 to June 2011 on the Fox News Channel. Beck has authored six New York Times-bestselling books.[3] Beck is the founder and CEO of Mercury Radio Arts, a multimedia production company through which he produces content for radio, television, publishing, the stage, and the Internet. It was announced on April 6, 2011, that Beck would &#8220;transition off of his daily program&#8221; on Fox News later in the year but would team with Fox to &#8220;produce a slate of projects for FOX News Channel and FOX News&#8217; digital properties&#8221;.[10] Beck&#8217;s last daily show on the network was June 30, 2011.[11]\nBeck&#8217;s supporters praise him as a constitutional stalwart defending their traditional American values,[12] while his critics contend he promotes conspiracy theories and employs incendiary rhetoric for ratings. arly years\nGlenn Edward Lee Beck was born in Everett, Washington, to William and Mary Beck, who lived in Mountlake Terrace, Washington at the time of their son&#8217;s birth.[14] The family later moved to Mount Vernon, Washington,[15] where they owned and operated City Bakery in the downtown area.[16] He is descended from German immigrants who came to the United States in the 19th century.[17] Beck was raised as a Roman Catholic and attended Immaculate Conception Catholic School in Mount Vernon.\nGlenn and his older sister moved with their mother to Sumner, Washington, attending a Jesuit school[18] in Puyallup. On May 15, 1979, while out on a small boat with a male companion, Beck&#8217;s mother drowned just west of Tacoma, Washington in Puget Sound. The man who had taken her out in the boat also drowned. A Tacoma police report stated that Mary Beck &#8220;appeared to be a classic drowning victim&#8221;, but a Coast Guard investigator speculated that she could have intentionally jumped overboard.[18] Beck has described his mother&#8217;s death as a suicide in interviews during television and radio broadcasts.[18][19]\nAfter their mother&#8217;s death, Beck and his older sister moved to their father&#8217;s home in Bellingham, Washington,[20] where Beck graduated from Sehome High School in June 1982.[21] In the aftermath of his mother&#8217;s death and subsequent suicide of his stepbrother, Beck has said he used &#8220;Dr. Jack Daniel&#8217;s&#8221; to cope. At 18, following his high school graduation, Beck relocated to Provo, Utah, and worked at radio station KAYK. Feeling he &#8220;didn&#8217;t fit in&#8221;, Beck left Utah after six months,[22] taking a job at Washington D.C.&#8217;s WPGC in February 1983.</p>\n\n<p>&#8220;You&#8217;ve never met a more flawed guy than me.&#8221;\n—  Glenn Beck</p>\n\n<p>While working at WPGC, Beck met his first wife, Claire.[24] In 1983, the couple married and had two daughters, Mary and Hannah. Mary developed cerebral palsy as a result of a series of strokes at birth in 1988.[24] The couple divorced in 1994 amid Beck&#8217;s struggles with substance abuse. A recovering alcoholic and drug addict,[25] Beck has been diagnosed with Attention Deficit Hyperactivity Disorder.[26][27]\nBy 1994, Beck was suicidal, and imagined shooting himself to the music of Kurt Cobain.[26] He credits Alcoholics Anonymous (AA) with helping him achieve sobriety. He said he stopped drinking alcohol and smoking cannabis in November 1994, the same month he attended his first AA meeting.[26] Beck later said that he had gotten high every day for the previous 15 years, since the age of 16.[20]\nIn 1996, while working for a New Haven area radio station, Beck took a theology class at Yale University, with a written recommendation from Senator Joe Lieberman, a Yale alumnus who was a fan of Beck&#8217;s show at the time.[28] Beck enrolled in an &#8220;Early Christology&#8221; course, but soon withdrew, marking the extent of his post-secondary education.[26][29]\nBeck then began a &#8220;spiritual quest&#8221; in which he &#8220;sought out answers in churches and bookstores&#8221;.[26] As he later recounted in his books and stage performances, Beck&#8217;s first attempt at self-education involved six wide-ranging authors, comprising what Beck jokingly calls &#8220;the library of a serial killer&#8221;: Alan Dershowitz, Pope John Paul II, Adolf Hitler, Billy Graham, Carl Sagan, and Friedrich Nietzsche.[26][28] During this time, Beck&#8217;s Mormon friend and former radio partner Pat Gray argued in favor of the &#8220;comprehensive worldview&#8221; offered by the Church of Jesus Christ of Latter-day Saints, an offer that Beck rejected until a few years later.[26]\nIn 1999, Beck married his second wife, Tania.[26] After they went looking for a faith on a church tour together, they [26] joined The Church of Jesus Christ of Latter-day Saints in October 1999, partly at the urging of his daughter Mary.[30][31] Beck was baptized by his old friend, and current-day co-worker Pat Gray.[26] Beck and his current wife have had two children together, Raphe (who is adopted) and Cheyenne. Until April 2011, the couple live in New Canaan, Connecticut, with the four children.[32][33]\nBeck announced in July 2010 that he had been diagnosed with macular dystrophy, saying &#8220;A couple of weeks ago I went to the doctor because of my eyes, I can&#8217;t focus my eyes. He did all kinds of tests and he said, &#8216;you have macular dystrophy &#8230; you could go blind in the next year. Or, you might not.&#8217;&#8221; The disorder can make it difficult to read, drive or recognize faces.[34]\nIn July 2011, Beck leased a house in the Dallas–Fort Worth suburb of Westlake, Texas. n 2002 Beck created the media platform Mercury Radio Arts as the umbrella over various broadcast, publishing, Internet, and live show entities.\nRadio\nSee also: Glenn Beck Program\nIn 1983 he moved to Corpus Christi, Texas, to work at radio station KZFM. In mid-1985, Beck was hired away from KZFM to be the lead DJ for the morning-drive radio broadcast by WRKA in Louisville, Kentucky.[24] His four-hour weekday show was called Captain Beck and the A-Team.[37] Beck had a reputation as a &#8220;young up-and-comer&#8221;. The show was not political and included the usual off-color antics of the genre: juvenile jokes, pranks, and impersonations.[28] The show slipped to third in the market and Beck left abruptly in 1987 amid a dispute with WRKA management.[citation needed]\nMonths later, Beck was hired by Phoenix Top-40 station KOY-FM, then known as Y-95. Beck was partnered with Arizona native Tim Hattrick to co-host a local &#8220;morning zoo&#8221; program.[26] During his time at Y-95, Beck cultivated a rivalry with local pop radio station KZZP and that station&#8217;s morning host Bruce Kelly. Through practical jokes and publicity stunts, Beck drew criticism from the staff at Y-95 when the rivalry culminated in Beck telephoning Kelly&#8217;s wife on-the-air, mocking her recent miscarriage.[24] In 1989, Beck resigned from Y-95 to accept a job in Houston at KRBE, known as Power 104. Beck was subsequently fired in 1990 due to poor ratings.</p>\n\n<p>Beck then moved on to Baltimore, Maryland and the city&#8217;s leading Top-40 station, WBSB, known as B104. There, he partnered with Pat Gray, a morning DJ. During his tenure at B104, Beck was arrested and jailed for speeding in his DeLorean.[26] According to a former associate, Beck was &#8220;completely out of it&#8221; when a station manager went to bail him out.[26] When Gray, then Beck were fired, the two men spent six months in Baltimore, planning their next move. In early 1992, Beck and Gray both moved to WKCI-FM (KC101), a Top-40 radio station in Hamden, Connecticut.[26] In 1995, WKCI apologized after Beck and Gray mocked a Chinese-American caller on air who felt offended by a comedy segment by playing a gong sound effect and having executive producer Alf Gagineau mock a Chinese accent. That incident led to protests by activist groups.[38] When Gray left the show to move to Salt Lake City, Beck continued with co-host Vinnie Penn. At the end of 1998, Beck was informed that his contract would not be renewed at the end of 1999.</p>\n\n<p>The Glenn Beck Program first aired in 2000 on WFLA (AM) in Tampa, Florida, and took their afternoon time slot from eighteenth to first place within a year.[39][40] In January 2002, Premiere Radio Networks launched the show nationwide on 47 stations. The show then moved to Philadelphia, Pennsylvania, broadcasting from new flagship station WPHT. On November 5, 2007, The New York Times reported that Premiere Radio Networks was extending Beck&#8217;s contract. By May 2008, it had reached over 280 terrestrial stations as well as XM Satellite. It was ranked 4th in the nation with over six and a half million listeners.[41] Glenn Beck is number three in the ratings behind Rush Limbaugh and Sean Hannity.</p>\n\n<pre><code>                              Television\n</code></pre>\n\n<p>In January 2006, CNN&#8217;s Headline News announced that Beck would host a nightly news-commentary show in their new prime-time block Headline Prime. The show, simply called Glenn Beck, aired weeknights. CNN Headline News described the show as &#8220;an unconventional look at the news of the day featuring his often amusing perspective&#8221;.[43] At the end of his tenure at CNN-HLN, Beck had the second largest audience behind Nancy Grace.[44] In 2008, Beck won the Marconi Radio Award for Network Syndicated Personality of the Year.</p>\n\n<p>In October 2008, it was announced that Beck would join the Fox News Channel, leaving CNN Headline News.[46] After moving to the Fox News Channel, Beck hosted Glenn Beck, beginning in January 2009, as well as a weekend version.[47] One of his first guests was Alaska Governor Sarah Palin [48] He also has a regular segment every Friday on the Fox News Channel program The O&#8217;Reilly Factor titled &#8220;At Your Beck and Call&#8221;.[49] As of September 2009 Beck&#8217;s program drew more viewers than all three of the competing time-slot shows combined on CNN, MSNBC and HLN.[50][51]\nHis show&#8217;s high ratings have not come without controversy.[46] The Washington Post&#8217;s Howard Kurtz reported that Beck&#8217;s use of &#8220;distorted or inflammatory rhetoric&#8221; has complicated the channel&#8217;s and their journalist&#8217;s efforts to neutralize White House criticism that Fox is not really a news organization.[46] Television analyst Andrew Tyndall echoed these sentiments, saying that Beck&#8217;s incendiary style had created &#8220;a real crossroads for Fox News&#8221;, stating &#8220;they&#8217;re right on the cusp of losing their image as a news organization.&#8221;[46]\nIn April 2011, Fox News and Mercury Radio Arts, Beck&#8217;s production company, announced that Beck would &#8220;transition off of his daily program&#8221; on Fox News in 2011.[52] His last day at Fox was later announced as June 30.[53][54] FNC and Beck announced that he would be teaming with Fox to produce a slate of projects for Fox News and its digital properties.[10] Fox News head Roger Ailes later referenced Beck&#8217;s entrepreneurialism and political movement activism, saying, &#8220;His [Beck&#8217;s] goals were different from our goals &#8230; I need people focused on a daily television show.&#8221;[55] Beck hosted his last daily show on Fox on June 30, 2011, where he recounted the accomplishments of the show and said, &#8220;This show has become a movement. It&#8217;s not a TV show, and that&#8217;s why it doesn’t belong on television anymore. It belongs in your homes. It belongs in your neighborhoods.&#8221;[11] In response to critics who said he was fired, Beck pointed out that his final show was airing live.[11] Immediately after the show he did an interview on his new GBTV internet channel.</p>\n\n<pre><code>                               GBTV\n</code></pre>\n\n<p>Glenn Beck&#8217;s Fox News one-hour show ended June 30, 2011,[56] and a new two-hour show began streaming his subscription-based internet TV network, GBTV, on September 12, 2011.[57][58]\nBooks\n&#8220;You cannot take away freedom to protect it, you cannot destroy the free market to save it, and you cannot uphold freedom of speech by silencing those with whom you disagree. To take rights away to defend them or to spend your way out of debt defies common sense.&#8221;\n— Glenn Beck, Common Sense, 2009[59]\nBeck has reached #1 on the New York Times Bestseller List in four separate categories as of 2010: Hardcover Non-Fiction,[60][61] Paperback Non-Fiction,[60] Hardcover Fiction,[62] and Children&#8217;s Picture Books.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President/CEO","firm":{"name":"Mercury Radio Network","permalink":"mercury-radio-network","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.glennbeck.com","title":"Glenn Beck"},{"external_url":"http://www.gbtv.com","title":"GBTV"},{"external_url":"http://www.mercuryradioarts.com","title":"Mercury Radio Arts"},{"external_url":"http://www.mercuryink.com","title":"Mercury INK"},{"external_url":"http://www.mercuryone.org","title":"Mercury One"},{"external_url":"http://www.theblaze.com","title":"The Blaze"},{"external_url":"http://www.1791.com","title":"1791 Clothing"},{"external_url":"http://www.premiereradio.com/shows/view/glenn_beck.html","title":"Premiere Radio Page"}]}