{"first_name":"Glenn","last_name":"Morten","permalink":"glenn-morten","crunchbase_url":"http://www.crunchbase.com/person/glenn-morten","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Widevine","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 02 23:27:57 UTC 2009","updated_at":"Sat Jun 13 16:22:10 UTC 2009","overview":"<p>Glenn Morten brings to Widevine more than twenty-four years of experience in product development leadership roles. At Widevine, Glenn has led content protection and digital forensics innovations from initial product release through multiple generations. Glenn is the primary driver behind Widevine&#8217;s vision and strategy. Morten serves on the Board of Directors of the Alliance for Telecommunications Industry Solutions (ATIS). Under his direction Widevine won the 2006 and 2007 Cable &amp; Satellite International Product of the Year Award for Best Content Protection. Prior to joining Widevine he was Vice President of Development for CyberSafe Corporation where he developed e-security.</p>\n\n<p>Previously, Morten was Director of Development at Spacelabs Medical specializing in wireless, internet and connectivity. Morten held various leadership roles for Abbott Laboratories and Texas Instruments and served as an officer in the US Army. He holds a Bachelor of Science in computer science from West Virginia University and a Master of Science in systems management from the University of Southern California. Morten holds numerous issued patents for next generation DRM and Session Based Watermarking. He is an inventor of several granted patents.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CTO","firm":{"name":"Widevine Technologies","permalink":"widevine","type_of_entity":"company","image":{"available_sizes":[[[141,60],"assets/images/resized/0004/6403/46403v2-max-150x150.png"],[[141,60],"assets/images/resized/0004/6403/46403v2-max-250x250.png"],[[141,60],"assets/images/resized/0004/6403/46403v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}