{"first_name":"Glenn","last_name":"T. Rieger","permalink":"glenn-t-rieger","crunchbase_url":"http://www.crunchbase.com/person/glenn-t-rieger","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Nov 26 14:01:06 UTC 2008","updated_at":"Wed Nov 26 14:12:54 UTC 2008","overview":"<p>Mr. Rieger is a General Partner of NewSpring Ventures and a Partner of NewSpring Capital. Prior to joining NewSpring in 2004, he was a co-founder and managing director of Cross Atlantic Capital Partners, inc., the management company that oversees the operations of three venture funds with over $350 million in assets under management. He oversaw the operations of Cross Atlantic’s U.S. activities out of its Radnor, PA office and worked closely with several portfolio companies, including: Ecount, Gain Capital, and Management Dynamics. Prior to Cross Atlantic, he was a Senior Vice President for Safeguard Scientifics (NYSE:SFE) in charge of business development. In this position, he developed and oversaw merger, acquisition, investment and exit opportunities for Safeguard. In addition, he served as a business partner and director for five of Safeguard&#8217;s partnership companies. Prior to joining Safeguard, he was a managing director of a boutique investment banking firm specializing in mergers and acquisitions, and President and Chief Executive Officer of a $1 billion California savings bank that employed over 250 people. He sits on the Board of Directors of NitroSecurity, Profit Point and Smart Destinations. He is active in the local venture capital community and for the 2004 program year chaired the Greater Philadelphia Venture Group, a trade association representing more than 80 venture funds representing approximately $12 billion in assets under management. He is a graduate of Colby College and has an MBA from The Wharton School of the University of Pennsylvania. Email: GRieger@NewSpringCapital.com</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0002/9664/29664v1-max-150x150.jpg"],[[120,180],"assets/images/resized/0002/9664/29664v1-max-250x250.jpg"],[[120,180],"assets/images/resized/0002/9664/29664v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"NewSpring Ventures","permalink":"newspring-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[106,59],"assets/images/resized/0002/9660/29660v1-max-150x150.jpg"],[[106,59],"assets/images/resized/0002/9660/29660v1-max-250x250.jpg"],[[106,59],"assets/images/resized/0002/9660/29660v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}