{"first_name":"Glen","last_name":"Mella","permalink":"glen-mella","crunchbase_url":"http://www.crunchbase.com/person/glen-mella","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 07 17:18:25 UTC 2008","updated_at":"Wed May 07 17:19:36 UTC 2008","overview":"<p>Glen Mella currently serves as president and chief operating officer of Control4, overseeing the company&#8217;s internal operations. Glen brings more than 20 years of industry management experience to the company. He has held senior-level management positions within large, publicly-traded software and consumer product companies, as well as early-stage technology ventures. Prior to joining Control4, Glen served as sr. vice president of marketing and sales for Triton PCS, an award-winning wireless carrier providing service in the Southeast.</p>\n\n<p>Glen also served as division president for CRS Retail Systems, a leading provider of point-of-sale (POS) and multi-channel software to the retail industry. Prior to this position, Glen was President and CEO of Found, Inc., a software solution provider for the integrated retail enterprise that was eventually acquired by CRS. Glen has also held executive and management positions at TenFold, Novell, WordPerfect, Dial Corporation, and Frito-Lay/PepsiCo.</p>\n\n<p>Glen holds an MBA from Northwestern University and a bachelors degree from Brigham Young University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President & COO","firm":{"name":"Control4","permalink":"control4","type_of_entity":"company","image":{"available_sizes":[[[150,29],"assets/images/resized/0001/8092/18092v1-max-150x150.png"],[[250,49],"assets/images/resized/0001/8092/18092v1-max-250x250.png"],[[251,50],"assets/images/resized/0001/8092/18092v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}