{"first_name":"Go","last_name":"Avm","permalink":"go-avm","crunchbase_url":"http://www.crunchbase.com/person/go-avm","homepage_url":"http://www.goavm.com/","birthplace":"","twitter_username":"goavm","blog_url":"http://goavm.blogspot.com/","blog_feed_url":"http://goavm.blogspot.com/feeds/posts/default","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"hospitality-supplies, hospitality-amenities-suppliers, janitorial-products, janitorial-equipment-supplies, amenities-suppliers, amenities-products, hotel-amenities-suppliers, amenities--personal-care-products, appliances--electronics-items, bedding--linen","alias_list":null,"created_at":"Tue Nov 08 12:00:52 UTC 2011","updated_at":"Wed Nov 30 00:34:39 UTC 2011","overview":"<p>AVM Enterprises, Inc. is a hospitality goods supplies and janitorial cleaning products company located just outside of scenic Chattanooga, Tennessee. AVM has been providing wholesale janitorial supplies and hospitality products to hotels, motels, businesses, and restaurants for nearly thirty years. AVM Enterprises, Inc. was founded in 1982 by Mr. A.V. Daniel and is owned and operated by the Daniel family to this day.  As a company, AVM Enterprises, Inc. is committed to honesty and integrity in its business practices, to excellence in customer service, and to providing customers with quality products at low prices. It is based on providing your businesses with products you need to make a great experience for your guests and we are dedicated to the principals of honesty, integrity, customer relationships, quality products, service and value.</p>\n\n<p>AVM Enterprises, Inc. carries over 2000 products to ensure we will be able to provide for our customers varied needs. These products include hotel necessities such as breakfast area supplies, amenities &amp; personal care products, lobby &amp; guest room supplies, shower curtains accessories, food &amp; beverage disposable products, bedding and linen items, as well as appliances &amp; electronics items.  Our appliances range from toasters, irons, and coffee makers to refrigerators, microwaves, and A/C units.</p>\n\n<p>Our Janitorial and cleaning supplies include maids’ carts, laundry trucks, mop buckets, mops, brooms, indoor and outdoor waste containers, bathroom cleaners &amp; supplies, vacuum cleaners, rubber gloves, paper towels, hand soaps &amp; sanitizers, dishsoap &amp; dishwasher detergent, trash can liners, as well as commercial cleaners, air fresheners &amp; deodorizers, laundry chemicals, and miscellaneous cleaning supplies.</p>\n\n<p>AVM is an approved supplier for Choice Hotels International, Wyndham Worldwide, Best Western, Vantage Hospitality Group, Americas Best Franchising, Budget Host Inn, and Franchisee owned Marriott Properties, Holiday Inn Express, Hospitality International, and Carlson.</p>\n\n<p>AVM Enterprises, Inc. also sends delivery trucks to various parts of the country so that many customers do not even need to pay freight and freight discounts are available for customers not on an AVM truck delivery route.  AVM Enterprises, Inc. would love to become your single source for wholesale Hospitality and Janitorial supplies.</p>\n\n<p>We are leader in hospitality goods, janitorial items, hotels and motels products also one of the main-line distributors &amp; supplier of products for forty different brands. We aggressively seek innovative and quality products at great prices for the franchisees. We provide hospitality items, janitorial equipments and amenity products at great prices for the franchisees. AVM is always listening to the needs of the franchisees and actively works to meet those needs.</p>","image":{"available_sizes":[[[150,49],"assets/images/resized/0016/1345/161345v2-max-150x150.jpg"],[[229,75],"assets/images/resized/0016/1345/161345v2-max-250x250.jpg"],[[229,75],"assets/images/resized/0016/1345/161345v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}