{"first_name":"Gonzalo","last_name":"Rosado","permalink":"gonzalo-rosado","crunchbase_url":"http://www.crunchbase.com/person/gonzalo-rosado","homepage_url":"","birthplace":"Buenos Aires, Argentina","twitter_username":"gonzobaires","blog_url":"http://gonzobaires.com.ar","blog_feed_url":"http://feeds.feedburner.com/GonzaloBairesBlog","affiliation_name":"Unaffiliated","born_year":1984,"born_month":7,"born_day":5,"tag_list":"advertising","alias_list":null,"created_at":"Sat May 08 05:19:39 UTC 2010","updated_at":"Mon May 10 15:50:00 UTC 2010","overview":"<p>After the +3years in Yahoo!, Gonzalo Rosado is now working on Social media strategies for Turner Latin America.</p>\n\n<p>Gonzalo has depth knowledge and experience in defining the overall product vision and strategy, writing specifications and building concept documents, prioritizing Search &amp; Community related features, building consensus and coordinating product schedules within a team of world-class engineers; working with search management tools and systems such as Yahoo! Web Analytics, general HTML and websites editing tools, leading cross-functional teams and developing business cases based on metrics goals.</p>\n\n<p>From 2007 to 2009, he has worked in several projects related to Yahoo! Search, managing the full lifecycle of product line from market requirements to product release including: concept, scope, specifications, prioritization, design, implementation, deployment and maintenance, including launches of new search algorithms versions, improving the relevance and quality of Yahoo!’s Search results. During this period, he has led cross-functional cross-market teams in a dynamic environment, including engineers, marketing, customer service and partners to plan and launch projects on time. Also as Toolbar Product Manager, he has coordinated feature upgrades; supported the Yahoo! headquarters team with localization issues and scheduling release dates for the product; gained useful insight and experience in understanding toolbar space, constraints as well as opportunities; worked with several teams including engineering, business, marketing, UED, sales and legal through each step of development and evolution of new and existing products; tracked metrics and found solutions for improving products and worked closely with Business Development helping them to strategize new customized solutions for advertisers. Back to 2006, he acted as a Community Manager during the launch of Yahoo! Answers in LatAm. During this period, he worked with marketing, customer service and engineering to set up the product and handle localization and editorial content see</p>","image":{"available_sizes":[[[150,109],"assets/images/resized/0008/6441/86441v2-max-150x150.jpg"],[[250,182],"assets/images/resized/0008/6441/86441v2-max-250x250.jpg"],[[450,327],"assets/images/resized/0008/6441/86441v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}