{"first_name":"gopalgi","last_name":"goel","permalink":"gopalgi-goel","crunchbase_url":"http://www.crunchbase.com/person/gopalgi-goel","homepage_url":"http://www.piyushdadriwalamaths.co.in","birthplace":"dadri","twitter_username":"piyushdadriwala","blog_url":"http://www.whaaorku.blogspot.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1967,"born_month":2,"born_day":10,"tag_list":"creative","alias_list":null,"created_at":"Sat Dec 18 12:34:15 UTC 2010","updated_at":"Sat Dec 18 21:26:06 UTC 2010","overview":"<p>Piyush Goel: &#8216;Mirror Image Man&#8217; with multiple talents</p>\n\n<p>Young Piyush Goel has a rare feat to his credit. He has written the world&#8217;s first Shrimad Bhagwad Geeta in mirror image. Piyush says, &#8220;It is the first Bhagwad granth in the world written in mirror image. I wrote the epic in my own hand writing in two languages,  Hindi and English. One can read all the 18 chapters and 700 verses in front of a mirror.&#8221; \nThe feat certainly shows the will power of a man who put everything readable in front of a mirror. He says, &#8220;Since my childhood I had a strong desire to copy everything in front of a mirror. Though I was not sure to achieve this uncommon art, yet I did it.&#8221; He recalled how an accident had changed his life. I met with a serious accident in year 2000 and remained in bed for a long time. At that time I had developed this art, he reveals. A resident of Kaushambi, Piyush is now known as &#8216;Mirror Image Man&#8217; and recently he was honoured with Holder Republic Award for this novel achievement.</p>\n\n<p>ABOUT PIYUSH\nHe is a mechanical engineer working in a private firm of Greater Noida, Dadri. Collecting unusual things is also his passion. He says, &#8220;I came in contact with a bank employee in the year 1982. He was a stamp collector. I was very fascinated by this habit and I  started collecting various stamps and currencies of different countries.&#8221; Later I started collecting match boxes, cigarette packets, pens, coins, currencies and autographs of celebrities, he adds. He has rare collection of autographs of great people like Indira Gandhi, Rajiv Gandhi, Sachin Tendulkar, Amitabh Bachan including several national and international personalities. About this particular habit he says, &#8220;I love to meet celebrities  and collect their signatures.  Though it is time consuming, for me it is like getting inspiration. \nPresently, he has a rich collection of  various items. &#8220;Initially my family members used to get  irritated by my habit  since it is difficult to keep everything in a house. After seeing my craze and social recognition now my kids also  help in preserving  my collections&#8221;. </p>\n\n<p>BODY OF WORK\nApart from Shrimad Bhagwad Geeta he has written Shree Durga Sapt Satti in Sanskrit language, Sunderkand, Arti Sangrah and Shree Sai Sachcharitra (all 51 chapters, 308 pages, more than one lakh words). \nHe has  written a book on Mathematics, which is a juggle for most of mathematicians. He informs, &#8220;I am very  fond of Mathematics, I have done a lot of work on Mathematics, like Points Design of Pyramid and Equations, work on Pascal Triangle, A new triangle &#8216;AP Right Angled Triangle&#8217; in which I have introduced a new strange Table and formula for two digits and Number Nine.&#8221; It is very interesting way to understand the complications of Mathematics. The book is going to be published in the future,&#8221; he adds.</p>\n\n<p>FUTURE PLANS\nSince his hand-written Bhagwad Geeta is to be adopted by Krishna museum of Kurukshetra University, he is feeling proud of the achievement. He accepts, &#8220;It is a fact that no one is going to read this holy book in front of a mirror but I have great satisfaction by writing an image of those great holy words and compiling them into a complete granth. I will continue with this writing and in the future write more holy books&#8221;. \n&#8220;People often ask me what would I do with these strange collections. I simply prove my point by organizing several exhibitions in various schools of Ghaziabad and Noida. My works and collections are informative for students and I have received so many invitations from schools and museums. So far as awards are concerned I never do anything  for the sake of any awards or remuneration. Though I have various recognitions and awards I don&#8217;t like to mention them since I have a noble mission to preserve things for the future generation,&#8221; he concludes. </p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0011/4554/114554v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0011/4554/114554v2-max-250x250.jpg"],[[275,183],"assets/images/resized/0011/4554/114554v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}