{"first_name":"Gordon","last_name":"Borrell","permalink":"gordon-borrell-2","crunchbase_url":"http://www.crunchbase.com/person/gordon-borrell-2","homepage_url":"http://www.borrellassociates.com","birthplace":"Philadelphia","twitter_username":"goborrell","blog_url":"http://www.borrellassociates.com/wordpress","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1957,"born_month":4,"born_day":21,"tag_list":"","alias_list":null,"created_at":"Fri Sep 07 13:20:57 UTC 2012","updated_at":"Sun Sep 09 19:46:08 UTC 2012","overview":"<p>Gordon Borrell is a local media analyst who is ranked in the top 2% among Gerson Lehrman Group’s 150,000 consultants worldwide. He is the CEO of the Virginia-based advertising research firm Borrell Associates Inc. and is quoted frequently in The Wall Street Journal, The New York Times, Ad Age, Forbes and other publications. He has appeared on CNN and other TV and radio programs discussing trends and forecasts for local media. Prior to starting Borrell Associates in 2001, Gordon was vice president for new media for Landmark Communications, where he worked for 22 years. He started his career as a reporter and editor for The Virginian-Pilot in Norfolk, Virginia. In 1989 he began pioneering interactive ventures and helped establish the first TV, newspaper, cable and network TV websites. Mr. Borrell conceptualized and helped create InfiNet, an Internet access and hosting company later split up and sold to Earthlink and to Gannett Co. He is a member of the executive board of the Local Media Association and is past president of the Newspaper Association of America’s New Media Federation. He is married, has five children, and lives in Portsmouth, Virginia, where he has been active on boards and organizations supporting public education and community sports.</p>","image":{"available_sizes":[[[97,150],"assets/images/resized/0021/0286/210286v2-max-150x150.jpg"],[[163,250],"assets/images/resized/0021/0286/210286v2-max-250x250.jpg"],[[282,432],"assets/images/resized/0021/0286/210286v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}