{"first_name":"Gordon","last_name":"Rubenstein","permalink":"gordon-rubenstein","crunchbase_url":"http://www.crunchbase.com/person/gordon-rubenstein","homepage_url":"http://www.linkedin.com/pub/gordon-rubenstein/0/39/899","birthplace":"Chicago","twitter_username":"GSRubenstein","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Dec 10 17:58:04 UTC 2011","updated_at":"Sat Jul 28 07:49:01 UTC 2012","overview":"<p>Gordon is a Co-Founder and Managing Director of Pacific Partners, an operationally focused investment firm backed by George Soros, Sam Zell, leading technology executives and entrepreneurs as well as partners from KKR, Silver Lake, and Freeman Spogli. He is a Co-Founder of Rave Digital Media, Astro Gaming where he served as Chairman, and Standard Renewable Energy Group. Gordon serves on the Board of Directors of Rave Digital Media, a digital content company, and Standard Renewable Energy Group. In addition, he served as a Senior Advisor to eHarmony and is an investor in Machinima, Movieclips, Prism Skylabs, VivaReal, Nexsteppe, Grovo, Oweing.com, Retail Union and SkinnyScoop.</p>\n\n<p>Gordon has participated at the board level and has been actively involved with Audience Science, BigMachines, Convio (CNVO)), and Astro Gaming (acquired by Skullcandy). </p>\n\n<p>Prior to co-founding Pacific Partners, Gordon was an Equity Partner and a member of the Investment Committee of the Optimum Investment Group (&#8220;OIG&#8221;), a Chicago private investment partnership, which during his tenure managed $2 billion in and invested in both private and public companies. Being particularly focused on software and emerging media/internet models, Gordon co-led the firm’s investment and participated at the board level of Ultimate Software (NASDAQ: ULTI) where he was influential in positioning the company as one of the first software as a service providers.</p>\n\n<p>Gordon began his investment career at Wells Fargo Securities, a division of Wells Fargo Bank, where he worked for the CEO of Wells Fargo Securities. </p>\n\n<p>He received an A.B. from the University of Michigan and was awarded the Office of the Vice-President’s Leadership Award.</p>\n\n<p>He is a frequent industry speaker, and has lectured at the Wharton School of Business and The Kellogg School of Management. Also, Gordon was a contributing author of “Doing Deals in the Software Industry: Top Executives on Partnerships, Financings, M&amp;A and More”.</p>","image":null,"degrees":[],"relationships":[],"investments":[{"funding_round":{"round_code":"a","source_url":"http://techcrunch.com/2012/02/17/real-estate-site-vivareal-raises-cash-to-be-the-zillow-for-brazil/","source_description":"Real Estate Site VivaReal Raises Cash To Be The Zillow For Brazil","raised_amount":null,"raised_currency_code":"USD","funded_year":2012,"funded_month":1,"funded_day":17,"company":{"name":"VivaReal","permalink":"vivareal","image":{"available_sizes":[[[150,150],"assets/images/resized/0014/6752/146752v2-max-150x150.png"],[[180,180],"assets/images/resized/0014/6752/146752v2-max-250x250.png"],[[180,180],"assets/images/resized/0014/6752/146752v2-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}