{"first_name":"Govind","last_name":"Kizhepat","permalink":"govind-kizhepat","crunchbase_url":"http://www.crunchbase.com/person/govind-kizhepat","homepage_url":"","birthplace":"India","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Jul 07 16:25:18 UTC 2012","updated_at":"Mon Jul 09 17:38:02 UTC 2012","overview":"<p>Mr. Govind Kizhepat founded VueMix in May 2010 and currently serves as the CEO.</p>\n\n<p>Previously, Mr. Kizhepat served as Vice President of Business Development at Qlogic Corp. Mr. Kizhepat founded Netxen, Inc. in 2002 and served as its Chief Executive Officer until 2009. Mr. Kizhepat served as entrepreneur in residence (EIR) at the venture capital firm, Benchmark Capital. He served as Vice President of Engineering at iCompression until 2000. Prior to joining Benchmark, he was Executive Vice President of Globespan (CNXT), a leading worldwide provider of integrated circuits (chip sets), software, and system designs for broadband solutions. At Globespan, he headed the Media Gateway Division where he was responsible for video and audio codecs as well as voice over packet products. In 1996, he founded iCompression, and served as its founding Chief Executive Officer until 1998 and as its Chairman until 2000. Before founding iCompression, he held various technical leadership and management positions at S3, and Sun Microsystems where he played key roles in the development of SuperSPARC and UltraSPARC processors. He has been a Director of Magma Design Automation Inc. since February 2010. He served as Director of NetXen, Inc. He holds a BSEE from Delhi University, and an MSEE from Wayne State University.</p>","image":{"available_sizes":[[[100,130],"assets/images/resized/0019/9514/199514v2-max-150x150.jpg"],[[100,130],"assets/images/resized/0019/9514/199514v2-max-250x250.jpg"],[[100,130],"assets/images/resized/0019/9514/199514v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BS","subject":"EE","institution":"Delhi University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MS","subject":"EE","institution":"Wayne State","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}