{"first_name":"Greg","last_name":"Brenneman","permalink":"greg-brenneman","crunchbase_url":"http://www.crunchbase.com/person/greg-brenneman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Nov 29 19:26:46 UTC 2008","updated_at":"Sat Nov 29 19:27:45 UTC 2008","overview":"<p>Greg Brenneman is Chairman of CCMP Capital and a member of the firm’s Investment Committee. Mr. Brenneman plays an active leadership role in executing the firm’s overall strategy while remaining actively engaged in completing transactions, developing strategies and coaching the senior management of CCMP’s portfolio companies.</p>\n\n<p>Mr. Brenneman most recently served as Chief Executive Officer and President of Quiznos, one of the nation&#8217;s fastest-growing quick service restaurant chains and pioneer of the toasted sandwich, where he was responsible for running the company and for leading Quiznos’ next-level growth strategies for the brand. He is currently serving as Executive Chairman of Quiznos. Prior to Quiznos, Mr. Brenneman was Chairman and CEO of Burger King Corporation. During Mr. Brenneman&#8217;s tenure he, along with a team of talented executives, led the turnaround of Burger King Corporation where he oversaw a nearly tripling of average profits per restaurant with a wide array of lucrative new products, award-winning advertising and dramatically improving customer service. Prior to Burger King, Mr. Brenneman was named President and CEO of PwC Consulting in June 2002, where he restructured the business which led to a strategic sale to industry leader IBM, for over $3.5 billion, nearly double the anticipated IPO value and resulting in the creation of the largest IT services business in the world at that time. Mr. Brenneman joined Continental Airlines in 1995 as President, COO and a member of their Board of Directors. Mr. Brenneman helped lead the airline’s 53,000 employees as they completed one of the most dramatic turnarounds in American business history.</p>\n\n<p>In 1994 Mr. Brenneman founded Turnworks, Inc., his personal investment firm that focuses on corporate turnarounds. Prior to founding Turnworks, Mr. Brenneman was a Vice President for Bain and Company. Mr. Brenneman holds a Masters of Business Administration degree with distinction from Harvard Business School and a Bachelors Administration of Business in Accounting/Finance, summa cum laude from Washburn University of Topeka, Kansas. He was awarded an honorary Doctor of Commerce degree from Washburn University. Mr. Brenneman serves on the Board of Directors of The Home Depot, Inc. and Automatic Data Processing, Inc. (ADP).</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chairman, Houston","firm":{"name":"Chase Capital Partners","permalink":"chase-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[138,27],"assets/images/resized/0003/0174/30174v1-max-150x150.jpg"],[[138,27],"assets/images/resized/0003/0174/30174v1-max-250x250.jpg"],[[138,27],"assets/images/resized/0003/0174/30174v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}