{"first_name":"Gregory","last_name":"Kim","permalink":"gregory-kim","crunchbase_url":"http://www.crunchbase.com/person/gregory-kim","homepage_url":"http://www.savings.com","birthplace":"New Jersey","twitter_username":"gmoney75","blog_url":"http://www.linkedin.com/in/gregorykim","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1975,"born_month":5,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 13 03:46:28 UTC 2010","updated_at":"Mon Dec 12 22:01:34 UTC 2011","overview":"<p>Gregory C. Kim serves as Chief Strategy Officer and Chief Marketing Officer at Savings.com, a rapidly growing aggregator of the best deals and coupons on the web. Prior to Savings.com, Mr. Kim served as Senior Vice President, Strategy &amp; Corporate Development at People Media where he built out the team, infrastructure, website and roadmap to build a global leader in niche dating. People Media was sold to Match.com/InterActiveCorp for $80 million in cash in July 2009. Prior to People Media, Mr. Kim was Senior Director of Strategy &amp; Corporate Development at LowerMyBills.com and helped the company become a category killer in comparison shopping for services and a lead generation platform in home loans, education and insurance. During Mr. Kim&#8217;s tenure, LowerMyBills.com grew from $10 million to $250 million in revenues in 3 years and the company was sold to Experian for $330 million plus earn-out. Prior to LowerMyBills.com, Mr. Kim was an investment banker with Houlihan Lokey Howard &amp; Zukin where he worked on engagements across all product and industry groups and clients from startups to Fortune 500 companies.</p>\n\n<p>Mr. Kim earned his M.B.A. in Entrepreneurial Studies and Finance from the The Anderson School at UCLA, and graduated from The Wharton School at the University of Pennsylvania with a B.S. in Economics.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}