{"first_name":"Greg","last_name":"Coticchia","permalink":"greg-coticchia","crunchbase_url":"http://www.crunchbase.com/person/greg-coticchia","homepage_url":"http://www.entrainc.com","birthplace":"Pittsburgh","twitter_username":"GregCott","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1960,"born_month":10,"born_day":20,"tag_list":"","alias_list":null,"created_at":"Thu Sep 22 21:05:16 UTC 2011","updated_at":"Wed Nov 16 21:47:44 UTC 2011","overview":"<p>Greg Coticchia is an award-winning technology executive with over twenty-five years experience in high tech products and services. He is considered by many to be one of the best strategic minds and marketing executives in the technology business. He has lead or been a major contributor in two of the largest and most successful software companies in the world, LEGENT (now CA) and AXENT (now Symantec). Recently, as CEO and co-founder of eBillingHub, he grew the company from inception to establishing it in a leading market position that led to its sale to Thomson Reuters. Greg has been in ten start-ups and founded two, and has held executive positions for better than two-thirds of his career, participating in various size organizations, from &#8216;$0M to over $1B&#8217; in revenue. He has participated in raising over $49M in venture capital in his career, and has actively participated in over seventeen mergers and acquisitions, at both the company or product level. In the last 15 years the companies that Mr. Coticchia has participated in have netted ‘exit’ valuations of 8X revenue on average, and 16X the investment on average.\nHe has served as CEO (three times), President and COO of several successful start-up companies, and has been involved or responsible for the launch of over 100 products and solutions, and several companies. His publications and presentations on marketing strategy and product management have recognized as both visionary and thought provoking by leaders in the technology business. Greg has served on many boards (including NFR, Four Rivers and others), assisting senior management with strategic planning and other critical initiatives, and has been recognized for his work and contribution in his service to these organizations.   \nA graduate of the University of Pittsburgh in Industrial Engineering, where he also received his MBA, he currently teaches both business-to-business marketing and entrepreneurial leadership at the University Of Pittsburgh Katz School Of Business.  He also attained certificates in Entrepreneurial Management form Carnegie Mellon University and in Professional Coaching from Duquesne University. In addition to his many recognitions and awards from the businesses he has served, Coticchia was named as a finalist three times for the Ernst and Young Entrepreneur of the Year Award and for the Tech 50 CEO of the Year. Additionally, he was named a 2006 Distinguished Graduate of </p>","image":{"available_sizes":[[[150,129],"assets/images/resized/0015/5212/155212v2-max-150x150.png"],[[250,216],"assets/images/resized/0015/5212/155212v2-max-250x250.png"],[[450,389],"assets/images/resized/0015/5212/155212v2-max-450x450.png"]],"attribution":"<p>Greg Coticchia</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}