{"first_name":"Greg","last_name":"Boser","permalink":"greg-boser","crunchbase_url":"http://www.crunchbase.com/person/greg-boser","homepage_url":"http://www.gregboser.com/","birthplace":"","twitter_username":"gregboser","blog_url":"","blog_feed_url":"http://feeds.feedburner.com/gregboser/","affiliation_name":"3 Dog Media, LLC","born_year":null,"born_month":null,"born_day":null,"tag_list":"marketing, consulting, reputation-management, wordpress-development","alias_list":"","created_at":"Wed Oct 06 23:35:46 UTC 2010","updated_at":"Sun Mar 25 22:49:46 UTC 2012","overview":"<p>I first found my way to the Internet in 1995 while working as a Regional Sales Director for a Boulder Colorado based manufacturer of fire defense equipment. My mission was to recruit and develop a part-time sales force for a line of residential fire protection systems marketed to wealthy homeowners living in the fire-prone regions of Southern California. As it turned out, the firefighting related discussion forums on AOL, Compuserve, and Usenet turned out to be a great place to find good people.</p>\n\n<p>In 1996, I decided to venture out on my own by starting an independent company called Wildfire Defense Systems. WDS carried wide range of fire protection equipment such as portable swimming pool pumps and portable fire shelters. Faced with the problem of having virtually no budget to promote the new company, I did the obvious; I purchased a copy of Microsoft&#8217;s brand new html editor, FrontPage 1.1 and set out to build a website.</p>\n\n<p>Shortly after launching my new site, I quickly learned that the famous line from the movie Field of Dreams. If you build it, they will come slogan did not apply to the World Wide Web. Desperate for traffic, I began searching the web for information about how to get people to visit my website. During that quest, I stumbled upon a site owned by an ex-reporter-turned-Internet-consultant named Danny Sullivan. Danny&#8217;s site had a section on it called A Webmaster&#8217;s Guide to Search Engines. (Which later became what is now SearchEngineWatch.com).</p>\n\n<p>From that moment on, I was completely hooked. The rest of 1996 is somewhat of a blur. All I remember is spending hours at a time locked in a room constantly rewriting title and keyword meta tags on any web page I could get my hands on, and then submitting them to Infoseek over and over until I got listed on the first page.</p>\n\n<p>Early in 1997, I began taking on some web design jobs on the side. The majority of the work was for friends and small Mom &amp; Pop businesses. My design skills weren&#8217;t that great, but I was able to get a fairly steady flow of customers because there really weren&#8217;t too many web designers who had yet mastered the black art of search engine optimization.</p>\n\n<p>By the end of 1997 I was completely convinced that the Web was where I wanted to be, so I officially retired from the fire equipment business and started a small company called WebGuerrilla. WebGuerrilla was initially a one-stop-shop offering web design, hosting, maintenance, and marketing.</p>\n\n<p>As Y2K approached, I decided that it would be best to focus solely on search engine optimization, so I stopped offering design related services, and began taking on additional subcontracted SEO work from other Internet marketing companies. That decision turned out to be a good one. The dotcom crash of April 2000 combined with a touch of scandal brought a flood of new inquires from larger interactive agencies and design firms who were interested in providing SEO services to their large, formerly-VC-funded clients. All of a sudden, I was the man behind the curtain, developing search strategies for some of the world&#8217;s largest brands.</p>\n\n<p>Originally, I thought I had found career nirvana. The pay was great, and I was finally able to convince my wife I had a real job. But I soon discovered why I&#8217;ve been self-employed the majority of my adult life; I simply have no tolerance for the high-level of stupidity and incompetence that exists in the corporate world. As hard as I tried, I just couldn&#8217;t convince myself that spending 6 months cranking out dozens of crappy PowerPoint presentations, in an attempt to convince someone who should still be working in the mailroom, that we really needed to change their site&#8217;s title tags, was a fun and rewarding experience.</p>\n\n<p>So in late 2002, I began my exit from the corporate SEO world. I refocused my efforts on working only with quality companies that were big enough to have a real marketing budget, yet small enough to actually understand search. It was also around this time that I discovered the joys of affiliate marketing. The feast or famine lifestyle of an affiliate marketer was just what I needed to recharge my career.</p>\n\n<p>And that pretty much brings me to where I&#8217;m at right now. My time is fairly evenly split between pursuing some software development projects, finding quality rev share/joint venture projects, and doing traditional consulting work.</p>","image":{"available_sizes":[[[125,150],"assets/images/resized/0010/4446/104446v1-max-150x150.jpg"],[[209,249],"assets/images/resized/0010/4446/104446v1-max-250x250.jpg"],[[209,249],"assets/images/resized/0010/4446/104446v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President & CEO","firm":{"name":"3 Dog Media, LLC","permalink":"3-dog-media-llc","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0010/4458/104458v1-max-150x150.png"],[[250,250],"assets/images/resized/0010/4458/104458v1-max-250x250.png"],[[450,450],"assets/images/resized/0010/4458/104458v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"President","firm":{"name":"BlueGlass Interactive","permalink":"blueglass-interactive","type_of_entity":"company","image":{"available_sizes":[[[150,37],"assets/images/resized/0009/4307/94307v2-max-150x150.png"],[[250,61],"assets/images/resized/0009/4307/94307v2-max-250x250.png"],[[401,99],"assets/images/resized/0009/4307/94307v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}