{"first_name":"Greg","last_name":"Roberts","permalink":"greg-roberts-2","crunchbase_url":"http://www.crunchbase.com/person/greg-roberts-2","homepage_url":"http://www.gregroberts.com","birthplace":"Indiana","twitter_username":"acroyogi","blog_url":"http://playflow.blogspot.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1969,"born_month":null,"born_day":null,"tag_list":"playmotion, ar, nui, gesture, computer-vision, indiana, ramworks","alias_list":null,"created_at":"Tue Oct 25 22:36:22 UTC 2011","updated_at":"Mon Oct 31 03:04:42 UTC 2011","overview":"<p>Greg Roberts is an American artist and entrepreneur who is best known as a pioneering designer of interactive experiences, and for creating some of the first interface designs for broadband internet services.</p>\n\n<p>In 1986, while attending Walter Johnson High School, Roberts worked under the direction of Dr. Gary Wind at the National Naval Medical Center in Bethesda, Maryland, where he led the design of novel pre-surgical visualization methods through custom software co-developed with Vojin Dvorak. The techniques they developed utilized sequential 2d CAT scans to construct three dimensional models of internal human anatomy, which were then used to plan surgical approaches; these methods are now standard practice throughout Western medicine.</p>\n\n<p>Moving to Jacksonville, Florida in 1988, Roberts launched his first company, RamWorks, at the age of 18. In 1995 he was named Web Architect of Record for the first mass deployment of consumer broadband services in North America; in this role he designed high speed web applications for the NFL, CSX and Mercedes-Benz, among others. [1] Roberts sold RamWorks in 1998 and moved to San Francisco, California where he and Scott Wills co-founded BrightStreet.com, one of the first web based CRM companies.</p>\n\n<p>Roberts relocated to Atlanta, Georgia in 2001, where he embarked upon a sabbatical as an anarchist photojournalist. In 2003, while attending the DICE Summit in Las Vegas, he met The Fat Man, who inspired him to found his third company, PlayMotion, alongside computer vision scientist Matt Flagg. In his work there, Roberts was one of the first humans to clearly articulate a strategy for imbuing silicon-based life, specifically robots, with a basic level of metacommunicative competence.</p>\n\n<p>Roberts is the son of Dr. Anita Roberts, noted for her pioneering work with the TGF beta protein, and Dr. Bob Roberts.</p>\n\n<p>Roberts is divorced and has two biological children.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0015/9564/159564v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0015/9564/159564v2-max-250x250.jpg"],[[256,256],"assets/images/resized/0015/9564/159564v2-max-450x450.jpg"]],"attribution":"<p>Greg Roberts</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"CTO","firm":{"name":"SixIntel","permalink":"sixintel","type_of_entity":"company","image":{"available_sizes":[[[150,25],"assets/images/resized/0018/3441/183441v2-max-150x150.png"],[[250,41],"assets/images/resized/0018/3441/183441v2-max-250x250.png"],[[384,64],"assets/images/resized/0018/3441/183441v2-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"CEO, Founder","firm":{"name":"PlayMotion","permalink":"playmotion","type_of_entity":"company","image":{"available_sizes":[[[150,42],"assets/images/resized/0018/5618/185618v2-max-150x150.jpg"],[[250,70],"assets/images/resized/0018/5618/185618v2-max-250x250.jpg"],[[450,126],"assets/images/resized/0018/5618/185618v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/#!/AcroYogi","title":"Twitter: AcroYogi"}]}