{"first_name":"Greg","last_name":"Koski","permalink":"greg-koski","crunchbase_url":"http://www.crunchbase.com/person/greg-koski","homepage_url":"http://www.plastics.com","birthplace":"Quincy, Ma","twitter_username":"","blog_url":"http://blogs.plastics.com/just_one_word/","blog_feed_url":"http://blogs.plastics.com/just_one_word/index.rdf","affiliation_name":"Plastics.com LLC","born_year":1953,"born_month":4,"born_day":29,"tag_list":"plastics-polymers-internet-web-design-marketing-advertising-seo-smo","alias_list":null,"created_at":"Tue Nov 23 22:13:50 UTC 2010","updated_at":"Tue Dec 07 10:23:32 UTC 2010","overview":"<p>Greg Koski, a thirty five year plastics industry veteran, is recognized as the pioneer of bringing the internet to the plastics industry. Starting in 1994 Mr. Koski launched polymers.com, now known as plastics.com, the oldest, largest and busiest plastics web community worldwide.</p>\n\n<p>Plastics.com launched in 2000 as the direct successor to polymers.com. Mr. Koski has worked exclusively in internet marketing and technologies for the last fifteen years, overseeing hundreds of internet projects ranging from marketing to full admin of venture funded ecommerce businesses. Mr. Koski has won several of the most coveted &#8216;creative&#8217; awards presented by national marketing associations for his work in dotcom startups.\nPhoto by Doug Saglio\nGreg Koski, Principal and Founder of Plastics.com</p>\n\n<p>Greg Koski, Principal and 1994 original founder of Plastics.com</p>\n\n<p>Additionally, Mr. Koski is an accomplished computer professional with expertise in multiple creative software, programming software and in the IT responsibilities of setting up and managing complete Linux servers.</p>\n\n<p>The Commonwealth of Massachusetts named Mr. Koski as one of its technology spokespeople in 2000, an honor limited to about 100 of the state&#8217;s most respected business leaders.</p>\n\n<p>An alumnus of the University of Massachusetts Plastics Engineering program, Mr. Koski worked within the plastics industry in technology and management positions from 1976 to 1994. Highlights of that period include having designed innovative processing equipment, patented a chemical recycling process, started several companies, and experienced the venture capital industry from the entrepreneurs perspective, before concentrating on internet marketing within the plastics industry, which he has done for the last fifteen years.</p>\n\n<p>From 1988 to 1994 Mr. Koski developed and patented innovative plastics recycling technologies which he leveraged into a venture funded plastics compounding facility which was successfully sold to an industry investor group. One of his patented polymer blends was named one of the top ten new materials in 1990 by Design News. This work included spearheading a successful commercialization of a new polymer blend, all R&amp;D responsibilities, international technology transfer and speaking engagements worldwide related to recycling. Mr. Koski is one of the original founders of the Society of Plastics Engineers&#8217; Environmental Division.</p>\n\n<p>During his almost twenty years of working in plastics operations and engineering, Mr Koski was known for establishing his firms as technology leaders, turn around of unprofitable operations as large as 12 million in sales with over 120 employees, and in innovative technical solutions to production processes.</p>\n\n<p>For thirty five years Mr. Koski has been involved in successful startups as an employee, investor and entrepreneur.</p>\n\n<p>Over the years Mr. Koski has been active in the Society of Plastics Engineers (SPE) and with the National Plastics Center (NPC), which awarded him the Outstanding Service Award in 2002. Mr. Koski is on the Board of Directors of the Plastics Institute of America (PIA), active with the Plastics Academy&#8217;s Hall of Fame, and a member of the Plastics Pioneers Association (PPA) and the Society of Plastics Industry(SPI).</p>\n\n<p>Mr. Koski resides in Leominster, Massachusetts with his wife of over twenty years, Mae, and has four adult children, two grandchildren.</p>","image":{"available_sizes":[[[114,150],"assets/images/resized/0011/1478/111478v2-max-150x150.jpg"],[[190,250],"assets/images/resized/0011/1478/111478v2-max-250x250.jpg"],[[200,263],"assets/images/resized/0011/1478/111478v2-max-450x450.jpg"]],"attribution":"<p>Greg Koski / <a href=\"http://www.plastics.com\" title=\"Plastics.com LLC\" rel=\"nofollow\">Plastics.com LLC</a></p>"},"degrees":[{"degree_type":"BS","subject":"Plastics","institution":"U Mass Lowell","graduated_year":1976,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Plastics.com LLC","permalink":"plastics-com-llc","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.plastics.com","title":"plastics.com"},{"external_url":"http://www.polymers.com","title":"polymers.com"},{"external_url":"http://www.plasticswire.com","title":"plasticswire.com"},{"external_url":"http://www.plastics.asia","title":"plastics.asia"}],"web_presences":[]}