{"first_name":"Greg","last_name":"Papadopoulos","permalink":"greg-papadopoulos","crunchbase_url":"http://www.crunchbase.com/person/greg-papadopoulos","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Sun Microsystems","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Aug 18 08:55:07 UTC 2007","updated_at":"Fri May 16 00:35:57 UTC 2008","overview":"<p>As Chief Technology Officer and Executive Vice President of Research and Development at Sun, Greg Papadopoulos directs the company&#8217;s approximate $2B in R&amp;D portfolio with an eye toward innovation, simplicity, and eco-responsibility. With more than 20 years experience in the technology industry, Papadopoulos is responsible for managing Sun&#8217;s technology decisions and architecture. His team leads Sun Labs, the DARPA High Performance Computing Systems program, global engineering architecture and advanced development programs.</p>\n\n<p>Passionate about technology and its possibilities, Papadopoulos supports open development models that stimulate communication, creativity and innovation, which he promotes through his blog, Greg Matter, as well as numerous speaking engagements.\nView Gallery Images\n[View Gallery Images] [View Gallery Images] [View Gallery Images]\n    During his tenure with Sun, Papadopoulos has held several positions, including vice president of technology and advanced development for the company&#8217;s systems business, chief scientist for server systems engineering, and chief scientist for enterprise servers and storage.\nBefore joining Sun in 1994, Papadopoulos was senior architect and director of product strategy for Thinking Machines, where he led the design of the CM6 massively parallel supercomputer.</p>\n\n<p>Papadopoulos was an associate professor of electrical engineering and computer science at MIT, where he conducted research in scalable systems, multi threaded/data flow processor architecture, functional and declarative languages, and fault-tolerant computing. Papadopoulos also worked as a development engineer at Hewlett-Packard and Honeywell, where he designed flight-control systems for Boeing jetliners. He co-founded three companies: PictureTel (video conferencing), Ergo (high-end PCs) and Exa Corporation (computational fluid dynamics).</p>\n\n<p>Papadopoulos participates in several associations, including serving as chairman of the board for the Search for Extraterrestrial Intelligence (SETI), as a member of the Board of Trustees for the Anita Borg Institute for Women and Technology, and as a member of the President&#8217;s Board on Science and Innovation at the University of California. Greg acts as a technical advisor for BP and Alien Technologies.</p>\n\n<p>He holds a bachelor&#8217;s degree in systems science from the University of California at San Diego, as well as master&#8217;s and doctoral degrees in electrical engineering and computer science from MIT. </p>","image":{"available_sizes":[[[100,125],"assets/images/resized/0001/8702/18702v1-max-150x150.jpg"],[[100,125],"assets/images/resized/0001/8702/18702v1-max-250x250.jpg"],[[100,125],"assets/images/resized/0001/8702/18702v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CTO","firm":{"name":"Sun Microsystems","permalink":"sun-microsystems","type_of_entity":"company","image":{"available_sizes":[[[150,71],"assets/images/resized/0001/6586/16586v2-max-150x150.png"],[[180,86],"assets/images/resized/0001/6586/16586v2-max-250x250.png"],[[180,86],"assets/images/resized/0001/6586/16586v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}