{"first_name":"Gregg","last_name":"Spiridellis","permalink":"gregg-spiridellis","crunchbase_url":"http://www.crunchbase.com/person/gregg-spiridellis","homepage_url":"http://www.jibjab.com/","birthplace":"","twitter_username":"jibjab_ceo","blog_url":"","blog_feed_url":"","affiliation_name":"JibJab","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":"","created_at":"Thu Oct 04 12:27:49 UTC 2007","updated_at":"Wed Mar 17 08:24:11 UTC 2010","overview":"<p>Gregg Spiridellis co-founded JibJab Media Inc. with his brother Evan in 1999. Launched with a few thousand dollars worth of equipment and a dial-up Internet connection from a Brooklyn garage, their dream was to build a global entertainment brand.</p>\n\n<p>In addition to his role as CEO, Gregg is also JibJab&#8217;s head writer. In 2004, his lyrics helped spark an international sensation with the release of JibJab&#8217;s election parody, &#8220;This Land.&#8221; The two-minute short and its follow up, &#8220;Good To Be In DC!&#8221; were viewed more than eighty million times online on every continent, including Antarctica. NASA even contacted the brothers for permission to send a copy of the animation to the International Space Station!</p>\n\n<p>JibJab&#8217;s productions have screened at the top industry festivals including Sundance, the Palm Springs International Film Festival, SXSW and many others. They have also won awards at the Ottawa International Film Festival, the Cannes Lions International Advertising Festival, and D&amp;AD. Gregg has also assembled a client list that includes the world&#8217;s biggest entertainment and consumer product companies including Anheuser Busch, Disney, Cartoon Network, USA Networks, Sony, Kraft, Revlon and many others.</p>\n\n<p>Gregg has appeared on the &#8220;Today Show,&#8221; &#8220;The Tonight Show,&#8221; &#8220;CBS Early Morning,&#8221; &#8220;NBC Nightly News,&#8221; CNN, FOX News, CNBC and MSNBC. He has also been featured in articles in The New York Times, Los Angeles Times, USA Today and Time. In 2004, the late Peter Jennings named Gregg and his brother &#8220;People of the Year.&#8221;</p>\n\n<p>Prior to JibJab, Gregg was an investment banker with Bear Stearns and Goldman Sachs in New York. He graduated with distinction from the MBA program at the Wharton School of Business at the University of Pennsylvania in 1999 and received his BS, magna cum laude, from Rutgers University.</p>","image":{"available_sizes":[[[111,150],"assets/images/resized/0005/9839/59839v1-max-150x150.jpg"],[[186,250],"assets/images/resized/0005/9839/59839v1-max-250x250.jpg"],[[335,450],"assets/images/resized/0005/9839/59839v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Co-founder & CEO Guy","firm":{"name":"JibJab","permalink":"jibjab","type_of_entity":"company","image":{"available_sizes":[[[143,96],"assets/images/resized/0000/1159/1159v6-max-150x150.png"],[[143,96],"assets/images/resized/0000/1159/1159v6-max-250x250.png"],[[143,96],"assets/images/resized/0000/1159/1159v6-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}