{"first_name":"Gregor","last_name":"Berkowitz","permalink":"gregor-berkowitz","crunchbase_url":"http://www.crunchbase.com/person/gregor-berkowitz","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"MOTO Development Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu May 06 18:50:52 UTC 2010","updated_at":"Mon May 10 16:20:47 UTC 2010","overview":"<p>MOTO President and co-founder Gregor Berkowitz balances a vision for new technology and compelling consumer experience with a pragmatic focus on delivering successful products to market. </p>\n\n<p>Berkowitz leads MOTO&#8217;s services for startups and has driven key product development for startups including Pure Digital (Acquired by Cisco), Livescribe, Cepheid, Omnicell, SkyPilot. Berkowitz brings over eighteen years experience working across Asia, creating successful development partnership with companies from Japan, to Taiwan, China, Malaysia and South Asia. His understanding of cultural context, influences, and values has helped MOTO establish a reputation for building long-term relationships and ongoing partnerships with Asian suppliers and clients.</p>\n\n<p>Berkowitz received a BS in Mechanical Engineering from Carnegie Mellon University, and contributed to research at both the Carnegie Mellon Robotics Institute (computer vision systems), and the Carnegie Mellon Engineering Design Research Institute (space vehicle design). Berkowitz holds six US and international patents in area including mechanism design and cloud computing.</p>\n\n<p>Currently Berkowitz authors the Design Review column for CNET, sharing insights into how and why form meets function in consumer electronics. He also serves on the board of advisors for multiple startups including Twenty20 and JimmyJane.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President","firm":{"name":"MOTO Development Group","permalink":"moto-development-group","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0008/6268/86268v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0008/6268/86268v2-max-250x250.jpg"],[[300,300],"assets/images/resized/0008/6268/86268v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}