{"first_name":"Greg","last_name":"Horowitt","permalink":"greg-horowitt","crunchbase_url":"http://www.crunchbase.com/person/greg-horowitt","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 08 22:29:03 UTC 2009","updated_at":"Mon Jun 08 22:33:29 UTC 2009","overview":"<p>Greg Horowitt is the co-founder and Managing Director of T2 Venture Capital, a seed stage venture fund focused on the commercialization of intellectual property from government-funded agency programs, major research institutes, and universities around the world.  In this role, he has been active in the IP sourcing, founding, business structuring and executive management of their portfolio companies, including his role as the first CEO of STAR (Stonybrook Technology and Applied Research), a biomedical discovery and development company.  Greg’s past accomplishments have been as an executive with a Berkshire Hathaway company, Entrepreneur-in-Residence at a leading venture firm, and CEO of a venture-backed enterprise software company.<br/>\nGreg is concurrently the Executive Director of Global CONNECT, a think tank based at the University of California, San Diego focused on assisting the development and growth of successful international research and technology clusters.  Today the Global CONNECT network includes more than 20 countries and 40 cities internationally focused on accelerating global technology commercialization.  Greg is one of the most sought after speakers on topics of technology commercialization and has been published internationally. </p>\n\n<p>Greg was formerly the Interim Executive Director of CONNECT, an organization which is generally credited with San Diego’s success as a technology leader and which helped launch over 300 companies that raised over $600 million in early-stage funding and achieved over $10 billion in market capitalization. Greg has personally been involved with and/or mentored more than 200 companies.   </p>\n\n<p>Prior to CONNECT, Greg served as an Entrepreneur-in-Residence for SK Global, a Silicon Valley venture capital firm.  His career in technology started when he was President and CEO of the Praetorian Group, a venture-backed enterprise software company providing e-business solutions to law enforcement and public safety agencies across the country. For nearly 20 years before that, he was with a Berkshire Hathaway company, Flying Cross by Fechheimer Uniforms, where he finished his tenure as Vice President of Regional Sales</p>\n\n<p>Greg currently serves roles as a lead mentor for the University of California’s UC Discovery Fellows Program; Senior Advisor to Larta Institute; reviewer for the Kauffman Foundation’s e-Venturing Program; co-founder and Industry Advisory Board member for the Life Sciences-IT Global Institute; past board member and Chairman, Project Inform; judge for the PriceWaterhouseCoopers New Zealand HiTech Awards, and a member of the Leadership Trust for the San Diego Regional EDC.  </p>\n\n<p>Greg holds degrees in Biochemistry and Economics with a minor in Music Performance from the University of California, San Diego, and received a prestigious President’s Undergraduate Fellowship Award for his work studying the links between nutrition and breast cancer.  </p>","image":{"available_sizes":[[[117,150],"assets/images/resized/0004/7501/47501v1-max-150x150.jpg"],[[125,160],"assets/images/resized/0004/7501/47501v1-max-250x250.jpg"],[[125,160],"assets/images/resized/0004/7501/47501v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"T2 Venture Capital","permalink":"t2-venture-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[139,150],"assets/images/resized/0004/7495/47495v1-max-150x150.jpg"],[[220,236],"assets/images/resized/0004/7495/47495v1-max-250x250.jpg"],[[220,236],"assets/images/resized/0004/7495/47495v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}