{"first_name":"Greg","last_name":"Fant","permalink":"greg-fant","crunchbase_url":"http://www.crunchbase.com/person/greg-fant","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"eBay","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Thu Oct 07 16:22:58 UTC 2010","updated_at":"Thu Oct 07 16:24:12 UTC 2010","overview":"<p>Greg Fant is an e-commerce veteran with extensive experience in product and marketing strategy and development, distribution and management. Prior to One Kings Lane, Greg spent 10 years at eBay where he most recently held the position of vice president of North America marketing. In this role, he was responsible for all North America marketing functions, as well as development and management of global marketing infrastructure development. He oversaw eBay’s substantial marketing budget and managed a team of more than 100. </p>\n\n<p>Greg held additional senior management roles at eBay ranging from vice president of eBay buyer experience, vice president of global customer analytics, vice president of eBay global product strategy and seller product management, and vice president and divisional merchandise manager. In these roles, he developed and executed eBay’s North America end-to-end buyer experience strategy for product and marketing, managed all of eBay’s customer insights teams, overhauled the company’s web analytics tracking and measurement infrastructure, developed eBay’s first experimental testing platform,  and scaled business results in hundreds of eBay Categories.</p>\n\n<p>Greg also served as senior director of U.S. marketing, director of eBay sports, and senior category manager of the sporting goods category and new category development. In these roles, he was responsible for development and execution of buyer focused merchandising and marketing plans for 50 percent of eBay US categories, managed the eBay sports business and launched 100’s of new eBay categories.</p>\n\n<p>Earlier in his career, Greg held positions at The Coca-Cola Company, Feld Entertainment, Cerrell Associates and also worked as a staff aide for the Democratic National Committee and the Clinton-Gore campaign.</p>","image":{"available_sizes":[[[110,117],"assets/images/resized/0010/4582/104582v1-max-150x150.jpg"],[[110,117],"assets/images/resized/0010/4582/104582v1-max-250x250.jpg"],[[110,117],"assets/images/resized/0010/4582/104582v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Marketing Officer","firm":{"name":"One Kings Lane","permalink":"one-kings-lane","type_of_entity":"company","image":{"available_sizes":[[[150,29],"assets/images/resized/0004/0427/40427v1-max-150x150.jpg"],[[250,49],"assets/images/resized/0004/0427/40427v1-max-250x250.jpg"],[[257,51],"assets/images/resized/0004/0427/40427v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"VP, North America marketing","firm":{"name":"eBay","permalink":"ebay","type_of_entity":"company","image":{"available_sizes":[[[150,62],"assets/images/resized/0000/3625/3625v1-max-150x150.png"],[[210,87],"assets/images/resized/0000/3625/3625v1-max-250x250.png"],[[210,87],"assets/images/resized/0000/3625/3625v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}