{"first_name":"Gregg","last_name":"Seibert","permalink":"gregg-seibert","crunchbase_url":"http://www.crunchbase.com/person/gregg-seibert","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Aug 03 04:18:11 UTC 2011","updated_at":"Wed Aug 03 04:29:19 UTC 2011","overview":"<p>Gregg Seibert is executive vice president and chief financial officer of Cablevision Systems Corporation, one of the nation&#8217;s leading media and telecommunications companies. In this role, Mr. Seibert helps drive Cablevision&#8217;s overall corporate strategy, while overseeing the company&#8217;s finance and accounting matters as well as its taxation and risk management functions. He is also responsible for all treasury, investor relations and business development activities for the company.</p>\n\n<p>Since joining Cablevision in 2009, Mr. Seibert has played an instrumental role in a number of the company&#8217;s key initiatives including The Madison Square Garden Company spin-off, the Bresnan acquisition and the expected AMC Networks Inc. spin-off. In addition, he has overseen a number of transactions that have significantly improved the company&#8217;s financial profile. His responsibilities also include capital and cash management as well as the communication of the company&#8217;s operational and financial objectives to individual and institutional shareholders, financial analysts and investment managers.</p>\n\n<p>Prior to joining Cablevision, Mr. Seibert spent two decades at Merrill Lynch working on various financing and strategic transactions for companies across a number of industries. Most recently, he served as senior vice president and vice chairman of Merrill Lynch.</p>\n\n<p>From 2003 to 2004, Mr. Seibert was head of Americas Corporate Banking, managing all of Merrill Lynch&#8217;s investment banking activities across the United States, Latin America and Canada. Prior to this, he served as co-head of Global Corporate Finance and co-head of the Global Industries and Communications Group (GIC), which covered the consumer products, healthcare, media, technology and telecom industries. Mr. Seibert joined Merrill Lynch in 1989 as a managing director and head of the Global Media Group and was responsible for all of the company&#8217;s investment banking activities in the media and related entertainment industries.</p>","image":{"available_sizes":[[[80,100],"assets/images/resized/0014/7555/147555v1-max-150x150.jpg"],[[80,100],"assets/images/resized/0014/7555/147555v1-max-250x250.jpg"],[[80,100],"assets/images/resized/0014/7555/147555v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"","institution":"Wharton School of the University of Pennsylvania","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Executive Vice President and CFO","firm":{"name":"Cablevision","permalink":"cablevision","type_of_entity":"company","image":{"available_sizes":[[[150,32],"assets/images/resized/0005/9406/59406v2-max-150x150.png"],[[191,41],"assets/images/resized/0005/9406/59406v2-max-250x250.png"],[[191,41],"assets/images/resized/0005/9406/59406v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Vice President","firm":{"name":"Xstreme Media","permalink":"xstreme-media","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}