{"first_name":"Greg","last_name":"Mauro","permalink":"greg-mauro","crunchbase_url":"http://www.crunchbase.com/person/greg-mauro","homepage_url":"http://www.revolutionventures.com","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 12 06:14:31 UTC 2008","updated_at":"Thu Nov 13 03:34:17 UTC 2008","overview":"<p>Greg Mauro is Managing Partner of Revolution Ventures.  In addition to founding Revolution and leading its investment efforts, Greg has a long track record as a serial entrepreneur, including starting several Revolution portfolio companies.  Greg is founder and former CEO of Nextivity, a wireless company backed by Revolution, Goldman Sachs, and Advanced Technology Ventures.  Greg is also founder, Vice Chairman, and former President of SmartDrive, a driver risk management company backed by Revolution, Oak Investment Partners and New Enterprise Associates.   Prior to Revolution, Greg founded eSubscriber, a subscriber management company, and Tachyon, a broadband-satellite pioneer utilized today by U.S. forces in both Iraq and Afghanistan.  Across his endeavors, Greg has been on the founding team of ventures that have raised over $400M in aggregate venture capital, and Greg has personally raised over $200M of this funding.  Greg started his career as a strategy consultant for Monitor Group, a global strategy consulting firm.</p>\n\n<p>Greg has been active in the charter school movement since 2001, and has developed innovative financing vehicles to fuel their expansion.  Currently, Greg is a Board Director at SmartDrive, NR2B Research, Nextivity, and Starscriber.  He is a board observer at Symwave and CombineNet and a Trustee at the High Tech High Foundation.  Greg is a graduate of UCLA&#8217;s College of Honors and is a member of the Pacific Council on International Policy.  Greg is an avid traveler and has visited over ninety countries.  Greg enjoys cycling, heli-skiing, surfing and car racing.   In the 2008 Gumball 3000, Greg secured the land speed record from Suzhou to Beijing. </p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0002/8341/28341v2-max-150x150.jpg"],[[178,250],"assets/images/resized/0002/8341/28341v2-max-250x250.jpg"],[[250,350],"assets/images/resized/0002/8341/28341v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}