{"first_name":"Greg","last_name":"DeWitt","permalink":"greg-dewitt","crunchbase_url":"http://www.crunchbase.com/person/greg-dewitt","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"WhoDoYouKnowAt","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Sep 24 06:36:19 UTC 2009","updated_at":"Sun Sep 27 21:30:19 UTC 2009","overview":"<p>Greg DeWitt has 25 years of experience, the last 13 as Chief Investment Officer and Chief Financial Officer with CrossHarbor Capital Partners, a Boston-based institutional real estate advisory firm. Greg joined CrossHarbor during its inception, taking what was then a startup with 3 employees to a money management firm with over $1.2 billion of invested equity capital under management. Clients include: pension funds, college endowments, life companies, banks and foreign institutions. Greg managed both commingled funds and separate accounts, completed over $4 billion in transaction volume, and under his direction the firm achieved weighted average gross IRR of 25% per annum.</p>\n\n<p>Greg manages WhoDoYouKnowAt&#8217;s R&amp;D mathematics program, along with the financial aspects of the business including accounting, tax, investor reporting, regulatory compliance, audit and back office activities. He is also an investor and sits on the Board of Directors of the company.</p>\n\n<p>Greg&#8217;s academic background includes: BS, University of California, Los Angeles, 1980, Nuclear Engineering, MS, Massachusetts Institute of Technology, 1981, Nuclear Engineering, and MBA, Boston University Graduate School of Management, 1987, Finance. Greg&#8217;s experience includes registration with the SEC and NASD as an investment advisor and general securities principal having passed the NASD Series 3, 7, 24, 63 and 65. He has been a Certified Financial Analyst charter holder since 1992 and has successfully completed all coursework in the Nuclear Engineering Ph.D. program at the Massachusetts Institute of Technology where he is completing his thesis in his spare time, &#8220;Investigation of Downward Facing Critical Heat Flux with Water-Based Nanofluids for In-Vessel Retention Applications.&#8221; </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Mathematician","firm":{"name":"Who@","permalink":"whodoyouknowat","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0006/0677/60677v4-max-150x150.png"],[[250,80],"assets/images/resized/0006/0677/60677v4-max-250x250.png"],[[450,144],"assets/images/resized/0006/0677/60677v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}