{"first_name":"Greg","last_name":"Foster","permalink":"greg-foster","crunchbase_url":"http://www.crunchbase.com/person/greg-foster","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"BrightWhistle","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Apr 01 15:18:51 UTC 2011","updated_at":"Sat Jun 18 13:32:30 UTC 2011","overview":"<p>Greg Foster, Co-Founder and CEO of BrightWhistle, also serves as an Entrepreneur-in-Residence at Chrysalis Ventures.</p>\n\n<p>Greg possesses a comprehensive entrepreneurial and executive background in media and technology. Most recently, he served as Partner at Noro-Moseley Partners, an Atlanta-based venture capital firm, with a concentration on early-stage digital media companies. He has been a member of the management teams of three successful start-ups: at iXL, he served as Vice President and General Manager of the Madrid, Spain office and Senior Vice President of Corporate Development for the Atlanta office. At Silverpop Systems, Greg was Vice President of Business and Corporate Development. Prior to SilverPop, he launched Southern Direct, where he served as CEO. Greg then joined Turner Broadcasting following Turner’s acquisition of Southern Direct, where he served as Vice President of Corporate Development, overseeing M&amp;A and investment opportunities for all of Turner’s brands including CNN, TNT, TBS, TCM, Cartoon Network, TruTV and Adult Swim. He currently sits on the Board of Directors for The Onion, StatSheet, and PlayOn Sports and serves on the advisory board of Vertical Acuity, SolidFire and Clearleap.</p>\n\n<p>Greg holds a Bachelor’s Degree in Mechanical Engineering, Magna Cum Laude, from Georgia Tech and an MBA from Harvard Business School. He is a member of the board of trustees for the Georgia Tech Alumni Association, the Georgia Council on Economic Education, and the Bobby Dodd Foundation. Greg and his wife, Christine, have two sons, Jack and Henry.</p>","image":{"available_sizes":[[[115,150],"assets/images/resized/0013/9731/139731v2-max-150x150.jpg"],[[191,250],"assets/images/resized/0013/9731/139731v2-max-250x250.jpg"],[[345,450],"assets/images/resized/0013/9731/139731v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder and CEO","firm":{"name":"BrightWhistle","permalink":"brightwhistle","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0012/8787/128787v2-max-150x150.jpg"],[[250,57],"assets/images/resized/0012/8787/128787v2-max-250x250.jpg"],[[450,102],"assets/images/resized/0012/8787/128787v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}