{"first_name":"Greg","last_name":"Chichester","permalink":"greg-chichester","crunchbase_url":"http://www.crunchbase.com/person/greg-chichester","homepage_url":"http://www.chichesterdesign.co.nz/","birthplace":"Auckland","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Chichester Design","born_year":null,"born_month":null,"born_day":null,"tag_list":"bathroom-design, kitchen-design, auckland-bathrooms, kitchens-auckland","alias_list":null,"created_at":"Tue Jul 24 07:09:29 UTC 2012","updated_at":"Wed Jul 25 11:35:30 UTC 2012","overview":"<p>Chichester Design is owned and operated by Greg Chichester. He and the team offer a personalised design service, specialising in kitchen and bathroom creation, onto the greater Auckland area.</p>\n\n<p>Greg has over 26 years knowledge in design, project management and quality product management contained in the kitchen and restroom market, and has the bonus of hands-on knowledge in plumbing and building from his earlier years.</p>\n\n<p>Throughout his career, Greg has owned an importing business that saw him return to Italy repeatedly, sourcing product and securing agencies, which enhanced his ability to great design and gave him a global edge within the local market. He owned and operated a successful bathroom renovation company, and also has also spent time managing and designing for just one of recent Zealand largest Italian bathroom design showrooms.</p>\n\n<p>Greg has always enjoyed a love for great design, and the directions his life has undertaken have reflected this at each turn. He offers independent product selection, comprehending that the product must suit the clients design aspirations and also their budget. His experience, product knowledge, market contacts, design passion and client empathy, guarantee that his clients are constantly delighted with their kitchen or bathroom.</p>\n\n<p>Chichester Design is delighted to provide a personalised kitchen and bathroom design and enhance service to Aucklanders who share their capability to great design.</p>","image":{"available_sizes":[[[150,105],"assets/images/resized/0020/2488/202488v2-max-150x150.png"],[[192,135],"assets/images/resized/0020/2488/202488v2-max-250x250.png"],[[192,135],"assets/images/resized/0020/2488/202488v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Chichester Design","permalink":"chichester-design","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}