{"first_name":"Greg","last_name":"Gardiner","permalink":"greg-gardiner","crunchbase_url":"http://www.crunchbase.com/person/greg-gardiner","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jun 21 06:04:13 UTC 2009","updated_at":"Sun Jun 21 06:04:30 UTC 2009","overview":"<p>Greg serves as an advisor to Yale University’s Office of Cooperative Research (OCR), of which he was Managing Director for three years, and holds an adjunct faculty position at the Yale School of Medicine.  He is a director of four biotech companies, and a consultant and advisor to several investment funds and pharmaceutical and biotech companies.  As Managing Director of Yale’s OCR, Greg was responsible for commercial development of technology and licensing of intellectual property created by Yale faculty and bringing venture capital funding to companies in the New Haven area.  Prior to the OCR, Dr. Gardiner was Group Director of R&amp;D Operations, Pfizer Central Research, where he designed and implemented Pfizer’s external biotechnology strategy.  Dr. Gardiner also participated in the management of Pfizer’s worldwide drug discovery program, and was responsible for the scientific evaluation of licensing candidates including Lipitor, Celebrex, and Aricept.  Dr. Gardiner received a Ph.D. in Physical Chemistry from Fordham University and was a Sterling Fellow in Chemistry at Yale</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"dsskjfmt","permalink":"elm-street-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,22],"assets/images/resized/0004/9931/49931v1-max-150x150.jpg"],[[250,38],"assets/images/resized/0004/9931/49931v1-max-250x250.jpg"],[[256,39],"assets/images/resized/0004/9931/49931v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}