{"first_name":"gregory","last_name":"Willis","permalink":"gregory-willis","crunchbase_url":"http://www.crunchbase.com/person/gregory-willis","homepage_url":"http://h10134.www1.hp.com/industries/communications/leaderbios.aspx","birthplace":"new york","twitter_username":"gtwillis","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1961,"born_month":4,"born_day":22,"tag_list":"greg-willis","alias_list":null,"created_at":"Mon Nov 30 21:11:43 UTC 2009","updated_at":"Mon Nov 30 22:37:55 UTC 2009","overview":"<p>A 25-year veteran of the cable, broadcast, and broadband industries.\nGreg Willis an entrepreneurial sales, marketing, and business development leader with extensive experience in media, advertising, telecommunications, and entertainment companies.  Having led numerous and profitable high growth teams, he offers diverse multi-functional experience with both start-up and established companies in sales, co-branding, channel partnerships, and strategic alliances.  </p>\n\n<p>Willis previously held the position of Senior Vice President Sales for Ascent Media. Willis was responsible for Sales for Ascent Systems &amp; Technology Services businesses. He was responsible for the securing major new contracts with Fox News Channel, for the launch of Fox Business Network, and with The Weather Channel, CBS, ABC, NBCU, MTV Networks, Lifetime Networks, AOL, Microsoft, and U.S. Senate.</p>\n\n<p>Willis previously held the position of Executive Vice President, Affiliate Sales &amp; Marketing for WheelsTV. Willis was responsible for Affiliate Sales, Marketing, Broadband, and Network Operations. He was responsible for  launch of WheelsTV On-Demand and Broadband on Comcast. </p>\n\n<p>Willis previously held the position of Senior Vice President Global Sales Operations &amp; Marketing for PanAmSat. Willis was responsible for Global Sales Operations, Marketing, Product Management, Customer Relations, Business Affairs, and Market Intelligence. </p>\n\n<p>Previously, Willis held the position of Senior Vice President, Business Development for Interactive Video Technology, is a leading provider of enterprise-scale software that enables the creation, management, deployment and measurement of live and on-demand e-Communication presentations. Clients included HBO, Showtime, and BMG.</p>\n\n<p>Previously, Willis held the position of Senior Vice President Affiliates Sales &amp; Marketing for Liberty Media’s The Box Music Network and DMX Music. He was responsible for distribution and affiliates sales for The BOX, The Box Set, 6 digital themed music channels and digital audio service, Digital Music Express (DMX Music). In addition Willis was responsible for Marketing and Public relations for The Box Music Network. </p>\n\n<p>Previously Willis held the position of Vice President, Digital Networks, for Scripps Networks, where he oversaw the development of new cable channels such as Do-It-Yourself, a spin-off of Home &amp; Garden Television. Prior to Scripps, Willis was a member of the start-up team for The Food Network and held the position of Senior Vice President, Worldwide Distribution. During his career at The Food Network, he was responsible for achieving 35 million US subscribers, and launching the network in Canada and Japan.</p>\n\n<p>Prior to joining The Food Network, Willis held the position of Vice President Sales &amp; Marketing for The Charlton Group, a direct marketing firm. Willis began his media career at HBO, where spent nine years in various sales, marketing, and finance positions in New York and Dallas.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0006/8023/68023v2-max-150x150.jpg"],[[101,151],"assets/images/resized/0006/8023/68023v2-max-250x250.jpg"],[[101,151],"assets/images/resized/0006/8023/68023v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BS","subject":"Economics","institution":"Boston University","graduated_year":1985,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://h10134.www1.hp.com/industries/communications/","title":"New Era for Content"}],"web_presences":[{"external_url":"http://www.linkedin.com/in/gregorywillis","title":"LinkedIn"}]}