{"first_name":"Guy","last_name":"Morgenstern","permalink":"guy-morgenstern","crunchbase_url":"http://www.crunchbase.com/person/guy-morgenstern","homepage_url":"","birthplace":"Israel","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1976,"born_month":2,"born_day":16,"tag_list":"","alias_list":null,"created_at":"Fri Mar 02 00:00:42 UTC 2012","updated_at":"Tue Mar 06 19:36:03 UTC 2012","overview":"<p>Guy Morgenstern is the Co-Founder and Vice President, Delivery and Business Development of SeamBI. Morgenstern oversees Mr. Guy Morgenstern is the Co-Founder and Vice President, Delivery and Business Development of SeamBI. Guy oversees SeamBI’s marketing strategy and activities, as well as the implementation of digital brand integration projects. He is dedicated to making the SeamBI process a real revenue generator for the company’s clients. </p>\n\n<p>Prior to joining SeamBI’s sales and business development department, Guy was SeamBI’s Vice President, Research and Development. In this position, he was responsible for the overall SeamBI solution, including the development of the cutting edge algorithms that power the system. Together with Dr. Miky Tamir, Guy brought SeamBI’s digital brand integration solution from patent to product. </p>\n\n<p>Prior to joining SeamBI, Guy served seven years with the Electronics Research Department in the Israel Defense Forces (IDF) Intelligence Corps. He held various positions, leading teams and managing large scale projects with multidisciplinary expertise, including embedded systems design, real-time software programming, wireless communication engineering and control algorithms. In addition, he oversaw his department’s hardware and software infrastructure development. Prior to his service in the IDF, Guy worked for Radcom. He holds a B.Sc. degree in Electrical Engineering from the Technion and a M.Sc. in Electrical Engineering from Tel Aviv University.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}