{"first_name":"Guy","last_name":"Vidra","permalink":"guy-vidra","crunchbase_url":"http://www.crunchbase.com/person/guy-vidra","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Mar 11 22:35:31 UTC 2008","updated_at":"Tue Nov 11 07:09:27 UTC 2008","overview":"<p>Guy Vidra is the president of Proteus, Inc. and has a decade of experience working closely with media and advertising agency clients, having pioneered some of the earliest initiatives in mobile content, user-generated media and &#8220;advertainment&#8221; for both the media and advertising verticals. Today, Guy is responsible for crafting Proteus&#8217; vision, fueling its guiding principles and ensuring its market strategy is executed by a team of industry-leading mobile experts. </p>\n\n<p>Prior to taking on his current role, Guy was vice president of business development at Proteus for four years. In that position, he structured deals with the world&#8217;s largest major media companies - NBC Universal, News Corp, Disney, Discovery Communications and Scripps Networks - and implemented the first U.S. campaign to drive premium mobile content sales from a live televised event with FOX Sports. Guy oversaw the expansion of Proteus&#8217; reach into Latin America, architecting the company&#8217;s partnership with FOX Latin American Channels throughout the region and developing the pan-regional growth that now encompasses three offices in the biggest Latin American markets. He also introduced the Proteus product suite to new industry verticals, including breakthrough campaigns with Citigroup and MasterCard. </p>\n\n<p>Before Proteus, Guy was the senior vice president of business development for New York-based Oddcast, Inc. At Oddcast, Guy played a critical role in building deep business relationships with major advertising agencies and Fortune 500 companies. Guy worked with Saatchi &amp; Saatchi to create one of the earliest advertising campaigns to incorporate user-generated media along with viral marketing elements in support of the launch of the Toyota Matrix in 2001, helping Oddcast achieve recognition in the early days of rich media advertising and user-generated media tools. He went on to launch initiatives with PepsiCo, Unilever, Warner Bros., Coca Cola, SonyBMG and Chrysler, among others. </p>\n\n<p>Guy has contributed articles to a range of publications and forums and is a member of the Mobile Marketing Association as well as the Interactive Advertising Bureau. </p>\n\n<p>Guy is originally from New York City and holds a Master of Arts in Law &amp; Diplomacy from The Fletcher School of Law &amp; Diplomacy, as well as a Bachelor of Arts from the University of Michigan. </p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"VP, Business Development","firm":{"name":"Perfect Market","permalink":"perfect-market","type_of_entity":"company","image":{"available_sizes":[[[150,46],"assets/images/resized/0001/6439/16439v5-max-150x150.jpg"],[[250,78],"assets/images/resized/0001/6439/16439v5-max-250x250.jpg"],[[450,140],"assets/images/resized/0001/6439/16439v5-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"President","firm":{"name":"2ergo","permalink":"2ergo","type_of_entity":"company","image":{"available_sizes":[[[150,62],"assets/images/resized/0009/4129/94129v1-max-150x150.jpg"],[[250,103],"assets/images/resized/0009/4129/94129v1-max-250x250.jpg"],[[450,187],"assets/images/resized/0009/4129/94129v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}