{"first_name":"Guy","last_name":"Goldstein","permalink":"guy-goldstein","crunchbase_url":"http://www.crunchbase.com/person/guy-goldstein","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Pageonce","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jan 11 06:28:03 UTC 2008","updated_at":"Sun Apr 24 03:47:29 UTC 2011","overview":"<p>Guy Goldstein, founder and chief executive officer of Pageonce, and member of the company&#8217;s Board of Directors, brings nearly two decades of management, strategy and product development experience to his role as CEO.</p>\n\n<p>Since founding Pageonce in 2007, Guy has raised $10 million in venture capital funding and grown its membership from zero to more than four million. He has a proven track record in corporate development, mergers and acquisitions and as research and development leader. At Hewlett-Packard, Guy led inorganic growth expansion acquisitions to develop HP&#8217;s Business Intelligence strategy. During his seven year tenure at Mercury Interactive (later acquired by Hewlett-Packard) Guy helped establish the company-wide inorganic growth roadmap and strategic planning process, resulting in three acquisitions and $200 million in revenue. He was a key member of the executive team that developed the business plan for Mercury Interactive&#8217;s $5 billion acquisition by Hewlett-Packard. As Senior Director of Mercury Interactive&#8217;s R&amp;D division, Guy managed an international team of engineers and QA that built products generating $350 million in sales.</p>\n\n<p>Early in his life Guy was handpicked for an elite group of candidates to train for the Israeli Air Force based on his record-level test scores and technical aptitude. He excelled and rose to the top military rank of major and fighter pilot in one of world&#8217;s most respected air force programs. Ever the prolific innovator, he holds two patents.</p>\n\n<p>Guy graduated cum laude from Tel-Aviv University with a bachelor&#8217;s degree in Business and Computer Science.  </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder and CEO","firm":{"name":"Pageonce","permalink":"pageonce","type_of_entity":"company","image":{"available_sizes":[[[150,30],"assets/images/resized/0000/3085/3085v3-max-150x150.jpg"],[[171,35],"assets/images/resized/0000/3085/3085v3-max-250x250.jpg"],[[171,35],"assets/images/resized/0000/3085/3085v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}