{"first_name":"Guy","last_name":"Bailey","permalink":"guy-bailey","crunchbase_url":"http://www.crunchbase.com/person/guy-bailey","homepage_url":"","birthplace":"Middlesbrough, UK","twitter_username":"guyb99","blog_url":"http://blessayfromamerica.blogspot.com/","blog_feed_url":"","affiliation_name":"RE/MAX REGIONAL SERVICES","born_year":1973,"born_month":6,"born_day":17,"tag_list":"adobe, advertising, creative-writing, crisis-management, dreamweaver, event-management, marketing, social-media-media-production, media-relations, media-training, meeting-facilitation, microsoft-office, networking, new-media, news-releases, police, presen","alias_list":null,"created_at":"Mon Jun 06 15:32:27 UTC 2011","updated_at":"Tue Jun 14 19:11:02 UTC 2011","overview":"<p>I am a degreed PR, Social Media and media relations expert and writer with more than 15 years experience coordinating campaigns, messaging and media outreach for international brands including the British Broadcasting Corporation (BBC), the Open University, the UKs largest university and RE/MAX, the largest Franchise Real Estate Organization in America.</p>\n\n<p>In my most recent projects, I have been instrumental in planning, creating, and updating online material including blogs, video and updates, all incorporating SEO, tagging and associated analytics. </p>\n\n<p>I constantly and consistently improve and update my skills base and have received recent formal training in Social Media strategy and implementation, Neuro-Linguistic Programming (NLP), personal effectiveness, effective meetings, Podcasting, video production and editing</p>\n\n<p>I am comfortable working with all levels of an organization, from front line staff to senior executives and management.</p>\n\n<p>As well as social media, I have an extensive track record and experience preparing PR materials for media outreach, journalism and creative writing, maintaining relationships with key media outlets and more than a decade of experience pitching stories to media for placement, or providing comment to defuse negative media coverage.I also have great knowledge of crisis management issues, proactive and reactive media relations and publicity both for single issue stories and campaigns from inception through execution to evaluation.</p>\n\n<p>Software packages I have used and am proficient in include Microsoft Windows, Office including Project, Adobe Photoshop, Dreamweaver, Blogger, Wordpress, Tumblr, Flickr, Picasa, Facebook, Myspace, Youtube, Twitter, Audacity and many more.</p>\n\n<p>Specialties\nadobe, advertising, creative writing, crisis management, dreamweaver, event management, marketing, social media media production, media relations, media training, meeting facilitation, microsoft office, networking, new media, news releases, police, presentation skills, press releases, programming, public relations, publicity, quark xpress, radio, SEO, stories, strategic, strategy planning, supervisory skills, television, video production, web site production, writing</p>","image":{"available_sizes":[[[103,150],"assets/images/resized/0013/7878/137878v2-max-150x150.jpg"],[[118,171],"assets/images/resized/0013/7878/137878v2-max-250x250.jpg"],[[118,171],"assets/images/resized/0013/7878/137878v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelors","subject":"Media Studies with Business Management and IT","institution":"Manchester University, UK","graduated_year":1996,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Communications Coordinator","firm":{"name":"RE/MAX REGIONAL SERVICES","permalink":"re-max-regional-services","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/guy-bailey/10/772/556","title":"LinkedIn"},{"external_url":"http://twitter.com/#!/guyb99","title":"Twitter"}]}