{"first_name":"Guy","last_name":"Oppenheim","permalink":"guy-oppenheim","crunchbase_url":"http://www.crunchbase.com/person/guy-oppenheim","homepage_url":"http://guyoppenheim.com/","birthplace":"United Kingdom","twitter_username":"guyoppenheim","blog_url":"http://guyoppenheim.com/","blog_feed_url":"http://guyoppenheim.com/feed/","affiliation_name":"Oppenheim & Co Limited","born_year":null,"born_month":null,"born_day":null,"tag_list":"guy-oppenheim, oppenheim-guy, guy, oppenheim","alias_list":null,"created_at":"Fri Oct 12 10:32:06 UTC 2012","updated_at":"Thu Nov 29 18:51:58 UTC 2012","overview":"<p>Guy Alain Oppenheim is one of the founders of the Oppenheim Group and a member of its Investment Committee. </p>\n\n<p>He has in excess of 25 years experience as a portfolio manager, investing globally in all asset classes.  During his tenor, he has managed assets well in excess of $1 billion for institutional clients, sovereign wealth funds, and private families. He has been registered and authorized by Financial Services Authorities and served also as Compliance and MLRO Officer.</p>\n\n<p>His professional career started in 1978 as auditor with Arthur Andersen in Geneva. He specialized in auditing financial and banking institutions. He then moved to the Singapore office to start the bank auditing practice. </p>\n\n<p>Thereafter, Mr. Oppenheim joined UBS in Singapore as an internal auditor to set up their internal audit department and was later promoted to COO for the Singapore branch which was at the time the most active after Zurich in Treasury and FX.</p>\n\n<p>In 1985, he moved back to Geneva to join Lombard, Odier &amp; Cie, reporting directly to one of the.  In 1988, he went to London to start the firm’s new Private Client Practice. He had the responsibility of developing the Bank’s marketing development efforts in the Far East.  Moreover, he was a Member of the Private Clients Committee, which was responsible for the Bank’s asset allocation policy implementation, IT development and Group marketing efforts among others.</p>\n\n<p>In 1996, he joined Global Asset Management Ltd (GAM) in London reporting directly to the Founder and Chairman of the Group, the late Gilbert de Botton. With him, he looked after de Botton’s client base focusing on portfolio management. At GAM, he gained tremendous experience in hedge funds as GAM was and still is one of the leaders in that field.</p>\n\n<p>In 2001 (two years after GAM was bought by UBS), Mr. Oppenheim left GAM to join NotzStucki in London where he served as CEO until December 2009. During this time he managed portfolios for institutional and professional clients and was also responsible for the development of the group in the Middle East. </p>\n\n<p>Mr. Oppenheim was educated in Geneva and holds a BA in Business Administration majoring in Finance from the University of Geneva.</p>","image":{"available_sizes":[[[150,93],"assets/images/resized/0021/5299/215299v2-max-150x150.jpg"],[[250,156],"assets/images/resized/0021/5299/215299v2-max-250x250.jpg"],[[450,281],"assets/images/resized/0021/5299/215299v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Company","firm":{"name":"Oppenheim & Co Limited","permalink":"oppenheim-group","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://youtube.com/GuyOppenheim","title":"YouTube Videos"}],"web_presences":[{"external_url":"http://www.facebook.com/GuyOppenheimFANs","title":"FAN Page of Guy Oppenheim"},{"external_url":"https://twitter.com/GuyOppenheim","title":"Follow Guy Oppenheim on Twitter"},{"external_url":"https://plus.google.com/108729221952841888061","title":"Google Plus Profile"}]}