{"first_name":"Gwendal","last_name":"Auffret","permalink":"gwendal-auffret","crunchbase_url":"http://www.crunchbase.com/person/gwendal-auffret","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Arts Alliance Media","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon May 10 15:02:21 UTC 2010","updated_at":"Wed May 12 23:29:50 UTC 2010","overview":"<p>Gwendal joined Arts Alliance Media in June 2007 to lead the Southern European digital cinema operation, based in Paris. Previously Gwendal was CEO of Eclair Digital Cinema and has been working in the digital cinema industry for many years. He has extensive experience of negotiating with studios, European distributors and exhibitors for the transition to digital cinema in France, Italy, Germany and Spain, and also forming strategic partnerships with manufacturers and service providers for deployment operations in Europe. Gwendal holds a Ph.D. in Computer Science from the Université de Technologie de Compiègne (UTC, France).  Before he turned to digital cinema, Gwendal started his career in the field of audiovisual archives by working on the indexing of digital libraries at the Institut National de l&#8217;Audiovisuel (INA - The French TV and Radio Archives), then he managed a large film digitization project as well as the modernization of the fully automated video consultation services of the Forum des Images (more than 6700 films)</p>","image":{"available_sizes":[[[66,87],"assets/images/resized/0008/6880/86880v2-max-150x150.jpg"],[[66,87],"assets/images/resized/0008/6880/86880v2-max-250x250.jpg"],[[66,87],"assets/images/resized/0008/6880/86880v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Senior Vice-President, Digital Cinema ","firm":{"name":"Arts Alliance Media","permalink":"arts-alliance-media","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}