{"first_name":"Gyles","last_name":"Seward","permalink":"gyles-seward","crunchbase_url":"http://www.crunchbase.com/person/gyles-seward","homepage_url":"http://www.9xb.com/gyles_seward","birthplace":"Harrogate","twitter_username":"gylessewardSEO","blog_url":"http://www.9xb.com/blog/","blog_feed_url":"http://www.9xb.com/blog/feed","affiliation_name":"9xb SEO Agency","born_year":1978,"born_month":3,"born_day":6,"tag_list":"seo, ppc, smo, search-engine-optimisation, pay-per-click, social-media-optimisation","alias_list":null,"created_at":"Thu Jan 20 15:13:15 UTC 2011","updated_at":"Mon Mar 14 02:39:16 UTC 2011","overview":"<p>Online Marketing Account Director working for 9xb SEO Agency, UK. Heading up online marketing accounts across multiple sectors of business from start ups through to Blue Chips such as Marks &amp; Spencers, Burger King and Hi-Tec. Specialist in the following online marketing disciplines:</p>\n\n<ul>\n<li>SEO (Search Engine Optimisation)</li>\n<li>PPC (Pay Per Click)</li>\n<li>SMO (Social Media Optimisation)</li>\n</ul>\n\n<p>Online marketing strategist working across all digital channels including search engine optimisation, pay per click and social media. With a passion for the digital arena and an ongoing quest to understand how to achieve best results across each channel I work with a leading brands in the UK helping them realise their true potential online. </p>\n\n<p>A proven pedigree working in SEO I have successfully developed and implemented holistic seo campaigns that develop prominence and ongoing visibility for my clients. Looking to drive the &#8216;natural&#8217; seo loop I have begun developing concepts in seo that can be interpreted in a commercial world context. Looking to mix passion with real life application I work with my clients to understand who their target audience are and understand their customer journeys online. From greater insight into keywords including efficiency, modelling and performance I plan a conversion focussed strategy looking for &#8216;quality&#8217; over &#8216;quantity&#8217; and driving long term visibility. An enthusiastic contributor I actively speak at conference and am readily available to discuss our search engine optimisation is shaping the modern business world. </p>\n\n<p>Looking beyond the SEO arena paid search and the development of cost efficient campaigns plays a major role in my day to day strategy building. A proven conversion method PPC working across Google Adwords, Yahoo, Bing and Facebook continues to be a major part of strategy building for my agency and clients. With an indepth understanding of the paid advertising field the eternal quest to continually beat conversion rates is passion and quest. </p>\n\n<p>Fast becoming the flavour of online marketing social media optimisation has begun to be the core question from all of my clients. Whilst &#8216;social&#8217; is actively used deciphering how it can be used in a commercial context has become a key consideration in 2011 and through monitoring, testing and evaluation I have begun to evolve social commerce strategies that harness the power of the individual. Looking beyond using a Facebook page I look to understand who the target audience are within the social arena and how best to interact with them establishing the holy grail of one to one personalised and targetted information. An ongoing relationship, social media is fast becoming the number 1 request from my client base and indeed the market place. </p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0011/8215/118215v2-max-150x150.jpg"],[[80,80],"assets/images/resized/0011/8215/118215v2-max-250x250.jpg"],[[80,80],"assets/images/resized/0011/8215/118215v2-max-450x450.jpg"]],"attribution":"<p>Gyles Seward - Online Marketing Account Director</p>"},"degrees":[{"degree_type":"BA (Hons)","subject":"Marketing","institution":"Newcastle University","graduated_year":2001,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Online Marketing Account Director","firm":{"name":"9xb SEO Agency","permalink":"9xb-seo-agency","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.9xb.com/blog/","title":"SEO Agency Blog"}],"web_presences":[{"external_url":"http://www.9xb.com","title":"SEO Agency"},{"external_url":"http://twitter.com/gylesseward","title":"Gyles Seward Twitter"}]}