{"first_name":"H.E. Sir Victor JW","last_name":"Pekarcik III","permalink":"h-e-sir-victor-jw-pekarcik-iii","crunchbase_url":"http://www.crunchbase.com/person/h-e-sir-victor-jw-pekarcik-iii","homepage_url":"","birthplace":"","twitter_username":"GlobalStatesman","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1966,"born_month":7,"born_day":2,"tag_list":"","alias_list":null,"created_at":"Sat Oct 09 19:03:38 UTC 2010","updated_at":"Thu Oct 21 23:52:40 UTC 2010","overview":"<p>For over 20 years Mr. Pekarcik has helped countries &amp; corporations meet the challenges and successfully grow in this new world of converging technologies, global interdependence, with international strategic business development, global marketing, and international branding campaigns. </p>\n\n<p>He works with and advises Global corporate CEOs, Heads of State, U.S. and international government agencies, the United Nations, as well as being a member of many International Steering Committees.  He advises and implements economic sustainability programs, improves corporations customer service, increases their marketshare, and their revenues by hundreds of millions of dollars and in some cases billions of dollars. </p>\n\n<p>Mr. Pekarcik has been responsible for gathering global brain trusts, which consist of the current &amp; former heads of state, global corporate CEOs, global public figures, global philanthropists, Nobel laureates, scientists, as well as global associations who focused on the largest of Sustainability Issues/Projects, and have been internationally recognized for his humanitarian service and Philanthropic endeavours including being\nKnighted by the Vatican.</p>","image":{"available_sizes":[[[150,120],"assets/images/resized/0010/6348/106348v2-max-150x150.jpg"],[[250,201],"assets/images/resized/0010/6348/106348v2-max-250x250.jpg"],[[450,362],"assets/images/resized/0010/6348/106348v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}