{"first_name":"H Mark","last_name":"Delman","permalink":"h-mark-delman","crunchbase_url":"http://www.crunchbase.com/person/h-mark-delman","homepage_url":"http://www.MarkDelmanMarketing.com","birthplace":"","twitter_username":"HMarkDelman","blog_url":"http://www.MarkDelman.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"marketing-executive","alias_list":null,"created_at":"Wed Mar 16 04:21:15 UTC 2011","updated_at":"Wed Mar 23 00:35:24 UTC 2011","overview":"<p>Marketing &amp; General Management Executive </p>\n\n<p>In his role as Vice President of Marketing at online reputation management and Internet privacy leader Reputation.com, Inc., Mark Delman supports his work with more than two decades of marketing and branding experience in technology, consumer goods, and other sectors. Joining Reputation.com, Inc. in 2010, Mark Delman assumed a wide range of responsibilities related to marketing strategy, advertising, and branding, with an additional focus on customer acquisition and consumer insight. Prior to Reputation.com, Inc., Mark Delman spent more than four years as the Vice President of Marketing for PictureItPostage.com, where he held oversight for all facets of marketing, branding, and operations. During the course of his tenure with PictureItPostage.com, Mark Delman helped to increase company revenues by 400 percent, improved customer satisfaction to 89 percent, and led business development initiatives with ArtStamps, Wilton Stationers, and Zenfolio. Mark Delman stayed on with PictureItPostage.com after its acquisition in 2007, ensuring the smooth transition of the company and its brand.</p>\n\n<p>Mark Delman went to PictureItPostage.com after a period working as the Director of Marketing for Adobe Systems’ Photoshop division, handling worldwide marketing for all Photoshop-branded products. Previously, Mark Delman served as the Director of Marketing and Market Development for Eastman Kodak, where from 1998 through 2004 he focused his professional efforts on product development, branding, and strategy. In particular, Mark Delman spearheaded the development and launch of Kodak’s NexPress 2100 digital printing press, which generated $80 million in first-year sales. Other positions Mark Delman has held include Category Planning Manager and Senior Associate Brand Manager at Kraft Foods Inc. and Senior Account Executive at The Bloom Agency. A member of the American Marketing Association and the Marketing Executives Networking Group, Mark Delman holds an M.B.A. in Finance, Statistics, and Policy and a B.A. in History from the University of Chicago. </p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0012/6420/126420v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0012/6420/126420v2-max-250x250.jpg"],[[288,288],"assets/images/resized/0012/6420/126420v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.MarkDelman.com","title":"Marketing Blog"},{"external_url":"http://www.MarkDelmanMarketing.com","title":"Work History"},{"external_url":"http://www.PlanterTomato.com","title":"Gardening Blog"},{"external_url":"http://www.linkedin.com/in/markdelman","title":"LinkedIn"}]}