{"first_name":"Habitat","last_name":"App","permalink":"habitat-habitat","crunchbase_url":"http://www.crunchbase.com/person/habitat-habitat","homepage_url":"http://habit.at","birthplace":"Tokyo, Japan","twitter_username":"habit_at","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Mar 14 02:42:53 UTC 2012","updated_at":"Sun Mar 25 06:29:08 UTC 2012","overview":"<p>Create an original guidebook by collecting your favorite places in your Habitat, organize them by folders and share them with friends by sending them a folder.</p>\n\n<p>If you have a lot of good restaurants, cafés or other spots worth visiting you want to recommend to your friends, finding and sending information about each one individually can be quite a lot of work. Habitat can really help you out here. Send a whole folder of places you have already gathered in your personal habitat to your friends with a single tap. That includes all the important information about the place like comments, pictures and a map.</p>\n\n<p>Collect your favorite spots and those your friends sent you in your &#8220;My Habitat&#8221; to make a unique, one-of-a-kind guide book.</p>\n\n<p>Main Features:</p>\n\n<ul>\n<li>My Habitat: A collection of your favorite spots</li>\n<li>Folders: Organize places in your habitat by topic, mood, location or anything else</li>\n<li>Send Folders: Quickly send a whole collection of places to your friends</li>\n<li>Comments: Add your voice to places</li>\n<li>Photostream: Add your pictures to places</li>\n<li>Activities: Check out what your friends are up to</li>\n<li>Maps: Get an overview of your habitat on the map</li>\n<li>Twitter and Facebook integration: Share new places you add on Twitter or Facebook</li>\n</ul>\n\n<p>• Website: http://habit.at\n• App Store URL:http://itunes.apple.com/en/app/habitat/id424539961?mt=8http://itunes.apple.com/en/app/habitat/id424539961?mt=8\n• YouTube (English): http://youtu.be/LPXTTZvy_Sk</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}