{"first_name":"Haig","last_name":"Kayserian","permalink":"haig-kayserian","crunchbase_url":"http://www.crunchbase.com/person/haig-kayserian","homepage_url":"http://www.kayweb.com","birthplace":"Sydney Australia","twitter_username":"HaigKayserian","blog_url":"http://www.haigkayserian.com","blog_feed_url":"http://www.haigkayserian.com/blogs/rss","affiliation_name":"KAYWEB","born_year":1982,"born_month":12,"born_day":5,"tag_list":"","alias_list":null,"created_at":"Tue Mar 22 16:50:55 UTC 2011","updated_at":"Sun May 01 06:47:16 UTC 2011","overview":"<p>Haig Kayserian is an internet business consultant, angel investor and blogger with clients and projects across Australia, the United States of America and Asia.</p>\n\n<p>The first company he founded - KAYWEB - has offices in Sydney, Melbourne, New York and Manila, providing premium websites and apps solutions to businesses, organizations, government and individuals.</p>\n\n<p>KAYWEB and Haig Kayserian specialize in web and mobile projects of entrepreneurs, helping people with great ideas and a strong drive to succeed turn their website projects and mobile app projects into successful and sustainable businesses.</p>\n\n<p>Born in Sydney in 1982, Haig Kayserian graduated high school at Galstaun College in Ingleside NSW. He completed his Bachelor of Arts degree at Macquarie University, majoring in Media &amp; Cultural Studies, also taking subjects in Politics, Multimedia and Marketing.</p>\n\n<p>Post graduation, Haig Kayserian worked as a journalist and editor with Special Broadcasting Service (SBS), a journalist with the Sea Eagle News and Managing Editor of his first online business, SportsNews Australia.</p>\n\n<p>Haig Kayserian founded KAYWEB Holdings (initially Kay Web Creations) in 2003, with the goal of providing premium web design services to Sydney businesses. The business expanded exponentially in 2006.</p>\n\n<p>Services offered were no longer limited to website design and development; with web application development, mobile application development and web marketing added to the services menu, each with dedicated expert staff.</p>\n\n<p>Haig Kayserian earned his qualifications to project manage digital projects.</p>\n\n<p>He has since been the chief architect for hundreds of projects for entrepreneurial and corporate clients, as well as proprietary software under the KAYWEB brand. These include KAYWEB MYOB RMsync (synchronizing software between ecommerce websites and MYOB Retail Manager software), KAYWEB CMS (a module-rich, search engine-friendly, state-of-the-art content management system with ecommerce module), KAYWEB CRM (a state-of-the-art, order accepting customer relationship management system), KAYWEB Compound Manager (a pharmaceutical compounding system linked to KAYWEB-built web-based CRM, Inventory Manager, Formula Creator, Medication dispenser and Courier dispatcher),  and a series of software under the sub-brand Web Advocacy (due for a 2011 release - details withheld until then).</p>\n\n<p>In 2010, Haig Kayserian launched KAYWEB, LLC - the United States arm of the websites and apps business, setting up base in the heart of New York City.</p>\n\n<p>With this office, KAYWEB&#8217;s aim is to provide a more global representation to its entrepreneur clients, and attract even more entrepreneurs to their stable of clients and partners.</p>\n\n<p>Thus, Haig Kayserian also founded New York Angel Investment company, KAYWEB Angels, LLC. KAYWEB Angels is an angel investment group based in New York City, providing development services and mentoring to web and mobile startups in exchange for equity. He is the CEO.</p>\n\n<p>Haig Kayserian has overseen the development and launch of over 100 websites and mobile projects as KAYWEB Managing Director.</p>\n\n<p>Haig Kayserian has ownership in multiple web businesses across Australia and the United States, and has been involved in the sale of several for himself and on behalf of clients of his consulting service. A passion of his is to get involved as an an angel investor and equity partner in those projects which have a great chance of success, given the right guidance.</p>\n\n<p>Haig Kayserian is considered an industry expert in the fields of web and mobile business strategy and web and mobile marketing - studying and practicing search engine optimisation, social media optimisation and mobile marketing trends to achieve some outstanding success for his clients over the years.</p>\n\n<p>He has spoken on these topics at public forums and events in three continents, and on national television in Australia. Haig Kayserian currently blogs for one of the largest social media blogs on the web, Social Times.</p>\n\n<p>As an internet business consultant, Haig Kayserian has earned praise of his knowledge of existing web and mobile enterprises - the reasons for their successes and failures. His experience in dealing with entrepreneurs has led Haig Kayserian to develop a unique skill-set which will help clients analyse their projects before development or redevelopment. He helps design the architecture of such projects, launch them and market them with a tailored multi-tiered plan.</p>\n\n<p>Haig Kayserian is an active member of the Internet Industry Association (IIA); sitting on the IIA Online Content Taskforce. He is also a member of the Australian Interactive Media Industry Association (AIMIA) and the Australian Web Industry Association (AWIA).</p>\n\n<p>In 2010, Haig Kayserian was part of the .AU Domain Administrator (.auDA) Names Policy Panel, which sets domain name policy for the Australian market on behalf of the Australian government.</p>\n\n<p>That same year, he was also named as a judge of the AIMIA Awards, the most prestigious website awards in Australia.</p>\n\n<p>In 2011, Haig Kayserian was invited to present at Socialize New York - a summit dedicated to advising United States businesses about how to monetize social media.\nHaig Kayserian also sits on the Board of the Armenian National Committee of Australia and is Chairperson of the Galstaun College Alumni Association.</p>\n\n<p>Haig Kayserian is married and lives in New York with his wife. They are both actively involved in KAYWEB and travel between the company&#8217;s offices in Melbourne, Sydney and Manila regularly.</p>","image":{"available_sizes":[[[118,150],"assets/images/resized/0012/8979/128979v2-max-150x150.jpg"],[[118,150],"assets/images/resized/0012/8979/128979v2-max-250x250.jpg"],[[118,150],"assets/images/resized/0012/8979/128979v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelors","subject":"Media & Cultural Studies, Politics","institution":"Macquarie University","graduated_year":2004,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder and Internet Business Consultant","firm":{"name":"KAYWEB","permalink":"kayweb","type_of_entity":"company","image":{"available_sizes":[[[150,51],"assets/images/resized/0012/7293/127293v2-max-150x150.jpg"],[[250,86],"assets/images/resized/0012/7293/127293v2-max-250x250.jpg"],[[450,155],"assets/images/resized/0012/7293/127293v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Founder & CEO","firm":{"name":"KAYWEB Angels","permalink":"kayweb-angels","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0013/2050/132050v2-max-150x150.jpg"],[[250,100],"assets/images/resized/0013/2050/132050v2-max-250x250.jpg"],[[450,180],"assets/images/resized/0013/2050/132050v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}