{"first_name":"hans","last_name":"laan","permalink":"hans-laan","crunchbase_url":"http://www.crunchbase.com/person/hans-laan","homepage_url":"http://www.iscow.org","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1963,"born_month":2,"born_day":13,"tag_list":"webshop, website, certified, ecommerce, business, certification, certify, iscow, shop, shopping","alias_list":null,"created_at":"Thu Mar 29 05:19:15 UTC 2012","updated_at":"Fri Mar 30 15:53:51 UTC 2012","overview":"<p>ISCOW or the International Standard Certification Online Web shop is an authority when it comes to website certification.  It is their mission to provide safety and security in e-commerce especially in these days wherein the demand for e-commerce is ever increasing. Nowadays, the internet is infested with web shops that commit fraudulent acts such as identity theft, dishonesty with regards to selling transactions, and scams.  It is ISCOW’s job to provide certification to prove that a certain online merchant provides safe, secure, and reliable online transactions.  By these, consumer confidence is achieved.</p>\n\n<p>For a consumer to check if a certain website is certified by ISCOW, look for certifications such as the Web shop CIW and the Web shop CIWB.  These are indications that the online merchant is compliant with national as well as international laws and regulations with regards to safe and secure e-commerce.  The certifications also prove that the merchant is compliant with the terms and conditions posted by ISCOW.  Online shop owners are highly encouraged to apply for certification to show their consumers that they are reliable and secure and that all transactions are safely done.  The ISCOW certification assures a safe shopping customer, thus, increasing your business success and profit at the same time.</p>\n\n<p>There are 5 things a business must have to qualify for an ISCOW certification.  First, the shop should sell really good and effective products. Second, delivery should be speedy and reliable.  Third, all transactions online, by mail, or phone, should be safe and secure.  Fourth, the web shop should provide excellent customer service, and fifth, the shop should practice respect for customer’s privacy and transaction confidentiality.  Possessing all these 5 elements is enough to be able to gain the ISCOW standard safety seal for customer satisfaction.</p>\n\n<p>Web shop CIWB or CIW certification can be applied for through online registration.  After a company has registered, they will receive a welcome package containing all forms and informational documents that they would need to attain certification.  It will contain instructions, conditions, as well as regulations with regards to the national and international standard ISCOW terms and policies.  All forms should be accomplished and returned within a month of receiving them. The company would then receive a notification about the approval of their certification along with a certificate containing a certification number.  This certification number should be displayed in a visible area of your website for customers to view it easily.  Upon displaying the number, you are now recognize as a certified merchant that offers safe and secure products and services to online consumers all over the globe.</p>\n\n<p>If the web shop falls short of any of the requirements posted by ISCOW, it would not be approved for certification.  It is important to have all the 5 elements first before applying for a certification to prevent wasted time and effort.  The ISCOW website also has a button for consumer complaints.  This is where consumers can report any online merchant that has already been certified but has become sub-standard with regards to products and services.  ISCOW will immediately do the necessary actions to correct the merchant lest they want their certification reverted.\nwww.iscow.org</p>","image":{"available_sizes":[[[150,128],"assets/images/resized/0018/1685/181685v2-max-150x150.jpg"],[[250,214],"assets/images/resized/0018/1685/181685v2-max-250x250.jpg"],[[450,385],"assets/images/resized/0018/1685/181685v2-max-450x450.jpg"]],"attribution":"<p>Iscow</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.iscow.org","title":"Iscow Certifications Online Business"}]}