{"first_name":"Harasu","last_name":"Infotech","permalink":"harasu-infotech","crunchbase_url":"http://www.crunchbase.com/person/harasu-infotech","homepage_url":"http://www.harasuinfotech.com","birthplace":"bangalore","twitter_username":"harasuinfo","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1985,"born_month":2,"born_day":26,"tag_list":"","alias_list":null,"created_at":"Mon Sep 20 11:08:48 UTC 2010","updated_at":"Sat Oct 02 05:53:38 UTC 2010","overview":"<p>HARASU INFOTECH established in 2006, strives to exceed expectations for \nevery one of our clients, we provide best of breed BPO and ITES services to\nthe clients spread across India. \nOur offerings cover wide range of services:\nData Entry, Data entry outsourcing, Data Conversion and Data Processing.\nOur service always exceeds the clients’ satisfaction and provides value to their \nbusiness. Harasu Infotech is professionally managed by highly qualified \nmanagement team with vast industry experience and superior leadership skills.\nOur strategy for long-term success is &#8220;Organizational Excellence&#8221;. \nOrganizational Excellence means understanding our customers&#8217; business requirements,\n providing an uncompromising commitment to quality, being fast and flexible as an \nenterprise, and working with the best technologies and tools available to provide services \nquickly and efficiently. Offering more than services, we will make a difference by \nproviding high-quality innovative solutions that help our customers make a difference too. \nOur business approach is based on establishing long-term partnerships that encourage \nsuccess through mutual benefit. \nWe create value by providing quality services that are delivered \nreliably and cost effectively to enhance their ability to operate profitable businesses. We always work \nclosely with the clients to understand them better and to achieve the objectives of the clients. </p>\n\n<p>We offer wide range of Business process outsourcing BPO services to our \nclients. We offer complete operation support which includes supporting clients \non core and non core business activities. Our services helps our clients to focus \non their business and save operational cost.</p>\n\n<p>We offers:-\nBPO/IT/ITES \nData entry part time job \nData entry job works \nCorporate training academy\nTele-Marketing Services\nCustomised Man Power Requirements.\nBusiness Solutions\nComputer/UPS/ Electric Maintenance &amp; Servicing.</p>","image":{"available_sizes":[[[96,96],"assets/images/resized/0010/2332/102332v2-max-150x150.jpg"],[[96,96],"assets/images/resized/0010/2332/102332v2-max-250x250.jpg"],[[96,96],"assets/images/resized/0010/2332/102332v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}