{"first_name":"Hari","last_name":"Natarajan","permalink":"hari-natarajan","crunchbase_url":"http://www.crunchbase.com/person/hari-natarajan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unify²","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Oct 19 19:56:00 UTC 2012","updated_at":"Wed Nov 07 05:50:55 UTC 2012","overview":"<p>As Chief Sales &amp; Marketing Officer, Hari drives Unify2’s strategic mindshare, relevance, &amp; share-gain in principal global markets. Hari’s charter includes:-</p>\n\n<p>Developing Unify2&#8217;s vision around Unified Communications’ products, services and solutions portfolio, market presence &amp; brand towards realizing outstanding ROI &amp; transformational business impact for its enterprise customers.</p>\n\n<p>Driving global strategy for the envisioning, development and successful landing of Unify2&#8217;s industry leading PowerSeries’ on-premise and cloud (hosted) product portfolio which enhances the Unified Communications KPI, RoI, TCO, Service Availability and Assurance goals for the enterprise. </p>\n\n<p>Driving Unified Communications Industry specific transformational success stories leveraging communication enabled business process (CEBP) in Manufacturing, Healthcare, Retail, Financial, and Professional Services.</p>\n\n<p>Developing aligned global / regional Unified Communications alliances for Unify2 with other industry leaders that extend the frontiers of industry innovation, for the benefit of its enterprise customers.\nPrior to Unify2, Hari spent over 15 years pioneering and delivering transformative global technology alliances notably with SAP AG (Germany) Microsoft Corp. (Redmond, WA) and Digital Equipment Marlboro, MA. In these roles, Hari led his teams to achieve 58% WW market share, and US$200M P&amp;L respectively that defined the frontiers of industry accomplishments consistently.</p>\n\n<p>Hari’s global technology alliance philosophy leverages ‘build to market’ thinking, with a focus on driving alignment, mindshare, bold product / solution led selling bets, leveraging channels, industry specific strategies, regionalized investments, and strong enterprise CxO relationships.</p>\n\n<p>Hari has been pioneering business alliances &amp; new market creation in Information Technology services for the last 25 years with enterprise customer and alliance wins in several industries over a dozen countries spanning APAC, EMEA &amp; North America. His Fortune 500 enterprise customers include leaders in their respective industry verticals from the United States, Denmark, Netherlands, Germany, Switzerland, France &amp; Greater China region.</p>","image":{"available_sizes":[[[117,150],"assets/images/resized/0021/8924/218924v2-max-150x150.png"],[[196,250],"assets/images/resized/0021/8924/218924v2-max-250x250.png"],[[213,271],"assets/images/resized/0021/8924/218924v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Sales & Marketing ","firm":{"name":"Unify² (Unify Square) ","permalink":"unify-2","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0021/4911/214911v2-max-150x150.png"],[[250,74],"assets/images/resized/0021/4911/214911v2-max-250x250.png"],[[450,133],"assets/images/resized/0021/4911/214911v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}