{"first_name":"Harry","last_name":"Smith","permalink":"harry-smith","crunchbase_url":"http://www.crunchbase.com/person/harry-smith","homepage_url":"http://hireitpeople.com/","birthplace":"Washington DC","twitter_username":"hireitpeople","blog_url":"http://hireitpeople.com/jobs","blog_feed_url":"http://feeds.feedburner.com/HireItPeopleJobs","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"hire-programmers, hire-it-professionals, rent-coders","alias_list":null,"created_at":"Sun May 13 10:03:30 UTC 2012","updated_at":"Sat May 19 00:14:24 UTC 2012","overview":"<p>IT Staff Augmentation </p>\n\n<p>This is an ever changing IT Market Place - New Technologies, Mobile Apps, Social Media APIs, Web 2.0 with new internet domains from Apple to .Zebra. We understand that finding Top-Notch IT professionals for your changing needs can be very complicated. We are here to assist you in sourcing the top IT talent with our experience, knowledge, and social connections. Also, we are well connected to find the right talent next door.<br/>\n&gt; We serve Government agencies, Fortune 500 and leading mid-market companies across every industry\n&gt; Our candidate network includes thousands in our database and targeted networks including top social sites\n&gt; We gather information about your future hiring needs to perform a pro-active search, we mostly work with local candidates\n&gt; Our cutting edge recruitment tools help minimize the complexities of hiring and reaching the right talent\n&gt; We can provide experienced IT Professionals for your IT Projects covering most Technologies and roles Read More..\nOur Account managers and professional recruiters will communicate and work with your IT hiring managers. We use our databases, latest tools, and social media in finding and building relationships with top-notch IT professionals.\nWe leverage the strength of our Social Network and our Applicant tracking system, which alerts our candidates to open positions. Our database is very clean and we always keep it up to date and our processes are streamlined, for most job requirements, we match the right candidate in a matter of hours.\nAny time, any location, replacements, backfills, Emergency support\nWe provide On-Demand recruiting solutions to ease the process of recruiting and to provide you with the right IT Talent as and when you need them.\nWe have a pool of IT Professionals, both on our payroll and in our network. We have the ability to provide any type of IT talent under any business or project sitation. We can provide you with IT professionals under short notices (within 1-2 Hours) and over the weekends,simply send us a mail 24X7 and a Recruiter will respond immediately.</p>","image":{"available_sizes":[[[150,33],"assets/images/resized/0018/9516/189516v2-max-150x150.jpg"],[[250,56],"assets/images/resized/0018/9516/189516v2-max-250x250.jpg"],[[266,60],"assets/images/resized/0018/9516/189516v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}