{"first_name":"Harry","last_name":"Schultz","permalink":"harry-schultz","crunchbase_url":"http://www.crunchbase.com/person/harry-schultz","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Digital Reasoning Systems","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Mar 27 17:09:53 UTC 2009","updated_at":"Wed Apr 01 00:54:49 UTC 2009","overview":"<p>Harry Schultz serves as the Vice President of Product Development and Solutions for Digital Reasoning Systems. He has over 31 years of experience providing technology solutions in a variety of different industries. Most recently, Harry worked for an emergency management consulting company (IEM, Inc) as the Manager of the Federal Systems Development Division, creating custom automated task management systems for FEMA, and a grants management system and information portal for the US Army’s Chemical Stockpile Emergency Preparedness Program (managed by DHS). Harry began his career as a software engineer, developing software for telephone systems, process control and data acquisition systems in a refinery, and operating systems for Digital Equipment Corp (VMS). Harry has focused the last 15 years of his career on managing large-scale IT projects and software development groups, with emphasis on team building and developing the processes and environment necessary to support successful software development efforts.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Sr Vice President of Product Development and Solutions","firm":{"name":"Digital Reasoning Systems","permalink":"digital-reasoning-systems","type_of_entity":"company","image":{"available_sizes":[[[150,57],"assets/images/resized/0003/6861/36861v2-max-150x150.png"],[[200,77],"assets/images/resized/0003/6861/36861v2-max-250x250.png"],[[200,77],"assets/images/resized/0003/6861/36861v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}