{"first_name":"Harris","last_name":"Turner","permalink":"harris-turner","crunchbase_url":"http://www.crunchbase.com/person/harris-turner","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Sep 30 01:39:23 UTC 2011","updated_at":"Thu Oct 13 00:52:16 UTC 2011","overview":"<p>Mr. Turner brings to the BidPal team over thirty years experience in various industries, both in general management and sales leadership. Prior to co-founding BidPal, he launched a number of successful companies, including the Frequent Travel Marketing Association, a trade organization of airlines, hotels, and affiliates of frequent flier programs. In 1994 Turner built on that success when he entered the enterprise software arena and designed and launched STATUS - a product that, for the first time, integrated the legacy systems of airlines and hotels into the Internet, allowing them to deliver their frequent flier account statements online. Utilized initially by United Airlines and Marriott International, in its first year STATUS was delivering statements for every major US carrier and hotel group, and was used by more than 800,000 individuals. After successfully selling the company to a New York corporation, Mr. Turner turned his attention to aggregation technology, marketing successful products through DeskPort Technologies to the financial, travel, and fantasy sports industries. </p>\n\n<p>As a frequent participant in charitable fundraisers, Turner immediately grasped a friend&#8217;s concept for BidPal and took the leading role in bringing it to fruition. His experience in sales &amp; marketing, software development, and personnel and event management all contribute to his day to day role of managing various areas of company operations. He holds a BA degree from Duke University.</p>","image":{"available_sizes":[[[90,114],"assets/images/resized/0015/7887/157887v1-max-150x150.png"],[[90,114],"assets/images/resized/0015/7887/157887v1-max-250x250.png"],[[90,114],"assets/images/resized/0015/7887/157887v1-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"Bachelor of Arts","subject":"","institution":"Duke University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President, Co-Founder","firm":{"name":"BidPal Network","permalink":"bidpal-network","type_of_entity":"company","image":{"available_sizes":[[[150,76],"assets/images/resized/0015/6165/156165v1-max-150x150.png"],[[215,110],"assets/images/resized/0015/6165/156165v1-max-250x250.png"],[[215,110],"assets/images/resized/0015/6165/156165v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}