{"first_name":"Harris","last_name":"Samaras","permalink":"harris-samaras","crunchbase_url":"http://www.crunchbase.com/person/harris-samaras","homepage_url":"http://www.pytheas.net","birthplace":"Nicosia, Cyprus","twitter_username":"","blog_url":"http://pytheasnet.blogspot.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1963,"born_month":3,"born_day":22,"tag_list":"pytheas, investment-management, equity-finance, business-development, cyprus, capital-raising, investment-banking, economics, geopolitics, emerging-markets, harris-samaras, asset-management, money-manager, corporate-finance, risk-management","alias_list":null,"created_at":"Wed Nov 16 07:18:04 UTC 2011","updated_at":"Tue Sep 18 20:40:05 UTC 2012","overview":"<p>An Economist and presently the Chairman &amp; Group CEO of Pytheas, an international investment management organization, Harris has also worked with the Bank of America Group, Thomson Financial BankWatch, and Moody&#8217;s Investors Service. His expertise lies primarily in the areas of investment and corporate banking, private equity and finance, risk management and business development. His research and extensive publications in these areas range across practice rather than theory, economic and business thought, entrepreneurship and geopolitics.</p>\n\n<p>He has been an adviser to various governments, central banks, financial institutions, and other corporates and has been a member of the board of directors of multinational organizations.</p>\n\n<p>Harris&#8217; extensive and in depth knowledge of the emerging markets of Central-Eastern Europe, MENA, Gulf, and Africa is complimented by his diverse expertise in industries such are Banking, Real Estate &amp; Construction, Hospitality, Minerals &amp; Mining, Agriculture, Fisheries, Environment &amp; Alternative Energy Sources, Energy, Satellite Telecommunications and Shipping.</p>","image":{"available_sizes":[[[135,150],"assets/images/resized/0016/3136/163136v4-max-150x150.jpg"],[[226,250],"assets/images/resized/0016/3136/163136v4-max-250x250.jpg"],[[238,263],"assets/images/resized/0016/3136/163136v4-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}