{"first_name":"Harshal","last_name":"Sisodia","permalink":"harshal-sisodia","crunchbase_url":"http://www.crunchbase.com/person/harshal-sisodia","homepage_url":"","birthplace":"Baltimore","twitter_username":"Superharsh","blog_url":"","blog_feed_url":"","affiliation_name":"Apptitude","born_year":1978,"born_month":3,"born_day":18,"tag_list":"","alias_list":null,"created_at":"Wed Sep 15 21:44:57 UTC 2010","updated_at":"Mon Sep 27 18:13:09 UTC 2010","overview":"<p>Harshal C. Sisodia – known as Harsh to friends and family – is an award-winning executive creative producer and a proven leader in integrated marketing. In his 10+ years of working in the industry, he has managed several high profile projects (from conception and execution through to completion) and been recognized for his groundbreaking work with some of the world’s most powerful brands. </p>\n\n<p>Initially a producer for R/GA followed by roles as Sr. Producer for Crispin Porter + Bogusky and, most recently, Executive Producer at TeamOne a division of Saatchi and Saatchi, Harshal garnered notice for pioneering work in online video production and TV concepts for the Cannes Lion-winning ‘NikeGridiron’. He has also been credited and featured for his work on the ‘Sublymonal’ campaign for Sprite as well as the most successful campaign in Burger King’s history, ‘Whopper Freakout’. Harshal, in conjunction with another broadcast producer, was the lead for both TV and interactive development for this campaign. The direct success of the campaign has been an increase in whopper sales at Burger King; it has also been marked as a shift in the online medium from experiential destinations to content and storytelling for brands online. Harshal also served as the leader to an integrated group that specialized in experiential and interactive consumer touch points within CP+B.  </p>","image":{"available_sizes":[[[138,150],"assets/images/resized/0010/1906/101906v2-max-150x150.jpg"],[[230,250],"assets/images/resized/0010/1906/101906v2-max-250x250.jpg"],[[415,450],"assets/images/resized/0010/1906/101906v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Creative Officer","firm":{"name":"HS3 / HSthree, Inc.","permalink":"hs3-hsthree-inc","type_of_entity":"company","image":null}},{"is_past":false,"title":"Investor / Creative Advisor","firm":{"name":"Apptitude","permalink":"apptitude","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}