{"first_name":"Harvey A.","last_name":"Gilbert","permalink":"harvey-a-gilbert","crunchbase_url":"http://www.crunchbase.com/person/harvey-a-gilbert","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Gilbert Guide","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Sep 11 23:24:39 UTC 2009","updated_at":"Wed Feb 09 00:21:39 UTC 2011","overview":"<p>Harvey Gilbert is a co-founder in Gilbert Guide. He also acts as a Medical Director for the website, providing in-depth medical articles for readers as well as overseeing all medical aspects to the business.</p>\n\n<p>Harvey Gilbert, MD, is a radiation oncologist with over thirty-five years of professional experience in the medical field, working with cancer patients stricken with life-changing illnesses. Dr. Gilbert has edited fourteen medical textbooks and co-authored forty papers in the field of oncology. He founded one of the first inpatient hospices in California, and started three outpatient cancer centers. Dr. Gilbert currently serves as an advisor to multiple hospices and in-home care agencies and is the medical director of the Ben Schaffer Cancer Institute in Lodi, California.\nDr. Gilbert received his medical degree from the University of Missouri Medical School in 1965. He then moved to the Bay Area, where he interned at Oakland Naval Hospital and was on active duty in the U.S. Navy from 1965 to 1969. Dr. Gilbert completed his residency in the Radiation Oncology department at Mt. Zion Hospital in San Francisco as well as at UCLA Medical Center and Hospital.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Gilbert Guide","permalink":"gilbert-guide","type_of_entity":"company","image":{"available_sizes":[[[150,75],"assets/images/resized/0005/9548/59548v2-max-150x150.jpg"],[[216,108],"assets/images/resized/0005/9548/59548v2-max-250x250.jpg"],[[216,108],"assets/images/resized/0005/9548/59548v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}