{"first_name":"Hasmukh","last_name":"Solanki","permalink":"hasmukh-solanki","crunchbase_url":"http://www.crunchbase.com/person/hasmukh-solanki","homepage_url":"http://www.nilkanthengg.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"concrete-machines, concrete-mixing-equipments, concrete-mixing-machines, concrete-machine-manufacturers, concrete-machines-suppliers, concrete-mixing-equipments-exporters, concrete-mixing-machines-manufacturers, concrete-machine-manufacturers-suppliers, c","alias_list":null,"created_at":"Thu May 10 06:16:36 UTC 2012","updated_at":"Fri May 11 03:26:12 UTC 2012","overview":"<p>Nilkanth Engineering Works</p>\n\n<p>Nilkanth Engineering was established in 1986 by Shri Hasmukh Bhai who had powerful imaginative strength, dreams and affluent skills to fulfill them. He dedicated over 25 years in the field of ready mix concrete machine manufacturing. He relentlessly undertook research and developed concrete mixing equipments, which are globally recognised for their quality and services. With a rich experience in designing and developing customized engineering solutions with latest technology, today this company is one of the leader in manufacturing of construction machineries. Engineered to precision, our wide array of construction machineries which includes concrete batching plants, concrete mixers, transit mixers, asphalt mixing plants, reversible concrete mixers, mobile concrete mixing machines and othe construction machineries. We offer quality turnkey projects services for engineering industry.</p>\n\n<p>Quality for us is not destination but a never ending journey. We lay special emphasis on quality and ensure that quality polices are implemented at each and every stage of production. In order to ensure superior quality of products, we carry out several quality control tests and inspection during various stages of production and prior to the delivery. All our products comply with international standards of quality. Our products are robust, easy to use and maintenance free.</p>\n\n<p>We have been able to enhance the quality of our products by the use of the most sophisticated technologies and experienced workforce. In an endeavor to complete customer satisfaction, we aspire to go beyond the expectations of our customers in terms of quality.</p>\n\n<p>Telephone:  +(91)-(79)-25835553 </p>","image":{"available_sizes":[[[150,82],"assets/images/resized/0018/8829/188829v2-max-150x150.jpg"],[[200,110],"assets/images/resized/0018/8829/188829v2-max-250x250.jpg"],[[200,110],"assets/images/resized/0018/8829/188829v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}