{"first_name":"Heath","last_name":"Ahrens","permalink":"heath-ahrens","crunchbase_url":"http://www.crunchbase.com/person/heath-ahrens","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"iSpeech","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Dec 17 17:03:03 UTC 2010","updated_at":"Sun Jul 08 03:43:53 UTC 2012","overview":"<p>Heath Ahrens is the founder and CEO of iSpeech, a text-to-speech (TTS) and speech recognition (ASR) provider.  In 2009, Ahrens pioneered a new solution to distracted driving, DriveSafe.ly®, an award winning mobile app downloaded over 20 million times.  DriveSafe.ly® reads text messages and emails aloud in real time and allows voice response, hands-free.  In addition to winning the 2011 Consumer Electronics Show app competition, DriveSafe.ly® won the 2010 Mashable Award for Best Mobile App.  The leading distracted driving application has been written about in Consumer Reports, Wall Street Journal, major tech blogs such as TechCrunch and VentureBeat and featured on CNN, CNET, ABC, and FOX.  To date, iSpeech apps have received over 30 million downloads.</p>\n\n<p>In 2010, Heath was named to NJBIZ’s “40 under 40”.  Ahrens has spoken about speech technology and distracted driving at SpeechTEK 2011, CTIA 2010, Mobile Voice Conference 2010 and 2011 and TEDx.  He most recently gave the keynote address at the NJTC 2011 Regional Commercialization Conference. Ahrens continues to grow iSpeech®, delivering human quality speech and recognition to developers and businesses through simple APIs and SDKs.  The iSpeech Cloud has been used over a billion times. Bringing speech everywhere through partnerships with developers and Fortune companies, iSpeech’s mission remains: “Speech-enable the Web and the world.”  </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder and CEO","firm":{"name":"iSpeech","permalink":"ispeech","type_of_entity":"company","image":{"available_sizes":[[[150,55],"assets/images/resized/0010/4601/104601v6-max-150x150.png"],[[250,92],"assets/images/resized/0010/4601/104601v6-max-250x250.png"],[[450,165],"assets/images/resized/0010/4601/104601v6-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"CEO","firm":{"name":"iSpeech.Me","permalink":"ispeech-me","type_of_entity":"company","image":{"available_sizes":[[[150,41],"assets/images/resized/0019/9276/199276v2-max-150x150.png"],[[250,69],"assets/images/resized/0019/9276/199276v2-max-250x250.png"],[[450,124],"assets/images/resized/0019/9276/199276v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}