{"first_name":"Heidi","last_name":"Sinclair","permalink":"heidi-sinclair","crunchbase_url":"http://www.crunchbase.com/person/heidi-sinclair","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Weber Shandwick","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 28 20:39:39 UTC 2011","updated_at":"Thu Aug 18 17:32:38 UTC 2011","overview":"<p>Heidi Sinclair is a 30-year communications and marketing veteran who combines strategic consulting with operational strength. She recently joined Weber Shandwick as President of its Global Technology Practice overseeing the firm’s work with clients including Samsung, Motorola, Juniper, Hewlett-Packard and Microsoft. Most recently, she was a ran her own branding, communications and philanthropic consulting firm, Heidi Sinclair &amp; Co. Her work included advising Richemont on two CEO transitions and its anti-counterfeiting efforts, Microsoft on an anti-trust competitive campaign and developing the philanthropic strategy for Will &amp; Jada Pinkett Smith.\nPreviously, she served as Chief Communications Officer for the Bill &amp; Melinda Gates Foundation, where she built the marketing, communications and content function. She also has been the personal advisor to Bill and Melinda Gates on all communications matters.<br/>\nPrior to the foundation, Heidi was CEO for Burson-Marsteller EMEA with oversight for over 60 operations across the region. Before, Heidi was Global Chairman of Technology for Burson-Marsteller, where she spearheaded the work of a global team working on technology clients in over fifty countries. She has been the client leader for several of Burson-Marsteller’s largest clients including SAP, HP, Sun and Apple.\nHeidi is well known as a strategist, corporate executive and an entrepreneur. She founded two companies in the media and communications space, the first at age 23.  She is on the board of several venture-backed consumer companies and frequently writes and lectures about branding and the future of media, and is a regular commentator on CNBC and CNN and authors a blog for the Huffington Post.  She is also an award winning poet. Heidi graduated from Stanford University.  After living in many parts of the world, she has returned to live in her native Seattle.    </p>","image":{"available_sizes":[[[140,150],"assets/images/resized/0014/9748/149748v2-max-150x150.jpg"],[[234,250],"assets/images/resized/0014/9748/149748v2-max-250x250.jpg"],[[401,428],"assets/images/resized/0014/9748/149748v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President, Global Technology","firm":{"name":"Weber Shandwick","permalink":"weber-shandwick","type_of_entity":"company","image":{"available_sizes":[[[150,29],"assets/images/resized/0014/1592/141592v2-max-150x150.jpg"],[[250,48],"assets/images/resized/0014/1592/141592v2-max-250x250.jpg"],[[450,87],"assets/images/resized/0014/1592/141592v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.huffingtonpost.com/heidi-sinclair","title":""}]}