{"first_name":"Heikki","last_name":"Mäkijärvi","permalink":"heikki-mkijrvi","crunchbase_url":"http://www.crunchbase.com/person/heikki-mkijrvi","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Feb 08 03:39:00 UTC 2008","updated_at":"Fri Jun 27 17:46:58 UTC 2008","overview":"<p>Heikki Makijarvi has worked in telecommunications and networking industry since mid 1980&#8217;s.</p>\n\n<p>Prior to joining Accel, Heikki worked with Cisco Systems for over 3 years. In 2000 and 2001, he worked in Business Development and Strategic Alliances team for Cisco Systems Europe, Middle East and Africa. As a Business Development Manager, he led the investment and M&amp;A activities in Mobile and Wireless segment, and was a member of global new market and technology development team. Heikki was active on the board of Digia, a leading Symbian competence center and a developer of technology and software products for mobile phones.</p>\n\n<p>Prior to this assignment, Heikki was a member of management team at Cisco Systems Finland and Baltics. He established and led the technical teams supporting Cisco&#8217;s enterprise and service provider field operations.</p>\n\n<p>Before Cisco Systems, Heikki worked with Nokia. Over his 15 years with Nokia, he worked in R&amp;D organization and held a variety of management positions in Nokia&#8217;s global product marketing and business development organizations.</p>\n\n<p>In 1994 until 1995, Heikki was a Business Development Manager in Nokia Access Systems. He led the team responsible for strategy and concept development, partnership strategy and alliance management activities. His team was responsible for Strategic Partnership between Nokia and Cisco Systems, Heikki was also a member of the team which established Nokia&#8217;s development centre in Boston, M.A, USA.</p>\n\n<p>In 1996 he moved to Germany to lead global Operator Data Networking business for Nokia. He built the team to support sales and marketing activities in Europe and Asia. From the beginning of 1997 Heikki worked as General Manager for System Marketing and Sales in Germany and Austria. He was responsible for Nokia&#8217;s Wireless and Wireline Data Systems Sales and Marketing for service providers and operators.</p>\n\n<p>Heikki represented Nokia in CCITT Study Group XVII, ETSI Strategic Review Committee VII, Frame Relay Forum and ATM Forum. He has been an active speaker in technology conferences in Scandinavia, UK and Australia.</p>\n\n<p>Heikki joined Nokia as a R&amp;D engineer. As a Product Manager and Product Marketing Manager in Nokia Datacommunications, he was responsible for product line strategies and product marketing for enterprise and operator market segments in Europe and Far East. In 1991 until 1993, Heikki worked as a System Marketing Manager in Nokia Transmission Systems. He led the product management team responsible for Nokia&#8217;s TDM, Frame Relay and ATM concept, a data networking solution for service providers. Heikki was a member of the new business strategy team of Nokia Group in 1994. </p>","image":{"available_sizes":[[[121,150],"assets/images/resized/0001/0685/10685v1-max-150x150.jpg"],[[202,250],"assets/images/resized/0001/0685/10685v1-max-250x250.jpg"],[[208,257],"assets/images/resized/0001/0685/10685v1-max-450x450.jpg"]],"attribution":null},"degrees":[],"relationships":[{"is_past":true,"title":"VP, Business Development","firm":{"name":"Openwave","permalink":"openwave","type_of_entity":"company","image":{"available_sizes":[[[134,32],"assets/images/resized/0003/9432/39432v1-max-150x150.png"],[[134,32],"assets/images/resized/0003/9432/39432v1-max-250x250.png"],[[134,32],"assets/images/resized/0003/9432/39432v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Partner","firm":{"name":"Accel Partners","permalink":"accel-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,54],"assets/images/resized/0001/0604/10604v3-max-150x150.jpg"],[[250,90],"assets/images/resized/0001/0604/10604v3-max-250x250.jpg"],[[450,162],"assets/images/resized/0001/0604/10604v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}