{"first_name":"Hello-","last_name":"Hello","permalink":"hello-hello","crunchbase_url":"http://www.crunchbase.com/person/hello-hello","homepage_url":"http://www.hello-hello.com","birthplace":"Washington, DC","twitter_username":"HelloHelloLLC","blog_url":"http://hello-hello.com/blog/","blog_feed_url":"http://hello-hello.com/blog/","affiliation_name":"Unaffiliated","born_year":1978,"born_month":9,"born_day":2,"tag_list":"hello-hello-com, language-learning-company, spanish, french, italian","alias_list":null,"created_at":"Tue Jun 15 12:44:56 UTC 2010","updated_at":"Thu Jul 05 19:28:14 UTC 2012","overview":"<p>Hello-Hello is an innovative language learning company that offers state-of-the-art online and mobile courses. Hello-Hello couples social networking with language learning which allows users to interact with native speakers around the world. </p>\n\n<p>Hello-Hello offers language learning apps for the iPad, iPhone, Android-based devices and Blackberry.</p>\n\n<p>Hello-Hello launched the world&#8217;s first language learning app designed for the iPad, being part of the iPad app store Grand Opening as well as the world&#8217;s first language learning app combined with social networking.</p>\n\n<p>Our courses were developed in collaboration with The American Council on the Teaching of Foreign Languages (ACTFL), which is the largest association of teachers and administrators of all languages at all levels, serving more than 12,000 educators. For more information, please visit their website at www.actfl.org. </p>\n\n<p>With Hello-Hello.com you can: </p>\n\n<p>LEARN a new language anytime, anywhere with online lessons that develop all the skills you need. </p>\n\n<p>TEACH other members your language and learn from native speakers by submitting exercises for them to review as well as providing feedback on their exercises. </p>\n\n<p>COMMUNICATE with native speakers through audio, video and text with our live Chat to practice the language and make friends all over the world! </p>","image":{"available_sizes":[[[150,125],"assets/images/resized/0009/0706/90706v2-max-150x150.jpg"],[[250,208],"assets/images/resized/0009/0706/90706v2-max-250x250.jpg"],[[392,327],"assets/images/resized/0009/0706/90706v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}