{"first_name":"Hemanshu","last_name":"Nigam","permalink":"hemanshu-nigam","crunchbase_url":"http://www.crunchbase.com/person/hemanshu-nigam","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":"","created_at":"Thu May 14 19:01:25 UTC 2009","updated_at":"Wed Apr 21 18:33:28 UTC 2010","overview":"<p>Hemanshu Nigam serves as the first Chief Security Officer for News Corp.’s Internet division, Fox Interactive Media (FIM), where he oversees all safety, security, privacy, education, and law enforcement programs for MySpace and other FIM properties including IGN and Photobucket.</p>\n\n<p>Hired in May 2006, Nigam oversees globally all safety teams, law enforcement relations, school and education programs, partnerships with NGOs, as well as the development of safety and security features and enhancements on MySpace and other FIM properties. Nigam has championed key safety milestones for MySpace including the launch of Sentinel SAFE, a technology that allows the company to identify and remove registered sex offenders from its website.</p>\n\n<p>On the security front, Nigam oversees the implementation of strong application security as well as incident response and investigations in the virus, worm, and phishing arenas. Nigam and his security team work daily with lawmakers and law enforcement agencies at every level to prosecute those violating the security terms of FIM properties, recently obtaining a landmark $230 million judgment under the CAN-SPAM Act against two notorious spammers.</p>\n\n<p>A veteran in online security, Nigam brings more than 18 years of experience in both private industry and law enforcement fields.  From 1997 to 2000, Nigam served as a federal prosecutor against Internet child exploitation and computer crime for the U.S. Department of Justice, as an advisor to a Congressional commission on online child safety, and an advisor to the White House on cyberstalking.</p>\n\n<p>Previously from 2002 to 2006, Nigam served in various strategic roles inside Microsoft Corporation as a Corporate Attorney, Director of Business Development and Strategy, and Director of Consumer Security Outreach &amp; Child Safe Computing where he was responsible for driving consumer security outreach and child safe computing strategies.  During that time, he led a cross-company child safety initiative designed to build a holistic approach to child safe computing throughout Microsoft products, services and programs.  He was also responsible for implementing the virus enforcement strategy developing and executing the company’s landmark Anti-Virus Reward Program.</p>\n\n<p>Prior to joining Microsoft, Nigam served as the first Vice President of Worldwide Internet Enforcement at the Motion Picture Association of America from 2000 to 2002 where he spearheaded a global strategy to combat online motion picture piracy for the major Hollywood studios. </p>\n\n<p>Nigam also served as deputy district attorney in Los Angeles County from 1990 to 1997 where he specialized in child exploitation and rape prosecutions.</p>\n\n<p>Nigam serves on the Board of the Family Online Safety Institute (FOSI) and on the Advisory Board of Enough is Enough and The International Association of Internet Hotlines (INHOPE).</p>\n\n<p>Nigam earned his juris doctorate from Boston University School of Law and his bachelor’s degree in political theory from Wesleyan University. </p>\n\n<p>Source: <a href=\"http://blogs.myspace.com/hemanshunigam\" title=\"Hemu on Myspace\" rel=\"nofollow\">Hemu on Myspace</a></p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0004/4127/44127v3-max-150x150.jpg"],[[166,250],"assets/images/resized/0004/4127/44127v3-max-250x250.jpg"],[[192,288],"assets/images/resized/0004/4127/44127v3-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Security Advisor","firm":{"name":"News Corporation","permalink":"newscorporation","type_of_entity":"company","image":{"available_sizes":[[[150,24],"assets/images/resized/0001/5110/15110v1-max-150x150.jpg"],[[250,41],"assets/images/resized/0001/5110/15110v1-max-250x250.jpg"],[[250,41],"assets/images/resized/0001/5110/15110v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Chief Security Officer","firm":{"name":"MySpace","permalink":"myspace","type_of_entity":"company","image":{"available_sizes":[[[150,31],"assets/images/resized/0000/4414/4414v80-max-150x150.jpg"],[[250,52],"assets/images/resized/0000/4414/4414v80-max-250x250.jpg"],[[450,94],"assets/images/resized/0000/4414/4414v80-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Chief Security Officer","firm":{"name":"News Corporation","permalink":"newscorporation","type_of_entity":"company","image":{"available_sizes":[[[150,24],"assets/images/resized/0001/5110/15110v1-max-150x150.jpg"],[[250,41],"assets/images/resized/0001/5110/15110v1-max-250x250.jpg"],[[250,41],"assets/images/resized/0001/5110/15110v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}