{"first_name":"Hendrik","last_name":"Speck","permalink":"hendrik-speck","crunchbase_url":"http://www.crunchbase.com/person/hendrik-speck","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 28 20:54:16 UTC 2009","updated_at":"Wed Jan 28 20:54:16 UTC 2009","overview":"<p>Hendrik Speck is a Professor of Digital Media at the University of Applied Sciences Kaiserslautern / Department of Computer Sciences/ Interactive Media and head of the Information Architecture/ Search Engine Laboratory. He taught and lectured at the European Graduate School (Ada Byron Chair), New School for Social Research (New York), Columbia University (New York), Hochschule der Medien Stuttgart, International School of New Medial (Lübeck), and University of Applied Sciences Kaiserslautern.</p>\n\n<p>Professor Speck, based in New York and Germany, is a regular speaker and conference panelist; he is the author of many articles and (co)authored several books including Medien auf Abruf - Folgen der Individualisierung für die Kommunikationsgesellschaft. His work focuses on media theory and philosophy, information operations and systems, online marketing, media management, intellectual property, open source, e-Learning, cyberwar, netwar, ethical, social and legal implications and limitations.</p>\n\n<p>He has been working as an E-commerce consultant and was appointed CIO, Assistant Director and Ada Byron Chair of the Media and Communications department of the European Graduate School. This position includes the responsibility for the development of all web activities, policies and associations. Prof. Speck has designed distance and elearning systems, has developed online/viral marketing strategies and has worked on information architecture projects for governments, corporate clients and academic institutions. Professor Hendrik Speck is working as a consultant for Quaero and Theseus, exploring the next generation of intelligent search, information retrieval and visualization systems for the German Federal Ministry of Economics and Technology. Professor Speck is a member of the advisory council of the Search Marketing Expo - SMX Munich, a Fulbright and DAAD Scholar, and recipient of several other scholarships from Heinrich Böll Stiftung, New School University (New York), and European Graduate School. </p>","image":{"available_sizes":[[[96,150],"assets/images/resized/0003/5117/35117v1-max-150x150.jpg"],[[160,250],"assets/images/resized/0003/5117/35117v1-max-250x250.jpg"],[[240,373],"assets/images/resized/0003/5117/35117v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}