{"first_name":"Henry","last_name":"Baylis MD","permalink":"henry-baylis-md","crunchbase_url":"http://www.crunchbase.com/person/henry-baylis-md","homepage_url":"http://www.henrybaylismd.com/","birthplace":"","twitter_username":"HenryBaylisMD","blog_url":"http://henrybaylismd.tumblr.com/","blog_feed_url":"http://henrybaylismd.tumblr.com/rss","affiliation_name":"Henry Baylis MD","born_year":1950,"born_month":1,"born_day":19,"tag_list":"henry-baylis-md","alias_list":null,"created_at":"Sat Oct 06 01:50:27 UTC 2012","updated_at":"Mon Oct 29 01:02:10 UTC 2012","overview":"<p>Henry Baylis MD aims to reduce sagging fullness and or sagging skin to produce a clean or refreshed look that. It exposes the upper eyelid to allow the effective use of makeup. It goes without saying this is performed in such a way as to avoid a &#8220;surgical look&#8221;. This is one of the few facial procedures where I can illustrate the post operative result to the patient at the time of the consultation.</p>\n\n<p>Cosmetic surgery of the lower eyelid reduces fatty bulges and improves skin folds and skin texture without a skin incision. This is a procedure that I helped pioneer, but is used nowadays by most surgeons that focus on cosmetic eyelid surgery.</p>\n\n<p>Henry Baylis MD is from Michigan and graduated from University of Michigan Medical School. Henry Baylis MD first did his ophthalmology residency at UC San Francisco. Henry Baylis MD then went to be one of the first ophthalmologists to do additional training in the field of oculoplastic surgery in New York City. After Henry Baylis MD joining the Air Force, he opened a practice in Los Angeles. At the time there were only five or ten ophthalmologists in the USA. There are now 600 or 700 ophthalmologists that are in this field now called oculofacial plastic surgery. About one of every three or four in this speciality have been trained by Henry Baylis MD or one of his students. Henry Baylis MD started the division of oculoplastic surgery at UCLA in 1974 which has produced well over 100 graduates including many foreign physicians. Henry Baylis MD publications include chapters in many textbooks and about 100 articles in peer review journals. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Henry Baylis MD","firm":{"name":"Henry Baylis MD","permalink":"henry-baylis-md","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://twitter.com/HenryBaylisMD","title":"Twitter"},{"external_url":"http://henrybaylismd.tumblr.com/","title":"Tumblr"},{"external_url":"http://endorse.me/henrybaylismd/me","title":"Endorse"},{"external_url":"http://henrybaylismd.multiply.com/","title":"Multiply"},{"external_url":"http://www.flickr.com/photos/henrybaylismd/","title":"Flickr"},{"external_url":"https://foursquare.com/henrybaylismd","title":"Foursquare"}]}