{"first_name":"Herbert","last_name":"Bay","permalink":"herbert-bay","crunchbase_url":"http://www.crunchbase.com/person/herbert-bay","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"kooaba","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Oct 09 07:57:33 UTC 2008","updated_at":"Sun Nov 16 01:37:37 UTC 2008","overview":"<p>Herbert Bay received his PhD from ETH Zurich in 2006. He graduated at the Swiss Federal Institute of Technology in Lausanne (EPFL) in 2002. His Master studies in Micro-engineering, which resulted in several scientific publications, got enriched by an exchange year in Montreal, Canada where he first discovered his interest for Computer Vision. Already a month before his final examinations, he started working at IBM Switzerland in Zurich, where he enjoyed best training in Project Management, Sales and Communication. After the training phase, he was helping customers to address their critical business challenges for e-learning projects as a Engagement Manager. Moreover, he was teaching Communication courses for IBM internals in Zurich and Geneva. After a while, he decided to undertake a PhD at the Computer Vision Lab of ETH Zurich in 2003. During his PhD studies he published numerous scientific publications and two patents. After his PhD in 2006, he started the company kooaba. During that time, Herbert Bay followed an entrepreneurial workshop at Babson College in Boston MA. Herbert Bay is fond of sailing, arts and archeology, among many other things.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"co-founder & CEO","firm":{"name":"kooaba","permalink":"kooaba","type_of_entity":"company","image":{"available_sizes":[[[150,28],"assets/images/resized/0003/5383/35383v4-max-150x150.png"],[[250,47],"assets/images/resized/0003/5383/35383v4-max-250x250.png"],[[450,85],"assets/images/resized/0003/5383/35383v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}