{"first_name":"Hermann","last_name":"Hauser","permalink":"hermann-hauser","crunchbase_url":"http://www.crunchbase.com/person/hermann-hauser","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jul 11 12:21:00 UTC 2011","updated_at":"Wed Nov 16 06:00:41 UTC 2011","overview":"<p>Hermann co-founded Amadeus Capital Partners in 1997 with Anne Glover and Peter Wynn. In his long and successful history as an entrepreneur and venture capitalist, he has founded or co-founded companies in a wide range of technology sectors. These include Acorn Computers, Active Book Company, Virata, Net Products, NetChannel, and Cambridge Network Limited. He was a founder director of IQ (Bio), IXI Limited, Vocalis, SynGenix, Advanced Displays Limited, Electronic Share Information Limited and E*Trade UK.</p>\n\n<p>At Amadeus Hermann has been a non-executive director of many investee companies including: CSR, which provides single chip wireless solutions supporting communications over short-range radio links and which achieved a successful IPO in 2005; Entropic Research Laboratory, a company that developed voice recognition software which became the voice recogniser in Microsoft Word when the company was sold to Microsoft in 1999; and Solexa, which developed ultra-high throughput DNA sequencing technology and was acquired by Illumina in 2007. He is also a non-executive director: of Plastic Logic, which has developed a process for producing flexible plastic transistors for use in computer displays; Icera, which is developing wireless soft modem platforms for mobile phones and wireless terminals; and XMOS, a company that is revolutionising re-configurable silicon chips</p>\n\n<p>Hermann holds an MA in Physics from Vienna University and a PhD in Physics from the Cavendish Laboratory at King&#8217;s College, Cambridge. He is a Fellow of the Institute of Physics and of the Royal Academy of Engineering and an Honorary Fellow of King&#8217;s College, Cambridge. Hermann holds honorary doctorates from the Universities of Bath, Loughborough and from Anglia Polytechnic, and was awarded an Honorary CBE for ‘innovative service to the UK enterprise sector’ in 2001. In 2004, he was made a member of the Government’s Council for Science &amp; Technology.</p>\n\n<p>Austrian by birth, Hermann speaks German, English, Italian and French.</p>","image":null,"degrees":[],"relationships":[],"investments":[{"funding_round":{"round_code":"a","source_url":"http://techcrunch.com/2011/07/11/datasift-6-million/","source_description":"TechCrunch","raised_amount":6000000,"raised_currency_code":"USD","funded_year":2011,"funded_month":7,"funded_day":11,"company":{"name":"DataSift","permalink":"datasift","image":{"available_sizes":[[[150,42],"assets/images/resized/0010/2730/102730v1-max-150x150.jpg"],[[250,70],"assets/images/resized/0010/2730/102730v1-max-250x250.jpg"],[[400,113],"assets/images/resized/0010/2730/102730v1-max-450x450.jpg"]],"attribution":null}}}}],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}