{"first_name":"Hermann","last_name":"Kratochwill","permalink":"hermann-kratochwill","crunchbase_url":"http://www.crunchbase.com/person/hermann-kratochwill","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"myKFIT","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Nov 25 12:29:57 UTC 2012","updated_at":"Thu Nov 29 18:47:38 UTC 2012","overview":"<p>Hermann Kratochwill is known to many as HK, an entrepreneur, athlete, a music aficionado, globetrotter, food lover with a pure passion for technology, philanthropy and social media. He absolutely loves a good challenge, combining these roles throughout his lifetime has resulted in an epic and challenging journey. He identifies himself with a quote from Vince Lombardi -\n&#8220;I firmly believe that any man’s finest hour, the greatest fulfillment of all that he holds dear, is that moment when he has worked his heart out in a good cause and lies exhausted on the field of battle – victorious.&#8221;</p>\n\n<p>BACKGROUND\nHe comes from an Austro-American background, growing up trilingual and always seeking to fulfill his desires by doing what he loves, with near perfectionism and passion. From a young age he has always been actively involved in a multitude of sports from soccer to american football, martial arts (Black Belt 1 Dan – Shodon) to Track and Field. At the age of 14, he completed his first of many marathons (42.195km) and shortly thereafter his first ironman triathlon. He has competed in many sporting events including the World Junior Championships in Athletics and has held several Austrian records in the 200m, 400m and 1500m distances.\nAt the age of 17, after graduating high school before his mandatory military service he began his first company, SilverStar, traveling to the likes of Australia and Singapore. Shortly thereafter founding the K Lifestyle Group, a multimedia and entertainment company. Through his passion to sports he began developing the KFit concept, a fitness routine aimed at increasing strength, agility, endurance and mind used at health clubs, personal coaching and numerous athletic teams. At 18, he began coaching basketball (including his younger brother, a top former Austrian talent) and soccer teams and provide guidance and mentoring.\nHe enjoys traveling in his spare time, writing and producing music, has started Twenty Two Entertainment, performing in front of packed crowds of thousands at festivals and concerts. He absolutely love all types of culinary cousins, and began developing a passion for technology and philanthropy at an early age.</p>\n\n<p>He holds a Bachelors in Business Administration along side numerous certifications ranging from Certified Personal Trainer to Project Management, continuously seeking knowledge through personal development. He has spoken and continues to speak in front of packed crowds, university students and in the business environment.</p>\n\n<p>He is currently engaged in the corporate environment as a manager of an operational team, aside from reestablishing his own brand, the K Lifestyle Group, enlisted in advancing his education through a Master of Science in Nutrition and Exercise. He has had several articles published and plans to release his debut book in 2013 and as most online writers he harbors the dream of becoming an A-list blogger.\nLife to HK is a mindset, soak in your surroundings the best you can and never stop engaging. He believes that life is a fine balance between ambition, working hard and spending time on the important things without having to compromise on ones goals.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0022/2444/222444v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0022/2444/222444v2-max-250x250.jpg"],[[299,450],"assets/images/resized/0022/2444/222444v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"myKFIT","permalink":"mykfit","type_of_entity":"company","image":{"available_sizes":[[[130,150],"assets/images/resized/0022/2065/222065v2-max-150x150.jpg"],[[218,250],"assets/images/resized/0022/2065/222065v2-max-250x250.jpg"],[[336,385],"assets/images/resized/0022/2065/222065v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/iamkswift","title":"Twitter"},{"external_url":"http://www.facebook.com/hermannk","title":"Facebook"},{"external_url":"http://es.linkedin.com/in/hermannk","title":"LinkedIn"},{"external_url":"http://www.youtube.com/iamkswift","title":"Youtube"}]}