{"first_name":"Hilary","last_name":"Schneider","permalink":"hilary-schneider","crunchbase_url":"http://www.crunchbase.com/person/hilary-schneider","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Yahoo!","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jun 12 19:54:34 UTC 2008","updated_at":"Wed Nov 11 17:32:16 UTC 2009","overview":"<p>Hilary Schneider is the Head of Yahoo&#8217;s North American Region.  She also has global responsibilty for Yahoo&#8217;s mobile business.  Previously she served as Executive Vice President of Yahoo&#8217;s Global Partner Solutions (GPS) Division, which brought together Yahoo&#8217;s Sales, Corporate Partnerships, Online Channel Division, Yahoo HotJobs and Yahoo Publisher Network teams into one partner-focused organization. The GPS division was formed to better serve, enhance, and grow Yahoo&#8217;s opportunities and relationships with marketers and publishers by driving greater marketing effectiveness through close and collaborative partnership. Schneider assumed the EVP of GPS role when the division was formed in August 2007 and held the title until Yahoo&#8217;s re-org in June 2008.</p>\n\n<p>Schneider joined Yahoo in September of 2006 to run its Local Markets and Commerce (LMC) division where she was charged with developing an overarching classified and listings strategy as well as for day-to-day oversight of Yahoo&#8217;s listings and commerce properties in the U.S.</p>\n\n<p>Schneider&#8217;s deep experience in the publishing industry has also been instrumental to Yahoo in the creation and development of a significant cross-company partnership with newspapers across the U.S. to create one of the largest and most comprehensive online advertising networks known as the Newspaper Consortium (NPC).</p>\n\n<p>Prior to joining Yahoo, Schneider was senior vice president for Knight Ridder, Inc., a $3 billion revenue company, where she co-managed the company&#8217;s newspaper operations and later led its digital division as CEO, Knight Ridder Digital. Under her leadership, Knight Ridder&#8217;s online revenue tripled and the division&#8217;s profit margins grew significantly. Before joining Knight Ridder, Schneider served as president and CEO of Red Herring Communications, overseeing Red Herring Magazine, RedHerring.com and Red Herring&#8217;s events unit. She also served as the president and CEO of Times Mirror Interactive, and prior to that role, with The Baltimore Sun Company.</p>\n\n<p>She has served on the boards of CareerBuilder.com, Classified Ventures, Topix,net, ShopLocal and the Newspaper Association of America.Schneider holds a B.A. in economics from Brown University and an M.B.A. from Harvard Business School.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0002/0321/20321v1-max-150x150.jpg"],[[178,250],"assets/images/resized/0002/0321/20321v1-max-250x250.jpg"],[[321,450],"assets/images/resized/0002/0321/20321v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://yhoo.client.shareholder.com/press/management.cfm\" title=\"Yahoo!\" rel=\"nofollow\">Yahoo!</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"President ","firm":{"name":"LifeLock","permalink":"lifelock","type_of_entity":"company","image":{"available_sizes":[[[150,49],"assets/images/resized/0000/4513/4513v1-max-150x150.png"],[[200,66],"assets/images/resized/0000/4513/4513v1-max-250x250.png"],[[200,66],"assets/images/resized/0000/4513/4513v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Executive Vice President, Yahoo! North America ","firm":{"name":"Yahoo!","permalink":"yahoo","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0001/0836/10836v9-max-150x150.png"],[[226,81],"assets/images/resized/0001/0836/10836v9-max-250x250.png"],[[226,81],"assets/images/resized/0001/0836/10836v9-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}