{"first_name":"Hilda","last_name":"Fontana","permalink":"hilda-fontana","crunchbase_url":"http://www.crunchbase.com/person/hilda-fontana","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Apr 28 12:05:29 UTC 2011","updated_at":"Thu Apr 28 12:05:53 UTC 2011","overview":"<p>Hilda Fontana is Vice President of Technology for eCert. In this role, Fontana serves as the expert in email, ISP interactions and industry relations. She also collaborates in system engineering, architecture and development, and supports sales and member services. </p>\n\n<p>Fontana brings more than 20 years of leadership in messaging technology, mision-critical infrastructure and standards including designing, developing and implementing system solutions at ColdSpark, Lehman Brothers, Reuters, Gallup Organization and the Oprah Winfrey Network. </p>\n\n<p>Prior to eCert, Fontana was Head of Special System Engineering Projects at the Oprah Winfrey Network, including the redevelopment of Oprah.com and launch of community tools for the entire OWN network of sites. At ColdSpark, Fontana was the Vice President of Technical Solutions, was responsible for the management of all projects, and served as the representative to the APWG (Anti Phishing Working Group) and MAAWG (Messaging Anti Abuse Working Group). She also worked on the Trusted Email Consortium for Financial Services (TECFS), an alliance of top global financial institutions and ISPs collaborating to address the problem of email fraud and promote safe email communication. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Vice President, Technology","firm":{"name":"eCert","permalink":"ecert","type_of_entity":"company","image":{"available_sizes":[[[150,61],"assets/images/resized/0010/7282/107282v1-max-150x150.jpg"],[[183,75],"assets/images/resized/0010/7282/107282v1-max-250x250.jpg"],[[183,75],"assets/images/resized/0010/7282/107282v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}