{"first_name":"Hilton","last_name":"Warmback","permalink":"hilton-warmback","crunchbase_url":"http://www.crunchbase.com/person/hilton-warmback","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Mar 01 16:01:26 UTC 2012","updated_at":"Tue Mar 06 19:28:23 UTC 2012","overview":"<p>Hilton Warmback is a successful, passionate, and creative Information Technology Professional. Hilton is a startup specialist having been involved in world renowned companies such as Juicy Couture and Alpinestars in the fashion industry. He then focused more heavily in the gaming sector and Lead IT initiatives at both Full Tilt Poker and Knowledge Adventure’s highly successful Jumpstart online. </p>\n\n<p>Warmback began his 12 year IT career after completing his studies at the University of Cape Town with a major in Information Technology. The same program attended by world famous IT entrepreneur Mark Shuttleworth. Hilton rose quickly through the IT ranks and by the tender age of 23 was already the IT Manager for one of Liz Claiborne’s flagship brands (Juicy Couture). He was continuously head hunted to take on new and bigger opportunities. </p>\n\n<p>His next big move would be to Full Tilt Poker a fledgling online gambling startup. Hilton was tasked with not only running the IT operations but also being responsible for all infrastructures globally. With Data centers in multiple countries this included sourcing hardware, managing complete processes and being on hand at facilities to oversee physical deployments. Hilton’s personable way with vendors and partners led Full Tilt to use him in a wide variety of situations whether planning and managing complete corporate head office moves between continents to third party TLD acquisitions. Simply put, Hilton was the ‘go-to guy’ at Full Tilt and he was relied upon by the top executives for a variety of services. Hilton was trusted with the production game reliability in a $multi-million/day environment and was lead in outage scenarios due to his ability to use rapid problem solving and people management skills. </p>\n\n<p>Hilton then chose to embrace the rising tide of both digital and social media and left Full Tilt in search of the next opportunity. He was approached by knowledge Adventure the number one educational software company worldwide to help transition them from traditional gaming media into the 21st century. Hilton designed the complete all new online gaming platform for KA in under three months and helped launch Jumpstart.com within this time. This was a totally new direction for the company as this was a fully web browser based MMO gaming environment. Kids now had the ability to meet and play with their friends in a real time active and immersive environment. Hilton was again tasked with running all the technology requirements for the company and heading all deployments. </p>\n\n<p>Today Hilton is pursuing opportunities that allow him to draw on his traditional business expertise and bridge it with the demands of digital and new media in the IT context. Hilton has an extensive network of contacts and working relationships with nearly everyone of the top gaming platform manufacturers, leading technicians, IT vendors and partners in the industry thanks to his personable nature.\nHilton is honored to have Donald Grant, one of South Africa&#8217;s Ministers of Education with an MBA from UCT as one of his career mentors.</p>","image":null,"degrees":[{"degree_type":"Commerce","subject":"IT","institution":"UCT","graduated_year":2001,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/hiltonwarmback","title":""}]}