{"first_name":"Hiroshi","last_name":"YAMADA","permalink":"hiroshi-yamada","crunchbase_url":"http://www.crunchbase.com/person/hiroshi-yamada","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 14 11:20:39 UTC 2008","updated_at":"Sun Nov 16 18:25:33 UTC 2008","overview":"<p>Hiroshi Yamada is the President and CEO of JAFCO Asia and also a member of its Investment Committee since 2001. He is also a member of the Board of JAFCO Co., Ltd., the parent company of JAFCO Asia and also Japan’s largest venture capital company. Hiroshi Yamada has more than 25 years experience in venture capital and related industries.</p>\n\n<p>He started his professional career with Nomura Securities Co., Ltd. in 1978 immediately after his graduation from Keio University in 1978. After various assignments both in Japan and overseas, he became a securities analyst and strategist in 1983 at Institutional Research and Advisory Department which exclusively served overseas institutional investors investing in Japanese public equity market. He worked for the department for six years until 1989.</p>\n\n<p>He then moved to Nomura Bank (Switzerland) Ltd. in Zurich and assumed responsibility as Executive Vice President from 1989 to 1994. During the period, he supervised a wide range of activities for the Bank such as sales, trading, product development and syndication.</p>\n\n<p>After three years of assignment as Deputy General Manager of Personnel Department at it&#8217;s Head Office, he became President of Nomura Singapore Limited in 1997 and moved to Hong Kong in 2000 and became President of Nomura International (Hong Kong) Ltd.</p>\n\n<p>Hiroshi Yamada received his Bachelor of Economics from Keio University, Tokyo, Japan in 1978. </p>","image":{"available_sizes":[[[108,144],"assets/images/resized/0002/8678/28678v1-max-150x150.jpg"],[[108,144],"assets/images/resized/0002/8678/28678v1-max-250x250.jpg"],[[108,144],"assets/images/resized/0002/8678/28678v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President and Chief Executive Officer","firm":{"name":"JAFCO Asia","permalink":"jafco-asia","type_of_entity":"financial_org","image":{"available_sizes":[[[150,50],"assets/images/resized/0002/8530/28530v2-max-150x150.jpg"],[[229,77],"assets/images/resized/0002/8530/28530v2-max-250x250.jpg"],[[229,77],"assets/images/resized/0002/8530/28530v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}