{"first_name":"Hirva","last_name":"Prithiani","permalink":"hirva-prithiani","crunchbase_url":"http://www.crunchbase.com/person/hirva-prithiani","homepage_url":"http://www.hypertechservices.com","birthplace":"Ahmedabad","twitter_username":"hypertech_ser","blog_url":"","blog_feed_url":"","affiliation_name":"Hypertech Services","born_year":null,"born_month":null,"born_day":null,"tag_list":"web-content-writer, website-content, content-writing-services, content-writing-india, article-writing, blog-writing, article-writer-india, blog-writer-india","alias_list":null,"created_at":"Sat Mar 31 07:28:34 UTC 2012","updated_at":"Thu Apr 05 04:05:18 UTC 2012","overview":"<p>Content is being used by large organizations in the world, executed by small businesses and one-person shops around the globe. Why? Because it works.</p>\n\n<p>Hypertech Services has a team of professional writers skilled in creating a compelling content which fully matches your business needs and requirements. Our team is well trained to cater with you a content which is well researched to fit your needs along with standards required to match today’s web based market. </p>\n\n<p>We provide article writing, website content writing, blog writing and various other types of content creation. Our content packages provide you with only top notch content that you can be proud to display on your site.</p>\n\n<p>Hypertech Services is an India based company situated in the city of Ahmedabad, Hypertech provides services like website content writing, Blog, Press Release and Article Writing, for more information please visit our website. </p>\n\n<p>The company was started with the objective of offering the best service in the field of content marketing to its clients. The company aims at providing the best content writing services in major domains of IT industry. Helping you brand the business through content marketing is the key area of our operation. We excel in website content writing, article writing, press releases and blog writing. </p>\n\n<p>We believe in quality output and credit goes to our core team of writers. Charles Darwin has rightly said “It is not the strongest of the species that survives, nor the most intelligent, but the one most responsive to change.” So do we. We own a small team of writers who have intense experience with web content writing, core insight into the market needs and a learning nature to be adaptable to the new standards of industry. </p>\n\n<p>We measure our success by our clients’ satisfaction. We believe the customer’s response and feedback as our source of learning which makes us different from others.</p>\n\n<p>Specialties\nContent Writing, Blog Writing, Article Writing, Press Release, Website Content Writing</p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0018/2046/182046v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0018/2046/182046v2-max-250x250.jpg"],[[450,300],"assets/images/resized/0018/2046/182046v2-max-450x450.jpg"]],"attribution":"<p>Hypertech Services</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Hypertech Services","permalink":"hypertech-services","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/hirva-prithiani/48/252/527","title":"Linkedin"},{"external_url":"http://www.facebook.com/profile.php?id=100003563381585&viewas=100000686899395&returnto=profile","title":"Facebook"}]}