{"first_name":"Hitesh","last_name":"B. Panchal","permalink":"hitesh-b-panchal","crunchbase_url":"http://www.crunchbase.com/person/hitesh-b-panchal","homepage_url":"http://www.bottlefilling.in/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"capping-machines, sealing-machines, automatic-filling-machines, storage-tank, packaging-conveyors, shree-sai-engineering-works, mumbai, india","alias_list":null,"created_at":"Thu May 10 06:13:02 UTC 2012","updated_at":"Fri May 11 03:26:28 UTC 2012","overview":"<p>Shree Sai Engineering Works</p>\n\n<p>Established in the year, 1998, our company, Shree Sai Engineering Works, is engaged in the sphere of manufacturing and supplying range of Precision Engineered Process Machinery for the Pharmaceutical Industry. Manufactured with latest technology, these packing belt conveyor, automatic cap sealing machine, industrial belt conveyor, bottle cap sealing machine, automatic capsule filling machines, automatic screw capping machine, pharmaceutical filling machines, automatic volumetric filling machine, semi automatic bottle filling machine, slat conveyors, ROPP cap sealing machine, pharmaceutical filling machine, screw capping machine, packaging belt conveyor, automatic cap feeder and automatic bottle filling machine are widely used for various applications in pharmaceutical industry.</p>\n\n<p>We offer an assortment of packing belt conveyor, automatic cap sealing machine, industrial belt conveyor, bottle cap sealing machine, automatic capsule filling machines, automatic screw capping machine, pharmaceutical filling machines, automatic volumetric filling machine, semi automatic bottle filling machine, slat conveyors, ROPP cap sealing machine, pharmaceutical filling machine, screw capping machine, packaging belt conveyor, automatic cap feeder and automatic bottle filling machine. These are manufactured with graded raw material under strict quality monitoring that ensures superior functionality of the machine. The entire range is properly tested on various quality parameters at our highly developed quality testing facility. </p>\n\n<p>Since the inception of our company, we have been very particular about the quality of our packing belt conveyor, automatic cap sealing machine, industrial belt conveyor, bottle cap sealing machine, automatic capsule filling machines, automatic screw capping machine, pharmaceutical filling machines, automatic volumetric filling machine, semi automatic bottle filling machine, slat conveyors, ropp cap sealing machine, pharmaceutical filling machine, screw capping machine, packaging belt conveyor, automatic cap feeder and automatic bottle filling machine. We believe that quality is the only bond between our clients and us that has encouraged us throughout our journey. We have incorporated strict quality policy that has been the practices at our company to offer quality machines to our clients. We have established a modern quality testing facility that allows us to text our machines on various quality parameters. The unit is managed by efficient team of quality controllers who ensure that the entire manufacturing process, right from procuring the raw material to final dispatch of the consignments is systematic. </p>\n\n<p>Telephone:  +(91)-(22)-25785028 </p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0018/8827/188827v2-max-150x150.jpg"],[[200,200],"assets/images/resized/0018/8827/188827v2-max-250x250.jpg"],[[200,200],"assets/images/resized/0018/8827/188827v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}