{"first_name":"HL","last_name":"Plost","permalink":"hl-plost","crunchbase_url":"http://www.crunchbase.com/person/hl-plost","homepage_url":"","birthplace":"","twitter_username":"HLPlost","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Dec 02 05:38:25 UTC 2012","updated_at":"Wed Dec 05 08:01:14 UTC 2012","overview":"<p>Summary Professional Biography</p>\n\n<p>For 15 years, HL has specialized in guiding CEO&#8217;s, CIO&#8217;s and Marketing executives in Public Relations, Marketing Communications, Social Media, Press Relations, Digital strategy and Big Data and Branding in their respective industries.  As Chief Marketing Officer of HP Media Labs, he works with  executives helping them understand and discover how to leverage digital marketing capabilities and emerging technologies required to grow their businesses and launch new products and services.  </p>\n\n<p>HL’s clients are the world’s best-known brands, spanning a variety of industries – high technology manufacturing, social media, e-commerce, financial services, entertainment, health care and consumer packaged goods.  His representative clients include:  Amazon | Apple | Publicis Groupe | Omnicom | Adobe | Coke | The Walt Disney Company | Sony | Google | AT&amp;T | Fox | Electronic Arts | CNN | Nike | General Mills | Citibank | Nestle&#8217; | BMW | Honda | Toyota | Kabam | Time Warner | BBC | Nestlé | Shell | Unilever | Merck | GAP | Delta Airlines | American Express | Verizon | Intel | VISA | New York Times</p>\n\n<p>HL previously held the position of Vice President of Digital Strategy and Emerging Technologies at Razorfish, acquired by Publicis Groupe.  Publicis Groupe is the world’s third largest communications group in the World, and its activities span more than a hundred countries on five continents.  The group has over one thousand agencies, that combine to form a network that offers a complete range of communication services to local, national and global clients. </p>\n\n<p>HL has also held the position of Vice President at SAP, the world’s largest enterprise software corporation.  He led   the North American digital strategy and global business transformation, as well as the Sales excellence and Value engineering services group, and spear headed Go-to-market product launches in North America, Europe, and Latin America.  He served on the executive leadership team managing SAP’s ten largest customers and reported to their CEO’s.</p>\n\n<p>An entrepreneur at heart, HL is a strategic and visionary thinker leaving no details to chance. HL is not afraid to roll up his sleeves to ensure the success of all his clients.  He is a people oriented team builder with a demonstrated ability to work effectively in large companies and  lean start-ups. </p>\n\n<p>HL is actively involved in developing programmatic digital advertising buying strategies for Fortune 500 companies:  Display, Mobile, Search, Video and In-Game advertising technologies.  He is frequently engaged by clients to create actionable strategies designed to help them accelerate and embrace innovative new and emerging digital technologies. He is considered a customer-centric problem-solver who is always driving to understand the customers’ needs as he helps them formulate differentiated digital marketing solutions.  </p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0022/3382/223382v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0022/3382/223382v2-max-250x250.jpg"],[[260,260],"assets/images/resized/0022/3382/223382v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/hlplost","title":"CMO, Vice President"}]}