{"first_name":"Holger","last_name":"Knopke","permalink":"holger-knopke","crunchbase_url":"http://www.crunchbase.com/person/holger-knopke","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"T-Mobile","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 28 20:55:31 UTC 2009","updated_at":"Wed Jan 28 20:55:31 UTC 2009","overview":"<p>Holger Knöpke, born in 1966, has been Senior Vice President of Product Definition &amp; Provisioning at T-Mobile International, in Bonn since July 2007. He is a member of the Product Board of Deutsche Telekom Group and a member of the Marketing Board at T-Mobile International.</p>\n\n<p>In his role Holger Knoepke is responsible for consistent state-of-the-art design and provisioning of products as well as enablers across T-Mobile International. Mr. Knoepke wants his customers to enjoy simple and effective communication - regardless of the underlying mobile technologies. For him, this means focusing on product simplicity, inspirational design, solution creativity and innovation. Besides, he believes in making T-Mobile&#8217;s &#8220;web&#8217;n&#8217;walk&#8221; offer, surfing the World Wide Web via cell phone and enabling 3rd party applications, an integral part of mobile communications. The underlying technologies - innovative, new handheld devices, powerful and open software platforms, mobile broadband networks - are key to achieving this goal.</p>\n\n<p>Prior to his current role Knoepke was a Director of Customer Marketing Operations &amp; Analytics at T-Mobile US, in Bellevue and an Executive Vice President of Group Strategy at T-Mobile International, Bonn.</p>\n\n<p>Before joining T-Mobile, Mr. Knoepke was a Vice President for Strategy Telecommunications Markets, focusing on both the mobile and fixed line business at Deutsche Telekom, Bonn.</p>\n\n<p>Mr. Knoepke was also in the business of consulting in the communications, computer and media industry working for Booz Allen &amp; Hamilton, in Düsseldorf/Frankfurt and he also held a Product Management position at Unilever in Hamburg.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0003/5118/35118v1-max-150x150.jpg"],[[166,250],"assets/images/resized/0003/5118/35118v1-max-250x250.jpg"],[[240,361],"assets/images/resized/0003/5118/35118v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Senior Vice President of Product Definition & Provisioning","firm":{"name":"T-Mobile","permalink":"t-mobile","type_of_entity":"company","image":{"available_sizes":[[[143,30],"assets/images/resized/0002/5598/25598v2-max-150x150.png"],[[143,30],"assets/images/resized/0002/5598/25598v2-max-250x250.png"],[[143,30],"assets/images/resized/0002/5598/25598v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}