{"first_name":"Homer","last_name":"L. Pearce","permalink":"homer-l-pearce","crunchbase_url":"http://www.crunchbase.com/person/homer-l-pearce","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jun 21 08:23:26 UTC 2009","updated_at":"Sun Jun 21 08:23:48 UTC 2009","overview":"<p>Dr. Pearce recently retired from Lilly Research Laboratories, where he served as a member of the executive leadership in discovery research.  Of particular note was his tenure as vice president of cancer research and clinical investigation. At the time of his retirement, Dr. Pearce held the title of distinguished research fellow. </p>\n\n<p>While he was VP of cancer research at Eli Lilly, Dr. Pearce led Lilly&#8217;s collaboration with Isis Pharmaceuticals. The relationship with Isis was to discover antisense drugs to inhibit specific gene targets associated with cancer, especially antisense compounds directed at cellular regulators of apoptosis.  The Isis-Lilly relationship also looked to discover new antisense drugs in the fields of inflammatory and metabolic diseases. </p>\n\n<p>In his more than 27 years devoted to cancer drug discovery at Lilly, Dr. Pearce was involved in the development of more than 25 investigational drugs which entered clinical trials for cancer, of which three have resulted in regulatory approvals and others are still in development. These drugs, which include Gemzar® and Alimta®, achieved 2005 combined worldwide sales of nearly 2 billion dollars.  Another drug which advanced during this period, the molecular targeted therapeutic, enzastaurin, is now in  Phase III clinical trials.  </p>\n\n<p>Dr. Pearce&#8217;s graduate work at Harvard - the total synthesis of picrotoxinin, which was considered to be an impossible problem by none other than the scientist who originally decoded the structure of the picrotoxinin family - remains one of the landmark achievements in the area of natural products total synthesis. What makes it even more remarkable is that it was a feat he accomplished single-handedly. </p>\n\n<p>Dr. Pearce currently serves as a Board Member, Scientific Advisor, or Business Director to a number of leading research institutions, foundations and biotechnology companies.  The recipient of numerous awards throughout his career, Dr. Pearce was most recently named &#8220;A Hero of Chemistry&#8221; by the American Chemical Society, for his discovery and development of Alimta®, the first drug ever approved for the treatment of malignant pleural mesothelioma. </p>\n\n<p>Dr. Pearce received his Ph.D. in chemistry from Harvard University and his undergraduate degree from Texas A&amp;M University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Director and Scientific Advisor","firm":{"name":"Kylin Therapeutics","permalink":"kylin-therapeutics","type_of_entity":"company","image":{"available_sizes":[[[150,90],"assets/images/resized/0004/9954/49954v1-max-150x150.png"],[[166,100],"assets/images/resized/0004/9954/49954v1-max-250x250.png"],[[166,100],"assets/images/resized/0004/9954/49954v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}