{"first_name":"Hongming","last_name":"Chen","permalink":"hongming-chen","crunchbase_url":"http://www.crunchbase.com/person/hongming-chen","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Mar 14 13:49:15 UTC 2012","updated_at":"Wed Mar 14 13:50:17 UTC 2012","overview":"<p>Hongming Chen joined Kala from TransForm Pharmaceuticals, where she was Director of Formulation Development responsible for formulation design for drugs and drug/device combinations. Dr. Chen started as the first employee at TransForm and helped to define and execute the business strategies that ultimately led to its acquisition by Johnson&amp;Johnson in 2005 for $230MM. Before joining TransForm, Dr. Chen conducted vaccine delivery research and development at AstraZeneca from 1997 to 2000, and at Merck Research Laboratories from 1996 to 1997. Dr. Chen received her B.S. degree in Chemical Engineering from University Texas at Austin in 1992, and her Master and Sc.D. degrees in Chemical Engineering from Massachusetts Institute of Technology in 1995 and 1996, respectively. Her doctorial thesis work, performed under Prof. Robert Langer, was in the field of nano-colloidal systems for oral drug and vaccine delivery. Her graduate work was awarded the Controlled Release Society-Cygnus Graduate Student Award for Outstanding Research in Drug Delivery in 1996. Dr. Chen is the co-author of 35 publications and patents and she is currently Co-Chair of the Controlled Release Society Capsugel Award Committee.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Vice President, Research","firm":{"name":"Kala Pharmaceuticals","permalink":"kala-pharmaceuticals","type_of_entity":"company","image":{"available_sizes":[[[150,66],"assets/images/resized/0017/8187/178187v1-max-150x150.jpg"],[[250,110],"assets/images/resized/0017/8187/178187v1-max-250x250.jpg"],[[253,112],"assets/images/resized/0017/8187/178187v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}