{"first_name":"Horacio","last_name":"Cuervo","permalink":"horacio-cuervo","crunchbase_url":"http://www.crunchbase.com/person/horacio-cuervo","homepage_url":"","birthplace":"Buenos Aires","twitter_username":"horaciocuervo","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1968,"born_month":11,"born_day":7,"tag_list":"","alias_list":null,"created_at":"Fri Oct 08 12:18:52 UTC 2010","updated_at":"Fri Oct 08 18:30:09 UTC 2010","overview":"<p>With more than 15 years of hands-on experience in strategic planning, organizational development, sales management, business development, project and service management and system engineering strategies he has a successful record of leading diverse, and global, teams of professionals in the development of high-quality deliverables. He also showed peak performance while focusing on responsibilities and commitments in a variety of highly competitive industries, cutting-edge markets, and fast-paced environments.</p>\n\n<p>Strong communicator and equally effective at identifying opportunities, developing focus and providing tactical business solutions with a consistent record of, and used to, forging strong business relationships with prospects and clients at C-suites level usually being positioned as a confident and trusted advisor.</p>\n\n<p>Always performing with a global perspective in a competitive and fast-paced business environment with an extensive international business experience, travel and exposure to different projects and cultures with a wide array of innovative business approaches due to work experience in various countries, cultures and different industries.</p>","image":{"available_sizes":[[[149,150],"assets/images/resized/0010/4736/104736v2-max-150x150.jpg"],[[160,161],"assets/images/resized/0010/4736/104736v2-max-250x250.jpg"],[[160,161],"assets/images/resized/0010/4736/104736v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}