{"first_name":"Hotlanta","last_name":"Radio","permalink":"hotlanta-radio","crunchbase_url":"http://www.crunchbase.com/person/hotlanta-radio","homepage_url":"http://www.hotlantaradio.com","birthplace":"Atlanta, GA","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"music, internet-radio, independent-artist, hot, atlanta, hotlanta, rb, hip-hop, soul, pop, videos, social-network","alias_list":null,"created_at":"Thu Oct 13 19:55:01 UTC 2011","updated_at":"Sat Jun 02 01:07:08 UTC 2012","overview":"<p>Hotlantaradio.com is an outlet for independent artist, businesses, and people around the world to communicate their interests and love for music-oriented content. Our goal is to bring you some of the hottest New Independent Artist like Sly Kat, Steven Knight, Jerome Lee, Lil’ Daddy, Carmen Liana, Mr CJ, Bigg E-Rupt and more. Check out our online radio station and Listen Live Daily 24/7</p>\n\n<p>Check out our Gospel show playing daily from 5:30am - 11:30am and was created get your morning started right! Mary Mary, Fred Hammond, Canton Jones and many more. We all know when praises go up - God&#8217;s blessing come down!</p>\n\n<p>From 11:30am - 5pm we play a mix of some of the best New and Old School R&amp;B/Hip-Hop tracks featuring Trey Songz, Temptations, Whitney Houston and more! The afternoon mix was created specifically for at work listening! </p>\n\n<p>After the workday is done check out &#8220;Southern Playalistic&#8221; starting daily at 5pm: Southern Playalistic takes it to the next level. We amp it up with some of the hottest tracks and artist such as Ludacris, Pitbull, Erykah Badu, Mary J. Blige and more!</p>\n\n<p>We would like to thank everyone in for supporting our venture! We truly appreciate it. Oh and again make sure to tell a friend or two or ten!  </p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0015/8024/158024v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0015/8024/158024v2-max-250x250.jpg"],[[450,300],"assets/images/resized/0015/8024/158024v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.hotlantaradio.com/","title":"Official Website"}]}