{"first_name":"Howard","last_name":"Kayman","permalink":"howard-kayman","crunchbase_url":"http://www.crunchbase.com/person/howard-kayman","homepage_url":"http://www.howarkayman.co.uk","birthplace":"","twitter_username":"","blog_url":"http://howardkayman.wordpress.com/","blog_feed_url":"","affiliation_name":"Aston Chase","born_year":1966,"born_month":10,"born_day":10,"tag_list":"howard-kayman, aston-chase, real-estate","alias_list":null,"created_at":"Mon Nov 26 12:13:57 UTC 2012","updated_at":"Wed Dec 05 07:36:28 UTC 2012","overview":"<p>Family man and Formula 1 fan</p>\n\n<p>Howard Kayman is a loving husband to his wife, a devoted father to his three very handsome young sons and a fierce fan of Ferrari and Kimi Räikkönen and his exploits in global racing. Howard’s love for things on wheels is not limited to him being an avid Formula 1 fan. He gets behind the wheel himself whenever he can get away from his hectic life as a London property man. Whether endurance-karting or Smart Car racing, Howard is skilled at wielding a steering wheel around a track in, literally, record time. He is the current keeper of the record in the Guinness Book of Records for achieving the greatest distance in outdoor karting for an individual in 24 hours. He completed 1,054.4 miles in this period and maintained an average speed of 43.9 miles per hour. Howard Kayman smashed the previous record, held by a team, by over 200 miles without even intending to achieve a record of any sort. The exercise was with the sole aim of raising money for a charity which helps war veterans and soldiers through troubles. </p>\n\n<p>Top London property negotiator and investment advisor</p>\n\n<p>Howard Kayman joined the prime property agency Aston Chase in the late 90’s as house sales negotiator. Operating in premier areas where the upper echelon reside, Howard is used to brushing shoulders with wealthy individuals in the music and film industry as well as affluent executives and foreign investors. He is of charming disposition and exudes genuine warmth. Howard’s positive outlook and temperament instils trust in his clients and his expert knowledge in the London property industry has earned him a resolute position of a reliable source of sound property investment advice. With the influx of foreign investors in London at the moment, Howard Kayman and Aston Chase are kept on the go and prosperous in business. Howard’s personable approach and experience makes him a valuable part of the Aston Chase family. </p>\n\n<p>Exotic journeys and foreign travels</p>\n\n<p>Although Howard Kayman is a successful realtor in London and is firmly entrenched in London life, he has a tremendous spirit of adventure and enjoys regular travels abroad to car racing events and other interesting places.  Howard was at the Abu Dhabi Grand Prix where he was photographed with his winning smile beside the Räikkönen and Alonso Ferrari pit crew as well as making a stop at the Lewis Hamilton pit for closer acquaintance with the latest state of the art technology used by McLaren Mercedes. His enthusiasm for anything with four wheels and a few pedals also takes him to other global motoring events such as the Monaco Kart Cup. A family man at heart, Howard does not forget to take his wife and children on wonderful and interesting journeys. One such epic voyage was on the luxury cruise ship; the Celebrity Equinox. Offering superb cuisine and entertainment in sumptuous surroundings with every comfort catered for, the journey to Florida on board the Celebrity Equinox was an exciting activity enjoyed by young and old alike.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0022/2277/222277v2-max-150x150.jpg"],[[167,250],"assets/images/resized/0022/2277/222277v2-max-250x250.jpg"],[[296,443],"assets/images/resized/0022/2277/222277v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Negotiator","firm":{"name":"Aston Chase","permalink":"aston-chase","type_of_entity":"company","image":{"available_sizes":[[[120,120],"assets/images/resized/0021/9046/219046v2-max-150x150.jpg"],[[120,120],"assets/images/resized/0021/9046/219046v2-max-250x250.jpg"],[[120,120],"assets/images/resized/0021/9046/219046v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.howardkayman.org/","title":"Howard Kayman - Wiki Page"},{"external_url":"http://www.howardkaymaninfo.co.uk","title":"Howard Kayman; karts, guns, jungles and houses"}],"web_presences":[]}