{"first_name":"Howard","last_name":"Smith","permalink":"howard-smith-2","crunchbase_url":"http://www.crunchbase.com/person/howard-smith-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Movero Technology","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jun 25 23:51:57 UTC 2008","updated_at":"Sat Jun 09 23:46:01 UTC 2012","overview":"<p>Chief Investment Officer of Bolis Properties, Howard W. Smith brings over 15 years of business development, financial and consulting experience.<br/>\nDuring his career, Howard was a Principal at SeventySix Capital, an early stage venture capital firm that invests in innovation-driven companies in the Healthcare, Mobile, Media &amp; Entertainment, Greentech, and Business 2.0 industries.  SeventySix Capital has built a track record of innovation and investment excellence in the venture capital industry. Using an approach focused on strategic relationship management, advanced technology, and hands-on engagement with entrepreneurs, SeventySix Capital has proven its ability to grow portfolio companies into leading businesses across the world. SeventySix Capital portfolio companies have generated over $5 billion in revenues and supported more than 6,000 jobs. Portfolio companies include SeamlessWeb (acquired by ARAMARK), Nutrisystem (NASDAQ: NTRI), Take Care Health Systems (acquired by Walgreens [NYSE: WAG]), meetMoi, ReverbNation, OrganizedWisdom, and Fisker Automotive</p>\n\n<p>Howard&#8217;s experience also includes a senior associate position at PricewaterhouseCoopers and IBM&#8217;s (NYSE: IBM) Business Consulting Services,  Howard consulted for many Fortune 500 companies and Universities such as: AT&amp;T (NYSE: T), Johnson &amp; Johnson (NYSE: JNJ), HJ Heinz (NYSE: HNJ), Rohm &amp; Hass (NYSE: ROH) and the University of Pennsylvania Health Systems. In addition to consulting for PWC and IBM, Howard also served as the Global Knowledge Manager of the Financial Management Solution Division where he was responsible for the tacit and explicit knowledge of the firm.</p>\n\n<p>Actively involved in the Jewish Community, Howard serves on the committees of several Jewish Charities and volunteers with numerous programs to support the education of Philadelphia&#8217;s youth.</p>\n\n<p>Howard earned a Bachelor&#8217;s Degree in Arts &amp; Sciences, from Syracuse University, and an MBA from Nova-Southeastern University. He lives in the Philadelphia suburbs with his wife and two children</p>","image":{"available_sizes":[[[101,130],"assets/images/resized/0003/7293/37293v2-max-150x150.jpg"],[[101,130],"assets/images/resized/0003/7293/37293v2-max-250x250.jpg"],[[101,130],"assets/images/resized/0003/7293/37293v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"","institution":"Syracuse University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"Nova-Southeastern University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Director","firm":{"name":"Movero Technology","permalink":"movero-technology","type_of_entity":"company","image":{"available_sizes":[[[73,73],"assets/images/resized/0008/1427/81427v1-max-150x150.png"],[[73,73],"assets/images/resized/0008/1427/81427v1-max-250x250.png"],[[73,73],"assets/images/resized/0008/1427/81427v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}