{"first_name":"Hubbert","last_name":"Smith","permalink":"hubbert-smith","crunchbase_url":"http://www.crunchbase.com/person/hubbert-smith","homepage_url":"http://www.hubbertsmith.com","birthplace":"alabama USA","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Aug 14 03:01:21 UTC 2010","updated_at":"Mon Aug 16 17:58:49 UTC 2010","overview":"<p>Business Line Management for new market segments and disruptive products.</p>\n\n<p>Launched WD&#8217;s entry into the Enterprise SATA market, and led the creation of the Enterprise SATA segment. Enterprise SATA disrupted the Enterprise Storage market. Enterprise SATA is now 1/3 of the Enterprise HDD market. </p>\n\n<p>Influenced the storage industry: wrote the original 13 use cases which influenced the direction of the SATA spec. Chaired one of the SATA standard working groups and served as technical editor for a ratified portion of the SATA industry standard. </p>\n\n<p>Product Manager at Auspex, the company which competed with main-stream servers and created the File Server market segment.</p>\n\n<p>Managed software team for NCRs failover clustering and Replication. at the time, both failover and replication for mid-range systems were disruptive technologies.</p>\n\n<p>Published Author.\n &#8220;Serial ATA Storage Architectures and Applications&#8221; Co-Author. Intel Press.\nGoing to print in late 2010 - &#8220;DataCenter Storage&#8221; published by CRC press</p>\n\n<p>(ISBN 0-9717861-8-6 available on Amazon)\nPatent Holder - USPTO Patent 7,007,142 Network Data Storage-related Operations.</p>\n\n<p>Specialties:\nEnterprise Storage Systems (NAS, SAN, iSCSI) and Storage Devices (HDD, SSD). Expert at bridging the gap between strategy and execution. Hands-on experience with: - Product Marketing - Servers, Networked Storage &amp; Software - New product definition and development - Program management &amp; project management - Outsourcing deal development and execution - Competitive analysis and competitive response - New product positioning, promotion &amp; launch</p>","image":null,"degrees":[{"degree_type":"Bachelors of Science","subject":"Electrical Engineering","institution":"Auburn University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}