{"first_name":"Hubert","last_name":"Manseau","permalink":"hubert-manseau","crunchbase_url":"http://www.crunchbase.com/person/hubert-manseau","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 26 19:31:31 UTC 2009","updated_at":"Fri Jun 26 19:32:04 UTC 2009","overview":"<p>Hubert Manseau co-founded Multiple Capital in March 2005 and has been Senior Managing Partner since, moving ahead from eight years of experience as President and Chief Executive Officer of Innovatech du Grand Montreal, a major Canadian high-tech venture capital firm. </p>\n\n<p>Prior to 1997, Mr. Manseau was Executive Vice President of the Computer Research Institute of Montreal, and occupied various senior executive positions in information technology, both in academic (University of Québec) and industry (Videotron, DTI Telecom) environments. In addition, Mr. Manseau is Governor and former President of the Quebec Venture Capital Association; he was and still is Director and Chairman of numerous high tech firms and a member of several advisory boards for venture capital funds. </p>\n\n<p>In the past, Mr. Manseau served as director of the Canadian Network for the Advancement of Research, Industry and Education (CANARIE), as well as Director and Chairman of the Board of College Edouard-Montpetit, the largest public college in Quebec. Mr. Manseau was a founding member of the first Internet service provider in Quebec (RISQ), and was also co-founder of two high tech start ups.</p>\n\n<p>Here at Multiple Capital, Mr. Manseau continues to devote the extensive knowledge and profound expertise he acquired over the years in order to carefully handle venture capital portfolios in the information technology and advanced technology sectors.</p>","image":{"available_sizes":[[[80,120],"assets/images/resized/0005/0974/50974v1-max-150x150.jpg"],[[80,120],"assets/images/resized/0005/0974/50974v1-max-250x250.jpg"],[[80,120],"assets/images/resized/0005/0974/50974v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President","firm":{"name":"Multiple Capital","permalink":"multiple-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,40],"assets/images/resized/0005/0970/50970v1-max-150x150.png"],[[206,55],"assets/images/resized/0005/0970/50970v1-max-250x250.png"],[[206,55],"assets/images/resized/0005/0970/50970v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}