{"first_name":"Hugh","last_name":"M. Jones IV","permalink":"hugh-m-jones-iv","crunchbase_url":"http://www.crunchbase.com/person/hugh-m-jones-iv","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jul 24 15:29:59 UTC 2009","updated_at":"Fri Jul 24 15:30:39 UTC 2009","overview":"<p>Mr. Jones currently leads the global businesses for Accuity and NRS. He is ultimately responsible for the overall financial growth of the company as well as for the creation of world class payment and compliance solutions for Accuity’s diverse customer base.</p>\n\n<p>Mr. Jones has over 15 years of experience building corporate value by creating rich data streams that provide new solutions to difficult business challenges. He has been successful in developing top executive teams, leading sales efforts and negotiating complicated business deals.</p>\n\n<p>Prior to joining Accuity, Mr. Jones spent five years building IntrinsiQ Research into the dominant leader in information management for the oncology market. As the Executive Vice-President, he and his partners built the software applications that enabled U.S.-based oncologists to optimally treat their patients and allowed the bio-pharmaceutical</p>\n\n<p>industry to analyze real-time oncology usage data to thoroughly understand their products. Previously, Mr. Jones led Datamonitor’s Healthcare practice as the Global Managing Director. In addition to many corporate roles, Hugh participated frequently on both syndicated and custom engagements in areas such as product portfolio optimization, acquisition strategies, field force structure, market assessments, product launch strategy and various eHealth issues.</p>\n\n<p>Prior to Datamonitor, Hugh was a member of the Deloitte Consulting Life Science Strategy Group, where he concentrated on corporate and marketing strategy for leading life science companies.</p>\n\n<p>Hugh holds an M.B.A. from the University of Michigan and a B.A. from Yale University.</p>","image":{"available_sizes":[[[100,139],"assets/images/resized/0005/4192/54192v1-max-150x150.png"],[[100,139],"assets/images/resized/0005/4192/54192v1-max-250x250.png"],[[100,139],"assets/images/resized/0005/4192/54192v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President","firm":{"name":"Accuity","permalink":"accuity","type_of_entity":"company","image":{"available_sizes":[[[150,23],"assets/images/resized/0005/3164/53164v1-max-150x150.png"],[[250,38],"assets/images/resized/0005/3164/53164v1-max-250x250.png"],[[389,60],"assets/images/resized/0005/3164/53164v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}