{"first_name":"Hugo","last_name":"Leijtens","permalink":"hugo-leijtens","crunchbase_url":"http://www.crunchbase.com/person/hugo-leijtens","homepage_url":"http://www.nexocial.com","birthplace":"Netherlands","twitter_username":"hugoleijtens","blog_url":"http://hugoleijtens2.wordpress.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1979,"born_month":10,"born_day":6,"tag_list":"microsoft-mvp-social-networking-chengdu-china-netherlands","alias_list":null,"created_at":"Sun Aug 14 05:31:08 UTC 2011","updated_at":"Tue Aug 16 20:48:15 UTC 2011","overview":"<p>CEO of Nexocial, specializes in aligning technology with business. Since 1999 in the IT industry, starting out as technical consultant and enterprise architect for large scale networks. In 2004 awarded with the MVP award for Windows Media Center, starting and managing the largest community on MCE in Dutch. After being a Product Innovation Manager for the largest Dutch telecom operator, he moved to Microsoft, where he for Microsoft Netherlands and Microsoft Europe as Account Technology Specialist. Managed large accounts like Dell, Acer on a technology perspective and managed the Systembuilder Channel in the Benelux. Within 3 years, he was a 7 times award winning, best engineer of EMEA and won global awards like the Google Compete award. In 2008 he left Microsoft, and started to build his new company Nexocial in Chengdu, China. In 7 weeks he learned Chinese and navigated through the Financial Crisis with the product that is now the core-business of Nexocial: weConnect. Since 2011 his company now holds 20 people with offices in 3 countries selling software products to Fortune 500 companies with a focus on Corporate Social Networking. Education in Technology, Business Management, Law, Economics, 18 times certified on Microsoft technology</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0014/9382/149382v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0014/9382/149382v2-max-250x250.jpg"],[[450,450],"assets/images/resized/0014/9382/149382v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}