{"first_name":"Hugues","last_name":"Boisvert","permalink":"hugues-boisvert-2","crunchbase_url":"http://www.crunchbase.com/person/hugues-boisvert-2","homepage_url":"http://www.hazlolaw.com","birthplace":"Moncton, New Brunswick","twitter_username":"hazlolaw","blog_url":"http://ottawabusinesslawyer.blogspot.com/","blog_feed_url":"","affiliation_name":"Andrews Robichaud","born_year":null,"born_month":null,"born_day":null,"tag_list":"business-lawyer, entrepreneur, tax-law, estate-planning, corporate-attorney","alias_list":null,"created_at":"Wed Jan 04 19:29:35 UTC 2012","updated_at":"Mon Apr 02 01:32:02 UTC 2012","overview":"<p>A Global Shapers 2011 selected by the World Economic Forum, Hugues Boisvert is the Founder of HazloLaw and the Managing Partner of the Firm. As a Business Lawyer, Hugues is widely recognized for his in-depth knowledge of business and tax law and enjoys a reputation as one of Ottawa&#8217;s most respected business lawyers and advisor to entrepreneurs and business owners in Ottawa and around the world.</p>\n\n<p>As a trusted advisor, Hugues represents start ups, family owned businesses and mid-size companies at the local, national and international level in a wide range of industries. Hugues expertise is on the creation of various tax-effective structures for the preservation, accumulation and transfer of wealth for entrepreneurs and he  advises clients on their legal matters and day-to-day business issues including; implementation of various corporate structure (with the use of Family Trusts &amp; Holding companies, Estate freeze, Section 85 &amp; 86 corporate re-organizations, etc.), negotiation of contracts, review of business agreements and any other corporate matters related to their businesses. In addition, his areas of practice includes: Corporate Finance, Mergers &amp; Acquisitions, Franchise Law, Wills, Trusts, Tax and Estate planning with a strong concentration in both corporate and personal tax.</p>\n\n<p>Prior to entering private practice, Hugues was sought out to be a co-founder of a new corporation with a unique mandate.  Cnapsis Inc. is a social enterprise, based in Canada, which supports local health care delivery efforts in developing countries by working with existing broad-scale implementation partners including USAID, John Snow Inc. and the Clinton Health Access Initiative to fine tune their approaches given geographic, human resource and financial resource limitations.  Hugues is a regular contributor to key strategic and operational decisions which most recently led to the development of a laboratory support network facilitating the HIV treatments for patients in a post-conflict zone in Northern Uganda.  As General Counsel, Hugues serves as the chief legal advisor to the management team of the company and he is responsible for the sound and efficient management of the legal affairs of Cnapsis.</p>\n\n<p>Hugues is a frequent legal contributor to various media across Canada and he is also a regular guest speaker at the MBA program and the Faculty of Law at the University of Ottawa. In addition, Hugues is a business partner with the OCRI Entrepreneurship Centre and he sits on the Canadian Youth Business Foundation (CYBF) loan review committee.</p>\n\n<p>Recognizing the importance of helping his community, Hugues is also the Founder, Chairman &amp; CEO of the Young Business Network of the National Capital, a not-for-profit organization that aims to empower business leaders in Ottawa. More recently, Hugues was appointed to the Campaign Cabinet of the United Way to assist in raising local and national corporate donations. He is also a co-founder of the Southam Club of National Art Center of Canada, which brings together a dynamic group of leaders through arts and culture.</p>","image":{"available_sizes":[[[150,108],"assets/images/resized/0016/8828/168828v2-max-150x150.jpg"],[[187,135],"assets/images/resized/0016/8828/168828v2-max-250x250.jpg"],[[187,135],"assets/images/resized/0016/8828/168828v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"LL.L","subject":"Civil Law","institution":"University of Ottawa","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"LL.B","subject":"Common Law","institution":"University of Moncton","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"","firm":{"name":"Andrews Robichaud","permalink":"andrews-robichaud","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/dir/Hugues/Boisvert","title":"LinkedIn"},{"external_url":"https://twitter.com/#!/_businesslawyer","title":"Twitter"}]}