{"first_name":"Hussein","last_name":"AL-NATSHEH","permalink":"hussein-al-natsheh-2","crunchbase_url":"http://www.crunchbase.com/person/hussein-al-natsheh-2","homepage_url":"http://ciapple.com","birthplace":"Kuwait","twitter_username":"hnatsheh","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"artificial-intelligence-ai, computational-intelligence-ci, business-intelligence-bi, data-mining, knowledge-based-economy, systematic-innovation, marketing, entrepreneurship-development, technology-commercialization-","alias_list":null,"created_at":"Sat Oct 16 17:09:20 UTC 2010","updated_at":"Wed Oct 20 23:58:42 UTC 2010","overview":"<p>Hussein AL-NATSHEH is a passionate young technology business entrepreneur. Currently, AL-NATSHEH is the founder and General Manager of Ciapple, innovative technology venture based in Amman offering business intelligence services for SMEs. He has a master degree in computer engineering (data mining and computational intelligence applications focus) from Jordan University of Science and Technology (JUST). Previously, he was the director of innovation division of the Queen Rania Center for Entrepreneurship (QRCE) and before the technology commercialization program manager in the same organization. Before that he was the founder and chairman of International Electronic &amp; Electrical Engineers (IEEE) Branch at Balqa&#8217; Applied University.\nAL-NATSHEH has received many business planning awards and recognitions from national, regional, and European innovation and entrepreneurship support organizations like QRCE, JEDCO, ASTF, Mowgli, OECD, Ijma3, MedVentures and SRTD. He has also proven skills in systematic innovation and problem solving (TRIZ), technology marketing and Blue Ocean Strategy, Intellectual property, technology commercialization and innovation management, project management, human resources management, entrepreneurship and business planning, networking, public presentation and leadership. \nAl-Natsheh was a speaker in several regional and international meetings including: The Multi-Year Expert Meeting on &#8220;Enterprise Development and Science, Technology and Innovation&#8221;, which took place from 20 to 22 January 2010, UNCTAD, United Nations Building, Geneva, Switzerland, and in the 4th Meeting of the MENA-OECD Working Group on SME Policy, Entrepreneurship and Human Capital Development held in Tunis on 29-30 March 2010. A Delegate in the Regional Seminar on Approaches for Strengthening National Innovation Systems on 16 and 17 February 2010, Damascus, Syria: Promotion of Innovation and Technology for small and medium sized enterprises in Near East. Organized by GTZ.</p>\n\n<p>Specialties\nArtificial Intelligence (AI), Computational Intelligence (CI), Business Intelligence (BI), data mining, knowledge-based economy, systematic innovation, marketing, entrepreneurship development, and technology commercialization.</p>\n\n<p>Honors and Awards:</p>\n\n<ul>\n<li>First Award in Arab Technology Business Plan Competition - Seed Stage Category 2008-2009</li>\n<li>Dedication Award, IEEE ME-SBC Congress 2009</li>\n<li>Third Place Award, MENA100 Business Plan Competition, 2009, Bahrain</li>\n<li>One of the 3 Finalists of the Arab Golden Chip Award : Best Software for Export, MENAICT Week, Bahrain, 2010</li>\n<li>Third Award in Queen Rania National Entrepreneurship Competition 2007</li>\n</ul>","image":{"available_sizes":[[[108,150],"assets/images/resized/0010/5877/105877v2-max-150x150.png"],[[180,250],"assets/images/resized/0010/5877/105877v2-max-250x250.png"],[[259,359],"assets/images/resized/0010/5877/105877v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}