{"first_name":"Hyder","last_name":"Rabbani","permalink":"hyder-rabbani","crunchbase_url":"http://www.crunchbase.com/person/hyder-rabbani","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Oct 29 22:31:59 UTC 2008","updated_at":"Wed Oct 29 22:34:54 UTC 2008","overview":"<p>As Executive Vice President of Sales and Business Development, Hyder is directly responsible for worldwide revenue generation efforts, business development, as well as the day-to-day operations of the company’s sales and marketing organizations.</p>\n\n<p>Hyder formerly served as Senior Vice President of Worldwide Sales at DivX Inc. (NASDAQ:DIVX), a leading developer of video compression, digital rights management and media language technologies, where he grew the company into a multi-national organization with revenue of $60 million in 2006.</p>\n\n<p>Prior to DivX, he was President and Chief Operating Officer at Archos, Inc. (Paris: JXR.PA), a manufacturer of portable digital multimedia solutions; Vice President of Sales and Business Development at Musicmatch, a provider of digital music software and services which was acquired by Yahoo! Before joining Musicmatch, Hyder held various senior management positions during 11 years at Intel Corporation, most recently as Director of Sales in the Consumer Products Group responsible for Europe, Middle East and Africa (EMEA). Other previous roles included sales management positions at the networking software company Novell and dBASE II, III and IV pioneer - Ashton-Tate.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"VP Sales & Business Development","firm":{"name":"Brickfish","permalink":"brickfish","type_of_entity":"company","image":{"available_sizes":[[[150,46],"assets/images/resized/0002/7572/27572v6-max-150x150.png"],[[231,71],"assets/images/resized/0002/7572/27572v6-max-250x250.png"],[[231,71],"assets/images/resized/0002/7572/27572v6-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}