{"first_name":"Ian","last_name":"Swanson","permalink":"ian-swanson","crunchbase_url":"http://www.crunchbase.com/person/ian-swanson","homepage_url":"http://www.sometrics.com","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Userplane","born_year":null,"born_month":null,"born_day":null,"tag_list":"sometrics, ceo, co-founder, social-media, analytics, advertising","alias_list":null,"created_at":"Thu May 15 05:36:13 UTC 2008","updated_at":"Sun Feb 05 05:31:26 UTC 2012","overview":"<p>Ian Swanson is Vice President, Serve Enterprises at American Express. In this role, Ian oversees development of Serve’s loyalty programs and virtual currencies on a global scale across multiple consumer sectors.   He previously served as CEO and co-founder at Sometrics prior to its acquisition by American Express, where he led the company’s analytics, in-game payments and optimization platform expansion to online game developers worldwide.</p>\n\n<p>With years of experience working with publishers, advertisers and consumers within online games, including MMOs, casual and social games, Swanson established Sometrics to help online game publishers market their games, monetize players and optimize virtual currency platforms. The company’s platform allows partners to learn which audience demographics are responding to specific offers and direct traffic accordingly to optimize conversions and increase revenue. Further, the Sometrics payment processing and optimization solution was most recently integrated with American Express’ Serve digital payments and commerce platform. </p>\n\n<p>Under Swanson’s leadership, Sometrics launched the industry’s first virtual currency platform in December 2008, helping publishers manage all virtual currency monetization from multiple offer providers. Today, the platform has move more than 3.3 trillion units of virtual currency with a global reach supporting 90 different payment options and serving an audience of 225 million gamers in 180 countries.</p>\n\n<p>Before the launch and subsequent acquisition of Sometrics by American Express , Swanson was business development manager for Userplane, an AOL company that provides social media apps to hundreds of thousands of online communities, supporting millions of users daily. He was instrumental in helping the company extend the reach of its hosted chat, IM and other communications apps, and in building the company’s ad network. Prior to Userplane, he was an executive with Sprint and helped launch two mobile web startups.</p>\n\n<p>Swanson actively advises several successful social networking applications, Fortune 500 companies and startups with their brand and marketing strategies within the social media ecosystem. He has been invited to speak on many topics relating to platform apps, social marketing, performance-based analytics and game discovery.</p>","image":{"available_sizes":[[[119,150],"assets/images/resized/0002/7578/27578v2-max-150x150.jpg"],[[199,250],"assets/images/resized/0002/7578/27578v2-max-250x250.jpg"],[[359,450],"assets/images/resized/0002/7578/27578v2-max-450x450.jpg"]],"attribution":"<p>[Social Ad Summit &#8216;08] (http://socialadsummit.com)</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Sometrics","permalink":"sometrics","type_of_entity":"company","image":{"available_sizes":[[[150,38],"assets/images/resized/0001/8642/18642v9-max-150x150.png"],[[178,46],"assets/images/resized/0001/8642/18642v9-max-250x250.png"],[[178,46],"assets/images/resized/0001/8642/18642v9-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Vice President, Serve Enterprises","firm":{"name":"American Express","permalink":"americanexpress","type_of_entity":"company","image":{"available_sizes":[[[100,98],"assets/images/resized/0002/2002/22002v1-max-150x150.png"],[[100,98],"assets/images/resized/0002/2002/22002v1-max-250x250.png"],[[100,98],"assets/images/resized/0002/2002/22002v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Business Development","firm":{"name":"Userplane","permalink":"userplane","type_of_entity":"company","image":{"available_sizes":[[[150,36],"assets/images/resized/0000/4036/4036v1-max-150x150.png"],[[200,49],"assets/images/resized/0000/4036/4036v1-max-250x250.png"],[[200,49],"assets/images/resized/0000/4036/4036v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/profile?viewProfile=&key=11642924","title":"Linkedin"}]}