{"first_name":"Ian","last_name":"Sands","permalink":"ian-sands","crunchbase_url":"http://www.crunchbase.com/person/ian-sands","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Microsoft","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed May 14 08:47:38 UTC 2008","updated_at":"Fri Oct 08 23:23:54 UTC 2010","overview":"<p>Ian Sands is the Director of Envisioning for Microsoft Office Labs, an R&amp;D organization in Redmond, Washington.  In this role, Ian is responsible for driving Microsoft’s 10 year productivity vision and strategy, working with thought-leaders across industries and throughout Microsoft to explore the intersection of customer challenges and emerging technologies. </p>\n\n<p>In driving this effort, Ian builds upon his experience as the founding Director of the Industry Innovations Group, a thought-leadership organization that he formed in 2003 with the goal of helping customers and partners understand the potential behind Microsoft’s R&amp;D. \nA key component of the team’s strategy is to envision scenarios for how leading edge technologies might be used in real world settings – such as finance, retail, manufacturing and health care – over the next 5-10 years. In addition, the team creates a conduit to feed customer insights and potential partnerships back into the company, helping to drive future innovation and long-term technology roadmaps.</p>\n\n<p>A twelve year Microsoft veteran, Ian began his career in the Research organization, exploring interactive TV concepts with a creative think-tank called the Blender. Following that, he spent several years holding key roles in the launch of several Microsoft Internet businesses – including Slate, MSNBC, MSN and Shop.Microsoft.com. Following which Ian spent four years in the Microsoft Consulting Services division holding a leadership role with the Advanced Technology group.  During this time, he founded a team and built a business that was focused on providing user interaction expertise for strategic customer engagements world-wide.</p>\n\n<p>Ian works as a strategic advisor to Fortune 100 companies and thought-leadership institutions world-wide, participating on advisory boards, forums and future think-tank initiatives.  His education includes the University of California, Davis and the Art Center College of Design in Pasadena, where he graduated with honors and holds a bachelor of science in Industrial Design.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/8561/18561v3-max-150x150.jpg"],[[250,250],"assets/images/resized/0001/8561/18561v3-max-250x250.jpg"],[[333,333],"assets/images/resized/0001/8561/18561v3-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Director of Envisioining, Microsoft Office Labs","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}