{"first_name":"Ian","last_name":"J. Berg","permalink":"ian-j-berg-2","crunchbase_url":"http://www.crunchbase.com/person/ian-j-berg-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"ETF Venture Funds","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jun 25 23:50:59 UTC 2008","updated_at":"Thu Mar 05 23:09:59 UTC 2009","overview":"<p>Ian J. Berg brings over 30 years of experience in the financial and healthcare services industries. He helps portfolio companies with both strategic and tactical planning and brings to the fund deep financial, operational, and transaction structuring expertise. He has served on the Board of Directors of several of ETF portfolio companies, including SeamlessWeb. Currently, he is on the Board of Directors &amp; Audit Committee of NutriSystem (NASDAQ: NTRI) and on the Investment Committee Merion Investment Partners. Berg also serves on the Board of Directors of Healthcare Finance Group, Inc. and is an Adjunct Professor of Venture Financing at Drexel University Lebow College of Business.</p>\n\n<p>Berg was the founder, President and CEO of Copelco Financial Services Group which under his leadership amassed over $5 billion in assets, grew to 1,600 employees, and generated over $500 million in revenues in the US, Canada and Europe. In 2000, Copelco was sold to Citicorp (NYSE: C). Berg was the past chairman of the Philadelphia chapter of Young Presidents&#8217; Organization (YPO), Philadelphia Presidents&#8217; Organization (PPO) and founder and former president of the &#8220;I Have a Dream&#8221; Foundation of Camden, NJ.</p>\n\n<p>Berg is a contributing writer to several industry publications and a featured speaker on financial services and the high technology sector. He served on many private company boards and on the boards of several non-profit organizations including Center for the Advancement and Study of Entrepreneurship at Temple University, The Institute for Art in Education, Jewish Federation Senior Housing of Southern New Jersey, Coriell Institute for Medical Research, and Wistar Institute. </p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0003/7292/37292v2-max-150x150.jpg"],[[150,200],"assets/images/resized/0003/7292/37292v2-max-250x250.jpg"],[[150,200],"assets/images/resized/0003/7292/37292v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BS","subject":"Industrial Engineering","institution":"Drexel University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"Drexel University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}