{"first_name":"Igor","last_name":"Sill","permalink":"igor-sill","crunchbase_url":"http://www.crunchbase.com/person/igor-sill","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Apr 14 05:02:15 UTC 2008","updated_at":"Sun Jan 04 23:52:35 UTC 2009","overview":"<p>Igor Sill is a Silicon Valley venture capitalist and investor.</p>\n\n<p>Sill was educated at the University of California, Berkeley (1975). In 2004 he was a member of the first cohort to complete the Executive MBA program at the Saïd Business School, University of Oxford and a Merton College fellow. He has completed a number of other courses, including De Anza College Microprocessor Design and Programming Certification Program (1980), Stanford Graduate School of Business Advanced Management College (1981), Strategic Marketing Management (1983), and Stanford Executive Program (1984), the Venture Capital Institute certification program (1996), Harvard Business School Venture Capital Program (1997), and Stanford Law School Directors College (1998).</p>\n\n<p>At an early stage in his career Sill rose through the ranks to become the General Manager of Exxon Corporation&#8217;s technology venture arm, EIS, and managed the internal merger and integration of Exxon Corporation&#8217;s three high technology divisions, Qwip, QYX, and VYDEC in San Francisco.</p>\n\n<p>He then served as Vice President of Visual Engineering, a 3D graphics software company, founding management team member of Berkeley based Ingres, a commercially supported, open-source relational database management system.</p>\n\n<p>In 1984 Sill founded GenevaGroup International, Inc., later becoming Chairman in 1997. He is now Managing Director and co-founder of Geneva Venture Partners, a San Francisco-based venture capital and advisory services firm focused on technology investments.</p>\n\n<p>Sill was an early investor in Salesforce.com, Tumbleweed, Callixa (SAP AG), Siebel Systems (Oracle Corporation), Extricity, Finjan, NetGravity, BEA WebLogic, Jaspersoft, Polaris Wireless and Zantaz (Autonomy Corporation). He is currently, or has been, a Board Member of Callixa, Encirq, and Karna, and an Advisory Board Member of Salesforce.com, BlinkLogic and Red Herring Communications.</p>\n\n<p>Sill is a member of the Board of Directors of the International Myeloma Foundation (IMF), serving as Chairman of the Governance Committee, is an Associate member of Woods Hole Oceanographic Institution (WHOI), Association of Science-Technology Centres, Federation of American Scientists, Member and supporter of Young America&#8217;s Foundation-Ronald Reagan Ranch.</p>","image":null,"degrees":[],"relationships":[],"investments":[{"funding_round":{"round_code":"a","source_url":"http://www.redherring.com/Home/5202","source_description":"Red Herring","raised_amount":17000000,"raised_currency_code":"USD","funded_year":1999,"funded_month":12,"funded_day":2,"company":{"name":"Salesforce","permalink":"salesforce","image":{"available_sizes":[[[150,117],"assets/images/resized/0001/1691/11691v3-max-150x150.png"],[[250,195],"assets/images/resized/0001/1691/11691v3-max-250x250.png"],[[300,235],"assets/images/resized/0001/1691/11691v3-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/igorsill","title":"LinkedIn"}]}