{"first_name":"Illi","last_name":"Edry","permalink":"illi-edry","crunchbase_url":"http://www.crunchbase.com/person/illi-edry","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 14 17:33:41 UTC 2008","updated_at":"Sun Nov 16 19:51:30 UTC 2008","overview":"<p>Illi Edry is a versatile new-media expert, bringing over 15 years of exceptional experience in the media and new-media industries, managing digital content, marketing and business development across platforms; Web, Games, Mobile, iTV, VOD and more. Illi has extensive experience with end-user behavior and digital culture, coupled with profound insight into the media industry from both the content owner&#8217;s and the advertisers&#8217; perspective.</p>\n\n<p>Before joining JVP, Illi was the CEO of Popcorn Box, a new media content aggregation agency and consulting house. Prior to that, he served as VP of Marketing, Interactive &amp; Formats at Keshet Broadcasting, Israel&#8217;s leading commercial TV network.  At Keshet he was responsible for the business development of online, mobile and digital media content and was the creative force behind many of their groundbreaking projects. He also headed Keshet Formats, the international TV formats and programs exporting arm, selling the network&#8217;s original TV formats to over 25 territories worldwide, striking content distribution deals with European broadcasters, as well as studios like CBS, Fox, Sony, Granada, Pro7Sat1 and others.</p>\n\n<p>As early as 1999, Illi was part of the founding team of Infogate Online, a company that aspired to set up one of the world&#8217;s first consumer oriented video and games on demand operation over broadband internet.</p>\n\n<p>Illi holds a BS in Business Administration from South Eastern University and an MA in Marketing Management from the London based Middlesex University Business School.</p>","image":{"available_sizes":[[[150,103],"assets/images/resized/0002/8697/28697v1-max-150x150.jpg"],[[160,110],"assets/images/resized/0002/8697/28697v1-max-250x250.jpg"],[[160,110],"assets/images/resized/0002/8697/28697v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Partner JVP Studio","firm":{"name":"Jerusalem Venture Partners","permalink":"jerusalem-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[104,150],"assets/images/resized/0002/8552/28552v2-max-150x150.jpg"],[[113,162],"assets/images/resized/0002/8552/28552v2-max-250x250.jpg"],[[113,162],"assets/images/resized/0002/8552/28552v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}