{"first_name":"Ilya","last_name":"Cantor","permalink":"ilya-cantor","crunchbase_url":"http://www.crunchbase.com/person/ilya-cantor","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri May 08 13:34:59 UTC 2009","updated_at":"Thu May 21 07:13:43 UTC 2009","overview":"<p>Ilya Cantor, Chief Financial Officer, joined EPAM in July 2006. Mr. Cantor is a CPA who brings to EPAM a strong background in finance, operations, strategic planning, and business development; as well as extensive international experience. Prior to joining EPAM, Mr. Cantor spent seven years in a variety of financial and operational positions at Dow Jones. In his last position he served as Executive Director of Operations of the Wall Street Journal, responsible for the highly successful launch of the Weekend Edition of the WSJ, as well as executing a strategic repositioning of the Journal&#8217;s International Editions. Prior to that, Ilya was the CFO of the Wall Street Journal (2003 to 2006), and Group Finance Director of WSJ International (1999 to 2003). In 2002 Mr. Cantor was appointed to the Board of Directors of CNBC International, financial news television joint venture between NBC and Dow Jones in Asia and Europe. Before joining Dow Jones in 1999, Ilya was the Chief Financial Officer of Independent Media (now Independent Media - Sanoma), a leading publishing house based in Moscow, Russia. Previous to this, Ilya was an Audit Manager with Coopers &amp; Lybrand (now PriceWaterhouseCoopers) in Moscow. He started his career with C&amp;L in Los Angeles in 1991, after graduating from the California State University at Long Beach.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Financial Officer","firm":{"name":"EPAM Systems","permalink":"epam-systems","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0004/3324/43324v2-max-150x150.png"],[[162,65],"assets/images/resized/0004/3324/43324v2-max-250x250.png"],[[162,65],"assets/images/resized/0004/3324/43324v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}