{"first_name":"Intown","last_name":"Realtors","permalink":"intown-realtors","crunchbase_url":"http://www.crunchbase.com/person/intown-realtors","homepage_url":"http://www.intown.in","birthplace":"","twitter_username":"","blog_url":"http://www.facebook.com/propertyinnoida","blog_feed_url":"http://www.facebook.com/propertyinnoida","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"intown-in, intown-realtors-pvt-ltd, intown-noida, property-dealers-in-noida, mahagun-mezzaria, antriksh-golf-city, ajnara-ambrosia-noida, mahagun-mezzaria-noida, ajnara-ambrosia-sector-118-noida, new-projects-in-noida","alias_list":null,"created_at":"Thu Apr 26 06:42:58 UTC 2012","updated_at":"Sun May 06 03:25:22 UTC 2012","overview":"<p>In Town Realtors Pvt. Ltd. was incorporated by a group of aspiring individuals  from diverse background like Merchandising, Manufacturing and Consultancy to create value for the customer, by providing expert solutions for their real estate needs. This Endeavour was driven by the motto to provide efficient housing solutions to the deprived, as well as smart investment options for the astute investor.</p>\n\n<p>With so many builders offering a wide array of projects, it becomes very difficult and confusing to make a purchase decision, and rightly so because a slight fumble can cost you money. So to guide you throughout your property purchase process, we offer expertise for solutions in the field real estate, as a whole.</p>\n\n<p>Over the years hawse have developed a unique business model that meets the futuristic requirements of its customers through enhanced value additions at every step.  The whole process is divided into different services like land identification, property consultation and management services. We also facilitate conceptualisation, through to completion of any kind of real estate projects, Realty Surveys etc. so as to provide personalised solution to the client.</p>\n\n<p>Core Values</p>\n\n<ul>\n<li>Serving our client with integrity and honesty.</li>\n<li>Increase overall efficiency at all levels.</li>\n<li>Ensure profitable growth and wealth enhancement, for the investor.</li>\n</ul>\n\n<p>Mission</p>\n\n<ul>\n<li>To provide personalised real estate solution to the client while striving for excellence in every process.</li>\n<li>To maintain life-long relationship with the customers/clients.</li>\n</ul>\n\n<p>Why us?</p>\n\n<p>We work as a team with professiona- values, driven approach to the whole process. More-over, we have the required skill-sets and resources to achieve the best real estate deal possible for you. This has been possible because of the high level of expertise brought together by this company.</p>\n\n<p>The core aim has always been to conduct real estate transactions in a transparent and candid way, which has always helped us developing long-term association with our clients and property owners.</p>","image":{"available_sizes":[[[150,113],"assets/images/resized/0018/6097/186097v2-max-150x150.jpg"],[[229,174],"assets/images/resized/0018/6097/186097v2-max-250x250.jpg"],[[229,174],"assets/images/resized/0018/6097/186097v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}