{"first_name":"Ira","last_name":"Williams","permalink":"ira-williams","crunchbase_url":"http://www.crunchbase.com/person/ira-williams","homepage_url":"","birthplace":"Los Angeles","twitter_username":"irawilliams","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jul 29 18:13:39 UTC 2011","updated_at":"Mon Aug 01 22:16:50 UTC 2011","overview":"<p>With over twenty years’ experience in sales, marketing, project management and business development, Ira Williams is a uniquely capable business leader who has extensive experience working with new ventures, as well as securing strategic partnerships and acquisitions for multiple start-up companies.</p>\n\n<p>A graduate of the Harvard Business School, Ira has worked with firms such as Callaway Golf, Dell Inc., and CBS SportsLine. Over this time, he has garnered significant expertise in the new media content and e-commerce sectors. </p>\n\n<p>He is the President and COO of iTaggit, an Austin, TX-based start-up. He was the Vice President of Golfsmith’s E-commerce and Direct Marketing operations, and he led acquisition efforts at InterZine Productions and at CBS SportsLine, successfully securing strategic elements that drove their respective growth plans.</p>\n\n<p>While attending Harvard, Ira also held business development roles with Internet startups such as Yoyodyne (now a subsidiary of Yahoo) and Avicenna (a health care start-up acquired by a major managed care organization.) Prior to attending Harvard, he excelled in sales and marketing positions with Reuters America and IBM in Los Angeles, New York, Chicago and Mexico City. </p>\n\n<p>Ira is also the Founder and CEO of Debut Ventures, Inc., a family controlled holding company. Ira’s network of contacts in the Internet, financial services, sports and entertainment industries is extensive which, in turn, has allowed him to assemble &#8220;all-star&#8221; project teams to help launch new ventures.</p>\n\n<p>In 2006, Ira published his first book, entitled Speak Softly…What’s Happened to American Humility? In addition to celebrating a misunderstood virtue, all proceeds from the book are donated to charitable organizations.</p>\n\n<p>Ira completed his undergraduate studies at Stanford University with an AB in International </p>","image":{"available_sizes":[[[150,143],"assets/images/resized/0014/6962/146962v2-max-150x150.jpg"],[[180,172],"assets/images/resized/0014/6962/146962v2-max-250x250.jpg"],[[180,172],"assets/images/resized/0014/6962/146962v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"AB","subject":"International Relations","institution":"Stanford","graduated_year":1989,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"General Management","institution":"Harvard","graduated_year":1996,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}