{"first_name":"Irene","last_name":"Barron","permalink":"irene-barron","crunchbase_url":"http://www.crunchbase.com/person/irene-barron","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Feb 22 13:49:34 UTC 2011","updated_at":"Tue Feb 22 13:54:08 UTC 2011","overview":"<p>An expert in her field, Ms. Barron has more than 25 years of experience in business office operations and revenue cycle management, with extensive knowledge of registration, insurance billing, collections and reimbursement, as well as overall monitoring and reporting of accounts receivable. Ms. Barron has been instrumental in developing and implementing policies and procedures in all aspects of the business office in order to keep up with the ever-changing healthcare industry. She began her career in the early 1980s as an insurance biller in a 200-bed facility, and quickly reached the level of Director of Patient Accounts and completed all modules of the HCA Business Office Management programs. She has served in a consulting capacity for Triad Hospitals in both the hospital and clinic settings, and she has successfully implemented central scheduling departments and upfront policies and procedures in order to maximize accuracy and upfront collections. Ms. Barron holds a degree in supervisory management technology and is a member of the Healthcare Financial Management Association.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Operating Officer and Product Management Officer","firm":{"name":"nTelagent","permalink":"ntelagent","type_of_entity":"company","image":{"available_sizes":[[[150,20],"assets/images/resized/0012/3371/123371v1-max-150x150.jpg"],[[250,34],"assets/images/resized/0012/3371/123371v1-max-250x250.jpg"],[[446,61],"assets/images/resized/0012/3371/123371v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}