{"first_name":"Irina","last_name":"Mappin","permalink":"irina-mappin","crunchbase_url":"http://www.crunchbase.com/person/irina-mappin","homepage_url":"http://www.irinamappin.com","birthplace":"Kazakhstan","twitter_username":"CamelotCastleHo","blog_url":"http://irinamappin.wordpress.com/","blog_feed_url":"","affiliation_name":"Camelot Castle","born_year":null,"born_month":null,"born_day":null,"tag_list":"irina-mappin, john-mappin, ted-stourton, camelot-castle-hotel, travel, leisure","alias_list":null,"created_at":"Thu Sep 13 06:46:36 UTC 2012","updated_at":"Wed Sep 19 15:44:42 UTC 2012","overview":"<p>Irina Mappin was born and grew up in Kazakhstan, where she heard about her learned ancestors, some of whom had held advisory and educational positions in the courts of the Tsars and in more recent eras.</p>\n\n<p>Although she studied economics and political science at a UK university, her life took a different course and she is now wife to and business partner of John Mappin. John Mappin hails also hails from a dynasty, one that is well known to the British public as Mappin &amp; Webb jewellers having been on the country&#8217;s high streets for decades.</p>\n\n<p>Irina and John Mappin co-own Camelot Castle Hotel in Cornwall with artist friend Ted Stourton. At Camelot, Irina has opportunity to support and perhaps influence a new generation of artists in much the same way as her ancestors had done in the Kazakhstan and Russia. </p>\n\n<p>Her Artists in Residence programme at Camelot aims to attract creative people in need of inspiration and a helping hand to make the transition into making a living out of art in its many forms. For some, this might mean completing a book they have long dreamed of publishing. For others, the Camelot programme may just give their work and their confidence they need to sell their first works of art. However, it is not only the content of the programme that is behind the success of its participants. Simply being in this beautiful, romantic part of Cornwall, in a historic castle that draws on a semi-mystical story of its own – that of King Arthur and the Knights of the Round Table – certainly adds value and inspiration, and often the very muse the artist needed to make his or her big breakthrough.</p>\n\n<p>Another of Irina&#8217;s programmes at Camelot is Icons of the Future, through which she aims to link young artists with the teachers most suited to drawing out their talent and taking their artistic aspirations to the next level. </p>\n\n<p>With her sheer energy, love of art, empathy for artists and entrepreneurial skills, it was only a matter of time until Irina would take on artist management, initially managing the work of friend and business partner, Ted Stourton. She has since added to the portfolio of artists under her management, but she is very low key about this aspect of her work to avoid stealing the artists&#8217; place in the public eye.</p>\n\n<p>Irina Mappin is also very much involved in the management of Camelot Castle Hotel, using her unusual home as backdrop to many official visits from VIPs from her home country, thus bringing together the different threads of her life. In the last year, for example, she has held events to honour the Kazakhstan President on his birthday and ceremoniously noted the arrival of the Kazakhstan Olympic Team in London for the 2012 Olympic Games.</p>\n\n<p>Ballet is one of Irina&#8217;s great loves - she studied choreography when she was much younger. An excellent hostess and socialiser, Irina loves nothing more than hosting her numerous friends and associates, and Camelot&#8217;s band of international followers, in the halls and grounds of her beloved Camelot Castle.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Owner","firm":{"name":"Camelot Castle","permalink":"camelot-castle","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.prweb.com/releases/2012/7/prweb9745830.htm","title":"Irina Mappin and Camelot Castle Welcomes Kazakhstan Olympic Team"}],"web_presences":[{"external_url":"http://www.irinamappin.net","title":"Irina Mappin Wiki Page"},{"external_url":"http://www.4networking.biz/Members/Details/83304","title":"Irina Mappin on 4Networking"},{"external_url":"http://irina-mappin.tumblr.com/","title":"Irina Mappin on Tumblr"}]}