{"first_name":"Irma","last_name":"Calderon","permalink":"irma-calderon","crunchbase_url":"http://www.crunchbase.com/person/irma-calderon","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Common Sense","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jun 16 17:22:55 UTC 2008","updated_at":"Mon Jun 30 01:25:14 UTC 2008","overview":"<p>Irma is a marketing communications professional with extensive experience in all aspects of this discipline – from advertising and media relations to crisis and stakeholder management to relationship building and business development.  </p>\n\n<p>Irma spent 24 years with telecom giant SBC (now AT&amp;T) where she held middle and senior management positions in Public Relations, Advertising, Marketing and the SBC Foundation.     </p>\n\n<p>Her last position at SBC was Director of Diversity Marketing.  Irma’s most significant achievement for SBC was launching its first, hugely successful Hispanic marketing campaign in the early 90’s.  The campaign earned incremental, record sales for SBC and was recognized by the American Marketing Association with a GOLD EFFIE award for exceeding sales expectations.   </p>\n\n<p>Irma left SBC in 1995 to join The Cartel Group, a Hispanic marketing communications firm, where she launched its public relations and promotions arm.  At The Cartel Group, she became a partner and director of business development.  She helped take this agency from $25 million in annual billings to over $100 million and from 25 employees to more than 80 employees and over 30 free-lance vendors in two and one-half years.  </p>\n\n<p>After 5 years with The Cartel Group, she joined Web Head Group as a partner, where she immersed herself in web technology and landed the largest client ever for the company helping to double its billings in two years.  </p>\n\n<p>Today, Irma is helping to grow awareness of Common Sense and its proprietary e-mail marketing tool:  Doppler.  Through research, strategic planning and and offline/online marketing elements, Common Sense helps clients to grow their businesses. </p>\n\n<p>Through Doppler, Common Sense helps companies build stronger, ongoing relationships with their customers.</p>\n\n<p>Irma is on the board of the Non-Profit Resource Center and a member of Leadership Texas.  She has been president of the National Governing Board of the Hispanic Association of Communications Employees and named by Hispanic Magazine as one of the nation’s 100 most influential Hispanic women in the nation.  She has served on the board of the National Hispanic Employees Association, and she is frequently called upon to facilitate panels and speak at national marketing communications and PR conferences.  She has a bachelor’s of arts degree from the University of Texas at El Paso, where she majored in journalism.</p>","image":null,"degrees":[{"degree_type":"Bachelor of Arts","subject":"Major in Journalism","institution":"University of Texas at El Paso","graduated_year":1977,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}