{"first_name":"Irwin","last_name":"Gotlieb","permalink":"irwin-gotlieb","crunchbase_url":"http://www.crunchbase.com/person/irwin-gotlieb","homepage_url":"http://www.groupm.com/irwin-gotlieb","birthplace":"China","twitter_username":"IrwinGotlieb","blog_url":"http://irwingotlieb.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1949,"born_month":6,"born_day":25,"tag_list":"irwin-gotlieb, groupm, mediavest, wpp, ceo","alias_list":null,"created_at":"Sat Aug 27 22:10:07 UTC 2011","updated_at":"Tue Dec 27 08:32:03 UTC 2011","overview":"<p>Irwin Gotlieb is the Global CEO of GroupM, the leading global media investment management company.</p>\n\n<p>Irwin started his journey to becoming one of the most powerful men in Advertising and Media history in 1972 when he joined SSC&amp;B, Inc as the Manager of Network Relations before moving to Benton &amp; Bowles in 1977.  At Benton &amp; Bowles, Irwin started as the Associate Director of Broadcast Programming.  This, however, didn’t last long as through Irwin’s determination, work ethic and successes he was quickly promoted to Vice President of Benton &amp; Bowles within just 2 months.</p>\n\n<p>His success continued at Benton &amp; Bowles and in 1981 he was promoted to the Manager of National Broadcast  and then in 1983 he was appointed as the Senior Vice President, Director of National Broadcast and Programming.  Irwin continued in this role until 1990 when he was promoted to Senior Vice President Worldwide Director of Broadcast and Programming.</p>\n\n<p>In 1993 Irwin moved on to a new venture in the form of MediaVest Worldwide, which he founded through the combination of the former Televest and MediaVest units along with the unbundled media resources of DMB&amp;B.  While at MediaVest Worldwide Irwin acted as both President and CEO.</p>\n\n<p>Irwin Stayed with MediaVest Worldwide until September of 1999 when he joined WPP as the Chairman and CEO of MindShare Worldwide.  While at MindShare Irwin was responsible for launching MindShare North America and creating a global media entity through the consolidating of JWT and Ogilvy. </p>\n\n<p>Irwin has remained with WPP and in 2003 took over as the Global Chief Executive Officer for Group M, the world’s largest Media and Advertising company.  He holds this role to this day.</p>\n\n<p>Bragging rightsBroadcast and Cable Hall of Fame Inductee, Three time AdWeek/MediaWeek All Star, Presidents Award Recipient, Double Recipient of the Advertising Age Media Maven Honor, 2000 Advertising Age Media Player of the Year, 2010 Brandon Tartikoff Legacy Award Recipient, Former Chairman of the A.A.A.A. Committee on Broadcast Networks and Programming, Member of the A.A.A.A. CEO Committee, Member of the Board for the Executive Committee of Council and the Family Friendly Program Forum\nOccupationGlobal Chief Executive Officer of GroupM</p>","image":{"available_sizes":[[[118,150],"assets/images/resized/0015/1491/151491v2-max-150x150.jpg"],[[197,250],"assets/images/resized/0015/1491/151491v2-max-250x250.jpg"],[[250,316],"assets/images/resized/0015/1491/151491v2-max-450x450.jpg"]],"attribution":"<p>GroupM Global CEO Irwin Gotlieb</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://cdn.businessweek.com/profile/irwin-gotlieb/igotlieb021/","title":"Irwin Gotlieb's Businessweek Profile"}],"web_presences":[{"external_url":"http://www.linkedin.com/pub/irwin-gotlieb/31/112/2b2","title":"Irwin Gotlieb's LinkedIn Profile"},{"external_url":"http://irwingotlieb.com/","title":"Irwin's Official site"},{"external_url":"http://www.flickr.com/people/irwin-gotlieb/","title":"Irwin Gotlieb Pictures"},{"external_url":"http://en.wikipedia.org/wiki/Irwin_Gotlieb","title":"Irwin Gotlieb Wiki page"}]}