{"first_name":"Irwin","last_name":"Federman","permalink":"irwin-federman","crunchbase_url":"http://www.crunchbase.com/person/irwin-federman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Nov 27 05:32:06 UTC 2008","updated_at":"Fri Jun 05 18:05:24 UTC 2009","overview":"<p>Irwin Federman sees economic and industry cycles as temporary conditions during which businesses can consistently forge important skills and relationships. A veteran of the semiconductor industry and venture capital community, Irwin knows that great ideas are conceived in both up and down markets and that good management and execution can overcome tough conditions. It is perhaps counter-intuitive, he believes, that early-stage companies are often the beneficiaries of a less robust economic environment. </p>\n\n<p>&#8220;I derive enormous satisfaction from being associated with determined and capable people,&#8221; Irwin says. &#8220;People who have a passion for building a company. Many of today&#8217;s entrepreneurs persevered throughout the downturn of 2000-2003; they refused to be victimized by the times. That&#8217;s about more than venture capital &#8211; it gives one faith in the human condition.&#8221; </p>\n\n<p>Irwin joined USVP in 1990 as a general partner with significant investment experience: as CEO of Monolithic Memories, he led his firm&#8217;s investments in successful startups such as Cypress Semiconductor, Xilinx and Altera. During his tenure as CEO from 1978 to 1987, Irwin spearheaded MMI&#8217;s turnaround from virtual bankruptcy to a $250 million revenue organization. When MMI merged with Advanced Micro Devices, Irwin assumed the post of Vice Chairman of AMD. </p>\n\n<p>He is a former Chairman of the Semiconductor Industry Association and served as a board member of the National Venture Capital Association. As an ex-CEO, and someone who has enjoyed a collegial relationship with many CEOs over the years, he is certain of one thing: CEOs run their companies; not Boards, not investors. </p>\n\n<p>&#8220;Ultimately every decision is made by the management team,&#8221; says Irwin. &#8220;It is rewarding when I can share experience that helps them sort out their alternatives.&#8221; </p>\n\n<p>Irwin was a founding or lead investor in BeVocal, Blue Martini, Check Point Software Technologies, Centillium Communications, Crescendo Communications, Mellanox Technologies, MMC Networks, NeoMagic, Netro, Nuance Communications, Quick Logic, SanDisk and TelCom Semiconductor. </p>\n\n<p>As with other USVP partners, Irwin believes when you invest in a company, you invest in people. </p>\n\n<p>&#8220;It is particularly rewarding to receive a call from an entrepreneur who is wrestling with a thorny problem or is having difficulty reaching a significant decision. If he or she picks up the phone to share their angst and ask for your opinion, you know you have earned their trust. Nobody shares uncertainty otherwise.&#8221; </p>\n\n<p>Irwin received a B.S. in Economics from Brooklyn College and was awarded an Honorary Doctorate of Engineering Science from Santa Clara University. He was a recipient of the Anti-Defamation League&#8217;s Torch of Liberty, the Exemplary Community Leadership Award from the Silicon Valley Conference for Community and Justice, and was installed in Junior Achievement’s Silicon Valley Hall of Fame. He serves as a Trustee of the San Francisco Ballet and of his alma mater, Brooklyn College. </p>\n\n<p>Irwin enjoys fishing and reading and is an eclectic cook. His culinary alchemy is based on working with whatever&#8217;s in the kitchen. &#8220;It&#8217;s not unlike a business &#8211; you try to maximize the best of what you&#8217;ve got to work with.&#8221;</p>","image":{"available_sizes":[[[125,125],"assets/images/resized/0004/6985/46985v1-max-150x150.jpg"],[[125,125],"assets/images/resized/0004/6985/46985v1-max-250x250.jpg"],[[125,125],"assets/images/resized/0004/6985/46985v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner ","firm":{"name":"US Venture Partners","permalink":"us-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[103,58],"assets/images/resized/0001/5080/15080v1-max-150x150.png"],[[103,58],"assets/images/resized/0001/5080/15080v1-max-250x250.png"],[[103,58],"assets/images/resized/0001/5080/15080v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"General Partner","firm":{"name":"U.S. Venture Partners","permalink":"u-s-venture-partners-2","type_of_entity":"financial_org","image":{"available_sizes":[[[95,42],"assets/images/resized/0004/6983/46983v1-max-150x150.png"],[[95,42],"assets/images/resized/0004/6983/46983v1-max-250x250.png"],[[95,42],"assets/images/resized/0004/6983/46983v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}