{"first_name":"Isabel","last_name":"Sabadi","permalink":"isabel-sabadi","crunchbase_url":"http://www.crunchbase.com/person/isabel-sabadi","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Widgadget","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Oct 06 10:20:54 UTC 2008","updated_at":"Tue Nov 04 03:53:42 UTC 2008","overview":"<p>Isabel Sabadi is CEO and co-founder of Iris Experience, an online marketing agency created in 2005 in Barcelona. Winner of several awards including the Digital Innovation price of bDigital Global Congress, Iris Experience creates innovative spaces of online communication and provide web marketing solutions for firms and Internet users. The company counts clients in Spain, France, Australia and South America with Ayuntamiento de Barcelona, Applus, TNC, Mercafutbol, Universitat Ramón llull, La Redoute, Lonely Planet, etc.</p>\n\n<p>Isabel’s new project is the development of Widgadget.com, a community portal for widgets creation and distribution. She has a 10 years experience of online marketing in several innovative companies in the Telecom, Internet, Media &amp; Entertainment sector.</p>\n\n<p>Apart from the company she owns and manages, Isabel is also Emarketing Teacher in the Marketing Management Program at Fundemi-IQS, and Services Marketing Program Coordinator at IDEC-UPF. She is also actively involved in sector conferences and papers in Spain and all over Europe.</p>\n\n<p>Isabel is graduated in Management and Marketing from IDEC-UPF in Barcelona, with a PhD in Marketing (Madrid). When she is not online, she enjoys the sunny beach, travelling the world and sailing.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Widgadget","permalink":"widgadget","type_of_entity":"company","image":{"available_sizes":[[[150,133],"assets/images/resized/0002/6216/26216v2-max-150x150.png"],[[250,222],"assets/images/resized/0002/6216/26216v2-max-250x250.png"],[[450,399],"assets/images/resized/0002/6216/26216v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}