{"first_name":"Isan","last_name":"Chen","permalink":"isan-chen","crunchbase_url":"http://www.crunchbase.com/person/isan-chen","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Mar 06 13:24:27 UTC 2012","updated_at":"Tue Mar 06 13:26:10 UTC 2012","overview":"<p>Isan Chen, M.D. is a board certified hematologist-oncologist with more than 12 years of oncology experience and has extensive experience working with regulatory agencies in the US, Canada, Europe and Asia. Previously he was Vice-President, Genitourinary Tumor Strategy Leader for Pfizer Oncology. In this role, he was responsible for the implementation of strategic plans to ensure Pfizer’s leadership in the treatment of patients with renal cell carcinoma (RCC) and for the development of improved therapies for prostate and bladder cancer. He was the clinical lead for genitourinary indications and was part of the team responsible for the successful NDA submission of SUTENT in advanced renal cell carcinoma leading to its approval in January of 2006. He additionally was involved in design and implementation of Phase 3 registration trials of axitinib in treatment-naïve and previously-treated RCC and was the clinical lead for crizotinib at the time of the investigational new drug application. He completed his hematology-oncology fellowship at University of California, San Diego, and served as a faculty member in the Department of Genitourinary Medical Oncology at the University of Texas, MD Anderson Cancer Center.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Medical Officer","firm":{"name":"Aragon Pharmaceuticals","permalink":"aragon-pharmaceuticals","type_of_entity":"company","image":{"available_sizes":[[[150,43],"assets/images/resized/0004/9225/49225v2-max-150x150.jpg"],[[226,66],"assets/images/resized/0004/9225/49225v2-max-250x250.jpg"],[[226,66],"assets/images/resized/0004/9225/49225v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}