{"first_name":"Ismael","last_name":"Garzina","permalink":"ismael-garzina","crunchbase_url":"http://www.crunchbase.com/person/ismael-garzina","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Crea Labs","born_year":1979,"born_month":6,"born_day":4,"tag_list":"","alias_list":null,"created_at":"Tue Feb 03 13:01:31 UTC 2009","updated_at":"Thu Mar 05 23:51:58 UTC 2009","overview":"<p>Ismael Garzina started his professional career as a Systems Administrator and Analyst in charge of designing the architecture of large networks and managing them. His job turned into a passion and nowadays he leads a group of 40 employees and supervises all operations at Crea| SX Networks. He’s been depicted (especially by himself) as a fair boss and for some reason his workmates really enjoy playing contact sports with him.\nDuring his six years with Crea| SX Networks, Ismael has had the opportunity to work with clients such as The Turner Broadcasting Systems Inc., Conviva, IamFootball.com, Panda Software, Bacardi, Wamba.com, Hispavista, Bingos.com, Bingos.co.uk, MediaGambling, ElGranBingo.com, Mambo.ca, HealthCare.com, among others.\nCurrently, Crea| SX Networks and its group of talented professionals are focused on projects that involve hosting, development, design, consulting, marketing and customer support.  </p>\n\n<p>ISMAEL GARZINA’S EXPERIENCE\nCEO \nCrea Uruguay\nJune 2008 — Present (9 months) \nAs the CEO of Crea, part of the Crea Group, he supervises all operations, oversees project planning, contacts clients, conducts negotiations and takes all major decisions concerning the company.\nHe has also promoted a restructuring of the company which involves providing new services and training in the latest technologies. \nCrea Uruguay (formerly SX Networks) is a six-year-old company that provides Web 2.0 services, focusing on Social Networks Software, Video Players and Video Streaming, Online Video Encoding, Games and Animations, as well as more traditional Web Services like Corporate Sites Design, Development and Hosting.</p>\n\n<p>COO \nSX Networks\nJune 2005 — June 2008\nIn charge of the development and implementation of all national and international projects, the reference for clients with whom he defined and negotiated technical details of each work.\nAs to human resources, he coordinated the general functioning of the company and managed SX Networks’ divisions: Development, Design, Technology, Advertising, Writing and Contents. </p>\n\n<p>CTO \nSX Networks\nFebruary 2003 — June 2005\nAs Chief Technical Officer, he designed and managed SX Network’s large network of sites, which received more than 1,000,000 visits by the end of 2003. He organized and run the company’s technical divisions and developed as Project Manager a system that automatically generated websites.\nDue to the network’s growth, with two times the initial number of visitors and the emergence of new commercial products, he planed and carried out the installation of additional data centers in Europe, the Caribbean and Asia.\nIn 2005 he visited SX Networks branch in Spain to be trained in new technologies (payment platforms via SMS, integration of payment processors through credit cards, gaming technologies for cell phones).</p>\n\n<p>System administrator \nNetGate\nOctober 1999 — January 2003</p>\n\n<p>System administrator \nInter.net\nMay 2001 — September 2002</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"Crea","permalink":"crea","type_of_entity":"company","image":{"available_sizes":[[[150,111],"assets/images/resized/0003/5544/35544v2-max-150x150.jpg"],[[250,185],"assets/images/resized/0003/5544/35544v2-max-250x250.jpg"],[[450,333],"assets/images/resized/0003/5544/35544v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}