{"first_name":"Itzhak","last_name":"Gurantz","permalink":"itzhak-gurantz-2","crunchbase_url":"http://www.crunchbase.com/person/itzhak-gurantz-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Revolution Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 12 08:28:21 UTC 2008","updated_at":"Sat Nov 15 17:58:58 UTC 2008","overview":"<p>Dr. Itzhak Gurantz is a Venture Partner. Dr. Gurantz has more than 30 years of experience in leading teams that have developed first-generation communications solutions across nearly every broadband medium. Dr. Gurantz began his career at Linkabit Corporation prior to co-founding ComStream in 1984. At Comstream, Dr. Gurantz led engineering developments that were key to enabling the product launch of DSS (DIRECTV), DVB (DISH), Digital MMDS (TeleTV/Americast), digital cable (AT&amp;T), and cable modems (3COM). After the sale of ComStream&#8217;s digital consumer chip unit to Rockwell Semiconductor in 1997, Dr. Gurantz served as Vice President of Engineering for Rockwell (now Conexant) in their Digital Infotainment Division. Itzhak is the Chairman, Founder, and Former CEO of Entropic Communications, which is a co-founder and the developer of the technology for the Multi-Media over Coax Alliance (MoCA). This technology utilizes the existing home coaxial cable to enable high speed multimedia home networking enabling applications such as multi-room DVR. Entropic is a Revolution Ventures portfolio company and has strategic investment from AOL Time Warner, Cox, Comcast, Panasonic, Motorola, Cisco, Intel, EchoStar, and Verizon. Dr. Gurantz&#8217;s B.S. and M.S. in Electrical Engineering degrees were received from Technion, the Israel Institute of Technology in Haifa, Israel and he received his Ph.D. in Electrical Engineering from the University of California at Berkeley. Dr. Gurantz serves as a Director at Symwave and RF Magic, both of which are Revolution Ventures portfolio companies.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0002/8509/28509v2-max-150x150.jpg"],[[178,250],"assets/images/resized/0002/8509/28509v2-max-250x250.jpg"],[[250,350],"assets/images/resized/0002/8509/28509v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Venture Partner","firm":{"name":"Revolution Ventures","permalink":"revolution-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,67],"assets/images/resized/0002/8339/28339v2-max-150x150.jpg"],[[250,112],"assets/images/resized/0002/8339/28339v2-max-250x250.jpg"],[[271,122],"assets/images/resized/0002/8339/28339v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}