{"first_name":"Ivo","last_name":"Stivoric","permalink":"ivo-stivoric","crunchbase_url":"http://www.crunchbase.com/person/ivo-stivoric","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"BodyMedia","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Aug 12 18:01:55 UTC 2010","updated_at":"Thu Jun 28 13:22:37 UTC 2012","overview":"<p>As an innovator and visionary in multi-sensor wearables, Ivo Stivoric is internationally recognized for helping to develop today’s consumer body monitoring category.  In 1999, as one of the original founders of BodyMedia, he applied his vision for the life-changing BodyMedia technology to catalyze the application of body monitoring in the medical and consumer lifestyle management industries.</p>\n\n<p>Today as CTO &amp; VP of New Products for BodyMedia, he is spearheading the rapid expansion of the product line across a wide-range of healthcare applications such as disease management and remote care. By integrating new technologies and enhancements that build upon the product’s proven efficacy and robust clinical outcomes, BodyMedia is ushering in the next evolution in the category with product innovation and industry partnerships that will play an important role in the future of healthcare. </p>\n\n<p>Ivo’s industry work includes involvement with two interdisciplinary studios: co-founder of the Interaction Design Studio at the Institute for Complex Engineered Systems, and co-director of the award-winning Mobile + Wearable Computing Design Studio at the Engineering Design Research Center at Carnegie Mellon University.  Ivo also holds a M.S. in Interaction Design with a concentration in Integrated Product Development and a B.F.A. in Industrial Design, with a concentration in sculpture, from Carnegie Mellon</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0019/7808/197808v2-max-150x150.jpg"],[[250,186],"assets/images/resized/0019/7808/197808v2-max-250x250.jpg"],[[450,336],"assets/images/resized/0019/7808/197808v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CTO & VP of New Products","firm":{"name":"BodyMedia","permalink":"bodymedia","type_of_entity":"company","image":{"available_sizes":[[[150,39],"assets/images/resized/0009/7325/97325v2-max-150x150.png"],[[221,58],"assets/images/resized/0009/7325/97325v2-max-250x250.png"],[[221,58],"assets/images/resized/0009/7325/97325v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}