{"first_name":"J.B.","last_name":"Pritzker","permalink":"j-b-pritzker-2","crunchbase_url":"http://www.crunchbase.com/person/j-b-pritzker-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Nov 23 14:37:58 UTC 2008","updated_at":"Sun Nov 23 14:39:07 UTC 2008","overview":"<p>Mr. Pritzker is a Partner of and founded New World Ventures in 1996, which has become one of Chicago&#8217;s prominent early-stage technology fund managers. He is also Managing Partner of The Pritzker Group. A founding board member of the Illinois Venture Capital Association, a founding director of the Chicagoland Entrepreneurial Center, and a member of the Young Presidents’ Organization, Pritzker has been a forceful and active proponent of a stronger technology base in the Midwest region. He also continues to serve on a variety of other private corporate boards.</p>\n\n<p>Crain&#8217;s Chicago Business honored Mr. Pritzker with the designation as a business leader in its &#8220;40 under 40,&#8221; and &#8220;Who&#8217;s Who of Chicago Business.&#8221; The Chicago Sun-Times named him to their &#8220;Hot 100&#8221; most prominent members of Chicago&#8217;s technology economy. The City Club of Chicago awarded him Citizen of the Year, and he received the Humanitarian Award from the Holocaust Memorial Foundation of Illinois for his philanthropic activities.</p>\n\n<p>Pritzker is a trustee and serves on the investment committee of Northwestern University and is a member of the Board of Governors of the Northwestern University School of Law. Appointed by the Governor of Illinois, he serves as Chairman of the Illinois Human Rights Commission and was co-Chairman of the Governor’s Transition Committee for Civil Rights. He is also Chairman of the Illinois Holocaust Museum Campaign. Pritzker is an attorney and a member of the Illinois and Chicago Bar Associations. He graduated with an A.B. in political science from Duke University and earned his J.D. from Northwestern University School of Law. He lives in Evanston, Illinois with his wife and family.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"New World Ventures","permalink":"new-world-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,75],"assets/images/resized/0002/9260/29260v3-max-150x150.jpg"],[[250,125],"assets/images/resized/0002/9260/29260v3-max-250x250.jpg"],[[450,225],"assets/images/resized/0002/9260/29260v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}