{"first_name":"J.","last_name":"Daniell Hebert","permalink":"j-daniell-hebert","crunchbase_url":"http://www.crunchbase.com/person/j-daniell-hebert","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"MOTO Development Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu May 06 18:50:52 UTC 2010","updated_at":"Mon May 10 16:20:51 UTC 2010","overview":"<p>J. Daniell Hebert is the co-founder and CEO of MOTO Development Group, a product strategy, technology and development firm with offices in San Francisco and Hong Kong. </p>\n\n<p>Under Hebert&#8217;s leadership, MOTO has provided advanced research and intellectual property for Apple, Microsoft, Sony, Hewlett Packard, Motorola, Casio and Ricoh. MOTO has also developed and shipped high volume consumer electronics products for Virgin, Intel, Logitech, Sirius, Livescribe and many other startup companies.</p>\n\n<p>Hebert has driven the strategic growth of capabilities at MOTO from its origin in mechanical engineering to deep expertise in electrical, firmware, software, toward strategy and user experience. Additionally, Hebert&#8217;s ongoing involvement in the design community has informed MOTO’s uniquely collaborative and interdisciplinary approach to product development.</p>\n\n<p>Prior to founding MOTO, Hebert was a researcher in MIT&#8217;s Artificial Intelligence Laboratory and later joined Apple Computer as a researcher of advanced manufacturing systems. Hebert received his Bachelor of Science degree in Mechanical Engineering from Carnegie Mellon University and completed the Stanford Business School Executive Program for Growing Companies. He has been awarded patents for portable computer systems, portable audio systems and medical instruments. Currently Hebert serves on the Robert Woods Johnson Foundation&#8217;s National Advisory Committee for Project HealthDesign. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"MOTO Development Group","permalink":"moto-development-group","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0008/6268/86268v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0008/6268/86268v2-max-250x250.jpg"],[[300,300],"assets/images/resized/0008/6268/86268v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}