{"first_name":"J.","last_name":"Douglas Field","permalink":"j-douglas-field","crunchbase_url":"http://www.crunchbase.com/person/j-douglas-field","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jul 07 18:45:38 UTC 2008","updated_at":"Mon Jul 07 18:50:10 UTC 2008","overview":"<p>As the Vice President of Design and Engineering and Chief Technology Officer for <a href=\"http://www.crunchbase.com/company/segway\" title=\"Segway\">Segway</a>, Doug leads some of the most talented engineers and designers in the world in the conception, development, and delivery of radically new forms of transportation. Doug&#8217;s team is wholly responsible for the development of the Segway Personal Transporter (PT) as well as all the research and development of future Segway products.</p>\n\n<p>Doug&#8217;s career of managing and developing new products and manufacturing processes for the automotive and medical industries led him to DEKA Research &amp; Development in 1996. He worked at DEKA for several years leading the prototype design and overall technical leadership for the INDEPENDENCE™ IBOT™ Mobility System. Prior to that he was the Manager of Process Development for Johnson &amp; Johnson Medical, Inc. where he led the introduction of advanced manufacturing processes for high-volume medical device production. Earlier in his career, Doug was a vehicle development engineer and team leader at Ford Motor Company, focusing on the development of ride, handling, and noise and vibration characteristics on several car platforms.</p>\n\n<p>Doug was a fellow in the dual degree Leaders for Manufacturing Program, a partnership between the MIT School of Engineering, the MIT Sloan School of Management, and major U.S. manufacturing firms, where he earned a masters degree in mechanical engineering and an MBA. He attended Purdue University for his undergraduate education, where he received a BS in mechanical engineering with highest distinction.</p>","image":{"available_sizes":[[[85,85],"assets/images/resized/0002/1536/21536v1-max-150x150.jpg"],[[85,85],"assets/images/resized/0002/1536/21536v1-max-250x250.jpg"],[[85,85],"assets/images/resized/0002/1536/21536v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.segway.com/about-segway/management-team.php\" title=\"Segway\" rel=\"nofollow\">Segway</a></p>"},"degrees":[],"relationships":[{"is_past":true,"title":"Chief Technology Officer, Vice President of Design & Engineering","firm":{"name":"Segway","permalink":"segway","type_of_entity":"company","image":{"available_sizes":[[[144,100],"assets/images/resized/0002/1534/21534v1-max-150x150.png"],[[144,100],"assets/images/resized/0002/1534/21534v1-max-250x250.png"],[[144,100],"assets/images/resized/0002/1534/21534v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}