{"first_name":"J.","last_name":"Edmund Colloton","permalink":"j-edmund-colloton","crunchbase_url":"http://www.crunchbase.com/person/j-edmund-colloton","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Nov 30 23:37:21 UTC 2009","updated_at":"Mon Nov 30 23:37:53 UTC 2009","overview":"<p>Ed joined Bessemer Venture Partners in 2001. As chair of the firm’s investment and management committees, Ed leads the operations of the firm.  Prior to joining Bessemer, he was Chief Operating Officer and a financial services investor at JP Morgan Capital, the private equity arm of JP Morgan.  While at JP Morgan, Ed led investments in seven electronic financial services deals, including Archipelago (merger with NYSE).</p>\n\n<p>Previously, Ed was a private equity lawyer at Davis Polk &amp; Wardwell.  At Davis Polk, he regularly advised DLJ Merchant Banking Partners both in connection with private equity deals and on fund formation matters.</p>\n\n<p>While on active duty in the U.S. Navy, Ed served as a representative for international negotiations at the Joint Chiefs of Staff, where he was awarded a Navy Commendation medal by the Secretary of Defense, and as Navigator and Combat Information Center officer onboard USS Boulder (LST-1190) in the U.S. Atlantic Fleet.</p>\n\n<p>In 2009, the Forbes Midas List ranked Ed among leading venture capitalists.  Ed serves on the board of Creative Capital, a leading foundation funding some of the country’s most innovative artists. Ed received his A.B in economics from Cornell University and a J.D. from the Harvard Law School.   </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Bessemer Venture Partners","permalink":"bessemer-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,39],"assets/images/resized/0001/3853/13853v1-max-150x150.png"],[[250,65],"assets/images/resized/0001/3853/13853v1-max-250x250.png"],[[284,74],"assets/images/resized/0001/3853/13853v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}