{"first_name":"J.","last_name":"Eric Davis","permalink":"j-eric-davis","crunchbase_url":"http://www.crunchbase.com/person/j-eric-davis","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jun 21 08:24:37 UTC 2009","updated_at":"Sun Jun 21 08:25:05 UTC 2009","overview":"<p>J. Eric Davis serves as Kylin&#8217;s President, Chief Executive Officer, and a Director of the Company. Mr. Davis, one of the Founders of In-vivo Ventures, LLC, is also one of the original founders of the Company.  In 2005, Mr. Davis co-founded Quadraspec, Inc., a venture-backed medical diagnostics company with a proprietary detection platform for blood and cellular-based biomarkers.  Mr. Davis also founded Arxan Technologies Inc., a venture-backed software security company based upon technology originally licensed from CERIAS at Purdue University.  Arxan has since grown to become a leading provider of system security to the United States Department of Defense and commercial independent software vendors with high value intellectual property. </p>\n\n<p>Prior to starting Arxan, Mr. Davis co-founded Copient Technologies, LLC, and served as its President and CFO. While at Copient, Mr. Davis participated in the development of its financing. He also managed all business operations of the company including personnel, legal compliance, M&amp;A activity, and financial planning. Copient was acquired by NCR Corporation in 2003. Mr. Davis also served Purdue University through its Office of Technology Commercialization for several years. </p>\n\n<p>Mr. Davis received his B.S. from the University of Dayton and his J.D. from Indiana University. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President, CEO and Director","firm":{"name":"Kylin Therapeutics","permalink":"kylin-therapeutics","type_of_entity":"company","image":{"available_sizes":[[[150,90],"assets/images/resized/0004/9954/49954v1-max-150x150.png"],[[166,100],"assets/images/resized/0004/9954/49954v1-max-250x250.png"],[[166,100],"assets/images/resized/0004/9954/49954v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}