{"first_name":"J Scott","last_name":"Ballman","permalink":"j-scott-ballman","crunchbase_url":"http://www.crunchbase.com/person/j-scott-ballman","homepage_url":"","birthplace":"Chattanooga, TN","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1956,"born_month":2,"born_day":29,"tag_list":"","alias_list":null,"created_at":"Wed Nov 07 13:50:14 UTC 2012","updated_at":"Thu Nov 08 07:58:33 UTC 2012","overview":"<p>Deputy Assistant Director for ICE, Homeland Security Investigations, responsible for overseeing and directing Intellectual Property and Customs Fraud investigative programs at the National Intellectual Property Rights Coordination Center, Arlington, Virginia.</p>\n\n<p>Responsible for developing HSI counterfeiting/piracy policy.\nResponsible for the IPR Center’s Congressional and Senate engagement.\nHolds a TS/SCI clearance and am Certified Fraud Examiner.\nExtensive contacts with trademark holders and am frequently invited to speak at their meetings.\nParticipates in corporate design meetings to define counterfeiting issues and develop anti-counterfeiting strategies.\nExtensive knowledge of supply chain security, risk management and customs inspectional operations.\nConsults with CBP on targeting for commercial fraud and IP enforcement.<br/>\nTestified before two Senate Sub-Committees concerning HSI efforts to investigate the evasion of anti-dumping and countervailing duties.\nResponsible for a 17% increase in the number of HSI IP cases initiated; a 57% increase in the number of HSI IP arrests; a 64% increase in the number of HSI IP indictments; a 71% increase in the number of HSI IP convictions; and a 106% increase in the number of HSI IP seizure incidents.\nMember of the Intellectual Property Enforcement Coordinator’s Inter-Agency Anti-Counterfeiting Working Group.\nAuthored and obtained approval from the WCO for two global IP operations for 2011, Operations Short Circuit and Global Hoax II.  Forty-three countries participated in Short Circuit with over one million hazardous substandard or counterfeit electrical items seized.  Forty-three countries participated in Global Hoax II with over 150,000 counterfeit items seized.\nMembers of INTERPOL’s Consultative Committee on Counterfeit Medical Products and Pharmaceutical Crimes.</p>","image":null,"degrees":[{"degree_type":"BS","subject":"Criminal Justice/Business Administration","institution":"Univerisity of Tennessee","graduated_year":1983,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}