{"first_name":"Jack","last_name":"Rapport","permalink":"jack-rapport","crunchbase_url":"http://www.crunchbase.com/person/jack-rapport","homepage_url":"http://birkhillgroup.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Zanett, Inc.","born_year":null,"born_month":null,"born_day":null,"tag_list":"investment-banking-management-consulting-finance","alias_list":null,"created_at":"Thu Apr 21 15:17:27 UTC 2011","updated_at":"Thu Apr 28 05:53:05 UTC 2011","overview":"<p>Mr. Rapport is the Managing Partner of The Birkhill Group, an investment banking and management consulting firm he founded in 2006. His career spans over 30 years, including serving as an international banker for both Bank of America and Manufacturers Hanover Trust Company (now JPMorgan Chase). As an Executive Director of the latter&#8217;s London-based merchant bank he financed import and export transactions, construction projects for international oil companies and foreign governments, and the sale of commercial and military aircraft to domestic and foreign airlines and governments. </p>\n\n<p>In mid-career Mr. Rapport &#8220;crossed the desk&#8221; to become the Treasurer of Blue Cross and Blue Shield of Maryland, where he managed investment funds in excess of $450 million, credit, collections, financial systems and cash management. He was then appointed Vice President of Corporate Development, responsible for mergers, acquisitions and divestitures. </p>\n\n<p>Subsequently, at The Pharmacy Fund, Inc., where he was Executive Vice President and Chief Financial Officer, he was instrumental in raising over $500 MM in both debt and equity capital from the public and private markets. He has also managed capital portfolios and established financial policies, controls and systems for several development stage ventures as well as established operating companies. </p>\n\n<p>Prior to founding Birkhill, Mr. Rapport served as the CFO and then President of Zanett, Inc. (Nasdaq:ZANE) where he co-led the effort of taking a consolidation concept from back-of-the-envelope, through seven acquisitions, to full operational status and profitability. </p>\n\n<p>He holds undergraduate and graduate degrees in Economics and Finance, respectively, as well as Series 7, 63 and 79 investment banking licenses. He has traveled widely throughout the world, is fluent in French and is an avid golfer, tennis player and private pilot. </p>\n\n<p>SpecialtiesInvestment Management, Financial Services, Information &amp; Communications Systems, Defense &amp; Intelligence, Alternative Energy and Healthcare</p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0013/1767/131767v2-max-150x150.jpg"],[[187,250],"assets/images/resized/0013/1767/131767v2-max-250x250.jpg"],[[337,450],"assets/images/resized/0013/1767/131767v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Managing Partner","firm":{"name":"The Birkhill Group, LLC","permalink":"the-birkhill-group-llc","type_of_entity":"financial_org","image":{"available_sizes":[[[150,50],"assets/images/resized/0013/2829/132829v2-max-150x150.png"],[[180,61],"assets/images/resized/0013/2829/132829v2-max-250x250.png"],[[180,61],"assets/images/resized/0013/2829/132829v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}