{"first_name":"Jackie","last_name":"Ross","permalink":"jackie-ross","crunchbase_url":"http://www.crunchbase.com/person/jackie-ross","homepage_url":"http://www.glgresearch.com/","birthplace":"","twitter_username":"pingjackie","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1978,"born_month":9,"born_day":5,"tag_list":"","alias_list":null,"created_at":"Tue Jul 27 18:29:34 UTC 2010","updated_at":"Sun Nov 27 07:22:57 UTC 2011","overview":"<p>As Vice President, Account Management with Gerson Lehrman Group, Jackie connects companies to experts for immediate, first-hand consulting and intelligence. She is also Founder and Principal of Ping Partners, a marketing consultancy that helps people and companies grow. </p>\n\n<p>Jackie has an extensive background consulting to Fortune 500 executives on marketing strategy, VOC programs, market/commercial assessments, and marketing research projects. </p>\n\n<p>She led Business Development for Walker Information (a customer retention consultancy), Work Her Way (a venture from Carolyn Kepcher, Trump&#8217;s EVP and co-star on the Apprentice) and World 50 (a firm that hosts exclusive gatherings for the Fortune 100 executives). </p>\n\n<p>Before joining World 50, Jackie was Director of Client Services with Corporate Executive Board. Her $6M portfolio included Coca-Cola, Disney, Burger King, Yahoo!, Toyota, eBay, Merrill Lynch, and Twentieth Century Fox.</p>\n\n<p>In earlier roles, Jackie led marketing and fundraising for the National Mental Health Association, sported a jester&#8217;s hat as an editor with The Motley Fool, and oversaw magazines for jet-skiers and truckers as an editor and publisher with Hammock Publishing. Her writing credits include SELF magazine, The Motley Fool, The Florida Times-Union, MyBusiness magazine, EUROPE magazine, and The Vanderbilt Hustler.</p>\n\n<p>Jackie serves as a Court-Appointed Special Advocate (CASA) for a child in foster care, and is a job-seeker mentor with Upwardly Global, a national nonprofit that helps new Americans navigate the U.S. job market. She earned a B.A. in English and Sociology from Vanderbilt University and participated in the Berkeley Executive Leadership Program through the Haas School of Business. She is also a trained coach through the Coaches Training Institute.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0009/5121/95121v4-max-150x150.jpg"],[[166,250],"assets/images/resized/0009/5121/95121v4-max-250x250.jpg"],[[299,450],"assets/images/resized/0009/5121/95121v4-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.A.","subject":"English","institution":"Vanderbilt University","graduated_year":2000,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/jackieross","title":"LinkedIn"},{"external_url":"http://www.pingpartners.com/","title":"Ping Partners"},{"external_url":"http://www.yelp.com/biz/ping-partners-san-francisco","title":"Yelp"}]}