{"first_name":"Jack","last_name":"Biddle","permalink":"jack-biddle","crunchbase_url":"http://www.crunchbase.com/person/jack-biddle","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Nov 26 14:54:37 UTC 2008","updated_at":"Wed Nov 26 15:26:39 UTC 2008","overview":"<p>Jack Biddle is the Founder and a Managing Director of Novak Biddle Venture Partners (NBVP). NBVP has over $350 million under management. NBVP was established in 1997 to provide equity financing and assistance to the management of young, information technology companies. Prior to co-founding NBVP, Jack Biddle was CEO of Annapolis-based InterCAP Graphics Systems, a venture capital backed computer software company, from 1990 to 1995 when IGS was successfully acquired. InterCAP was number 18 on the &#8220;Fast 50&#8221; list of the Region&#8217;s fastest growing companies. Prior to that, he was a principal at the software-focused merchant bank Vanguard Atlantic, Ltd., where he put together numerous venture deals. He also served as CEO or COO of several Vanguard portfolio companies. Earlier in his career he was an IT industry analyst and Executive Assistant to the CEO at the Gartner Group and was an Associate at Business Development Partners, an early stage venture capital partnership. Jack currently serves on the boards of Object Video, Giga Information Group, Paratek Inc. and Matrics, as well as that of the Computer &amp; Communications Industry Association, and the Mid-Atlantic Venture Association. He is also in his third year as co-chair of MAVA&#8217;s Capital Connection Selection Committee. Jack is an alumnus of U VA.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Advisor","firm":{"name":"New Markets Venture Partners","permalink":"new-markets-venture-partners-2","type_of_entity":"financial_org","image":{"available_sizes":[[[150,30],"assets/images/resized/0002/9665/29665v3-max-150x150.jpg"],[[250,51],"assets/images/resized/0002/9665/29665v3-max-250x250.jpg"],[[450,92],"assets/images/resized/0002/9665/29665v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}