{"first_name":"Jack Hipolito","last_name":"Fernandez","permalink":"jack-hipolito-fernandez-2","crunchbase_url":"http://www.crunchbase.com/person/jack-hipolito-fernandez-2","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jul 16 11:34:16 UTC 2012","updated_at":"Mon Jul 16 21:00:58 UTC 2012","overview":"<p>Jack Hipolito Fernandez </p>\n\n<p>Real estate pro Jack Hipolito Fernandez knows that real estate expertise is not a genetic trait. Sometimes, though, he wonders. See, Jack’s parents are both realtors, and so are many other members of his extended family. His mother often says that land is in Jack&#8217;s blood.</p>\n\n<p>His parents founded HF Realty when Jack was still a mere child. Today, Jack is also a partner in the family business. He will take it over entirely when his parents decide to retire.</p>\n\n<p>Jack has learned so much watching his parents interact with clients. Here are some of the lessons Jack’s parents taught him:</p>\n\n<p>• Curb Appeal Is Important: Curb appeal is important, not just for houses but also for people. Always look your best. Yes, it’s true that beauty is only skin deep and it’s what’s inside that’s important. People won’t bother to look inside, though, if they don’t like what they see outside.</p>\n\n<p>• Practice Full Disclosure: Sellers need to tell buyers about any potential problems with the new properties they’re buying. In the same way, people need to practice transparency in their social interactions. They’re should be no unpleasant surprises lurking for potential friends and neighbors.</p>\n\n<p>• Structure and Functionality Both Count: Jack Hipolito Fernandez knows that people are looking for good-looking homes they will be proud to live in. They are also looking for homes with features, however. They want their homes to be weather proofed and have great kitchens where they can cook and entertain. In the same way, people look for friends they will be proud to be associated with. Still, people want their friends to have inner qualities that will enhance their lives.</p>\n\n<p>• Never Oversell Yourself: A real estate listing must be written in terms that will make people want to see the house. It should never contain false claims. Similarly, we should always present our best foot forward in life. But we should never claim to be anything other than what we are. That little white lie you use to embellish your resume will always catch up with you.</p>\n\n<p>• Selling a House Involves Negotiation: There’s a lot of give and take in real estate sales. There’s also a lot of give and take in real life. It’s very seldom that two people share the same opinions about all important things. You need to learn how to negotiate with the people who are most important in your life. Jack Hipolito Fernandez thinks this may be the most valuable life lesson of all.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0020/1164/201164v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0020/1164/201164v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0020/1164/201164v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}