{"first_name":"Jack D.","last_name":"Hidary","permalink":"jack-hidary","crunchbase_url":"http://www.crunchbase.com/person/jack-hidary","homepage_url":"http://hidaryfoundation.org","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Dice Holdings","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"Dice, Vista Research, SmartTransportation.org, The Automotive X-Prize, Hertz, Agent99","created_at":"Wed Jan 28 20:58:56 UTC 2009","updated_at":"Mon Dec 06 04:54:27 UTC 2010","overview":"<p>Jack D. Hidary built his career as an entrepreneur in the finance and technology sectors and is currently focused on energy and transport technology and policy.</p>\n\n<p>In 1995, Hidary co-founded and served as President and CEO of EarthWeb/Dice. He raised three private rounds of equity and completed a record breaking IPO and secondary for a total raise of $150+ million. Under Hidary&#8217;s leadership, EarthWeb/Dice earned the prestigious Business Week Info Tech 100 award as the third fastest growing IT Company. Dice.com is traded on the NYSE under ticker DHX.</p>\n\n<p>Hidary is the co-founder of the $10 million Auto X Prize XPrize (www.xprize.org) which is challenging competitors for a 100 mpg car that can be manufactured at scale. The first X Prize of $10 million was awarded to Paul Allen&#8217;s team for reaching space with no government support.</p>\n\n<p>Hidary was the co-architect of the successful Cash for Clunkers program. This aim of this program was to stimulate the economy by promoting auto sales and reduce America’s dependence on oil. Congress funded the program at $3 billion and the program swapped out 700,000 vehicles in eight weeks with an average increase in MPG of more than 60%. Cash for Clunkers contributed a significant portion of GDP growth for Q3 09 at a critical time in the US economy.</p>\n\n<p>In New York City, Hidary was a leading proponent of switching over the taxi fleet to high-mileage vehicles. Hidary serves as Chairman of SmartTransportation.org (www.smarttransportation.org), a non-profit dedicated to promoting improved transportation policy in the US.</p>\n\n<p>Hidary&#8217;s work is featured by Tom Friedman in Hot, Flat and Crowded and several Tom Friedman columns as well as in many other publications. Hidary is a frequent guest on BloombergTV and CNBC.</p>\n\n<p>Committed to community and philanthropic causes, Hidary has received several industry and community awards as well as being recognized as a Global Leader of Tomorrow at the WEF, Davos.</p>\n\n<p>Hidary serves on several boards including National Renewable Energy Lab Advisory Council (NREL) (www.nrel.gov), and National Lab Day (www.nationallabday.org).</p>\n\n<p>A frequent keynote speaker, Hidary has presented at venues and conferences including DLD (multiple years) and CGI (multiple years) as well as top business schools including Yale and Columbia.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0011/2984/112984v1-max-150x150.png"],[[250,250],"assets/images/resized/0011/2984/112984v1-max-250x250.png"],[[300,300],"assets/images/resized/0011/2984/112984v1-max-450x450.png"]],"attribution":"<p>LeWeb</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"EarthWeb","permalink":"earthweb","type_of_entity":"company","image":null}},{"is_past":false,"title":"Founder","firm":{"name":"Vista Research","permalink":"vista-research","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}