{"first_name":"Jack","last_name":"Pearce","permalink":"jack-pearce","crunchbase_url":"http://www.crunchbase.com/person/jack-pearce","homepage_url":"","birthplace":"Southampton","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1990,"born_month":12,"born_day":26,"tag_list":"rowing, swimming, triathlon, birmingham, devon, west-midlands","alias_list":null,"created_at":"Tue Jul 19 15:41:13 UTC 2011","updated_at":"Wed Jul 20 20:00:55 UTC 2011","overview":"<p>Cancer at the age of 9 is not the best start for a kid. \nBeing given the all clear at the age of 13 is a GREAT start for a teenager and an athlete!</p>\n\n<p>The progression from sickly weedy child to athlete was phenomenal. At the age of 14 Jack started swimming for his local competitive swimming club and quickly moved up in the club rankings. Within a year he was competing with the top athletes in the club and soon after moving to compete for East Devon. </p>\n\n<p>At this point he was introduced to rowing. The large lung capacity and endurance he gained from swimming stood him in good stead for the sport of rowing. He quickly got into a team and raced a fantastic first year, getting promoted from novice to senior after winning his first races, which forced him to compete with athletes older and much more experienced than him. Racing progressed and Jack also competed for his school team in the Interschool indoor rowing championships and got scouted to compete in an interregional race in Nottingham. Training continued and since then Jack has competed in 4 international rowing events (World Coastal Rowing Championships) in Guernsey, Italy, France and Plymouth. The latest (2009), gaining his team a position of 13th out of a total of nearly 60 crews. </p>\n\n<p>Jack team has now disbanded and he is now looking to compete in triathlons around the country. His experience in power endurance and endurance sports should stand him in very good stead. He is interested in gaining sponsorship for charity and requires little for himself.</p>\n\n<p>Many thanks for consideration. </p>","image":{"available_sizes":[[[150,105],"assets/images/resized/0014/5124/145124v2-max-150x150.jpg"],[[250,175],"assets/images/resized/0014/5124/145124v2-max-250x250.jpg"],[[450,315],"assets/images/resized/0014/5124/145124v2-max-450x450.jpg"]],"attribution":"<p>Jack Pearce</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}