{"first_name":"Jacklyn","last_name":"Holovka","permalink":"jacklyn-holovka","crunchbase_url":"http://www.crunchbase.com/person/jacklyn-holovka","homepage_url":"http://www.linkedin.com/pub/dir/jacklyn/holovka","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"jackie-holovka, jacklyn-holovka","alias_list":null,"created_at":"Mon Sep 22 17:34:47 UTC 2008","updated_at":"Mon Sep 22 20:32:23 UTC 2008","overview":"<p>From her early years growing up in Coeur d’Alene, ID, to the present, Jacklyn Holovka has been a motivated self-starter with a keen head for business and organization. Before beginning her career, she was an accomplished athlete and member of the Junior Olympic swim team, as well as several softball teams. Her love of softball has continued into most of her adult life and has been passed on to her daughter whose team has won two Idaho fast-pitch softball state championships.</p>\n\n<p>Jacklyn’s professional career began in 1982 when she managed the staff and office of a successful dentist in Oakland, CA, who also owned a pizza franchise. Observing the efficient way that Jacklyn managed his dental office, the dentist asked her to take on management responsibilities of the pizza place as well and over the next ten years, the chain expanded and opened an additional 28 restaurants. </p>\n\n<p>While she served as CFO of the restaurants and expanded the business, she also formed her own bookkeeping firm, The Book Works, which was also very successful and expanded beyond the dentistry and foodservice industries to serve a wide range of clients throughout the San Francisco Bay Area. In 1992, Jacklyn relocated her business near her hometown roots in Hayden, ID, retaining many of her California clients, and expanding her business further by attracting new multi-state clients and offering additional accounting services.</p>\n\n<p>Her sister Carolyn also joined the business and together they have expanded The Book Works to include not only bookkeeping services but also online accounting capabilities, employee benefit management, payroll processing, and additional staff management services. In 1996, their success and professional accomplishments inspired Jacklyn to apply her skills and experience to co-founding a Professional Employer Association (POE), PayCheck Connection, LLC, where she continues to serve as Executive Manager.</p>\n\n<p>She serves on the boards of several organizations in her community, is an active member of the Coeur d’Alene Business Development Committee and local Chamber of Commerce, and also participates in local business mentoring programs. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}