{"first_name":"Jack","last_name":"McFarland","permalink":"jack-mcfarland","crunchbase_url":"http://www.crunchbase.com/person/jack-mcfarland","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Aug 20 10:42:53 UTC 2011","updated_at":"Sat Aug 20 10:47:09 UTC 2011","overview":"<p>Mr. Jack McFarland brings more than 25 years of experience with an emphasis on leading companies during periods of rapid business growth and development. His experience includes multi-company consolidations, early stage growth and development stage companies, new business ventures and spin offs of mid-market companies\nPrior to joining Proterra, Mr. McFarland was the CFO at FEI Company’s new business initiative to bring the company’s first desktop scanning electron microscope to market.  He later became the general manager of the business division and ultimately managed the sale and transition of the business to a European buyer.  Prior to FEI he served as the CFO for a number of technology service companies in New York City and was the CFO for Denver based smart card company Racom Systems.  Mr. McFarland also served as Vice President and General Manager at Kemper Securities where he was part of the team, which successfully integrated five investment banking firms to form the $800 million Chicago based national firm.\nPrior to his management roles, Mr. McFarland lead financing transactions for the Denver based corporate finance division of Boettcher &amp; Company where he focused on transactions including IPO’s, secondary offerings, and merger and acquisitions.  Before joining Boettcher he worked in the consulting practice at Deloitte, Haskins &amp; Sells where he focused on emerging business and obtained his CPA.</p>","image":null,"degrees":[{"degree_type":"MBA ","subject":"","institution":"Northwestern University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chief Financial Officer","firm":{"name":"Proterra","permalink":"proterra","type_of_entity":"company","image":{"available_sizes":[[[150,21],"assets/images/resized/0009/0076/90076v1-max-150x150.png"],[[250,36],"assets/images/resized/0009/0076/90076v1-max-250x250.png"],[[450,65],"assets/images/resized/0009/0076/90076v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}