{"first_name":"Jaco","last_name":"van Wyk","permalink":"jaco-van-wyk","crunchbase_url":"http://www.crunchbase.com/person/jaco-van-wyk","homepage_url":"http://www.snapbill.com","birthplace":"Pretoria, South Africa","twitter_username":"Jaco_van_Wyk","blog_url":"http://blog.snapbill.com","blog_feed_url":"http://blg.snapbill.com/feed/rss","affiliation_name":"SnapBill","born_year":1983,"born_month":3,"born_day":1,"tag_list":"","alias_list":null,"created_at":"Wed Feb 09 10:15:55 UTC 2011","updated_at":"Mon Oct 31 18:11:16 UTC 2011","overview":"<p>Currently Jaco is involved in the development of SnapBill (http://www.snapbill.com) an automated billing system set to revolutionize the way individuals and small to medium businesses handle service provisioning, client support and the processing of payments. He is also in the process of developing a white-label reseller hosting solution, HostDeploy (http://www.hostdeploy.com), to run on the Amazon Web Services cloud.</p>\n\n<p>Jaco started his studies at the University of Pretoria in the field of Computer Engineering. He graduated in 2005 with a degree in BIS Multimedia.</p>\n\n<p>While studying Jaco started up his own creative media agency called 4Design Creative Media. The company grew rapidly over the years and serviced some of the largest commercial, government and academic institutions in South Africa. With clients such as First National Bank, The Competition Commission and Tribunal, Volkswagen, Neotel, The Department of Housing, and The Department of Science and Technology to name but a few. Academic institutions including Tshwane University of Technology, University of Limpopo and University of Pretoria also makes use of their services. 4Design Creative Media was featured on Summit TV, on a show called Startups, which showcases some of the most successful small businesses in South Africa.</p>\n\n<p>Jaco moved into the field of web hosting in 2007 when he decided to explore its passive income potential. Teaming up with Josh Yudaken he set out to market and grow Lusion Technologies amongst web development companies and freelance designers. This proved to be extremely successful as Jaco had built up many contacts within this industry. Using his knowledge in usability design, functional testing, branding and marketing, Jaco assisted Josh in creating Lusion Technologies flagship reseller hosting software and sourcing South African design and development businesses to utilise this software and increase their bottom line. Up to now, this system has been extremely well received.</p>","image":{"available_sizes":[[[150,127],"assets/images/resized/0012/7109/127109v2-max-150x150.png"],[[250,211],"assets/images/resized/0012/7109/127109v2-max-250x250.png"],[[450,381],"assets/images/resized/0012/7109/127109v2-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"BEng Computer","subject":"","institution":"University of Pretoria","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"BIS Multimedia","subject":"","institution":"University of Pretoria","graduated_year":2005,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder and CEO","firm":{"name":"SnapBill","permalink":"snapbill","type_of_entity":"company","image":{"available_sizes":[[[150,59],"assets/images/resized/0012/1168/121168v2-max-150x150.png"],[[160,63],"assets/images/resized/0012/1168/121168v2-max-250x250.png"],[[160,63],"assets/images/resized/0012/1168/121168v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}