{"first_name":"Jacob","last_name":"Bronstein","permalink":"jacob-bronstein","crunchbase_url":"http://www.crunchbase.com/person/jacob-bronstein","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Brevity Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Mar 11 03:01:03 UTC 2012","updated_at":"Tue Mar 27 06:08:28 UTC 2012","overview":"<p>Jacob founded his first business at age 18 and has spent the past decade working closely with some of the highest profile broadcasters in the world including MTV, ABC, CBS, ESPN and various production and post-production facilities.</p>\n\n<p>Jacob&#8217;s first company, Educational Services, teamed up with Yale University&#8217;s Haskins Laboratory in 2001. Haskins is a research laboratory that uses neuroimaging to explore how speech and language functions in the brain. Educational Services utilized this cutting edge research to create a multimedia system that uses practical applications to extend Haskin&#8217;s findings into the scientific community and academic classrooms.</p>\n\n<p>In 2008, Jacob founded Arctic Media Technologies; where he designed and built video systems and components of the internal infrastructures and broadcast workflows for ABC and ESPN. Through his work at Arctic Media, Jacob discovered that the entire logistical infrastructure related to moving video between geographical points and the transcoding of video into various formats were not two separate issues; but rather symptoms of a single, industry-wide problem. He set out to simplify the way digital content is created &#8211; from these discoveries, Jacob and Abdul founded Brevity.</p>\n\n<p>Jacob exhibits tremendous passion for the media industry and is confident that the Brevity technology will revolutionize the world of broadcast media.</p>\n\n<p>Jacob is a graduate of the School of Visual Arts.</p>","image":{"available_sizes":[[[109,150],"assets/images/resized/0018/0990/180990v2-max-150x150.jpg"],[[183,250],"assets/images/resized/0018/0990/180990v2-max-250x250.jpg"],[[206,281],"assets/images/resized/0018/0990/180990v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder & Head of Product, Finance and Strategy","firm":{"name":"Brevity","permalink":"brevity","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0018/0988/180988v4-max-150x150.png"],[[250,250],"assets/images/resized/0018/0988/180988v4-max-250x250.png"],[[450,450],"assets/images/resized/0018/0988/180988v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}