{"first_name":"Jacques","last_name":"Spilka","permalink":"jacques-spilka","crunchbase_url":"http://www.crunchbase.com/person/jacques-spilka","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"WhatsNexx Marketing Automation Inc.","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Feb 01 13:57:02 UTC 2011","updated_at":"Thu Feb 03 07:19:33 UTC 2011","overview":"<p>Jacques Spilka leads the design and implementation of the Customer State Marketing solutions for Whatsnexx.</p>\n\n<p>His extensive career covers direct mail, email, data base and relationship marketing, IT development and management, project management and management consulting. He is also a Six Sigma Belt and PMP certified.</p>\n\n<p>Jacques was Senior Consultant - Client Solutions for Komunik, a Communication Resource Management company. There, he contributed significantly to the early success designing database and email marketing programs for flagship accounts that include: CAA Quebec, Rona, Reader’s Digest, Columbia House, Doubleday, Manulife Financial and others.</p>\n\n<p>As Director of IT at Fednav ltd, Jacques led the deployment of multiple data center internationally.</p>\n\n<p>At Astral Bellevue Pathé ltd., Jacques directed the growth of the IT operations during the company’s explosive growth. Application services included retail sales and marketing, light manufacturing, distribution, wholesale operations as well as entertainment industry-specific applications.</p>\n\n<p>Jacques lead the redesign and development of System Technology Services’ Financial Application Suite, and the refresh of the company’s sizable customer base during the company’s explosive growth in the late 70’s</p>\n\n<p>Jacques was General Manager at Dominion Resources Corporation, a fully integrated direct mail operation including back office, IT, letter shop operation, warehousing and fulfillment services for the company 35,000 negative-option members and 150,000 seasonal customers.</p>\n\n<p>Jacques’ unique combination of marketing, management and IT experience provide him with a comprehensive view the marketing process as an integrated business service. His understanding of data base marketing, direct mail, email and web technology provide him with the expertise to design and develop multi-channel communication programmes and customer loyalty programs. His project track demonstrates the ability to define goals and mobilize an organization in achieving them.</p>","image":{"available_sizes":[[[128,150],"assets/images/resized/0011/9905/119905v2-max-150x150.jpg"],[[214,250],"assets/images/resized/0011/9905/119905v2-max-250x250.jpg"],[[270,315],"assets/images/resized/0011/9905/119905v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Senior Customer State Marketing Strategist","firm":{"name":"Whatsnexx Marketing Automation Inc.","permalink":"whatsnexx-marketing-automation-inc","type_of_entity":"company","image":{"available_sizes":[[[150,63],"assets/images/resized/0011/7511/117511v2-max-150x150.jpg"],[[250,105],"assets/images/resized/0011/7511/117511v2-max-250x250.jpg"],[[450,189],"assets/images/resized/0011/7511/117511v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://ca.linkedin.com/in/jacquesspilka","title":"LinkedIn"},{"external_url":"http://www.twitter.com/jaswhatsnexx","title":"Twitter"}]}