{"first_name":"Jacqueline","last_name":"Murphy","permalink":"jacqueline-murphy","crunchbase_url":"http://www.crunchbase.com/person/jacqueline-murphy","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Tech Capital Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Feb 17 20:23:57 UTC 2008","updated_at":"Wed Jul 29 23:43:29 UTC 2009","overview":"<p>Jacqui Murphy is a Partner at Tech Capital Partners where she focuses on investment opportunities in the new media, internet, wireless, and communications sectors. Jacqui joined Tech Capital in 2001 and has more than a decade of experience building and investing in early-stage technology companies.</p>\n\n<p>Having worked with many early-stage technology companies, Jacqui is committed to helping entrepreneurs succeed and readily shares her knowledge, resources and network of professional contacts with Tech Capital’s portfolio companies. She currently serves as a director on the boards of AideRSS (www.aiderss.com), LiveHive Systems (www.livehivesystems.com) and Overlay.TV (www.overlay.tv).</p>\n\n<p>Prior to joining Tech Capital, Jacqui was Manager of Marketing Operations at Cisco Systems where she led the marketing operations team for Cisco’s video networking business division. Jacqui joined Cisco through its acquisition of PixStream, a technology company focused on distributing and managing digital video across broadband networks. At PixStream, Jacqui was a Director of Marketing responsible for developing domestic and international markets and managing an innovative marketing team.</p>\n\n<p>Jacqui has also been a marketing consultant, published numerous business cases and instructed business courses at both the Richard Ivey School of Business (University of Western Ontario) and Wilfrid Laurier University. She is a member of the Professional Development Committee for the Canadian Venture Capital Association (CVCA) and sits on the board of directors of the Kitchener and Waterloo Community Foundation.</p>\n\n<p>Jacqui holds a Bachelor of Business Administration degree from Wilfrid Laurier University and has completed the Venture Capital &amp; Private Equity Executive Education program at Harvard, the Entrepreneurship Development Program at MIT, and the study course at the Venture Capital Institute.</p>\n\n<p>Source: Tech Capital</p>","image":{"available_sizes":[[[100,125],"assets/images/resized/0003/7967/37967v2-max-150x150.jpg"],[[100,125],"assets/images/resized/0003/7967/37967v2-max-250x250.jpg"],[[100,125],"assets/images/resized/0003/7967/37967v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Tech Capital Partners","permalink":"tech-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,43],"assets/images/resized/0003/0285/30285v1-max-150x150.png"],[[250,72],"assets/images/resized/0003/0285/30285v1-max-250x250.png"],[[266,77],"assets/images/resized/0003/0285/30285v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}