{"first_name":"Jacques","last_name":"Zacarias","permalink":"jacques-zacarias","crunchbase_url":"http://www.crunchbase.com/person/jacques-zacarias","homepage_url":"http://www.sdiginet.net","birthplace":"Cabinda","twitter_username":"JacquesLudovico","blog_url":"http://www.sdiginet.net/blog","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1970,"born_month":9,"born_day":17,"tag_list":"","alias_list":null,"created_at":"Thu Jul 05 02:31:00 UTC 2012","updated_at":"Thu Jul 05 16:31:05 UTC 2012","overview":"<p>Welcome</p>\n\n<p>Hi my name is Jacques i am an Internet Marketing and MMN expert, I am mentor and sometimes speaker at seminars teaching people how to properly use the Internet and increase revenues for their Companies.\nIf you are willing to leanr more about SEO, SEM, E-marketing, Affiliate programs or even provide you with an electronic Solution, payment gateways please contact me.\nJacques Has his degree in Languisitics and self studed computer networks and Internet Marketing by WSI.\nHe and his friends with a degree in Economic science founded Sociedade Diginet, Lda in 2001 as a Computer bassed business company that first begun as an ISP and VoIP, soon they migrate from VoIP to just data (Internet) with the vision that the Internet was the future of the New Technology and that african countries and government are still missing this opportunity. This vision is based on stories like Mark Zurgerberg, jerry Yang, David Filo and other who leads the Internet industry world. Therefore by googling the net soon understood that african content is of a need so decided to adventure himself to online entrepreneurship.\nToday, they are building from scrach what it meant to be one of the biggest project in social networking, in African continent which will concentrate links to its own produced content such as video and movie streaming, dating social.\nThanks to God for being there.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}