{"first_name":"Jadam","last_name":"Kahn","permalink":"jadam-kahn","crunchbase_url":"http://www.crunchbase.com/person/jadam-kahn","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon May 26 19:51:09 UTC 2008","updated_at":"Mon May 26 20:05:36 UTC 2008","overview":"<p>Jadam Kahn is a user experience professional with an extensive background in the digital entertainment space.</p>\n\n<p>While studying at Cornell University, he managed and promoted regional bands and events. He stayed in Ithaca for a few years to continue the rock scene and put his science training to use creating medical illustrations and educational CD-ROMs for the pharmaceutical industry.</p>\n\n<p>In 1994 to 1997 he attended graduate school at The School of The Art Institute of Chicago to study visual communication and art and technology. He received his MFA in 1997 and soon co-founded Nexiv, a web design firm with a focus on building virtual communities.</p>\n\n<p>He left Nexiv in 2000 and for the next few years he worked with a variety of startups and web development firms before starting Rocketsurgeon, a web design consulting company. His largest client was Music Now which was purchased by Circuit City in 2004. He continued to stay aboard full time as Manager of User Experience for Music Now which was eventually purchased by AOL. While there he participated in building a highly praised music subscription service in addition to doing some work for Winamp.</p>\n\n<p>After AOL Music Now was purchased in 2007 by Napster, he reinvented Rocketsurgeon as an experience design firm with a focus on digital media. Clients included Universal Music, Apple Computer, Hitmaker, Steveland Films, Sikora Films, Six Degrees Capital Management, Media Bank, Cleversafe as well as a variety of musicians.</p>\n\n<p>Jadam also runs the Rocketsurgeon Music 2.0 Blog and Music 2.0 Directory.</p>","image":{"available_sizes":[[[49,66],"assets/images/resized/0001/9403/19403v1-max-150x150.jpg"],[[49,66],"assets/images/resized/0001/9403/19403v1-max-250x250.jpg"],[[49,66],"assets/images/resized/0001/9403/19403v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.strands.com/corp/team.vm\" title=\"Strands\" rel=\"nofollow\">Strands</a></p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}