{"first_name":"Jai","last_name":"Das","permalink":"jai-das","crunchbase_url":"http://www.crunchbase.com/person/jai-das","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Nov 29 12:48:27 UTC 2008","updated_at":"Sat Nov 29 12:49:34 UTC 2008","overview":"<p>Jai Das spent seven years designing and building software applications as a lead architect, as a product manager and as an entrepreneur before focusing on investing in technology start-ups. He was most recently a director at Agilent Ventures (formerly part of Hewlett-Packard), where he led investments in semiconductor, semiconductor testing and networking systems companies like Infinera Systems and Touchdown Technologies. Prior to working at Agilent Ventures, he was employed at Intel Capital where he was responsible for strategic equity investments in software and data-center system vendors. Das was also a principal with MVC Capital, a Draper Fisher Jurvetson affiliated venture fund where he led investments in software, business services, storage, and data-center systems. Das received his MBA from the University of Chicago&#8217;s Graduate School of Business where he was awarded the George Hay Brown Prize for academic excellence. He earned his Bachelor of Science degree in Electrical Engineering from Brown University.</p>\n\n<p>Das manages SAP Ventures&#8217; investments in GroundWork Open Source, Ignite, MySQL, Selero, Sonoa, and Tealeaf. He is responsible for SAP&#8217;s investment strategy in India and for evaluating new investment opportunities in Open Source and in platform and infrastructure software that enable next generation SOA and SaaS based applications.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director (Palo Alto)","firm":{"name":"SAP Ventures","permalink":"sap-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[144,39],"assets/images/resized/0002/9838/29838v4-max-150x150.jpg"],[[144,39],"assets/images/resized/0002/9838/29838v4-max-250x250.jpg"],[[144,39],"assets/images/resized/0002/9838/29838v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}