{"first_name":"Jake","last_name":"Sigal","permalink":"jake-sigal","crunchbase_url":"http://www.crunchbase.com/person/jake-sigal","homepage_url":"http://www.LivioConnect.com","birthplace":"","twitter_username":"JakeSigal","blog_url":"http://www.JakeSigal.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"innovation, connected-vehicle, telematics, pandora, car-internet-radio, iphone, android, detroit, start-up, michigan, npr, consumer-electronics-show, ces, rain, sxsw, npr-labs, society-of-automotive-analysts, national-association-of-broadcasters, edison-r","alias_list":null,"created_at":"Tue Jul 17 20:44:56 UTC 2012","updated_at":"Wed Jul 18 03:53:00 UTC 2012","overview":"<p>Livio Radio founder and CEO Jake Sigal</p>\n\n<p>Jake mashed-up music and tech to make Livio Radio.</p>\n\n<p>Jake Sigal quit his XM product management gig at Delphi at the age of 26, vowing to do things differently. Bolstered by a $10,000 loan from his parents, he combined his two passions, engineering and music, and started Livio Radio in 2008 from the guest bedroom of his home in Ferndale, Mich.</p>\n\n<p>Jake’s rule-breaking style quickly established Livio as a leader in the car Internet radio industry. It also made Jake an accredited young entrepreneur. Through partnerships with venture capital firms and angel investors, he raised millions to fund the Livio Radio brand born under his own roof.</p>\n\n<p>Before starting Livio, Jake worked at Numark as a product developer, where he invented the original ION USB turntable and co-invented the iDJ. After, Jake jumped to Delphi’s Consumer Electronics Group, working as a product line manager for XM Satellite Radio where he built a budding bromance with his boss, Massimo Baldini, who’s now Livio Radio’s president.</p>\n\n<p>Before he set the consumer electronics world on fire with his innovations, Jake earned his undergraduate and graduate degrees in engineering at Ohio University, where he marched on the drumline of the infamous OU Marching 110. He now sits on the university’s Russ College of Engineering Board of Advisors. Jake is also a board member of the Consumer Electronics Association’s (CEA) Board of Industry Leaders (BIL) and the Small Business Council (SBC).</p>\n\n<p>When he isn’t inventing cool tech products, you can find Jake fist pumping in his office to electro, house and dubstep, or battling Baldini in foosball. Jake is married and has a cat cool enough to be on the box art for the Livio Radio featuring Pandora.</p>\n\n<p>Jake also loves riding his fixed-gear bike, letting loose at national electronic music festivals, and playing ice hockey for Team Livio.</p>\n\n<p>Today, Jake still plays by his own rules – an ideology that has put more than 25 products on the market.</p>\n\n<p>CREDENTIALS</p>\n\n<p>Awards\n2011 – Edison Research “30 under 30”\n2011 – Ernst &amp; Young’s Entrepreneur of the Year Semifinalist\n2011 – Dealerscope 40 under 40\n2010 – CES Last Gadget Standing\n2010 – Crain’s Detroit Business 20 in their 20’s\n2010 – Detroit Young Professionals Vanguard Award\n2010 – Lawrence Technological University, Leaders &amp; Innovators honoree</p>\n\n<p>Speaking Engagements\n2012 – Judge – Eureka Park! competition at CEA Line Show (New York, NY)\n2012 – Telematics Update, Detroit, MI – Panelist\n2012 – Cellular Telecommunications Industry Association (CTIA), New Orleans, LA – Solo Presentation\n2012 – Mobile Web &amp; Apps World 2012, New Orleans, LA – Panelist\n2012 – Society of Automotive Analysts &amp; YPN May Event, (Royal Oak, MI) – Industry Speaker\n2012 – National Association of Broadcasters (NAB) (Las Vegas, NV) – Panelist\n2012 – RAIN Internet Radio Summit West (Las Vegas, NV) – Panelist\n2012 – Digital Music Forum East – Solo Presentation\n2012 – Consumers Electronics Show in Las Vegas, NV – Panelist\n2011 – Consumers Electronics Show in Las Vegas, NV – Panelist\n2011 – NPR Labs – Radio With Vision Showcase (Las Vegas, NV) – Panelist\n2010 – Consumers Electronics Show in Las Vegas, NV – Panelist\n2010 – RAIN Internet Radio forum Toronto – Panelist\n2010 – RAIN Internet Radio forum Las Vegas – Panelist\n2010 – SXSW Music Festival – Solo Presentation\n2010 – Keynote speaker at the Entrepreneurial Initiative of Southeast Michigan\n2010 – RadioTech Summit (Silicon Valley) – Panelist\n2009 – CES Silvers Summit [VIDEO] – Panelist\n2009 – Consumers Electronics Show in Las Vegas, NV – Panelist</p>\n\n<p>National TV Appearances\nMSNBC\nDan Rather Presents\nHSN (Live)\nFox Business News\nSPIKE TV (Live) @ CES 2012</p>\n\n<p>Judging/Adjudicating\n2011 – Judge for University of Michigan startup funding competition\n2012 - CE Week Eureka Park Challenge Judge</p>","image":null,"degrees":[{"degree_type":"Bachelors ","subject":"Engineering","institution":"Ohio University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"Masters","subject":"Engineering","institution":"Ohio University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.jakesigal.com","title":"Blog"},{"external_url":"http://www.LivioRadio.com","title":"Consumer Products Site"},{"external_url":"http://www.LivioConnect.com","title":"Business Products Site"}]}