{"first_name":"James","last_name":"A. Datin","permalink":"james-a-datin","crunchbase_url":"http://www.crunchbase.com/person/james-a-datin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Sep 23 21:25:29 UTC 2008","updated_at":"Wed May 05 01:06:08 UTC 2010","overview":"<p>As Executive Vice President and Managing Director of Life Sciences, Jim applies his broad industry knowledge to drive Safeguard’s partnership opportunities in Life Sciences. His significant experience as a marketing / sales and business development executive for leading pharmaceutical, medical device, diagnostics and software companies spans more than 20 years and covers assignments throughout the United States, Europe and Asia.</p>\n\n<p>Prior to joining Safeguard, Jim was Chief Executive Officer of TouchPoint Solutions, Inc., a provider of software that enables customers to develop and deploy applications, content and media on multi-user interactive devices. Prior to TouchPoint, Jim served as Group President of Dendrite International, a provider of sales, marketing, clinical and compliance solution services to global pharmaceutical and other life sciences companies. In his tenure as Group Director of Corporate Business Strategy and Planning at GlaxoSmithKline, he served on the Global Predictive Medicine Board of Directors, evaluating acquisition and alliance opportunities, reengineering projects and facilitating change management teams. His experience also includes executive international assignments setting up international businesses and identifying strategic growth opportunities for Merck KGaA and Baxter.</p>\n\n<p>As Chief Executive Officer at publicly traded Isuta Group, Jim redesigned the company’s value proposition and led a profitable expansion throughout Asia and enabled the company’s survival of the Asian economic crisis. These initiatives positioned the group to become a world leader in all major product groups.</p>\n\n<p>Jim and his team actively oversee Safeguard’s life sciences partner companies and continuously evaluate new growth opportunities in life sciences companies.</p>\n\n<p>Jim believes that by providing capital, as well as a range of strategic, operational and management resources, Safeguard is uniquely positioned to build value in growth-stage life sciences companies. Jim has completed more than 20 acquisitions, mergers and divestitures in his 20 plus years of experience, and seeks opportunities to partner with innovative entrepreneurs within diagnostics, medical devices and specialty pharmaceuticals.</p>\n\n<p>EXPERIENCE</p>\n\n<pre><code>* TouchPoint Solutions, Inc. - CEO\n* Dendrite International - Group President\n* GlaxoSmithKline - Group Director, Corporate Business Strategy and Planning\n* Isuta Holdings - CEO\n* Baxter/Merck KGaA - Director, International Business\n</code></pre>\n\n<p>BOARD MEMBER\nSafeguard Partner Companies</p>\n\n<pre><code>* Cellumen, Inc.\n* Clarient, Inc. (Nasdaq: CLRT)\n* Rubicor Medical, Inc.\n</code></pre>\n\n<p>EDUCATION</p>\n\n<pre><code>* BBA, Marshall University\n* MBA, University of New Haven\n</code></pre>","image":{"available_sizes":[[[108,150],"assets/images/resized/0002/5528/25528v1-max-150x150.jpg"],[[159,220],"assets/images/resized/0002/5528/25528v1-max-250x250.jpg"],[[159,220],"assets/images/resized/0002/5528/25528v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"EVP and Managing Director, Life Sciences Group","firm":{"name":"Safeguard Scientifics","permalink":"safeguard-scientifics","type_of_entity":"company","image":{"available_sizes":[[[150,31],"assets/images/resized/0006/7104/67104v3-max-150x150.jpg"],[[250,51],"assets/images/resized/0006/7104/67104v3-max-250x250.jpg"],[[450,93],"assets/images/resized/0006/7104/67104v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}