{"first_name":"James","last_name":"Fales","permalink":"james-fales","crunchbase_url":"http://www.crunchbase.com/person/james-fales","homepage_url":"http://jamesfales.com/James_Fales.html","birthplace":"","twitter_username":"James_Fales","blog_url":"","blog_feed_url":"","affiliation_name":"SURE Holdings LLC","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Dec 30 18:10:06 UTC 2010","updated_at":"Sun Jan 02 02:36:09 UTC 2011","overview":"<p>James Fales is the CEO of SURE Holdings, LLC with an extensive background in marketing, developing and selling real estate and construction services.  </p>\n\n<p>product of three generations of development and construction owners, James Fales has nearly two decades of experience in marketing, developing and selling real estate and construction services; from large master-planned development projects to major commercial centers to residential neighborhoods with single-family homes.  Among other things, he is presently engaged in creating the Premier Mountain Resort Development in the Western United States.</p>\n\n<p>With a background in construction, combined with his mastery of residential and commercial real-estate, it was inevitable that Mr. Fales would apply his skills in becoming a lead developer for commercial and residential use. He started SURE Holdings LLC in order to provide development services, construction, and sales of real estate with his Broker’s license in both Utah and Nevada.  Today he is one of the top five land owners in Southern Utah, leading his team to successfully complete the next generation of quality community developments.</p>\n\n<p>Years ago Mr. Fales began to expand his center of influence by doing business outside the United States, traveling to Europe, Africa and the Middle East.  He has traveled from the US to Europe over 25 times.  With the economic crisis in the US, James saw the opportunity a year ago for Foreign investors to buy real estate at a discount in Florida, California, Utah and Nevada.  He has been to Europe 9 times since then and has meet with over 200 investors, banks, architects, designers, planners and brokers. The relationships that have developed over this time have proven invaluable to Mr. Fales and his affiliate companies, clients and business partners.  They have set the foundation for an international network of value to all parties associated with Mr. Fales.  He is planning on moving to Zurich, Switzerland with his family in the summer of 2009, where he currently bases operations while in Europe.</p>\n\n<p>Understanding that the present financial crisis has created opportunities never before seen in our lifetime, and knowing that this is a perfect storm, Mr. Fales’ relationships afford him the ability to complete several types of transactions:</p>\n\n<pre><code>  •Large scale development funding and acquisitions\n\n  •Bank owned purchases of homes in bulk (up to $50 million USD)\n\n  •Cash flow commercial offices and retail with minimum of 8% IRR\n\n  •Individual home sales to end users in Europe for vacation or rental purposes\n\n  •Investments in Companies with growth potential and positive cash flow\n</code></pre>\n\n<p>Mr. Fales began his career in construction, and later joined Century 21. After becoming the highest-producing agent, he later joined D&amp;B Real Estate, transitioning into commercial property sales and development.  Today SURE Development, in association with the construction arm of SURE, Omnia Development, is focused on five major projects (details available by clicking the project logos to the left):</p>\n\n<pre><code>  •Braffit’s Mountain\n\n  •Cross Hollows\n\n  •Monarch Meadows\n\n  •Cedar Valley Acres\n\n  •Commercial Retail Development\n</code></pre>\n\n<p>OF INTEREST</p>\n\n<pre><code>  •Mr. Fales holds a Real Estate Broker’s License in two States:  Utah and Nevada\n\n  •He is a member of the local sheriff’s law-enforcement community, holding a current permit from the US Government\n\n  •Prominent member of the community and local church group\n\n  •Married 10 years with three children\n\n  •One of his passions is training and working with fine horses.  He has trained and sold Foxtrotters and maintained a herd of over 30 horses with this father on the family farm\n\n  •His hobbies include spending quality time with his family, snowmobiling, exploring the surrounding parks, forests, and wilderness areas and serving others with his talents, gifts and resources\n</code></pre>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"SURE Holdings LLC","permalink":"sure-holdings-llc","type_of_entity":"company","image":null}},{"is_past":false,"title":"CEO","firm":{"name":"SURE Holdings LLC","permalink":"sure-holdings-llc","type_of_entity":"financial_org","image":null}},{"is_past":false,"title":"","firm":{"name":"SURE Holdings","permalink":"sure-holdings","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://jamesfales.com/James_Fales.html","title":""}],"web_presences":[{"external_url":"http://twitter.com/James_Fales","title":"Twitter"}]}