{"first_name":"James","last_name":"Byler","permalink":"james-byler","crunchbase_url":"http://www.crunchbase.com/person/james-byler","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"LinQpay","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jun 19 23:00:08 UTC 2008","updated_at":"Tue Jul 01 01:45:32 UTC 2008","overview":"<p>LinQpay is headed by Mr. James Byler. As Chairman and CEO, Mr. Byler brings a breadth of leadership in Global Operations, Management and Sales. As the visionary of the company&#8217;s Global Payment Service Platform and Mobile Phone Payment Services, Mr. Byler has defined and continues to broaden the payment industries definition of Local Payments within Global Services as well as Mobile Payments through Cellular Phones.</p>\n\n<p>Mr. Byler is a seasoned entrepreneur with over 13 years in the technology and the financial Industries. He has held Senior Management roles within four successful start-up companies. Mr. Byler most recently founded and held the positions of Chairman and CEO of Devinix Inc., a multi-national Global Payment Service organization widely credited with being the first Payment Service Platform to connect payment infrastructure within the major countries in North America, Europe and Asia Pacific. Prior to Devinix, Mr. Byler headed the U.S. division of Bibit, a Dutch-based Global Payment Service Provider focused on payment services within the European Union (Acquired by the Royal Bank of Scotland). Prior to Bibit, Mr. Byler headed sales at Metacode, Inc., a San Francisco based start-up specializing in Content Intelligence and Content Retrieval (Acquired by Interwoven). Mr. Byler has also held senior level Sales and Sales Management positions within companies in the Content and Document Management spaces, such as iManage, Interwoven and Documentum.</p>\n\n<p>Mr. Byler has worked internationally in the United Kingdom, Germany, France, Sweden, the Netherlands, China, Hong Kong, Korea, Japan, Singapore, South Africa, Canada and the USA. Today, Mr. Byler is focused on managing LinQpay&#8217;s explosive growth and robust international expansion.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"LinQpay","permalink":"linqpay","type_of_entity":"company","image":{"available_sizes":[[[150,32],"assets/images/resized/0002/0731/20731v2-max-150x150.png"],[[250,53],"assets/images/resized/0002/0731/20731v2-max-250x250.png"],[[450,96],"assets/images/resized/0002/0731/20731v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}