{"first_name":"James M.","last_name":"Butler","permalink":"james-m-butler","crunchbase_url":"http://www.crunchbase.com/person/james-m-butler","homepage_url":"","birthplace":"Boston MA USA","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"MatchMine","born_year":1961,"born_month":7,"born_day":26,"tag_list":"CTO, VP, engineering, architecture, executive","alias_list":null,"created_at":"Fri Sep 21 15:16:01 UTC 2007","updated_at":"Tue Feb 26 20:06:30 UTC 2008","overview":"<p>Jim Butler is an adept technology executive with a strong reputation for leadership. Currently, Jim serves as the CTO and VP of Engineering at matchmine LLC, a media discovery company.</p>\n\n<p>Prior to joining matchmine in January 2007, he founded Grid Nova, Inc., an early stage enterprise technology company currently operating in stealth mode. In the aftermath of the dot-com era, Jim was instrumental in the dramatic turnaround of eCredit.com, an enterprise software company recently acquired by Fidelity Ventures. Serving as its CTO and EVP, he directed eCredit&#8217;s technology strategy, onshore and offshore product engineering, and Software-as-a-Service infrastructure operations.</p>\n\n<p>Jim has held Chief Architect positions at EC Cubed and American Management Systems. He has also served in various architecture, engineering, and consulting roles at Pioneer Investments, JP Morgan Chase, CapitalOne, Ameritech, Royal Bank of Canada, Boston Consulting Group, BAE Systems, and Raytheon Company.</p>\n\n<p>Since 2002, Jim has served as the founding Chairman of the Technology Leadership Council, Boston Chapter. He authored the 2003 book &#8220;Technology Blueprints: Technology Foundations for High Performance Companies,&#8221; as well as numerous technical publications in IEEE, ACM, and other journals and conferences. His portfolio of patents pending spans the areas of web services architecture, genetic computing as applied to decision optimization, and content identification.</p>\n\n<p>Jim holds a Ph.D. in Electrical Engineering from the University of Maryland, an MSEE from Rensselaer Polytechnic Institute, and a BSEE Magna Cum Laude from the University of Lowell.</p>","image":null,"degrees":[{"degree_type":"Ph.D.","subject":"Electrical Engineering","institution":"Universiry of Maryland","graduated_year":1990,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CTO","firm":{"name":"MatchMine","permalink":"matchmine","type_of_entity":"company","image":{"available_sizes":[[[150,83],"assets/images/resized/0000/0961/961v1-max-150x150.png"],[[176,98],"assets/images/resized/0000/0961/961v1-max-250x250.png"],[[176,98],"assets/images/resized/0000/0961/961v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}