{"first_name":"James","last_name":"Salanitri","permalink":"james-salanitri","crunchbase_url":"http://www.crunchbase.com/person/james-salanitri","homepage_url":"http://www.scrratch.com","birthplace":"NY","twitter_username":"jsalanitri","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1978,"born_month":6,"born_day":19,"tag_list":"james-salanitri, oddcast, rga, organic, publicis, modem, art-director, scrratch","alias_list":null,"created_at":"Tue Jul 03 19:43:43 UTC 2012","updated_at":"Tue Jul 03 21:58:23 UTC 2012","overview":"<p>James Salanitri attended Pratt Institute in NYC and completed a BA in Graphic Design. While attending school James landed a gig at Lucent Technologies in NJ in the digital design department. There he worked on internal poster designs, and also helped design the company website and intranet. </p>\n\n<p>After Graduating James got a job at Oddcast.com in 2000. Once at Oddcast James was partnered with Chris Dixon \n( now co-founder of Hunch.com ) and they both developed Oddcast&#8217;s Speaking Avatars. James was at Oddcast for 8 years and in that time help design viral applications, sites, \nand digital advertising for clients such as Coke, Sony, Ford, Toyota, WB, Carreer Builder, NASA, Purina, and Pepsi. His proudest work is the world famous Carreer Builder&#8217;s \nMonk-e-Mail. Over 100 million messages have been sent and counting. This viral site has recently been listed in Forbes 20 Best Ever Social Media Campaigns. </p>\n\n<p>In 2008 James moved on to Publicis Modem in NYC. He was Senior Art Director on clients such as LG USA, LG Global, Hasbro, Pillsbury, Dice, and Sanofi Aventis. James&#8217;s most recent work was to design the new site for &#8220;The Hub&#8221; which is\na new tv channel for kids by hasbro and discovery channel. </p>\n\n<p>In 2011 James joined R/GA and lead the design for Nike+ on Android which just launched in June 2012.   </p>\n\n<p>James&#8217;s work has won numerous awards such as multiple adobe site of the days, a Webby in 2007, and multiple flash forward awards. His work has been featured in AdAge, Creativity, the Wall Street Journal, and Forbes. James was also a judge at Flash Forward.</p>\n\n<p>Specialties\nCreative Concepting, Graphic Design, Branding, Illustration, Interactive Applications, Mobile Development, Viral Media,</p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0019/8648/198648v4-max-150x150.jpg"],[[250,166],"assets/images/resized/0019/8648/198648v4-max-250x250.jpg"],[[450,300],"assets/images/resized/0019/8648/198648v4-max-450x450.jpg"]],"attribution":"<p>James Salanitri / <a href=\"http://www.scrratch.com\" title=\"Scrratch\" rel=\"nofollow\">Scrratch</a></p>"},"degrees":[{"degree_type":"BFA","subject":"Graphic Design","institution":"Pratt","graduated_year":2000,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.scrratch.com","title":"Scrratch"}],"web_presences":[]}