{"first_name":"James","last_name":"Jordan","permalink":"james-jordan","crunchbase_url":"http://www.crunchbase.com/person/james-jordan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 09 06:20:00 UTC 2009","updated_at":"Tue Jun 09 06:25:06 UTC 2009","overview":"<p>Mr. Jordan joined the PLSG in 2005 and is an officer of the company. He is an accomplished Fortune 20-level executive with strong experience in industry, consulting and academia. A recognized expert in market development and guiding the successful formation of entrepreneurial startup businesses in the Life Sciences Industry, Mr. Jordan joined the Pittsburgh Life Sciences Greenhouse (PLSG) in 2005 and became Vice President and Chief Investment Officer in 2007. </p>\n\n<p>Prior to joining the PLSG, Mr. Jordan served as Senior Vice President of a $3.0 billion division of McKesson Corporation, a leading distributor of healthcare systems, medical supplies and pharmaceutical products, and as a Vice President for Marketing at Johnson &amp; Johnson one of the world&#8217;s largest consumer products and healthcare companies.  He has held a range of management positions in sales and marketing, operations, supply chain management, information technology, finance and quality assurance with several Fortune 500 medical device companies including C.R. Bard, Inc. and Boston Scientific, Inc.  Mr. Jordan has leveraged this experience in several startup ventures and is active on several Boards of Directors. </p>\n\n<p>Mr. Jordan&#8217;s consulting experience includes engagements with numerous companies such as Medtronic, Frost &amp; Sullivan, Circuit City, Philip Morris, Northrop Grumman, Schwartz Pharmaceutical and Otsuka Pharmaceutical. </p>\n\n<p>Mr. Jordan previously served as an Adjunct Associate Professor at the University of Richmond and he is currently a Distinguished Service Professor of Biotechnology Management and the Director of the Master of Science in Biotechnology Management at Carnegie Mellon University. </p>","image":{"available_sizes":[[[140,140],"assets/images/resized/0004/7569/47569v1-max-150x150.jpg"],[[140,140],"assets/images/resized/0004/7569/47569v1-max-250x250.jpg"],[[140,140],"assets/images/resized/0004/7569/47569v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Vice President and Chief Investment Officer","firm":{"name":"Pittsburgh Life Sciences Greenhouse","permalink":"pittsburgh-life-sciences-greenhouse","type_of_entity":"financial_org","image":{"available_sizes":[[[148,150],"assets/images/resized/0004/7564/47564v1-max-150x150.jpg"],[[156,158],"assets/images/resized/0004/7564/47564v1-max-250x250.jpg"],[[156,158],"assets/images/resized/0004/7564/47564v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}