{"first_name":"James","last_name":"Maniscalco","permalink":"james-maniscalco","crunchbase_url":"http://www.crunchbase.com/person/james-maniscalco","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Aug 09 06:52:52 UTC 2012","updated_at":"Fri Aug 10 00:03:22 UTC 2012","overview":"<p>James Maniscalco is an expert when it comes to training bikers for driver safety. Without taking the necessary precautions, motorcycle accidents often result in either serious injuries or fatalities. Bikers are apt to more serious injuries and fatalities due to no seat belts and no protective surrounding steel. Accidents can occur due to bad weather, in-road obstacles, lack of experience, bike malfunctions or other motorists on the road. James warns his fellow bikers to stay alert to the many risks of the road. </p>\n\n<p>According to James, the 2010 statistics reveal that over 4,500 fatalities occur each year among biker riders. Even though these statistics are lower than previous years, James feels that many of these fatalities could have been prevented. With proper motorcycle training, there are strategies to prevent these fatalities. </p>\n\n<p>Tips for Motorcycle Safety on the Road</p>\n\n<p>James Maniscalco has been instructing bikers on road safety for many years. As a biker himself, he recognizes that safety comes first. With safety, bikers can enjoy the thrill of the ride for a great biker experience. Here is a list of some of his safety tips:</p>\n\n<p>-Preparation: Bikers need to be prepared for any road travel. It is vital to make sure that the tires are in good condition and have the appropriate tire pressure. It is also important that the controls and lights are in good working condition. Without lights, many motorists cannot easily spot bikers on the road. Brakes should be checked before taking off on the road. </p>\n\n<p>-Rural roads: Many motorcyclists learn how to ride in popular areas where the roads are smooth and traffic controls are in operation. Rural roads present a new set of challenges. Often, there are bumpy roads with unexpected curves. Rural roads have a whole new terrain that the biker is not accustomed to riding on. </p>\n\n<p>James recommends that bikers proceed with extra caution while traveling on rural roads. He suggests using points, such as lines of trees or telephone poles, to help determine the broadness of a bend. Bikers should approach bends slowly for better control of the road. </p>\n\n<p>-Watching motorists: Drivers of cars at intersections are often the major cause of collisions. James recommends that bikers keep a watchful eye on motorists to anticipate possible risks. Bikers need to anticipate motorist’s speed and thinking. By thinking ahead of time, bikers can avoid a collision and maintain their safety. </p>\n\n<p>-Passing: Often, bikers are very tempted to pass motorists thinking they can weave in and out of lanes easily. In order to pass safely, bikers need to have a clear understanding of their bike’s braking ability and acceleration. Before passing, bikers need to make certain that there is a clear route ahead of the bike. </p>\n\n<p>-Road conditions: James cautions bikers to expect unexpected obstacles and avoid riding through puddles. Painted traffic lines, mud, manhole covers are just a few of the elements that can impair traction. </p>\n\n<p>James is an avid biker who has enjoyed riding a chopper for years. To ensure biker safety, James Maniscalco has enjoyed giving bikers training to best prepare them for the road. </p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/5229/205229v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/5229/205229v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/5229/205229v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}