{"first_name":"James","last_name":"P. Lively","permalink":"james-p-lively","crunchbase_url":"http://www.crunchbase.com/person/james-p-lively","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"DIY Media","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Feb 07 21:37:46 UTC 2011","updated_at":"Fri Mar 11 00:47:53 UTC 2011","overview":"<p>Jim Lively is a seasoned professional with over 20 years experience in directing, managing, and executing all aspects of sales and marketing activities. Jim has developed high concentrations of capabilities in opportunity identification and qualification, territory management, fiscal and forecast realizations. He joined Wang Laboratories and worked with other large organizations such as Hewlett Packard, IBM, and Banyan Systems, learning and developing key solution selling approaches to client needs. He worked for Axis Consulting and helped developed a key international recruiting organization that built one of the largest SAP consulting divisions in the US, ultimately acquired by Andersen Consulting. Similarly he joined Data Processing Resources Corporation and helped to grow that organization where it was acquired by Compuware.\nHe founded a very successful IT Consulting firm that managed and worked with key Washington State officials to upgrade a state wide computer system that handles the human resources, fiscal, and student information needs of the state’s 280 school districts and 1.4 million students. He became the Chief Operating Officer of EDTEK Inc., a solar concentrator Research and Development company where he procured venture capital investment required to finish commercial development of a patented Concentrator design while reorganizing the corporate structure to become a worldwide manufacturing and distribution Company in addition to ongoing Research and Development. The Company was sold to an International buyer.\nHe worked extensively setting up business plans for wind development project Operation and Maintenance support for GE Energy Systems, Suzalon, Vestas, and Mitsubishi wind turbine products and towers. Joining GreenFoot Technologies in an advisory role as its Chief Operating Officer, he was very active with corporations in the Solar, Wind, Biomass, and Smart Grid communities developing strategic personnel fulfillment solutions for the growing demand of quality engineering and business professionals needed to support this growing worldwide marketplace. As the Chief Operating Officer of the premier digital media company DIY Media, his focus has been in structuring the organization for enhanced diversification into a variety of digital offerings to different market industries and providing the highest quality products and tools possible to DIY’s customers.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Operating Officer","firm":{"name":"DIY Media","permalink":"diy-media","type_of_entity":"company","image":{"available_sizes":[[[150,58],"assets/images/resized/0012/2350/122350v2-max-150x150.png"],[[250,96],"assets/images/resized/0012/2350/122350v2-max-250x250.png"],[[450,174],"assets/images/resized/0012/2350/122350v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}