{"first_name":"James","last_name":"Carlino","permalink":"james-carlino","crunchbase_url":"http://www.crunchbase.com/person/james-carlino","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Aug 21 06:51:09 UTC 2012","updated_at":"Thu Aug 23 18:55:18 UTC 2012","overview":"<p>When it comes to police work and security detail, few are as experienced as police chief James R. Carlino. His 20 years of experience include fire response, EMT service, and airport law enforcement and security. He has been involved in police work up and down the ladder, and knows the force like the back of his hand. </p>\n\n<p>After beginning his career, he decided he wanted to return to school and add further education to his resume. He enrolled at Saint Leo University and received a degree in criminal justice administration. He learned the difficulties of being a working adult trying to attend school. Since finishing his experience, he has newfound respect for adult students. He encourages them to never give up, and keep working towards the light at the end of the tunnel.</p>\n\n<p>His experience made him realize he wanted to help students as much as he could. He became a professor at two different schools. He leads online course for State college of Florida as well as Capella University. He teaches a public safety and security course, and a homeland security course. James Carlino’s students look up to him. They revere his years of hands-on experience.</p>\n\n<p>Police Chief Carlino led a patrol force in the busiest and most violent part of Atlanta. Throughout Buckhead, he and his team were cracking down on criminals. In just the first year of his efforts, crime rates had dropped to record lows. His goal is to return the night-club district to a safer community.</p>\n\n<p>Finally, he has worked as airport security, customs officer and even security detail for the 1996 Olympics. James Carlino has learned the intricacies of these kinds of positions. He knows what to look for to prevent crime, and how to keep things orderly so people stay safe. Police Chief James R. Carlino is a talented and valuable public safety professional.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/7151/207151v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/7151/207151v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/7151/207151v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}