{"first_name":"James","last_name":"Hot","permalink":"james-hot","crunchbase_url":"http://www.crunchbase.com/person/james-hot","homepage_url":"http://www.searchpagelocal.com","birthplace":"US","twitter_username":"searchpagelocal","blog_url":"http://www.searchpagelocal.com","blog_feed_url":"http://searchpagelocal.com/blog","affiliation_name":"Unaffiliated","born_year":1981,"born_month":4,"born_day":1,"tag_list":"google, yahoo, and-bing, social-media-sites, business-directory, advertising, web-development, marketing, local-advertising, search, professional-business-services, products, services, leads, sales-leads, content-management-systems, drupal, cms, directory","alias_list":null,"created_at":"Fri Apr 06 03:35:57 UTC 2012","updated_at":"Wed Apr 11 21:18:20 UTC 2012","overview":"<p>searchpagelocal.com helps people connect with the products and services they need.</p>\n\n<p>This is your guide to professional business services online business directory portal with the most up to date business listings nationwide and worldwide.</p>\n\n<p>Customers and vendors</p>\n\n<p>helping customers and vendors to find what they want in the area Search by City, State and Zip code.</p>\n\n<p>For Business</p>\n\n<p>Connect Your Business to the Target Audience This site provides a central location for businesses to set-up, maintain and track local search advertising campaigns.</p>\n\n<p>Local searchers are ready to take action. Reach qualified customers with local search marketing &amp; local advertising. organic search results Search management, keywords that have proven to contribute to our client&#8217;s business goals and content management systems giving our clients tools for controlling your search results on all the major search engines, Google, Yahoo, and Bing, and social media sites. advertising and marketing tools to bring businesses and customers together.</p>","image":{"available_sizes":[[[150,18],"assets/images/resized/0018/2927/182927v2-max-150x150.png"],[[250,30],"assets/images/resized/0018/2927/182927v2-max-250x250.png"],[[292,36],"assets/images/resized/0018/2927/182927v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}