{"first_name":"James","last_name":"Whelton","permalink":"james-whelton","crunchbase_url":"http://www.crunchbase.com/person/james-whelton","homepage_url":"http://jameswhelton.com","birthplace":"Cork, Ireland","twitter_username":"jwhelton","blog_url":"","blog_feed_url":"","affiliation_name":"Coderdojo","born_year":1992,"born_month":8,"born_day":31,"tag_list":"","alias_list":"","created_at":"Tue Feb 28 23:36:31 UTC 2012","updated_at":"Sun Dec 09 06:08:22 UTC 2012","overview":"<p>Entrepreneur, Developer and Social Media Connoisseur, James Whelton lives and breathes for technology, business and problem solving. James is experienced in all areas of IT, from computer hacking to iOS development to Social Platform data parsing and analysis to teaching 8 year olds to develop websites in HTML and CSS.</p>\n\n<p>James has appeared on The Wall Street Journal, Engadget, Wired, TechCrunch, the San Fransico Chronicle and more for CoderDojo, IT and hacking. He has appeared on RTE, BBC, ITV and other TV channels for his creation of viral content. He has also featured on various shows such as The Business on RTE, Nationwide and more on the discussion of IT in Education and youth entrepreneurship.</p>\n\n<p>James is an enthusiastic speaker. He has spoken at the 5th and 7th Dublin Web Summit, JSConf Berlin 2011, Funconf 2011, TEDxDublin, CorkBIC Going International Conference, in addition to at various 3rd level institutions such as LIT, Trinity, UCC. He also spoke at Barcamp Cork 2009 on hacking and was head organiser of Barcamp Cork 2010. In addition to this he has been on various panels with regards to technology in education, such as at F.ounders 2011, GTUG in Google Dublin, Young Entrepreneur, Mozilla&#8217;s Mozfest London and more.</p>\n\n<p>James is interested in technology in primary and secondary level education and has setup clubs to aid this, to which he also taught students in his own school web design and programming on a weekly basis. Prompting this he set up Coder Dojo with Bill Liao, a not for profit organisation setting up computer clubs across Ireland and the world, from Arranmore Island off Donegal to San Francisco. CoderDojo has garnered support from institutions such as Twitter, Google, Facebook, Foursquare, Tumblr, GitHub, Microsoft, Enterprise Ireland and more.</p>","image":{"available_sizes":[[[150,121],"assets/images/resized/0017/6256/176256v1-max-150x150.png"],[[154,125],"assets/images/resized/0017/6256/176256v1-max-250x250.png"],[[154,125],"assets/images/resized/0017/6256/176256v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Coderdojo","permalink":"coderdojo","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0017/6253/176253v1-max-150x150.png"],[[250,76],"assets/images/resized/0017/6253/176253v1-max-250x250.png"],[[398,122],"assets/images/resized/0017/6253/176253v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://jameswhelton.com","title":"Personal Homepage"},{"external_url":"http://github.com/jwhelton","title":"GitHub"}]}