{"first_name":"James","last_name":"P. McCarter, M.D., Ph.D","permalink":"james-p-mccarter-m-d-ph-d","crunchbase_url":"http://www.crunchbase.com/person/james-p-mccarter-m-d-ph-d","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 19 19:47:27 UTC 2009","updated_at":"Fri Jun 19 19:48:32 UTC 2009","overview":"<p>Dr. McCarter is an expert in the application of genomics to parasitic disease, leading both industry and academic initiatives to reduce diseases of humans, animals, and plants caused by nematode worms. He founded Divergence in 1998 to apply new genomics technology to the discovery of effective and ecologically sound strategies for parasite control. A full-time employee of Divergence since 2002, Dr. McCarter leads scientific discovery and development within the Company. Dr. McCarter is also an Adjunct Instructor in Genetics at Washington University School of Medicine&#8217;s Genome Center (GC) in St. Louis, continuing work he initiated in 1998 as the Merck Fellow of the Helen Hay Whitney Foundation working with GC Director Dr. Robert Waterston. At the GC, Dr. McCarter has led the world&#8217;s largest effort devoted to the sequencing of genes from parasitic nematodes, generating over 500,000 expressed sequence tags (ESTs) from 32 species with funding from the National Institutes of Health and the National Science Foundation. He is a co-author of over 50 scientific papers and reviews. Dr. McCarter completed his medical and doctoral training at Washington University, receiving the Victor Hamburger Prize in developmental biology for his research on the model nematode C. elegans. Previously, he graduated magna cum laude from Princeton University, receiving the Cannon Award in biology. Dr. McCarter is the recipient of the 2003 Innovation Award from the Academy of Science of St. Louis, a member of the 2002 class of Henry Crown Fellows of the Aspen Institute, and a 2002 selection for the St. Louis Business Journal&#8217;s 40-Under-40 list of business leaders. He is the founder of Washington University&#8217;s Young Scientist outreach program and serves on the University&#8217;s National Research Advisory Council. In 2008, he joined the board of the Academy of Science of St. Louis.</p>","image":{"available_sizes":[[[73,108],"assets/images/resized/0004/9709/49709v1-max-150x150.jpg"],[[73,108],"assets/images/resized/0004/9709/49709v1-max-250x250.jpg"],[[73,108],"assets/images/resized/0004/9709/49709v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder, President, and Chief Scientific Officer","firm":{"name":"Divergence","permalink":"divergence","type_of_entity":"company","image":{"available_sizes":[[[150,33],"assets/images/resized/0004/9707/49707v1-max-150x150.png"],[[250,55],"assets/images/resized/0004/9707/49707v1-max-250x250.png"],[[259,58],"assets/images/resized/0004/9707/49707v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}