{"first_name":"James","last_name":"Desrosier","permalink":"james-desrosier","crunchbase_url":"http://www.crunchbase.com/person/james-desrosier","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Aug 19 08:00:24 UTC 2011","updated_at":"Fri Aug 19 08:03:20 UTC 2011","overview":"<p>James Desrosier is the former Executive Director at the University of California Santa Cruz Extension and logged his first experience in continuing professional education 20 years ago. At UCSC Extension in Silicon Valley, he led the resurgence of its largest academic division and the expansion of its online certificate portfolio. He then turned around enrollment for the entire institution, winning award recognition from the University Professional &amp; Continuing Education Association in 2010. He developed long-running national industry training programs for MasterCard University, during which time he also held executive positions at MasterCard, including Senior Vice President of Global Brand Marketing. Later, he delivered custom programs to the British Broadcasting Corporation’s News, World Service and Online divisions in London. Previously, as Executive Vice President at Excite, Inc., and Vice President at Infoseek Corporation, he served as a corporate officer for these public internet companies. Jim has spoken and published widely, including scholarship in two academic disciplines, which includes major recent articles in the Continuing Higher Education Review and Journal of Continuing Higher Education. He has earned two terminal degrees, a MFA in Writing &amp; Critical Theory, and a PhD (abd) in Media &amp; Communication at the European Graduate School in Switzerland.</p>","image":null,"degrees":[{"degree_type":"PhD ","subject":"Media & Communication","institution":"European Graduate School","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Senior VP Academic Affairs","firm":{"name":"Encore Career Institute","permalink":"encore-career-institute","type_of_entity":"company","image":{"available_sizes":[[[150,36],"assets/images/resized/0014/0689/140689v1-max-150x150.jpg"],[[241,58],"assets/images/resized/0014/0689/140689v1-max-250x250.jpg"],[[241,58],"assets/images/resized/0014/0689/140689v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}