{"first_name":"James","last_name":"Gray","permalink":"james-gray","crunchbase_url":"http://www.crunchbase.com/person/james-gray","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"VivaReal","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Feb 16 19:27:32 UTC 2010","updated_at":"Fri Feb 19 18:18:58 UTC 2010","overview":"<p>Currently serving as Chairman of VivaReal. VivaReal is the fastest growing online real estate marketplace in Latin America where people go to buy, sell or rent property. VivaReal currently operates in Brazil, Mexico, Colombia, the US (for Spanish speakers), and it provides a site dedicated for Expats interested in renting or buying property in any of 12 Latin America countries.</p>\n\n<p>Co-Founder, former Managing Director &amp; CEO of the London based company GET ME IN! Ltd., a leading secondary marketplace dedicated to tickets in UK and Europe. In Jan 2008, GET ME IN! was acquired by Ticketmaster, the world’s leading ticket company. GET ME IN! reported gross merchandise sales of approximately £9.1m ($18m USD) in 2007.</p>\n\n<p>James co-founded the company in 2003 and served as a pioneer and visionary in the emerging market. GET ME IN! only required an initial investment of £17,000 ($33K USD) and was self sufficient with no additional outside funding for nearly 4 years until new VC backed competition pushed the company to raise a modest round in Feb 2007. During that same time span, even with the new heavily funded VC competition, GET ME IN!’s revenues at least doubled every year.</p>\n\n<p>James was a founding member and served on the executive board of ASTA, the Association of Secondary Ticket Agents. The organization was formed to bring more consumer protection and confidence to the Secondary Ticket Market.</p>\n\n<p>In 2004, he was the 134th entrepreneur in history to be recognized by the UK government with an Innovator’s Visa.</p>\n\n<p>James has been an invited speaker on the topic of entrepreneurialism at Oxford Business School (Saïd) &amp; University of London. In addition, he was interviewed by a Financial Times journalist live on stage at a First Tuesday meeting and served as Chairman of a panel at the Internet World exhibition in London to choose the UK’s most promising start-up.</p>\n\n<p>In 2003 James received a B.A. in Spanish with a minor in Communication from San Diego State University. From 2001 to 2002 he studied international business and doing business abroad at the Universidad de Complutense in Madrid, Spain.</p>\n\n<p>In 2001, James organised a softball fundraiser in San Diego to help the fight against Leukaemia. The event had more than 300 participants and raised over $10,000 USD.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Advisor","firm":{"name":"VivaReal","permalink":"vivareal","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0014/6752/146752v2-max-150x150.png"],[[180,180],"assets/images/resized/0014/6752/146752v2-max-250x250.png"],[[180,180],"assets/images/resized/0014/6752/146752v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}