{"first_name":"James","last_name":"M. Geary","permalink":"james-m-geary","crunchbase_url":"http://www.crunchbase.com/person/james-m-geary","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 12 14:08:15 UTC 2009","updated_at":"Fri Jun 12 14:11:58 UTC 2009","overview":"<p>Jim combines more than 25 years of IT vendor management experience with nearly 20 years in information security and over a decade of success as the CEO of multiple venture-funded software and security start-ups. Jim was President and CEO of Pedestal Software, a leading supplier of enterprise audit and compliance software which was acquired by Altiris for $74 million. Jim served as a member of the Board of Directors of Network Intelligence, a leading SIM vendor, until it was acquired by EMC/RSA Security. Jim was the President of intrusion detection vendor Haystack Labs (acquired by Trusted Information Systems) and played a key role in the acquisition of TIS by Network Associates for $425 million. As VP of Marketing and International Sales for seven years at Security Dynamics (now part of EMC/RSA Security), Jim was responsible for worldwide marketing and international sales. His contributions established and built the SecurID brand which propelled the company to become the market leader in identity management. Jim helped grow revenue to $75 million, paving the way for one of the most successful IPOs of 1994. Jim earned his MBA at Boston College and holds a master&#8217;s degree from the University of Maryland.</p>","image":null,"degrees":[{"degree_type":"MBA","subject":"","institution":"Boston College","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President","firm":{"name":"eIQnetworks","permalink":"eiqnetworks","type_of_entity":"company","image":{"available_sizes":[[[141,78],"assets/images/resized/0004/8168/48168v1-max-150x150.jpg"],[[141,78],"assets/images/resized/0004/8168/48168v1-max-250x250.jpg"],[[141,78],"assets/images/resized/0004/8168/48168v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}