{"first_name":"James","last_name":"Hart","permalink":"james-hart","crunchbase_url":"http://www.crunchbase.com/person/james-hart","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Hit Systems","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Dec 01 16:52:47 UTC 2008","updated_at":"Wed Dec 17 03:37:40 UTC 2008","overview":"<p>James Hart is the co-founder and CTO of Hit Systems. </p>\n\n<p>James has been in the IT industry for over 8 years and has been involved in the virtualization market since it started gaining ground in the early 2000’s. With over 500 satisfied clients, he combines great customer service with excellent technical skills.</p>\n\n<p>James Hart’s Professional Background</p>\n\n<p>In 2000 James entered the professional workforce as a sales technician for Palm Tree Computers based in Oviedo, FL. This position honed his sales and customer service skills. Seeking a position with more responsibility; he parted ways and joined Biziteks in late 2002.</p>\n\n<p>In 2003 proving his worth to Biziteks; James Hart was promoted to lead technician. In this position he oversaw all projects, technicians, and day-to-day technical operations. Diving head first into leading operations at Biziteks tested James’ skills and proved he had what it takes. After 4 years with Biziteks; James moved on to a larger company where his expertise could be more utilized.</p>\n\n<p>In 2007 James joined a larger regional IT service provider; in this position James was able to utilize his virtualization expertise to consolidate client servers, improve efficiency, and decrease workplace costs. He also gained valuable experience in the network and telecom arenas.</p>\n\n<p>In mid-2007 James partnered with Steve Sequenzia to develop a company of their own vision; HIT Systems was born. Dissatisfied with current managed service offerings on the market they realized there had to be a better way. Combining both their skill sets and experience the HIT Systems model quickly came to fruition.</p>\n\n<p>Details of James Hart’s technical skill sets</p>\n\n<p>Microsoft Certified Information Technology Professional (MCITP) Server 2008\nMicrosoft Certified Systems Engineer (MCSE) on Windows Server 2003\nCisco Certified Systems Associate (CCNA)\nCisco Certified Design Associate (CCDA)\nVMWare Certified Professional (VCP)</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CTO","firm":{"name":"Hit Systems","permalink":"hit-systems","type_of_entity":"company","image":{"available_sizes":[[[150,47],"assets/images/resized/0003/0522/30522v2-max-150x150.jpg"],[[244,78],"assets/images/resized/0003/0522/30522v2-max-250x250.jpg"],[[244,78],"assets/images/resized/0003/0522/30522v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}