{"first_name":"James","last_name":"Turley","permalink":"james-turley","crunchbase_url":"http://www.crunchbase.com/person/james-turley","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 28 20:59:41 UTC 2009","updated_at":"Wed Jan 28 20:59:41 UTC 2009","overview":"<p>James S. Turley is Chairman and Chief Executive Officer of Ernst &amp; Young, a leading global professional services organization providing audit, risk advisory, tax, and transaction services. With approximately 130,000 people in 140 countries, Ernst &amp; Young is one of the largest professional services organizations in the world.</p>\n\n<p>Jim began his career with Ernst &amp; Young in 1977 in the US firm&#8217;s Houston office. Over the last 31 years, he has held a series of leadership positions throughout Ernst &amp; Young. Jim was named Metropolitan New York Area Managing Partner of Ernst &amp; Young LLP in 1998 and was appointed Deputy Chairman in 2000. In July 2001, he became Chairman &amp; CEO. Based in New York and London, Jim serves as senior advisory partner for many of Ernst &amp; Young&#8217;s largest global clients.</p>\n\n<p>As Chairman, Jim sets a clear and strong tone from the top, focused on quality, integrity, and professionalism. He has worked to create a high-performance work environment with a highly visible leadership commitment to &#8220;Quality in Everything We Do.&#8221; Ernst &amp; Young has been consistently recognized by Fortune magazine as one of the 100 Best Companies to Work For.</p>\n\n<p>Jim is actively engaged with many stakeholders as part of Ernst &amp; Young&#8217;s commitment to enhancing the public&#8217;s trust in professional services firms and in the quality of financial reporting. He has encouraged dialogue with key stakeholders across the globe regarding the many changes facing the world capital markets, including the advent of the Sarbanes-Oxley Act in the United States, the introduction of International Financial Reporting Standards in more than 100 countries throughout the world, and the overall movement toward greater convergence of global accounting standards and global governance.</p>\n\n<p>Throughout his career, Jim has actively supported numerous civic, cultural and business organizations. He co-chairs the Russia Foreign Investment Advisory Council. He is on the Board of Directors for Boy Scouts of America, Catalyst, the National Corporate Theater Fund and on the Board of Trustees for Rice University. He is also a member of the Business Roundtable, Transatlantic Business Dialog and IBLAC (International Business Leaders&#8217; Advisory Council for the Mayor of Shanghai). In October, 2007, was appointed Chair for the Governing Board of the U.S. Center for Audit Quality.</p>\n\n<p>Jim holds a Master&#8217;s and a BA in Accounting from Rice University in Houston, Texas. He enjoys sports, including golf and tennis. Jim and his wife, Lynne, have a 24-year old son. </p>","image":{"available_sizes":[[[96,150],"assets/images/resized/0003/5123/35123v1-max-150x150.jpg"],[[160,250],"assets/images/resized/0003/5123/35123v1-max-250x250.jpg"],[[240,373],"assets/images/resized/0003/5123/35123v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}