{"first_name":"James","last_name":"Everett","permalink":"james-everett","crunchbase_url":"http://www.crunchbase.com/person/james-everett","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Sep 04 10:13:48 UTC 2012","updated_at":"Tue Sep 04 10:14:43 UTC 2012","overview":"<p>James Everett is a partner at Aquillian, and takes primary responsibility for Aquillian’s strategy across the sustainability space. As part of that role, he leads the firm&#8217;s research and due diligence of investment opportunities.  </p>\n\n<p>James is committed to the integration of economic and ecological sustainability, believing that green ideas have increased potential for scale and impact when they are directed toward practical solutions of business problems. He has been a student of sustainability for the past twenty years.</p>\n\n<p>Before joining Aquillian, James was Conservation Finance Manager for the Pacific Forest Trust. Among other responsibilities, he conducted financial analysis of forestland acquisition opportunities and led marketing of carbon offsets generated from sustainable forest management. James also managed integrated conservation and development projects as a Natural Resource Management Specialist for the World Conservation Union in Iran.</p>\n\n<p>Previously, James worked in commercial finance with GATX Capital, where he conducted financial analysis and due diligence on investments in rail, air, marine, distributed power generation, telecommunications, and natural resources; worked in timberland investment and management with Wagner Forest Management; led a research and demonstration center for sustainability and renewable energy; worked for a photovoltaic systems integrator on installation of some of the first grid-tied PV systems in the San Francisco Bay Area; co-led a university recycling program; and has run his own arboricultural consulting business.</p>","image":{"available_sizes":[[[78,109],"assets/images/resized/0020/9573/209573v1-max-150x150.jpg"],[[78,109],"assets/images/resized/0020/9573/209573v1-max-250x250.jpg"],[[78,109],"assets/images/resized/0020/9573/209573v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Aquillian Investments","permalink":"aquillian-investments","type_of_entity":"financial_org","image":{"available_sizes":[[[150,33],"assets/images/resized/0020/9571/209571v1-max-150x150.jpg"],[[250,55],"assets/images/resized/0020/9571/209571v1-max-250x250.jpg"],[[337,75],"assets/images/resized/0020/9571/209571v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}