{"first_name":"James","last_name":"Li","permalink":"james-li","crunchbase_url":"http://www.crunchbase.com/person/james-li","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 28 17:13:44 UTC 2008","updated_at":"Thu May 29 00:11:41 UTC 2008","overview":"<p>Dr. James Li joined Kleiner Perkins Caufield &amp; Byers in October 2006.</p>\n\n<p>Prior to joining KPCB, James spent over 15 years of outstanding service with Merck Co. where he held positions of increasing responsibility in basic research, clinical research, regulatory affairs, new product development/access and franchise management, all with an Asia Pacific focus.</p>\n\n<p>James has been a known expert in the Asia Pacific pharmaceutical industry. He has published a number of papers on the region’s clinical, regulatory access and marketing issues and has been a regular speaker and guest consultant for a number of government regulatory agencies, academic institutes and industry associations.</p>\n\n<p>From 1996 to 2000, James was the Medical Director of Merck’s China Operations, where he successfully developed a first class professional medical team, conducted early phase clinical studies, and developed strong relationships with government regulatory agencies, key opinion leaders, and top research institutes.</p>\n\n<p>In 2003, James was appointed Regional Marketing Director, Hypertension, for the Asia Region and successfully drove the fast growth of Merck’s largest franchise in the region.</p>\n\n<p>James received his Medical Degree from Shanghai Medical University, completing an internship in Internal Medicine and a rotation in Oncology, followed by a Master of Science degree in Microbiology from the University of Montana.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Kleiner Perkins Caufield & Byers","permalink":"kleiner-perkins-caufield-byers","type_of_entity":"financial_org","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/0998/10998v8-max-150x150.jpg"],[[250,250],"assets/images/resized/0001/0998/10998v8-max-250x250.jpg"],[[450,450],"assets/images/resized/0001/0998/10998v8-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}