{"first_name":"James","last_name":"L. Dolan","permalink":"james-l-dolan","crunchbase_url":"http://www.crunchbase.com/person/james-l-dolan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Aug 03 04:18:11 UTC 2011","updated_at":"Wed Aug 03 04:23:44 UTC 2011","overview":"<p>As president and chief executive officer of Cablevision Systems Corporation, James L. Dolan oversees the company&#8217;s extensive media and telecommunications properties. Mr. Dolan also serves as executive chairman of The Madison Square Garden Company (MSG), the national sports, media and entertainment leader that was formerly part of Cablevision&#8217;s business portfolio.</p>\n\n<p>Under Mr. Dolan&#8217;s direction, Cablevision is one of the nation&#8217;s largest operators of cable telecommunications systems, developing and delivering the benefits of broadband and digital communications to millions of residential and business customers across the New York tri-state area and throughout four Western states. The company&#8217;s popular Optimum-branded telecommunications products include digital television, digital voice and high-speed Internet services. In the New York metropolitan area, Cablevision&#8217;s telecommunications properties also consist of Optimum WiFi, the nation&#8217;s largest wireless Internet network, and Optimum Lightpath, a leading provider of integrated business communications solutions that meets the needs of larger companies.</p>\n\n<p>Mr. Dolan also oversees Cablevision&#8217;s award-winning local media and programming properties. Consisting of seven local news channels and five traffic and weather channels, Cablevision&#8217;s News 12 Networks was launched in 1986 as the country&#8217;s first 24-hour, hyper-local news service, and today it is the nation&#8217;s largest and most watched regional news network. Cablevision&#8217;s MSG Varsity is the first suite of television and online services dedicated entirely to high school activities, and it empowers and teaches students to produce and deliver school-generated content for sharing with their local communities. Newsday Media Group delivers local content and valuable information through Long Island&#8217;s leading daily newspaper, Newsday, as well as the popular New York City daily, amNewYork. Also under the Cablevision umbrella is Clearview Cinemas, one of the New York tri-state area&#8217;s leading motion picture exhibitors and the owner of the renowned Ziegfeld Theatre.</p>\n\n<p>On the civic front, Mr. Dolan supports Cablevision&#8217;s Power to Learn program. The nationally recognized education initiative provides all K-12 schools in the New York tri-state-area communities Cablevision serves with free access to the company&#8217;s full suite of Optimum-branded digital video, high-speed Internet and digital voice services.</p>\n\n<p>Mr. Dolan is also dedicated to Cablevision&#8217;s partnership with The Lustgarten Foundation, an organization he helped found in 1998, which today is the nation&#8217;s largest private supporter of pancreatic cancer research. In 2008, Cablevision made a multi-year commitment to underwrite the Foundation&#8217;s costs, ensuring that 100 percent of every donation goes directly to researching this deadly disease. With Mr. Dolan&#8217;s backing, Cablevision also uses its assets to advance the curePC campaign, aimed at increasing public awareness of pancreatic cancer, and is responsible for organizing the Holiday Rock &amp; Roll Bash, the Foundation&#8217;s biggest annual fundraiser.</p>\n\n<p>In addition to his leadership role at Cablevision, Mr. Dolan is executive chairman of MSG, a former Cablevision company of which he was chairman for more than a decade before its spin-off in early 2010. In his present role at MSG, he oversees the company&#8217;s overall growth strategy and the management of its many entities, which include the world-famous arena complex; professional sports teams, the New York Knicks, Rangers and Liberty; sports and entertainment networks MSG and MSG Plus and the national music network Fuse; and performance venues such as The Chicago Theatre, and New York&#8217;s Radio City Music Hall and Beacon Theatre.</p>\n\n<p>Mr. Dolan has led MSG&#8217;s response to local and national tragedies. He played a principal role in organizing &#8220;The Concert For New York City,&#8221; which generated more than $35 million dollars in aid for 9/11 victims and heroes, and &#8220;From The Big Apple to The Big Easy,&#8221; which raised nearly $9 million for Hurricane Katrina relief. Mr. Dolan also supports MSG&#8217;s ongoing commitment to the community, particularly through the Garden of Dreams Foundation, the non-profit charity that partners with MSG to help children facing obstacles throughout the New York metropolitan area.</p>\n\n<p>Prior to assuming his current executive positions, Mr. Dolan was chief executive officer of Rainbow Media Holdings, the former Cablevision subsidiary now known as AMC Networks Inc. Mr. Dolan began his career with Cablevision in the 1970s and held a variety of executive positions before overseeing Rainbow Media.</p>\n\n<p>Mr. Dolan presently serves on Cablevision&#8217;s board of directors and its executive committee, and is a member of MSG&#8217;s board of directors. In addition, he serves on the board of AMC Networks Inc., which became a separate public company after its spin-off from Cablevision in July 2011, and consists of some of the country&#8217;s most watched and recognized cable networks, including AMC, IFC, Sundance Channel and WE tv.</p>\n\n<p>Mr. Dolan is also on the board of directors of Live Nation, The Lustgarten Foundation, the New York University Steinhardt Dean&#8217;s Council and the Breathe Easy Play Hard Foundation.</p>","image":{"available_sizes":[[[80,100],"assets/images/resized/0014/7553/147553v1-max-150x150.jpg"],[[80,100],"assets/images/resized/0014/7553/147553v1-max-250x250.jpg"],[[80,100],"assets/images/resized/0014/7553/147553v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President & CEO","firm":{"name":"Cablevision","permalink":"cablevision","type_of_entity":"company","image":{"available_sizes":[[[150,32],"assets/images/resized/0005/9406/59406v2-max-150x150.png"],[[191,41],"assets/images/resized/0005/9406/59406v2-max-250x250.png"],[[191,41],"assets/images/resized/0005/9406/59406v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}