{"first_name":"James","last_name":"Im","permalink":"james-im-2","crunchbase_url":"http://www.crunchbase.com/person/james-im-2","homepage_url":"http://www.fongenie.com","birthplace":"","twitter_username":"thejamesim","blog_url":"http://blog.fongenie.com","blog_feed_url":"http://blog.fongenie.com/feeds/posts/default?alt=rss","affiliation_name":"FonGenie","born_year":null,"born_month":null,"born_day":null,"tag_list":"james-im, real-time, crm, sales-automation, smb, retail, mobile, telephony, fongenie","alias_list":null,"created_at":"Sat Jun 28 19:23:57 UTC 2008","updated_at":"Mon May 17 05:39:06 UTC 2010","overview":"<p>James Im is an accomplished new products introduction executive with plethora of experience taking an idea to proof of concept and market realization with delivery of revenue in its first twelve months for its products and services responsible for launch. Before founding FonGenie, Inc. in 2009, James was Vice President of Services at LignUp, Inc., where he defined and launched the Services organization responsible for Customer Advocacy and Professional Services to enable service providers in the US, EMEA and APAC to deliver converged communications solution that integrate video, fax, voice and unified massaging to its customers worldwide.  </p>\n\n<p>He also led a team of 20 to build, market and operate a platform-as-a-service by introducing web-based API’s to Softswitch and Media server platforms allowing developers to quickly and easily mash-up voice and rich media into social networking, widgets, web and mobile applications as well a monetization services to help generate revenue from usage, traffic and users via voice and mobile advertisement. The platform-as-a-service enabled through HeyCosmo launched during DEMO fall 2008 generated revenue of $3M during its first year inclusive of time and effort for development, proto-typing and market trial, while working with customers and partners such as Meebo, Justin.TV, uSteram, RockYou, Free411 and Apptera.</p>\n\n<p>Prior to LignUp, James was the founder and CEO of iMedia Networks, which re-defined the monetization for multi-playable computer games and revenue model for packaged computer games software. iMedia Networks become profitable during its first 5 months of operations and generated $7M in revenue in its first year. The company launched notable games such as Counter Strike, Half-Life and Bejeweled as a software-as-a-service catered to the Internet cafes around the world.</p>\n\n<p>James began his career as a new product introduction manager and engineer at VocalTec Communications, the pioneer and a leading developer of VoIP software solutions. He spearheaded numerous groundbreaking initiatives, including deployment of the world’s first VoIP trial and commercial integration and roll-out. James also worked for Bell Laboratories and Lucent Technologies as a DMTS and Director, modeling complex hybrid networks and leading the bids, proposal and solutions team managing all major accounts and all enterprise customers driving $1.2B in new revenue and managing projects such as Sprint-Nextel integration and introducing Voice-over-IP to AT&amp;T Wireless. Prior to Bell Labs, James was part of its NGN team managing company’s largest project to date, Sprint ION for BellCore/Telcordia and also worked for AT&amp;T Wireless.</p>","image":{"available_sizes":[[[90,107],"assets/images/resized/0002/1220/21220v5-max-150x150.jpg"],[[90,107],"assets/images/resized/0002/1220/21220v5-max-250x250.jpg"],[[90,107],"assets/images/resized/0002/1220/21220v5-max-450x450.jpg"]],"attribution":"<p>Corporate</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"President and CEO","firm":{"name":"FonGenie","permalink":"fongenie","type_of_entity":"company","image":{"available_sizes":[[[150,46],"assets/images/resized/0005/3498/53498v2-max-150x150.png"],[[250,78],"assets/images/resized/0005/3498/53498v2-max-250x250.png"],[[384,120],"assets/images/resized/0005/3498/53498v2-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"President and CEO","firm":{"name":"Arsenal Interactive","permalink":"arsenal-interactive","type_of_entity":"company","image":{"available_sizes":[[[144,72],"assets/images/resized/0002/1219/21219v2-max-150x150.png"],[[144,72],"assets/images/resized/0002/1219/21219v2-max-250x250.png"],[[144,72],"assets/images/resized/0002/1219/21219v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}