{"first_name":"James","last_name":"Price","permalink":"james-price","crunchbase_url":"http://www.crunchbase.com/person/james-price","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Aug 10 06:49:59 UTC 2012","updated_at":"Fri Aug 10 11:22:04 UTC 2012","overview":"<p>James Price is a man that can work in any business industry with no problems adapting. He is an independent and hardworking entrepreneur that has worked for companies that have left a positive impact on many people’s lives. Not only is he a leader but he has values that has brought him so much success in his career. What is his story?</p>\n\n<p>History</p>\n\n<p>James figured out in 1992 that companies and businesses needed services for organization and support which is why he built an advisory agency called Aero Financial. Aero Financial put more focus into businesses that dealt with nutrition, food services, financial services and health. Some of the services offered to these companies were how to developing business plans, accounting and finance services and others. The idea was to help businesses reach extreme success by unlocking their potential.</p>\n\n<p>In 2005, James built another company called Genesis Venture Fund Managers which focuses on assisting businesses trying to succeed in international markets such as India. When it comes to the educational industry of the Indian markets, the Genesis Venture Fund Managers provides India with investment banking services.</p>\n\n<p>James took over Papa Bello Enterprises in 2009 and after building the company up to what it needed to be, he sold it in 2012. Trunk Health Inc. became his new project in 2010 and focuses on selling and manufacturing products that are health related. One of the most popular products created by the company is their condoms.</p>\n\n<p>More about James </p>\n\n<p>Now, in the year of 2012, James Price of San Diego is the president of Dinepedia. This website is basically a place where people can find listings for some of their favorite dining places. Not to mention, they can post reviews, see menus, order online, find out hours of operation and even make reservations. James spends a lot of his time in nonprofit organizations like the YMCA and the I Am foundation.</p>\n\n<p>The “I Am” foundation is recognized all over the world because it touches the lives of not just children but adults also. What children and adults learn contributes to their self-worth and helps them understand the importance of their hygiene and personal health. On top of helping to manage a variety of different successful companies, James’ company Aero assists with website developing, developing mobile applications, and other marketing strategies. </p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/5408/205408v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/5408/205408v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/5408/205408v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}