{"first_name":"James","last_name":"Beldock","permalink":"james-g-beldock","crunchbase_url":"http://www.crunchbase.com/person/james-g-beldock","homepage_url":"http://www.jamesbeldock.com","birthplace":"New York, NY","twitter_username":"jbeldock","blog_url":"http://www.jamesbeldock.com","blog_feed_url":"","affiliation_name":"SST Inc. (Formerly ShotSpotter)","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Feb 02 14:44:34 UTC 2009","updated_at":"Thu Mar 01 08:49:32 UTC 2012","overview":"<p>James G. Beldock, an experienced turn-around and growth entrepreneur, joined the ShotSpotter team in early 2003, when he was introduced by the Company&#8217;s lead investor. As the company’s first CEO, James developed and executed ShotSpotter’s market entry strategy and led the company from deployments in four cities to over 50, increased annual sales more than 50-fold, and led the company’s 2005 acquisition of Centurist Systems and its 2009 acquisition of the SECURES business unit of Planning Systems, Inc. </p>\n\n<p>He has now turned his energies towards global market penetration as President of the company’s International efforts. ShotSpotter is his third venture-funded or private equity-backed company, and he has raised in excess of $65m for companies he has led. Previously, he was chairman and CTO of WebPutty, an enterprise software company subsequently acquired by Charles River, of which he had previously served as the Company&#8217;s president and CEO. Prior to joining WebPutty, James was Entrepreneur in Residence at SAC Capital where he performed turn-around and portfolio operations work at other portfolio companies. Previously, as president and CEO of Cogito Software, a company he founded in 1994, James delivered software and managed technology projects for well-known institutions including Princeton University and New York Hospital/Cornell Medical Center. He has also served as vice president for R&amp;D and CTO at Primavera Laboratories, where he was responsible for product development of over-the-counter drugs and other regulated products generating retail revenues in excess of $300m. He holds patents in the fields of computer memory hardware, Internet business methods and information security and has published peer review articles in fields ranging from medical informatics to user interface design.</p>\n\n<p>James is a cum laude graduate of Yale University and studied Computer Science at Columbia University. In 2001, James was recognized as one of America’s leading executives under the age of 45 when he was named a Henry Crown Fellow of the Aspen Institute. He sits on the board of directors of PAX, the nation&#8217;s largest anti-gun violence non-profit organization and creator of the life-saving Ask and Speak Up! campaigns, and is a member of Business Executives for National Security (BENS) and the Steering Committee of the Aspen Institute Socrates Society. He maintains a blog at www.jamesbeldock.com.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0008/9989/89989v2-max-150x150.jpg"],[[167,250],"assets/images/resized/0008/9989/89989v2-max-250x250.jpg"],[[301,450],"assets/images/resized/0008/9989/89989v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.A.","subject":"Classical Civilization (Greek & Latin)","institution":"Yale University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"SVP Product & Business Development","firm":{"name":"SST Inc. (Formerly ShotSpotter)","permalink":"shotspotter","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0003/5465/35465v4-max-150x150.jpg"],[[250,58],"assets/images/resized/0003/5465/35465v4-max-250x250.jpg"],[[450,104],"assets/images/resized/0003/5465/35465v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.jamesbeldock.com","title":""},{"external_url":"http://www.jamesbeldock.com","title":""}]}