{"first_name":"Jamie","last_name":"Ireland","permalink":"jamie-ireland","crunchbase_url":"http://www.crunchbase.com/person/jamie-ireland","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 05 06:16:35 UTC 2009","updated_at":"Fri Jun 05 06:24:20 UTC 2009","overview":"<p>Jamie Ireland has been a Managing Director of Early Stage Partners since its formation in 2001 and Chairman and Managing Director of its parent, Capital One Partners LLC since 1993, a capacity in which he continues to serve.  He has led several of the portfolio transactions and participates in the evaluation and approval of all investments made by Early Stage Partners. He serves on the board of Imalux Corporation, OPTEM, and Supplier Insight, several portfolio companies of Capital One, and two public companies, Cliffs Natural Resources, a significant global producer of iron ore and coal, and OurPets, a producer and marketer of a diversified line of pet products. Until March 1998 when the company was successfully sold through a competitive tender offer process, he also served as Chairman of the Board of SunCoast Industries, Inc., a New York Stock Exchange-listed producer of plastic products and molding compounds.</p>\n\n<p>Prior to forming Capital One, Mr. Ireland was a partner at RRY Partners, a merchant-banking firm involved in principal investments, financing and M&amp;A  transactions foir various portfolio companies  in the energy, natural resource, communications, real estate and environmental industries. He also served as President, Chairman or a Director of several of these companies, both during and after leaving the firm. Prior to 1983, Mr. Ireland served in the Corporate Finance Department of Salomon Brothers Inc, where he participated in the structuring and execution of over 75 financing and acquisition transactions totaling over $12 billion, primarily with communications, natural resource and manufacturing companies.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0004/6834/46834v1-max-150x150.jpg"],[[161,200],"assets/images/resized/0004/6834/46834v1-max-250x250.jpg"],[[161,200],"assets/images/resized/0004/6834/46834v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.A.","subject":"","institution":"Columbia College","graduated_year":1972,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Managing Director","firm":{"name":"Early Stage Partners","permalink":"early-stage-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[123,86],"assets/images/resized/0004/6832/46832v1-max-150x150.jpg"],[[123,86],"assets/images/resized/0004/6832/46832v1-max-250x250.jpg"],[[123,86],"assets/images/resized/0004/6832/46832v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}