{"first_name":"Jan","last_name":"Garfinkle","permalink":"jan-garfinkle","crunchbase_url":"http://www.crunchbase.com/person/jan-garfinkle","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 04 07:57:49 UTC 2009","updated_at":"Thu Jun 04 07:59:59 UTC 2009","overview":"<p>Jan Garfinkle specializes in medical technology investments, utilizing her educational background in biomedical engineering, extensive operating experience, and industry connections to select and nurture outstanding companies. Her investing activities primarily focus on FDA 510(k) and PMA medical device and diagnostics companies. Jan currently serves on the board of directors for HandyLab and NXThera Inc., and as an observer for Aptus Endosystems, BAROnova, Esperion Therapeutics and Uptake Medical.</p>\n\n<p>Prior to founding Arboretum in 2002, Jan spent 20 years in senior management positions in entrepreneurial healthcare companies. Jan was Founder and President of Strategic Marketing Consultants, a consulting firm focused on the commercialization of healthcare technologies for start-ups and large medical device manufacturers. Earlier in her career, Jan worked for two successful medical device start-up companies, Advanced Cardiovascular Systems (ACS) and Devices for Vascular Intervention (DVI). Each of these companies was acquired by Eli Lilly and Company for more than $100 million and became the foundation for Guidant Corporation, which Eli Lilly later spun out in 1994. She joined each company early in its development and held key management roles in marketing, clinical research and sales. She began her career as a manufacturing engineer and production line manager for Proctor and Gamble.</p>\n\n<p>Jan has served on a number of advisory boards focused on capital formation and enhancing the commercialization of promising technologies. She is a board member of the Michigan Venture Capital Association (MVCA) and is the past president of the MVCA.  Additionally, she is a member of the Commercialization Advisory Board of the Global Cardiovascular Innovation Center (GCIC) at the Cleveland Clinic.</p>","image":{"available_sizes":[[[100,125],"assets/images/resized/0004/6622/46622v1-max-150x150.jpg"],[[100,125],"assets/images/resized/0004/6622/46622v1-max-250x250.jpg"],[[100,125],"assets/images/resized/0004/6622/46622v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.S.","subject":"Bioengineering","institution":"University of California","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder and Managing Director","firm":{"name":"Arboretum Ventures","permalink":"arboretum-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,60],"assets/images/resized/0004/6621/46621v1-max-150x150.png"],[[151,61],"assets/images/resized/0004/6621/46621v1-max-250x250.png"],[[151,61],"assets/images/resized/0004/6621/46621v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}