{"first_name":"Janet","last_name":"Yang","permalink":"janet-yang","crunchbase_url":"http://www.crunchbase.com/person/janet-yang","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Nov 25 07:09:37 UTC 2008","updated_at":"Tue Nov 25 07:17:38 UTC 2008","overview":"<p>Janet Yang joined Novak Biddle Venture Partners in 2006. Trained in electrical engineering from Stanford University, Janet started her investment career on Wall Street as a sell-side equity research analyst for Merrill Lynch and later Salomon Smith Barney, where she was a top-ranked analyst in her sector according to fund managers’ surveys, and helped raised over $800 million for various corporations.</p>\n\n<p>Janet is on the board of CivicUS and serves as a Board Observer for portfolio companies: Avail Media, eMinor, Freewebs, Starfish Retention Solutions, and Ztar Mobile.</p>\n\n<p>Prior to Novak Biddle, Janet worked closely with William H. Draper, III in San Francisco-based venture capital firm, Draper Richards, focusing on early-stage technology investments in the United States and India.</p>\n\n<p>Janet brings substantial international experience, as well as operating experience, to Novak Biddle. She has over 10 years of work experience in Asia, in particular, the Greater China region. While in Asia, Janet held various senior executive positions at PCCW, the largest telecommunications company in Hong Kong, reporting to Chairman and CEO Richard Li. Her experience included being the CFO of an IT outsourcing company in partnership with China Telecom and PCCW.</p>\n\n<p>Janet is multi-lingual, fluent in Chinese and had studied Japanese and French. She has lived and worked in New York, San Francisco, Washington DC, London, Tokyo, Hong Kong, Shanghai, and Beijing.</p>","image":{"available_sizes":[[[122,145],"assets/images/resized/0002/9530/29530v1-max-150x150.jpg"],[[122,145],"assets/images/resized/0002/9530/29530v1-max-250x250.jpg"],[[122,145],"assets/images/resized/0002/9530/29530v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Principal","firm":{"name":"Novak Biddle Venture Partners","permalink":"novak-biddle-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,69],"assets/images/resized/0000/3475/3475v1-max-150x150.png"],[[200,93],"assets/images/resized/0000/3475/3475v1-max-250x250.png"],[[200,93],"assets/images/resized/0000/3475/3475v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}