{"first_name":"Janice","last_name":"M. Weiland","permalink":"janice-m-weiland","crunchbase_url":"http://www.crunchbase.com/person/janice-m-weiland","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Nov 17 18:46:01 UTC 2008","updated_at":"Mon Nov 17 18:57:47 UTC 2008","overview":"<p>Jan Weiland is an experienced professional in financial services with more than twenty years in banking.  She earned her BS/BA from Suffolk University and earned her Master of Management degree from Northwestern University/Kellogg School of Business.  Jan managed Private Banking at U. S. Bank for Southern Colorado. Joining Salomon Smith Barney in 1997, she continued to focus on providing quality client service to high net worth individuals. Jan&#8217;s current practice at Cascade Investment Group is devoted to assisting her clients achieve their financial goals utilizing portfolio management techniques. She works with a team of professionals who provide expertise on tax and estate planning. Jan relocated to Colorado Springs twelve years ago and is an active community volunteer. She is currently on the Boards of Memorial Hospital (Chair), Justice Watch (Chair), and The Colorado Springs Child Nursery Centers Foundation (Secretary), Court Care, as well as the C.U. Aging Center Development Committee.</p>\n\n<p>Jan has previously served on the Colorado Economic Development Commission, the El Paso County Planning Commission, the Colorado Women&#8217;s Economic Development Council, as well as the Boards of the Southern Colorado Women&#8217;s Chamber of Commerce (founding President), the National Association of Women Business Owners - Pikes Peak Chapter (founding President), The University Club (President), the Memorial Hospital Foundation, Junior Achievement of Southern Colorado, and Girl Scouts - Wagon Wheel Council.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0002/8760/28760v1-max-150x150.jpg"],[[166,250],"assets/images/resized/0002/8760/28760v1-max-250x250.jpg"],[[180,270],"assets/images/resized/0002/8760/28760v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Vice President, Investments","firm":{"name":"Cascade Investment","permalink":"cascade-investment","type_of_entity":"financial_org","image":{"available_sizes":[[[150,65],"assets/images/resized/0002/8754/28754v1-max-150x150.jpg"],[[221,96],"assets/images/resized/0002/8754/28754v1-max-250x250.jpg"],[[221,96],"assets/images/resized/0002/8754/28754v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}