{"first_name":"Janus","last_name":"Boye","permalink":"janus-boye","crunchbase_url":"http://www.crunchbase.com/person/janus-boye","homepage_url":"http://jboye.com","birthplace":"Odense, Denmark","twitter_username":"janusboye","blog_url":"http://jboye.com/blog","blog_feed_url":"http://www.jboye.com/feed/","affiliation_name":"Unaffiliated","born_year":1979,"born_month":6,"born_day":25,"tag_list":"","alias_list":null,"created_at":"Sat Feb 06 10:57:24 UTC 2010","updated_at":"Sat Feb 06 19:53:29 UTC 2010","overview":"<p>As founder and managing director at J. Boye, Janus has grown the business from an office at home in 2003 to a global operation today; still a small team, but with permanent presence in both Denmark and the United Kingdom.</p>\n\n<p>Renowned as a productive author, Janus covers topics such as intranet, CMS, strategy and occasional posts about popular tools such as Sitecore and SharePoint. He has contributed to several CMS Watch reports since 2006, including The Web CMS Report, Enterprise Portals Report and Enterprise Social Software &amp; Collaboration Report.</p>\n\n<p>He has also co-authored research on Wiki in the Enterprise and Best Practices for Using SharePoint for Public Websites together with J. Boye analyst Dorthe Jespersen.</p>\n\n<p>Janus is a frequent speaker at industry events and chairs the internationally recognized J. Boye Conferences held each year in Aarhus, Denmark and Philadelphia, US.</p>\n\n<p>Prior to setting out as an entrepreneur, Janus attended school in Denmark and in the US. Later he worked 5 years in Germany, including 4 years with an American CMS vendor travelling around Germany and Eastern Europe, in various technical, sales, and product management roles.</p>\n\n<p>Personally and outside work, Janus enjoys running and visiting family. He thrives in Aarhus, Denmark all year round where he resides in an old townhouse with his fiancée and young son.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/janusboye","title":"LinkedIn"},{"external_url":"http://twitter.com/janusboye","title":"Twitter"}]}