{"first_name":"Jared","last_name":"Reitzin","permalink":"jared-reitzin","crunchbase_url":"http://www.crunchbase.com/person/jared-reitzin","homepage_url":"http://www.jaredreitzin.com","birthplace":"Pasadena, CA","twitter_username":null,"blog_url":"http://www.jaredreitzin.com","blog_feed_url":"http://www.jaredreitzin.com/feed/","affiliation_name":"mobileStorm","born_year":1977,"born_month":8,"born_day":20,"tag_list":"","alias_list":"","created_at":"Tue Feb 12 01:34:43 UTC 2008","updated_at":"Sun Nov 16 17:20:06 UTC 2008","overview":"<p>Jared Reitzin (www.jaredreitzin.com) is the chief executive officer and founder of <a href=\"http://www.crunchbase.com/company/mobilestorm\" title=\"mobileStorm\">mobileStorm</a>, a digital marketing company based in Los Angeles. mobileStorm, over the past 8 years, has pioneered the concept of digital marketing. Having successfully delivered over 2 billion messages for thousands of premier customers such as American Idol, Qantas Airways, MGM Grand, Palms Casinos, Carl’s Jr. and Squaw Valley Ski Resort, the company is at the forefront of the digital marketing revolution. mobileStorm has created the most complete digital marketing solution available, enabling clients to reach customers via email, text (mobile) messaging, voice messaging, fax broadcast or direct mail from a single provider. </p>\n\n<p>Prior to officially forming mobileStorm in October of 1999, Mr. Reitzin was CEO of Katalyst Music Group LLC, an independent record label and new media company. There, he directed the growth of the company as a promoter for musical acts, and provided web based communication and marketing projects for the entertainment community. Mr. Reitzin began his career as a product manager for Interactive Light - a leading developer and provider of networked sports simulators for such companies as IBM, Sega, Microsoft, Sony, and Intel. </p>\n\n<p>Mr. Reitzin sits on the boards of RACER Mobile Inc., a mobile marketing start-up as well as Wantickets, an online ticketing company. He regularly speaks on panels and at conferences about digital marketing and new media technologies.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"mobileStorm","permalink":"mobilestorm","type_of_entity":"company","image":{"available_sizes":[[[150,66],"assets/images/resized/0001/1601/11601v1-max-150x150.png"],[[150,66],"assets/images/resized/0001/1601/11601v1-max-250x250.png"],[[150,66],"assets/images/resized/0001/1601/11601v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}