{"first_name":"Jared","last_name":"Pobre","permalink":"jared-pobre","crunchbase_url":"http://www.crunchbase.com/person/jared-pobre","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Future Ads","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Nov 15 05:23:34 UTC 2010","updated_at":"Tue Jul 10 08:26:52 UTC 2012","overview":"<p>Jared founded Future Ads in 2001 and has grown the company into the large, successful, truly alternative media company it is today. He’s the driving force behind each new results-focused solution the company invents: all aimed at helping advertisers, app developers and online gaming sites drive more traffic, customers and revenue, far more cost-effectively than ever before.</p>\n\n<p>Jared identified the power and potential of online casual gaming when most still thought it was a niche, “novelty” space to invest in. To harness the power of this exploding market, he has established an ever-expanding portfolio of casual and social games and gaming sites, which deliver vast, hyper-engaged customer bases - and a unique, highly-targeted way to reach and acquire new customers - for both Tier 1 advertisers and app distributors.</p>\n\n<p>After graduating from USC with a business degree in ‘99, the Silicon Valley native quickly jumped into the then young Internet marketing world. Before founding Future Ads, he served as Senior Media Buyer at Internet car-buying first-mover, Autobytel.com, and prior to that was Director of Business Development for Local.com, the local search pioneer.\nBoth Jared and the company he has built have been honored with numerous awards for entrepreneurship and technology innovation. Future Ads has won back-to-back Inc. 500 awards (recognizing America’s fastest-growing enterprises), and took home an American Business Award (STEVIE) for Fastest Growing Company of the Year. Jared’s honors include being named Ernst and Young’s Entrepreneur of the Year for Technology (for Orange County/Desert Cities, CA).</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Future Ads","permalink":"future-ads","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0011/0205/110205v8-max-150x150.png"],[[180,180],"assets/images/resized/0011/0205/110205v8-max-250x250.png"],[[180,180],"assets/images/resized/0011/0205/110205v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}