{"first_name":"Jasbir","last_name":"Arora","permalink":"jasbir-arora","crunchbase_url":"http://www.crunchbase.com/person/jasbir-arora","homepage_url":"http://jasbirsingharora.weebly.com","birthplace":"India","twitter_username":"jassu9","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1956,"born_month":10,"born_day":5,"tag_list":"human-resources, hiring, recruitment, outsourcing","alias_list":null,"created_at":"Mon Jul 18 06:06:47 UTC 2011","updated_at":"Tue Jul 19 20:17:33 UTC 2011","overview":"<p>Getting the best out of people can be an organization’s most important task. Encouraging key talent to continue to generate fresh perspectives and innovative ideas to maintain competitive advantage is critical to business success. So what do organizations need to do to ensure that they attract key people, allow talent to thrive and, most importantly, avoid losing the talented workforce to the competition? </p>\n\n<p>This evergreen focus on talent is now more important than ever, underpinned by a fundamental revision of the people agenda. In a region where people with talent and ability are becoming harder to source by the day, it is the manner in which people are managed, and the values and ethics of the employer, that dictate the ability of any organization to attract, retain and develop the right people.</p>\n\n<p>It is me who is going to become increasingly accountable for bottom line profit through effective recruitment, people management, and leadership development and Corporate Liassoning and Business Development. </p>\n\n<p>25+ years of experience in leadership capacities in various Human Resources functions such as Talent &amp; Organization Development, Performance Management, Compensation, Learning, Staffing, Employee Relations and HR Operations. Strengths include operating in a pan India Power and Steel Sector and global environment (Korean) in matrix and virtual setups, strategy formulation and execution, learn ability and adaptability, designing and implementing organization wide processes, experience in organization design and change management that too in JV in Eastern India, understanding of the manufacturing, high technology business, knowledge of statutory compliances and legal frameworks on HR front. Got learning exposure of EVA, PCMM and BSC. Introduced Dave Ulrich model of HR as business and strategy integrator. Possess in-depth experience of working with global senior leadership teams, strategic people leadership &amp; management, communication and networking skills.</p>\n\n<p>As HR Leader, responsible for providing expertise in talent management, succession planning, compensation &amp; benefits, leadership development, coaching for improved performance/job satisfaction, resolution of interpersonal or departmental conflict and team building with responsibility for OD and change management. </p>\n\n<p>Actively lead manufacturing line transitions and organization wide change management efforts including implementation with managers of communication, compensation &amp; benefits and absorption strategies and other schemes associated with the terminal benefits. Facilitating  total involvement of all stake holders during - acquisitions, mergers, and downsizing in order to sustain productivity and maintain a positive work environment particularly in one of the first and unique Joint Venture between 2 PSUs of India with an eye on converting red into profit making, the ailing PSU i. e. SAIL by NTPC by acting as big brother.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0014/4696/144696v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0014/4696/144696v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0014/4696/144696v2-max-450x450.jpg"]],"attribution":"<p>Jasbir Singh Arora</p>"},"degrees":[{"degree_type":"Graduation","subject":"Indingustrial Engineer","institution":"IIT,Roorkee,India","graduated_year":1978,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[{"description":"Positive outcome achieved in a long litigation for self esteem and honesty is expected anytime.","stoned_year":2011,"stoned_month":7,"stoned_day":12,"source_url":"http://delhihighcourt.nic.in","source_text":null,"source_description":"High Court of Delhi WP 7359/2006","stoneable_type":"Person","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"first_name":"Jasbir","last_name":"Arora","permalink":"jasbir-arora"}}],"video_embeds":[],"external_links":[{"external_url":"http://slideshare.net/jassu9","title":"Articles"}],"web_presences":[{"external_url":"http://in.linkedin.com/in/jasbirsingharora","title":"HR Professional"},{"external_url":"http://jassu9.twitter.com","title":"Hiring Expert"},{"external_url":"http://myspace.com/519865188","title":"Myspace"},{"external_url":"http://screencast.com/users/jassu9","title":"Screencast"},{"external_url":"http://connectnow-acrobat.com/jassu9","title":"Webconferencing"},{"external_url":"http://hellotext.com/81226897","title":"Textmessaging"},{"external_url":"http://wiziq.com/jasbir761676","title":"Tutoring"},{"external_url":"http://blogtalkradio.com/jassu9","title":"Radio-talk To World"},{"external_url":"http://jassu9.presently.com","title":"Presentations"},{"external_url":"http://slideshare.net/jassu9","title":"Important Presentations"},{"external_url":"http://youare.com/jassu9","title":"Introduction"}]}