{"first_name":"Jasmine","last_name":"Hor Myn Li","permalink":"jasmine-hor-myn-li","crunchbase_url":"http://www.crunchbase.com/person/jasmine-hor-myn-li","homepage_url":"http://www.logodesigncreation.com","birthplace":"Malaysia","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Khaw Chin Siong","born_year":null,"born_month":null,"born_day":null,"tag_list":"logo-design, web-design, print-design","alias_list":null,"created_at":"Sat Jan 14 16:35:57 UTC 2012","updated_at":"Fri Jan 20 19:26:03 UTC 2012","overview":"<p>Breaking the norms and conventionalities in design, Jasmine Hor Myn-Li understands the importance of defining her own work rather than let others define hers. Her ambition and determination to be the best have motivated her to mould Gizwiz Studio into what it is today – a winning online-based design firm in the field. As a result, she constantly pushes herself in her line of work by paving the way for a more fluid and progressive design aesthetic.</p>\n\n<p>Jasmine’s aspiration to change the way people perceive design derives from how the present environment dictates the way a design should look and as such, she desires to break that very perception. Her perseverance in delivering on her promise to offer quality design concepts is indicative of her perspective on how great works are accomplished; that is not by strength alone but by perseverance as well. </p>\n\n<p>Having graduated from De Montfort University with a Diploma in Art and Design on top of more than a decade of work experience in the design field, has shaped Jasmine into a dignified expert in creating exceptional logo and web design. She is very well-versed in the ever-evolving trends and styles present in the design world allowing her to understand what her clients from different parts of the world want in their designs as without doubt, Jasmine does not believe in following trends blindly but instead assimilating what works and what does not.</p>\n\n<p>A natural-born entrepreneur, Jasmine plans to further expand Gizwiz Studio’s market share in both developed and developing economies since having already established a global presence for the business. At the same time, she aims to continuously provide an avenue for customers to obtain no-frills, quality designs with effortless ease. She does not believe in sacrificing the quality of designs in the name of profit as her managerial skills prove. Unmistakably, her designs have since been featured in numerous renowned publications worldwide. Above all else, Jasmine adheres to the belief that the quality of a design can be seen as a never ending effort towards a change for the better. Who is to say that perfection is too far from reach?</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder | Creative Director","firm":{"name":"Jasmine Hor Myn-Li","permalink":"jasmine-hor-myn-li","type_of_entity":"company","image":null}},{"is_past":false,"title":"Co-Founder | Technical Director","firm":{"name":"Khaw Chin Siong","permalink":"khaw-chin-siong","type_of_entity":"company","image":null}},{"is_past":false,"title":"Project Manager","firm":{"name":"Joey Chiang","permalink":"joey-chiang","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://en.wikipedia.org/wiki/Logo_Design_Creation","title":"Wikipedia"},{"external_url":"http://www.wired.com/wired/archive/13.10/start.html?pg=13","title":"Wired Magazine Review"},{"external_url":"http://online.wsj.com/article/SB10001424052970203739404574290021152171950.html","title":"Wall Street Journal Review"},{"external_url":"http://www.logolounge.com","title":"LogoLounge"}],"web_presences":[{"external_url":"http://www.facebook.com/pages/Gizwiz-Studio/147378438637370pages/LogoDesignCreationcom/150421471662774","title":"Gizwiz Studio Facebook Page"},{"external_url":"http://www.facebook.com/pages/LogoDesignCreationcom/150421471662774","title":"LogoDesignCreation Facebook Page"}]}