{"first_name":"Jason","last_name":"Haislmaier","permalink":"jason-haislmaier","crunchbase_url":"http://www.crunchbase.com/person/jason-haislmaier","homepage_url":"http://www.hro.com","birthplace":"","twitter_username":"haislmaier","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"attorney, lawyer, technology, software, open-source, license, outsourcing, cloud-computing, internet, electronic-commerce","alias_list":null,"created_at":"Wed Mar 17 17:50:43 UTC 2010","updated_at":"Wed Mar 17 18:05:28 UTC 2010","overview":"<p>Jason is a partner with the law firm of Holme Roberts &amp; Owen LLP. He is also an adjunct professor at the University of Colorado School of Law. His practice involves working with both emerging and established companies in the area of technology and intellectual property transactions. Jason&#8217;s technical experience spans a range of industries and technologies, including software, hardware, data storage, networking, telecommunications, cable television, digital media, and semiconductors. He has been fortunate enough to develop a specialized area of expertise involving open source software licensing and compliance, and a large portion of my practice involves helping clients develop and implement strategies to deal with the legal, business and practical issues posed by the use and commercialization of open source software. He also lectures both in the US and abroad, on topics involving open source software and other areas of technology and intellectual property law.  </p>\n\n<ul>\n<li>Open source software licensing and compliance </li>\n<li>IP and technology-based mergers, acquisitions, financings, and joint ventures - IT, business process, and manufacturing outsourcings </li>\n<li>Licenses and technology transfers </li>\n<li>Cloud computing</li>\n<li>Reseller, OEM, and other distribution channel development relationships </li>\n<li>IP pooling agreements and dealings with industry standards bodies </li>\n<li>Internet and electronic commerce transactions</li>\n</ul>","image":{"available_sizes":[[[100,150],"assets/images/resized/0008/0716/80716v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0008/0716/80716v2-max-250x250.jpg"],[[172,258],"assets/images/resized/0008/0716/80716v2-max-450x450.jpg"]],"attribution":"<p>HRO</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}