{"first_name":"Jason","last_name":"Leeu","permalink":"jason-leeu","crunchbase_url":"http://www.crunchbase.com/person/jason-leeu","homepage_url":"http://www.estled.com","birthplace":"Shenzhen","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1983,"born_month":7,"born_day":29,"tag_list":"led-grow-light","alias_list":null,"created_at":"Wed Dec 14 06:21:17 UTC 2011","updated_at":"Mon Dec 19 21:26:33 UTC 2011","overview":"<p>EST LED Technology Co., Ltd. is a China based company formed by a group of passionate engineers. Since its establishment until this very day, our sole goal has been to make ever perfecting grow lights. Due to our deep commitment to this clear cut goal, today we firmly sit as one of the premier suppliers for LED grow lights.</p>\n\n<p>Throughout the past years of rapid growth, our business philosophy has been to excel as a total solutions partner for our customers. We offer world-class LED grow lights and have developed a deep expertise in custom-made grow lighting solutions. We know that our success is based upon your satisfaction and our entire management, engineering and manufacturing staff is ready to work hard to win your loyalty. In this spirit, we develop strategic teams with our customers, our employees, and our suppliers to achieve perfect quality, on-time delivery, and superior product value.</p>\n\n<p>Our facilities in Shenzhen include a modern factory powered by the most advanced equipments available in China. We continuously make significant technology investments, keep pace with industry standards and maintain the highest level of expertise to serve our customers.</p>\n\n<p>If you are looking for a solid LED grow lights supplier or just want to share your questions with us, contact us now. Our unparalleled services will make your experience with us as recommendable as the quality and price of our products.</p>","image":{"available_sizes":[[[100,70],"assets/images/resized/0016/6349/166349v2-max-150x150.jpg"],[[100,70],"assets/images/resized/0016/6349/166349v2-max-250x250.jpg"],[[100,70],"assets/images/resized/0016/6349/166349v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.estled.com","title":""}]}