{"first_name":"Jason","last_name":"Lieblich","permalink":"jason-lieblich","crunchbase_url":"http://www.crunchbase.com/person/jason-lieblich","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Exoprise","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jul 26 19:09:07 UTC 2010","updated_at":"Mon Jul 26 20:32:11 UTC 2010","overview":"<p>Jason Lieblich is President and CEO of Exoprise Systems Inc. The former Citrix Systems (NASDAQ:CTXS) executive brings an extensive track record of success with nearly 20 years of experience in distributed systems management, networking and security markets.</p>\n\n<p>At Citrix Systems, Lieblich served as Vice President and Chief Technology Officer in the Virtualization and Management Division where he helped design, develop, and deliver new management strategies and technologies for the XenApp (Presentation Server), XenServer, and XenDesktop product lines. Lieblich joined Citrix in May of 2006 through its acquisition of Reflectent Software, Inc, a privately held leader in end-user application performance-monitoring solutions. Jason was the Founder and CTO of Reflectent Software.</p>\n\n<p>Earlier in Jason’s career, he served in a variety of IT positions for financial service institutions including Vice President of Equity Financial Strategies at Credit Suisse (NASDAQ:CS) where he was responsible for trading systems and architectures. Jason holds two patents in the area of peer-to-peer distributed database technology and end-user risk management solutions. Lieblich received a B.Arch from Pratt Institute and sits on the board of IntervalZero, a privately held embedded systems company.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President, CEO & Founder","firm":{"name":"Exoprise","permalink":"exoprise","type_of_entity":"company","image":{"available_sizes":[[[150,35],"assets/images/resized/0009/5016/95016v2-max-150x150.png"],[[250,59],"assets/images/resized/0009/5016/95016v2-max-250x250.png"],[[342,82],"assets/images/resized/0009/5016/95016v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}