{"first_name":"Jason","last_name":"Akatiff","permalink":"jason-akatiff-2","crunchbase_url":"http://www.crunchbase.com/person/jason-akatiff-2","homepage_url":"http://www.crunchbase.com/people/jason_akatiff","birthplace":"USA","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1981,"born_month":2,"born_day":19,"tag_list":"","alias_list":null,"created_at":"Tue Jun 19 07:44:44 UTC 2012","updated_at":"Thu Jun 21 22:57:29 UTC 2012","overview":"<p>Jason Akatiff is the owner and operator of the affiliate marketing firm Adz4Dough. Seeing the success of the company, one might assume Jason was always in the affiliate marketing business. Surprisingly, this isn’t the case.</p>\n\n<p>Jason grew up near San Jose, CA, and lived there until he was 27. He then moved to the Sand Diego area. He has intimated that his location, near Silicon Valley, influenced his eventual decision to go into technological work. However, he’s said, he didn’t touch a computer for serious work for about ten years. </p>\n\n<p>His hesitation about college was bipartite. First, he wanted to know that whatever he studied, he would love it. Secondly, he wanted the skills he learned to bring him a nice income. He never quite found the college or the major he was seeking.</p>\n\n<p>Fortunately, during these years, Jason Akatiff worked. His jobs varied from waiting tables, to selling franchises, to working as a notary public loan signer. These jobs seems inapplicable to his current position. However, they taught him diligence and perseverance. </p>\n\n<p>It wasn’t until he began buying and selling real estate that his need for computer skills arose. He needed to build a website. As he had no formal training, he taught himself how to construct a website using software. This website, though no longer in use, served as Jason’s trial run for future endeavors. </p>\n\n<p>At this point, Jason began discovering online forums about search engine cloakers. And this is what led him to Blackhat SEO. Blackhat is a way to generate websites on a huge scale through computer automation. Through Blackhat, he met folks who suggested that he hire some freelancers to help in his Blackhat work.</p>\n\n<p>“As a single person, you can only do so much,” Jason has said. He had seen many of his friends try to accomplish work solo, with little results. And that’s why Jason decided to take on, what he calls, “project partners.” </p>\n\n<p>Jason prefers to work as a part of a team. It’s much more fun, he’s said. Isolation is brutal, especially when it comes to computer work. Jason Akatiff loves seeing people succeed. And because they succeed, he succeeds. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}