{"first_name":"Jason","last_name":"Caplain","permalink":"jason-caplain","crunchbase_url":"http://www.crunchbase.com/person/jason-caplain","homepage_url":"http://www.southcap.com","birthplace":"Fall River, MA","twitter_username":"jcaplain","blog_url":"http://www.southeastvc.com","blog_feed_url":"http://southeastvc.blogs.com/southeast_vc/index.rdf","affiliation_name":"Southern Capitol Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Dec 28 04:20:58 UTC 2008","updated_at":"Mon Nov 14 20:38:50 UTC 2011","overview":"<p>Jason is a general partner and co-founded Southern Capitol Ventures after spending two years at Red Hat (NYSE:RHT), the world&#8217;s premier open source and Linux provider. There, he directed the company&#8217;s global budgeting process, provided financial analysis for the successful IPO in August 1999 and performed due diligence on many of the company&#8217;s acquisitions. Prior to Red Hat, Jason was at Harrison Hurley and Company, an investment banking and business-consulting firm headquartered in Providence, RI.</p>\n\n<p>Jason currently serves on the boards of ReverbNation and Zift Solutions and is also a board observer for eTix, WeddingWire and DoublePositive Marketing Group. Previously, he was on the board of Synthematix (acquired by Symyx Technologies NASDAQ:SMMX) and a board observer for Batanga (merged with Planeta Networks.) He was also on the Executive Committee of the board of directors at CED which is the largest entrepreneurial support organization in the nation. While at Southern Capitol Ventures, he has had several interim roles with portfolio companies including CFO and Director of Business Development.</p>\n\n<p>Jason has received the Triangle Business Journal&#8217;s &#8220;40 under 40&#8221; leadership award and was named in 2009 by TechJournal South as one the Southeast&#8217;s Internet Mavens. He is a Guest Lecturer as part of the Engineering Entrepreneurs Program at NC State University. Jason received his BS in Finance from Bentley College. Jason&#8217;s blog is Southeast VC.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Southern Capitol Ventures","permalink":"southern-capitol-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,39],"assets/images/resized/0003/0447/30447v1-max-150x150.jpg"],[[250,65],"assets/images/resized/0003/0447/30447v1-max-250x250.jpg"],[[267,70],"assets/images/resized/0003/0447/30447v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}