{"first_name":"Jason","last_name":"Zdenek","permalink":"jason-zdenek","crunchbase_url":"http://www.crunchbase.com/person/jason-zdenek","homepage_url":"http://www.mobileillumination.com/","birthplace":"","twitter_username":"","blog_url":"http://blog.mobileillumination.com/","blog_feed_url":"http://blog.mobileillumination.com/feed/","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"christmas-lights-la, christmas-lights, outdoor-lighting, hang-christmas-lights, christmas-lights-installation, holiday-lighting-installation","alias_list":null,"created_at":"Mon Nov 26 06:10:25 UTC 2012","updated_at":"Wed Dec 05 07:35:01 UTC 2012","overview":"<p>Mobile Illumination provides complete outdoor holiday lighting services to both residential and commercial customers in the greater L.A. area. We are a full service lighting company, handling everything from lighting design and installation to servicing, removal, and storage; while our clients enjoy a completely hassle-free experience, allowing them to cherish the beautiful l spirit of the holidays.</p>\n\n<p>Mobile Illumination, Inc. has been designing and installing Christmas lighting for ten years. We have an impeccable record with the Better Business Bureau and we have never done business under any other name. We boast an excellent record of customer satisfaction with over 90% of our customers returning. Those that have not returned have moved or were travelling for the holiday season. Further, Mobile Illumination, Inc. is fully insured to provide our customers peace of mind that they are protected against any potential damage or liability.</p>\n\n<p>All installations are performed by dedicated Mobile Illumination, Inc. technicians under the supervision of a team chief, trained by highly experienced Mobile Illumination, Inc. engineers. All installations are carefully pre-planned by company engineers to ensure a smooth process with the end result being a beautiful display of which you will be proud. Our installers are experienced and are designated to crews in order to ensure that each and every crew has highly-experienced members. Additionally, all crew chiefs have multiple years of experience working for Mobile Illumination, Inc. and its stringent standards.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.mobileillumination.com/","title":"Mobileillumination"}]}