{"first_name":"Jason","last_name":"Merrick","permalink":"jason-merrick","crunchbase_url":"http://www.crunchbase.com/person/jason-merrick","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Symplified","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jan 05 22:45:07 UTC 2009","updated_at":"Tue Apr 28 15:30:37 UTC 2009","overview":"<p>Mr. Merrick brings more than 15 years of enterprise identity management and security experience to Symplified. He has played a pivotal role with several successful start-up security technology vendors including Securant Technologies (now RSA Security), Teros (now Citrix) and Air Tight Networks. Mr. Merrick is responsible for building and managing vendor partnerships for Symplified’s SinglePoint Network – the industry’s first open identity and security ecosystem that connects Software as a Service (SaaS) applications, cloud computing systems and enterprise networks.\nMr. Merrick joins Symplified from Air Tight Networks, a vendor of wireless vulnerability management solutions, where he was vice president of worldwide technical sales and managed strategic partner relationships with Extreme Networks, 3COM, Siemens and Trustwave. Previously he held senior technical services management positions at Teros, a vendor of web application firewalls acquired by Citrix. With identity management pioneer Securant Technologies, Mr. Merrick helped grow the start-ups’ customer base to more than 300 enterprises worldwide in less than 2 years until the company’s acquisition by RSA Security. Mr. Merrick holds a Bachelor of Arts degree in Accounting from the University of San Francisco.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP of Business Development","firm":{"name":"Symplified","permalink":"symplified","type_of_entity":"company","image":{"available_sizes":[[[150,31],"assets/images/resized/0003/3078/33078v2-max-150x150.png"],[[250,52],"assets/images/resized/0003/3078/33078v2-max-250x250.png"],[[258,54],"assets/images/resized/0003/3078/33078v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}