{"first_name":"Jason","last_name":"Whitmire","permalink":"jason-whitmire","crunchbase_url":"http://www.crunchbase.com/person/jason-whitmire","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Earlybird Venture Capital","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Feb 21 16:03:56 UTC 2011","updated_at":"Wed May 23 23:49:06 UTC 2012","overview":"<p>Jason Whitmire joined Earlybird Venture Capital as a General Partner in July 2010 where he focuses on Mobile Services, Cloud Computing and Digital Media. Jason has built and led two companies to global leadership. Until June 2010 he served as General Manager &amp; Vice President at Wind River Systems, where he founded and managed the company&#8217;s high growth mobile business (which according to the Wall Street Journal was the motivation behind Intel&#8217;s acquisition of Wind River for $884 million in July 2009). Since the acquisition Jason has also advised Intel on its mobile software strategy.</p>\n\n<p>Previously Jason was shareholder and Managing Director of open source real-time Linux provider FSMLabs Inc. and played a key role in its acquisition by Wind River in 2007. At FSMLabs Jason ran the company&#8217;s global business, growing it to serve over 50 Fortune 500 companies. Prior to that Mr. Whitmire co-founded the software business at Infineon Technologies, where he led the global licensing business for Infineon&#8217;s wireless software subsidiary, Comneon GmbH. During his four years at Infineon Jason helped build Comneon into a one of the fastest growing mobile device software companies in history (100 million devices shipped).</p>\n\n<p>Earlier, Jason served in a variety of director level and management roles including Director of Product Management at Group 3G UMTS (Telefonica / Sonera MVNO) and Head of European Business Development at a subsidiary within the Telecom Italia / SEAT group. Before that, Jason served in the US government as a Technology Advisor to the US Department of State under the Clinton Administration. In 1994 and 1995 he received the Department&#8217;s exceptional performance awards for work recognized by then-US Vice President Al Gore. </p>\n\n<p>Mr. Whitmire is a prominent industry speaker and evangelist on Next Generation Wireless Devices and Networks, Cloud Computing, the Mobile Internet and Web 2.0 segments. He has an MBA and Master and Bachelor degrees.</p>","image":{"available_sizes":[[[149,150],"assets/images/resized/0019/0817/190817v2-max-150x150.jpg"],[[249,250],"assets/images/resized/0019/0817/190817v2-max-250x250.jpg"],[[449,450],"assets/images/resized/0019/0817/190817v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Earlybird Venture Capital","permalink":"earlybird-venture-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,15],"assets/images/resized/0003/1016/31016v7-max-150x150.jpg"],[[250,25],"assets/images/resized/0003/1016/31016v7-max-250x250.jpg"],[[280,28],"assets/images/resized/0003/1016/31016v7-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Member, Traxpay Supervisory Board","firm":{"name":"Traxpay","permalink":"traxpay","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0019/7472/197472v9-max-150x150.jpg"],[[250,57],"assets/images/resized/0019/7472/197472v9-max-250x250.jpg"],[[450,104],"assets/images/resized/0019/7472/197472v9-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}