{"first_name":"Jason","last_name":"Heider","permalink":"jason-heider","crunchbase_url":"http://www.crunchbase.com/person/jason-heider","homepage_url":"","birthplace":"Tampa, Fl","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1975,"born_month":10,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Aug 19 19:33:55 UTC 2011","updated_at":"Fri Aug 26 21:12:00 UTC 2011","overview":"<p>Jason is a financial, operational and strategic advisor to MythofMe, an early stage consumer internet start up.  He&#8217;s worn many hats including: creating financial models (budgets, forecasting, share allocation cap tables, financial structuring models) and fundraising presentations, provided strategic positioning &amp; industry insights, competitive intelligence, and advertising solutions as well as operational metrics and dashboards.  In the process he has worked with Phil Morle, former CTO of Kazaa and at the request of Marco Menato, Founder of  MythofMe.</p>\n\n<p>Jason also leads a team in PwC&#8217;s Research &amp; Analytics group that focuses on creating financial, operational, strategic and competitive insights. This encompasses industry and individual company-focused analysis, financial and strategic benchmarking, sales &amp; marketing targeting as well as M&amp;A-related insights. These engagements yield written reports, presentations and workshops. Audiences for this work includes our clients&#8217; C-suites, as well as internal firm leadership for business development purposes. While he leads a team that focuses on healthcare and has spoken at industry events, his interests and knowledge extend well out side the industry.</p>\n\n<p>Jason began his career in the Virginia, doing company analysis and financial research for Wachovia Securities. He is a CFA charterholder, holds a Masters in Finance from London Business School and did his undergraduate studies in Biology at Furman University.</p>","image":{"available_sizes":[[[150,125],"assets/images/resized/0015/0239/150239v2-max-150x150.jpg"],[[250,209],"assets/images/resized/0015/0239/150239v2-max-250x250.jpg"],[[450,376],"assets/images/resized/0015/0239/150239v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Masters in Finance","subject":"Finance & Entrepreneurship","institution":"London Business School","graduated_year":2006,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}