{"first_name":"Jay","last_name":"Leupp","permalink":"jay-leupp","crunchbase_url":"http://www.crunchbase.com/person/jay-leupp","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Jul 01 23:17:39 UTC 2012","updated_at":"Mon Jul 02 16:16:05 UTC 2012","overview":"<p>Mr. Jay Paul Leupp, CPA serves as a Portfolio Manager/Analyst at Lazard Asset Management LLC. Mr. Leupp is the Founder and serves as the Chief Executive Officer, President, Managing Principal and Portfolio Manager at Trust for Professional Managers - Grubb &amp; Ellis Aga Realty Income Fund, Trust for Professional Managers - Grubb&amp;Ellis AGA International Realty Fund and Trust for Professional Managers - Grubb&amp;Ellis AGA U.S. Realty Fund. He is the Founder and serves as the Chief Executive Officer, President and Senior Portfolio Manager of Grubb &amp; Ellis AGA U.S. Realty Income Fund. He served as an Executive Vice President at Grubb &amp; Ellis Company. He served as an Analyst of Friend &amp; Company, Research Division. He was also the Founder and served as the Chief Executive Officer, President and Senior Portfolio Manager at Grubb &amp; Ellis Alesco Global Advisors, LLC. He founded Alesco in 2005 served as its Chief Executive Officer and President. He served as a Managing Director of U.S. REIT Research at RBC Capital Markets, LLC, Research Division from 2002 to 2006, where he oversaw a five-person equity research team. Mr. Leupp served as Managing Director of Real Estate Equity Research at Robertson Stephens, Inc., Research Division from 1994 to 2002. He served as a Vice President at The Staubach Company, Inc. from 1991 to 1994 and a Development Manager at Trammell Crow Residential from 1989 to 1991. Mr. Leupp has extensive real estate and capital markets experience. He also serves as the Chairman of Regents at Santa Clara University, a Policy Board Member for the Fisher Center for Real Estate at the University of California Berkeley, and a Board Member of Chaminade College Prepatory. Mr. Leupp has been a Director of the United American Bank since July 2007. Mr. Leupp was named “REIT Stock picker of the Year“ in the March 2007 issue of Real Estate Portfolio Magazine, and took the first place in the National Association of Real Estate Investment Trusts&#8217; 2006 annual REIT stock picking contest. He is a Certified Public Accountant. Mr. Leupp received an M.B.A. from Harvard Business School and a B.S. degree in accounting from Santa Clara University.</p>","image":null,"degrees":[],"relationships":[],"investments":[{"funding_round":{"round_code":"angel","source_url":"","source_description":"","raised_amount":null,"raised_currency_code":"USD","funded_year":2012,"funded_month":1,"funded_day":1,"company":{"name":"Daric","permalink":"daric","image":{"available_sizes":[[[138,150],"assets/images/resized/0019/8201/198201v2-max-150x150.jpg"],[[231,250],"assets/images/resized/0019/8201/198201v2-max-250x250.jpg"],[[360,389],"assets/images/resized/0019/8201/198201v2-max-450x450.jpg"]],"attribution":null}}}}],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}