{"first_name":"Jay","last_name":"Rasulo","permalink":"jay-rasulo","crunchbase_url":"http://www.crunchbase.com/person/jay-rasulo","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 21 02:33:58 UTC 2008","updated_at":"Wed May 21 03:02:42 UTC 2008","overview":"<p>Jay Rasulo has the Happiest Job on Earth. As chairman of Walt Disney Parks and Resorts, he presides over a family vacation business that spans three continents and includes five world-class vacation destinations, a top rated cruise line and the most popular resort locations in North America, Europe and Asia. During the past 50 years, more than 2 billion guests have passed through the gates of Disney theme parks around the world.</p>\n\n<p>Jay is the architect of the long-term global growth strategy for Disney Parks and Resorts&#8217; business, including Hong Kong Disneyland, which opened on September 12, 2005 – bringing the enchantment of a Disney theme park to a whole new region of the world.</p>\n\n<p>Jay oversees a broad range of businesses that help make Disney the leader in the vacation destination industry. The theme parks and resorts include the Disneyland Resort in California, Walt Disney World Resort in Florida, Tokyo Disney Resort, Disneyland Resort Paris and Hong Kong Disneyland. In addition, Jay is responsible for the Disney Cruise Line; Walt Disney Imagineering &#8211; the designers and builders of theme parks, attractions and other facilities and Disney Regional Entertainment, comprising the ESPN Zone sports-themed restaurants.</p>\n\n<p>Jay, who has been with The Walt Disney Company for 20 years, was appointed president of Walt Disney Parks and Resorts in 2002. In the fall of 2005, he became chairman of the segment. He spent two of the five years with the company in France as chairman and CEO of Euro Disney, S.C.A. where he was instrumental in turning Disneyland Resort Paris into Europe&#8217;s top tourist destination. Cementing his reputation as a dedicated business leader and strategist, the Los Angeles Times in 2002 called Jay &#8220;… a provocative and passionate leader who understands the cultural nuances of foreign markets.&#8221; The article went on to credit Jay for &#8220;…helping to transform Disneyland Paris.</p>\n\n<p>In addition to his duties at Disney, Jay has emerged as a recognized leader within the travel and tourism industry, working to broaden awareness of the industry&#8217;s role in creating jobs, economic growth, and cultural exchange. In 2006, Jay serves as Chairman of the Travel Industry Association of America, the industry&#8217;s preeminent trade association in the United States. Additionally, Jay serves as Chairman of the United States Travel and Tourism Advisory Board, which is charged with advising the U.S. Department of Commerce on the creation of a national tourism strategy. He also serves on the board of directors for the French American Chamber of Commerce and Euro Disney S.C.A.</p>\n\n<p>Jay first joined The Walt Disney Company in 1986 as director and later rose to senior vice president of Corporate Strategic Planning. In this role, he led strategic development for all real estate-based businesses in The Walt Disney Company portfolio.</p>\n\n<p>After two years as a senior vice president of Corporate Alliances and three years with Disney Regional Entertainment, Jay moved to Paris as executive vice president, Euro Disney, S.C.A. He served as president and C.O.O. before taking over as chairman and CEO in 2000.</p>\n\n<p>A native New Yorker, Jay has a degree in economics from Columbia, and both an MA in economics and an MBA from the University of Chicago. Before joining Disney, he held positions with Chase Manhattan Bank and the Marriott Corporation.</p>\n\n<p>Jay and his family reside in Los Angeles, California.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/8997/18997v1-max-150x150.jpg"],[[200,200],"assets/images/resized/0001/8997/18997v1-max-250x250.jpg"],[[200,200],"assets/images/resized/0001/8997/18997v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://corporate.disney.go.com/corporate/management_team.html\" title=\"Disney\" rel=\"nofollow\">Disney</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Chairman, Walt Disney Parks and Resorts","firm":{"name":"The Walt Disney Company","permalink":"the-walt-disney-company","type_of_entity":"company","image":{"available_sizes":[[[150,73],"assets/images/resized/0001/0929/10929v1-max-150x150.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-250x250.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}