{"first_name":"Jay","last_name":"Fluegel","permalink":"jay-fluegel","crunchbase_url":"http://www.crunchbase.com/person/jay-fluegel","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jul 29 17:53:25 UTC 2008","updated_at":"Tue Jul 29 17:56:57 UTC 2008","overview":"<p>As Vice President of Product Management at <a href=\"http://www.crunchbase.com/company/event-innovation\" title=\"Event Innovation\">Event Innovation</a>, Jay shepherds the product roadmap and leads the development team. His responsibilities include crafting detailed product requirements, managing a team of over 50 developers, and defining the architectural direction of the company&#8217;s platform and products. In addition, he develops and optimizes the company&#8217;s software development methodologies.</p>\n\n<p>Jay Fluegel is a well-respected strategic technologist with expertise in building mega-scale Internet services and applications. Prior to Event Innovation, Jay spent ten years at Microsoft in strategic planning, product development and management roles for some of the largest online services on the planet. He played a primary role in architecting and launching &#8220;Windows Live&#8221;, combining the best of MSN web and Windows PC experiences into a single offering. As an international suite of services, Windows Live caters to over 430 million users with 33 languages in over 50 countries including Windows Live Hotmail, Messenger, Spaces and Events. Jay led strategic partnerships enabling Ebay, ESPN, Citibank, Match.com and several others to achieve their primary goals and business objectives.</p>\n\n<p>His passion lies in developing highly scalable technologies and innovative user experiences that connect people in unique ways. He began his career as Director of Business Operations at Jump Networks which developed the Web&#8217;s first free, completely-connected calendar, email and address book service, and was later acquired by Microsoft to bring that technology to Hotmail.</p>\n\n<p>Originally from New York, Jay obtained a Bachelor of Science degree in Applied Economics and Management from Cornell University and a MBA in Technology Management from The University of Washington. At Cornell, Jay was very active in the Cornell Entrepreneur Organization and continues to be involved with the Cornell Entrepreneur Network.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"VP Product Management","firm":{"name":"Event Innovation","permalink":"event-innovation","type_of_entity":"company","image":{"available_sizes":[[[115,48],"assets/images/resized/0002/2892/22892v1-max-150x150.png"],[[115,48],"assets/images/resized/0002/2892/22892v1-max-250x250.png"],[[115,48],"assets/images/resized/0002/2892/22892v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}