{"first_name":"Jay","last_name":"McBain","permalink":"jay-mcbain-2","crunchbase_url":"http://www.crunchbase.com/person/jay-mcbain-2","homepage_url":"http://about.me/jmcbain","birthplace":"Edmonton","twitter_username":"jmcbain","blog_url":"http://jaymcbain.blogspot.com","blog_feed_url":"http://jaymcbain.blogspot.com/feeds/posts/default","affiliation_name":"Unaffiliated","born_year":1972,"born_month":6,"born_day":24,"tag_list":"it-industry, social-network, channeleyes","alias_list":null,"created_at":"Tue May 22 13:48:40 UTC 2012","updated_at":"Thu May 24 14:06:13 UTC 2012","overview":"<p>Jay McBain is an accomplished speaker, author and innovator in the IT industry. Named to the Top 40 Under Forty list by the Business Review, Top 25 Newsmaker by CDN Magazine, Top 100 Most Respected Thought Leader by Vertical Systems Reseller Magazine, member of Global Power 150 by SMB Magazine, as well as Top 250 Global Managed Services Executives by MSPmentor. He is often sought out for keynotes, industry guidance, as well as business development opportunities. </p>\n\n<p>Jay currently serves as Co-Chair of the CompTIA Vendor Advisory Council and Vice Chair of MSP Partners Community. He is also a board member of the Channel Vanguard Council, Ziff Davis Leadership Council, CRN Channel Intelligence Council and STEP - Sustainable Technology Environments Program with InfoComm. </p>\n\n<p>Jay has spent his 18 year career in various Executive sales, marketing and strategy roles within IBM, Lenovo and Autotask. He is currently the co-founder of a new software company called ChannelEyes. It is the first free and secure social network for Suppliers and their Channel Partners to use every day. </p>\n\n<p>As a futurist, and long standing member of the World Future Society, Jay is an expert in Pervasive Computing which is the study of future computing models and the resulting impact on society, as well as Managed Services, Healthcare IT, Voice over IP and Cloud Computing. </p>\n\n<p>An avid blogger, community and social media expert, Jay has developed an innovative “dandelion marketing” approach engaging in a wide range of communities across dozens of channels around the world. </p>\n\n<p>Jay has lived in Calgary, Winnipeg, Toronto, Raleigh, and now in Albany, New York. He actively gives back to the community and has been on the board of the United Way, Models for Charity and Junior Achievement.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0019/1019/191019v2-max-150x150.jpg"],[[178,250],"assets/images/resized/0019/1019/191019v2-max-250x250.jpg"],[[321,450],"assets/images/resized/0019/1019/191019v2-max-450x450.jpg"]],"attribution":"<p>Jay McBain</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/jaymcbain","title":"Linkedin"},{"external_url":"http://www.twitter.com/jmcbain","title":"Twitter"},{"external_url":"http://www.facebook.com/jaymcbain","title":"Facebook"}]}