{"first_name":"Jay","last_name":"EngelHeart","permalink":"jay-engelheart","crunchbase_url":"http://www.crunchbase.com/person/jay-engelheart","homepage_url":"","birthplace":"Florida","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1980,"born_month":2,"born_day":4,"tag_list":"","alias_list":null,"created_at":"Wed Aug 08 09:59:37 UTC 2012","updated_at":"Sat Aug 11 08:33:15 UTC 2012","overview":"<p>JayEngelHeart2\nJayengelheart2 is an enthusiastic blogger with a great number of websites. He hosts blogs with several topics, but each has a global relevance. He merges his focal understanding of the internet and passion for global affairs on his sites. The goal is to make available a number of websites with reports on current events to people everywhere. Jay and his professional success have made this possible.\nEvery day at work he has the opportunity to use his skills. Jayengelheart2 works as an online navigator and search engine optimizer. Since search engines only operate on technical algorithms, they don’t work perfectly. Search engine optimization combines algorithms with human search trends. In this way, Jay helps various webmasters and businesses make the most of their websites. \nHe ensures that companies have the best possible web content. This allows people to read easier, and even get to the websites in the first place. Jayengelheart2 has an important job because he makes sure that online content is readable by people and computers. This allows for the information to come to you in the best way possible. His position requires him to find what companies are doing wrong, and make them do it right.\nJay has passions outside the realm of the internet. He is an avid motorcyclist with years of experience. He enjoys riding on long, historic roads, as well as racing tracks. He has ridden some of the most historic roads in the country, like Route 66. At the track, he works hard to continually beat personal and track records. But the real enjoyment does come from long and uninterrupted rides.\nMost cross-country motorcyclists enjoy the historic roads, but not Jayengelheart2. He lives to find new and exciting roads, sometimes lost and forgotten ones. There is a whole universe of roads he would like to seek out. When he finds them, he doesn’t care where they lead. The prospect is a consolation that always goes unheralded. </p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/5005/205005v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/5005/205005v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/5005/205005v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}