{"first_name":"Jay","last_name":"Deady","permalink":"jay-deady","crunchbase_url":"http://www.crunchbase.com/person/jay-deady","homepage_url":"http://www.awarepoint.com","birthplace":"","twitter_username":"","blog_url":"http://www.awarepointblog.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 23 18:59:25 UTC 2011","updated_at":"Sun Nov 27 16:30:07 UTC 2011","overview":"<p>An experienced global executive leader with high personal commitment and ethics, Jay has demonstrated ability in delivering significant value to organizations. Jay Deady serves as president and chief executive officer of Awarepoint. In this role, Jay will drive the strategic vision for Awarepoint and manage all company operations focusing on new market development, revenue growth, profitability, and ensuring the long term success of our hospital clients. He has an outstanding record of building high performance teams and a strong focus on both internal and external client satisfaction.</p>\n\n<p>Jay’s career has been in healthcare information technology for 21 years, including significant experience as a public corporate officer. He was most recently the executive vice president of client solutions for Eclipsys where he drove the corporate global go-to-market and solution delivery strategies, and successfully positioned the company for its merger with Allscripts. Prior to Eclipsys, he was senior vice president and general manager of revenue cycle at McKesson Provider Technologies. He also held general manager and vice president positions with Cerner Corporation and ADAC Healthcare earlier in his career. Jay received his Bachelor of Arts degree in political science with emphasis in economics from Tufts University in Massachusetts.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President & CEO","firm":{"name":"Awarepoint","permalink":"awarepoint","type_of_entity":"company","image":{"available_sizes":[[[150,38],"assets/images/resized/0009/4399/94399v2-max-150x150.jpg"],[[250,63],"assets/images/resized/0009/4399/94399v2-max-250x250.jpg"],[[327,83],"assets/images/resized/0009/4399/94399v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}