{"first_name":"Jay","last_name":"Manickam","permalink":"jay-manickam","crunchbase_url":"http://www.crunchbase.com/person/jay-manickam","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"uShip","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Apr 25 12:49:33 UTC 2010","updated_at":"Wed Jun 23 05:41:24 UTC 2010","overview":"<p>In Jay&#8217;s role leading the Strategy team he is responsible for the functions of Finance, Analytics, and Marketplace Research. The Finance function consists of accounting, treasury, and financial modeling and analysis. The Analytics function is involved in pre and post launch product testing and reporting, clickstream analytics, pricing, and segmentation. The Research function is engaged in data mining, surveying, statistical analysis, and algorithmic marketplace efficiency initiatives. Jay is also responsible for the internal operations of uShip, including the CTS (Community, Trust, and Safety) team which provides customer support, as well as Legal and Human Resources. He attended the McCombs School of Business at the University of Texas, where he met uShip co-founders Mickey Millsap and Matt Chasen while obtaining his MBA. Before co-founding uShip, Jay worked as a consultant in various roles for Andersen, Deloitte &amp; Touche and Intel. Previously, Jay earned a B.A. in Philosophy and Chemistry and a Masters in Accounting from the University of North Carolina at Chapel Hill.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder, VP Strategy & Operations","firm":{"name":"uShip","permalink":"uship","type_of_entity":"company","image":{"available_sizes":[[[120,75],"assets/images/resized/0000/2035/2035v1-max-150x150.png"],[[120,75],"assets/images/resized/0000/2035/2035v1-max-250x250.png"],[[120,75],"assets/images/resized/0000/2035/2035v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}