{"first_name":"Jay","last_name":"O'Connor","permalink":"jay-o-connor","crunchbase_url":"http://www.crunchbase.com/person/jay-o-connor","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Netsuite","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jul 24 12:22:29 UTC 2007","updated_at":"Mon Jun 02 20:20:14 UTC 2008","overview":"<p>In his role as Senior Vice President of Worldwide Marketing at NetSuite, Mr. O&#8217;Connor oversees all aspects of NetSuite&#8217;s marketing activities, including demand generation, marketing programs, and brand strategy.</p>\n\n<p>Mr. O&#8217;Connor came to NetSuite with extensive experience in marketing software, services and on-demand solutions to small and mid-sized businesses, including over six years at Intuit where he managed the QuickBooks business. Most recently, Mr. O&#8217;Connor was Vice President of Marketing and Product Management at CaseCentral, which he helped become one of the largest and fastest growing on-demand software companies in the US. Prior to CaseCentral, Mr. O&#8217;Connor was Vice President of Marketing at Inzap, a Web-based provider of credit services for banks and their small business customers. Before Inzap, he served as Vice President of Marketing at PlanetRx, a pioneer in online pharmacies.</p>\n\n<p>Previous to PlanetRx, O&#8217;Connor held a number of senior positions at Intuit. As Group Product Manager of QuickBooks, he led the marketing and product management team that acquired the first one million QuickBooks customers and grew market share from zero to more than 70% in the small business accounting category. In addition, he served as Director of Corporate Strategy and as Director of the Quicken.com business.</p>\n\n<p>Mr. O&#8217;Connor received his MBA from Harvard Business School and his B.A. from Stanford University.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}