{"first_name":"Jay","last_name":"Lichter","permalink":"jay-lichter","crunchbase_url":"http://www.crunchbase.com/person/jay-lichter","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jul 22 18:16:37 UTC 2008","updated_at":"Tue Jul 22 18:19:24 UTC 2008","overview":"<p>Jay B. Lichter, Ph.D. was previously a Venture Partner at Avalon and most recently led Avalon&#8217;s investments in InCode Biopharmaceutics, Inc., an auto-immune disease company, and Akesis Pharmaceuticals, a developer of patent protected diabetes drugs, where he currently serves as President and CEO. Dr. Lichter is an experienced biotechnology and pharmaceutical business executive with over 20 years of experience in management, scientific research and business development. Dr. Lichter has been either directly responsible for or participated in licensing or M&amp;A deals valued in excess of $1 billion.</p>\n\n<p>Dr. Lichter was the first employee and co-founder of Sequana Therapeutics, an Avalon V portfolio company. Dr. Lichter served various roles within the company including managing the genetics department (with over 40 scientists), working in business development and initiating the pharmacogenetics business unit. Dr. Lichter led the negotiations or participated in the development and management of collaborations with Glaxo (diabetes), Boehringer Mannheim (osteoporosis), Boehringer Ingleheim (asthma) and Parke-Davis (central nervous system).</p>\n\n<p>In 2000, Dr. Lichter co-founded and was CEO of Xenopharm, a drug safety company. Dr. Lichter drove the development of the company and its ultimate acquisition by Deltagen. In 2004, Dr. Lichter co-founded Sytera, Inc., an Avalon VI and Avalon VII portfolio company. As Sytera&#8217;s Vice President of Operations and Business Development, Dr. Lichter had various roles in the company and was the inventor on key enabling intellectual property (&#8220;IP&#8221;) that led to the company&#8217;s acquisition by Sirion Therapeutics, Inc. in July 2006.</p>\n\n<p>Throughout his career, Dr. Lichter has applied his exceptional combination of business acumen and deep technical knowledge to creating commercially successful biotech collaborations and identifying the commercial potential of scientific discoveries at their earliest stages. He was Executive Vice President of Business Development at Sequenom (Nasdaq: SQNM), where he negotiated strategic transactions with Bristol-Myers Squibb and Proctor &amp; Gamble, and served as the in-licensing manager for genomics and discovery central nervous system (&#8220;CNS&#8221;) research at Pfizer. While at Pfizer, Dr. Lichter led the company&#8217;s investments in Incyte and Celera, both involved in studying innovative links between genetics and disease. Dr. Lichter participated in seven other Pfizer-biotech collaborations and completed over 50 university licensing deals. Dr. Lichter also served as Vice President of Pharmacogenetics at Genset SA, where he was responsible for managing Genset&#8217;s collaboration with Abbott Labs and developing collaborations with Pharmacia and Upjohn.</p>\n\n<p>Upon completion of his Ph.D. in 1990, Dr. Lichter held a postdoctoral position in Human Genetics at Yale University, where he received broad training in the areas of classical human genetics, clinical genetics and bioinformatics. During his two-year tenure at Yale, Dr. Lichter specifically focused on cancer genetics and the genetics of neuropsychiatric diseases and authored over 20 scientific papers. Dr. Lichter held a second postdoctoral position at the DuPont Merck Pharmaceutical Company, where he focused on pharmacogenetics and identified genetic mutations in an important dopamine receptor involved in drug response and disease progression for schizophrenia. Dr. Lichter received his B.S. and Ph.D. from the University of Illinois.</p>","image":{"available_sizes":[[[109,150],"assets/images/resized/0002/2507/22507v1-max-150x150.jpg"],[[182,250],"assets/images/resized/0002/2507/22507v1-max-250x250.jpg"],[[193,264],"assets/images/resized/0002/2507/22507v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.avalonvi.com/team_jlichter.html\" title=\"Avalon\" rel=\"nofollow\">Avalon</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Member","firm":{"name":"Avalon Ventures","permalink":"avalon-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,38],"assets/images/resized/0002/2500/22500v1-max-150x150.png"],[[250,64],"assets/images/resized/0002/2500/22500v1-max-250x250.png"],[[280,72],"assets/images/resized/0002/2500/22500v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}