{"first_name":"Jayant","last_name":"Sharma","permalink":"jayont-r-sharma","crunchbase_url":"http://www.crunchbase.com/person/jayont-r-sharma","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Milestone Interactive","born_year":null,"born_month":null,"born_day":null,"tag_list":"video-games, milestone-interactive, game4u, consoles, india, mumbai","alias_list":null,"created_at":"Mon Jun 27 10:32:47 UTC 2011","updated_at":"Mon Dec 12 21:09:49 UTC 2011","overview":"<p>Jayont R. Sharma is the founder and promoter of Milestone Interactive Group. As a leader in console and PC games software and hardware distribution, Milestone has been in the industry for over a decade. Jayont has been at the forefront in introducing and promoting prominent international publishers in India. Since the inception of Milestone Interactive Private Limited in 1997, he has been dedicated in steering the company to its current position as a market leader in console and PC games.</p>\n\n<p>Today, Milestone represents leading global publishers such as Sony Computer Entertainment, Electronic Arts, Capcom, NovaLogic, Teckmo Koei and Namco Bandai. Milestone provides distribution, logistics, marketing, public relations and trade relations solutions to its partners.</p>\n\n<p>Jayont has also been one of the first to launch a specialty game retail brand in India – Game4u. The brand has introduced some of the most popular international practices in India such as midnight game launches, the sale of pre-owned games and pre-orders for new releases. With an online presence via www.game4u.com and an emphasis on an engaging in- store consumer experience through interactive kiosks, Game4u aims to be the premier specialty game retail brand in India and has plans to cover the top 20 Indian cities through 50+ stores over the coming three years.</p>\n\n<p>Jayont is an alumnus of the prestigious Mayo College, Ajmer. In a career span of 28 years, he has acquired varied experience in FMCG, consumer electronics, music and computer entertainment in India and overseas. He spent the initial 14 years of his career in various executive positions including Branch Manager, Regional Channel Manager, and General Manager: Operations and CEO in companies such as HMV, Sonodyne, Modi Olivetti, Melcom Technologies, Nigeria and Head Multimedia, respectively. The past 14 years as an entrepreneur have given him a deeper exposure to the entertainment, information technology and retail industry.</p>","image":{"available_sizes":[[[141,150],"assets/images/resized/0014/1383/141383v2-max-150x150.jpg"],[[150,159],"assets/images/resized/0014/1383/141383v2-max-250x250.jpg"],[[150,159],"assets/images/resized/0014/1383/141383v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chairman and CEO","firm":{"name":"Milestone Interactive","permalink":"milestone-interactive","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0014/1372/141372v2-max-150x150.jpg"],[[250,83],"assets/images/resized/0014/1372/141372v2-max-250x250.jpg"],[[450,150],"assets/images/resized/0014/1372/141372v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}