{"first_name":"JB","last_name":"Perrette","permalink":"jb-perrette","crunchbase_url":"http://www.crunchbase.com/person/jb-perrette","homepage_url":"http://www.discoverycommunications.com","birthplace":"","twitter_username":"","blog_url":"http://blog.discoverycommunications.com","blog_feed_url":"","affiliation_name":"Discovery Communications","born_year":null,"born_month":null,"born_day":null,"tag_list":"jb-perrette, discovery-communications, digital-media, nbcuniversal, media, television, online-video, mobile","alias_list":null,"created_at":"Wed Aug 01 19:55:09 UTC 2012","updated_at":"Sat Aug 04 14:18:37 UTC 2012","overview":"<p>Named Chief Digital Officer at Discovery Communications in October 2011, JB Perrette oversees a combined team of more than 300 employees, leads the company&#8217;s digital strategy, including Discovery&#8217;s U.S. websites, Interactive Technology, Digital Operations and Programming group and digital distribution efforts. He is also responsible for Discovery’s Information Technology services division, Discovery Commerce, including Licensing and Home Entertainment, as well as Footage and Music Services.</p>\n\n<p>Prior to joining Discovery, Perrette spent 11 years with NBCUniversal, most recently serving as President, Digital and Affiliate Distribution and Content Distribution Strategy, leading  North American distribution of television and film content across digital platforms. He coordinated NBCU’s overall content distribution strategy, and was responsible for NBC’s broadcast network distribution. He also helped launch new digital channels Sleuth, Chiller and Universal HD and played a leadership role in developing the industry-leading digital venture, Hulu. Perrette’s previous roles at NBC Universal included President of Affiliate Distribution, SVP of New Media Distribution; CFO of NBC Universal Cable; and VP of NBC Business Development. Before joining NBC in 2000, Perrette worked for GE Capital, and at CS First Boston in London and Tokyo.</p>\n\n<p>Perrette’s industry and civic commitments have included board positions with A&amp;E Television Networks, Hulu, the Peacock Equity Fund and Citizen Schools New York, a non-profit devoted to expanding the learning day for middle school students in low-income communities.</p>\n\n<p>Perrette received his BA from Hamilton College and currently resides in New York City with his wife, Amy and their son.</p>","image":{"available_sizes":[[[121,150],"assets/images/resized/0020/3959/203959v2-max-150x150.jpg"],[[202,250],"assets/images/resized/0020/3959/203959v2-max-250x250.jpg"],[[364,450],"assets/images/resized/0020/3959/203959v2-max-450x450.jpg"]],"attribution":"<p>Discovery Communications</p>"},"degrees":[{"degree_type":"B.A.","subject":"Public Policy","institution":"Hamilton College","graduated_year":1993,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chief Digital Officer","firm":{"name":"Discovery Communications","permalink":"discovery-communications","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}