{"first_name":"JC","last_name":"Ramos","permalink":"jc-ramos","crunchbase_url":"http://www.crunchbase.com/person/jc-ramos","homepage_url":"http://www.josecarlosramos.com","birthplace":"Alicante (Spain)","twitter_username":"josecarlosramos","blog_url":"http://www.josecarlosramos.com/blog","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1970,"born_month":11,"born_day":22,"tag_list":"innovation, jc-ramos, knowledge-management","alias_list":null,"created_at":"Mon Jan 10 10:49:30 UTC 2011","updated_at":"Thu Jan 20 02:21:18 UTC 2011","overview":"<p>Inspirator, facilitator and support for senior management\nResearcher and creator</p>\n\n<p>Education:\nPhD in Business Management\nMasters Engineer in Telecommunications\nExecutive MBA\nKnowledge Associates accredited practitioner </p>\n\n<p>Experience:\nEntrepreneur and advisor. He is also Director Partner at Avanzalis Management, a firm of which he is founder. He combines his professinoal activity with others as Fellow Professor at the University of Barcelona and Collaborator at ESADE Business School.\nAt Avanzalis he also works as senior consultant, leading organizational development initiatives providing strategic support to senior management of organizations.\nHis areas of specialization include Strategic Knowledge Management and Innovation.\nHe has led several initiatives for large organizations in Spain and worldwide. Some references are: UN IFAD, Grupo Siro, Ercros, Caja Sabadell, Grupo Godo, ACE Group, Pharmaceutical Federation, Group Geci, Dalphi.</p>\n\n<p>Forums and international associations:\nActive member of The New Club of Paris (NCP) www.the-new-club-of-paris.org\nLeads the Barcelona cell of the Iberoamerican Community for Knowledge Systems (CISC) www.iberoamericana.org\nHe is member of the Knowledge Management Committee of the Spanish Association of Managers (AED) www.aed96.es\nPromotes business activities in the Official College of Telecommunications Engineers of Catalonia (COETC)</p>\n\n<p>Teaching and Lecturing:\nHe collaborates in several forums and congresses. He gives conferences and conducts sessions in institutions such as University of Barcelona, Spanish Association of Managers, Business School Estema, Postgraduate Training Center of UPV, Adeit UV University BDigital Congress and Ford among others.</p>\n\n<p>Other activities:\nHe has enjoyed several residences in the United States as a member of IBM Management Council. He has worked in some think tanks, contributing to the achievement of several books on communities of practice, knowledge management among others.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0011/6655/116655v2-max-150x150.jpg"],[[179,250],"assets/images/resized/0011/6655/116655v2-max-250x250.jpg"],[[322,450],"assets/images/resized/0011/6655/116655v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://es.linkedin.com/in/josecarlosramos","title":"LinkedIn"},{"external_url":"http://www.josecarlosramos.com","title":"web site"},{"external_url":"http://www.avanzalis.com","title":"Avanzalis site"}]}