{"first_name":"Jean","last_name":"M. Nelson","permalink":"jean-m-nelson","crunchbase_url":"http://www.crunchbase.com/person/jean-m-nelson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jun 01 03:21:34 UTC 2011","updated_at":"Wed Jun 01 03:22:53 UTC 2011","overview":"<p>Jean Nelson joined Allocade in May 2011 as vice president of marketing, bringing with her over 25 years of extensive marketing experience in the healthcare industry. Jean is an accomplished executive with substantial experience developing marketing strategies and implementing sales support tactics for paradigm-shifting medical technologies. She has worked and consulted with several medical technology companies, from early-stage commercialization through launch and revenue generation. As the vice president of marketing at Aspect Medical Systems, a venture-backed medical device company with a successful IPO in 2000, Jean worked with the founding team to create a new market for the company&#8217;s BIS technology, a direct measure of the level of consciousness during anesthesia and sedation. She directed the marketing programs that contributed to the growth in annual corporate revenue from zero to over $35 Million in less than five years. Jean also held positions in marketing and business development with Nellcor, and served as a consultant for Bain &amp; Company, Inc. in their hospital consulting practice. Jean holds a Bachelor of Science in Metallurgy and Materials Engineering from Lehigh University, and a Masters in Business Administration from the University of Chicago Booth School of Business.</p>","image":null,"degrees":[{"degree_type":"Bachelor of Science","subject":"","institution":"Lehigh University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Vice President of Marketing","firm":{"name":"Allocade","permalink":"allocade","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0008/3110/83110v2-max-150x150.jpg"],[[189,44],"assets/images/resized/0008/3110/83110v2-max-250x250.jpg"],[[189,44],"assets/images/resized/0008/3110/83110v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}