{"first_name":"Jean","last_name":"Case","permalink":"jean-case","crunchbase_url":"http://www.crunchbase.com/person/jean-case","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 14 15:49:17 UTC 2008","updated_at":"Sat Nov 15 11:32:32 UTC 2008","overview":"<p>Jean Case is an actively engaged philanthropist and a pioneer in the world of interactive technologies. Her career as a technology executive in the private sector spanned nearly two decades before she and her husband, Steve Case, created the Case Foundation in 1997. Jean&#8217;s role as a senior executive at America Online, Inc. (AOL) contributed to an online revolution that changed the way millions of people learn, communicate, and do business.</p>\n\n<p>At AOL, Jean directed the marketing and branding effort that launched the AOL service, directed the communications strategy for taking the company public, and helped establish AOL as not just a household name, but a household utility. Jean&#8217;s passion for all things digital didn&#8217;t begin at AOL. Before joining the company when it was a small startup, she held strategic marketing positions at GE&#8217;s Information Services Division and at The Source, the nation&#8217;s first online service.</p>\n\n<p>Jean has been honored for her philanthropic work by Habitat for Humanity, the Boys &amp; Girls Clubs of America, the Center for Missing and Exploited Children, and the Woodrow Wilson International Center, which recognizes leaders who use their assets and resources to improve American lives and institutions. Recently, Voices for National Service honored Jean with its Citizen Service Award for investing in the civic health of the nation through support of national service. In addition, King Abdullah II of Jordan personally recognized Jean for her efforts to bridge the global digital divide.</p>\n\n<p>Jean is chair of the President&#8217;s Council on Service and Civic Participation and serves on the boards of Accelerate Brain Cancer Cure, ePals (formerly in2Books), Millennium Promise, PlayPumps, and the Potomac School in McLean, Va., as well as the advisory council of the National Geographic Society and the advisory board to the National Conference on Citizenship.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0002/8617/28617v1-max-150x150.jpg"],[[180,180],"assets/images/resized/0002/8617/28617v1-max-250x250.jpg"],[[180,180],"assets/images/resized/0002/8617/28617v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"The Case Foundation","permalink":"the-case-foundation","type_of_entity":"financial_org","image":{"available_sizes":[[[150,44],"assets/images/resized/0002/8544/28544v2-max-150x150.jpg"],[[244,72],"assets/images/resized/0002/8544/28544v2-max-250x250.jpg"],[[244,72],"assets/images/resized/0002/8544/28544v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}