{"first_name":"Jean","last_name":"Brittingham","permalink":"jean-brittingham","crunchbase_url":"http://www.crunchbase.com/person/jean-brittingham","homepage_url":"http://www.crunchbase.com/JBrittingham","birthplace":"","twitter_username":"smartgirlsway","blog_url":"","blog_feed_url":"","affiliation_name":"SmartGirls Way","born_year":null,"born_month":null,"born_day":null,"tag_list":"jean-brittingham, smartgirls-way, brittingham-partners","alias_list":null,"created_at":"Wed Dec 14 06:31:49 UTC 2011","updated_at":"Mon Dec 19 21:26:38 UTC 2011","overview":"<p>Jean Brittingham believes that women-owned businesses are the key to our future economic growth and a thriving world.  Prior to starting SmartGirls Way in August 2011, Jean founded Brittingham Partners and worked with a diverse client group that included Fortune 100 companies, innovative start-ups, local and national governments, and nongovernmental organizations (NGOs). Jean has served on the Consumer Agenda Council of the World Economic Forum, as a strategic advisor and faculty member for the University of Cambridge Programme for Sustainability Leadership, and as an expert on gender equity for the Katerva Challenge, and sits on numerous business and nonprofit boards. Her career in sustainable business has spanned over twenty years, ranging from the design of strategic collaborations to the implementation of programs across multiple sectors and businesses to promote and empower a sustainable future. While working as a consultant to some of the world’s largest brands, Jean began to see a significant need for the unique views and attributes that women can bring to conversations, businesses, and economies. Fueled by her creativity, intuition, and passion, Jean established the SmartGirls Way and began creating the content— including a book uniquely focused on women’s entrepreneurial strengths—to help rapidly scale the women’s entrepreneurial movement that will form the critical base for the next economy. She is an expert in sustainable development, communication, leadership and culture, economic and cultural innovation, women’s equality, and the future of entrepreneurism.</p>","image":null,"degrees":[{"degree_type":"BS, MBA","subject":"Business and Peace Studies","institution":"George Fox University","graduated_year":1996,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"SmartGirls Way","permalink":"smartgirls-way","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.smartgirlsway.com","title":"SmartGirls Way"}],"web_presences":[{"external_url":"http://www.linkedin.com/in/smartgirlsjeanbrittingham","title":"Jean on LinkedIn"},{"external_url":"http://www.twitter.com/#!/ecobritt","title":"Jean's Twitter"},{"external_url":"http://www.twitter.com/#!/smartgirlsway","title":"SmartGirls Way Twitter"}]}