{"first_name":"Jean-François","last_name":"Grasset","permalink":"jean-franois-grasset","crunchbase_url":"http://www.crunchbase.com/person/jean-franois-grasset","homepage_url":"","birthplace":"Paris","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1963,"born_month":6,"born_day":22,"tag_list":"","alias_list":null,"created_at":"Mon May 07 16:12:52 UTC 2012","updated_at":"Thu May 10 20:27:35 UTC 2012","overview":"<p>Jean-François is a Senior Consultant with a 25-year worldwide experience. He advises Hi-Tech Start-Up to grow their Business:</p>\n\n<ul>\n<li>Business Development in Europe for US companies (Planning, Set-up and Business plan execution).</li>\n<li>Acquisition / Investment in European Start-Up with worldwide potential.</li>\n<li>Implementation of lean organization and Time-to-Market processes.</li>\n</ul>\n\n<p>In the last 25 years, Jean-François held several senior positions:</p>\n\n<ul>\n<li>As a Senior Vice president, he was instrumental in the development of Gemstar TVGuide (now part of Rovi) in Europe and reorganized the CE division, at worldwide level, to improve efficiency, reduce cost and shorten product development cycles.</li>\n<li>He previously founded and grew his own Strategy Consulting firm in the Telecom, Media and Internet sectors where he successfully developed a portfolio of key accounts in France and Europe.</li>\n<li>As a Product Manager, Jean-François managed the TV European product line of Thomson Consumer Electronics  and implemented the offshore development and production in Asia.</li>\n</ul>\n\n<p>Jean-François has an engineering degree in both Software/Electronics Design and Telecommunications. He also has a master in Marketing of High Tech Products. </p>\n\n<p>Jean-François is a ’Thinker’ with an excellent business insight as well as a ‘Doer’ with very good operation skills. He is extremely focused and his experience in Product and Project Management, R&amp;D and Operations, Strategy and Business planning enables him to quickly understand key facts and issues to define and implement the best solutions.</p>\n\n<p>“As SVP Worlwide R&amp;D and Operations, Jean-François did an outstanding job in reorganizing our worldwide teams in US, Asia and Europe and in improving on cost and efficiency. He was also a key asset in the launch of Gemstar&#8217;s latest connected EPG and successfully managed that project. I highly recommend Jean-Francois.” January 31, 2011\nRich Battista, CEO, Gemstar-TV Guide.</p>","image":{"available_sizes":[[[143,150],"assets/images/resized/0018/8230/188230v2-max-150x150.jpg"],[[190,199],"assets/images/resized/0018/8230/188230v2-max-250x250.jpg"],[[190,199],"assets/images/resized/0018/8230/188230v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/profile/view?id=8139854&trk=tab_pro","title":"Linkedin"}]}