{"first_name":"Jean","last_name":"Viallet","permalink":"jean-viallet","crunchbase_url":"http://www.crunchbase.com/person/jean-viallet","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Mar 22 07:45:52 UTC 2011","updated_at":"Tue Mar 22 07:48:54 UTC 2011","overview":"<p>Prior to joining Gemin X as Vice President for Clinical Development in 2002, Dr. Jean Viallet held senior positions at GlaxoSmithKline. He was Group Director, Clinical Development and Medical Affairs at GSK and was responsible for the support of Navelbine, a leading cancer therapeutic presently available on the market. In addition, he led development efforts for GSK&#8217;s dual kinase inhibitor and played a central role in Corixa&#8217;s pursuit of regulatory approval for Bexxar, a radioimmunotherapy presently under review for the treatment of multiply relapsed low-grade non-Hodgkin&#8217;s lymphoma. </p>\n\n<p>Dr. Viallet previously held the position of Senior Director of Clinical Oncology at Sanofi-Synthélabo where he managed several clinical development projects including oxaliplatin and rasburicase, both now on the market. Dr. Viallet also held faculty appointments at McGill University and the Université de Montréal, and clinical appointments at the Hopital Notre-Dame and the Montreal General Hospital. </p>\n\n<p>Dr. Viallet has published 50 research and review articles on the molecular biology of cancer and in clinical oncology. He holds degrees in Biology and in Medicine from the Université de Montréal and received his oncology training at the National Cancer Institute in Bethesda, MD. He is the recipient of several professional and academic awards. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Executive Vice President and Chief Medical Officer","firm":{"name":"Gemin X Pharmaceuticals","permalink":"gemin-x-pharmaceuticals","type_of_entity":"company","image":{"available_sizes":[[[150,41],"assets/images/resized/0007/9935/79935v1-max-150x150.jpg"],[[250,68],"assets/images/resized/0007/9935/79935v1-max-250x250.jpg"],[[263,72],"assets/images/resized/0007/9935/79935v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}