{"first_name":"Jeffrey","last_name":"Volk","permalink":"jeffrey-volk","crunchbase_url":"http://www.crunchbase.com/person/jeffrey-volk","homepage_url":"http://www.mlb.com","birthplace":"Boston, MA","twitter_username":"javolk","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Sep 23 17:07:47 UTC 2010","updated_at":"Sun Sep 25 13:46:36 UTC 2011","overview":"<p>Jeffrey Volk is the Vice President of Business Development at Major League Baseball Advanced Media. In his current role, he oversees partnership and business initiatives across many digital, mobile, and interactive initiatives.</p>\n\n<p>Prior to Joining MLB, Jeff was the President of Digital Media at Athletes&#8217; Performance, in Norwell, MA, where he oversaw the strategy and development of the company&#8217;s digital properties. Jeff also ran CorePerformance.com, which is provides personalized training programs to active minded athletes.</p>\n\n<p>Previously, Jeff spent six years as the Director of Advanced Media at the United States Tennis Association in New York, where he was the General Manager of 375+ Web sites, including the US Open, US Open Series, and USTA.com Network.  His responsibilities included all broadband and wireless strategy and production, new media sales and fulfillment, eCommerce, and new business development.  Additionally, Jeff was the Executive Producer of the first ever US Open Live Webcast and USOpen.org, which generated a record 30 million visits during the 14 days of the 2007 tournament.</p>\n\n<p>Prior to joining the USTA, Jeff worked for the consulting firm, Scient, in New York, where he built business models for online and wireless ventures.  He also worked for Ketchum, within Visa USA&#8217;s sports sponsorship team, and for Major League Soccer.  </p>\n\n<p>Jeff graduated from the University of Pennsylvania and earned his MBA at the NYU Stern School for Business.  He has competed in several triathlons and most recently completed the Pan Mass Challenge.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0015/4985/154985v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0015/4985/154985v2-max-250x250.jpg"],[[299,450],"assets/images/resized/0015/4985/154985v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}