{"first_name":"Jeffrey","last_name":"S. McCormick","permalink":"jeffrey-s-mccormick","crunchbase_url":"http://www.crunchbase.com/person/jeffrey-s-mccormick","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 23 00:33:26 UTC 2009","updated_at":"Tue Jun 23 00:34:48 UTC 2009","overview":"<p>Jeffrey is the Chairman and Managing General Partner of Saturn. He founded Saturn in 1993 and began financing early stage companies through its broker-dealer, Saturn Capital, Inc. These financings included the extremely successful business-to-business e-commerce company, FreeMarkets (FMKT, acquired by ARBA); the largest U.S. biodiesel company, Twin Rivers Technologies (acquired by FELDA); the 2007 high-tech offering, Constant Contact (CTCT); and the extremely popular Boston Duck Tours. Jeffrey led the expansion of Saturn with the launch of Saturn Partners Limited Partnership I in 2001, which has invested in cutting-edge technology companies including Akustica, BodyMedia, MooBella and NHXS. Jeff and his partners formed Saturn Partners Limited Partnership II in 2006. </p>\n\n<p>Jeffrey has over 20 years of experience as an investment banker, entrepreneur and venture capitalist. He currently serves on the boards of MooBella, American Made, SureLogic, Knopp Neurosciences, Applied Clean Tech and NHXS. </p>\n\n<p>Prior to founding Saturn, Jeffrey was with Bariston Associates, Inc., a Boston firm that originated and managed private investments for individual and institutional clients, predominately in telecommunications. At Bariston, he was an acquisition and syndication specialist, and reviewed potential investment opportunities, including performing financial analysis and due diligence. </p>\n\n<p>Jeffrey is a graduate of Syracuse University, where he received an MBA in Finance and a BS in Biology.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chairman","firm":{"name":"Saturn Venture Partners","permalink":"saturn-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,36],"assets/images/resized/0005/0216/50216v1-max-150x150.jpg"],[[245,59],"assets/images/resized/0005/0216/50216v1-max-250x250.jpg"],[[245,59],"assets/images/resized/0005/0216/50216v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}