{"first_name":"Jeff","last_name":"Zucker","permalink":"jeff-zucker-2","crunchbase_url":"http://www.crunchbase.com/person/jeff-zucker-2","homepage_url":"","birthplace":"Homestead, Florida","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1965,"born_month":4,"born_day":9,"tag_list":null,"alias_list":"","created_at":"Fri Jun 04 15:13:29 UTC 2010","updated_at":"Fri Jun 04 15:40:27 UTC 2010","overview":"<p>Jeff Zucker is President and Chief Executive Officer of NBC Universal. He has held that position since February 2007. </p>\n\n<p>NBC Universal is one of the world’s leading media and entertainment content companies, with assets that include the U.S. broadcast networks NBC and Telemundo; cable networks USA, Syfy, Bravo, Oxygen, CNBC, MSNBC and the Weather Channel; movie studios Universal Pictures and Focus Features; digital properties such as Hulu (a joint venture with News Corporation and Disney) and iVillage; an extensive array of international television channels in Europe, Asia, and Latin America; and theme parks in Hollywood and Orlando. Formed in 2004 through the acquisition by NBC of Vivendi Universal Entertainment, NBC Universal is 80% owned by General Electric and 20% owned by Vivendi. </p>\n\n<p>Zucker has spent his entire career at NBC Universal, joining the company’s Olympic unit in 1986, straight out of college. In his more than 23 years with the company, he has had a diversified career as an award-winning producer and business leader. </p>\n\n<p>He served as president of the NBC Universal Television Group from May 2004 until December 2005. Before that, he was president of the Entertainment, News &amp; Cable Group since December 2003, and president of NBC Entertainment since December 2000. Before taking the helm of NBC Entertainment, Zucker spent nearly eight years as the executive producer of NBC News’ Today. Under his leadership at Today, the program became the nation’s most-watched morning news show and the most profitable program on television. </p>\n\n<p>Zucker was appointed executive producer of Today in January 1992 at age 26, which made him the youngest executive producer in the history of the program. He also served as executive producer of NBC Nightly News with Tom Brokaw in February and March 1993, a post held concurrently with his role at Today. He joined NBC in 1986 as a researcher for NBC Sports’ coverage of the 1988 Summer Olympics and joined NBC News as a field producer for Today in January 1989. </p>\n\n<p>A five-time Emmy Award winner, Zucker graduated from Harvard College in 1986 with a bachelor’s degree in American history. He served as president of the Harvard Crimson from 1985 to 1986. Zucker’s date of birth is April 9, 1965. He and his wife, Caryn, live in New York with their four children. Zucker is a member of the board of directors of the Memorial Sloan Kettering Cancer Center, Temple Emanu-El, the Robin Hood Foundation, the American Film Institute, the Paley Center for Media, and the Museum of the Moving Image.</p>\n\n<p>Source: <a href=\"http://www.nbcuni.com/About_NBC_Universal/Executive_Bios/zucker_jeff.shtml\" title=\"NBC Universal\" rel=\"nofollow\">NBC Universal</a></p>","image":{"available_sizes":[[[115,150],"assets/images/resized/0008/9540/89540v1-max-150x150.jpg"],[[170,220],"assets/images/resized/0008/9540/89540v1-max-250x250.jpg"],[[170,220],"assets/images/resized/0008/9540/89540v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://en.wikipedia.org/wiki/Jeff_Zucker\" title=\"Wikipedia\" rel=\"nofollow\">Wikipedia</a></p>"},"degrees":[{"degree_type":"BA","subject":"History","institution":"Harvard University","graduated_year":1986,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President, CEO","firm":{"name":"NBC Universal","permalink":"nbcuniversal","type_of_entity":"company","image":{"available_sizes":[[[150,58],"assets/images/resized/0001/5877/15877v4-max-150x150.png"],[[226,88],"assets/images/resized/0001/5877/15877v4-max-250x250.png"],[[226,88],"assets/images/resized/0001/5877/15877v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}