{"first_name":"Jeffery","last_name":"Palumbo","permalink":"jeffery-palumbo","crunchbase_url":"http://www.crunchbase.com/person/jeffery-palumbo","homepage_url":"http://www.jefferypalumbo.com","birthplace":"","twitter_username":"jeffpalumbo","blog_url":"","blog_feed_url":"","affiliation_name":"Wantsa","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Dec 30 22:59:14 UTC 2009","updated_at":"Thu Jun 14 20:21:01 UTC 2012","overview":"<p>Mr. Palumbo is a serial entrepreneur with a highly creative and assertive “lead by example” management style, combined with a heart for helping people through business and charitable initiatives. He has 13 years worth of experience of starting companies in charity management and Internet marketing, and the culmination of this impressive career is OfferAll, a radical new Life linked Offers platform that gives back to causes people care about.</p>\n\n<p>Before founding Offerall, Palumbo helped to start, fund and build the successful tech company Wantsa Inc. (www.wantsa.com, a.k.a. United Media Partners), a deal origination and syndication platform for enterprise companies, where he was instrumental in the growth of the company as an executive. Among the many companies Palumbo has helped to establish are I.M.E.C.A. (Incubator for Music, Entertainment and creative arts), which assisted Detroit-area music entrepreneurs; Printorweb.com, a business solutions provider; FreePickles, a daily deals site; FavoriteSpots, a mobile check-in platform; and DailyDealTraining.com, a resource for emerging daily deal companies.</p>\n\n<p>Palumbo’s entrepreneurial work is not strictly limited to business and marketing solutions. He also has a history of philanthropic leadership, co-founding the Believe for Boey Foundation, a nonprofit to aid families suffering from pediatric cancer, in 2007. In 2009, he founded the nonprofit KIDlanthropy to assist parents, teachers and leaders in raising philanthropic children.</p>\n\n<p>Jeff’s innovative work in merchant marketing, his vast knowledge of technology, and passion for charity have led to his success in creating multiple platforms that empower publishers and merchants and engage consumers. This experience is brought in full force to OfferAll.\nSpecialties</p>\n\n<p>Business Development, Social Entrepreneur, Loyalty, Charity management, charity fund raising, Charity Tech, Partnerships, Daily Deals, New media, CPG Deals</p>","image":{"available_sizes":[[[116,150],"assets/images/resized/0007/8331/78331v2-max-150x150.jpg"],[[193,250],"assets/images/resized/0007/8331/78331v2-max-250x250.jpg"],[[348,450],"assets/images/resized/0007/8331/78331v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Co-founder","firm":{"name":"OfferAll","permalink":"offerall","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/jeffpalumbo","title":"linkedin"},{"external_url":"http://twitter.com/jeffpalumbo","title":"Twitter"},{"external_url":"http://www.offerall.com","title":"Company Home Page"}]}