{"first_name":"Jeff","last_name":"Granato","permalink":"jeff-granato","crunchbase_url":"http://www.crunchbase.com/person/jeff-granato","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 10 02:33:15 UTC 2010","updated_at":"Sat Aug 20 10:49:26 UTC 2011","overview":"<p>Before joining Proterra in 2006, Jeff Granato was an experienced executive overseeing growth and strategy for a diverse range of large-scale global businesses, including enabling infrastructure development. Over the last two decades, Mr. Granato has managed business development efforts worth billions of dollars in retail, technology and financial services companies in various executive management roles, including CEO, CFO, COO and President. He also served as Senior Engagement Manager at McKinsey &amp; Co. as a member of their Global Growth Strategy Practice, guiding Fortune 500 companies into high-value growth opportunities. Mr. Granato has also led the development of global operating and supply chain platforms for leading retail businesses such as Waldo’s Dollar Mart de Mexico, Boston Chicken, Inc. and Einstein Noah Bagel Corp. He has worked as a principal investor from within venture capital and private equity funds and has also represented investors as a Senior Analyst for Ernst &amp; Young’s M&amp;A Advisory Services. Mr. Granato holds a Bachelor of Arts in Finance from DePaul University and a Masters from J.L. Kellogg Graduate School of Management, both in Chicago, Illinois.</p>","image":null,"degrees":[{"degree_type":"Bachelor of Arts","subject":"Finance","institution":"DePaul University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"President and CEO","firm":{"name":"Proterra","permalink":"proterra","type_of_entity":"company","image":{"available_sizes":[[[150,21],"assets/images/resized/0009/0076/90076v1-max-150x150.png"],[[250,36],"assets/images/resized/0009/0076/90076v1-max-250x250.png"],[[450,65],"assets/images/resized/0009/0076/90076v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}