{"first_name":"Jeff","last_name":"Miller","permalink":"jeff-miller-5","crunchbase_url":"http://www.crunchbase.com/person/jeff-miller-5","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Mar 22 05:47:14 UTC 2011","updated_at":"Tue Mar 22 05:47:59 UTC 2011","overview":"<p>Jeff Miller currently holds the position of Vice President of Operations for CE Ortho. He is responsible for all manufacturing and operational activities at the facility. Jeff’s responsibilities include production forecasting, inventory planning, delivery scheduling, process planning, quality assurance, cost analysis, and facility/equipment management.\nAs Vice President of Operations and Manufacturing at Small Bone Innovations, Jeff was responsible for the operations and manufacturing at all of Small Bone Innovations’ facilities. In the first year of working for SBI, Jeff managed the quality department which developed and acquired certification approval of the company’s ISO 13485, MDD, and CMDCAS quality system and procedures.\nPrior to joining SBI, Jeff spent 14 years in the orthopedic implant business as Managing Partner / Director of Operations for Envision Manufacturing, Inc., an FDA registered medical device contract manufacturer acquired by SBI in November 2004. Envision specialized in machining complex, tight tolerance, implantable components and surgical instruments used in orthopedic, spine, and maxillofacial applications.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Co-Founder, Vice President Operations","firm":{"name":"Core Essence Orthopaedics","permalink":"core-essence-orthopaedics","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0012/7170/127170v1-max-150x150.jpg"],[[250,76],"assets/images/resized/0012/7170/127170v1-max-250x250.jpg"],[[377,115],"assets/images/resized/0012/7170/127170v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}