{"first_name":"Jeffrey","last_name":"P. Parker","permalink":"jeffrey-p-parker","crunchbase_url":"http://www.crunchbase.com/person/jeffrey-p-parker","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Nov 17 06:40:06 UTC 2008","updated_at":"Mon May 18 13:27:25 UTC 2009","overview":"<p>Jeff has an extensive history of success as an entrepreneur, CEO and investor in financial services companies over the past twenty years.  He brings an operating perspective to the companies in which he invests, as well as a wealth of financial expertise and an extended network of domestic and international business contacts. Jeff currently represents GrandBanks Capital as Chairman of the Board of Directors for First Coverage.  He was named 2003 New England Entrepreneur of the Year by Ernst &amp; Young in the Financial Services category. Jeff currently serves as an advisor to MedPanel of Boston and is a member of the Board of Directors of Mainstream Data and Vision Research.</p>\n\n<p>Background\nIn 1980, Jeff founded Technical Data Corporation, a provider of financial analytic services for the institutional investor community. In 1983, he founded First Call Corporation, which quickly became one of the financial community’s leading providers of real-time broker-sourced research, earnings estimates, equity and fixed income ownership information, insider trading information and corporate news releases. In 1986, Jeff sold both these businesses to the Canadian publishing giant International Thomson, now The Thomson Corporation, and became Chairman and CEO of Thomson Financial, its financial services subsidiary. Under Jeff’s leadership, Thomson Financial became the major provider of proprietary financial information to the investment and corporate communities. Thomson Financial currently serves over 75,000 institutional clients worldwide and has annual revenues in excess of $750 million.</p>\n\n<p>After serving as CEO of Thomson Financial, Jeff co-founded 38 Newbury Ventures, a venture capital firm which focused on start-up and early stage companies. While at 38 Newbury Ventures, Jeff and Charley Lax co-invested together in several companies including FAXNET and LimiTrader.</p>\n\n<p>In 1997, Jeff co-founded CCBN.com (Corporate Communications Broadcast Network), a leader in enabling direct communications between public companies and the investment community over the Internet.  CCBN.com builds, manages and hosts the investor relations sections of Web sites for more than 2,000 public companies, providing detailed shareholder information through interactive, multi-media solutions. Jeff served as CCBN’s Chairman and CEO until the sale of the company to The Thomson Corporation in March 2004.</p>","image":{"available_sizes":[[[101,103],"assets/images/resized/0004/4434/44434v1-max-150x150.jpg"],[[101,103],"assets/images/resized/0004/4434/44434v1-max-250x250.jpg"],[[101,103],"assets/images/resized/0004/4434/44434v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor of Engineering","subject":"","institution":"Cornell University","graduated_year":1965,"graduated_month":null,"graduated_day":null},{"degree_type":"Master of Engineering","subject":"","institution":"Cornell University","graduated_year":1966,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"Cornell University","graduated_year":1970,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Partner ","firm":{"name":"GrandBanks Capital","permalink":"grandbanks-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,42],"assets/images/resized/0002/9085/29085v1-max-150x150.png"],[[250,70],"assets/images/resized/0002/9085/29085v1-max-250x250.png"],[[279,79],"assets/images/resized/0002/9085/29085v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}