{"first_name":"Jeffrey","last_name":"Housenbold","permalink":"jeffrey-housenbold","crunchbase_url":"http://www.crunchbase.com/person/jeffrey-housenbold","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Shutterfly","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 21 12:23:28 UTC 2007","updated_at":"Sun Oct 02 01:58:48 UTC 2011","overview":"<p>As Shutterfly’s President &amp; CEO, Jeffrey Housenbold leads the Company’s strategic direction and growth. Jeffrey is a new-media visionary with a successful track record of building online consumer franchises by artfully combining commerce and community. His leadership and vision are the driving force behind Shutterfly’s industry leading transformation of how people interact with their memories. Jeffrey has assembled a talented executive team that oversees the rapid growth of Shutterfly’s global customer base, strategic partnerships, technology platforms and innovative products and services. In June 2006, Jeffrey received the Ernst &amp; Young Entrepreneur of the Year® Award in the Retail and Consumer Products category for the Northern California region.</p>\n\n<p>Previously, Jeffrey was Vice President of Business Development &amp; Internet Marketing at eBay, where he managed customer acquisition and retention. At eBay he also held positions as Vice President &amp; General Manager of its Business-to-Consumer Group and Vice President of Mergers and Acquisitions. Formerly, Jeffrey held senior management positions with AltaVista, including Vice President &amp; General Manager, and was the Chief Operating Officer of Raging Bull, the award-winning community finance portal. He also served as Vice President of Corporate Development at WinStar Communications and as Manager and Co-founder of Accenture’s Media &amp; Entertainment Strategy Group.</p>\n\n<p>Jeffrey earned his MBA from Harvard Business School where he was a Dean’s Fellow; and his undergraduate degrees, with High Honors in Economics and Business Administration, from Carnegie Mellon University where he was a Presidential Scholar.</p>\n\n<p>Jeffrey currently serves on the Board of Directors of Digital Chocolate, a leading publisher of original high-quality social and mobile games and the nationally recognized Children’s Discovery Museum of San Jose, one of the ten best children’s museums in the country. Jeffrey is the co-author of The Shutterfly Guide to Great Digital Photos, an instructional book published by McGraw-Hill on the essentials of digital photography and managing images. He is an avid photographer with his Canon 5D Mark II, and spends his weekends capturing the special moments created by his wife and their three sons.</p>","image":{"available_sizes":[[[106,150],"assets/images/resized/0015/5685/155685v2-max-150x150.jpg"],[[170,240],"assets/images/resized/0015/5685/155685v2-max-250x250.jpg"],[[170,240],"assets/images/resized/0015/5685/155685v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Shutterfly","permalink":"shutterfly","type_of_entity":"company","image":{"available_sizes":[[[141,48],"assets/images/resized/0000/2266/2266v8-max-150x150.png"],[[141,48],"assets/images/resized/0000/2266/2266v8-max-250x250.png"],[[141,48],"assets/images/resized/0000/2266/2266v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}