{"first_name":"Jeff","last_name":"Schram","permalink":"jeff-schram","crunchbase_url":"http://www.crunchbase.com/person/jeff-schram","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Lehigh Technologies","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Oct 20 01:11:02 UTC 2009","updated_at":"Wed Jun 30 13:13:09 UTC 2010","overview":"<p>An accomplished Finance and Accounting professional, Mr. Jeff B. Schramm leverages more than 10 years of experience in executive management toward his current position as Chief Financial Officer of Lehigh Technologies. Based in Atlanta Georgia, Jeff Schramm is adept at managing a variety of complex financial initiatives and has played a critical role in establishing Lehigh Technologies as the world’s leader in the production and distribution of ultra-fine powdered rubber.</p>\n\n<p>Prior to Lehigh Technologies, Jeff Schramm served as the Vice President of Finance at Euramax International based in Atlanta. In this position, Jeff Schramm worked closely with the company’s CFO and CEO to consolidate the accounting and finance functions for 2 divisions and over 30 manufacturing locations. Focused on creating highly motivated teams, Jeff Schramm worked on developing staff through corporate training, as well as advanced mentoring and continued education programs. </p>\n\n<p>Before joining the management team at Euramax, Jeff Schramm was the Corporate Controller of North America for Kemira Chemicals, also based in Atlanta and headquartered in Helsinki, Finland. During his time with Kemira, Jeff Schramm spearheaded the integration of FinnChem and Lanxess Paper Chemicals. Jeff Schramm came to Kemira after serving in a variety of progressive financial roles at Milliken &amp; Co. Combining a Bachelor of Science degree in Corporate Finance and Investment Management with a Master of Business Administration, Jeff Schramm was able to advance rapidly through the competitive Milliken organization. </p>\n\n<p>When he is not working, Jeff Schramm enjoys outdoor activities with his two boys and auto racing. </p>","image":{"available_sizes":[[[134,150],"assets/images/resized/0009/2069/92069v2-max-150x150.jpg"],[[223,250],"assets/images/resized/0009/2069/92069v2-max-250x250.jpg"],[[327,366],"assets/images/resized/0009/2069/92069v2-max-450x450.jpg"]],"attribution":"<p>Jeff Schramm / <a href=\"http://www.linkedin.com/in/jeffbschramm\" title=\"Jeff Schramm\" rel=\"nofollow\">Jeff Schramm</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"CFO","firm":{"name":"Lehigh Technologies","permalink":"lehigh-technologies","type_of_entity":"company","image":{"available_sizes":[[[150,47],"assets/images/resized/0002/1184/21184v4-max-150x150.png"],[[232,73],"assets/images/resized/0002/1184/21184v4-max-250x250.png"],[[232,73],"assets/images/resized/0002/1184/21184v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}