{"first_name":"Jeff","last_name":"Caden","permalink":"jeff-caden","crunchbase_url":"http://www.crunchbase.com/person/jeff-caden","homepage_url":"http://www.evergram.com","birthplace":"","twitter_username":"jcadence","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 10 04:25:30 UTC 2012","updated_at":"Tue Jul 10 08:32:08 UTC 2012","overview":"<p>Jeff Caden is a creative tech strategist, designer, inventor, and marketing executive with over 25 years experience in consumer products, building, ecommerce, technology, and non-profit sectors.  His ability to solve complex user behaviors and his user-centered approach to product design has led to innovative and iconic user experiences.  </p>\n\n<p>He is currently the co-founder and Chief Product Officer of Evergram, the world’s first fully-integrated ‘Future Messaging’ platform, that allows users to time-shift video, audio or text communications through the creation and delivery of future time capsules to friends and family. </p>\n\n<p>As the co-founder of BonDia Labs, Jeff was instrumental in inventing a patent pending, purse portable ,“high fashion” dosage dispensing device that encourages adherence to a Calcium supplement regimen.  Prior, Jeff was the CEO of SkyRocket Foods, where he devised a low-fat food product built on his food process patent.</p>\n\n<p>While with the international home builder, Lindal Cedar Homes, Jeff repositioned Lindal’s home designs for the 21st century and oversaw the development of a web enterprise customer acquisition program for hundreds of Lindal resellers around the globe. </p>\n\n<p>In the early 1990’s, as the VP Marketing of Nile Spice Foods, Jeff was instrumental in creating and bringing to market an innovative cup-of soup product and package, spurring a new $250 million grocery category in the U.S. </p>","image":{"available_sizes":[[[100,100],"assets/images/resized/0019/9794/199794v2-max-150x150.jpg"],[[100,100],"assets/images/resized/0019/9794/199794v2-max-250x250.jpg"],[[100,100],"assets/images/resized/0019/9794/199794v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}