{"first_name":"Jeffrey","last_name":"Hyman","permalink":"jeffrey-hyman","crunchbase_url":"http://www.crunchbase.com/person/jeffrey-hyman","homepage_url":"http://www.idle-games.com","birthplace":"Mountain Home AFB, Idaho","twitter_username":"","blog_url":"http://www.myheadisleaking.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1970,"born_month":8,"born_day":7,"tag_list":"","alias_list":null,"created_at":"Fri Jul 29 17:41:30 UTC 2011","updated_at":"Mon Aug 01 22:12:46 UTC 2011","overview":"<p>Jeffrey Hyman makes pixels do things. Forbidden things. Things pixels should never do.</p>\n\n<p>CHAPTER 1: </p>\n\n<p>In 2000 Jeffrey founded the interactive advertising agency COG1. </p>\n\n<p>Ten years later he garnered: 4 shelves worth of awards, a client list that would make any agency proud, and led the company to 40 consecutive quarters of profitability. </p>\n\n<p>Technology, design, storytelling, film, print, and animation are the crafts Jeffrey used to create entertaining and engaging advertising campaigns.</p>\n\n<p>Clients included: CBS, MTV, and HBO. Jeffrey even had the chance to work with a few companies that had names longer than 3 letters.  </p>\n\n<p>The good news is apparently Jeffrey doesn&#8217;t suck.  Here&#8217;s a few of the places he&#8217;s received awards and honors:</p>\n\n<p>2 CLIOs, The One Show, 2 Cannes Cyber Lions, 8 National ADDYs, 1 Best of Division ADDY, Adweek Magazines Icon Award, Adweek &amp; Brandweek Magazines MIXX Award\nNYC Advertising Festival, 2 AD:Tech Awards</p>\n\n<p>CHAPTER 2:</p>\n\n<p>In 2007, Jeffrey wrote and sold a show to MTV. The TV show was optioned by Renegade 83 and produced for MTV. Credits were: Creator &amp; Executive Producer. </p>\n\n<p>CHAPTER 3:</p>\n\n<p>In November of 2009, Jeffrey was offered the opportunity to co-found a new venture backed company alongside Silicon Valley legend Rick Thompson.</p>\n\n<p>Jeffrey heard opportunity knocking and thought after 11 years, and 40 consecutive quarters of growth &amp; profitability … this was as good of time as any to sell his advertising agency. </p>\n\n<p>After an extremely relaxing 72 hour vacation, during which his wife gave birth to hisr 2nd child, Jeffrey began focusing on getting &#8220;Idle Games&#8221; off the ground and into the stratosphere. </p>\n\n<p>Entrepreneurs sure are a funny bunch aren&#8217;t they?</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0014/6955/146955v2-max-150x150.jpg"],[[201,250],"assets/images/resized/0014/6955/146955v2-max-250x250.jpg"],[[337,418],"assets/images/resized/0014/6955/146955v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}