{"first_name":"Jeff","last_name":"Jonas","permalink":"jeff-jonas","crunchbase_url":"http://www.crunchbase.com/person/jeff-jonas","homepage_url":"","birthplace":"Seattle","twitter_username":"","blog_url":"http://www.jeffjonas.typepad.com","blog_feed_url":"","affiliation_name":"IBM","born_year":null,"born_month":null,"born_day":null,"tag_list":"ibm","alias_list":"","created_at":"Tue Oct 12 18:56:54 UTC 2010","updated_at":"Thu Feb 17 22:20:14 UTC 2011","overview":"<p>Jeff Jonas is chief scientist of the IBM Entity Analytics group and an IBM Distinguished Engineer. The IBM Entity Analytics group was formed based on technologies developed by Systems Research &amp; Development (SRD), founded by Jonas in 1984 and acquired by IBM in January 2005.</p>\n\n<p>Prior to the IBM&#8217;s acquisition of SRD, Jonas lead it through the design and development of a number of extraordinary systems including technology used by the surveillance intelligence arm of the gaming industry. Leveraging facial recognition, this technology enabled the gaming industry to protect itself from aggressive card count teams, the most notable known as the MIT team and the subject of the book &#8220;Bringing Down the House&#8221; as well as the recent movie &#8220;21.&#8221; Today, possibly half the casinos in the world use technology created by Jonas and his SRD team. This work is frequently featured on the Discovery Channel, Learning Channel, and the Travel Channel.</p>\n\n<p>Jonas is also somewhat unique as a technologist in that he frequently engages with those in the privacy and civil liberties community. With privacy in mind, Jonas invented software which enables organizations to discover records of common interest (e.g., identities) without the transfer of any privacy-invading content. This cryptographic-based technique known as &#8220;Anonymous Resolution&#8221; delivers extraordinary new levels of privacy protection in areas of critical interest like clinical health care research, bio-surveillance, aviation safety, homeland security, fraud detection and identity theft.</p>\n\n<p>Jonas was briefly a quadriplegic in 1988 following a car accident. Today, he competes in Ironman triathlons around the world. Just this year he completed Ironman Malaysia (2/23/08) and Ironman South Africa (4/13/08). He has been raising three kids over the last 12 years as a single parent.</p>","image":{"available_sizes":[[[131,150],"assets/images/resized/0010/5267/105267v1-max-150x150.jpg"],[[175,200],"assets/images/resized/0010/5267/105267v1-max-250x250.jpg"],[[175,200],"assets/images/resized/0010/5267/105267v1-max-450x450.jpg"]],"attribution":"<p>IBM</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Scientist of the IBM Entity Analytics group","firm":{"name":"IBM","permalink":"ibm","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0002/1370/21370v1-max-150x150.png"],[[170,68],"assets/images/resized/0002/1370/21370v1-max-250x250.png"],[[170,68],"assets/images/resized/0002/1370/21370v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}