{"first_name":"Jeffrey","last_name":"Stump","permalink":"jeffrey-stump","crunchbase_url":"http://www.crunchbase.com/person/jeffrey-stump","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Andreessen Horowitz","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Thu Jun 17 06:10:25 UTC 2010","updated_at":"Tue Sep 21 00:02:19 UTC 2010","overview":"<p>Jeffrey Stump is a Partner at Andreessen Horowitz. Previously he was a Partner at Howard Fischer Associates International, a recruiting firm. Jeff focused on senior level executive and board searches within all areas of HFA&#8217;s expertise that have ranged from several Fortune 500 to emerging technology companies. </p>\n\n<p>Prior to joining HFA, Jeff was responsible for financial analysis, market research, merger and acquisition transaction support, due diligence and business valuation as well as SEC compliance and financial reporting for a communications components company, Technitrol (NYSE: TNL). Prior to joining Technitrol, Jeff was a Senior Associate at Arthur Andersen LLP. As a member of the Growth Company Practice, he worked with a number of emerging businesses across a broad range of industries in the Greater Philadelphia market As a member of the Assurance and Business Advisory Group, he provided management consulting services including financial analysis, market research, merger and acquisition transaction support, due diligence and business valuation as well as providing audit and accounting services including audit procedures, SEC compliance and financial reporting. </p>\n\n<p>During his tenure with Arthur Andersen, Jeff gained valuable experience cultivating client relationships. Additionally, his background with executive management in various companies has enabled him to understand how businesses operate, as well as how to assess their unique needs. </p>\n\n<p>Jeff received his Bachelor of Science degree in Accounting from Drexel University in Philadelphia. He is a Certified Public Accountant licensed in the Commonwealth of Pennsylvania.</p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0009/1219/91219v1-max-150x150.jpg"],[[80,80],"assets/images/resized/0009/1219/91219v1-max-250x250.jpg"],[[80,80],"assets/images/resized/0009/1219/91219v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"partner","firm":{"name":"Andreessen Horowitz","permalink":"andreessen-horowitz","type_of_entity":"financial_org","image":{"available_sizes":[[[150,73],"assets/images/resized/0006/5679/65679v2-max-150x150.jpg"],[[250,122],"assets/images/resized/0006/5679/65679v2-max-250x250.jpg"],[[432,212],"assets/images/resized/0006/5679/65679v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}