{"first_name":"Jeff","last_name":"Liebl","permalink":"jeff-liebl","crunchbase_url":"http://www.crunchbase.com/person/jeff-liebl","homepage_url":"http://www.ebureau.com","birthplace":"","twitter_username":"","blog_url":"http://www.ebureau.com/blog","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Sep 22 20:46:19 UTC 2010","updated_at":"Thu Oct 07 18:12:09 UTC 2010","overview":"<p>Jeff leads eBureau&#8217;s sales, product management and product sales organizations.</p>\n\n<p>Jeff Liebl joined eBureau in September 2006, bringing an extensive track record of leadership in successfully growing venture-backed, high-technology companies. His experience includes management roles in marketing, product management and business development with Silicon Valley-based Fortune 500 and venture capital-funded startups.</p>\n\n<p>In his previous role as Vice President of Global Marketing &amp; Product Management for Ubiquity Software, Jeff built a 20-person global team, branded the company and launched several new products. Ubiquity successfully IPO&#8217;d in March 2005. Previously, Jeff held managerial roles in marketing and business development at Jetstream Communications and 3Com Corporation. Jeff began his career as a research analyst for Smaby Group, a strategic consulting firm advising technology clients.</p>\n\n<p>Jeff has presented to audiences at dozens of industry conferences in North America, Europe and Asia. He earned his Bachelor of Arts, Magna Cum Laude, at the University of St. Thomas and his MBA from the University of Michigan Ross School of Business. </p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0010/2716/102716v2-max-150x150.jpg"],[[125,156],"assets/images/resized/0010/2716/102716v2-max-250x250.jpg"],[[125,156],"assets/images/resized/0010/2716/102716v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}