{"first_name":"Jeffrey","last_name":"Evans","permalink":"jeffrey-evans-2","crunchbase_url":"http://www.crunchbase.com/person/jeffrey-evans-2","homepage_url":"http://www.tigertext.com","birthplace":"US","twitter_username":"yourprivacy","blog_url":"http://www.huffingtonpost.com/jeffrey-evans","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"jeffrey-evans, tigertext","alias_list":null,"created_at":"Tue Sep 21 21:51:28 UTC 2010","updated_at":"Thu Oct 07 17:59:04 UTC 2010","overview":"<p>Jeffrey Evans has been the CEO of TigerText since he, and TigerText Chairman Brad Brooks, founded the company more than a year ago. Evans is the voice of TigerText, appearing on CNN, ABC, CBS, NBC, and dozens of the most prominent radio programs in the nation including Howard Stern. Mr. Evans is a contributor to the Huffington Post where he writes about privacy and security in mobile communications.</p>\n\n<p>Evans is also the Chairman of the Board of Orion ICG the nation’s largest recruiting and placement organization specializing in the placement of individuals leaving the military. Orion has placed over 20,000 former-military personnel with more than 2,500 different client corporations.</p>\n\n<p>From 1994-1999 Evans worked at On Assignment (NASDAQ: ASGN) where he became Senior Vice President and General Manager of the specialty staffing company. His responsibilities included developing and managing the corporate support, business development, training, mergers &amp; acquisitions, and operational aspects of the organization. During his tenure On Assignment grew from $35,000,000 to over $125,000,000 in annual revenue (with a corresponding stock price increase from $5.50 to $34.50).</p>\n\n<p>In 1999 Mr. Evans left On Assignment and took over OnStaff as President and Chief Operating Officer. Over the next four years he grew OnStaff from a $5,000,000, three office local staffing company to a national staffing player with a $100,000,000 revenue run rate, EBITDA margins of 10% and 40 offices in major cities throughout the country. In late 2002 he sold OnStaff to Hall Kinion (NASDAQ: HAKI), a $200 million IT staffing company, and joined the HAKI management team as Senior Executive Vice President of Operations. In 2004 he helped complete the sale of HAKI to KForce (NASDAQ: KFRC).</p>\n\n<p>Mr. Evans holds a B.A. from Emory University and an M.B.A. from the Fuqua School of Business at Duke University.</p>","image":{"available_sizes":[[[94,100],"assets/images/resized/0010/2559/102559v2-max-150x150.jpg"],[[94,100],"assets/images/resized/0010/2559/102559v2-max-250x250.jpg"],[[94,100],"assets/images/resized/0010/2559/102559v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.huffingtonpost.com/jeffrey-evans/the-privacy-revolution_b_700879.html","title":"The Privacy Revolution"},{"external_url":"http://www.nytimes.com/2010/07/25/magazine/25privacy-t2.html","title":"The End of Forgetting"},{"external_url":"http://en.wikipedia.org/wiki/TigerText","title":"Wikipedia"}],"web_presences":[{"external_url":"http://www.twitter.com/yourprivacy","title":"Your Privacy"}]}