{"first_name":"Jeff","last_name":"Bergstrom","permalink":"jeff-bergstrom-2","crunchbase_url":"http://www.crunchbase.com/person/jeff-bergstrom-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Apr 04 12:22:29 UTC 2011","updated_at":"Mon Apr 04 12:27:50 UTC 2011","overview":"<p>Jeff Bergstrom is Chief Financial Officer of Mpire. As Mpire’s CFO, Bergstrom is responsible for managing the company&#8217;s financial strategy and operations, as well as overseeing and implementing all financial reporting, forecasting, tax functions, and cash flow operations. Jeff has been an Internet startup &#8220;exit&#8221; veteran during his 18-year financial career. He has managed multi-billion-dollar acquisitions and mergers, facilitated private equity transactions, and navigated business finances during tough macro-economic times. In all, Bergstrom has built and sold three tech and Internet companies resulting in over $2.2B in shareholder value. He spent five years with Internet company Go2Net, helping the company grow to over $110M in annual revenue and $40M in annual operating cash flow. He was deeply involved with the purchase and integration of nine companies in two years, and also led the financial team ultimately responsible for the acquisition by InfoSpace for approximately $2.0B. Before Mpire, Bergstrom was CFO of The PowerTech Group, senior director of finance within Areva T&amp;D, a French public multinational industrial conglomerate, and Controller of Risk Management Solutions, which was sold to a private equity fund run by Morgan Stanley. He has also had two tours of duty with Arthur Anderson, LLP.</p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0012/9124/129124v1-max-150x150.jpg"],[[250,166],"assets/images/resized/0012/9124/129124v1-max-250x250.jpg"],[[270,180],"assets/images/resized/0012/9124/129124v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}