{"first_name":"Jeff","last_name":"Karras","permalink":"jeff-karras-2","crunchbase_url":"http://www.crunchbase.com/person/jeff-karras-2","homepage_url":"","birthplace":"","twitter_username":"jkarras","blog_url":"","blog_feed_url":"","affiliation_name":"SingTel Innov8","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed May 16 08:08:04 UTC 2012","updated_at":"Wed May 23 23:03:31 UTC 2012","overview":"<p>Jeff Karras is a Venture Capital Professional with twenty years of experience in technology, operations, marketing, and finance including more than a decade of investing in early to expansion stage companies in software, semiconductor, and communications technologies. </p>\n\n<p>Jeff is currently a Managing Director with SingTel Innov8 Ventures where he is responsible for running the fund&#8217;s North American investment activities. Jeff&#8217;s current investments include Baynote, Bubble Motion, Capella, Jasper Wireless, Ness, Ruckus Wireless, and ViVOtech. </p>\n\n<p>Before joining SingTel Innov8 Ventures, Jeff was a General Partner with Levensohn Venture Partners (LVP) where he focused on infrastructure and platform technologies across the digital media, security, and cleantech sectors. Past investments include Atheros (Nasdaq: ATHR), Covigo (acquired by Symbol), Veraz Networks (Nasdaq: VRAZ), Informative (acquired by SatMetrix), Radiance (acquired by Comcast), Rapt (acquired by Microsoft), Reconnex (acquired by McAfee), Plum (acquired by Nokia), Wild Pockets (acquired), and ShotSpotter (private). Jeff currently remains a Venture Partner with LVP. </p>\n\n<p>Prior to LVP, Jeff was at Sun Microsystems where he was hired to help establish the Portal Server division. As a start-up division within the larger organization, Jeff played a lead role in developing the market and product strategy, product specifications, and the partnership ecosystem. Prior to Sun Microsystems, Jeff was a Principal Consultant with PricewaterhouseCoopers&#8217; Strategic Change Group, where he provided strategic guidance across a variety of industries including telecommunications, software, energy and financial services</p>\n\n<p>Jeff received a BS in Commerce from the University of Virginia and an MBA from the Wharton School of the University of Pennsylvania. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"SingTel Innov8","permalink":"singtel-innov8","type_of_entity":"financial_org","image":{"available_sizes":[[[150,64],"assets/images/resized/0010/3463/103463v2-max-150x150.png"],[[250,106],"assets/images/resized/0010/3463/103463v2-max-250x250.png"],[[300,128],"assets/images/resized/0010/3463/103463v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}