{"first_name":"Jeff","last_name":"Tolnar","permalink":"jeff-tolnar","crunchbase_url":"http://www.crunchbase.com/person/jeff-tolnar","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 23 01:45:04 UTC 2009","updated_at":"Tue Jun 23 01:51:32 UTC 2009","overview":"<p>As Chief Technology Officer, Jeff Tolnar creates the strategic direction of all technical aspects within BPL Global. He directs the development and deployment of Distribution Intelligence and Broadband solutions, and manages vendor relations. Mr. Tolnar comes to BPL Global with more than 18 years of experience in the networking and communications sectors, including leadership roles in Fortune 50 companies and start-ups.</p>\n\n<p>Before joining BPL Global, Mr. Tolnar was a Vice President and founding member of Amperion, where he managed sales, field services, marketing, business development and regulatory affairs.</p>\n\n<p>Previously, he held the roles of Chief Technology Officer for AEP Communications and Vice President of Broadband Initiatives for American Electric Power. As CTO of AEP Communications, Mr. Tolnar headed business development, strategic planning, technical investment analysis, and vendor selection for an AEP subsidiary with more than $300 million in assets.</p>\n\n<p>Prior to joining AEP, Mr. Tolnar enjoyed a 14 year career at Sprint where he had various leadership roles including operational and technology positions in nearly every broadband communications discipline.\nMr. Tolnar has a degree in Electrical Engineering Technology and a Master&#8217;s in Business Administration.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CTO","firm":{"name":"BPL Global","permalink":"bpl-global","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0005/0232/50232v2-max-150x150.png"],[[213,65],"assets/images/resized/0005/0232/50232v2-max-250x250.png"],[[213,65],"assets/images/resized/0005/0232/50232v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}