{"first_name":"Jeff","last_name":"Gaus","permalink":"jeff-gaus","crunchbase_url":"http://www.crunchbase.com/person/jeff-gaus","homepage_url":"http://www.prolifiq.net","birthplace":"Williamsport, PA","twitter_username":"jeffgaus","blog_url":"http://www.prolifiq.net/corp/Home/Blog/TheMindofJeffGaus.aspx","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1959,"born_month":8,"born_day":29,"tag_list":"sales-content-management, saas, mobility, compliance, good-promotional-practices","alias_list":null,"created_at":"Fri Aug 27 21:25:22 UTC 2010","updated_at":"Fri Aug 27 22:31:43 UTC 2010","overview":"<p>Jeff Gaus, Chief Executive Officer\nJeff Gaus is the President, Chief Executive Officer, and Board member of Prolifiq Software. He articulates and oversees the execution of the company’s growth strategy. Gaus has led the vertical market strategy and architected the company&#8217;s movement into the Life Sciences and Financial Services markets. </p>\n\n<p>Gaus joined the company in 2002. Prior to his current role, he led the company’s business development, marketing and sales activities having initiated relationships with Prolifiq’s largest customers and partners. </p>\n\n<p>Gaus is a veteran of the telecommunications industry having served as the VP of Marketing, eCommerce, with eFusion/ITXC, the world&#8217;s leading VoIP services provider and was responsible introducing a telephony SaaS model. Prior to eFusion/ITXC, Gaus was Executive Director of NEC Business Network Solutions responsible for the Healthcare, Education and Government sectors in North America. Gaus pioneered the use of computer telephony integration (CTI) in the healthcare industry and achieved double-digit market share growth. </p>\n\n<p>Gaus has designed several communications protocols and has co-authored two United States patents: one for VoIP and the other for electronic message management - the core of Prolifiq&#8217;s platform. Gaus completed his education at Indiana University of Pennsylvania in Marketing and executive leadership at Carnegie Mellon University&#8217;s Graduate School of Industrial Administration. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/profile?viewProfile=&key=7156855&locale=en_US&trk=tab_pro","title":"LinkedIn Profile"},{"external_url":"http://twitter.com/jeffgaus","title":"Twitter"}]}