{"first_name":"Jeffrey","last_name":"Krone","permalink":"jeffrey-krone","crunchbase_url":"http://www.crunchbase.com/person/jeffrey-krone","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Aug 06 03:24:22 UTC 2011","updated_at":"Tue Dec 13 00:42:31 UTC 2011","overview":"<p>Jeffrey Krone brings a comprehensive background in business, technology, software development and design, telecommunications, and mergers and acquisitions to Zettaset. Jeffrey is Co-Founder and VP of Engineering at Zettaset and is responsible for the company’s Professional Services Organization, and Operations.</p>\n\n<p>Before joining Zettaset, Mr. Krone held the key positions of President of KroneDavid, Inc., a full service Finance / Accounting, M&amp;A, and IT Services consulting company.  Mr. Krone also served as President of CNS, a full service IT, M&amp;A, and Telecommunications consulting company.</p>\n\n<p>Prior to CNS, Krone served as Vice President of Technology for Platinum Equity, a $10b private acquisition firm.  In this position, Jeffrey focused on the product side of all acquisitions, assisting Platinum portfolio managers with strategic product issues and a wide range of technology initiatives, including product and vendor selection, contract negotiations, telecommunications, and Network / Data Security. Jeffrey was responsible for engaging in Technical Due Diligence, negotiating M&amp;A related Agreements (e.g. Asset Purchase, Stock Purchase, Transition Service Agreements), and determining the future viability and structure of acquired companies.  Additionally, Jeffrey was responsible for negotiating all telecommunication contracts for both Platinum Equity corporate operations and all associated operating companies. Jeffrey focused on forging strategic technology and communication relationships that enabled Platinum Equity to more effectively acquire and manage all its operating units.</p>\n\n<p>Prior to joining Platinum Equity, Krone was Director of Research at Webtone Technologies. Jeffrey directed a group responsible for investigating and developing emerging technologies that integrated into webtone’s multimedia telephony call center software solution.  Mr. Krone served in various roles including Development Manager at Dunn &amp; Bradstreet Software.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP of R&D and Co-founder","firm":{"name":"Zettaset","permalink":"goto-metrics","type_of_entity":"company","image":{"available_sizes":[[[150,39],"assets/images/resized/0007/6812/76812v3-max-150x150.png"],[[250,66],"assets/images/resized/0007/6812/76812v3-max-250x250.png"],[[284,75],"assets/images/resized/0007/6812/76812v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}