{"first_name":"Jeff","last_name":"Martin","permalink":"jeff-martin-3","crunchbase_url":"http://www.crunchbase.com/person/jeff-martin-3","homepage_url":"http://www.simplenumbers.com","birthplace":"Marysville, WA","twitter_username":"","blog_url":"http://blog.simplenumbers.com","blog_feed_url":"","affiliation_name":"Simple Numbers Accounting","born_year":1989,"born_month":7,"born_day":15,"tag_list":"","alias_list":null,"created_at":"Fri Aug 20 20:19:55 UTC 2010","updated_at":"Fri Aug 20 21:08:22 UTC 2010","overview":"<p>Jeff is an entrepreneur changing the way small product-based business owners think about technology and business. </p>\n\n<p>With 6 years of I.T. &amp; Operations Management experience, Jeff found that most product-based accounting software platforms were overly complicated to setup and too time consuming to maintain. With a passion for simplifying business operations for small businesses, he set out to develop an easier solution.</p>\n\n<p>After two and a half years of development, Simple Numbers was released to help small product-based businesses manage their customers, vendors, products, packages, purchase orders and invoices with ease. The Software as a Serivce (SaaS) platform helps small businesses save money by avoiding a significant hardware and software investment while simplifying their operations, streamlining their billing process and reducing overhead costs. </p>\n\n<p>He is currently overseeing Product Management and Business Development.</p>\n\n<p>Known for his tenacity, attention to detail, and thorough understanding of business processes, Jeff also offers consulting for small business clients to manage their evolving technology needs.</p>\n\n<p>When he&#8217;s not working, Jeff can be found cooking, driving, hiking, biking, kayaking or mentoring students on practical business management.</p>\n\n<p>Specialties:\nBusiness Development, Operations Management, Process Development, I.T Management, I.T. Design &amp; Installation, Web Software Development, Accounting, Database Management, Human Resources, Purchasing Control, Strategic Growth, Technology Innovation, Product Development, Account Management, Vendor Relations</p>","image":{"available_sizes":[[[125,125],"assets/images/resized/0009/8711/98711v2-max-150x150.png"],[[125,125],"assets/images/resized/0009/8711/98711v2-max-250x250.png"],[[125,125],"assets/images/resized/0009/8711/98711v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Product Manager","firm":{"name":"Simple Numbers Accounting","permalink":"simple-numbers-accounting","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/jeffersonmmartin","title":"LinkedIn"}]}