{"first_name":"Jeff","last_name":"Raikes","permalink":"jeff-raikes","crunchbase_url":"http://www.crunchbase.com/person/jeff-raikes","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jun 07 21:49:52 UTC 2008","updated_at":"Fri Apr 30 20:36:17 UTC 2010","overview":"<p>Raikes is member of the company’s senior leadership team that sets overall strategy and direction for Microsoft. Most recently, Raikes was the President of the Microsoft Business Division and oversaw the Information Worker, Server &amp; Tools Business and Microsoft Business Solutions Groups. He previously served as group vice president of the Worldwide Sales and Support Group, where he was responsible for providing strategic leadership for Microsoft&#8217;s sales, marketing and service initiatives. Before that, he served as senior vice president of Microsoft North America, a position he had held since 1993.</p>\n\n<p>Raikes joined Microsoft in 1981 as a product manager and was instrumental in driving Microsoft&#8217;s applications marketing strategy. Promoted to director of Applications Marketing in 1984, he was the chief strategist behind Microsoft&#8217;s success in graphical applications for the Apple Macintosh and the Microsoft Windows operating system. In this role, he drove the product strategy and design of Microsoft Office, the leading business productivity suite. Raikes was promoted to vice president of Office Systems, where he was responsible for development and marketing of word processing, workgroup applications and pen computing. Before joining Microsoft, he was a software development manager at Apple Computer Inc.</p>\n\n<p>For contributions to the software industry in the development and marketing of Microsoft Office, and in developing opportunities for channel partners through Microsoft&#8217;s Solution Provider Program and other innovative efforts, Raikes was inducted in November 2003 into Computer Reseller News Magazine&#8217;s Computer Industry Hall of Fame.</p>\n\n<p>Raikes holds a Bachelor of Science degree in Engineering-Economic Systems (EES) from Stanford University. He served on the board of directors of the Software Publishers Association from 1987 to 1993 and twice served as chairman of the board. Raikes also served on the board of the Washington Technology Center.</p>\n\n<p>A native of Nebraska, Raikes is a trustee of the University of Nebraska Foundation. He is involved with numerous community activities, focusing on education and children&#8217;s issues. As part of a community effort to preserve Major League Baseball in the Pacific Northwest, he joined with other Seattle business leaders in 1992 to purchase the Seattle Mariners baseball club.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0002/0099/20099v1-max-150x150.jpg"],[[155,193],"assets/images/resized/0002/0099/20099v1-max-250x250.jpg"],[[155,193],"assets/images/resized/0002/0099/20099v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.microsoft.com/presspass/exec/jeff/default.mspx\" title=\"Microsoft\" rel=\"nofollow\">Microsoft</a></p>"},"degrees":[{"degree_type":"Bachelor of Science","subject":"Engineering-Economic Systems (EES)","institution":"Stanford University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"The Bill & Melinda Gates Foundation","permalink":"the-bill-melinda-gates-foundation","type_of_entity":"company","image":null}},{"is_past":true,"title":"President","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://ap.google.com/article/ALeqM5jQxpmNSLsgAcaMFvdWupv6slz9-QD90KBJ4O0","title":"Microsoft exec Jeff Raikes to run Gates Foundation"},{"external_url":"http://www.forbes.com/forbes/2003/1027/076_print.html","title":"Raised on a farm, bred at Microsoft, Jeff Raikes is the de facto number three few have heard of."},{"external_url":"http://raikes.unl.edu/name_change.shtml","title":"UNL names the Jeffrey S. Raikes School of Computer Science and Management"}],"web_presences":[]}