{"first_name":"Jeffrey","last_name":"Engelmann","permalink":"jeffrey-engelmann","crunchbase_url":"http://www.crunchbase.com/person/jeffrey-engelmann","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Mar 10 22:24:05 UTC 2010","updated_at":"Wed Mar 10 22:24:38 UTC 2010","overview":"<p>Mr. Engelmann brings more than 25 years of experience to EazyBusiness with a demonstrated track record of successful business results – particularly with rapidly growing businesses. Prior to joining EazyBusiness, Mr. Engelmann held senior executive positions in sales, marketing leadership, business development, and operations.</p>\n\n<p>At VMware, Mr. Engelmann served as Executive Vice President, Worldwide Marketing. At Interwoven, he was Vice President of Business Development and Product Marketing. In addition, he also served as General Manager and Vice President of Business Development and Global Marketing at NorthStar. And during his nearly 10 years with IBM, Mr. Engelmann served in a number of development, industry consulting and senior sales positions, including business unit executive of eBusiness Solution Sales and executive operations of the Internet Division. Mr. Engelmann holds a Bachelor of Science in chemical engineering and a Bachelor of Arts in computer science from the University of Wisconsin at Madison.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chairman & CEO","firm":{"name":"EazyBusiness","permalink":"eazybusiness","type_of_entity":"company","image":{"available_sizes":[[[150,26],"assets/images/resized/0008/0545/80545v2-max-150x150.png"],[[250,43],"assets/images/resized/0008/0545/80545v2-max-250x250.png"],[[300,52],"assets/images/resized/0008/0545/80545v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}