{"first_name":"Jeff","last_name":"Brandes","permalink":"jeff-brandes","crunchbase_url":"http://www.crunchbase.com/person/jeff-brandes","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Mar 11 20:02:17 UTC 2008","updated_at":"Tue Mar 11 20:19:07 UTC 2008","overview":"<p>&#8220;Jeff has spent close to 20 years as a serial entrepreneur and executive within the New England high tech community. He joined Mok3 Inc. in March of 2007 after two years as President of Greynose Consulting, an independent consulting practice focused on developing and executing business strategies to take advantage of early stage growth and exit opportunities. He has been an active advisor on matters of strategy, fundraising and M&amp;A activities, as well as held interim sales and business development positions on behalf of his clients. Prior to Greynose, Jeff was President and CEO of TidalWire Inc., a leader in the distribution and sales of storage area networking products,. He led TidalWire&#8217;s 30 month growth phase as revenues climbed from $13M to nearly $50M. During that period, TidalWire was recognized by Inc. Magazine for its outstanding vertical portal for storage networking professionals. In December of 2002 TidalWire was purchased by Network Engines (NENG) where immediately following the acquisition, Jeff became Vice President and General Manager of Distribution Operations and later served as Vice President of Corporate &amp; Business Development. Prior to his work at TidalWire, Jeff co-founded and served as Director of Business Development at WebSpective Software, a content distribution and tracking software company. WebSpective was acquired by Inktomi Corporation (INKT) in 1999. Prior to WebSpective, Jeff held a number of enterprise software senior sales and business development positions. Jeff has a BS in Electrical Engineering from Cornell University.&#8221;</p>\n\n<p>(Source : http://www.everyscape.com/aboutUs.aspx)</p>","image":{"available_sizes":[[[100,136],"assets/images/resized/0001/5326/15326v1-max-150x150.jpg"],[[100,136],"assets/images/resized/0001/5326/15326v1-max-250x250.jpg"],[[100,136],"assets/images/resized/0001/5326/15326v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"VP of Business Development","firm":{"name":"EveryScape","permalink":"everyscape","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0001/5287/15287v1-max-150x150.png"],[[225,51],"assets/images/resized/0001/5287/15287v1-max-250x250.png"],[[225,51],"assets/images/resized/0001/5287/15287v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}