{"first_name":"Jeff","last_name":"Lettes","permalink":"jeff-lettes","crunchbase_url":"http://www.crunchbase.com/person/jeff-lettes","homepage_url":"http://www.globalmediastrategy.com","birthplace":"US","twitter_username":"jeff_lettes","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1957,"born_month":4,"born_day":4,"tag_list":"silicon-valley-public-relations, silicon-valley-corporate-communications, silicon-valley, startups, vc, venture-capital, pr, public-relations, corporate-communications, fortune-500-companies, technology, tech-communications, tech-companies, clean-tech, co","alias_list":null,"created_at":"Wed Aug 29 05:35:19 UTC 2012","updated_at":"Fri Sep 14 21:41:35 UTC 2012","overview":"<p>Jeff Lettes, CEO &amp; Chief Strategy Officer (CSO)</p>\n\n<p>Jeff Lettes is principal of Global Media Strategy Communications, LLC (GSMC), a Silicon Valley PR-Communications firm specializing in startup through Fortune 500 technology  companies. He also serves as communications director of client SVForum and is a member of the Clean Tech Open. Most recently, Jeff launched and directed internal, external, executive and web communications for solar startup OptiSolar. Following OptiSolar’s announcement with PG&amp;E to build the world’s largest Photovoltaic (PV) solar project Jeff established GMSC.</p>\n\n<p>An entrepreneur at heart, he founded GSMC following a 25-year career inside the entertainment industry and some of the world’s leading startups, Fortune 500 companies, and PR agencies, where he developed and implemented high-impact corporate, product and executive-level communications programs.</p>\n\n<p>In addition to managing public relations at various agencies for dozens of technology and professional services clients, Jeff has served as Oracle’s VP of Corporate Communications and Applied Materials’ director of worldwide media relations. He has also directed product PR for Informix’s traditional database and tools.  On the agency side, he has driven communications for such companies as Alliare, ActiveIdentity, Blues Alley, Inc., Chevron, D.C. Government, Ernst &amp; Young Consulting, Oak Technology, and OptiSolar, as well as worked with various performers, entertainment agencies and record companies.</p>","image":{"available_sizes":[[[113,150],"assets/images/resized/0021/0379/210379v2-max-150x150.jpg"],[[189,250],"assets/images/resized/0021/0379/210379v2-max-250x250.jpg"],[[340,450],"assets/images/resized/0021/0379/210379v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}