{"first_name":"Jeffrey","last_name":"Kindler","permalink":"jeffrey-kindler","crunchbase_url":"http://www.crunchbase.com/person/jeffrey-kindler","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 27 07:47:40 UTC 2009","updated_at":"Wed May 27 07:49:35 UTC 2009","overview":"<p>Jeff Kindler is Chairman and Chief Executive Officer of Pfizer, the world’s largest research-based pharmaceutical company. Prior to his appointment as CEO and election to the Board of Directors in 2006, he was Vice Chairman and General Counsel, where he led Pfizer’s worldwide legal, compliance, communications, government relations, corporate citizenship, policy development and global security groups.</p>\n\n<p>He joined Pfizer in 2002 as Executive Vice President and General Counsel, with responsibility for Pfizer’s Legal Division. He was named Vice Chairman in 2005, joining the company’s four-person Executive Committee and assuming responsibility for Pfizer’s Corporate Affairs Division.</p>\n\n<p>Born in Florida and raised in New Jersey, Jeff Kindler earned his BA in 1977 from Tufts University summa cum laude, and his JD in 1980 from Harvard magna cum laude, where he was an editor of the Harvard Law Review. He began his legal career as an attorney at the Federal Communications Commission. He then served as law clerk to Judge David L. Bazelon of the U.S. Court of Appeals of the D.C. Circuit and later served as law clerk to U.S. Supreme Court Justice William J. Brennan, Jr.</p>\n\n<p>He joined the law firm of Williams &amp; Connolly, became a Partner there, and then moved to General Electric as Vice President of Litigation and Legal Policy. He next joined McDonald’s Corporation as Executive Vice President and General Counsel, responsible for both legal and corporate affairs. At McDonald’s, he established a pro bono legal services program that has become a model for many corporations and law firms.</p>\n\n<p>He moved into line management at McDonald’s as President of Partner Brands. This operating unit, with more than 50,000 employees worldwide, included several restaurant brands such as Boston Market, Chipotle Mexican Grill, and Pret a Manger.</p>\n\n<p>During his corporate career, Jeff Kindler has been recognized for his leadership in the areas of pro bono legal services, diversity, and corporate social responsibility by groups ranging from Outward Bound to the Minority Corporate Counsel Association.</p>\n\n<p>He serves on the boards of trustees of Tufts University and Ronald McDonald House Charities, in addition to being a board member of the Manhattan Theatre Club, Lincoln Center for the Performing Arts, and Catalyst, as well as serving as Vice Chairman of the Kennedy Center&#8217;s Corporate Fund and the Chairman of the U.S.-Japan Business Council.</p>","image":{"available_sizes":[[[116,150],"assets/images/resized/0004/5640/45640v1-max-150x150.jpg"],[[126,162],"assets/images/resized/0004/5640/45640v1-max-250x250.jpg"],[[126,162],"assets/images/resized/0004/5640/45640v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO & Chairman of the Board","firm":{"name":"Pfizer Strategic Investments","permalink":"pfizer-strategic-investments","type_of_entity":"financial_org","image":{"available_sizes":[[[82,55],"assets/images/resized/0004/5639/45639v1-max-150x150.png"],[[82,55],"assets/images/resized/0004/5639/45639v1-max-250x250.png"],[[82,55],"assets/images/resized/0004/5639/45639v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}