{"first_name":"Jeffrey","last_name":"Katzenberg","permalink":"jeffrey-katzenberg","crunchbase_url":"http://www.crunchbase.com/person/jeffrey-katzenberg","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Tue Jan 25 05:54:16 UTC 2011","updated_at":"Tue Jan 25 05:54:16 UTC 2011","overview":"<p>Jeffery Katzenberg serves as Principal Partner of DreamWorks L.L.C. Mr. Katzenberg co-founded DreamWorks Animation SKG Inc. and has been its Chief Executive Officer since October 2004. He co-founded and was a principal member of DreamWorks L.L.C. (&#8220;DreamWorks Studios&#8221;) from its founding in October 1994 to its sale to Paramount in January 2006. He co-founded and has been a Principal member of DreamWorks Studios since its founding in October 1994 and serves as its Consultant. </p>\n\n<p>Prior to joining Disney, Mr. Katzenberg served as President of Paramount Studios. He serves as Director and Chairman of Foundation Committee at The Motion Picture and Television Fund. He served as Chairman of The Walt Disney Studios from 1984 to 1994 and was responsible for the worldwide production, marketing and distribution of all Disney filmed entertainment, including motion pictures, television, cable, syndication, home video and interactive entertainment. </p>\n\n<p>Mr. Katzenberg serves as a Director of The Motion Picture and Television Fund, Aids Project Los Angeles, Michael J. Fox Foundation for Parkinson&#8217;s Research, The Museum of Moving Image, Cedars-Sinai Medical Center and The Simon Wiesenthal Center. He serves as a Trustee of California Institute of the Arts. </p>\n\n<p>He served as Trustee at The Motion Picture and Television Fund and served as a Director of Boston University. Mr. Katzenberg is co-chairman of each of the Creative Rights Committee of the Directors Guild of America, and the Committee on the Professional Status ofWriters of the Writers Guild of America.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0011/8844/118844v1-max-150x150.jpg"],[[200,250],"assets/images/resized/0011/8844/118844v1-max-250x250.jpg"],[[240,300],"assets/images/resized/0011/8844/118844v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Board of Directors","firm":{"name":"Zynga","permalink":"zynga","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0000/3187/3187v10-max-150x150.jpg"],[[250,83],"assets/images/resized/0000/3187/3187v10-max-250x250.jpg"],[[275,92],"assets/images/resized/0000/3187/3187v10-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}