{"first_name":"Jeff","last_name":"Caputo","permalink":"jeff-caputo","crunchbase_url":"http://www.crunchbase.com/person/jeff-caputo","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Allied Minds","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Oct 25 05:22:02 UTC 2011","updated_at":"Fri Oct 28 20:18:11 UTC 2011","overview":"<p>Jeff Caputo is a Director of Life Sciences. He brings over 13 years of relevant experience in medical devices, early-stage high tech, and healthcare. Before joining Allied Minds, Jeff spent eight years in sales and marketing management at Aspect Medical Systems, most recently as Manager of Market Development and Strategic Alliances. In this role, he launched and managed products within surgery verticals, managed global strategic alliances with industry leaders such as GE, Philips, and Draeger, and assisted with business development efforts to identify and evaluate synergistic technologies for acquisition. Previously, Jeff was a territory manager within the surgical sales team. Prior to Aspect, Jeff held sales and marketing positions in the internet start-up industry, as well as provided direct patient care in emergency, cardiology, and neurology departments. Jeff&#8217;s education includes a BA in Biology and Psychology from St Olaf College, and an MBA from Boston College with a focus in Venture Capital and Entrepreneurial Management.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Director, Life Sciences","firm":{"name":"Allied Minds","permalink":"allied-minds","type_of_entity":"financial_org","image":{"available_sizes":[[[150,65],"assets/images/resized/0012/8369/128369v5-max-150x150.png"],[[250,108],"assets/images/resized/0012/8369/128369v5-max-250x250.png"],[[450,195],"assets/images/resized/0012/8369/128369v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}