{"first_name":"Jeffrey","last_name":"Beir","permalink":"jeffrey-beir","crunchbase_url":"http://www.crunchbase.com/person/jeffrey-beir","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"North Bridge Venture Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Aug 11 04:46:12 UTC 2007","updated_at":"Mon Nov 24 20:13:25 UTC 2008","overview":"<p>Jeffrey Beir joined North Bridge Venture Partners in 2004, having been an entrepreneur and CEO in the software industry. For more than two decades, Jeffrey has built world-class product teams, created market-leading products and leveraged technology transitions to create market value. Jeffrey was most recently EVP of Products for Documentum, a division of EMC, where he was responsible for the planning, engineering and delivery of their enterprise content management, collaboration and compliance solutions.</p>\n\n<p>Jeffrey was the co-founder and CEO of eRoom Technology which was acquired by Documentum/EMC in December 2002. The acquisition was the largest private software transaction in 2002 with a deal value in excess of $200M. At eRoom, Jeffrey spearheaded the design, development, marketing and sales of the company&#8217;s award-winning, extended enterprise collaboration solutions and grew the company from a PowerPoint presentation into a market leader in the collaboration category with more than 1,000 customers. In 2003, Jeffrey was recognized by Ernst &amp; Young as Entrepreneur of the Year in New England for Information Technology for his efforts at eRoom.</p>\n\n<p>Prior to eRoom, Jeffrey was Senior Vice President of Applications at Lotus Development Corporation, where he led the desktop applications organization and held several other executive management and marketing positions.  Prior to Lotus, Jeffrey held engineering positions at IBM and Xerox.  Jeffrey received his MBA from the Harvard Business School, an MSEE from Syracuse University and a BSEE from Northwestern University.  Jeffrey serves on the Board of Overseers for the Museum of Science in Boston.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Partner","firm":{"name":"North Bridge Venture Partners","permalink":"north-bridge-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,42],"assets/images/resized/0001/0794/10794v1-max-150x150.png"],[[250,70],"assets/images/resized/0001/0794/10794v1-max-250x250.png"],[[257,72],"assets/images/resized/0001/0794/10794v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Advisor","firm":{"name":"BoardProspects","permalink":"boardprospects-2","type_of_entity":"company","image":{"available_sizes":[[[150,14],"assets/images/resized/0017/3703/173703v1-max-150x150.png"],[[250,24],"assets/images/resized/0017/3703/173703v1-max-250x250.png"],[[280,27],"assets/images/resized/0017/3703/173703v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}