{"first_name":"Jennifer","last_name":"Miller","permalink":"jennifer-miller","crunchbase_url":"http://www.crunchbase.com/person/jennifer-miller","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"BeAGoodDoctor.Org","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu May 26 20:39:49 UTC 2011","updated_at":"Wed Jun 20 03:53:40 UTC 2012","overview":"<p>Jennifer founded BeAGoodDoctor.Org in 2002, a non-profit incubator launching new public service-oriented non-profits and projects quickly and vibrantly with the mentored leadership of undergraduates and graduate students from Stanford, Yale, Berkeley, and other universities. </p>\n\n<p>BeAGoodDoctor’s flagship program, S.C.O.P.E. (Student Clinical Opportunities for Premedical Experience), is the largest premedical service learning organization on the west coast pairing undergraduate students directly with attending physicians for every patient encounter.  Students work as interns and interpreters in the Emergency Department of Santa Clara Valley Medical Center, a local county hospital trauma center, to increase quality, efficiency and patient while gaining valuable clinical experience to inform their pursuit of a medical career.  Students come from universities throughout the bay area, including Stanford, Berkeley, San Jose State, San Francisco State, Santa Clara University, and UC Santa Cruz, and meet twice monthly on the Stanford campus to reflect on their experiences.  </p>\n\n<p>Jennifer obtained a Fulbright fellowship to start the Roatan Clinical &amp; Public Health Internship through BeAGoodDoctor.Org in 2004.  Now housed under Global Healing&#8217;s Health Education &amp; Advocacy Liaisons (HEAL) student internship, the program provides advanced undergraduate students with a unique opportunity to experience pediatric medicine and community health at the Roatán Volunteer Pediatric Clinic (RVPC) in Roatán, Honduras. As part of the American and Honduran medical team, student interns play a key role in the daily operations of the RVPC. Outside of clinic, student interns volunteer with local community organizations and/or carry out their own community or public health projects.</p>\n\n<p>The most recent BeAGoodDoctor creation is KaeMe, which means “Remember Me” in Twi, a Ghanaian dialect. Jennifer co-founded KaeMe at the request of Ghana’s National Department of Social Welfare and in a collaboration with bay area venture capitalists.  In 1985 there were 3 known orphanages in Ghana. Now there are over 180. A majority of the children in these orphanages are not true orphans. As well-meaning non-profits from around the world poured in to start their own orphanage, the incoming resources essentially created orphans, in that many resource-poor families sent their children to these orphanages for a “better life.” Most of these orphanages are unregistered, and most of the children are undocumented. There is currently no way for the government to protect the welfare of these undocumented children, and many are sold into slavery or trafficking.  KaeMe is building a new information-age model to promote the best interest of each and every child by leveraging the power of internet and database technology. KaeMe will send over 200 students over the next four years to canvass every orphanage in the country, profiling every child. Along with Ghanaian government social workers and Ghanaian university students, KaeMe students capture essential information about each child’s history, health, and welfare. Video-recorded interviews with each child ensure that they have the opportunity to tell their story, in their own voice. The Department of Social Welfare then uses the resultant multimedia profile database to reunite children with their families or to place them with prospective foster and adoptive families in Ghana and abroad. The department will help good orphanages to register with the government, and will shut down those which are not complying with basic standards.</p>\n\n<p>Other BeAGoodDoctor ventures include The Courage Project, The Happiness Project, and clinical and public health internships in Kathmandu, Nepal and Dharamsala, India.\nJennifer is a resident physician in internal medicine at Stanford Hospital and Clinics.  Her clinical interests lie in geriatrics, where she would like to bring the philosophies of prevention and health promotion into aging medicine to become an expert in turning the brittle years into vibrant ones.  </p>\n\n<p>Jennifer earned her undergraduate degree from Stanford University in Human Biology, focusing on International Health and Development.  She received a Dean of Students Award for Service in 2004 for her leadership of BeAGoodDoctor, and a Fulbright Fellowship in 2005 to the Roatan Clinical and Public Health Internship (now HEAL) in Honduras.  She holds an MD from Stanford University, where she created KaeMe during free time as a preclinical student.</p>\n\n<p>Jennifer’s interests are in the intersection of social entrepreneurism and service-learning education, geriatrics and healthy aging.  She is a bay area native with an enthusiasm for yoga, meditation, frozen yogurt, hiking, teaching, and creating.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0013/7694/137694v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0013/7694/137694v2-max-250x250.jpg"],[[298,450],"assets/images/resized/0013/7694/137694v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.A.","subject":"Human Biology, with a focus in International Health & Development","institution":"Stanford University","graduated_year":2005,"graduated_month":null,"graduated_day":null},{"degree_type":"MD","subject":"Medicine","institution":"Stanford University School of Medicine","graduated_year":2011,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder/President","firm":{"name":"BeAGoodDoctor.Org","permalink":"beagooddoctor-org","type_of_entity":"company","image":null}},{"is_past":false,"title":"Resident Physician","firm":{"name":"Stanford School of Medicine, Department of Internal Medicine","permalink":"stanford-school-of-medicine-department-of-internal-medicine","type_of_entity":"company","image":null}},{"is_past":true,"title":"Co-Founder - USA Exec Director","firm":{"name":"KaeMe","permalink":"kaeme","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/jennifer-miller/b/365/4a5","title":"LinkedIn"},{"external_url":"http://BeAGoodDoctor.Org","title":"BeAGoodDoctor"},{"external_url":"http://www.kaeme.org","title":"KaeMe"},{"external_url":"http://us.fulbrightonline.org/program_students_us_list.html?sc[0]=678&offset=180","title":"US Fulbright Fellowship Program"}]}