{"first_name":"Jennifer","last_name":"O’Daniel","permalink":"jennifer-odaniel","crunchbase_url":"http://www.crunchbase.com/person/jennifer-odaniel","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"CIT GAP Funds","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Nov 18 14:42:09 UTC 2008","updated_at":"Mon Aug 29 12:31:01 UTC 2011","overview":"<p>Jennifer O’Daniel is responsible for sourcing, diligence and closing of seed and early stage investments. O&#8217;Daniel is also responsible for management of the CIT GAP Funds portfolio and CIT’s Entrepreneur Education Programs. Throughout her career, O’Daniel has invested in 43 seed and early-stage companies via CIT GAP Funds which has been recognized by Entrepreneur Magazine&#8217;s Annual VC100 list since 2006. O&#8217;Daniel is an active member of the Young Atlantic Venture Association (YAVA), MIT Enterprise Forum, CFA Society of Washington and the Young Venture Capital Society. In addition to serving on various board of directors for GAP portfolio companies, O’Daniel currently sits on the board of directors for The Venture Forum and has previously servicd on the boards of Leadership Fairfax, Northern Virginia Therapeutic Riding Program, Virginia Tech Business Technology Center, and William and Mary&#8217;s Technology and Business Center. </p>\n\n<p>Prior to joining CIT, O’Daniel worked with the Business/Technology Center in Blacksburg, Virginia spinning-out technology and life science companies from Virginia Tech, writing SBIR proposals, and helping companies raise angel and venture capital. O’Daniel also worked as a financial consultant for SVIT Holding Company in Maribor, Slovenia. She also started and ran two companies while in college. O’Daniel holds a Bachelor of Science in Business Information Technology and a Bachelor of Science in Business Management from Virginia Polytechnic Institute and State University.</p>","image":{"available_sizes":[[[126,150],"assets/images/resized/0002/8821/28821v1-max-150x150.jpg"],[[160,190],"assets/images/resized/0002/8821/28821v1-max-250x250.jpg"],[[160,190],"assets/images/resized/0002/8821/28821v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Investment Associate","firm":{"name":"CIT GAP Funds","permalink":"cit-gap-funds-2","type_of_entity":"financial_org","image":{"available_sizes":[[[150,75],"assets/images/resized/0002/8818/28818v2-max-150x150.png"],[[218,110],"assets/images/resized/0002/8818/28818v2-max-250x250.png"],[[218,110],"assets/images/resized/0002/8818/28818v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}