{"first_name":"Jennifer","last_name":"Washington","permalink":"jennifer-washington","crunchbase_url":"http://www.crunchbase.com/person/jennifer-washington","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Lovetropolis.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jun 18 17:18:10 UTC 2009","updated_at":"Fri Jun 19 19:07:17 UTC 2009","overview":"<p>Provisionally, Jennifer Washington serves as consulting Chief Technology Officer.  Ms. Washington is a senior process engineer for Implement-It, Inc.  She is an experienced technology adviser.  Her firm specializes in helping companies increase productivity, improve services, enhance quality and reduce costs related to information technologies.  Ms. Washington&#8217;s work background includes overseeing technology projects for the Department of Justice, the Defense Information Systems Agency and the Office of the Surgeon General.  Ms. Washington earned her Bachelor&#8217;s degree from Andrews University.  She also holds a Master&#8217;s degree from University of Maryland.</p>\n\n<p>Ms. Washington provides consultation on the following technological matters:  maintaining Lovetropolis.com.&#8217;s technology architecture, networks, programming and media; prioritizing technology initiatives and coordinating the evaluation, deployment and management of current and future technologies; completing cost/benefit analyses for new technology implementations, technology-related investments and resource acquisitions; providing insight and guidance in regards to industry trends and emerging technologies in anticipation of new business processes and system alterations; and analyzing and improving upon technology standards across Lovetropolis.com to maintain a technological and competitive edge within the market.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Technology Officer (Interim)","firm":{"name":"Lovetropolis.com","permalink":"lovetropolis-com","type_of_entity":"company","image":{"available_sizes":[[[150,22],"assets/images/resized/0004/9655/49655v2-max-150x150.png"],[[250,36],"assets/images/resized/0004/9655/49655v2-max-250x250.png"],[[450,66],"assets/images/resized/0004/9655/49655v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}