{"first_name":"Jenn","last_name":"Miller","permalink":"jenn-miller","crunchbase_url":"http://www.crunchbase.com/person/jenn-miller","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Audiosocket","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Apr 27 18:37:57 UTC 2010","updated_at":"Thu May 06 01:43:50 UTC 2010","overview":"<p>Jennifer Miller is President, COO and Partner at Audiosocket.</p>\n\n<p>At age 5, Jennifer Miller (Audiosocket President and COO) was frequently heard on the radio requesting favorite tunes like &#8220;It&#8217;s Still Rock And Roll To Me&#8221; by Billy Joel and &#8220;Call Me&#8221; by Blondie. After graduating from Colgate University, Jenn knew she&#8217;d find a path to her passion and spent the next ten years in Sports and Entertainment, learning the ropes of the business. As Executive Director of a national extreme sports association (WWSRA), she managed and lead all employees, business operations, and hundreds of events nationwide. </p>\n\n<p>After leading the company to profitability, she began plotting her next career move and began scouting talent and providing music clearance services for films on the side. Discovering she was an entrepreneur at heart, Jennifer spent three years working for herself as Founder/ CEO of Pozies, Inc. a handbag company where she designed a signature line of handbags, managing overseas manufacturing and sales. She then launched a successful multimedia consulting agency where she developed a software service for sales and events, managed music licensing and clearance, and talent buying for events. This ultimately led her to pursue the business she was most passionate about- music. 2007 led her to her business partner Brent McCrossen, and together they partnered up to develop the vision for Audiosocket. The last three years she has spent building the foundation, the team, the roster and the tool to deliver quality music in a simple, hassle free way. Coupling her entrepreneurial successes and leadership experience with her innovation and passion for music, Jennifer has become an accomplished leader&#8230; and closet singer.</p>","image":{"available_sizes":[[[128,130],"assets/images/resized/0008/6093/86093v2-max-150x150.png"],[[128,130],"assets/images/resized/0008/6093/86093v2-max-250x250.png"],[[128,130],"assets/images/resized/0008/6093/86093v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"COO, Founder","firm":{"name":"Audiosocket","permalink":"audiosocket","type_of_entity":"company","image":{"available_sizes":[[[150,75],"assets/images/resized/0008/5105/85105v2-max-150x150.jpg"],[[250,125],"assets/images/resized/0008/5105/85105v2-max-250x250.jpg"],[[450,225],"assets/images/resized/0008/5105/85105v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/jenn-anderson-miller/2/368/50","title":"LinkedIn"}]}