{"first_name":"Jennifer","last_name":"Johnson","permalink":"jennifer-johnson-2","crunchbase_url":"http://www.crunchbase.com/person/jennifer-johnson-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Jul 01 23:17:39 UTC 2012","updated_at":"Mon Jul 02 16:16:00 UTC 2012","overview":"<p>Ms. Jennifer M. Johnson is an Executive Vice President of Operations and Technology, Chief Information Officer, Chief Operating Officer, Chief Investment Officer, Officer of Finance and Administration and Member of Executive Committee at Franklin Resources Inc. She has been Chief Investment Officer and Officer of Finance and Administration since December 2005 and Chief Operating Officer since March 16, 2010. Ms. Johnson is employed at Franklin Resources, Inc. or subsidiaries in various capacities for the past eight years. As the Chief Information Officer, she has global responsibilities for software development and implementation, infrastructure and systems support, and telecommunications. Ms. Johnson was a Senior Vice President from May 15, 2003 to December 2005. She was a Vice President at Franklin Resources since June 1994. Ms. Johnson launched Franklin Capital Corporation, where she was the President from 1993 to 1999. Ms. Bolt was also instrumental to the creation of AdvisorCentral.com. She is the Chairman of Franklin Templeton Bank and Trust and Franklin Capital Corporation. Ms. Johnson has been a Director at Keynote Systems, Inc. since April 2004. She is a Member of Advisory Board of Rigel Associates, LLC. Ms. Johnson served as a Director of Templeton Global Advisors Limited. She has been a Director of Templeton Global Growth Fund Ltd., since September 9, 2007. Ms. Johnson is a Director of Juvenile Diabetes Research Foundation. She was named the “E-commerce Executive of the Year” in 2002 by Fund Action. Ms. Johnson is a graduate of the American Banker&#8217;s Association&#8217;s Stonier Graduate School of Banking and has also earned a B.A. degree in Economics and Physical Education from the University of California at Davis.</p>","image":null,"degrees":[],"relationships":[],"investments":[{"funding_round":{"round_code":"angel","source_url":"","source_description":"","raised_amount":null,"raised_currency_code":"USD","funded_year":2012,"funded_month":1,"funded_day":1,"company":{"name":"Daric","permalink":"daric","image":{"available_sizes":[[[138,150],"assets/images/resized/0019/8201/198201v2-max-150x150.jpg"],[[231,250],"assets/images/resized/0019/8201/198201v2-max-250x250.jpg"],[[360,389],"assets/images/resized/0019/8201/198201v2-max-450x450.jpg"]],"attribution":null}}}}],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}