{"first_name":"Jeremiah","last_name":"Jacquet","permalink":"jeremiah-jacquet","crunchbase_url":"http://www.crunchbase.com/person/jeremiah-jacquet","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"xWeed","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jan 07 08:49:44 UTC 2011","updated_at":"Fri Sep 28 22:50:05 UTC 2012","overview":"<p>Jeremiah comes from a long line of video gaming stemming from Colecovision all the way up to Bad Company&#8217;s FPS on the xBox. He was raised by machines and programmed by humans. This combination along with an inquisitive mind enabled him to reverse-engineer testing harnesses for the iOS and Android platforms creating a new dawn in the industry he&#8217;s coined &#8220;the mobile automation generation&#8221;. Ah yes, automation for mobile phones you ask?  He also is the Director of automation for a leading mobile development house called www.lolay.com.  His new discovery using the latest in Java technology enabled him to be first to market with an all open source approach that automates anything you can put on the screen! No hooks required here Mr. Developer, say hello to my little friend Sikuli and good by to your higher archery element naming.</p>\n\n<p>Jeremiah has had other internet start ups in the past which will not be mentioned here, but if not for the failures there would be no success. Jeremiah treats his learning through life like he&#8217;s treated his video games, if you don&#8217;t pass the level try again, and again, and again until your brain hurts then try again until you reach victory and the final credits roll!(just remember to save your last check point) </p>\n\n<p>Jeremiah has worked for many large companies throughout the mobile tech sectors. He has and still does work with some of the top notch industry insiders from infrastructure, programming, biz-dev, all the way to the QA soaking up information you cant pay for in school or in books. His mentors  still surround him, and now he exudes his talents in the form of mobile automation. </p>\n\n<p>Closely watch this one as he promises big moves on the 2013 front with heavy focus in the mobile space. Currently his  clients are reaping the mobile automation benefits as you read this. He understands the technology is getting smaller and has a keen insight as to what the industry needs will be now and in the near future.</p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0012/1961/121961v4-max-150x150.jpg"],[[250,166],"assets/images/resized/0012/1961/121961v4-max-250x250.jpg"],[[250,166],"assets/images/resized/0012/1961/121961v4-max-450x450.jpg"]],"attribution":"<p>Jeremiah Jacquet / <a href=\"http://www.xweed.com\" title=\"xWeed\" rel=\"nofollow\">xWeed</a></p>"},"degrees":[{"degree_type":"","subject":"Computer Science","institution":"SMC","graduated_year":1996,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Automator","firm":{"name":"xWeed","permalink":"xweed","type_of_entity":"company","image":{"available_sizes":[[[150,25],"assets/images/resized/0011/6456/116456v2-max-150x150.png"],[[250,41],"assets/images/resized/0011/6456/116456v2-max-250x250.png"],[[300,50],"assets/images/resized/0011/6456/116456v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}