{"first_name":"Jeremy","last_name":"Archuleta","permalink":"jeremy-archuleta","crunchbase_url":"http://www.crunchbase.com/person/jeremy-archuleta","homepage_url":"http://www.seqcentral.com","birthplace":"","twitter_username":"seqcentral","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Aug 08 23:39:03 UTC 2010","updated_at":"Wed May 04 01:14:09 UTC 2011","overview":"<p>Jeremy Archuleta, co-founder of SeqCentral, LLC, is an expert in high-performance computing (HPC) for large-scale scientific applications. His diverse background in technology coupled with first-hand experience alongside scientists provides a unique ability to bring usable HPC to computational biology and genetics.</p>\n\n<p>He received a bachelor of science degree in electrical engineering and computer science from the University of California, Berkeley. After brief stints aiding chemical engineers and seismologists at the University of California, Santa Barbara, he began a two-year internship at Los Alamos National Laboratory where he was introduced to large-scale bioinformatics. Following a master of science degree in computer science from the University of Utah, Jeremy moved to Virginia where he was awarded a Doctoral Scholars Fellowship offered by the Institute of Critical Technology and Applied Science at Virginia Polytechnic Institute and State University (Virginia Tech).</p>\n\n<p>Since 2003, Jeremy has contributed significantly to the open-source mpiBLAST project and has more than a dozen refereed contributions at top-tier conferences including &#8220;A Maintainable Software Architecture for Fast and Modular Bioinformatics Sequence Search&#8221;; &#8220;Multi-Dimensional Characterization of Temporal Data Mining on Graphics Processors&#8221;; and &#8220;Parallel Genomic Sequence-Searching on an Ad-Hoc Grid: Experiences, Lessons Learned, and Implications,&#8221; a best paper nominee. He was also a mentor to the 2008 and 2009 winners of the ACM Undergraduate Student Research Competition at the ACM/IEEE Supercomputing Conference.</p>\n\n<p>Currently, he is on leave from Virginia Tech in order to bring cloud computing to sequence search and establish SeqCentral, LLC, as the preeminent &#8220;central searching station&#8221; for computational genomics.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"SeqCentral","permalink":"seqcentral","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0009/6611/96611v2-max-150x150.jpg"],[[250,74],"assets/images/resized/0009/6611/96611v2-max-250x250.jpg"],[[274,82],"assets/images/resized/0009/6611/96611v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}