{"first_name":"Jeremy","last_name":"Blackburn","permalink":"jeremy-blackburn","crunchbase_url":"http://www.crunchbase.com/person/jeremy-blackburn","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Canopy Financial","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Nov 24 09:50:08 UTC 2009","updated_at":"Tue Mar 08 07:21:27 UTC 2011","overview":"<p>Jeremy Blackburn serves as the President and Chief Operating Officer of Canopy Financial Inc. </p>\n\n<p>CHICAGO — Two former executives of the bankrupt health care company Canopy Financial Inc. were charged Monday with swindling investors out of $75 million and illegally pocketing $19 million from accounts that were supposed to pay the medical bills of individuals nationwide.</p>\n\n<p>Canopy&#8217;s former president and chief operating officer, Jeremy Blackburn, 36, formerly of Malibu, Calif., had already been charged in a criminal complaint filed in December with operating a $60 million fraud. He was released on a $1 million bond.</p>\n\n<p>A criminal information filed by federal prosecutors on Monday said the amount of fraud discovered by federal investigators had grown to $75 million. Also Monday, the government charged Canopy&#8217;s chief technology officer, Anthony Banas, 32, of Chicago, with taking part in massive fraud.</p>\n\n<p>The Chicago-based company was known as one of the nation&#8217;s fastest growing businesses before it entered bankruptcy last November. Both executives were charged with two counts of wire fraud punishable by up to 20 years in prison and up to $250,000 in fines.</p>\n\n<p>The government has asked the court to order the two men to forfeit $94 million plus watches and automobiles if they are convicted.</p>\n\n<p>The documents filed Monday also said the two men had misappropriated some $19 million from health savings accounts and flexible spending accounts Canopy held and administered for individual clients.</p>\n\n<p>Blackburn spent $2 million on a share in a private jet and paid $1 million to a luxury car dealer and another $1 million to a ticket broker, the charges said. Banas invested $300,000 in a nightclub, they said.</p>\n\n<p>Blackburn&#8217;s defense attorney, Ted Poulos, declined to comment on the charges. Banas&#8217; attorney, Royal B. Martin, did not immediately return a message left at his law office.</p>\n\n<p>The problems at Canopy surfaced last fall when the company went into bankruptcy and came as a shock to those who relied on the health care accounts to pay their medical bills. The accounts were frozen last fall. The U.S. attorney&#8217;s office said it would be sending victim notification letters to 1,600 people identified as victims so far.</p>\n\n<p>Mr. Blackburn is a recognized thought leader in the field of healthcare financial services through a deep background in the delivery of decision support and advanced analytic technologies to the healthcare and retail financial services industries. Prior to joining Canopy Financial in 2004, Mr. Blackburn served as a division Chief Executive Officer for a UnitedHealth Group (NYSE: UNH) advanced technology business focused on decision support technologies for payers, providers, and employers. Prior to UnitedHealth Group, Mr. Blackburn served as Vice President of Global Professional Services for Fair Isaac Corporation (NYSE: FIC) where, he led the development and implementation of Fair Isaac&#8217;s industry leading scoring, advanced analytic and enterprise decision management technologies for the world&#8217;s largest financial institutions. Mr. Blackburn has also consulted to several Global 1000 companies on matters of business and operational strategy as a management consultant for Andersen Consulting. He serves as a Director of Canopy Financial Inc. Mr. Blackburn holds an MBA from the University of Chicago Graduate School of Business.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Cofounder","firm":{"name":"Canopy Financial","permalink":"canopy-financial","type_of_entity":"company","image":{"available_sizes":[[[150,56],"assets/images/resized/0004/8758/48758v1-max-150x150.png"],[[250,95],"assets/images/resized/0004/8758/48758v1-max-250x250.png"],[[250,95],"assets/images/resized/0004/8758/48758v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}