{"first_name":"Jeremy","last_name":"Rifkin","permalink":"jeremy-rifkin-2","crunchbase_url":"http://www.crunchbase.com/person/jeremy-rifkin-2","homepage_url":"http://foet.org","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Thu Oct 06 20:09:14 UTC 2011","updated_at":"Thu Oct 06 20:09:14 UTC 2011","overview":"<p>Jeremy Rifkin is president of the Foundation on Economic Trends and the author of seventeen bestselling books on the impact of scientific and technological changes on the economy, the workforce, society, and the environment. His books have been translated into more than thirty languages and are used in hundreds of universities, corporations and government agencies around the world. His most recent books include The Hydrogen Economy, The European Dream, The End of Work, The Age of Access, and The Biotech Century.</p>\n\n<p>Jeremy Rifkin has been an advisor to the European Union for the past decade. Mr. Rifkin advised the government of Spain during its presidency of the European Union (January 1st – June 30, 2010). Mr. Rifkin also served as an adviser to President Nicolas Sarkozy of France, Chancellor Angela Merkel of Germany, Prime Minister Jose Socrates of Portugal, and Prime Minister Janez Janša of Slovenia, during their respective European Council Presidencies, on issues related to the economy, climate change, and energy security. He currently advises the European Commission, the European Parliament, and several EU heads of state, including Chancellor Angela Merkel of Germany and Prime Minister Jose Luis Rodriguez.</p>\n\n<p>Mr. Rifkin is the principle architect of the European Union&#8217;s Third Industrial Revolution long-term economic sustainability plan to address the triple challenge of the global economic crisis, energy security, and climate change. The Third Industrial Revolution was formally endorsed by the European Parliament in 2007 and is now being implemented by various agencies within the European Commission as well as in the 27 member-states.</p>\n\n<p>Mr. Rifkin is also the founder and chairperson of the Third Industrial Revolution Global CEO Business Roundtable, comprised of 100 of the world&#8217;s leading renewable energy companies, construction companies, architectural firms, real estate companies, IT companies, power and utility companies, and transport and logistics companies. Mr. Rifkin&#8217;s global economic development team is the largest of its kind in the world and is working with cities, regions, and national governments to develop master plans to transition their economies into post-carbon Third Industrial Revolution infrastructures.</p>\n\n<p>Since 1994, Mr. Rifkin has been a senior lecturer at the Wharton School&#8217;s Executive Education Program at the University of Pennsylvania — the world&#8217;s #1 ranked business school— where he instructs CEOs and senior management on transitioning their business operations into sustainable Third Industrial Revolution economies.</p>\n\n<p>Mr. Rifkin&#8217;s monthly column on global issues appears in many of the world&#8217;s leading newspapers and magazines, including The Los Angeles Times in the United States, The Guardian in the U.K., Die Süddeutsche Zeitung and Handelsblatt in Germany, Le Soir and Knack in Belgium, L&#8217;Espresso in Italy, El Mundo and El País in Spain, Kathimerini in Greece, Informatíon in Denmark, De Volkskrant in the Netherlands, Hospodárské Noviny in the Czech Republic, Wort in Luxembourg, Eesti Päevaleht in Estonia, Trud in Bulgaria, Clarín in Argentina, and Al-Ittihad in the U.A.E.</p>\n\n<p>Rifkin has been influential in shaping public policy in the United States and around the world. He has testified before numerous congressional committees and has had consistent success in litigation to ensure responsible government policies on a variety of environmental, scientific and technology related issues.</p>\n\n<p>He has been a frequent guest on numerous television programs, including Face the Nation, The Lehrer News Hour, 20/20, Larry King Live, Today, and Good Morning America. The National Journal named Rifkin as one of 150 people in the U.S. that have the most influence in shaping federal government policy.</p>\n\n<p>Mr. Rifkin holds a degree in economics from the Wharton School of the University of Pennsylvania, and a degree in international affairs from the Fletcher School of Law and Diplomacy at Tufts University. Rifkin speaks frequently before government, business, labor and civic forums. He has lectured at hundreds of the world&#8217;s leading corporations as well as more than 200 universities in some 30 countries in the past 30 years.</p>\n\n<p>Mr. Rifkin is the founder and president of The Foundation on Economic Trends (www.foet.org) in Bethesda, MD. The Foundation examines the economic, environmental, social and cultural impacts of new technologies introduced into the global economy.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0015/7093/157093v1-max-150x150.jpg"],[[188,188],"assets/images/resized/0015/7093/157093v1-max-250x250.jpg"],[[188,188],"assets/images/resized/0015/7093/157093v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}