{"first_name":"Jered","last_name":"Noonan","permalink":"jered-noonan","crunchbase_url":"http://www.crunchbase.com/person/jered-noonan","homepage_url":"http://www.absolutetoday.com","birthplace":"Dubuque, IA","twitter_username":"absolutetoday","blog_url":"http://blog.absolutetoday.com","blog_feed_url":"http://www.absolutetoday.com/blogengine/syndication.axd?format=rss","affiliation_name":"Unaffiliated","born_year":1978,"born_month":7,"born_day":4,"tag_list":"coo, chief-operating-officer, marketing, email-marketing","alias_list":null,"created_at":"Wed Sep 15 23:52:41 UTC 2010","updated_at":"Thu Sep 23 03:14:49 UTC 2010","overview":"<p>Jered is the Chief Operating Officer for Absolute Today where he is responsible for the daily operation of the company.  Additionally, Jered is responsible for the development, design, operation, and improvement of the systems that create and deliver Absolute Today&#8217;s products. Jered is responsible for ensuring that business operations are efficient and effective and that the proper management of resources, distribution of goods and services to customers, and analysis of queue systems is done.  By doing so, Absolute Today has the necessary strengths to provide unique and cost effective marketing opportunities to nearly all industries.</p>\n\n<p>Jered graduated from Loras College, in Dubuque, IA with majors in Political Science and International Studies. In the business world, he cut his teeth in telemarketing and later shifted into the realm of marketing and business consulting, where he provided leading-edge information and assistance to small and medium sized organizations in both the private and public sectors, non-profits, educational systems and government agencies. Jered was able to assist these organizations in the areas of lead generation and creation, market analysis, market growth strategies, problem solving, process control, public relations, and strategic planning. Jered&#8217;s spare time is consumed by his two rambunctious children, volunteering with various community and political organizations and absorbing as much live music as he can.</p>","image":null,"degrees":[{"degree_type":"BA","subject":"Political Science, International Studies","institution":"Loras College","graduated_year":2006,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/absolutetoday","title":"Twitter"}]}