{"first_name":"Jeremy","last_name":"Pemble","permalink":"jeremy-pemble","crunchbase_url":"http://www.crunchbase.com/person/jeremy-pemble","homepage_url":"http://www.jlmpartners.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1972,"born_month":null,"born_day":null,"tag_list":"att, realnetworks, siemens, nortel","alias_list":null,"created_at":"Fri May 13 19:58:29 UTC 2011","updated_at":"Mon May 16 02:25:58 UTC 2011","overview":"<p>Jeremy Pemble is the Senior Vice President at JLM Partners.  JLM is a corporate communications and strategic consulting firm serving clients in the cable, wireless, consumer electronics, and digital media sectors. Over the years, JLM&#8217;s team has advised a wide range of clients including Amazon.com, Cisco, C-COR, Clearwire, HBO, MTV, Motorola, NDS, RealNetworks, thePlatform (Comcast&#8217;s online video subsidiary), and numerous others at the forefront of technology.</p>\n\n<p>Prior to joining JLM Partners, Jeremy spent six years at AT&amp;T Wireless in a variety of increasingly senior communications roles, and at age 31, was appointed one the company&#8217;s youngest Vice Presidents. Most recently, he served as Vice President of Public Relations for the AT&amp;T Wireless&#8217; advanced services division (Mobile Multimedia Services). In this capacity, he oversaw all communications efforts for the company&#8217;s wireless data initiatives. Some of his major PR activities included: the company&#8217;s launch of new data networks; picture and video messaging; voice recognition services; ringtones &amp; graphics; mobile gaming; mobile television; location-based services; mobile portal content (mMode); wireless email; enterprise wireless data applications; and strategic relationships with AOL, Disney, DaimlerChrysler, IBM, Intel, Microsoft, NTT DoCoMo, Yahoo and many others. </p>\n\n<p>Mr. Pemble also created and managed all of the company&#8217;s public relations efforts for the hit show, &#8220;American Idol,&#8221; which is widely credited as the seminal event that popularized text messaging in the United States.</p>\n\n<p>Immediately prior to joining JLM, he served as Vice President of Corporate Communications for RealNetworks (Nasdaq: RNWK).  As Vice President, he led the company&#8217;s worldwide communications strategy for all public relations activities including corporate, broadband, mobile, music and games. During his tenure at Real, he managed the communications for company earnings; the $760 million settlement and partnership with Microsoft; the introduction of the new Rhapsody digital music service; the company&#8217;s expansion into mobile services with Cingular, O2, and Sprint; the acquisition of a wireless games company; company earnings; and consumer-centric PR events such as free public concerts featuring multi-platinum recording artists Good Charlotte and the Foo Fighters.</p>\n\n<p>Prior to his national role at AT&amp;T Wireless, he was responsible for leading the local public relations activities of AT&amp;T Wireless in the Midwest.  Before joining AT&amp;T Wireless, he managed the government and industry relations program for Siemens Wireless Terminals.  He began his career in Dallas, Texas with Nortel Wireless Networks serving in a variety of marketing communications positions.  He also served as a Public Affairs Officer in the United States Coast Guard Reserve where he gained invaluable experience in crisis communications.</p>\n\n<p>Mr. Pemble earned a bachelor&#8217;s degree (B.A.) in Honors Asian Studies from the University of Texas at Austin where he was named Outstanding Male Student of the Year in 1994.  He holds a master&#8217;s degree (M.L.A) in interdisciplinary studies from Southern Methodist University, and a second master&#8217;s degree (M.Ed.) in Education Administration, Planning, and Social Policy from Harvard University. </p>","image":null,"degrees":[{"degree_type":"M.Ed.","subject":"Education Administration, Planning, and Social Policy","institution":"Harvard University","graduated_year":1999,"graduated_month":null,"graduated_day":null},{"degree_type":"M.L.A.","subject":"Interdisciplinary Studies","institution":"SMU","graduated_year":1996,"graduated_month":null,"graduated_day":null},{"degree_type":"B.A.","subject":"Honors Asian Studies","institution":"University of Texas at Austin","graduated_year":1994,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com","title":""}]}