{"first_name":"Jerome","last_name":"York","permalink":"jerome-york","crunchbase_url":"http://www.crunchbase.com/person/jerome-york","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"MyPublisher","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Nov 29 13:37:50 UTC 2007","updated_at":"Thu Mar 18 16:22:36 UTC 2010","overview":"<p>Jerome (Jerry) York is Chief Executive Officer of Harwinton Capital Corporation,a private investment company he founded in 2000. Harwinton Capital‘s principal investments are in the cosmetics, technology, biotechnology, wine distribution and real estate sectors.</p>\n\n<p>From 2000 to mid-2003 he was Chief Executive Officer of Micro Warehouse, a multi-national reseller of computer hardware, software and peripheral products.</p>\n\n<p>From 1995 to 1999 he was Vice Chairman of Tracinda Corporation, the private investment company owned by Mr.Kirk Kerkorian, with major investments in the automotive, filmed entertainment and gaming industries.</p>\n\n<p>Before joining Tracinda, he was Senior Vice President and Chief Financial Officer and a member of the Board of Directors of IBM Corporation, joining IBM in 1993 shortly after Mr. Louis Gerstner became its Chief Executive Officer.</p>\n\n<p>Prior to IBM, he spent fourteen years at Chrysler Corporation, rising through a series of positions, including heading up Chrysler‘s Mexican Operations, Manufacturing Engineering Operations, Truck Operations, the Dodge Division, and becoming Executive Vice President and Chief Financial Officer and a member of the Board of Directors in 1990.</p>\n\n<p>Previously, he was Group Vice President of Baker Industries,with responsibility for the Wells Fargo-branded Alarm, ArmoredCar and Guard Services Divisions, and prior to that was Vice President Operations of the Hertz Corporation‘s Truck Rental and Leasing Division.</p>\n\n<p>From 1963 to 1967, he was an engineer with General Motors Corporation, initially in the Power Development Group at the GM Engineering Staff, and subsequently at the Pontiac Motor Division. He then spent three years at the Ford Motor Company, holding a number of positions in the Car Product Planning Office - ultimately having responsibility for the long range planning for all Ford, Mercury and Lincoln passenger car platforms.</p>\n\n<p>Mr.York holds a B.S.degree from the U.S.Military Academy, an M.S.degree from the Massachusetts Institute of Technology and an M.B.A.degree from the University of Michigan.</p>\n\n<p>He is also a Registered Professional Engineer in the state of Michigan.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0008/0859/80859v1-max-150x150.jpg"],[[250,250],"assets/images/resized/0008/0859/80859v1-max-250x250.jpg"],[[250,250],"assets/images/resized/0008/0859/80859v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[{"funding_round":{"round_code":"b","source_url":"http://venturebeat.com/2007/09/06/mypublisher-provider-of-photo-books-raises-89m/","source_description":"MyPublisher, provider of photo books, raises $8.9M.","raised_amount":8900000,"raised_currency_code":"USD","funded_year":2007,"funded_month":9,"funded_day":1,"company":{"name":"MyPublisher","permalink":"mypublisher","image":{"available_sizes":[[[150,81],"assets/images/resized/0002/0653/20653v2-max-150x150.jpg"],[[189,103],"assets/images/resized/0002/0653/20653v2-max-250x250.jpg"],[[189,103],"assets/images/resized/0002/0653/20653v2-max-450x450.jpg"]],"attribution":null}}}}],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}