{"first_name":"Jerry","last_name":"M. Kennelly","permalink":"jerry-m-kennelly","crunchbase_url":"http://www.crunchbase.com/person/jerry-m-kennelly","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Riverbed Technology","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jan 27 04:22:47 UTC 2009","updated_at":"Sun Apr 12 03:17:46 UTC 2009","overview":"<p>Jerry M. Kennelly co-founded our company in May 2002 and serves as chairman of our board of directors and as our President and Chief Executive Officer. Immediately prior to founding our company, Mr. Kennelly spent six years at Inktomi Corporation, an infrastructure software company, where he served as Executive Vice President, Chief Financial Officer and Secretary. From June 1990 until joining Inktomi in October 1996, Mr. Kennelly worked for Sybase, Inc., an infrastructure software company, in a number of senior financial and operational positions, most recently as Vice President of Corporate Finance. From November 1988 until June 1990, Mr. Kennelly worked at Oracle Corporation as finance director for US Operations. From June 1980 until November 1988, Mr. Kennelly worked at Hewlett-Packard Company as Worldwide Sales and Marketing Controller for the Tandem Computers Division. Mr. Kennelly holds a Bachelor’s degree from Williams College and a Masters degree from the New York University Graduate School of Business Administration.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chairman & CEO","firm":{"name":"Riverbed Technology","permalink":"riverbed-technology","type_of_entity":"company","image":{"available_sizes":[[[150,26],"assets/images/resized/0003/4789/34789v2-max-150x150.png"],[[229,41],"assets/images/resized/0003/4789/34789v2-max-250x250.png"],[[229,41],"assets/images/resized/0003/4789/34789v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}