{"first_name":"Jerry","last_name":"Cosgrove","permalink":"jerry-cosgrove","crunchbase_url":"http://www.crunchbase.com/person/jerry-cosgrove","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jul 16 10:09:52 UTC 2012","updated_at":"Mon Jul 16 21:00:23 UTC 2012","overview":"<p>Jerry Cosgrove</p>\n\n<p>Jerry Cosgrove knows the importance of conservation is now only being realized as the lands that were once used for sustainable framing are disappearing. These lands are now falling prey to improper methods of agriculture as well as a growing dependency on chemicals and synthetic fertilizers. Jerry is a man on a mission to change all of that. A man driven by a passion for helping the land regain its dignity and beauty, he specializes in land conservation and sustainable agriculture. </p>\n\n<p>Jerry advocates a dynamic approach to agricultural development, incorporating many traditional methods of conservative and organic agriculture. He melds these with more modern and effective methods that help in the overall yield and productivity of farmland. His field of expertise extends to the education of achieving the best results in the use of farmland. He enthusiastically advocates for the awareness for conservation and constructive farming for the benefit of both the farm owners and the community as a whole. </p>\n\n<p>Jerry Cosgrove believes promoting the benefits of localized agriculture as a means to affordably produce for the whole community. He enjoys doing this to attempt to help local farmers earn more as local communities save more and eat better. A leading expert in many aspects of agriculture, Jerry believes in the melding of technology and age-old methods of farming for better results. And he believes this is possible without the added dependency on chemicals and synthetics that saturate most of the agricultural world today. </p>\n\n<p>Jerry also believes that a more wholesome approach to agriculture ensures future generations of arable land. This also produces safer and more natural foods for consumption. This synergistic approach to agriculture also ensures that less waste is produced and more wholesome produce is developed. The positive effects also from this farming approach are that the land that is used for the production of food is not stripped bare of its life-giving properties.</p>\n\n<p>Many methods of agriculture that is being practiced nowadays have a tendency to slowly poison the land. And often encroach in areas that are essential to the preservation of flora and fauna that are endemic to a specific area or region. </p>\n\n<p>Jerry says that agriculture should work within a framework of balance between man and nature for the betterment of both. His unique agricultural methods are here to educate individuals on the proper process of wholesome farming. Giving families good, healthy, wholesome food, and the local community is important to Jerry Cosgrove and he means to help farmers have a sustainable and dependable income for generations to come. </p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0020/1140/201140v2-max-150x150.jpg"],[[250,167],"assets/images/resized/0020/1140/201140v2-max-250x250.jpg"],[[450,301],"assets/images/resized/0020/1140/201140v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}