{"first_name":"Jesse","last_name":"Forrest","permalink":"jesse-forrest-2","crunchbase_url":"http://www.crunchbase.com/person/jesse-forrest-2","homepage_url":"http://www.findsportsnow.com","birthplace":"Fort Lauderdale, FL","twitter_username":"","blog_url":"http://www.findsportsnow.com/blog","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1983,"born_month":9,"born_day":2,"tag_list":"jesse-forrest, findsportsnow, joimo, cto, co-founder","alias_list":null,"created_at":"Tue Aug 14 23:32:16 UTC 2012","updated_at":"Fri Oct 05 23:04:06 UTC 2012","overview":"<p>Jesse Forrest is Co-Founder &amp; CTO at FindSportsNow.  In this role, Jesse oversees development on the FindSportsNow platform, which includes both software development and hardware infrastructure. He also serves as Co-Founder &amp; CTO at Joimo, a national organization that offers sports and recreational activities to the community. He previously served as a technical lead at Sometrics, which was acquired by American Express in September 2011. </p>\n\n<p>With years of experience working with web-based technologies, Forrest established FindSportsNow to help event coordinators easily promote their events and activities. The company&#8217;s platform additionally allows coordinators to accept payments online via FindSportsNow&#8217;s Online Registration System. </p>\n\n<p>Under Forrest&#8217;s leadership, FindSportsNow launched the industry&#8217;s first in-page online registration platform.  Event coordinators are able to put one snippet of code on their website and they can have a fully functional online registration window on their site.  Their participants never need to leave their website to sign up for their events and activities. </p>\n\n<p>In the first year of launch, the FindSportsNow&#8217;s Online Registration System successfully transacted over a quarter million USD. Jesse is helping FindSportsNow break into new territory by focusing the technology on more eccentric activities, ranging from Archery to Zip Lining.</p>\n\n<p>Prior to the launch of FindSportsNow and the acquisition of Sometrics by American Express, Forrest was a software developer with a top-secret security clearance for Northrop Grumman Corporation.  He was instrumental at developing AJAX web applications that could help assist in automated code generation.</p>\n\n<p>Forrest often advises startups with their technology related issues.</p>","image":{"available_sizes":[[[111,150],"assets/images/resized/0020/6108/206108v2-max-150x150.jpg"],[[185,250],"assets/images/resized/0020/6108/206108v2-max-250x250.jpg"],[[200,269],"assets/images/resized/0020/6108/206108v2-max-450x450.jpg"]],"attribution":"<p>Jesse Forrest / <a href=\"http://www.findsportsnow.com\" title=\"FindSportsNow\" rel=\"nofollow\">FindSportsNow</a></p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://jesseforrest.name","title":"Jesse Forrest"}]}