{"first_name":"Jessica","last_name":"Owens","permalink":"jessica-owens","crunchbase_url":"http://www.crunchbase.com/person/jessica-owens","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 28 17:13:51 UTC 2008","updated_at":"Thu May 29 00:14:31 UTC 2008","overview":"<p>Jessica Owens joined Kleiner Perkins Caufield &amp; Byers in 2006. Jessica focuses on investments in consumer medicine, biotech, and diagnostics. Since joining the firm, she has worked across KPCB’s initiatives in life sciences and pandemic preparedness. Jessica has been instrumental in the founding of five start-up companies in the areas of antivirals, oncology, consumer medicine, neuromodulation, and diagnostics.</p>\n\n<p>Jessica brings a diversity of experience from positions on Wall Street, in the biotech industry, and in scientific research. Previously, Jessica worked in equity research at Thomas Weisel Partners covering the diagnostics sector. She also worked in corporate finance as part of the life sciences investment banking team at Robertson Stephens. In addition, Jessica worked in Oncology R&amp;D Project Finance at Genentech. As a scientist, Jessica conducted research for four years at the Centers for Disease Control and Prevention in the Special Pathogens Branch. Her work resulted in the discovery of genetic shift among Hantavirus strains. She also developed PCR-based diagnostic assays for the detection of rare infectious diseases. At Stanford, Jessica conducted research in the Department of Cancer Biology on tumor suppressor genes and cell cycle checkpoint proteins.</p>\n\n<p>Jessica serves on the Cleveland Clinic Foundation Industrial Advisory Board and is a member of the twelfth class of the Kauffman Fellows Program. She received an MBA from Harvard Business School, an MS from the Department of Cancer Biology at Stanford University, and a BA in Biology from Agnes Scott College.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Kleiner Perkins Caufield & Byers","permalink":"kleiner-perkins-caufield-byers","type_of_entity":"financial_org","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/0998/10998v8-max-150x150.jpg"],[[250,250],"assets/images/resized/0001/0998/10998v8-max-250x250.jpg"],[[450,450],"assets/images/resized/0001/0998/10998v8-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}