{"first_name":"Jesús","last_name":"Martin-Garcia","permalink":"jess-martin-garcia","crunchbase_url":"http://www.crunchbase.com/person/jess-martin-garcia","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 09 09:51:56 UTC 2009","updated_at":"Tue Jun 09 10:00:29 UTC 2009","overview":"<p>Jesús has a MS in Economics and a Lic Iur from University of Geneva, and an MBA from Harvard Business School.  He started a consulting career at McKinsey &amp; Co. focusing on Pharma and Food industries. In 1993, he was the Founding Partner of Value Management Group (VMG), a consulting boutique dedicated to knowledge-intensive industries such as ICT. Jesús has been serving as a strategic advisor to European incumbent Telcos for over a decade. His work has always been focused on adapting to and leveraging the fundamental changes that have affected this industry, such as the introduction of the first data, mobile and internet services, the transition from monopolies to competitive markets, and international M&amp;A. </p>\n\n<p>Since 1995, Jesús has also invested seed capital and supported the creation of a number of start-ups such as Silverwire or VTX. In 1997, he co-founded LeShop, Switzerland’s largest and most successful e-commerce company, which was sold to Migros in 2006.</p>\n\n<p>Since 2004, Jesús is the founder of Eclosion, Switzerland’s first seed fund dedicated to life-sciences. Eclosion is an original structure, created in partnership with leading academic institutions and large industrial companies, and supported by an original funding model with both State funding (biotech infrastructure and services) and institutional investors (seed equity investments). After two years of operations, it has a portfolio of five start-ups in early development stages, including GenKyoTex.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chairman","firm":{"name":"GenKyoTex","permalink":"genkyotex","type_of_entity":"company","image":{"available_sizes":[[[150,62],"assets/images/resized/0004/7604/47604v1-max-150x150.jpg"],[[189,79],"assets/images/resized/0004/7604/47604v1-max-250x250.jpg"],[[189,79],"assets/images/resized/0004/7604/47604v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}