{"first_name":"Jessica","last_name":"Margolin","permalink":"jessica-margolin","crunchbase_url":"http://www.crunchbase.com/person/jessica-margolin","homepage_url":"http://www.wingedpigs.com","birthplace":"","twitter_username":"kitode","blog_url":"http://www.margolin-consulting.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"woman, investment, investor, intangible-asset, social-capital, entrepreneur, women, speaker, futurist, community, development, gov-2-0, gov2-0","alias_list":null,"created_at":"Wed Feb 02 23:44:21 UTC 2011","updated_at":"Thu Feb 03 06:40:16 UTC 2011","overview":"<p>Jessica Margolin is an Impact Investment analyst and Social Entrepreneur. With a background in finance, marketing, and organizational design, she has focused on how to measure intangible assets such as trust, health, and spirituality, and how to use this knowledge to manage risk and predict the future economic value in a company as an Impact Investment analyst.</p>\n\n<p>Jessica is a Research Affiliate at the Institute for the Future and an adjunct faculty member at Keller Management School, where she teaches Organizational Behavior, Learning and Development, and Business Planning courses. She is also affiliated with the EPIC Global Challenge, a project from the Stanford Persuasive Technology and Peace Innovation Labs. Jessica earned her Bachelor’s degree from the University of California at Berkeley in Physics, her Master’s of Science in Materials Science and her MBA in Strategic Management and Organization from the University of Minnesota.</p>","image":{"available_sizes":[[[150,149],"assets/images/resized/0012/0226/120226v2-max-150x150.jpg"],[[250,249],"assets/images/resized/0012/0226/120226v2-max-250x250.jpg"],[[450,449],"assets/images/resized/0012/0226/120226v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.linkedin.com/in/margolin","title":"Linked In Profile"}],"web_presences":[]}