{"first_name":"Jessica","last_name":"Bowman","permalink":"jessica-bowman","crunchbase_url":"http://www.crunchbase.com/person/jessica-bowman","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Feb 06 00:14:55 UTC 2009","updated_at":"Fri Feb 06 04:07:45 UTC 2009","overview":"<p>Jessica Bowman is the founder of SEOinhouse.com and a leading advocate for in-house SEO . She is known for getting in-house SEO programs up and running quickly, systematically and profitably.</p>\n\n<p>Jessica comes from an IT background, which gives her a different perspective than many search marketers on how to execute SEO by integrating into existing systems and processes. Her diverse experience in project management, website usability, and process analysis gives her the insight to ask the right questions, in the right order to identify the best approach for implementing SEO at your company. </p>\n\n<p>Jessica tells it like it is, with candid, realistic advice about SEO strategy, tactics, and implementation options.  Her specialty is to come in and figure out what a company needs and doesn’t need, identify where the focus should be, point out what isn&#8217;t worth the effort, and take action to start accomplishing SEO. A long-time advocate of in-house SEO, Jessica leverages your existing resources and talent to produce the maximum return on SEO investment.</p>\n\n<p>Identified as one of the industry&#8217;s top in-house SEOs by Natural Search Blog, Jessica has built in-house SEO programs for Yahoo! Inc., Enterprise Rent-A-Car and Business.com. Now a free agent, her specialty is to lead a company in building an in-house SEO program that adds to be bottom line and becomes an asset to the organization.</p>\n\n<p>With 10 years of web experience, Jessica knows how to set the strategy, identify what needs to change on the site and within the organization, and motivate people to move forward and improve the bottom line with search engine optimization.</p>\n\n<p>With multi-million dollar successes in search engine marketing and website design, Jessica has a love for foreign travel, weekly dance classes, and kicks butt at the game Connect Four.</p>\n\n<p>Jessica graduated magna cum laude with a B.S. in information systems management from Washington University, holds a B.A. in international economics and management from Hiram College, volunteers to work with refugees, has been featured in the SEO Bible and Marie Claire magazine, and plans to move to Europe… one day.</p>","image":{"available_sizes":[[[119,150],"assets/images/resized/0003/5704/35704v2-max-150x150.png"],[[123,154],"assets/images/resized/0003/5704/35704v2-max-250x250.png"],[[123,154],"assets/images/resized/0003/5704/35704v2-max-450x450.png"]],"attribution":"<p><a href=\"http://www.seminhouse.com\" title=\"SEM Inhouse\" rel=\"nofollow\">SEM Inhouse</a></p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}