{"first_name":"Jessica","last_name":"Alba","permalink":"jessica-alba","crunchbase_url":"http://www.crunchbase.com/person/jessica-alba","homepage_url":"https://www.facebook.com/JessicaAlba","birthplace":"","twitter_username":"jessicaalba","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1981,"born_month":null,"born_day":null,"tag_list":"jessica-alba, actress, movies, films, honest-company","alias_list":"","created_at":"Tue Jul 24 05:58:11 UTC 2012","updated_at":"Tue Jul 24 16:56:16 UTC 2012","overview":"<p>Jessica Alba is an actress, activist, mother, wife and entrepreneur. Known throughout the world for her acting career, the mother of two daughters launched The Honest Company in January 2012. In an industry consumed by toxic and harmful products, The Honest Company responds to the need for safe, effective, and affordable products for the home, children, and babies. Honest conveniently delivers fashionable, eco-friendly products that “families need most” right to your homes. Ranging from diapers and wipes to household cleaning detergents and a full line of body care products for children, all of the products were created with children’s well being in mind and designed to represent a friendly, healthy and sustainable future.</p>\n\n<p>Jessica fell in love with acting at a very early age and became active professionally at the age of 12. After studying at the Atlantic Theatre Company with founders William H. Macy and David Mamet, she starred in James Cameron’s “Dark Angel,” gaining worldwide recognition. Her first starring role in a major studio film was the 2003 release, “Honey,” Universal Pictures’ contemporary urban drama that grossed over $60 million worldwide.</p>\n\n<p>In 2005, she starred opposite Bruce Willis and an all-star cast in the provocative and critically acclaimed “Sin City,” directed by Robert Rodriguez and Frank Miller. She next starred as Sue Storm ‘The Invisible Girl’ in Marvel Comics’ action-franchise blockbuster “Fantastic Four,” which was released by 20th Century Fox in July 2005 and became a worldwide box-office success. Jessica was part of Garry Marshall’s all-star ensemble romantic comedy, “Valentine’s Day,” which broke box office records with the largest opening gross on a four-day President’s Day weekend in history with $63 million. She starred in director Michael Winterbottom’s controversial screen adaptation of Jim Thompson’s “The Killer Inside Me,” opposite Casey Affleck and Kate Hudson, as well as Robert Rodriquez’s audaciously artistic film “Machete.” She co-starred in the third installment of the hit “Meet the Fockers” franchise, “Little Fockers,” and was seen most recently in the 4D family adventure, “Spy Kids: All the Time in the World,” marking her third collaboration with Robert Rodriguez. </p>\n\n<p>Next up, Jessica will lend her voice as part of an all-star cast for The Weinstein Company’s animated adventure, “Escape From Planet Earth,” also featuring Sarah Jessica Parker, Brendan Fraser and James Gandolfini. She will also reunite with Robert Rodriguez later this year for “Sin City 2.” Jessica’s combined box office gross to date reaches over $900,000,000.</p>\n\n<p>Jessica showcased her comedic talents as host of the 2006 MTV Movie Awards. She appeared in several iconic, lucrative, and prestigious endorsement campaigns including the famous Got Milk? “milk mustache” campaign and a star-studded 30th Anniversary campaign for The Gap, She has been featured in global endorsement campaigns for L’Oreal, Revlon, and others. Jessica continues to appear on countless prominent magazine covers in the United States and throughout the world.</p>\n\n<p>Among her many awards and honors, Jessica received Golden Globe and People’s Choice Award nominations, TV Guide readers’ Breakout Star of the Year, and won Favorite TV Actress at the 2001 Teen Choice Awards for “Dark Angel.” She won the Nickelodeon Kids’ Choice Award for Favorite Female Actress for her performance in “Fantastic Four” and an MTV Movie Award for Sexiest Performance in “Sin City.” She received another Teen Choice Award for Choice Movie Actress in a Horror/Thriller for “The Eye” and was honored by the Young Hollywood Awards as Superstar of Tomorrow in 2005. She has received ALMA Awards for her performances in “Dark Angel” and “Machete,” as well as a Fashion Icon in 2009. In 2012 Jessica received the Glamour UK Entrepreneur of the Year Award and has been featured in numerous publications for her newest business venture The Honest Company.</p>\n\n<p>Jessica’s activism endeavors are many and varied. As a current spokesperson for the Safer Chemicals, Healthy Families Coalition, she joins leading public health experts to demand government leadership on increasing protections from toxic chemicals. In 2010, she served as the global ambassador and co-chair for 1Goal, a worldwide campaign tied to the World Cup to provide education for all. She supports several other non-profits including V-Day, Healthy Child Healthy World, Step Up Women’s Network, The Children’s Defense Fund, Declare Yourself and Voto Latino. Her passion for social justice, particularly for women and children, has led to several trips to Capitol Hill. She currently sits on the board of directors of Baby2Baby, a non-profit organization that supplies essential baby gear and clothing to families in need.</p>\n\n<p>Alba was raised in a traditional American family in Southern California. Her mother’s family has a French-Danish heritage, while her father is from Mexican-Indian and Spanish lineage.</p>","image":{"available_sizes":[[[124,150],"assets/images/resized/0020/2479/202479v2-max-150x150.jpg"],[[208,250],"assets/images/resized/0020/2479/202479v2-max-250x250.jpg"],[[374,450],"assets/images/resized/0020/2479/202479v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"The Honest Company","permalink":"the-honest-company","type_of_entity":"company","image":{"available_sizes":[[[150,148],"assets/images/resized/0018/0816/180816v1-max-150x150.png"],[[152,150],"assets/images/resized/0018/0816/180816v1-max-250x250.png"],[[152,150],"assets/images/resized/0018/0816/180816v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}