{"first_name":"Jessica","last_name":"Gonzalez","permalink":"jessica-gonzalez","crunchbase_url":"http://www.crunchbase.com/person/jessica-gonzalez","homepage_url":"http://www.adoptacreative.com","birthplace":"Elizabeth, nj","twitter_username":"adoptacreative","blog_url":"http://www.adoptacreative.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"cellphone-charging-kiosks, ceo, digital-advertising, entrepreneur, minority-woman","alias_list":null,"created_at":"Sat Jan 14 05:13:02 UTC 2012","updated_at":"Mon Jan 16 00:04:13 UTC 2012","overview":"<p>Jessica Gonzalez, Founder and CEO of InCHARGED, is a visionary entrepreneur - a Steve Jobs in the making for the media defamed millennial generation. Part technology innovator, part communications creative artist, Jessica has already earned the moniker &#8220;Jill-of-all-trades&#8221;. </p>\n\n<p>In creating InCHARGED, Jessica aims to solve for the foreseeable future (absent an enormous leap in technology and the years of time it would take to replace a huge installed base of existing technology) the achilles heel of the present mobile economy - battery life for smart phones and other mobile devices not nearly equal to the current demands and ever gorwing potential uses for these devices. In so doing, InCHARGED will, in short order, be both an indispensible (&#8220;how did I ever live without this&#8221;) part of the infrastructure of daily life, like ATMs and other once novel technologies and a truly innovative advertising network through which advertisers can place their messages before critical audience in a fashion which avoids the growing inefficiencies and ineffectiveness of many alternative forms of advertising. </p>\n\n<p>Before launching InCHARGED, Gonzalez was simultaneously the creative director for I Beverage Group, LLC developing all brand identity programs (including all digital strategies) and the Founder and CEO of Adopt a Creative, a successful creative development agency solutions to companies including some in the Fortune 500 .Gonzalez holds a Bachelors in Art and Design from the Fashion Institute of Technology.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0017/0124/170124v2-max-150x150.jpg"],[[179,250],"assets/images/resized/0017/0124/170124v2-max-250x250.jpg"],[[322,450],"assets/images/resized/0017/0124/170124v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"Advertising design","institution":"Fashion Institute of technology ","graduated_year":2008,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://adoptacreative.com","title":"founder"}]}