{"first_name":"Jean-Francois","last_name":"Mule","permalink":"jfmule","crunchbase_url":"http://www.crunchbase.com/person/jfmule","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"jean-francois-mule, cablelabs, ipcera","alias_list":"","created_at":"Thu Oct 07 22:43:31 UTC 2010","updated_at":"Thu Jun 14 19:11:25 UTC 2012","overview":"<p>Jean-Francois Mule&#8217; is the Senior Vice President of Technology Development at CableLabs.  He heads up the technical staff in the new San Francisco Bay Area office of CableLabs. \nHis team is focused on Bay Area outreach, application development on mobile devices in a multi-screen world and university research on Software-Defined Networks.</p>\n\n<p>Jean-Francois was previously VP of IP Technologies and Services responsible for steering the directions of IP technologies and protocol developments across the CableLabs research and development projects such as DOCSIS®, PacketCable(tm) and Wireless. He is the program manager leading real-time IP communication services over broadband networks including PeerConnect(tm), SIP peering, HD Voice and Wi-Fi.<br/>\nHe also coordinates CableLabs activities in the Internet Engineering Task Force (IETF) and the Internet Society (ISOC).\nJean-Francois previously served as the Chief Architect for PacketCable responsible for the architecture and development teams. PacketCable is the IP service delivery platform for delivering VoIP and multimedia services over cable, a technology deployed by cable operators across the world to serve over 30 million subscribers live today.</p>\n\n<p>Before joining CableLabs, Jean-Francois served as Director of Standards &amp; Architecture at start-up Clarent Corporation where he actively contributed to the growth of the company from a start-up with just over 100 employees to a public company with over 1,000 employees after a successful IPO.  He oversaw the company&#8217; strategy, product directions and system engineering for open communication protocols such as SIP, H.323, MGCP and RTP developments.</p>\n\n<p>He has also held management positions at France Telecom R&amp;D in California, France Telecom North America in New York, and started his carrier as a software developer at IBM in France.</p>\n\n<p>Jean-Francois Mule&#8217; holds a Masters degree in Electrical Engineering from the National Institute of Telecom in Paris.  He lives in San Francisco, California.</p>","image":{"available_sizes":[[[102,150],"assets/images/resized/0010/4638/104638v2-max-150x150.jpg"],[[171,250],"assets/images/resized/0010/4638/104638v2-max-250x250.jpg"],[[171,250],"assets/images/resized/0010/4638/104638v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}