{"first_name":"Jill","last_name":"Nash","permalink":"jill-nash","crunchbase_url":"http://www.crunchbase.com/person/jill-nash","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Yahoo!","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 27 20:49:54 UTC 2008","updated_at":"Wed Aug 27 20:49:54 UTC 2008","overview":"<p>As a key member of the Yahoo! executive team, Nash will be responsible for the company&#8217;s worldwide communications efforts, including public and media relations, corporate reputation, corporate, financial and employee communications, and crisis and issues management.</p>\n\n<p>Prior to joining Yahoo! in January 2007, Nash was the vice president of global corporate communications at Gap Inc, where she managed all aspects of communications for the company with a focus on reputation management, cultural transformation, and corporate and branding strategies. During her tenure with Gap Inc., she led the communications efforts for the launch of two new brands – Forth &amp; Towne and the e-commerce footwear brand Piperlime. She also spearheaded communications for the international expansion of Banana Republic in Japan and Gap franchise stores across the Mideast and Asia, and helped to design communications campaigns for Gap&#8217;s Product (RED) and Old Navy&#8217;s Hurricane Katrina relief effort.</p>\n\n<p>Previous to Gap Inc., Nash was the senior vice president of corporate communications at Charles Schwab Corporation. She also held marketing and communications roles at KPMG and was responsible for corporate communications at Transamerica Life Companies.</p>\n\n<p>Nash has received numerous industry honors, including multiple Gold Quill awards and has served as the president of Organization of Executive Women. She is a graduate of San Diego State University.</p>","image":{"available_sizes":[[[80,110],"assets/images/resized/0002/4259/24259v1-max-150x150.jpg"],[[80,110],"assets/images/resized/0002/4259/24259v1-max-250x250.jpg"],[[80,110],"assets/images/resized/0002/4259/24259v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Communications Officer","firm":{"name":"Yahoo!","permalink":"yahoo","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0001/0836/10836v9-max-150x150.png"],[[226,81],"assets/images/resized/0001/0836/10836v9-max-250x250.png"],[[226,81],"assets/images/resized/0001/0836/10836v9-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}