{"first_name":"Jill","last_name":"Siegel","permalink":"jill-siegel","crunchbase_url":"http://www.crunchbase.com/person/jill-siegel","homepage_url":"http://eqal.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"EQAL","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jul 23 16:01:39 UTC 2012","updated_at":"Wed Jul 25 09:40:35 UTC 2012","overview":"<p>Jill is Vice President of Communications and PR for EQAL. Jill is a renowned Public Relations and Communications specialist who has created some of the most innovative and exciting celebrity and corporate PR and branding campaigns over the last two decades. Her unique combination of media relationships, partnerships and online integration combine to create a message that best resonates for a wide range of media coverage. The results have produced multi-platinum records, New York Times bestsellers and creative coverage of online properties, Broadway Shows, television programming, and Philanthropic ventures. Her ingenuity has crafted projects for The Rolling Stones, New Kids On The Block, Motley Crue, The Three Tenors and Steven Tyler. Her long-term collaboration with Bon Jovi&#8217;s David Bryan included the development of Tony Award Winning Best New Musical, Memphis. Jill continues to evolve her approach as the digital universe opens to offer new opportunities for disseminating and consuming information. She began her work with EQAL&#8217;s founders Miles Beckett and Greg Goodfried during the lonelygirl15 years. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP, Communications and PR","firm":{"name":"EQAL","permalink":"eqal","type_of_entity":"company","image":{"available_sizes":[[[64,90],"assets/images/resized/0001/7414/17414v8-max-150x150.png"],[[64,90],"assets/images/resized/0001/7414/17414v8-max-250x250.png"],[[64,90],"assets/images/resized/0001/7414/17414v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}