{"first_name":"Jim","last_name":"Fulton","permalink":"jim-fulton","crunchbase_url":"http://www.crunchbase.com/person/jim-fulton","homepage_url":"http://www.cooley.com/fultonjf","birthplace":"Queens, New York","twitter_username":"fultonjf","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1966,"born_month":11,"born_day":21,"tag_list":"clean-tech-lawyer-emerging-company-venture-capital","alias_list":null,"created_at":"Tue May 31 19:45:50 UTC 2011","updated_at":"Fri Jun 03 18:02:23 UTC 2011","overview":"<p>Jim Fulton is a partner in the Cooley Business department and co-chair of the Firm&#8217;s Clean Energy and Technologies group.  He joined the Firm in 1995 and is resident in the Palo Alto office.</p>\n\n<p>Mr. Fulton&#8217;s practice focuses on the representation of emerging technology and life sciences companies and the venture capital firms that invest in those companies.  As a specialist in corporate and securities law, he has counseled company clients and investors in a wide variety of projects, including company formations, spin outs, private and public financings, mergers and acquisitions, employee equity incentives, executive hiring and SEC reporting and compliance.</p>\n\n<p>Prior to joining Cooley, Mr. Fulton was a senior budget analyst with the U.S. Government&#8217;s Office of Personnel Management for six years.</p>\n\n<p>Mr. Fulton was recognized as one of the Top 25 Clean Tech Lawyers in California by The Daily Journal in 2011. He was also recognized in The Best Lawyers in America in the category of corporate law and venture capital law in 2008-2011 and Northern California Super Lawyer in the category of securities and corporate finance in 2007-2011.</p>\n\n<p>Mr. Fulton received a J.D. from Georgetown University Law Center in 1995, graduating cum laude.  He received a B.S. in Foreign Service from Georgetown University in 1989, graduating cum laude .</p>","image":{"available_sizes":[[[149,150],"assets/images/resized/0013/7185/137185v2-max-150x150.jpg"],[[170,171],"assets/images/resized/0013/7185/137185v2-max-250x250.jpg"],[[170,171],"assets/images/resized/0013/7185/137185v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}