{"first_name":"Jim","last_name":"Steyer","permalink":"jim-steyer","crunchbase_url":"http://www.crunchbase.com/person/jim-steyer","homepage_url":"","birthplace":"New York City","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Common Sense Media","born_year":1956,"born_month":null,"born_day":null,"tag_list":"media, childrens-media, public-policy, kids, television, childrens-issues, civil-rights","alias_list":"","created_at":"Wed May 16 00:39:01 UTC 2012","updated_at":"Wed May 16 00:39:43 UTC 2012","overview":"<p>Jim has spent more than 20 years as one of the most respected experts and entrepreneurs on issues related to children&#8217;s policy and media in the United States. As CEO, he is responsible for the overall leadership of Common Sense Media, the nation&#8217;s leading nonpartisan organization dedicated to improving the media lives of kids and families.</p>\n\n<p>Prior to founding Common Sense, Jim was Chairman and CEO of JP Kids, a respected family media company. Before that, he served as President of Children Now, a leading national advocacy and media organization for children, which he founded in 1988. Jim began his career as an elementary school teacher and then became a public interest lawyer. He served as a law clerk for the California Supreme Court, as a deputy district attorney, and as a civil rights attorney with the NAACP Legal Defense Fund.</p>\n\n<p>In addition to his duties at Common Sense, Jim teaches popular courses on civil rights, civil liberties, and children&#8217;s issues at Stanford University, where he has taught for the past 22 years in the School of Education and Department of Political Science. During that period, he has received a number of Stanford&#8217;s highest teaching honors. Jim is also the author of the widely acclaimed book The Other Parent: The Inside Story of the Media&#8217;s Effect on Our Children, which draws upon his extensive experience as a leading child advocate, educational media expert, and dad.</p>\n\n<p>Over the past decade, Jim has appeared regularly on a variety of national television and radio programs, including The Today Show, Good Morning America, Oprah, CNN, The O&#8217;Reilly Factor, and Larry King. He hosts a regular weekly segment, &#8220;Kids and the Media,&#8221; on CBS-5 TV in San Francisco, and his work has been featured in many publications, including The New York Times, The Washington Post, USA Today, Newsweek, and The Wall Street Journal.</p>\n\n<p>Jim grew up in New York City and graduated Phi Beta Kappa from Stanford. He received his JD from Stanford Law School, where he founded the East Palo Alto Community Law Project. Jim is the father of four children and lives with his family in the Bay Area.</p>","image":{"available_sizes":[[[128,150],"assets/images/resized/0018/9940/189940v1-max-150x150.jpg"],[[214,250],"assets/images/resized/0018/9940/189940v1-max-250x250.jpg"],[[240,280],"assets/images/resized/0018/9940/189940v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"","subject":"","institution":"Stanford University","graduated_year":1981,"graduated_month":null,"graduated_day":null},{"degree_type":"J.D.","subject":"","institution":"Stanford Law School","graduated_year":1983,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder and CEO","firm":{"name":"Common Sense Media","permalink":"common-sense-media","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0011/3305/113305v2-max-150x150.png"],[[162,48],"assets/images/resized/0011/3305/113305v2-max-250x250.png"],[[162,48],"assets/images/resized/0011/3305/113305v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.commonsensemedia.org/about-us/who-we-are/staff-leadership/james-steyer","title":"Who We Are (Common Sense Media)"}],"web_presences":[]}