{"first_name":"Jim","last_name":"Counihan","permalink":"jim-counihan","crunchbase_url":"http://www.crunchbase.com/person/jim-counihan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"The Receivables Exchange","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Jun 08 03:28:19 UTC 2008","updated_at":"Thu Sep 30 01:43:11 UTC 2010","overview":"<p>Jim joined Prism in 2000 and runs the firm&#8217;s software &amp; services practice.  His focus areas are software as a service and MSP&#8217;s, on-line exchanges, technology enabled services and technology enabled vertical plays.  Jim is a director for Astoria Software, White Sky, The Receivables Exchange, Mota and RatePoint.  He was formerly on the boards of Softricity, acquired by Microsoft (NASDAQ: MSFT), GeoTrust, acquired by Verisign (NASDAQ: VRSN), Silverback Technologies, acquired by Dell (NASDAQ:  DELL) and Chosen Security, acquired by PGP and then by Symantec (NASDAQ: SYMC).</p>\n\n<p>Possessing a unique mix of legal, operational and technical knowledge, Jim complements and extends Prism&#8217;s entrepreneurial and financial expertise. Jim joined Prism from EPiCON, Inc., where he served as Legal Counsel and Director of Business Operations. A Prism investment, EPiCON was sold to Nortel Networks in September 2000.</p>\n\n<p>He has held positions in Corporate Legal Counsel and Business Operations for Sapient Corporation. He also served as Legal Counsel for the Outsourcing Division of Bell Atlantic Network Integration, which during his tenure, grew into a $300 million business in four years.</p>\n\n<p>A member of the Massachusetts Bar Association, Jim holds a B.A. magna cum laude from the University of Massachusetts at Amherst, a J.D. cum laude from Suffolk University Law School.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Director","firm":{"name":"The Receivables Exchange","permalink":"the-receivables-exchange","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0002/6601/26601v2-max-150x150.jpg"],[[150,45],"assets/images/resized/0002/6601/26601v2-max-250x250.jpg"],[[150,45],"assets/images/resized/0002/6601/26601v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}