{"first_name":"Jim","last_name":"McCormick","permalink":"jim-mccormick","crunchbase_url":"http://www.crunchbase.com/person/jim-mccormick","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Mar 03 13:03:23 UTC 2011","updated_at":"Thu Mar 03 13:12:09 UTC 2011","overview":"<p>Jim McCormick brings more than 20 years of financial, accounting, merger, operations and risk management experience to Silverpop. Most recently he was CFO and treasurer at Harbinger Corporation, a publicly traded B2B e-commerce provider. At Harbinger, McCormick supervised the integration of 14 acquisitions, overhauled financial and operating systems and helped drive a tenfold increase in market capitalization leading to the company&#8217;s sale in mid-2000 for approximately $1.1 billion.</p>\n\n<p>Prior to Harbinger, McCormick was CFO, treasurer and secretary at Knology Inc., a Georgia-based broadband telecommunications company. While at Knology, he executed Knology&#8217;s public debt offering and raised more than $320 million of combined debt and equity to fund the company&#8217;s expansion. McCormick has served as consulting manager in Andersen Consulting&#8217;s Melbourne, Australia office, assisting Global 2000 companies with M&amp;A feasibility, organizational structuring and profit improvement, and as auditor with Arthur Andersen &amp; Co. in Atlanta, Ga.</p>\n\n<p>McCormick is a Certified Public Accountant and holds a Bachelor of Science degree in accounting, graduating Summa Cum Laude from Florida State University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Executive Vice President and Chief Financial Officer","firm":{"name":"Silverpop","permalink":"silverpop","type_of_entity":"company","image":{"available_sizes":[[[150,35],"assets/images/resized/0003/2860/32860v6-max-150x150.png"],[[250,59],"assets/images/resized/0003/2860/32860v6-max-250x250.png"],[[303,72],"assets/images/resized/0003/2860/32860v6-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}