{"first_name":"Jim","last_name":"Tousignant","permalink":"jim-tousignant","crunchbase_url":"http://www.crunchbase.com/person/jim-tousignant","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"PositiveTALK","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Sep 11 00:30:50 UTC 2011","updated_at":"Wed May 02 01:33:18 UTC 2012","overview":"<p>Jim is the Founder and CEO of PositiveTALK. Prior to founding PositiveTALK, Jim was the founder and CEO of Ultimate Escapes, the second largest luxury destination club in the world. Previously, Jim was Managing Director of Global Sales and Account Management at Thomson Financial (now Thomson Reuters, NYSE: TRI) and managed a global team responsible for Thomson Financial’s largest 50 global clients and over $500 million in annual revenues, including major clients like Merrill Lynch, Morgan Stanley and Goldman Sachs.</p>\n\n<p>Prior to Thomson Financial, Jim was Executive Vice President at Morgan Stanley (NYSE: MS), where he was responsible for e-commerce and business development for Morgan Stanley’s retail brokerage and asset management businesses globally. </p>\n\n<p>From 1993 to 2000, Jim was the co-founder and President of Multex.com, Inc. (formerly NASDAQ: MLTX), a global provider of online financial information services, and was responsible for managing a rapidly growing company with millions of online users, 500+ employees and annual revenues over $100 million. Jim was active in raising more than $50 million in private venture capital at Multex, managing four acquisitions, and overseeing the company&#8217;s successful $40 million initial public offering (IPO) in 1999. </p>\n\n<p>In 1981, Jim started his first software company, Mirror Images Software, Inc., as a senior at Rensselaer Polytechnic Institute (RPI). Jim attended RPI from 1978 to 1982, majoring in Management with a minor in Computer Science.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"PositiveTALK","permalink":"positivetalk","type_of_entity":"company","image":{"available_sizes":[[[150,40],"assets/images/resized/0015/3601/153601v2-max-150x150.jpg"],[[250,66],"assets/images/resized/0015/3601/153601v2-max-250x250.jpg"],[[450,120],"assets/images/resized/0015/3601/153601v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}