{"first_name":"Jim","last_name":"Swartz","permalink":"jim-swartz","crunchbase_url":"http://www.crunchbase.com/person/jim-swartz","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Feb 08 01:26:05 UTC 2008","updated_at":"Fri Jun 27 17:39:06 UTC 2008","overview":"<p>Jim Swartz has been active in venture capital for four decades. Experienced in the operating needs of young companies, he particularly enjoys working with start-up teams that are defining new industries. He has served as a Director for over fifty successful companies and has been closely involved as lead investor with the emergence of numerous industry pioneering firms including Avici Systems, BroadBand Technologies, FastForward/Inktomi, FVC.com, Illustra/Informix, Medical Care America, Netopia/Motorola, PictureTel, Polycom, Remedy Corporation, Riverbed Technology and Ungermann-Bass.</p>\n\n<p>Current private company directorships include Gen3 Partners, Ingenuity Systems, MetraTech, RGB Networks and Transera Communications. In addition, Jim works with the Accel Europe team as a founder/mentor of Accel&#8217;s European business.</p>\n\n<p>Before founding Accel Partners, Jim was founding General Partner of Adler &amp; Company, which he started with Fred Adler in 1978 after his tenure as a Vice President of Citicorp Venture Capital. Early in his career Jim worked as a management consultant, entering the venture capital industry in 1972.</p>\n\n<p>Active in industry affairs, Jim is former Chairman of the National Venture Capital Association and a 2007 recipient of its Lifetime Achievement Award. He is a graduate of Harvard University with a concentration in Engineering Sciences and Applied Physics (he mostly remembers something about playing football) and holds an M.S. in Industrial Administration from Carnegie Mellon University.</p>\n\n<p>Outside interests include serving as Chairman of the Swartz Foundation and the Christian Community Center of Park City and as a Board Member and Chairman of the Investment Committee of the U.S. Ski and Snowboard Foundation. He is a member of the Business Board of Advisors of Tepper School of Business, member of the Board of Advisors to Pacific Community Ventures, Board Member and Founder of the Deer Valley Music Festival, and Co-Chairman of the Major Gifts Committee for the YMCA of Martha&#8217;s Vineyard. From 1999 to 2002, he served on the Management Committee of the Salt Lake Organizing Committee for the Winter Olympics of 2002 (SLOC). He is the recipient of a Merit Award from Carnegie Mellon University and an Honorary Doctorate Degree from the Western Governors University.</p>\n\n<p>Jim is also skipper of the yacht Moneypenny, winner of the 2006 Swan World Cup (Porto Cervo, Italy), the 2006 US IRC National Championship (Key West, FL) and the 2005 and 2007 Swan North American Championships (Newport, RI).</p>\n\n<p>Jim and Susan Swartz reside in Park City, Utah. Susan Swartz is an accomplished painter with a particular love for landscapes and nature. Son Scott is President and CEO of MetraTech, daughter Karin is a medical doctor, and daughter Kristin is a teacher of learning disabled children. Jim and Susan are proud contributors to nine wonderful grandchildren.</p>","image":{"available_sizes":[[[122,150],"assets/images/resized/0001/0631/10631v1-max-150x150.jpg"],[[203,250],"assets/images/resized/0001/0631/10631v1-max-250x250.jpg"],[[210,258],"assets/images/resized/0001/0631/10631v1-max-450x450.jpg"]],"attribution":null},"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Accel Partners","permalink":"accel-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,54],"assets/images/resized/0001/0604/10604v3-max-150x150.jpg"],[[250,90],"assets/images/resized/0001/0604/10604v3-max-250x250.jpg"],[[450,162],"assets/images/resized/0001/0604/10604v3-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"General Partner","firm":{"name":"Transera Communications","permalink":"transera-communications","type_of_entity":"company","image":{"available_sizes":[[[150,43],"assets/images/resized/0003/2901/32901v1-max-150x150.jpg"],[[202,58],"assets/images/resized/0003/2901/32901v1-max-250x250.jpg"],[[202,58],"assets/images/resized/0003/2901/32901v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}