{"first_name":"Jim","last_name":"Murphy","permalink":"jim-murphy-2","crunchbase_url":"http://www.crunchbase.com/person/jim-murphy-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jun 17 12:57:00 UTC 2009","updated_at":"Wed Jun 17 13:01:15 UTC 2009","overview":"<p>Mr. Murphy is responsible for all investment transactions, corporate and project finance efforts and general management of Invenergy and is a member of the company’s founding group. Mr. Murphy has 29 years of financial and management experience, primarily in the energy industry.</p>\n\n<p>At Invenergy, he has managed the negotiation and execution of over $7 billion in private equity investments, multiple power plant acquisitions and wind and thermal project debt and equity financings. In 2005 he conceived and led the $400 million portfolio financing of three U.S. wind farms, a transaction that was awarded Project Finance International magazine’s Environmental Deal of the Year and Project Finance magazine’s North American Portfolio Finance Deal of the Year.  In 2007 Mr. Murphy devised and managed a $500 million financing for a Canadian combined cycle facility that received the North American Public Power Deal of the Year from Project Finance magazine.</p>\n\n<p>Prior to the formation of Invenergy, Mr. Murphy was responsible for all project and corporate finance activities at SkyGen Energy LLC, as well as the accounting, legal and human resources functions of the company. Mr. Murphy led each of the company’s project financings, successfully closing more than 10 transactions for debt and equity financing. In 2000 he led the analysis and negotiation of multiple corporate financing options responsive to SkyGen’s explosive growth, and ultimately led the sale of SkyGen to Calpine Corporation, a $2.0 billion total value transaction.</p>\n\n<p>Prior to joining SkyGen, Mr. Murphy was a vice president with The Deerpath Group, Inc., a structured finance advisory and investment firm, where he gained significant experience with leveraged lease, project finance and leveraged buyout transactions. Prior to that, he was a manager in Arthur Andersen’s utility practice group, where he gained an in-depth understanding of utility finance through audits, regulatory proceedings and financial advisory assignments. </p>","image":null,"degrees":[{"degree_type":"BS","subject":"","institution":"University of Illinois","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Executive Vice President, COO, CFO","firm":{"name":"Invenergy","permalink":"invenergy","type_of_entity":"company","image":{"available_sizes":[[[150,37],"assets/images/resized/0004/3261/43261v1-max-150x150.png"],[[250,62],"assets/images/resized/0004/3261/43261v1-max-250x250.png"],[[282,71],"assets/images/resized/0004/3261/43261v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}