{"first_name":"Jim","last_name":"Farinholt","permalink":"jim-farinholt","crunchbase_url":"http://www.crunchbase.com/person/jim-farinholt","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon May 18 14:32:29 UTC 2009","updated_at":"Mon May 18 14:33:02 UTC 2009","overview":"<p>Jim has had an extensive career in both the private and public sectors of finance and investment. Over the decade of the 1990s, he directed numerous business development activities at Virginia Commonwealth University following many years of service, including several as Rector of the Board of Visitors. Through his promotion of the commercialization of scientific discoveries, he co-founded Allos Therapeutics, Inc. (NASDAQ: ALTH) a pharmaceutical start-up company, which went public in March 2000. In 1994 and 1995, Jim was Interim Director of Technology Transfer and he continues to serve on the Board of Directors of the VCU Intellectual Properties Foundation of which he was a founding member. From 1996 through 1998, he was Executive Director of the Virginia Biotechnology Research Park Authority where he oversaw its development from concept to its initial 257,000 sq ft of office and laboratory facilities. Today, that initiative is the economic engine for downtown Richmond.</p>\n\n<p>Prior to joining VCU, Mr. Farinholt was an executive officer in investment banking for small and medium-sized businesses at The Chase Bank in New York, and Wheat First Union and Galleher &amp; Company in Richmond, Virginia. Among his private company directorships are two newly co-founded healthcare entities: DiaKine Therapeutics, Inc., the start-up developer of an anti-inflammatory for the human vascular system, with an emphasis on diabetes; and PluroGen Therapeutics, Inc., a biotech start-up developer of products for complex wound management and healing. Additionally, Jim is a director of the publicly-owned Owens &amp; Minor, Inc. (NYSE - OMI), the nation’s largest distributor of brand-name hospital supplies, where he is Chairman of the Audit Committee and a member of the Executive and Strategic Planning Committees.\nJim has portfolio responsibility for nContact Surgical.</p>","image":{"available_sizes":[[[120,100],"assets/images/resized/0004/4448/44448v1-max-150x150.jpg"],[[120,100],"assets/images/resized/0004/4448/44448v1-max-250x250.jpg"],[[120,100],"assets/images/resized/0004/4448/44448v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Tall Oaks Capital Partners","permalink":"tall-oaks-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,48],"assets/images/resized/0004/4446/44446v1-max-150x150.jpg"],[[224,72],"assets/images/resized/0004/4446/44446v1-max-250x250.jpg"],[[224,72],"assets/images/resized/0004/4446/44446v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}