{"first_name":"Jimmy","last_name":"Setiawan","permalink":"jimmy-setiawan","crunchbase_url":"http://www.crunchbase.com/person/jimmy-setiawan","homepage_url":"http://www.urbanfloor.com","birthplace":"CA","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1978,"born_month":5,"born_day":26,"tag_list":"wood-flooring, wood-floor, hardwood-flooring","alias_list":null,"created_at":"Thu Nov 08 12:43:23 UTC 2012","updated_at":"Fri Nov 09 06:23:15 UTC 2012","overview":"<p>Probably the most difficult question that you might come across while building your home would be what type of flooring you should opt for. Well, everyone among us would like to have the best, when it comes to flooring and what else could better suffice this need other than engineered hardwood flooring. This flooring type was predominantly the most sought after one since the ancient days and they still look marvelous enough in buildings that have put them in use. They not only provide your building a classy touch, they in fact provide a long lasting solution that can be maintained with little care. Wooden floorings are known to have been used by a majority of traditions across the globe and have lasted even for centuries. The development of technology has given way for the engineered hardwood flooring that can adjust to varying climatic conditions and can be used in all levels. The older type of wooden flooring was an easy prey to dampness and moisture, more often ending up warping or cupping. \nWhat differentiates the engineered hardwood flooring from the traditional hardwood flooring is that the former one is a mix of hardwood as the top most layers and beneath it you will find 6 or 7 layers of plywood or fiberboard. These layers of plywood or fiberboard are stacked in such a way that they leave room for expansion and contracts as the climate differs. This is a major reason why it has become immensely popular. The wide array of species, colors and designs makes it eye-catching as well. You can choose from a variety of wood types like Red and White Oak, American Cherry, Hard Maple, Brazilian Cherry etc, and each type having its own distinctiveness. These varieties give out a natural look of wood and make the floor livelier. There are 2 types of hardwood floors available in the market, one is the pre-finished one that requires no sanding, which does help you save time. But, the most preferred one is the unfinished hardwood flooring that ensures that there is no gap left unsealed when applying finish on it. This protects the flooring from its biggest enemy, the moisture.\nLaying the engineered hardwood flooring is an easy task for anyone, provided you are through with the process. If not, it is always better to seek the help of a professional flooring contractor who can help you get it done professionally. By doing so, you’ll save a lot of money that you will otherwise spend on replacing the flooring because of your lack of knowledge in laying hardwood flooring. You’ll need to take a few precautions to make sure that your flooring remains in perfect condition even after generations.\n• Talk to an experienced hardwood flooring contractor to make sure you buy the right type that suits your purpose.\n• Wipe your floor clean, make sure it is even and dry before laying the flooring. \n• If you own pets, make sure you trim their nails frequently to avoid scratches on the floor.\n• Use a dry mop or vacuums to clean the floor.\n• Do not use detergents high in chemicals, metal scrubs or other abrasives to clean the floor.\n•  Try to use carpets or rugs near doors.\nBefore you set out to buy engineered hardwood flooring for your building, do a research on the internet about the different models, brands available and their cost. You need to be well aware of the price range in the market so that you can make a bargain on your purchase.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}