{"first_name":"Jin-Long","last_name":"Chen","permalink":"jin-long-chen","crunchbase_url":"http://www.crunchbase.com/person/jin-long-chen","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 19 02:09:01 UTC 2009","updated_at":"Fri Jun 19 02:16:20 UTC 2009","overview":"<p>Dr. Chen was most recently Vice President of Research at Amgen and head of the Metabolic Disorders therapeutic area. In this role he assumed global responsibility for the company’s research efforts in the areas of metabolism, bone, mineral balance, and muscle. He successfully guided programs from the earliest stages of drug discovery through advanced clinical trials and made key contributions to business development and product commercialization. Dr. Chen further bolstered Amgen’s drug portfolio by successfully in-licensing promising clinical candidates and out-licensing suitable clinical-stage molecules.</p>\n\n<p>Previously, Dr. Chen served as Vice President of Biology at Tularik and was responsible for drug discovery research in oncology, inflammation and metabolic disease. He personally initiated and directed Tularik’s orphan receptor programs, advancing a number of candidates, targeting selected GPCRs and nuclear hormone receptors, to the clinic. Several of these compounds remain in clinical development, including T131, a novel modulator of PPARy activity for the treatment of type 2 diabetes. While at Tularik, Dr. Chen was also active in business development, successfully establishing and managing pharma partnerships in support of the company’s metabolic and genomic research programs.</p>","image":{"available_sizes":[[[80,92],"assets/images/resized/0004/9536/49536v1-max-150x150.jpg"],[[80,92],"assets/images/resized/0004/9536/49536v1-max-250x250.jpg"],[[80,92],"assets/images/resized/0004/9536/49536v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder, President and Chief Scientific Officer","firm":{"name":"NGM Biopharmaceuticals","permalink":"ngm-biopharmaceuticals","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0004/9534/49534v1-max-150x150.jpg"],[[185,75],"assets/images/resized/0004/9534/49534v1-max-250x250.jpg"],[[185,75],"assets/images/resized/0004/9534/49534v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}