{"first_name":"Joanna","last_name":"Drake Earl","permalink":"joanna-drake-earl","crunchbase_url":"http://www.crunchbase.com/person/joanna-drake-earl","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Apr 15 20:49:46 UTC 2009","updated_at":"Wed Apr 15 20:52:24 UTC 2009","overview":"<p>Joanna Drake Earl is currently the COO of Current TV. </p>\n\n<p>As the first executive to join co-founders Al Gore and Joel Hyatt, and as the President of New Media, Joanna has been the architect and manager of Current&#8217;s web-based participation platform, which enables television&#8217;s first truly interactive network. In addition, she leverages her extensive media and technology credentials to forge partnerships with leading, multi-platform distribution partners and oversees development of new media products.</p>\n\n<p>Before joining Current, Joanna was Vice President, Content Strategy for MOXI (now Digeo), driving the development of new video, music and gaming set-to-box based applications with the largest media and entertainment companies. Earlier, Joanna served as Vice President, Media Partnerships and Applications at ReacTV in Silicon Valley, where she partnered with leading media companies to deliver the world&#8217;s first personalized video news service on the Web.</p>\n\n<p>As management consultant with Booz Allen Hamilton, Joanna spent five years developing strategic planning functions and market strategies for the motion picture, television and theme park divisions of leading entertainment conglomerates. In addition to her work in Hollywood, she developed strategic alliance programs and new media market strategies for three of the largest Silicon Valley companies.</p>\n\n<p>Source: <a href=\"http://current.com/s/management.htm\" title=\"CurrentTV\" rel=\"nofollow\">CurrentTV</a></p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Operating Officer","firm":{"name":"Current Media","permalink":"currenttv","type_of_entity":"company","image":{"available_sizes":[[[150,90],"assets/images/resized/0000/3355/3355v3-max-150x150.png"],[[166,100],"assets/images/resized/0000/3355/3355v3-max-250x250.png"],[[166,100],"assets/images/resized/0000/3355/3355v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}