{"first_name":"JoAnn","last_name":"Grundhauser","permalink":"joann-grundhauser","crunchbase_url":"http://www.crunchbase.com/person/joann-grundhauser","homepage_url":"http://www.diamondsonmain.com","birthplace":"Minnesota","twitter_username":"diamondsonmain","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1952,"born_month":1,"born_day":null,"tag_list":"jeweler-custom-designs-jewelry-diamonds-valley-ridge-stillwater-pearls-gia","alias_list":null,"created_at":"Tue Aug 14 22:04:57 UTC 2012","updated_at":"Fri Aug 17 10:00:05 UTC 2012","overview":"<p>JoAnn Grundhauser is the original owner of Diamonds On Main Jewelry and has been at the helm since opening in 1985.  Her career in the jewelry industry began in 1974.  During college, where she received her Bachelor of Science degree in Language Arts</p>\n\n<p>In 1985 Diamonds On Main opened in Downtown Stillwater on the Northeast corner of Chestnut and Main on the second floor.<br/>\nJoAnn&#8217;s vision for Diamonds On Main was to offer exceptional values, with outstanding quality and a unique buying experience.  The original size of Diamonds On Mains&#8217; location was less than 500 square feet.  So, it goes without saying, shopping at Diamonds on Main would be a very personal experience.                                                                                                                   </p>\n\n<p>RELOCATION  TO  VALLEY  RIDGE  MALL:  2006 - Diamonds On Main relocated to Valley Ridge Mall on Highway 36 at 1314 Frontage Road West in Stillwater - only three miles from the original location.  Acapulco Restaurant is on the corner and we&#8217;re just a few doors down!</p>\n\n<p>JoAnn has completed the Gemological Institute of America&#8217;s hands on Diamond Grading, Colored Sone Identification, Colored Stone Grading, Pearls, Synthetic Diamond Identification, and Counter Sketching Labs. And, she continues to seek further education opportunities through GIA in conjunction with the Independent Jewelers Organization.            </p>","image":{"available_sizes":[[[150,142],"assets/images/resized/0020/6101/206101v2-max-150x150.jpg"],[[250,236],"assets/images/resized/0020/6101/206101v2-max-250x250.jpg"],[[381,361],"assets/images/resized/0020/6101/206101v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}