{"first_name":"Joanna","last_name":"Sammartino Bailey","permalink":"joanna-sammartino-bailey","crunchbase_url":"http://www.crunchbase.com/person/joanna-sammartino-bailey","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"QWiPS","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Dec 05 18:16:02 UTC 2011","updated_at":"Thu May 31 09:53:19 UTC 2012","overview":"<p>Joanna Sammartino Bailey is Partner, Managing Director at QWiPS, a global b2b2c platform providing Social Voice for Commerce. Her present entrepreneurial role includes development of the company’s suite of products (App, widgets, technology offering), marketing materials (website, social profiles, PR and collateral materials), raising capital, new business, and client relations. Additional focus on broad strategy, innovation, key initiatives and strategic partnerships with the possibility of massive scale. </p>\n\n<p>Prior to QWiPS, Sammartino Bailey was EVP, Managing Director at Moxie Interactive, a New York based Publicis digital agency. She oversaw the organizational structure and development of the NY office while securing and expanding relationships with a Client base that included Nestle, Verizon, Puma and Richemont (Cartier, Chloe, Piaget, Panerai, IWC, etc.). </p>\n\n<p>While at Moxie, Joanna leveraged her ability in designing innovative partnerships, negotiating complex deals, and managing critical multi-million dollar projects. She mentored a staff of 80+ in NY and 50+ in Atlanta to strive towards best in practice vendor management, partnership development, and marketing for high profile clients in E-commerce, Fashion, Beauty/Cosmetics, Travel, Pharmaceuticals, Packaged Goods and Media. \nPrior to Moxie, Sammartino Bailey spent 8 years within WPP, notably as SVP, Managing Partner for Beyond Interactive. At Beyond she led the agency’s largest account, GlaxoSmithKline, and increased their billings by 500+ percent in three years, securing their AOR relationship. During her tenure there, she also oversaw LVMH, Diageo, P&amp;G, M&amp;M Mars, Hasbro, eli Lilly, Forest Labs, Bayer, Sara Lee and Fiat accounts. Joanna and her teams always focused on efforts that differentiated their products, drove innovation, reach and produced results. </p>\n\n<p>Sammartino Bailey also was an Associate Brand Manager at Revlon where she directed new product development and also launched their Web site, Revlon.com, which won a Forbes award for innovation. </p>\n\n<p>A coveted “40 Under 40” AdAge nominee, Sammartino Bailey is a dynamic, accomplished and recognized digital marketing &amp; advertising executive known for spearheading work that differentiates her clients&#8217; brands and drives innovation in the field. Highly motivated with a proven track record of building brands and organizations at Fortune 100 &amp; 500 companies. Joanna is known for proven leadership assisting Clients build large, share leading, and profitable brands and organizations. </p>\n\n<p>Sammartino Bailey has also been recognized by MEDIA Magazine as one of the top people in interactive marketing and emerging digital media to know and has won a variety of Clio and CASIE Awards for a various campaigns and Web sites/Products of the Year. </p>\n\n<p>Joanna’s enthusiasm for the advertising, marketing, social networks and communities has resulted in an 18-year professional career focused on the digital space and bringing value to her clients. She maintains leadership of cross-functional teams through effective communication and collaborative style. Joanna is passionate about building brands and customer relationships through innovation and teamwork.</p>\n\n<p>A Rhode Island native, Sammartino Bailey received a bachelor’s degree from Emory University and a Master’s in Business Administration from NYU’s Stern School of Business. Sammartino Bailey serves an advisor to pur~lisse, an innovative skin care and beauty company, InStore Vision and over the years has worked with several startups including Babble (now owned by Disney) and 7Echo, who’s On the Map, Social TV Show, Enabled by 7Echo Social TV platform won 2012 Appy’s Award (QWiPS was a finalist). </p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0019/0864/190864v2-max-150x150.jpg"],[[80,80],"assets/images/resized/0019/0864/190864v2-max-250x250.jpg"],[[80,80],"assets/images/resized/0019/0864/190864v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"Economics, International Business","institution":"Emory University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"International Business/Marketing","institution":"NYU Stern School of Business","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Director, Brands and Agencies","firm":{"name":"QWiPS","permalink":"qwips","type_of_entity":"company","image":{"available_sizes":[[[150,59],"assets/images/resized/0016/6570/166570v1-max-150x150.png"],[[188,75],"assets/images/resized/0016/6570/166570v1-max-250x250.png"],[[188,75],"assets/images/resized/0016/6570/166570v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}