{"first_name":"Joao","last_name":"Silva","permalink":"joao-silva-2","crunchbase_url":"http://www.crunchbase.com/person/joao-silva-2","homepage_url":"http://www.hipxik.com","birthplace":"Lisbon","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Digital Luxury, SA","born_year":1978,"born_month":10,"born_day":25,"tag_list":"","alias_list":null,"created_at":"Fri Jul 30 21:33:12 UTC 2010","updated_at":"Mon Aug 02 19:28:59 UTC 2010","overview":"<p>Founder and Owner of Digital Luxury an e-commerce company, serving as Chief Operations Officer. </p>\n\n<p>Digital Luxury is a privately held European company that creates, develops and invests in the IT sector with a special focus on Retail and Lifestyle products and services, currently in Mexico and Brazil, under the name HiPXiK.com. </p>\n\n<p>Digital Luxury operates throughout Latin America and launches its B2C retail e-commerce of luxury products to its members with prices 30-80% below retail. The business model has been widely proven in countries such as France, Spain, Italy and the USA and is on accelerated growth. Digital Luxury sources and imports products from both Latin America and USA in categories ranging from Apparel, Shoes, Accessories, Home, Electronics, Beauty and more. </p>\n\n<p>At Digital Luxury is responsible for implementing logistics, payment processes and customer service with constant refinements and improvements. Responsible for guaranteeing the implementation of IT platform, with main concerns on scalability and flexibility to support fast-pace growth. \nStrategic Consulting, including business plan &amp; sales strategy development, being also in an early stage the finance controller.</p>","image":null,"degrees":[{"degree_type":"business admnistration","subject":"Management","institution":"Universidade Catolica Portuguesa","graduated_year":2001,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"COO","firm":{"name":"Digital Luxury, SA","permalink":"digital-luxury-sa-2","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://mx.linkedin.com/in/joaoalvessilva","title":""}]}