{"first_name":"Jodi","last_name":"Gusek","permalink":"jodi-gusek","crunchbase_url":"http://www.crunchbase.com/person/jodi-gusek","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"consumer-expert, digital-media, interactive-television, media-convergence, video-delivery, marketing, branding, communications, product-development, business-strategy, ad-sales, interactive-program-guides-ipg, user-experience-expert, user-interface, new-t","alias_list":null,"created_at":"Fri Feb 05 20:16:54 UTC 2010","updated_at":"Sat Mar 17 10:55:23 UTC 2012","overview":"<p>Jodi A. Gusek, PhD is a strategic research executive with 16 years experience developing branding, marketing, and product development strategies for digital media and technology companies. </p>\n\n<ul>\n<li>Consumer insights expert with exceptional track record of providing actionable, customized research and strategic counsel to top media executives in broadcast and cable television, syndication, Internet, mobile, electronic gaming, and interactive technologies. </li>\n<li>Entrepreneurial leader with proven ability to build business relationships and evaluate consumer-facing business initiatives. </li>\n</ul>\n\n<p>Jodi is currently a Partner at Hall &amp; Partners&#8217; Los Angeles office building new business and cultivating client relationships.  Prior to H&amp;P, Jodi was SVP, corporate research and strategy overseeing and initiating research for media and technology business units at Gemstar-TV Guide International (now Rovi). Previous to Gemstar-TV Guide was Vice President of Entertainment and Digital Media at Frank N. Magid Associates focusing on business development and providing research and consulting services to digital media and traditional media clients.  She also co-founded Magid&#8217;s successful digital media research and consulting practice in the very early days of the Web (1995).  </p>","image":{"available_sizes":[[[150,144],"assets/images/resized/0007/6164/76164v2-max-150x150.jpg"],[[250,240],"assets/images/resized/0007/6164/76164v2-max-250x250.jpg"],[[450,433],"assets/images/resized/0007/6164/76164v2-max-450x450.jpg"]],"attribution":"<p>personal files</p>"},"degrees":[{"degree_type":"PhD","subject":"Communication Theory & Research","institution":"USC - Annenberg School for Communication","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}