{"first_name":"Jody","last_name":"Bailey","permalink":"jody-bailey","crunchbase_url":"http://www.crunchbase.com/person/jody-bailey","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Vovici","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed May 13 13:07:45 UTC 2009","updated_at":"Sat May 16 21:43:24 UTC 2009","overview":"<p>Jody provides executive leadership to the Development and Data Center Operations teams. Jody brings with him over 15 years of experience building highly effective engineering teams. At Vovici Jody is responsible for the design, development and quality assurance of all Vovici’s products as well as managing Data Center Operations in order to ensure the success of Vovici’s SaaS products and customers.</p>\n\n<p>Jody has an excellent track record of building high performance engineering teams that have designed and developed world class applications at companies such as VeriSign, Vastera and Fidelity Investments. Through the development of highly motivated teams and the introduction of new process and procedures, Jody has consistently been able to reduce time to market, improve quality as well as predictability of product delivery for both domestic and offshore teams. Prior to Vovici, Jody and his teams were responsible for the design, development and delivery of high availability systems that scale to billions of real-time transactions for RFID/Supply Chain systems critical to protecting health care delivery as well as the registry for .COM and .NET.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP, Development","firm":{"name":"Vovici","permalink":"vovici","type_of_entity":"company","image":{"available_sizes":[[[105,27],"assets/images/resized/0004/3916/43916v2-max-150x150.png"],[[105,27],"assets/images/resized/0004/3916/43916v2-max-250x250.png"],[[105,27],"assets/images/resized/0004/3916/43916v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}