{"first_name":"Joe","last_name":"Cothrel","permalink":"joe-cothrel","crunchbase_url":"http://www.crunchbase.com/person/joe-cothrel","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Lithium Technologies","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Aug 09 05:08:45 UTC 2007","updated_at":"Sun May 16 20:31:39 UTC 2010","overview":"<p>Widely recognized for his pioneering work in online communities in business, Joe serves as Lithium&#8217;s Chief Community Officer. In this role, Joe is responsible for thought-leadership, research, and innovations that will drive the next generation of successful enterprise customer communities.</p>\n\n<p>Joe&#8217;s work with online communities began in 1996, when he conducted the first comprehensive research study into successful practices for managing online communities. Since that time, he has worked as a consultant and researcher with nearly 300 companies using online communities to create more productive relationships with customers, partners, and employees.</p>\n\n<p>While at Lithium, Joe has played a key role in launching successful communities for large, enterprise companies such as Barnes &amp; Noble, Comcast, Juniper Networks, Linksys, PayPal, Symantec, and many others. Joe&#8217;s previous roles include Vice President of Community Management Services at Lithium and Vice President of Research at Participate Systems. Prior to that, Joe worked as a senior researcher in the Global Best Practices Group, now part of PriceWaterhouseCoopers, where he focused on collaborative technologies, corporate performance measurement, and business process improvement. He began his career in a utilities and telecommunications consulting practice at Ernst &amp; Young.</p>\n\n<p>In addition to his work with clients, Joe has devoted significant time to advancing the understanding of online communities in business. With partners in academia, he studied the impact of online communities on marketing (Texas A&amp;M University), social and organizational dynamics (University of Toronto), and social networks (University of Virginia). His articles have appeared in journals such as MIT Sloan Management Review, IBM&#8217;s Knowledge Directions, Strategy &amp; Leadership, and The Journal of Computer-Mediated Communication. He has been quoted in CIO, Computerworld, the New York Times, the Wall Street Journal, Forbes, Fortune, and other publications. His work has been cited in more than 50 books on the subject of online community, collaboration, commerce, and knowledge management.</p>\n\n<p>Joe holds an M.A. from the University of Michigan and a B.A. from the University of Toledo.</p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0000/9460/9460v1-max-150x150.jpg"],[[80,80],"assets/images/resized/0000/9460/9460v1-max-250x250.jpg"],[[80,80],"assets/images/resized/0000/9460/9460v1-max-450x450.jpg"]],"attribution":null},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Community Officer","firm":{"name":"Lithium Technologies","permalink":"lithiumtechnologies","type_of_entity":"company","image":{"available_sizes":[[[150,54],"assets/images/resized/0000/4156/4156v8-max-150x150.png"],[[165,60],"assets/images/resized/0000/4156/4156v8-max-250x250.png"],[[165,60],"assets/images/resized/0000/4156/4156v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}