{"first_name":"Joe","last_name":"McCarthy","permalink":"joe-mccarthy","crunchbase_url":"http://www.crunchbase.com/person/joe-mccarthy","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"http://gumption.typepad.com","blog_feed_url":"http://gumption.typepad.com/blog/index.rdf","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon May 26 19:51:03 UTC 2008","updated_at":"Sat May 31 11:11:56 UTC 2008","overview":"<p>Joe McCarthy is a Social Technologist, dedicated to the design, development and deployment of technologies that bridge the gaps between the digital and physical worlds to help people relate to the other people, places and things around them.</p>\n\n<p>Joe McCarthy is in the people business, serving technology. He has spent the past 12 years instigating the design, development and deployment of technologies to help people discover, relate to and better enjoy the other people, places and things around them. These serendipity-promoting applications serve to bridge gaps between people by bridging gaps between the digital and physical worlds, enabling people to share the richness of their online lives in the physical contexts where they feel - or want to feel - a sense of community and connection.</p>\n\n<p>Joe holds a Ph.D. in Computer Science from the University of Massachusetts - where his thesis integrated natural language processing and machine learning in the application area of information extraction - as well as an M.S. in Computer Science (specializing in Software Engineering) from Rensselaer Polytechnic Institute and a B.A. in Philosophy from Ripon College. Having since published numerous papers - and chaired conferences - in the fields of Ubiquitous Computing and Computer-Supported Cooperative Work (or as Joe likes to think of it, computer-supported cooperative whatever), he is no longer quite sure how to categorize himself&#8230; and is increasingly comfortable with that state of affairs.</p>\n\n<p>Prior to joining Strands, Joe enjoyed roles as a Principal Scientist at Nokia, the Founder and Connector-in-Chief of Interrelativity, Inc., and a Senior Researcher at Intel Research and Accenture Technology Labs. Earlier chapters in his career include roles as Assistant Professor of Computer Science at the University of Hartford, a carpenter&#8217;s assistant and lead guitarist of the rock band Freeway Jam. He currently enjoys additional roles as husband, father, wine aficionado and blogger.</p>","image":{"available_sizes":[[[49,66],"assets/images/resized/0001/9402/19402v1-max-150x150.jpg"],[[49,66],"assets/images/resized/0001/9402/19402v1-max-250x250.jpg"],[[49,66],"assets/images/resized/0001/9402/19402v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.strands.com/corp/team.vm\" title=\"Strands\" rel=\"nofollow\">Strands</a></p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}