{"first_name":"Joe","last_name":"Balestrino","permalink":"joe-balestrino","crunchbase_url":"http://www.crunchbase.com/person/joe-balestrino","homepage_url":"http://joebalestrino.com","birthplace":"Brooklyn, NY","twitter_username":"joeybalestrino","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"seo, ppc, paid-search, social-edia","alias_list":null,"created_at":"Mon Jul 16 18:21:20 UTC 2012","updated_at":"Mon Jul 16 21:04:19 UTC 2012","overview":"<p>I have spent the last ten years perfecting the art of online marketing. I have spent countless hours teaching business owners and large corporations how to use online marketing effectively.</p>\n\n<p>I understand that no two businesses are alike, even within the same vertical. More importantly, I’m not afraid to roll up my sleeves and get my hands dirty. I’m the former owner of one of New York’s most prolific SEO firm and I will use my years of experience to get your business where it needs to be.</p>\n\n<p>I have had articles published online, in trade publications, participated in tele-seminars and even had a successful podcast on itunes (Over 15,000 Downloads per month). These tools I created were for anyone wanting to learn about online marketing.</p>\n\n<p>I have worked closely with other leading online marketers and enjoy sharing ideas and knowledge. The online space is always changing and being on top of trends and methods is what I do best.</p>\n\n<p>I have working knowledge of various digital media marketing areas including; search, display, video, social and mobile. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/joebalestrino","title":"LinkedIn Profile"},{"external_url":"http://joebalestrino.com","title":"Search Marketing Expert "},{"external_url":"http://vizualize.me/joebalestrino#.UARbgpF33s0ash=gmX9","title":"Visual Resume"}]}