{"first_name":"Joe","last_name":"Judge","permalink":"joe-judge","crunchbase_url":"http://www.crunchbase.com/person/joe-judge","homepage_url":"http://clearpossibilities.net/","birthplace":"Maryland, USA","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Clear Possibilities","born_year":1958,"born_month":11,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jul 06 13:01:28 UTC 2012","updated_at":"Fri Jul 06 19:29:03 UTC 2012","overview":"<p>Joe has spent his entire adult life working with people. In the early 1990’s Joe was asked to participate in the development of a leadership program for clergy within the Lutheran Church. Here he found a real passion for personal growth, understanding of organizational dynamics, motivational value systems as well as coaching others towards excellence. In 2000 Joe joined Staub Leadership Solutions in Greensboro, NC where a year later he was made both partner and president. Joe honed his skills while working 9 years at Staub, his clients ranging from large fortune companies to small family businesses. Joe’s specialty is in helping individuals; teams and organizations successfully align behaviors in order to achieve their stated objectives. With this comes a simple process for handling conflict, holding accountability, dreaming and developing teams that excel. Joe’s clients most appreciate his practical approach to helping them make real progress. In 2009 Joe stepped away from his responsibilities at Staub Leadership in order to focus more on writing, working with teams and individuals in transition, engaging in volunteer work and in short living a more balanced schedule and life. Joe created a company called Clear Possibilities.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0019/9221/199221v2-max-150x150.jpg"],[[150,150],"assets/images/resized/0019/9221/199221v2-max-250x250.jpg"],[[150,150],"assets/images/resized/0019/9221/199221v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO / Co-Founder","firm":{"name":"Clear Possibilities","permalink":"clear-possibilities","type_of_entity":"company","image":null}},{"is_past":true,"title":"President","firm":{"name":"Staub Leadership","permalink":"staub-leadership","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}