{"first_name":"Joe","last_name":"Hage","permalink":"joe-hage","crunchbase_url":"http://www.crunchbase.com/person/joe-hage","homepage_url":"http://www.universant.com","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jun 13 23:35:34 UTC 2008","updated_at":"Wed Jun 18 01:05:21 UTC 2008","overview":"<p>Joe Hage’s career spans more than 28 years in the software industry – 8 of which were in software startup environments – where he held various positions in executive leadership, software development, project management, product management, consulting, sales, and marketing.</p>\n\n<p>Joe Hage is co-founder of Universant and has served as its chairman of the board since the company’s inception in 2006. Prior to Universant, Joe Hage spent 9 years at Agile Software, a product lifecycle management enterprise software company in San Jose, CA, where he was Senior Vice President and General Manager of the SME Solutions Division, Senior Vice President of Products and Technology, and Vice President of Corporate Marketing and eServices.</p>\n\n<p>Prior to Agile, Joe Hage held leadership positions at Starfish Software, Novell, Borland, Prime Computer, Data General, and Honeywell in the United States, Canada, and Europe, Middle East, and Africa (EMEA). Joe Hage is also an advisory board member for numerous startups, an active entrepreneur and angel investor in Silicon Valley, and a partner with PacRim Venture Partners.</p>\n\n<p>Joe Hage holds a B.S. in Electrical and Computer Engineering from Northeastern University, and an M.B.A. from Santa Clara University.</p>","image":null,"degrees":[{"degree_type":"Master","subject":"Business Administration","institution":"Santa Clara University","graduated_year":2001,"graduated_month":null,"graduated_day":null},{"degree_type":"Bachelor of Science","subject":"Electrical & Computer Engineering","institution":"Northeastern University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}