{"first_name":"Joe","last_name":"Lacob","permalink":"joe-lacob","crunchbase_url":"http://www.crunchbase.com/person/joe-lacob","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 28 17:13:44 UTC 2008","updated_at":"Fri Jul 16 04:44:25 UTC 2010","overview":"<p>Joe Lacob has been a partner at Kleiner Perkins Caufield &amp; Byers since 1987. He has been closely involved with KPCB&#8217;s investments in over fifty life science companies, including the start-up or incubation of a dozen ventures and with KPCB&#8217;s medical technology practice, which includes over thirty therapeutic and diagnostic medical device companies. Joe is also an active investing partner in KPCB&#8217;s Internet company initiative; he led the firm&#8217;s investment in AutoTrader and Sportsline. Most recently, Joe has focused on energy investments as part of KPCB’s growing initiative in the fields of Greentech and alternative energy. Investments include Terralliance, in efficient oil and gas exploration; GloriOil, in microbial enhanced oil recovery; and an incubation in novel geothermal energy.</p>\n\n<p>Joe currently serves on the Board of Directors of two public companies, Align Technology and Orexigen as well as several other privately-held companies including Ophthonix, NeuroPace, TherOx, Arresto Biosciences and Codon Devices.</p>\n\n<p>Joe is actively involved in industry organizations including the American Heart Association and the AHA Roundtable. He is also very involved at Stanford University, serving on advisory boards at the Medical Center, Business School and Athletic Department.</p>\n\n<p>Joe received his Bachelor&#8217;s in Biological Sciences from the University of California at Irvine, his Master&#8217;s in Public Health from UCLA and his M.B.A. from the Stanford Graduate School of Business.</p>","image":{"available_sizes":[[[144,150],"assets/images/resized/0009/3747/93747v1-max-150x150.png"],[[148,154],"assets/images/resized/0009/3747/93747v1-max-250x250.png"],[[148,154],"assets/images/resized/0009/3747/93747v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Kleiner Perkins Caufield & Byers","permalink":"kleiner-perkins-caufield-byers","type_of_entity":"financial_org","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/0998/10998v8-max-150x150.jpg"],[[250,250],"assets/images/resized/0001/0998/10998v8-max-250x250.jpg"],[[450,450],"assets/images/resized/0001/0998/10998v8-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}