{"first_name":"JOE","last_name":"MANDATO","permalink":"joe-mandato","crunchbase_url":"http://www.crunchbase.com/person/joe-mandato","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon May 25 11:01:57 UTC 2009","updated_at":"Mon May 25 11:08:31 UTC 2009","overview":"<p>Joe joined De Novo Ventures as a Managing Director in March 2003. Prior to joining De Novo, Joe served as Chairman of Confer Software, a developer of software used to create efficiencies and streamline processes in healthcare. He also served as President/CEO of Origin Medsystems, a developer of minimally invasive surgical devices for use in general, cardio-thoracic, and ob-gyn surgery, which was acquired by Eli Lilly &amp; Company in 1992 and spun out as one of the units which formed Guidant Corporation in 1995. At Guidant, Mr. Mandato served as a member of the founding management committee and CEO of two of its five operating units, Origin and Heart Rhythm Technology. He also co-founded and served as CEO of Gynecare, a women’s health spin-out of Guidant, which was acquired by Johnson &amp; Johnson. Subsequent to his tenure at Guidant, he served as an Entrepreneur-in-Residence at Mayfield Fund, a venture capital firm. Earlier in his career, he was CEO of Ioptex Research, a developer of intraocular lenses used in cataract surgery, which was acquired by Smith &amp; Nephew PLC. He joined Ioptex from Cilco AG in Zug, Switzerland, the Europe, Middle East, and Africa headquarters of a unit of Rorer Group, where he served as CEO. He began his career in healthcare as a Captain in the U.S. Army Medical Service Corps.</p>\n\n<p>Joe received his Doctor of Management from Case Western Reserve University, and serves on its Board of Trustees. His research focused on the evolving role of boards in ensuring effective governance. He serves on the adjunct faculty of The University of San Francisco’s Graduate School of Management and co-teaches the course Medical Device Innovation at Stanford University. He also serves on the boards of The Institute of International Education and Save the Children.</p>\n\n<p>Joe sits on the boards of Axogen, Endogastric Solutions, Facet Solutions, Hansen Medical (NASDAQ: HNSN), iScience Interventional, InSound Medical, Kolis Scientific, Luminous Medical, M2 Medical and WaveTec Vision Systems. </p>","image":{"available_sizes":[[[99,148],"assets/images/resized/0004/5375/45375v1-max-150x150.jpg"],[[99,148],"assets/images/resized/0004/5375/45375v1-max-250x250.jpg"],[[99,148],"assets/images/resized/0004/5375/45375v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"MD","firm":{"name":"De Novo Ventures","permalink":"de-novo-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[140,77],"assets/images/resized/0004/5371/45371v1-max-150x150.jpg"],[[140,77],"assets/images/resized/0004/5371/45371v1-max-250x250.jpg"],[[140,77],"assets/images/resized/0004/5371/45371v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}