{"first_name":"Joe","last_name":"Trebley","permalink":"joe-trebley","crunchbase_url":"http://www.crunchbase.com/person/joe-trebley","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jun 21 08:36:44 UTC 2009","updated_at":"Sun Jun 21 08:37:06 UTC 2009","overview":"<p>Dr. Trebley brings a broad range of experience to In-vivo Ventures. While completing his doctoral degree in pharmacology at Purdue University, Dr. Trebley performed extensive research relation to the effects of oncogenes on breast cancer treatment and prevention.</p>\n\n<p>Dr. Trebley is currently serving as the Director of Technology Development for Kylin Therapeutics, an In-vivo portfolio company. In addition to his expertise in cancer research, Dr. Trebley brings valuable licensing and business development experience to the In-vivo team. While working at the Purdue Research Foundation, he was involved in a number of successful medical device and biotech start-up companies including Nanovis Inc., Comentis Inc., Paxvax Inc., Moerae Matrix Inc., and Andara Life Sciences, Inc. In support of these companies, Dr. Trebley provided a number of services including intellectual property and regulatory approval strategies, licensing, and business development.</p>\n\n<p>Dr. Trebley has an A.B. in Chemistry from Wabash College and a Ph.D. from the Purdue University School of Pharmacy.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"In-vivo Ventures","permalink":"in-vivo-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,56],"assets/images/resized/0004/9956/49956v1-max-150x150.jpg"],[[202,76],"assets/images/resized/0004/9956/49956v1-max-250x250.jpg"],[[202,76],"assets/images/resized/0004/9956/49956v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}