{"first_name":"Joe","last_name":"Spinelli","permalink":"joe-spinelli","crunchbase_url":"http://www.crunchbase.com/person/joe-spinelli","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Velocity Financial Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Mar 19 21:38:05 UTC 2009","updated_at":"Wed May 25 17:45:28 UTC 2011","overview":"<p>Joe joined the founding team of Velocity’s venture group in 2007. Joe led the firm’s investments in FolioDynamix and Satcon Technology Corporation, and has assisted in underwriting investments including Avnera, Brainshark, GameLogic, nCircle, Persystent, SEVEN, SoloPower, and Vormetric.</p>\n\n<p>Prior to joining Velocity, Joe worked in investment banking at Harris Williams &amp; Co., focused exclusively on sell-side M&amp;A advisory services for middle-market companies. While at Harris Williams, Joe assisted in the launch of the firm’s dedicated technology practice out of the Boston office. Joe earned a B.S., summa cum laude, in Business Management from Babson College, and was the recipient of the Earl K. Bowen Award for excellence in quantitative methods.</p>\n\n<p>In addition to his passion for emerging and vintage technologies, Joe is an avid soccer player, an accomplished percussionist, and an (in)famous DJ in the metro Boston area. Joe is a member of the International Association for the Studies of Popular Music (IASPM-US), and has presented scholarly works on the promotional strategies of independent recording artists. Joe also serves on the board of trustees of the Boston Classical Orchestra.</p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0003/9064/39064v2-max-150x150.jpg"],[[150,200],"assets/images/resized/0003/9064/39064v2-max-250x250.jpg"],[[150,200],"assets/images/resized/0003/9064/39064v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Velocity Financial Group","permalink":"velocity-financial-group","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}