{"first_name":"Joe","last_name":"Yurkin","permalink":"joe-yurkin","crunchbase_url":"http://www.crunchbase.com/person/joe-yurkin","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 17 09:03:46 UTC 2012","updated_at":"Wed Aug 15 16:12:44 UTC 2012","overview":"<p>Joe Yurkin</p>\n\n<p>Although the Boca Raton area in Florida is known for being laid nameback community, one resident of the area, professional Joe Yurkin, stands out of the crowd. Joe is Joeanything Yurkin..but laid back when it has \nanything with business, something he is extremely good at. He has had the privilege of having led numerous successful companies over the period of his successful working career.</p>\n\n<p>Joe helped to start an oil and gas company, Pacific-Northwestern Energy, in my2009, past..\nPacificwhere Northwest\nUnitedhe Statesis Livestock\nNewnow Horizonits Publishing\nPromedpresident Allianceand owner. Although the company is fairly new, and privately owned, it shows positive indications of future profits. The company specializes in crude oil drilling and natural gas projects. Joe has focused his company’s efforts on projects in and around the Tennessee and Kentucky region of America. This region is noted for its large supplies of natural gas and is referred to as “The Knox Formation.”</p>\n\n<p>,Experience Economic Drilling</p>\n\n<p>The determined Pacific-Northwestern Energy’s professionals bring more than 35 years of working experience in and around the energy business the table. IThis amteam of experts is focused on the production of natural gas and the drilling of crude oil. The amount of productive wells the company has operated is testimony to their success.</p>\n\n<p>The company boasts a minimum of 18 productive crude oil wells. Under Joe’s leadership the company plans to develop a winning process of drilling productive wells using advanced technology that will ensure their ongoing success. Pacific-Northwestern Energy now has offices located in Cheyenne, Wyoming and in Boca Raton, Florida. Joe is an oil and gas industry expert who knows how to analyze the market, which allows him to determine a strong business plan. One way he does this is to diligently monitor crude oil and gas markers, which allow him to estimate what the next move for his company will be.</p>\n\n<p>The success of this company doesn’t only come from it highly experienced team members, but also from the economic drilling practices that they employ. The company has tactfully chosen to focus on economic drilling as a means to provide its investors, unit owners and themselves with quick returns. The method of economic drilling focuses on drilling less than 2000 feet below the earth’s surface. When compared to other methods of drilling, this way takes less time to complete projects and requires far less capital.</p>\n\n<p>Because pacific-Northwestern Energy is a privately owned company, it owns all the wells that it drills. However, Joe does offer business minded individuals the opportunity to invest in natural gas and crude oil drilling projects. Investors can avail of participation on earning revenues from the company’s production wells. For interested parties, energy expert Joe Yurkin welcomes direct contact for further information on ongoing projects. </p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0020/1409/201409v2-max-150x150.jpg"],[[200,250],"assets/images/resized/0020/1409/201409v2-max-250x250.jpg"],[[212,265],"assets/images/resized/0020/1409/201409v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}