{"first_name":"Joe","last_name":"Costello","permalink":"joe-costello","crunchbase_url":"http://www.crunchbase.com/person/joe-costello","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 04 17:29:36 UTC 2010","updated_at":"Wed Aug 04 18:10:10 UTC 2010","overview":"<p>Co-Founder, Chairman and Chief Executive Officer of Orb Networks Inc.</p>\n\n<p>Joe is highly regarded for his business acumen and bold moves in the high-tech industry. In 1997, Chief Executive Magazine named Joe the top performing chief executive officer of all publicly traded companies in North America. He also made Upside Magazine&#8217;s 1997 &#8220;Elite 100&#8221; list of the top executives leading the digital revolution. In addition to his position at Orb Networks, Joe is chairman of think3, a global provider of product design and development software solutions, where he also previously served as chief executive officer. Prior to think3, Joe was president and chief executive officer at Cadence Design Systems, Inc., for more than a decade. Under his leadership, Cadence became the world&#8217;s leading supplier of electronic EDA software and services and one of the 10 highest-grossing software vendors in the world. Joe also acts as chairman of a number of other privately-held companies that include Readio, Abazab, SpeakESL and Soliloquy Learning. Joe holds a Bachelor of Science degree in mathematics and physics from Harvey Mudd College, a Master of Science degree in physics from Yale University and a Master of Science degree in physics from the University of California, Berkeley.</p>","image":{"available_sizes":[[[100,120],"assets/images/resized/0009/6017/96017v2-max-150x150.jpg"],[[100,120],"assets/images/resized/0009/6017/96017v2-max-250x250.jpg"],[[100,120],"assets/images/resized/0009/6017/96017v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}