{"first_name":"Joe","last_name":"Azzata","permalink":"joe-azzata","crunchbase_url":"http://www.crunchbase.com/person/joe-azzata","homepage_url":"http://www.ecareer.com","birthplace":"New Yrok","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1959,"born_month":5,"born_day":10,"tag_list":"","alias_list":null,"created_at":"Tue Jul 31 21:47:07 UTC 2012","updated_at":"Sat Aug 04 14:01:19 UTC 2012","overview":"<p>Joe Azzata is the founder and CEO of eCareer, headquartered in Boca Raton, Florida, eCareer is an early-stage high growth Internet marketing company. Through the development of branded career websites organized into specialized “Internet Job Verticals,” the company’s goal is to provide the most effective jobadvertising platform in the marketplace. Focused on the use of the latest technologies, widespread and emerging mobile capabilities and the integration of social/professional networking tools, eCareer will specifically address those career sectors with high demand, heavy recruiting and staffing activities as well as forecasted longterm\nshortages of skilled professionals while attracting clients with\nstrong advertising budgets.</p>\n\n<p>Joseph Azzata is a recognized expert and leader in the area of healthcare staffing, with a specialized emphasis on web-based and automated recruiting processes.</p>\n\n<p>From 2002 to 2010, Joe Azzata had been the CEO and was a co-founder of Medical Connections Holdings, Inc. and its wholly owned subsidiary Medical Connections. Inc. Prior to his involvement with Medical Connections, Mr. Azzata had equity interest in a regional investment banking firm, which was profitably sold in 2002. He resigned from Medical Connections in July of 2010 to dedicate his full attention to eCareer Connections.</p>\n\n<p>Joe was instrumental in the extraordinary growth and expansion of Medical Connections, a national and publicly-held healthcare staffing firm, from its inception. In 2007, Medical Connections was awarded the Gold Seal Certification in Healthcare Staffing from the Joint Commission on Healthcare Staffing. In 2009, Medical Connections was listed as the seventh-fastest-growing staffing firm in the U.S. by The Staffing Industry Analysts, the leader in staffing industry research and analysis. This was the first time public companies were included in the list, and Medical Connections was the only public firm honored to be recognized in the “Fastest Growing Staffing Companies” ranking ever</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}