{"first_name":"Joe","last_name":"Cassara","permalink":"joe-cassara","crunchbase_url":"http://www.crunchbase.com/person/joe-cassara","homepage_url":"http://www.youneedmyguy.com","birthplace":"Rochester, NY","twitter_username":"joecassara","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Sep 11 15:11:13 UTC 2012","updated_at":"Tue Sep 18 16:58:52 UTC 2012","overview":"<p>Joe Cassara is Founder and CEO of You Need My Guy.</p>\n\n<p>You Need My Guy, funded by KAYWEB Angels out of Sydney &amp; New York City, is the best place to manage recommendations online. You Need My Guy injects social networks into the way we hire people. </p>\n\n<p>Prior to launching You Need My Guy, Joe ran his own consulting practice at Cassara Management Group, engineering ideas to grow businesses by creating and doing. A true communicator, Mr. Cassara adds value by driving progress across teams. Joe specializes in business development, startups, and bringing clarity and progress to his clients.  </p>\n\n<p>Joe also currently serves as Managing Partner of Harvest Ventures, an early stage venture-funding firm, and Mentor with StartFast, a venture accelerator out of Syracuse, NY. </p>\n\n<p>Mr. Cassara earned his BS from Syracuse University with a dual degree in Entrepreneurship and International Finance. In his time at Syracuse, Joe earned the Entrepreneur of the Year award for creating a profitable business and selling it back to the University. He was also named a Kauffman Scholar, leading teams to consult startup businesses in the city of Syracuse.</p>\n\n<p>Joe lives in Webster, NY with his wife and 3 children.</p>","image":{"available_sizes":[[[150,132],"assets/images/resized/0021/0877/210877v2-max-150x150.jpg"],[[250,220],"assets/images/resized/0021/0877/210877v2-max-250x250.jpg"],[[353,312],"assets/images/resized/0021/0877/210877v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}