{"first_name":"Joel","last_name":"J Rodriguez","permalink":"joel-j-rodriguez","crunchbase_url":"http://www.crunchbase.com/person/joel-j-rodriguez","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Commonwealth Capital Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Sep 24 12:48:20 UTC 2010","updated_at":"Sat Dec 11 08:57:58 UTC 2010","overview":"<p>Joel J. Rodriguez is an Associate at Commonwealth Capital Ventures, a technology-focused venture capital firm based in Waltham, MA. </p>\n\n<p>Prior to joining Commonwealth in 2009, Joel was a Senior Associate Consultant in the New York office of Bain &amp; Company, a global management consulting firm.  At Bain, he worked in the Private Equity Group performing strategic diligence for large private equity funds in a variety of industries including financial services, steel, cable, food service, music, and gaming. During his time at Bain, he spent a six month sabbatical working at both Greentech Capital Advisors, a startup cleantech advisory and investment management firm based in New York, NY, and Telesco &amp; Associates, a warehousing and distribution company based in South Kearny, NJ.  Before joining Bain in 2006, he participated in a summer analyst program in the Mergers &amp; Acquisitions Group of the Investment Banking Division at Credit Suisse. </p>\n\n<p>Joel graduated with Cum Laude honors from Duke University in 2006 with a B.S. in economics. At Duke, he was CEO of Devil’s Delivery Service, Inc., Duke’s largest student-run business. He currently serves on the Board of Directors for Duke Venture Forward (DVF), a leadership development program and entrepreneurial incubator based in Durham, NC that he co-founded.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Associate","firm":{"name":"Commonwealth Capital Ventures","permalink":"commonwealth-capital-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,31],"assets/images/resized/0001/1750/11750v1-max-150x150.png"],[[246,52],"assets/images/resized/0001/1750/11750v1-max-250x250.png"],[[246,52],"assets/images/resized/0001/1750/11750v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.joeljrodriguez.com","title":"Webpage"},{"external_url":"http://www.twitter.com/joeljrodriguez","title":"Twitter"}]}