{"first_name":"Joel","last_name":"Bernheim","permalink":"joel-bernheim","crunchbase_url":"http://www.crunchbase.com/person/joel-bernheim","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jul 16 12:27:24 UTC 2012","updated_at":"Mon Jul 16 21:01:09 UTC 2012","overview":"<p>Joel Bernheim is Executive Vice President of a company called Asset Recovery Solutions, LLC. Headquartered in Des Plaines, Illinois, the company assists industries with past due accounts receivables. Joel and his team use new approaches and the latest technology to work toward solutions to solve dept problems. Payment plans that offer workable solutions are often set up for student loans, credit cards, and auto loans.</p>\n\n<p>Joel’s background groomed him for this position. He first worked as a bill collector. He was promoted to manager before the company he worked for was purchased by Sallie Mae. After leaving Sallie Mae, he formed Asset Recovery Solutions, LLC with some colleagues.</p>\n\n<p>Apart from his professional life, Joel has a tremendous passion for giving. He donates regularly to the American Cancer Society. He is also an avid supporter of Puck Cancer, an organization co-founded by Sue Padulo. Because of her love for ice hockey and skating, Sue was able to better cope with Hodgkin’s Lymphoma. She and her sister, Sandy Cross formed the organization in 2006.</p>\n\n<p>Joel also contributes to the Miracles in Progress organization. It helps those who have had brain injuries. He is interested in this particular charity because it covers many different facets of treatment. In addition to addressing medical needs, it includes therapy such as horseback riding and water therapy. The organization also provides education and support for the families of the injured.</p>\n\n<p>Joel spends some time reading and enjoys the classics such as those by Dickens. He also reads biographies, especially those of his favorite athletes. Being Jewish, he enjoys reading books on Judaism. </p>\n\n<p>Joel also enjoys trying new cuisines, while reading through cookbooks. He is particularly fond of the cookbooks published by the Food Network. Two of his favorite recipes are those for pineapple chicken, and swordfish tacos.</p>\n\n<p>Joel has a passion, too, for music, especially jazz. Louis Armstrong is one of his all time favorites. However, Joel Bernheim also likes big band and although he finds it hard to pick a favorite, he enjoys Duke Ellington. Joel Bernheim’s musical taste includes a fondness for Barry White and Etta James as well.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/1175/201175v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/1175/201175v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/1175/201175v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}