{"first_name":"Joel","last_name":"Klein","permalink":"joel-klein","crunchbase_url":"http://www.crunchbase.com/person/joel-klein","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Sun Jul 08 15:20:28 UTC 2012","updated_at":"Sun Jul 08 15:22:09 UTC 2012","overview":"<p>In January 2011, Joel I. Klein became CEO of the Education Division and Executive Vice President, Office of the Chairman, at News Corporation, where he also serves on the Board of Directors.  </p>\n\n<p>Prior to that, Mr. Klein was Chancellor of the New York City Department of Education where he oversaw a system of over 1,600 schools with 1.1 million students, 136,000 employees and a $22 billion budget.  He launched Children First in 2002, a comprehensive reform strategy that has brought coherence and capacity to the system and resulted in significant increases in student performance.  </p>\n\n<p>He is a former Chairman and CEO of Bertelsmann, Inc., a media company, and served as Assistant U.S. Attorney General in charge of the Antitrust Division of the U.S. Department of Justice until September 2000, and was Deputy White House Counsel to President Clinton from 1993-1995.  Mr. Klein entered the Clinton administration after 20 years of public and private legal work in Washington, D.C.  </p>\n\n<p>Mr. Klein received his BA from Columbia University where he graduated magna cum laude in 1967, and earned his J.D. from Harvard Law School in 1971, also graduating magna cum laude.  He has received honorary degrees from Amherst College, Columbia University, Dartmouth College, Duke University, Fordham Law School, Georgetown Law Center, Macaulay Honors College at CUNY, Manhattanville College, New York Law School, and St. John’s School of Education. He was selected by Time Magazine as one of Ten People who Mattered in 1999, by U.S. News and World Report as One of America’s 20 Best Leaders in 2006, and was given the prestigious NYU Lewis Rudin Award in 2009 and Manhattan Institute Alexander Hamilton Award in 2011. </p>","image":{"available_sizes":[[[101,150],"assets/images/resized/0019/9481/199481v1-max-150x150.jpg"],[[169,250],"assets/images/resized/0019/9481/199481v1-max-250x250.jpg"],[[304,450],"assets/images/resized/0019/9481/199481v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO Education Division","firm":{"name":"News Corporation","permalink":"newscorporation","type_of_entity":"company","image":{"available_sizes":[[[150,24],"assets/images/resized/0001/5110/15110v1-max-150x150.jpg"],[[250,41],"assets/images/resized/0001/5110/15110v1-max-250x250.jpg"],[[250,41],"assets/images/resized/0001/5110/15110v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}