{"first_name":"Joel","last_name":"Fontenot","permalink":"joel-fontenot","crunchbase_url":"http://www.crunchbase.com/person/joel-fontenot","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Netrake Corporation","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Apr 29 15:27:54 UTC 2009","updated_at":"Mon Nov 09 20:38:34 UTC 2009","overview":"<p>Mr. Fontenot is a Managing Partner of Trailblazer Capital.  At Trailblazer, Joel is responsible for all aspects of the General Partner of an early stage and growth capital venture fund.  Joel has brought to Trailblazer Capital unique insights built on his many years of banking, investing and early-stage technology company operating experience.  Through his investing activity at Trailblazer Capital, Joel sits on the Board of Directors of Spawn Labs, Inc. and NetSocket, Inc.</p>\n\n<p>Prior to joining Trailblazer Capital, Mr. Fontenot worked for Cisco Systems, Inc.  Joel joined Cisco through the acquisition of Metreos Corporation in June 2006.  Joel was a Director of Business Development in the Voice Technology Group and managed the partnerships and strategic alliances involving the Cisco Unified Application Environment and related application offerings from Cisco’s Voice Technology Group.  Mr. Fontenot’s first role at Cisco was Director of Product Marketing for the IP Communications Business Unit which resulted in the successful integration and introduction of the Metreos products into the Cisco sales channel.</p>\n\n<p>In the fall of 2002, Joel assisted Metreos Corporation in establishing itself as the first enterprise voice over IP applications platform for the development and deployment of innovative, media-rich IP communications applications.  Metreos enabled the enterprise to more effectively leverage and extend their investment in IP Telephony and allowed System Integrators, Independent Software Vendors, and Enterprise IT organizations to leverage a common environment for converged voice and data applications.  From the fall of 2003 until the Company’s sale to Cisco Systems, Inc., Mr. Fontenot served as Metreos’ CEO and was instrumental in securing equity and debt funding, establishing strategic relationships, closing its first customers and the sale of the Company to Cisco.</p>\n\n<p>Previously, Mr. Fontenot co-founded Netrake Corporation and was responsible for all areas of the Company which created a unique, patented IP network processing system capable of recognizing, remembering and responding in real-time to network traffic on a session basis.  Mr. Fontenot’s strategic input brought the company from concept in January 2000 to successful beta trials in June 2002.</p>\n\n<p>Mr. Fontenot is a member of the Executive Board of the Bobby B. Lyle School of Engineering at Southern Methodist University and was appointed by Governor Perry to the Texas Emerging Technology Fund Advisory Committee.  He also serves on the Advisory Board of Silver Creek Ventures and the Board of the Cistercian Preparatory School.</p>\n\n<p>Joel holds a Bachelor of Arts degree in Economics from The University of Texas at Austin and a Masters of Business Administration from Southern Methodist University.</p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0006/5534/65534v2-max-150x150.jpg"],[[250,167],"assets/images/resized/0006/5534/65534v2-max-250x250.jpg"],[[300,201],"assets/images/resized/0006/5534/65534v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"Economics","institution":"The University of Texas at Austin","graduated_year":1983,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"Southern Methodist University","graduated_year":1988,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Partner","firm":{"name":"Trailblazer Capital","permalink":"trailblazer-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,34],"assets/images/resized/0005/4927/54927v1-max-150x150.jpg"],[[250,57],"assets/images/resized/0005/4927/54927v1-max-250x250.jpg"],[[450,104],"assets/images/resized/0005/4927/54927v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"CEO","firm":{"name":"Metreos Corporation","permalink":"metreos-corporation","type_of_entity":"company","image":{"available_sizes":[[[150,32],"assets/images/resized/0004/2853/42853v2-max-150x150.png"],[[250,54],"assets/images/resized/0004/2853/42853v2-max-250x250.png"],[[450,98],"assets/images/resized/0004/2853/42853v2-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Founder and President","firm":{"name":"Netrake","permalink":"netrake","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}