{"first_name":"Joel","last_name":"Laffer","permalink":"joel-laffer","crunchbase_url":"http://www.crunchbase.com/person/joel-laffer","homepage_url":"http://www.gramercyone.com","birthplace":"New York","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"GramercyOne","born_year":1980,"born_month":9,"born_day":9,"tag_list":"","alias_list":null,"created_at":"Mon Oct 29 03:08:56 UTC 2012","updated_at":"Sat Nov 03 22:49:59 UTC 2012","overview":"<p>As VP of Marketing for GramercyOne, Joel leads a team responsible for helping GramercyOne connect with the millions of local merchants around world that are aiming to achieve their full potential. To make this connection, Joel manages the Brand Marketing, Acquisition Marketing, Corporate Communications and Product Marketing functions for the company.</p>\n\n<p>Prior to GramercyOne, Joel was VP of Marketing for Yodle, the largest independent provider of local search marketing to over 30,000 local and national brands in the U.S. Joel was a member of the leadership team that built the company from $3M of revenue and 50 employees in 2007 to $90M of revenue and 750 employees in 2011. He played an integral role in building out Yodle’s direct sales model, which has become the industry standard, through disciplined marketing and sales operations initiatives. Prior to Yodle, Joel held marketing leadership positions at Register.com (recently acquired by Web.com) and FatWire Software (recently acquired by Oracle).</p>\n\n<p>Joel earned a Bachelor of Arts in Advertising from Bloomsburg University. He also serves as an Advisory Board member for Savored.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP, Marketing","firm":{"name":"Booker  ","permalink":"booker-software","type_of_entity":"company","image":{"available_sizes":[[[150,75],"assets/images/resized/0012/5701/125701v4-max-150x150.jpg"],[[250,125],"assets/images/resized/0012/5701/125701v4-max-250x250.jpg"],[[400,200],"assets/images/resized/0012/5701/125701v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}