{"first_name":"Johan","last_name":"Ronnestam","permalink":"johan-ronnestam","crunchbase_url":"http://www.crunchbase.com/person/johan-ronnestam","homepage_url":"http://www.ronnestam.com","birthplace":"Stockholm, Sweden","twitter_username":null,"blog_url":"http://www.ronnestam.com","blog_feed_url":"http://feeds.feedburner.com/BlogOfRonnestam","affiliation_name":"Unaffiliated","born_year":1971,"born_month":8,"born_day":20,"tag_list":"entrepenuer, digital-marketing-professional, digital-communication, advertising","alias_list":null,"created_at":"Mon Sep 29 17:21:25 UTC 2008","updated_at":"Mon Sep 29 18:53:56 UTC 2008","overview":"<p>Born 1971 and Raised in the suburbs of style city Stockholm, creativity was always a part of growing up.</p>\n\n<p>With a background as a former snowboard professional (with among others Greger Hagelin from WE and Per Holknekt from Odd Molly as sponsors) and one of the few in the world who nailed a 1440° spin, Johan Ronnestam started his career on the buyer side.\nMarketing exclusive golf brands such as Mizuno, King Cobra and Goldwin gave him insight into the demands of advertisers and consumers but foremost the complexity behind how products actually make it into the stores.</p>\n\n<p>Always full of ideas, Johan felt he needed to move on to the creative side of the business. Internet, on the rise in Sweden drew Johan into the digital revolution already in 1994. In 1998 however he joined Framfab, one of the late 90’s fast-moving companies. As a concept developer and key account manager Johan parted in creating award winning projects for clients like Vattenfall , Bredbandsbolaget, Nike Europe and Volvo Cars. He also held a position within Framfab Innovation. The incubator of new ideas within Framfab.</p>\n\n<p>After Framfab had grown in just two years from 130 employees to 3400, Johan felt he needed to move to a smaller organization. Abel &amp; Baker - in 2001 the worlds most awarded digital advertising company attracted me. At A&amp;B Johan tool part in winning the global account for adidas, but also worked with MTV, Nokia, Toyota, Årets Kock, ICA and the Red Cross.</p>\n\n<p>In 2002 I left Abel &amp; Baker to found something of his own - Foreign. Foreign - an ideas creator with focus on the communication of tomorrow - based in Stockholm, Sweden.</p>\n\n<p>Foreign quickly grew to 27 employees and was awarded in the Cannes Lions, D&amp;AD, New York Festivals, London International Advertising Awards, Epica, Clio, Cresta and other award shows every year since start up. Foreign launched both digital and integrated global campaigns for BMW Motorrad, MTV, H&amp;M, IKEA, Omega, Beckers, Com Hem, Intersport, Kosta Boda, adidas International and many more.</p>\n\n<p>In September 2008 Johan took the decision to close Foreign down after almost 7 years. </p>\n\n<p>Johan is now consulting within the same business on his own.</p>\n\n<p>Apart from Foreign Johan also founded WhiskyGrotto.com and Co-Founded PremierGoals.com.</p>\n\n<p>Thru the years, leadership and success has been important, but enjoying life, loyalty and sincerity is what drives me further. Johan considers his part in motivating adidas to let fairly small Foreign handle adidas global digital World Cup campaigns his proudest moment in business. The birth of his two daughters Ebba &amp; Linn is his proudest moment in life.</p>","image":{"available_sizes":[[[87,130],"assets/images/resized/0002/5862/25862v2-max-150x150.jpg"],[[87,130],"assets/images/resized/0002/5862/25862v2-max-250x250.jpg"],[[87,130],"assets/images/resized/0002/5862/25862v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}