{"first_name":"John","last_name":"Balestrieri","permalink":"john-balestrieri","crunchbase_url":"http://www.crunchbase.com/person/john-balestrieri","homepage_url":"http://www.johnbalestrieri.com","birthplace":"Willingboro, NJ","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1968,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Aug 16 19:25:22 UTC 2008","updated_at":"Mon Aug 18 17:59:40 UTC 2008","overview":"<p>Currently, Partner at Exit5, LLC.  A Digital Production company with offices in Winston Salem, NC and Boca Raton, Fl.</p>\n\n<p>John Balestrieri has extensive domestic and international experience in entertainment, technology, marketing communications, advertising and intellectual property. He brings an entrepreneurial sprit and extensive track record to large and small companies alike, with a successful reputation for building new divisions and offerings. Mr. Balestrieri is known in the industry as a technology innovator, having created or been part of several industry changing events, including IBM’s Kasparov vs. Deep Blue chess matchup, which garnered worldwide attention and helped make the Internet a household word.</p>\n\n<p>Since then John has furthered his career by merging entertainment, advertising and technology. Most recently he came from Audiopoint, Inc, a voice services ASP, where he was Chief Operating Officer responsible for all day-to-day operations and for changing the company from a consumer focused &#8220;Voice Portal&#8221; Service to a B2B (business-to-business) products company. He also led the redevelopment of the system architecture and applications to make it more flexible in rapid application development and adhere to emerging industry standards.</p>\n\n<p>Before Audiopoint, John was Executive Vice President, Interactive, for Signatures Network (FKA Sony Signatures), one of the world’s largest celebrity licensing and merchandising companies. At Signatures , he built a network of celebrity web sites ranging from Kissonline.com to Britneyspears.com within an integrated content, production and e-commerce environment.</p>\n\n<p>John also served as a Partner, Chief Technology Officer and Director of Operations for Ogilvy Interactive / OgilvyOne. He managed over 200 employees across North America and helped increase revenue from $2 million to $120 million in just 22 months. At Ogilvy Interactive, he was the winner of the 1999 Grand Clio, the first Interactive Clio (the most prestigious iaward in the international advertising and business communities), as well as a Gold Clio and a Silver Clio. These were awarded for his work on the IBM e-business campaign as well as IBM’s International Interactive Olympic efforts.</p>\n\n<p>A seasoned entrepreneur, John got his start in the new media industry as co-founder of BMS Productions, a traditional production house that later became his workshop for new media development. After honing his skills, John joined K2 Design, a New York-based interactive agency, to spearhead a variety of emerging corporate initiatives, including pioneering the first online &#8220;shopping malls&#8221; and e-commerce, and leading the industry in live-cybercast events. John also led the expansion of K2 Design into Europe, opening their first overseas office in Germany. He was involved in the launch of Cliqnow, one of the first online advertising networks, later sold to 24/7 Media. </p>\n\n<p>Some of Mr. Balestrieri’s clients include, Audi DE, Ford, IBM, AOL, Microsoft, Verizon, Ameritrade, Waterhouse Securities, American Express, Oppenheimer Funds, Chase Manhattan Bank, Lexis-Nexis, GTE, MCI, Hershey’s, Toy’s ‘R Us and Sears.</p>","image":{"available_sizes":[[[150,47],"assets/images/resized/0002/3779/23779v2-max-150x150.png"],[[250,78],"assets/images/resized/0002/3779/23779v2-max-250x250.png"],[[450,141],"assets/images/resized/0002/3779/23779v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}