{"first_name":"Johnson","last_name":"Y.N. Lau","permalink":"johnson-y-n-lau","crunchbase_url":"http://www.crunchbase.com/person/johnson-y-n-lau","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 11 03:35:07 UTC 2011","updated_at":"Wed May 11 03:36:13 UTC 2011","overview":"<p>Dr. Johnson Y.N. Lau is a successful pharmaceutical executive who has had extensive leadership experience in both scientific and business management.  As Chairman and CEO of Ribapharm, he launched the second largest biotech IPO in US history ($300 million). During his tenure at Ribapharm, he met or exceeded Wall Street expectations each and every quarter. Prior to Ribapharm, he served as the Head of Worldwide Research and Development for ICN Pharmaceuticals.  He played a key role in raising $525 million in convertible bonds that facilitated the restructuring of ICN and the partial spin-off of Ribapharm. Dr. Lau has established an excellent working relationship with a number of prominent investment banks and has extensive experience in establishing strategic partnerships and in negotiating licensing deals including key agreements with Hoffman-La Roche, Anadys, Schering-Plough and Metabasis. Dr. Lau served as the Senior Director of Antiviral Therapy at Schering-Plough from 1997-2000 where he played a significant role in the FDA approval of Ribavirin/Interferon and Pegylated interferon alpha-2b. Dr. Lau has more than 250 scientific publications in peer reviewed scientific journals, more than 50 editorials/reviews/chapters and has edited three books. He was a Managing Director at Roth Capital Partners at its headquarters in Newport Beach, California and is also a Director of the Board of Chelsea Therapeutics (CHTP) and other privately held companies.</p>","image":{"available_sizes":[[[105,132],"assets/images/resized/0013/4106/134106v1-max-150x150.jpg"],[[105,132],"assets/images/resized/0013/4106/134106v1-max-250x250.jpg"],[[105,132],"assets/images/resized/0013/4106/134106v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Executive Officer","firm":{"name":"Kinex Pharmaceuticals","permalink":"kinex-pharmaceuticals","type_of_entity":"company","image":{"available_sizes":[[[150,46],"assets/images/resized/0013/4104/134104v1-max-150x150.jpg"],[[250,76],"assets/images/resized/0013/4104/134104v1-max-250x250.jpg"],[[260,80],"assets/images/resized/0013/4104/134104v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}