{"first_name":"John","last_name":"Denniston","permalink":"john-denniston","crunchbase_url":"http://www.crunchbase.com/person/john-denniston","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 28 17:13:43 UTC 2008","updated_at":"Thu May 29 00:08:24 UTC 2008","overview":"<p>John Denniston is a Partner with Kleiner Perkins Caufield &amp; Byers. At KPCB, John has worked with a wide variety of portfolio companies, with a primary emphasis on the Greentech industry. John was a member of the KPCB Partner team that many years ago conceptualized and launched KPCB&#8217;s Greentech investment initiative. Since then, KPCB has been an active investor in the Greentech field, having invested in a large number of start-up companies across a wide variety of sectors. John is an active participant in KPCB’s Greentech Innovation Network, a network of business, academic and policy leaders who meet regularly to identify, and then pursue, the most important green technology and public policy innovations.</p>\n\n<p>He is actively involved in Greentech public policy issues, having testified before several Congressional committees. John serves on the Board of Advisors of the National Renewable Energy Labs. He is a frequent speaker at Greentech industry conferences.</p>\n\n<p>Prior to joining KPCB, John was a Managing Director and Head of Technology Investment Banking, Western U.S. at Salomon Smith Barney. He also served on the Investment Committees for both Salomon&#8217;s venture capital direct investment fund and CitiGroup&#8217;s venture capital fund-of-funds. Before that, he was a Partner at the law firm Brobeck, Phleger &amp; Harrison, where he was the Head of the firm&#8217;s Venture Capital Practice Group, co-head of its Information Technology Practice Group, and served on the Investment Committee for its venture capital fund.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Kleiner Perkins Caufield & Byers","permalink":"kleiner-perkins-caufield-byers","type_of_entity":"financial_org","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/0998/10998v8-max-150x150.jpg"],[[250,250],"assets/images/resized/0001/0998/10998v8-max-250x250.jpg"],[[450,450],"assets/images/resized/0001/0998/10998v8-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}