{"first_name":"John","last_name":"Cambier","permalink":"john-cambier","crunchbase_url":"http://www.crunchbase.com/person/john-cambier","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"IDEA Fund Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jun 05 11:56:48 UTC 2009","updated_at":"Fri Aug 03 19:12:17 UTC 2012","overview":"<p>John Cambier is a founding general partner at IDEA Fund Partners. Over the past 10 years, John has used a deep understanding of technology commercialization and company formation, along with his experience managing intellectual property, licensing and contracts, to help grow technology companies throughout the Southeast.</p>\n\n<p>At IDEA Fund Partners, John holds responsibilities for finance and investor relations functions, in addition to serving as a key member of the investment team and advisor to portfolio companies. John also serves as the Chief Financial Officer of NC IDEA and an advisor to its grants program, playing a key role in the company selection and mentoring process.</p>\n\n<p>John&#8217;s investments include Unitive Electronics (acquired by Amkor), Ziptronix, ISIC Corporation, Hexatech, Brightdoor Systems and Social Solutions. He currently serves as a director on the board of Brightdoor Systems and Sarda Technologies. John is also an observer on the boards of Axial Exchange, Hexatech and Social Solutions.</p>\n\n<p>Working in the technology sector since 1994, John has held various operational roles and was involved in the spin-off of four companies from MCNC, including the formation and ultimate sale of Cronos Integrated Microsystems to JDS Uniphase for $665 million in 2000.</p>\n\n<p>John received a B.A. in International Relations from Michigan State University and an M.B.A. from the University of North Carolina at Chapel Hill.</p>","image":null,"degrees":[{"degree_type":"Bachelor's of arts","subject":"International relations","institution":"Michigan State University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"IDEA Fund Partners","permalink":"idea-fund-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,55],"assets/images/resized/0002/9206/29206v5-max-150x150.png"],[[250,92],"assets/images/resized/0002/9206/29206v5-max-250x250.png"],[[450,166],"assets/images/resized/0002/9206/29206v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}