{"first_name":"John","last_name":"Aiello","permalink":"john-aiello","crunchbase_url":"http://www.crunchbase.com/person/john-aiello","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"SAVO","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jul 18 20:18:24 UTC 2008","updated_at":"Tue Jul 29 18:52:16 UTC 2008","overview":"<p>As CEO of SAVO, John is closely involved in all areas of the business with particular focus on vision/strategy, along with marketing, sales, and operations. He is also chief evangelist for promoting the importance and the business value of Sales Enablement in the various markets SAVO serves. </p>\n\n<p>While a classically-educated and trained marketer, John has spent his entire career at the crossroads of marketing and sales, developing and implementing innovative ways for these two critical disciplines to work together more effectively and efficiently to move the revenue needle. Since co-founding SAVO, John has been privileged to work closely with senior executives at Fortune 500, mid-market, and non-profit customers. Prior to SAVO, he served as Director of Marketing for a Chicago-area private high school, Brand Manager for the Miller Brewing Company, and Vice President of Sales and Marketing for Sundance Homes, a publicly traded homebuilder. John holds a BA from the University of Illinois and an MBA (Marketing/Finance) from Northwestern’s Kellogg School of Management.</p>\n\n<p>John is a very frequent speaker for the American Marketing Association, Kellogg, University of Chicago, University of Notre Dame and many other institutions on topics related to sales/marketing effectiveness and entrepreneurship. He has served on many boards and advisory teams, and currently serves on the Board of Directors for the Chicago Chamber of Commerce as well as the Board of Trustees at the Adler Planetarium. John, his wife, and their two beautiful boys live in the suburbs of Chicago.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Co-Founder & CEO","firm":{"name":"SAVO","permalink":"savo","type_of_entity":"company","image":{"available_sizes":[[[136,47],"assets/images/resized/0002/2367/22367v1-max-150x150.png"],[[136,47],"assets/images/resized/0002/2367/22367v1-max-250x250.png"],[[136,47],"assets/images/resized/0002/2367/22367v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}