{"first_name":"John","last_name":"C. Sharp","permalink":"john-c-sharp","crunchbase_url":"http://www.crunchbase.com/person/john-c-sharp","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat May 10 01:21:19 UTC 2008","updated_at":"Sat May 10 01:25:45 UTC 2008","overview":"<p>&#8220;Authentium&#8217;s co-founder and Chairman is John C. Sharp, former Managing Director for Asia of WorldSpace Corporation, a global satellite broadcaster based in Washington DC.</p>\n\n<p>Prior to WorldSpace, Mr. Sharp acted as Chairman &amp; CEO of Content and Systems, a Singapore-based boutique consultancy firm specializing in international regulatory negotiations and project management on behalf of international satellite system managers and broadcasters, and business development on behalf of technology development companies and organizations, including Sony Television, Muvee, the Strategic Intelligence Group, and the MIH Group. While at Content &amp; Systems, Mr. Sharp was an active participant in US-sponsored negotiations with the government of China concerning copyright law, and successfully concluded over forty program licensing deals with China-based content developers. At Singapore University technology annex Kent Ridge Digital Labs, the first MIT-certified technology lab established outside of the US, Mr. Sharp headed up a team of more than thirty Java and C++ developers assigned to two software development projects, and assisted in business development and bridging activities.</p>\n\n<p>Since co-founding Authentium in 1999, Mr. Sharp has raised more than $35 million in investment for Authentium, and has established Authentium as one of the fastest-growing and most innovative software-as-a-service companies in the security software industry.&#8221; (Source: <a href=\"http://www.authentium.com/mainv2/about.htm\" title=\"Authentium\" rel=\"nofollow\">Authentium</a>)</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder & Chairman","firm":{"name":"Authentium","permalink":"authentium","type_of_entity":"company","image":{"available_sizes":[[[150,59],"assets/images/resized/0001/8284/18284v1-max-150x150.png"],[[159,63],"assets/images/resized/0001/8284/18284v1-max-250x250.png"],[[159,63],"assets/images/resized/0001/8284/18284v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}