{"first_name":"John","last_name":"R. Nelson","permalink":"john-r-nelson","crunchbase_url":"http://www.crunchbase.com/person/john-r-nelson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Nov 30 17:45:02 UTC 2008","updated_at":"Sun Nov 30 17:53:42 UTC 2008","overview":"<p>John Nelson, a Venture Partner of Shepherd Ventures, has operating experience in both technology-related industries and investment finance. His international experience has emphasized the Asia-Pacific region where he has worked for nearly three decades involved in cross-border investments, multi-national manufacturing operations and market development.</p>\n\n<p>John has functioned as a Managing Director in six venture capital partnerships including California Capital Partners, Terra Nova Capital’s Can-Am Fund, Consortium Capital Partners, Ventana Global Funds’ Technology Gateway Funds, and Venture Management Group. He has also served as Acting CEO of two portfolio technology companies that relocated from Asia to the Inland Empire. In addition, John managed Pac-Rim Partners’ contract with the Commonwealth of Australia, functioning as that nation’s Investment Director, North America. In this capacity, he provided marketing and investment services related to mergers and acquisitions, joint ventures, technology transfers, and greenfields manufacturing projects. Formerly, John was Senior Vice President of Marketing for the Fortune-500 Company, National Computer Systems.</p>\n\n<p>John&#8217;s academic and research background includes Ph.D. work (ABD) with doctoral skill certification in computer sciences from the University of Oregon, a MA in Economics from Washington State University, and a BA from the University of Wisconson-Madison.  John has served on numerous boards of directors for both public and private companies.</p>","image":{"available_sizes":[[[126,150],"assets/images/resized/0003/0259/30259v1-max-150x150.jpg"],[[186,220],"assets/images/resized/0003/0259/30259v1-max-250x250.jpg"],[[186,220],"assets/images/resized/0003/0259/30259v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Venture Partner","firm":{"name":"Shepherd Ventures","permalink":"shepherd-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[108,150],"assets/images/resized/0003/0252/30252v1-max-150x150.jpg"],[[146,202],"assets/images/resized/0003/0252/30252v1-max-250x250.jpg"],[[146,202],"assets/images/resized/0003/0252/30252v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}