{"first_name":"John","last_name":"Posta","permalink":"john-posta-2","crunchbase_url":"http://www.crunchbase.com/person/john-posta-2","homepage_url":"http://www.jamcloud.com","birthplace":"Los Angeles","twitter_username":"jposta","blog_url":"http://jamcloud.com/blog/","blog_feed_url":"http://feeds.feedburner.com/jamcloud","affiliation_name":"Cuttle Media","born_year":null,"born_month":null,"born_day":null,"tag_list":"jamcloud, music-discovery, adobe-air, desktop-app, social-media","alias_list":null,"created_at":"Mon Apr 04 06:06:38 UTC 2011","updated_at":"Fri Apr 22 02:10:51 UTC 2011","overview":"<p>John Posta is a Senior-level Digital Agency Executive with 15 years of entertainment, production management, account management, marketing strategy, advertising, mobile marketing, branding, packaging, and agency management experience.</p>\n\n<p>He has helped nurture and grow some of the leading interactive agencies in Los Angeles over the past decade. After gaining a foothold in entertainment while at DreamWorks, he moved into new media, interactive content and digital advertising, where he has managed multiple teams and production departments responsible for delivering large-scale multi-million dollar web, media, mobile, and online marketing campaigns for clients in a wide variety of industries. His experience includes senior executive positions at DNA Studio (now WhittmanHart), Jetset Studios, BLITZ, BIG Interactive, Deadline Design (now mOcean Digital), and he recently helped jumpstart and finance a new startup in the digital signage and advertising industry.</p>\n\n<p>In 2009 John co-founded JamCloud, Inc., which developed the JamCloud social media application.  This free desktop app empowers you and your friends to collect, organize and share (in real time) the videos you love on the web. With JamCloud, you now have the ability to instantly see the videos your friends are watching, add them to your own collection and share them on Facebook® and Twitter®.</p>\n\n<p>A private beta version of the JamCloud social media application was just released in April of 2011.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder & CFO","firm":{"name":"JamCloud, Inc.","permalink":"jamcloud-inc","type_of_entity":"company","image":null}},{"is_past":true,"title":"Co-Founder & CEO","firm":{"name":"Cuttle Media","permalink":"cuttle-media","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/jpostajposta","title":"Twitter"},{"external_url":"http://www.linkedin.com/in/jposta","title":"LinkedIn"}]}