{"first_name":"John","last_name":"Mumaugh","permalink":"john-mumaugh","crunchbase_url":"http://www.crunchbase.com/person/john-mumaugh","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Nov 20 04:04:14 UTC 2012","updated_at":"Tue Nov 20 04:07:05 UTC 2012","overview":"<p>John Mumaugh heads up SFC&#8217;S Business development and sales efforts. SFC&#8217;s go to market strategy blends direct sales, channel sales and business development directed across the DOD and commercial markets. SFC is all about creating valuable corporate relationships, and the effect each of those relationships represents, not only to our bottom line, but to our core values and corporate strategy&#8221; John has more than 25 years experience in a wide range of disciplines including sales management, marketing, business development, information systems and online distribution, and has held officer positions at 3 major corporations. John was Senior Vice President of Marketing at Enable LLC, a joint venture of power and utilities titans Kinder Morgan and PacifiCorp that integrated and delivered consolidated services to retail customers. The service, called Simple Choice, was one of the nations first bundled energy, communications, entertainment and home services packages. This role built on Johns earlier experience as Vice President of Marketing at a division of Sears Home Services. John served as Vice President at Sabre and as Senior Director of Sales and Market Planning at American Airlines. In his duties at Sabre, John was responsible for global sales and marketing, global customer service, and product development. John was also responsible for the global customer service operations of American Airlines Sabre Division. At the same time, John managed American Airlines annual corporate marketing budget and profit plan covering expenditures in excess of $1 billion, and directed the passenger sales division of American Airlines including the companys revenue management reporting system. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Senior Vice President, Business Development / Sales","firm":{"name":"Security First","permalink":"security-first","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0004/9184/49184v1-max-150x150.jpg"],[[250,100],"assets/images/resized/0004/9184/49184v1-max-250x250.jpg"],[[250,100],"assets/images/resized/0004/9184/49184v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}