{"first_name":"John Basil","last_name":"Georges","permalink":"john-basil-georges","crunchbase_url":"http://www.crunchbase.com/person/john-basil-georges","homepage_url":"http://johnbasilgeorges.com","birthplace":"New York City","twitter_username":"JohnBGeorges","blog_url":"http://leadingtoinnovate.com","blog_feed_url":"feed://www.johnbasilgeorges.com/feed/rss/","affiliation_name":"NextG Networks","born_year":1965,"born_month":12,"born_day":14,"tag_list":"entrepreneur","alias_list":null,"created_at":"Fri Nov 19 15:50:14 UTC 2010","updated_at":"Fri Nov 19 22:30:29 UTC 2010","overview":"<p>Serial entrepreneur; building start-ups in wireless industry. </p>\n\n<p>John Basil Georges, PhD, is a successful wireless industry entrepreneur – twice over. He’s currently working on his third business, which is still under wraps.</p>\n\n<p>Georges’ most recent startup was NextG Networks, co-founded with long-time friend and colleague, David Cutrer. NextG pioneered the concept of using existing city and utility infrastructures, such as wooden utility poles and metal streetlamps for wireless communications. This approach enabled wireless carriers to boost network performance without having to build as many costly, obtrusive wireless towers.</p>\n\n<p>Even though NextG was started in 2001 when the economy was flagging, Georges led the company through eight years of fast-paced growth, serving as president, CEO and chairman. NextG established long-term contracts with major wireless carriers, created a revenue stream for local municipalities, and met revenue and financial objectives for 28 straight quarters.</p>\n\n<p>NextG also received quite a few accolades along the way. It was named to the Silicon Valley/San Jose Business Journal’s 50 fastest growing private companies list in 2007, the Best of San Jose list in 2009, and the Deloitte 2008 Technology Fast 500 list of North America. NextG received the 2008 Silicon Valley Deloitte Technology Fast 50 Award and the Frost &amp; Sullivan Engineering System of the Year Award in 2004.</p>\n\n<p>In 2009, Georges and his partner sold a majority stake in NextG for several millions of dollars, which provided an excellent return for the company’s investors. Georges is still a NextG advisor and remains on the board.</p>\n\n<p>Georges co-founded his first company, LGC Wireless, in 1996. Through 10 years of exceptional growth, he served in a variety of executive roles, including CEO, business development, sales and engineering. Georges also established channel relationships in over 20 countries, making LGC the worldwide leader of in-building wireless distributed antenna systems (DAS). LGC was acquired by ADC Telecommunications (NASDAQ-ADCT) in 2006 for approximately $170 million.</p>\n\n<p>You could call Georges an American success story, since he began working long hours to support his Greek immigrant family while still in junior high. He worked his way through college, most notably spending four years at Bell Communications Research (now Telecordia) in fiber optics while attending night school to earn his bachelor’s degree. He eventually received a doctoral degree in Electrical Engineering from the University of California at Berkeley, which led to starting up LGC Wireless.</p>\n\n<p>Georges has been involved in numerous philanthropic ventures over the years and encourages his employees to do the same. Those include Save the Children, Susan G. Komen for the Cure, American Cancer Society, Special Olympics, Saint Judes, Ronald McDonald House Charities, American Heart Association, Hospice, Little League and others. In 2010, he became part of the Arya’s Kids Foundation To Fight Childhood Cancer.</p>","image":null,"degrees":[{"degree_type":"Ph.D. ","subject":"electrical engineering","institution":"University of California, Berkeley","graduated_year":1994,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"CEO, Co-Founder","firm":{"name":"NextG Networks","permalink":"nextg-networks","type_of_entity":"company","image":{"available_sizes":[[[150,52],"assets/images/resized/0003/3042/33042v1-max-150x150.png"],[[158,55],"assets/images/resized/0003/3042/33042v1-max-250x250.png"],[[158,55],"assets/images/resized/0003/3042/33042v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"President and Co-founder","firm":{"name":"LGC Wireless","permalink":"lgc-wireless","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://Twitter.com/JohnBGeorges","title":""},{"external_url":"http://www.linkedin.com/in/johnbasilgeorges","title":""}]}