{"first_name":"John the Marketing Guy","last_name":"John D Erickson","permalink":"john-the-marketing-guy-john-d-erickson","crunchbase_url":"http://www.crunchbase.com/person/john-the-marketing-guy-john-d-erickson","homepage_url":"http://www.facebook.com/johnthemarketingguy","birthplace":"Kansas City ","twitter_username":"madmarketingguy","blog_url":"","blog_feed_url":"","affiliation_name":"Atronic Alarms","born_year":1962,"born_month":6,"born_day":5,"tag_list":"john-the-marketing-guy, john-the-alarm-guy, perry-atha, john, erickson, security, home-automation, markting, chronic-lyme, atronic, alarms","alias_list":null,"created_at":"Tue Nov 02 13:00:37 UTC 2010","updated_at":"Tue Sep 04 09:06:48 UTC 2012","overview":"<p>I was known for over 25 years as JOHN the ALARM GUY.  I helped start a local alarm security provider named Atronic Alarms.  The company was started with $5,000 investment and today is worth millions.   Needless to say when we started the company we did not have any budget for marketing or sales.   So I used my mantra of, &#8220;tell me the rules, show me the game and I will find a way for us to win.&#8221;   It was not easy but I found literally hundreds of ways for a company to promote itself, increase public awareness and to set an image as a quality local business. </p>\n\n<p>I was diagnosis with Chronic Lyme disease and was forced out of my own company by my partner.   At first, sure I was bitter.   But suddenly I discovered that it may have been the best thing to happen when Perry Atha fired me.   You see I had tunnel vision and was stuck in the rut of calling myself &#8220;JOHN the Alarm Guy.&#8221;   When actually I was much more.  I was JOHN the Marketing Guy!  I had great success in designing and selling security and home automations.   Industry standards I exceeded by three folds. </p>\n\n<p>However, this was not my greatest achievement.  I had taken a small company and created a million dollar business.   We had many problems and hiccups along the way but the our image was intact as we were known as the premier local security provider. </p>\n\n<p>So now I try to pay it forward each day and share my story and knowledge with others. </p>","image":null,"degrees":[{"degree_type":"BBA ","subject":"Marketing ","institution":"Washburn Unv. ","graduated_year":1986,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Vice President/ owner ","firm":{"name":"Atronic Alarms","permalink":"atronic-alarms","type_of_entity":"company","image":{"available_sizes":[[[150,148],"assets/images/resized/0010/8851/108851v3-max-150x150.jpg"],[[250,247],"assets/images/resized/0010/8851/108851v3-max-250x250.jpg"],[[320,317],"assets/images/resized/0010/8851/108851v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.jericksonconsulting.com","title":"John the Marketing Guy"}],"web_presences":[]}