{"first_name":"John","last_name":"Fitzgerald","permalink":"john-fitzgerald-2","crunchbase_url":"http://www.crunchbase.com/person/john-fitzgerald-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Oct 29 22:31:59 UTC 2008","updated_at":"Wed Oct 29 22:35:10 UTC 2008","overview":"<p>As Chief Financial Officer for Brickfish, John oversees budgeting, forecasting, cash management, capital needs and all related investor, financial and accounting functions of the company.</p>\n\n<p>John joins Brickfish from Veoh Networks, Inc. a venture-backed leading Internet television provider. At Veoh, John was part of a management team that grew unique monthly visitors from several hundred thousand to over 30 million in less than two years, making Veoh a top 30 Web site in the United States. John’s role as Corporate Controller involved overseeing all financial functions of Veoh, including raising capital, operations and spending as well as human resource management.</p>\n\n<p>Prior to his role at Veoh, John worked for BakBone Software, Inc. as Chief Financial Officer managing the raising of capital, acquisitions and divestures, investor relations, operations and strategic planning functions of this worldwide enterprise software company. At BakBone, John helped propel annual revenues from $3 million to more than $50 million in five years. John began his career with Arthur Andersen, LLP and has held various consulting positions for startup and emerging stage companies in the high-tech arena.</p>\n\n<p>John holds a Bachelor’s degree in Accounting from San Diego State University and is a California Certified Public Accountant.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"CFO","firm":{"name":"Brickfish","permalink":"brickfish","type_of_entity":"company","image":{"available_sizes":[[[150,46],"assets/images/resized/0002/7572/27572v6-max-150x150.png"],[[231,71],"assets/images/resized/0002/7572/27572v6-max-250x250.png"],[[231,71],"assets/images/resized/0002/7572/27572v6-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}