{"first_name":"John","last_name":"Duffy","permalink":"john-duffy-2","crunchbase_url":"http://www.crunchbase.com/person/john-duffy-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"3Cinteractive","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jun 29 21:13:07 UTC 2011","updated_at":"Thu Jul 12 20:45:13 UTC 2012","overview":"<p>John Duffy is a serial entrepreneur with 25 years of experience in communications and payment processing. As founder and CEO of 3Cinteractive, Duffy is responsible for setting corporate strategy, driving revenue, and helping to maintain the company&#8217;s key relationships with customers, vendors and shareholders. </p>\n\n<p>Prior to founding 3Ci, Duffy built several successful companies in a broad section of industries including Internet Billing Company, one of the first Internet-based payment processing companies, which sold to Intercept in 2002.  </p>\n\n<p>Duffy believes giving back is at the heart of his success. He serves on the boards of the Dan Marino Foundation and FAU Foundation and is very involved in several other philanthropic organizations including the Jason Taylor Foundation, Junior Achievement of South Florida and Here’s Help. He also believes he is the product of great mentoring, returning the favor through his support of entrepreneurship programs at Florida Atlantic University, The LaunchPad at the University of Miami and Startup Florida. </p>\n\n<p>Duffy is a sought after speaker on topics including mobile and entrepreneurship. He has been honored with numerous awards for his leadership including the South Florida Business Journal’s “Palm Beach Ultimate CEO”, the Sun Sentinel’s “Excalibur Award” and most recently the Ernst &amp; Young “Entrepreneur of The Year® Award” in Florida.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder & CEO ","firm":{"name":"3Cinteractive","permalink":"3c-interactive","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0006/4740/64740v6-max-150x150.jpg"],[[250,84],"assets/images/resized/0006/4740/64740v6-max-250x250.jpg"],[[450,151],"assets/images/resized/0006/4740/64740v6-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}