{"first_name":"John","last_name":"Lincoln","permalink":"john-lincoln","crunchbase_url":"http://www.crunchbase.com/person/john-lincoln","homepage_url":"http://www.seoinc.com","birthplace":"San Diego","twitter_username":"johnelincoln","blog_url":"http://www.seoinc.com/seo-blog","blog_feed_url":"http://feeds.feedburner.com/seoinc/XwyD","affiliation_name":"SEO Inc","born_year":1982,"born_month":12,"born_day":11,"tag_list":"seo, social-media-marketing, search-engine-optimization, online-reputation-management, analytics, applications","alias_list":null,"created_at":"Thu Feb 16 20:43:18 UTC 2012","updated_at":"Fri Sep 07 09:13:33 UTC 2012","overview":"<p>As Director of SEO Consulting &amp; Social Media, John E. Lincoln oversees the SEO consulting and social process at SEO Inc. In this role, Lincoln has ensured results for hundreds of online businesses. Some of his notable clients include Jacuzzi, Frederick&#8217;s of Hollywood, Fuel TV, FOX, the Grocery Game, Oxi Fresh, Original Parts Group, Bike Bandit, WeddingWire, GameSpot, TACORI, Rodan and Fields and more.</p>\n\n<p>During his career, Lincoln has authored over 1,000 blogs and articles, taken multiple websites to the number one position in Google and built social media communities by hundreds of thousands of members. Outside of his day-to-day duties at SEO Inc, Lincoln teaches a quarterly course on social media marketing, search engine marketing and search engine optimization at the University of California San Diego Extension. He is also a frequent corporate trainer and public speaker.</p>\n\n<p>Prior to SEO Inc., Lincoln held the position of Online Marketing Manager at FreedomVoice where he increased the number of leads generated from zero to hundreds per month and increased ecommerce conversions from hundreds to over one thousand per month. At FreedomVoice he also played a role in launching an affiliate marketing campaign and spearheaded the companies SEO, social media and PR strategy for their five products. Before FreedomVoice, Lincoln acted as Director of Online Communications at bizSanDiego Magazine. At bizSanDiego, Lincoln managed a team of SEO, social media, editorial, creative and interactive experts to increase the magazines targeted online traffic.</p>\n\n<p>Lincoln holds an M.B.A. in finance from AIU and a B.A. in literature from UC Santa Cruz. He is Google Analytics certified and Google AdWords Certified with an emphasis in Advanced Reporting and Analysis. Outside of business he is an avid surfer and soccer player.</p>","image":{"available_sizes":[[[110,150],"assets/images/resized/0017/4579/174579v2-max-150x150.jpg"],[[184,250],"assets/images/resized/0017/4579/174579v2-max-250x250.jpg"],[[332,450],"assets/images/resized/0017/4579/174579v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"Finance","institution":"Alliant International University","graduated_year":2007,"graduated_month":null,"graduated_day":null},{"degree_type":"Bachlors of Arts","subject":"Literature","institution":"University of California Santa Cruz","graduated_year":2005,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Director of SEO and Social","firm":{"name":"SEO Inc","permalink":"seo-inc","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}