{"first_name":"John","last_name":"Rourke","permalink":"john-rourke","crunchbase_url":"http://www.crunchbase.com/person/john-rourke","homepage_url":"http://www.bantamlive.com","birthplace":"","twitter_username":"JohnRourke","blog_url":"","blog_feed_url":"","affiliation_name":"Bantam","born_year":null,"born_month":null,"born_day":null,"tag_list":"bantam, entrepreneur","alias_list":"","created_at":"Wed Jul 01 20:58:31 UTC 2009","updated_at":"Wed Jul 01 20:58:30 UTC 2009","overview":"<p>John Rourke is a serial entrepreneur in technology and media ventures. Since 1995, John has focused exclusively on ventures and projects in the internet space. At Bantam Networks, his current role where he is the CEO and founder, he oversees all Company operations and spearheads the go-to-market strategy. John is also the co-founder of Aperio Networks, LLC, a Web 2.0 internet development and consulting company that John founded with Bantam CTO Henry Poydar in 2003. Developing both B2B and B2C web applications, the Ruby-on-Rails firm publishes user-generated content sites such as ConferencingNews.com, KeyPeopleDirectory.com, EventSpan.com, and WebinarWire.com in the web collaboration space, as well as other B2C promotional sites for brands. John started his work in the internet sector in 1995 as the creator of SmartRoute Systems’ award-winning SmarTraveler.com, the internet’s first traffic information site, and SmarTravelerTV, cable television’s first traffic channel. Before his integrated-media brand experience with SmartRoutes, which was acquired by Viacom/Westwood One, John was a co-founder of other technology ventures which included Automatic Toll Communications, Inc. (1990 – 1995) a non-stop electronic toll collection and smart-car technology developer acquired by SAIC, and MultiLink, Inc. (1985-1989) a leading teleconferencing systems and services company acquired by PictureTel.</p>\n\n<p>John was appointed by two Massachusetts Governors to serve consecutively on an oversight committee for the state’s e-government initiatives. John is a director on the board of the IMCCA, the conferencing and collaboration industry trade association. He holds a Bachelor of Arts degree from Boston College, 1984, and is a co-inventor of US patent 5289183 related to smart-car technology.</p>","image":{"available_sizes":[[[75,100],"assets/images/resized/0005/1574/51574v1-max-150x150.jpg"],[[75,100],"assets/images/resized/0005/1574/51574v1-max-250x250.jpg"],[[75,100],"assets/images/resized/0005/1574/51574v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor of Arts","subject":"","institution":"Boston College","graduated_year":1984,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder and CEO","firm":{"name":"Bantam Live","permalink":"bantam","type_of_entity":"company","image":{"available_sizes":[[[150,43],"assets/images/resized/0004/0421/40421v3-max-150x150.png"],[[172,50],"assets/images/resized/0004/0421/40421v3-max-250x250.png"],[[172,50],"assets/images/resized/0004/0421/40421v3-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Co-Founder","firm":{"name":"Aperio Networks","permalink":"aperio-networks","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}