{"first_name":"John","last_name":"Giuliani","permalink":"john-giuliani","crunchbase_url":"http://www.crunchbase.com/person/john-giuliani","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Aug 03 04:42:00 UTC 2011","updated_at":"Wed Aug 03 04:43:07 UTC 2011","overview":"<p>John Giuliani is a seasoned executive with almost twenty-five years of experience in growing successful organizations. As CEO and Chairman of the Board, John drives the vision for Dotomi by focusing on strategic growth, fostering the company’s leadership position in online marketing by working to provide innovative services and cutting-edge technology for its clients.</p>\n\n<p>Before joining Dotomi, John founded Rainmaker Consulting Group Inc., which specialized in strategic sales and marketing consulting for marketing services firms. He also served as President of North America for Catalina Marketing Services, providing behavioral insights, database marketing, and internet solutions to key Fortune 1000 companies. His leadership at Catalina resulted in record revenues and net profits. Additionally, John’s tenure includes four years at ACTMEDIA working with the launch team of the Instant Coupon Machine, as well as in CPG sales and marketing with Beecham Products and Frito-Lay, Inc.</p>\n\n<p>In addition to Dotomi, John is currently a member of the Board of Directors for Fingerhut Direct Marketing. In the past, he has participated on Boards for Q Interactive, SuperMarkets Online, Affinova, Claria, Imagitas, and El Dorado Marketing.</p>","image":null,"degrees":[{"degree_type":"MBA","subject":"","institution":"Northwestern University’s Kellogg Graduate School of Management","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"BS","subject":"","institution":"University of Illinois","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Dotomi","permalink":"dotomi","type_of_entity":"company","image":{"available_sizes":[[[150,69],"assets/images/resized/0007/4165/74165v2-max-150x150.jpg"],[[250,115],"assets/images/resized/0007/4165/74165v2-max-250x250.jpg"],[[400,184],"assets/images/resized/0007/4165/74165v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}