{"first_name":"John","last_name":"Chen","permalink":"john-chen-3","crunchbase_url":"http://www.crunchbase.com/person/john-chen-3","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 04 04:53:22 UTC 2012","updated_at":"Mon Jun 04 04:54:08 UTC 2012","overview":"<p>Dr. John Chen is a Partner and co-founder of Phoenix Venture Partners (PVP). He brings over 20 years of experience in venture capital, start-ups, industry, and R&amp;D. Prior to co-founding PVP, Dr. Chen was a Kauffman Fellow at Battery Ventures, where he formulated Battery&#8217;s Advanced Materials strategy, sourcing over 1,200 investment opportunities and managing several investments with applications in IT and CleanTech, e.g., Lion Cells, Stonybrook Purification and Nanoconduction (acquired). Dr. Chen started his venture capital career at DFJ New England and Navigator Technology Ventures in Boston. Prior to becoming a venture capitalist, Dr. Chen held leadership roles in business, technology, and product development at several startups and leading corporations in the Advanced Materials sector, including Luminus Devices, EM Logix, Surface Logix, and Raychem (acquired). He also led Advanced Materials technology scouting and business development in the areas of energy storage, fuel cells, photonics, and, more broadly, nanotechnology, at Tyco Electronics in the Advanced Technology and Business Development Group following Tyco&#8217;s acquisition of Raychem. Dr. Chen earned his BS, MBA, and PhD from MIT. In addition to his investment and board roles with PVP, Dr. Chen serves on the Commercialization Advisory Board for Oregon Built Environment &amp; Sustainability Technologies (BEST) and is an active mentor to several startups through the MIT Venture Mentoring Service.</p>","image":{"available_sizes":[[[96,87],"assets/images/resized/0019/3715/193715v1-max-150x150.jpg"],[[96,87],"assets/images/resized/0019/3715/193715v1-max-250x250.jpg"],[[96,87],"assets/images/resized/0019/3715/193715v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Phoenix Venture Partners","permalink":"phoenix-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,67],"assets/images/resized/0019/3713/193713v1-max-150x150.jpg"],[[250,112],"assets/images/resized/0019/3713/193713v1-max-250x250.jpg"],[[250,112],"assets/images/resized/0019/3713/193713v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}