{"first_name":"John","last_name":"Welsh","permalink":"john-welsh","crunchbase_url":"http://www.crunchbase.com/person/john-welsh","homepage_url":"http://www.reddragonsolutions.com","birthplace":"St. Paul, MN","twitter_username":"focusedlearning","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1957,"born_month":2,"born_day":17,"tag_list":"innovation, engagement, strategy, e-learning","alias_list":null,"created_at":"Mon Sep 20 03:34:38 UTC 2010","updated_at":"Sat Oct 02 05:52:03 UTC 2010","overview":"<p>John’s career over the last 20 years has allowed him to successfully work in both Fortune 500 companies and high-tech, entrepreneurial start-ups that have had a global reach. A champion of Innovation that can create a vision and culture for the business and an environment where innovators are empowered to push the envelope of existing paradigms in order to truly create ground breaking innovations. His executive leadership experience has provided him a wealth of practical and applied strengths in many aspects of strategy, innovation, organizational effectiveness, talent management, and e-learning curriculum design, development and delivery, in a variety of industries including: professional services, technology, healthcare, financial services, banking, insurance, manufacturing, retail, telecommunications, government, and education.</p>\n\n<p>Prior to joining Red Dragon, John held executive roles at a global learning and management consulting firm, where he substantially increasing revenues and profits. In his role as senior executive/officer of several high tech companies, he has managed over 200 people, had profit and loss accountability and led strategic implementations including a global business development strategy, built an award-winning, multi-million dollar e-learning certificate program, and organizational restructuring in several turnaround situations, to a team-based, shared values culture.   John holds a Ph.D. in Organizational Leadership from Capella University, as well as Masters’ degrees in Business Administration and International Management from the University of St. Thomas, in addition to a Bachelor of Arts degree from St. John’s University. </p>","image":null,"degrees":[{"degree_type":"Ph.D.","subject":"Organizational Leadership","institution":"Capella University","graduated_year":2010,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.reddragonsolutions.com","title":""}]}