{"first_name":"John","last_name":"L. Hennessy","permalink":"john-l-hennessy","crunchbase_url":"http://www.crunchbase.com/person/john-l-hennessy","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Feb 22 09:50:12 UTC 2008","updated_at":"Fri Apr 04 20:05:57 UTC 2008","overview":"<p>John L. Hennessy joined Stanford’s faculty in 1977 as an assistant professor of electrical engineering. He rose through the academic ranks to full professorship in 1986 and was the inaugural Willard R. and Inez Kerr Bell Professor of Electrical Engineering and Computer Science from 1987 to 2004.</p>\n\n<p>From 1983 to 1993, Dr. Hennessy was director of the Computer Systems Laboratory, a research and teaching center operated by the Departments of Electrical Engineering and Computer Science that fosters research in computer systems design. He served as chair of computer science from 1994 to 1996 and, in 1996, was named dean of the School of Engineering. As dean, he launched a five-year plan that laid the groundwork for new activities in bioengineering and biomedical engineering. In 1999, he was named provost, the university’s chief academic and financial officer. As provost, he continued his efforts to foster interdisciplinary activities in the biosciences and bioengineering and oversaw improvements in faculty and staff compensation. In October 2000, he was inaugurated as Stanford University’s 10th president. In 2005, he became the inaugural holder of the Bing Presidential Professorship.</p>\n\n<p>A pioneer in computer architecture, in 1981 Dr. Hennessy drew together researchers to focus on a computer architecture known as RISC (Reduced Instruction Set Computer), a technology that has revolutionized the computer industry by increasing performance while reducing costs. In addition to his role in the basic research, Dr. Hennessy helped transfer this technology to industry. In 1984, he cofounded MIPS Computer Systems, now MIPS Technologies, which designs microprocessors. In recent years, his research has focused on the architecture of high-performance computers.</p>\n\n<p>Dr. Hennessy is a recipient of the 2000 IEEE John von Neumann Medal, the 2000 ASEE Benjamin Garver Lamme Award, the 2001 ACM Eckert-Mauchly Award, the 2001 Seymour Cray Computer Engineering Award, a 2004 NEC C&amp;C Prize for lifetime achievement in computer science and engineering and a 2005 Founders Award from the American Academy of Arts and Sciences. He is a member of the National Academy of Engineering and the National Academy of Sciences, and he is a fellow of the American Academy of Arts and Sciences, the Association for Computing Machinery, and the Institute of Electrical and Electronics Engineers.</p>\n\n<p>He has lectured and published widely and is the co-author of two internationally used undergraduate and graduate textbooks on computer architecture design. Dr. Hennessy earned his bachelor’s degree in electrical engineering from Villanova University and his master’s and doctoral degrees in computer science from the State University of New York at Stony Brook.</p>\n\n<p>Source:<a href=\"http://www.stanford.edu/dept/president/biography/\" title=\"Stanford\" rel=\"nofollow\">Stanford</a></p>","image":{"available_sizes":[[[101,150],"assets/images/resized/0001/6862/16862v1-max-150x150.jpg"],[[160,237],"assets/images/resized/0001/6862/16862v1-max-250x250.jpg"],[[160,237],"assets/images/resized/0001/6862/16862v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Board","firm":{"name":"Google","permalink":"google","type_of_entity":"company","image":{"available_sizes":[[[150,51],"assets/images/resized/0002/9578/29578v31-max-150x150.png"],[[250,85],"assets/images/resized/0002/9578/29578v31-max-250x250.png"],[[450,154],"assets/images/resized/0002/9578/29578v31-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}