{"first_name":"John","last_name":"Prunkl","permalink":"john-prunkl","crunchbase_url":"http://www.crunchbase.com/person/john-prunkl","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jun 17 12:31:04 UTC 2009","updated_at":"Wed Jun 17 12:33:03 UTC 2009","overview":"<p>As company president and COO, Mr. Prunkl handles day to day operations and overall strategy for the growth of the company. He is responsible for overseeing the development of multiple SlurryCarb™ projects throughout the United States and globally.</p>\n\n<p>Mr. Prunkl comes to EnerTech with over 20 years of experience in the energy sector. Prior to joining EnerTech, Mr. Prunkl was president of EPCOR USA and Primary Energy Recycling Corporation, a leader in energy recycling with over $1B in total assets. There he and the senior management team grew the company from zero revenues to over $80 million in EBITDA in its first 3 years, successfully completed the company’s initial public offering on the Toronto Stock Exchange (TSX) in 2005 and privately sold the clean heat and power business to EPCOR Power LP in 2006. Previous to Primary Energy, Mr. Prunkl was co-founder of MetroGen LLC, Vice President of Global Operations for Illinova Generating, and held several international management positions with GE Power Systems.</p>\n\n<p>Mr. Prunkl holds a Bachelor of Arts in Mathematics from Huntingdon College, a Bachelor of Science in Mechanical Engineering from Auburn University, and a Master of Business Administration from the J.L. Kellogg School of Management at Northwestern University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President and COO","firm":{"name":"EnerTech Environmental","permalink":"enertech-environmental","type_of_entity":"company","image":{"available_sizes":[[[150,32],"assets/images/resized/0004/9094/49094v1-max-150x150.png"],[[178,38],"assets/images/resized/0004/9094/49094v1-max-250x250.png"],[[178,38],"assets/images/resized/0004/9094/49094v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}