{"first_name":"John","last_name":"T Weir","permalink":"john-t-weir","crunchbase_url":"http://www.crunchbase.com/person/john-t-weir","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Binksty","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jun 10 22:55:14 UTC 2011","updated_at":"Sat Jun 18 14:01:05 UTC 2011","overview":"<p>John Weir is an operations and customer acquisition professional with extensive experience developing and managing consumer marketing infrastructures, primarily in the field of financial services.  With more than 30 years of experience in operations management, he has led efforts to build call centers, design information systems, implement and design new products, and integrate quality initiatives. Most recently, Mr. Weir served as an independent consultant and Executive for Goal Financial, LLC; a large national student loan company where he was responsible for Sales and Operations and successfully launching two new private loan products. Prior to that, Mr. Weir served as executive vice president and chief operations officer of EduCap, Inc., a national provider of private and federal student loans where he was charged with the responsibility of operational delivery for private student loans and initiating and managing partner relationships to provide contact center support for inbound sales, customer service, and internet-driven sales. Before joining Educap, Inc., Mr. Weir served as the executive vice president of consumer sales and operations at Education Lending Group, where he led federal student loan origination and servicing operations.  While there, he launched the company&#8217;s marketing and sales efforts and achieved $6 billion in loan origination within two years through multi-channel marketing efforts.  Education Lending Group was subsequently purchased by CIT Group, Inc.  Mr. Weir gained valuable experience in operations management while working with Student Loan Marketing Association (Sallie Mae), Chase Manhattan Bank, and American Express Educational Loans. In these positions, Mr. Weir increased revenue, managed hundreds of customer service professionals, improved customer service quality and reduced rejected claims, restructured operations to provide career path incentives, improved doubtful accounts recovery, merged operational functions of acquired companies, and implemented automated customer processing as well as multiple advanced MIS, data tracking, and telecommunications systems. Mr. Weir earned his Bachelor of Science degree in business administration from Northwood University.</p>","image":null,"degrees":[{"degree_type":"Business Administration","subject":"Management","institution":"Northwood Unversity","graduated_year":1996,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Advisor","firm":{"name":"Binksty","permalink":"binksty","type_of_entity":"company","image":{"available_sizes":[[[150,58],"assets/images/resized/0013/3110/133110v11-max-150x150.png"],[[218,85],"assets/images/resized/0013/3110/133110v11-max-250x250.png"],[[218,85],"assets/images/resized/0013/3110/133110v11-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/johntweir","title":"LinkedIn Profile"}]}