{"first_name":"John","last_name":"Tracey","permalink":"john-tracey","crunchbase_url":"http://www.crunchbase.com/person/john-tracey","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"ListenLogic","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Nov 20 14:38:48 UTC 2012","updated_at":"Sun Dec 09 06:02:56 UTC 2012","overview":"<p>John provides both operational and programmatic support to AKUDA LABS, with responsibility for Finance, Human Resources, Information Technology and Operations. He is an expert on information quality, process efficiency, operational metrics and business leadership. </p>\n\n<p>AKUDA LABS is revolutionizing real-time, streaming big data filtering, classification and analytics, making it more accessible and affordable than ever before. Our proprietary Pulsar hypercomputing platform is the fastest, most efficient real-time streaming classification engine available.</p>\n\n<p>Pulsar currently processes 500 million streaming classification operations per second (SCOPS) on a path to 1+ billion SCOPS. AKUDA LABS Pulsar transforms big, fast, ugly data into real-time, actionable insight at exponential speed and fractional cost compared to general-purpose solutions. Current technologies can not handle the volume, velocity, variety and complexity of today’s streaming big data, AKUDA LABS Pulsar platform can.</p>\n\n<p>Prior to Akuda, John spent eight years as Director, North American Sales for VWR International, where he engaged with senior leadership to bring value-added solutions to customers in BioPharma, Industrial Manufacturing, Education, Technology and Healthcare. Prior to VWR, John worked in all aspects of operations finance while at Armstrong World Industries, General Electric and AlliedSignal. John earned an MBA from Drexel University and a BS in Economics / Financial Management from the Catholic University of America.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Financial Officer","firm":{"name":"ListenLogic","permalink":"listenlogic","type_of_entity":"company","image":{"available_sizes":[[[150,37],"assets/images/resized/0011/2347/112347v2-max-150x150.jpg"],[[162,40],"assets/images/resized/0011/2347/112347v2-max-250x250.jpg"],[[162,40],"assets/images/resized/0011/2347/112347v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Chief Financial Officer","firm":{"name":"AKUDA LABS","permalink":"akuda-labs","type_of_entity":"company","image":{"available_sizes":[[[150,51],"assets/images/resized/0022/3665/223665v2-max-150x150.jpg"],[[250,85],"assets/images/resized/0022/3665/223665v2-max-250x250.jpg"],[[450,153],"assets/images/resized/0022/3665/223665v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}