{"first_name":"John","last_name":"D. Hamel","permalink":"john-d-hamel","crunchbase_url":"http://www.crunchbase.com/person/john-d-hamel","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Cue Ball","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Mar 19 19:05:51 UTC 2009","updated_at":"Sat Jun 18 13:32:23 UTC 2011","overview":"<p>John Hamel brings an extensive track record of investing, operational experience, and entrepreneurship to Cue Ball. \nIn addition to mentoring portfolio company CEOs, John has helped portfolio companies develop the right performance metrics and operational controls by leveraging his prior professional background in those areas. John has led and is responsible for structuring several of Cue Ball’s deals and sits on the Boards of MiniLuxe, Epic Burger, PlanetTran, and Shape Up the Nation.</p>\n\n<p>Background\nJohn has a long-standing history in start-up businesses, technology and real estate. He is the founder of both a technology advisory group and a Boston-based real estate development and management firm with residential, commercial, and mixed-use properties. His real estate and operations background has proven to be an invaluable asset to Cue Ball’s consumer businesses. John’s technology experience and focus on enterprise performance management includes serving as Director of Business Intelligence for Answerthink, Inc. (NASDAQ: ANSR) for eight years. In that role, he became a trusted advisor to a wide range of clients ranging from multi-unit chains such as Hard Rock Café to global enterprises such as Verizon and GE. John also was the first technology advisor for ZEFER which was among the nation’s first Internet consultancies, bringing early and critical Internet knowledge to the team and founder, Tony Tjan who is now his partner at Cue Ball.</p>\n\n<p>John lives in Charlestown, Massachusetts with his wife and daughter. He is a passionate boater, an avid photographer, an obsessive technologist, and he loves to travel. As a first generation Italian-American, he enjoys dual-citizenship and is fluent in Italian.</p>\n\n<p>Education\nHarvard College, A.B. with honors</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CFO and General Partner","firm":{"name":"Cue Ball","permalink":"cue-ball","type_of_entity":"financial_org","image":{"available_sizes":[[[150,35],"assets/images/resized/0003/8948/38948v1-max-150x150.png"],[[230,54],"assets/images/resized/0003/8948/38948v1-max-250x250.png"],[[230,54],"assets/images/resized/0003/8948/38948v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}