{"first_name":"John","last_name":"Boyce","permalink":"john-boyce","crunchbase_url":"http://www.crunchbase.com/person/john-boyce","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Sep 20 03:22:15 UTC 2012","updated_at":"Thu Sep 20 03:22:35 UTC 2012","overview":"<p>John Boyce is President, CEO and Co-Founder of GnuBIO. Prior to starting GnuBIO, John co-founded Delphi Bio, LLC, a strategic consulting company that serves startup and fortune 500 companies within the life sciences market. Using his proven ability to drive companies to commercial success, John served as the Business Development head for a number of clients, including Affomix. Over a two year period, John developed the business plan for Affomix, oversaw all commercial activities, as well as initiated and drove the sale of the company to a multi-billion dollar sequencing corporation in July 2010. Prior to Delphi and Affomix, John served as Head of Business Development for Helicos BioSciences (HLCS), where he was responsible for identifying new market opportunities. Prior to Helicos, John was the Senior Director of Commercial Development for Parallele Biosciences, Inc. where he played an integral role of building the company leading to an acquisition of the company by Affymetrix (AFFY). He was the Senior Director of Business Development for Genomics Collaborative where he was responsible for putting in place and building the Sales, Marketing, and Business Development infrastructure. John executed several key deals and played a key role in the acquisition by SeraCare Life Sciences, Inc. Prior to Genomics Collaborative, John led the successful expansion of Sequenom’s MassARRAY system as Director, United States Sales at Sequenom Inc. (SQNM), from 2000 to 2003.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President, CEO and Co-Founder","firm":{"name":"GnuBIO","permalink":"gnubio","type_of_entity":"company","image":{"available_sizes":[[[150,106],"assets/images/resized/0012/1729/121729v2-max-150x150.jpg"],[[150,106],"assets/images/resized/0012/1729/121729v2-max-250x250.jpg"],[[150,106],"assets/images/resized/0012/1729/121729v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}