{"first_name":"John","last_name":"Maffei","permalink":"john-maffei","crunchbase_url":"http://www.crunchbase.com/person/john-maffei","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Titan Gaming ","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue May 18 11:06:43 UTC 2010","updated_at":"Thu May 20 18:38:50 UTC 2010","overview":"<p>John Maffei, a software and digital media industry veteran with more than fifteen years of experience with leading global technology-driven brands.</p>\n\n<p>John Maffei is currently CEO if Titan Gaming, Inc.  Titan offers gaming companies the most effective and complete gaming platform enabling skill based matchmaking, tournaments, and points or cash competitions. Titan utilizes gamers’ natural competitive inclinations to help its partners and their game developers generate the highest LTV&#8217;s in the video game industry.</p>\n\n<p>Previously, Maffei was responsible for overall business direction and execution for The ZAM Network. The ZAM Network represents the single largest online portfolio of MMO gamer destination sites, including category leaders Allakhazam and Thottbot, focused solely on enhancing the game play experience of MMOG enthusiasts by providing them with access to tools, information, interactive community forums and services.</p>\n\n<p>Prior to joining ZAM, Maffei led Microsoft’s efforts to license Xbox 360 video content from major entertainment companies including Warner Bros., Buena Vista Pictures (Disney), Lions Gate, 20th Century Fox and NBC Universal. Throughout his decade-long tenure at Microsoft, Maffei held key senior marketing and business development positions within the Windows Media and the Platform Strategy divisions where he negotiated strategic business agreements with influential corporate partners including Sony and Vodafone. He was also the founder and chief executive of RocketPipe, Inc., a developer of broadcast messaging and direct marketing software for content-driven online commerce sites.</p>\n\n<p>John Maffei holds an M.B.A. from the University of Washington as well as a B.A. in political science from Colgate University. </p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"Xfire","permalink":"xfire","type_of_entity":"company","image":{"available_sizes":[[[150,69],"assets/images/resized/0002/2574/22574v4-max-150x150.png"],[[202,93],"assets/images/resized/0002/2574/22574v4-max-250x250.png"],[[202,93],"assets/images/resized/0002/2574/22574v4-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"COO","firm":{"name":"Titan Gaming ","permalink":"titan-gaming","type_of_entity":"company","image":{"available_sizes":[[[150,70],"assets/images/resized/0002/0330/20330v3-max-150x150.png"],[[250,118],"assets/images/resized/0002/0330/20330v3-max-250x250.png"],[[250,118],"assets/images/resized/0002/0330/20330v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}