{"first_name":"John","last_name":"Arnott","permalink":"john-arnott","crunchbase_url":"http://www.crunchbase.com/person/john-arnott","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jun 13 10:47:05 UTC 2009","updated_at":"Sat Jun 13 10:55:01 UTC 2009","overview":"<p>John Arnott currently serves as President and CEO of Alpine Biomed Corporation. He has more than 20 years of experience in building and leading global healthcare organizations. As senior vice president of global commercial operations for Hospira and one of the founding officers, he played an active role in establishing the company as a $3.5 billion global corporation and leader in specialty pharmaceutical and medication delivery products. He joined Abbott in November 1990, and has held various senior management positions both in Europe and at the company&#8217;s corporate headquarters in Chicago. In 1997 he was named general manager, The Netherlands, Abbott International Division. He became divisional vice president, Marketing and Business Development, Abbott International Division in March 2000. In March 2002, he was named divisional vice president and regional director, European Operations, Abbott International Division and was elected to vice president and corporate officer overseeing the company&#8217;s commercial operations for its hospital products division in July 2002. John also held management positions with Wellcome Diagnostics and the National Health Service in the United Kingdom. He is a fellow of the Institute of Medical Laboratory Sciences and received his degree in medical laboratory sciences from Caledonian University in Glasgow. </p>","image":null,"degrees":[{"degree_type":"Degree","subject":"Medical laboratory sciences","institution":"Caledonian University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"","firm":{"name":"Alpine Biomed","permalink":"alpine-biomed","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0004/8357/48357v1-max-150x150.png"],[[160,64],"assets/images/resized/0004/8357/48357v1-max-250x250.png"],[[160,64],"assets/images/resized/0004/8357/48357v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}