{"first_name":"john","last_name":"picha","permalink":"john-picha","crunchbase_url":"http://www.crunchbase.com/person/john-picha","homepage_url":"http://www.roverpet.com/","birthplace":"","twitter_username":"roverpet1","blog_url":"http://www.roverpet.com/blog/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 25 22:50:40 UTC 2010","updated_at":"Thu Aug 26 00:23:04 UTC 2010","overview":"<p>In the mid ‘80s, Rover (the dog) and Kali (the cat) owners, devoted lovers of their pets, had difficulty finding many pet items that met their expectations. They began to formulate some of their ideas as to how to keep their pets safe and comfy!</p>\n\n<p>They took those ideas and concepts in to their shop and started tinkering with some new materials in the pet industry. For months, they toiled diligently until they perfected the ideas in to a line of products that their pets simply loved.</p>\n\n<p>Rover and Kali’s owners applied for and were granted patents on their designs. Hence, in 1988, Rover Company was established. From that day forward, we have been providing our customers with the most comfortable, safe, and well designed dog beds, cat hammocks, cat houses, and pet enclosures the industry has to offer.</p>\n\n<p>All of our products are environmentally safe, will not rust or corrode, and are portable and light weight. They are safe for pet’s teeth, hair, and skin, and no tools are required for assembly!</p>\n\n<p>In 2010, the baton was passed. A second generation of family now has taken over the leadership roles of the company and they continue the tradition of building the same great designs and quality in to our products that many of our customers have grown to love and rely on over the years. Every item is built with pride right here in the U.S.A.</p>\n\n<p>The policies and procedures of conducting business with Rover Company will not change. We are, as we always has been, 100% committed to providing you with a level of customer service unsurpassed in the pet industry. We also do intend to continue in the direction of working hard to be green and friendly to our environment.</p>","image":{"available_sizes":[[[150,130],"assets/images/resized/0009/9342/99342v2-max-150x150.jpg"],[[250,216],"assets/images/resized/0009/9342/99342v2-max-250x250.jpg"],[[450,390],"assets/images/resized/0009/9342/99342v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.petrec.net/","title":""}],"web_presences":[{"external_url":"http://www.roverpet.com/index.html","title":""},{"external_url":"http://www.petrec.net/","title":""}]}