{"first_name":"John","last_name":"Puterbaugh","permalink":"john-puterbaugh","crunchbase_url":"http://www.crunchbase.com/person/john-puterbaugh","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"nellymoser","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Aug 27 12:11:05 UTC 2007","updated_at":"Wed Mar 12 18:49:56 UTC 2008","overview":"<p>John Puterbaugh, Ph.D., founder and Chief Strategist of Nellymoser, Inc. has over 15 years experience in creating and developing interactive multimedia solutions for IP networks, mobile phones and other consumer products. Before Nellymoser he was CTO of Reelworks, which provides voice technology solutions for the film and entertainment industry. He was also part of the early team and held a number of senior management positions at Voxware, Inc., one of the first companies to provide Internet voice chat and real-time streaming solutions for companies such as Disney, Microsoft, Nokia and Netscape.</p>\n\n<p>He holds patents in wireless voice platforms, voice analysis and synthesis, user-generated ringtones, and in sound transformation. Educated at Princeton University, Dartmouth College and Oberlin College, he has taught courses and lectured on interdisciplinary topics related to music, computers and cognition. John is a frequent speaker at industry events including the CES, CTIA, Game Developers Conference, Digital Music Forum, 3GSM on a wide range of topics such technology roadmaps for Mobile TV, on-deck and off-deck strategies, and business models for mobile music.</p>","image":null,"degrees":[],"relationships":[{"is_past":null,"title":"Founder and Chief Strategist","firm":{"name":"nellymoser","permalink":"nellymoser","type_of_entity":"company","image":{"available_sizes":[[[150,41],"assets/images/resized/0003/7920/37920v1-max-150x150.png"],[[186,51],"assets/images/resized/0003/7920/37920v1-max-250x250.png"],[[186,51],"assets/images/resized/0003/7920/37920v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}