{"first_name":"John","last_name":"Wirth","permalink":"john-wirth","crunchbase_url":"http://www.crunchbase.com/person/john-wirth","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Oct 22 02:48:38 UTC 2010","updated_at":"Fri Oct 22 20:39:38 UTC 2010","overview":"<p>As Co-Founder and Member of the Board of Hild Asset, John Wirth has built from the ground up a completely new category within Central Europe’s consumer finance sector, targeting the hitherto untouched 65+ senior consumer segment. John has raised over €100 million in financing from Merrill Lynch, Deutsche Bank, and several leading American and European venture capitalists to launch his company in Hungary and to expand into the Romanian, Bulgarian, and other regional markets; building a portfolio of over 3,000 residential properties.</p>\n\n<p>Prior to Hild, John worked in early-stage high tech venture capital in London and then advised high-growth companies in Croatia on expansion and financing strategies. As a strategy consultant, he successfully launched corporate technology spin-offs in Latin America and in the US for various Fortune 100 companies. While a Captain in the US Army John created a six-section multifunctional staff of 120 specifically designed to deploy, sustain, and redeploy a 500 person unit to FYR Macedonia for the United Nations.</p>\n\n<p>John holds an MBA from Cornell University and has created and taught entrepreneurship programs for Central European University, the American University in Bulgaria, the Illinois Institute of Technology, and Northwestern University. </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0010/6674/106674v2-max-150x150.jpg"],[[107,160],"assets/images/resized/0010/6674/106674v2-max-250x250.jpg"],[[107,160],"assets/images/resized/0010/6674/106674v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}