{"first_name":"John","last_name":"N. Le","permalink":"john-n-le","crunchbase_url":"http://www.crunchbase.com/person/john-n-le","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Artiklz","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Oct 07 19:57:02 UTC 2008","updated_at":"Fri Jan 07 05:10:20 UTC 2011","overview":"<p>• John Le is the principal of Mozaik, a technology incubator based in southern California, which was founded in 2007 with the objective of investing in and operating businesses that leverage technology as a competitive advantage. It has invested in and operates several Web 2.0 based businesses.  In addition to its domestic interests, Mozaik is actively involved in two international companies — VESIC, a media entertainment company based out of Vietnam and Finasis a lending automation and processing company in Turkey founded in partnership with the former Turkish Central Bank Governor. Currently, Mozaik is working to establish an ePayment company and consumer credit bureau to facilitate electronic payment transactions and to enable credit/lending capabilities, respectively, in the Vietnam market. </p>\n\n<p>Mr. Le is a seasoned financial services and technology executive from corporate banking to startup companies. Le founded and sold two financial technology companies over the past 10 years. Mr. Le has been invited to speak at many industry conferences on special topics ranging from banking and lending, financial technology, and social media.</p>\n\n<p>Mr. Le started LoanTrader, Inc, North America’s first internet-based mortgage marketplace with over 90 financial institution partners and 12,000 brokerage firms utilizing the platform. Le raised the largest private equity round in southern California (US$38M) for a financial technology company with blue chip investment partners such as Friedman Billings Ramsey, Capital Z (Zurich Insurance), Goldman Sachs, LendingTree (IAC), GE Capital, CitiGroup, and New Century Financial. Ultimately, the company was acquired by Metavante (NYSE: MV). Le later decided to build a second company, Portellus which grew from a 5 man operation into a 300 plus employee firm spread across 3 continents with clients such as Morgan Stanley, Citadel, Fiserv, Deutsche Bank, Discover, Washington Mutual, and Bank United in addition to over 400 other financial institutions in North America. Subsequently, the software company was sold to Fiserv (Nasdaq: FISV), the global leader in financial technology.</p>\n\n<p>Prior to his entrepreneurial efforts, Mr. Le was with ContiFinancial and Long Beach Financial (JP Morgan Chase) where he managed alternative assets and capital markets transactions for the specialty finance sector. </p>","image":{"available_sizes":[[[150,135],"assets/images/resized/0011/6352/116352v2-max-150x150.jpg"],[[250,226],"assets/images/resized/0011/6352/116352v2-max-250x250.jpg"],[[450,407],"assets/images/resized/0011/6352/116352v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Evangelist/Principal","firm":{"name":"Artiklz","permalink":"artiklz","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0002/6345/26345v2-max-150x150.jpg"],[[250,80],"assets/images/resized/0002/6345/26345v2-max-250x250.jpg"],[[450,145],"assets/images/resized/0002/6345/26345v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"","firm":{"name":"Propzy","permalink":"propzy","type_of_entity":"company","image":null}},{"is_past":false,"title":"Managing Principal","firm":{"name":"Mozaik, LLC","permalink":"mozaik-llc","type_of_entity":"company","image":null}},{"is_past":false,"title":"","firm":{"name":"Meistrz","permalink":"meistrz","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://findarticles.com/p/articles/mi_m0EIN/is_2000_Sept_26/ai_65495050","title":"Deloitte & Touche Fast 50"},{"external_url":"http://findarticles.com/p/articles/mi_pwwi/is_/ai_n19196139","title":"Ernst & Young 2007 Finalist"}],"web_presences":[]}