{"first_name":"John","last_name":"Schultz","permalink":"john-schultz-2","crunchbase_url":"http://www.crunchbase.com/person/john-schultz-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Mar 25 10:54:46 UTC 2011","updated_at":"Fri Mar 25 11:01:16 UTC 2011","overview":"<p>John Schultz joined BridgePoint Medical in June of 2008. He has four years of medical device start-up experience and twenty years of medical industry experience as an engineer, a clinical research professional and a clinical manager for in-vitro diagnostics, cardiovascular catheters and implantable products. Prior to BridgePoint Medical, John was the Director, Clinical Affairs for Endocardial Solutions (3D non-fluoroscopy electrophysiology mapping system), which was acquired by the Atrial Fibrillation Division of St. Jude Medical, where he expanded that role to manage a clinical organization responsible for multiple electrophysiology clinical programs. John also worked for four years as a Clinical Program Manager at EndiCOR Medical (cardiovascular thrombectomy device), which was acquired by ev3 where he developed and managed multiple large-scale, randomized, clinical trials. Prior to that John managed clinical trials for electrophysiology products with Cordis Webster (acquired by Johnson &amp; Johnson), blood gas monitors with CDI, Inc. (acquired by 3M), and he started his career as a design, test, and clinical engineer at MiniMed Technologies (implantable insulin pump, since acquired by Medtronic). He has extensive knowledge in clinical trial design with an expertise in clinical interventional cardiology and clinical electrophysiology. John has 2 patents granted and has been an author on several clinical publications.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Vice President, Clinical Affairs","firm":{"name":"BridgePoint Medical","permalink":"bridgepoint-medical","type_of_entity":"company","image":{"available_sizes":[[[150,72],"assets/images/resized/0008/0345/80345v1-max-150x150.jpg"],[[216,104],"assets/images/resized/0008/0345/80345v1-max-250x250.jpg"],[[216,104],"assets/images/resized/0008/0345/80345v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}