{"first_name":"John","last_name":"Bickel","permalink":"john-bickel","crunchbase_url":"http://www.crunchbase.com/person/john-bickel","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"DyneGen","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri May 21 02:17:23 UTC 2010","updated_at":"Thu Jun 10 23:06:49 UTC 2010","overview":"<p>John Bickel is a senior executive with significant experience at division and corporate headquarters of both Fortune 500 and start-up companies. Broad areas of expertise encompass virtually all facets of managing an organization, including considerable top &amp; bottom line responsibility (&gt;$300 mil &amp; $35 mil respectively). Industry knowledge and experience include manufacturing (U.S. &amp; Europe), high technology (Telecomm), and consumer products nationally and internationally. Extensive M&amp;A integration experience and a turn-around specialist. Holds a TS/SCI security clearance. Retired US Army Lieutenant Colonel. Airborne, Ranger, Special Forces. Vietnam vet. Assistant Professor, Electrical Engineering, West Point. Has served on numerous boards in both public and private sectors. Also has served on non-profits as part of commitment to the community. MBA in Management, C.W. Post, Long Island University, Greenvale, NY; MSEE, Georgia Institute of Technology, Atlanta, GA; BS in Engineering, United States Military Academy, West Point, NY; Registered Professional Engineer in Electrical Engineering.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President","firm":{"name":"DyneGen","permalink":"dynegen","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0009/0137/90137v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0009/0137/90137v2-max-250x250.jpg"],[[400,400],"assets/images/resized/0009/0137/90137v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}