{"first_name":"John","last_name":"Laing","permalink":"john-laing","crunchbase_url":"http://www.crunchbase.com/person/john-laing","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jan 04 22:35:24 UTC 2010","updated_at":"Mon Jan 04 22:35:59 UTC 2010","overview":"<p>John has a 35-year history in the technology industry, having held senior management positions with industry leaders in multiple markets: content discovery with Inxight; security with Symantec; desktop operating systems with Apple; and document printing with Xerox. </p>\n\n<p>While serving as the executive vice president of worldwide sales for Symantec from 1989 through 1997, he managed revenue growth from $15 million to $600 million and orchestrated several high-profile acquisitions, which helped to advance the company to its current successful position. As president and CEO at Inxight, John was instrumental in a company turnaround, growing revenue by 65 percent and expanding its worldwide channels. Throughout his career, John has raised money from respected venture institutions including Vantage Point Venture Partners, Accel Partners, Sequoia Capital and Reed Elsevier Ventures among others.</p>\n\n<p>Most recently, John served as CEO of Reactivity, a provider of XML-enabled networking solutions. In less than a year he restructured and positioned the company for sale. In March of 2007 Reactivity sold to Cisco for $135 million.\nJohn also serves on the board of Workshare and Grid Net, and is the new Chairman of the Board for JobTrain, a non-profit organization in the Silicon Valley.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Director","firm":{"name":"Verdiem","permalink":"verdiem","type_of_entity":"company","image":{"available_sizes":[[[150,30],"assets/images/resized/0006/5890/65890v1-max-150x150.png"],[[161,33],"assets/images/resized/0006/5890/65890v1-max-250x250.png"],[[161,33],"assets/images/resized/0006/5890/65890v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}