{"first_name":"John","last_name":"Gantz","permalink":"john-gantz","crunchbase_url":"http://www.crunchbase.com/person/john-gantz","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Feb 16 10:37:17 UTC 2011","updated_at":"Wed Feb 16 10:54:45 UTC 2011","overview":"<p>As Senior Vice President, John Gantz has responsibility for all IDC&#8217;s worldwide demand-side research, global market models, and portal products. He is also responsible for IDC&#8217;s worldwide services research. Prior to this role, he was in charge of worldwide research and consulting in personal systems, consumer deVices, workgroup and collaborative computing, and services. He is also a member of IDC&#8217;s management committee, chief architect of IDC&#8217;s Global Internet Commerce Market Model, and one of IDC&#8217;s chief spokespersons on broad technology and market issues. He cofounded IDC&#8217;s annual Internet Executive Forum, founded IDC&#8217;s PC Market Outlook conferences, and is a regular speaker at IDC&#8217;s annual Directions conferences in the United States and around the world.</p>\n\n<p>Prior to joining IDC in September 1992, Mr. Gantz was Vice President and Chief Analyst for Dataquest and Director of its Software Research Group. Before joining Dataquest in 1991, Mr. Gantz was executive Vice President of TFS, Inc., a custom research and consulting company that he cofounded in 1983. Before TFS, Mr. Gantz was a Vice President at IDC, where he managed newsletter operations and research programs in software and office automation.</p>\n\n<p>Mr. Gantz is well known in the industry through his frequent speaking and consulting engagements and his bylined biweekly column in Computerworld. In the past he has served as contributing editor for Networking Management, Computer Graphics World, InfoWorld, and Digital News. He has also published articles in Fortune, Forbes, Industry Week, Discover, High Technology, and Management Technology. Additional national and international exposure has come through quotes in all major business publications, interviews on CNN, and chairperson assignments at all major computer industry trade shows, including COMDEX, Internet Commerce Expo, ComNet, ITAA, NCGA, and PC Expo.</p>\n\n<p>Mr. Gantz is a graduate of Dartmouth College, former Navy submarine officer, and coauthor of The Naked Computer (Morrow, 1983). He has run two Boston Marathons (1979 and 1980) and hiked the Appalachian Trail end to end (1973). He is married and has two sons.</p>","image":{"available_sizes":[[[100,73],"assets/images/resized/0012/2296/122296v1-max-150x150.jpg"],[[100,73],"assets/images/resized/0012/2296/122296v1-max-250x250.jpg"],[[100,73],"assets/images/resized/0012/2296/122296v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Senior Vice President, Research","firm":{"name":"IDC","permalink":"idc","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0012/2291/122291v1-max-150x150.jpg"],[[170,68],"assets/images/resized/0012/2291/122291v1-max-250x250.jpg"],[[170,68],"assets/images/resized/0012/2291/122291v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}