{"first_name":"John","last_name":"Serafini","permalink":"john-serafini","crunchbase_url":"http://www.crunchbase.com/person/john-serafini","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Allied Minds","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Oct 25 05:22:01 UTC 2011","updated_at":"Fri Oct 28 07:36:46 UTC 2011","overview":"<p>John Serafini is a Director in the Boston office where he focuses upon the commercialization of technologies originating from U.S. federal research institutions. Before joining Allied Minds, John was a Principal at Good Harbor Consulting where he partnered with Mr. Richard Clarke, the former Special Advisor to three Presidential Administrations, as a venture capital/growth equity investor and M&amp;A specialist with sector concentration in cybersecurity and expertise in managing investments impacted by U.S. national security regulations. During this time, John was also responsible for the origination and transaction of numerous acquisitions, joint ventures, and strategic partnerships for Good Harbor and its affiliated investment funds and provided cybersecurity advisory services for governmental, commercial, and investment fund clients. In addition, John provided advisory and board services to a number of venture-capital backed cybersecurity firms. A former U.S. Army infantry officer, John earned a B.S. degree from the United States Military Academy at West Point, an MBA degree from the Harvard Business School, and an MPA degree from the Harvard John F. Kennedy School of Government. John is a Chartered Alternative Investment Analyst and a Chartered Financial Analyst candidate.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Director","firm":{"name":"Allied Minds","permalink":"allied-minds","type_of_entity":"financial_org","image":{"available_sizes":[[[150,65],"assets/images/resized/0012/8369/128369v5-max-150x150.png"],[[250,108],"assets/images/resized/0012/8369/128369v5-max-250x250.png"],[[450,195],"assets/images/resized/0012/8369/128369v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}