{"first_name":"John Herman","last_name":"Herman","permalink":"john-herman-herman","crunchbase_url":"http://www.crunchbase.com/person/john-herman-herman","homepage_url":"http://www.BarringtonHomesForSale.com","birthplace":"USA","twitter_username":"","blog_url":"http://www.BarringtonHomesForSale.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1979,"born_month":3,"born_day":13,"tag_list":"john-herman-review, john-herman-realtor, john-herman-realtor-review, real-estate-agent-in-barrington, realtor-in-barrington, realty-in-barrington","alias_list":null,"created_at":"Sat Dec 24 11:00:05 UTC 2011","updated_at":"Sat Dec 24 22:47:23 UTC 2011","overview":"<p>John Herman has been in Real Estate business for over 10 years and has helped a lot of home buyers and sellers during this time. Customer satisfaction is his number one priority. He holds his Master Degree, Accredited Buyer Representative Certification and Short Sale and Foreclosure Resource Certification. He is Equator Short Sale Certified Platinum Member. Congratulations to John for receiving customer-driven 2011 Five Star Professional Award. This award is based on research conducted by independent company and only given to top 7% of Real Estate agents. Surveys conducted were based upon nine criteria: customer service, integrity, market knowledge, communication, negotiation, closing preparation, finds then right home, marketing of home, and overall satisfaction. Additionally, they were asked whether they would recommend their Real Estate Agent to a friend. These results were scored and evaluated by a blue-ribbon committee of experts. It&#8217;s no surprise that John&#8217;s clients have scored him so high. He has extensive knowable of the Chicago Land market and keeps on the pulse of Economic and Real Estate news. The help to his clients goes way behind the closed transaction.</p>","image":{"available_sizes":[[[129,150],"assets/images/resized/0016/7599/167599v2-max-150x150.jpg"],[[215,250],"assets/images/resized/0016/7599/167599v2-max-250x250.jpg"],[[388,450],"assets/images/resized/0016/7599/167599v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}