{"first_name":"John","last_name":"W. Baumstark","permalink":"john-w-baumstark","crunchbase_url":"http://www.crunchbase.com/person/john-w-baumstark","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jun 17 08:52:53 UTC 2009","updated_at":"Wed Jun 17 08:54:23 UTC 2009","overview":"<p>John has over 20 years of technology experience in early and late-stage private and public companies.  Most recently, John was an Operating Partner at H.I.G. Ventures where he played an active role in the overall strategy of the fund as well as the development of portfolio companies.</p>\n\n<p>Prior to joining H.I.G. Ventures, he was responsible for overseeing global operations of IBM’s Master Data Management (MDM) Server unit, part of IBM’s Information Management division within the IBM Software Group.</p>\n\n<p>Prior to IBM, John was president and CEO of DWL, the leader in Customer Data Integration software.  Under John’s leadership the company was cash flow positive for 20 consecutive quarters, was profitable and was named one of the fastest growing technology companies in North America three years in a row by Deloitte and Touche.  DWL was acquired by IBM in 2005.</p>\n\n<p>Prior to DWL, John served as the Chief Operating Officer of TRADEX Technologies. Under John&#8217;s leadership, TRADEX became the market leader in digital marketplace platforms.  In March of 2000, TRADEX was acquired by Ariba (arba) for $5.6 billion, making it one of the largest software acquisitions in history.</p>\n\n<p>Before TRADEX, John directed worldwide field operations for Infinium Software.  There he built over $100 million in revenue, led a successful initial public offering and acquired two companies. Before joining Infinium, Baumstark held sales and sales management positions with Management Science America (MSA), a mainframe application software provider.</p>\n\n<p>John graduated from Colorado College with a BA in Business / Economics.  He is a former director of Procuri, which was sold to Ariba and of Marketmax, which was sold to SAS.</p>","image":{"available_sizes":[[[148,150],"assets/images/resized/0004/9060/49060v1-max-150x150.jpg"],[[156,158],"assets/images/resized/0004/9060/49060v1-max-250x250.jpg"],[[156,158],"assets/images/resized/0004/9060/49060v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chairman, CEO","firm":{"name":"Suniva","permalink":"suniva","type_of_entity":"company","image":{"available_sizes":[[[131,63],"assets/images/resized/0004/0753/40753v1-max-150x150.png"],[[131,63],"assets/images/resized/0004/0753/40753v1-max-250x250.png"],[[131,63],"assets/images/resized/0004/0753/40753v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}