{"first_name":"John","last_name":"D. Stanley","permalink":"john-d-stanley","crunchbase_url":"http://www.crunchbase.com/person/john-d-stanley","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Nov 20 14:33:43 UTC 2012","updated_at":"Tue Nov 20 14:38:21 UTC 2012","overview":"<p>John D. Stanley was appointed senior vice president and general counsel in April 2009. He has oversight responsibility for Air Products’ Law Group, which includes the company’s import/export compliance function; the Corporate Secretary’s Office; and the Corporate Relations department, which includes federal, state and community affairs, and corporate philanthropy activities. In May 2012 Mr. Stanley assumed additional responsibility for the Human Resources and Communications organizations. He also is a member of the company’s Corporate Executive Committee. </p>\n\n<p>Mr. Stanley joined Air Products in 1988 as an attorney in the Law Group. He has represented various commercial and functional organizations, including the Corporate Development Office (merger and acquisition activities), Performance Materials, Metals Tonnage, and Human Resources. In 1997 Mr. Stanley became group counsel to the Chemicals Group and in 2000 took on the additional responsibilities of senior mergers &amp; acquisitions lawyer for the Law Group. In 2004 he assumed the position of assistant general counsel, corporate and commercial, with responsibility for the overall management and delivery of legal services from the Law Group’s corporate and commercial section in the Americas. In 2007 Mr. Stanley’s role expanded to include legal activities in Europe, the Middle East and Africa, and he assumed the title of assistant general counsel, Americas and Europe. </p>","image":{"available_sizes":[[[88,110],"assets/images/resized/0022/1275/221275v1-max-150x150.jpg"],[[88,110],"assets/images/resized/0022/1275/221275v1-max-250x250.jpg"],[[88,110],"assets/images/resized/0022/1275/221275v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.A. ","subject":"","institution":"Lafayette College","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Senior Vice President and General Counsel","firm":{"name":"Air Products","permalink":"air-products","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0018/2540/182540v1-max-150x150.jpg"],[[233,71],"assets/images/resized/0018/2540/182540v1-max-250x250.jpg"],[[233,71],"assets/images/resized/0018/2540/182540v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}