{"first_name":"John","last_name":"W. Glynn","permalink":"john-w-glynn","crunchbase_url":"http://www.crunchbase.com/person/john-w-glynn","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Apr 05 08:54:20 UTC 2011","updated_at":"Tue Apr 05 08:57:06 UTC 2011","overview":"<p>As Founder and Managing Director of Glynn Capital Management, John has been actively investing since 1970. He has been a venture backer of companies such as Alza, Cypress Semiconductor, eHealthInsurance, Electronic Arts, Intel, Intergraph, Neurex, Peet&#8217;s Coffee and Tea, The Learning Company, Silicon Graphics, Sepracor, Sun Microsystems, and Vertex Pharmaceuticals. He has also served as a director of many small private companies. John&#8217;s current private investments include Openlane, Financial Engines, Merced Systems, Motricity, QuinStreet, Quantcast, Skybox, Tuvox, and Xactly.</p>\n\n<p>John also serves as an advisor to New Enterprise Associates, a Baltimore-based venture firm with more than $5 billion under management. He was a founder and director of Sterling Payot, a merchant banking firm located in San Francisco, which has launched several new companies and played a key role in restructuring several large companies.</p>\n\n<p>Since the late 1980s, John has devoted some of his time to teaching courses in entrepreneurship at the Stanford Graduate School of Business, Cambridge University, and the Darden Graduate Business School at the University of Virginia, where he also serves as the Thomas C. MacAvoy Professor of Business Administration. Courses including &#8220;Starting New Ventures&#8221; and &#8220;Venture Capital and the Entrepreneurial World&#8221; enable him to offer insight and experience to future venture investors and entrepreneurs, and build a network of bright young people who are eager to make their own impact on the world.</p>\n\n<p>John is a member of the Board of Trustees of Notre Dame, is a Trustee of the University Of Virginia School Of Law, and a former member of the Advisory Board of the Judge Business School at Cambridge University. John earned a bachelor&#8217;s degree from the University of Notre Dame, a J.D. degree from the University of Virginia, and an MBA from the Graduate School of Business of Stanford University.</p>","image":{"available_sizes":[[[150,135],"assets/images/resized/0012/9283/129283v1-max-150x150.jpg"],[[182,165],"assets/images/resized/0012/9283/129283v1-max-250x250.jpg"],[[182,165],"assets/images/resized/0012/9283/129283v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder & Managing Director","firm":{"name":"Glynn Capital Management","permalink":"glynn-capital-management","type_of_entity":"financial_org","image":{"available_sizes":[[[150,60],"assets/images/resized/0003/4531/34531v1-max-150x150.png"],[[250,101],"assets/images/resized/0003/4531/34531v1-max-250x250.png"],[[281,114],"assets/images/resized/0003/4531/34531v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}