{"first_name":"John","last_name":"J. Gentile","permalink":"john-j-gentile","crunchbase_url":"http://www.crunchbase.com/person/john-j-gentile","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Mar 04 12:59:50 UTC 2011","updated_at":"Fri Mar 04 13:02:28 UTC 2011","overview":"<p>John J. Gentile is responsible for overseeing various types of consulting engagements, including conducting SEC/FINRA broker dealer internal control reviews, anti-money laundering testing, written supervisory policy and procedures testing, and other consultation services. John is a frequent speaker at industry conferences on various broker dealer compliance topics, including &#8220;Effective Supervision,&#8221; &#8220;FINRA Rules 3012 &amp; 3013&#8221; and &#8220;Anti Money Laundering Requirements for Broker Dealers under the PATRIOT Act.&#8221; In 1987 John joined the SEC as a Securities Compliance Examiner, becoming a Branch Chief in 1991. He became Assistant Regional Director in 1993, supervising a team of twenty broker dealer managers and examiners. He also planned and conducted financial, operational, and sales practice examinations of the largest broker dealers and was among those responsible for a review of hedge funds&#8217; impact on broker dealer internal controls. Before joining the SEC, John was a Financial Damage Analyst with PaineWebber Inc. Most recently from 2000-2007 John was an Executive Consultant, Broker Dealer Services, at National Regulatory Services. John has an MBA from Fordham University and a BS in Finance from Central Connecticut State University. From 1995 to 2002, John was also a member of the Securities Industry Continuing Education East Coast Content Committee.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Ascendant Compliance Management","permalink":"ascendant-compliance-management","type_of_entity":"company","image":{"available_sizes":[[[150,49],"assets/images/resized/0012/4995/124995v1-max-150x150.jpg"],[[211,69],"assets/images/resized/0012/4995/124995v1-max-250x250.jpg"],[[211,69],"assets/images/resized/0012/4995/124995v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}