{"first_name":"Johnny","last_name":"Clarke","permalink":"johnny-clarke","crunchbase_url":"http://www.crunchbase.com/person/johnny-clarke","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Maximum Balance Foundation","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jun 20 18:22:38 UTC 2012","updated_at":"Sun Nov 25 00:39:59 UTC 2012","overview":"<p>Information Architect and Cisco Systems Home Design Engineer</p>\n\n<p>Directs and oversees a team of designers and drafters who use computer aided design (CAD) for product design. </p>\n\n<p>Develops, implements, and manages the company&#8217;s design strategy. Knowledgeable about principles of design, construction, engineering, and building regulations. </p>\n\n<p>Ensures drawings and designs are completed on time and adhere to the established specifications and standards. Monitors the bid or proposal process to ensure organizational goals are met.</p>\n\n<p>Seeking my Cisco Certified Architect which is the highest level of accreditation achievable within the Cisco Certification program. It is the pinnacle for individuals like myself wishing to show their formal validation of Cisco technologies and infrastructure architecture.</p>\n\n<p>This prestigious credential recognizes the architectural expertise of network designers who can support the increasingly complex networks of global organizations and effectively translate business strategies into evolutionary technical strategies.</p>\n\n<p>There are no formal training programs available for the Cisco Certified Architect certification. However, candidates wishing to attain their Cisco Certified Architect certification must meet before an in-person board made of Cisco-appointed exam committee members during which the candidate defends their proposed network solution.</p>\n\n<p>Responsibilities of the Cisco Certified Architect\nLead creation and evolution of architecture\nAnalyze technology and industry market trends\nEstablish governing principles for networks\nSelection of technology and products\nIdentification of organization resource needs\nLead the development of communication and education plan for network architecture</p>\n\n<p>If you wish or know Candidates wishing to apply to become a Cisco Certified Architect everyone must also hold a valid Cisco Certified Design (CCDE) certification, validating their expert level design and business level skill set.</p>\n\n<p>Defining the Cisco Certified Architect</p>\n\n<p>A Cisco Certified Architect gathers the business requirements and objectives necessary to produce a blueprint for an integrated, large-scale, complex, global network. They can translate business parameters and objectives into functional requirements for a network design. In addition, Cisco Certified Architects can clearly communicate and advocate proposed Cisco network architectures.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Managing Partner","firm":{"name":"Maximum Balance Foundation","permalink":"maximum-balance-foundation","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}