{"first_name":"John","last_name":"Lyman","permalink":"john-lyman","crunchbase_url":"http://www.crunchbase.com/person/john-lyman","homepage_url":"http://www.WRLymanGroup.com","birthplace":"","twitter_username":"WRLymanGroup","blog_url":"http://www.WRLyman.com","blog_feed_url":"http://www.sociobusinesshosting.com","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"sociobusiness-portal-2020tags-channel-wrlymangroup-business-on-line-cafe","alias_list":null,"created_at":"Tue Apr 24 01:29:10 UTC 2012","updated_at":"Mon Apr 30 01:05:14 UTC 2012","overview":"<p>Primary Officer William R. Lyman, President &amp; CEO WRLymanGroup, L.L.C.\nBusiness Properties Division Director\nCEDZ Chief Properties Strategist</p>\n\n<ul>\n<li>Residential, Commercial\nTech to Agricultural Development Collaborations</li>\n</ul>\n\n<p>Secondary Officer John L. Lyman, Vice President, Chief Strategist &amp; Operating Officer WorldWide Operations\nWRLymanGroup, L.L.C.\nBusiness Services Division Director\nCEDZ Chief Strategist SocioBusiness Portal\nManaging Director Development PE/VC Holdings, Collaborations</p>\n\n<p>Discover the WRLymanGroup LLC   …Mission, Focus and more…  Enterprise Development Group for Entrepreneurs and Small Enterprise Enabling, Empowering and Encouraging enterprise and enterprise zone development into international footprints of the SocioBusiness Portal and 2020TAGS Channel Collaborations.</p>\n\n<p>WRLymanGroup LLC Mission –</p>\n\n<p>The Group’s continuing mission is to stimulate, build, enable, empower and encourage entrepreneur, micro business, and small to medium enterprise ideas through favored, working capital collaborative assistance and WRLymanGroup’s Continuous Enterprise Development Zones (CEDZs) or other working collaborations.</p>\n\n<p>WRLymanGroup LLC About –</p>\n\n<p>Where are the gaps in entrepreneur and enterprise zone development?  Is it in working capital?  Where is the gap in invigorating the small enterprise market?</p>\n\n<p>Identifying markets, its needs and identifying favored, collaborative, or working capital models can best enhance small enterprise at the Micro Business as well as the Small to Medium Enterprise level.  It is WRLymanGroup’s focus and unique philosophy of this paradigm.</p>\n\n<p>Moving from concept to actualization.  The stimulation of entrepreneur, micro business and small to medium enterprise into collaborative, international, working capital models is the paradigm of now and the future for enterprise enablement and delivery of small enterprise collaborations into international footprints.</p>\n\n<p>WRLymanGroup LLC Markets, Services and Collaborative Working Capital Cooperations –</p>\n\n<p>The Group focus is to identify collaborative ventures within ranges of $5,000 to $500,000.</p>\n\n<p>Identifying Micro Entrepreneur and Micro Business collaborative, enabled opportunities is consistent with the Group’s ideology and philanthropic values.  Stimulating enterprise and developing solutions for the gaps in the paradigm facing small enterprise development, empowers the CEDZ or zones of continuous enterprise into the worldwide reach of the collaborative SocioBusiness Portal.</p>\n\n<p>The Group also shares enterprise market intelligence, provides, shares tools and assists or provides other services directly to or with collaborative endeavors from intellectual property, trade, enterprise international footprints and more!</p>\n\n<p>Reducing the choke points of enterprise development and enabling collaborations across the CEDZs of the SocioBusiness Portal provides additional international reach through the virtual presence on the 2020TAGS Channel.</p>","image":{"available_sizes":[[[16,16],"assets/images/resized/0018/5595/185595v2-max-150x150.jpg"],[[16,16],"assets/images/resized/0018/5595/185595v2-max-250x250.jpg"],[[16,16],"assets/images/resized/0018/5595/185595v2-max-450x450.jpg"]],"attribution":"<p>SocioBusiness Portal Entreprenuer Micro Business Small to Medium Enterprise Private Equity Venture Capital Continuous-Enterprise-Development-Zones CEDZs 2020TAGS Channel</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.MyLyman.Blogspot.com","title":"MyLymanBlogspot"},{"external_url":"http://www.WRLyman.com","title":"Business On-Line Cafe"}],"web_presences":[]}