{"first_name":"John","last_name":"O’Donnell","permalink":"john-odonnell-2","crunchbase_url":"http://www.crunchbase.com/person/john-odonnell-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 26 13:51:40 UTC 2009","updated_at":"Fri Jun 26 13:52:40 UTC 2009","overview":"<p>John O’Donnell is responsible for all the financial and administrative operations of the company. He brings more than 15 years of financial leadership experience and a track record of success to Aveksa. Before joining Aveksa, John was the Controller at Empirix Inc., a leading provider of voice and web application testing and monitoring solutions, where as a member of the management team he was responsible for directing all accounting, risk management, financial planning and analysis, and contract management activities. Prior to Empirix, John was the Vice President of Finance at CA, Inc. where he led the finance and administration function for the Northeast Region and Canada. He joined CA after playing a key role in the successful acquisition of Netegrity, Inc., a leading enterprise security management software vendor. At Netegrity, John served as the Controller and was responsible for directing all financial activities including accounting, tax, financial planning and analysis, risk management, SEC reporting and the Sarbanes-Oxley certification process. John began his career as an auditor with Ernst &amp; Young LLP. John holds a Bachelor of Business Administration Degree from the University of Massachusetts, Amherst and is a Certified Public Accountant in Massachusetts.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CFO","firm":{"name":"Aveksa","permalink":"aveksa","type_of_entity":"company","image":{"available_sizes":[[[112,32],"assets/images/resized/0005/0897/50897v1-max-150x150.png"],[[112,32],"assets/images/resized/0005/0897/50897v1-max-250x250.png"],[[112,32],"assets/images/resized/0005/0897/50897v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}