{"first_name":"John","last_name":"Gibson","permalink":"john-gibson-3","crunchbase_url":"http://www.crunchbase.com/person/john-gibson-3","homepage_url":"http://www.JustRightComputers.com","birthplace":"Grand Rapids, MI","twitter_username":"JustRightPC","blog_url":"http://blog.justrightcomputers.com","blog_feed_url":"http://blog.justrightcomputers.com/?feed=rss","affiliation_name":"Just Right","born_year":1962,"born_month":8,"born_day":18,"tag_list":"","alias_list":null,"created_at":"Fri Jan 13 01:39:43 UTC 2012","updated_at":"Tue Jan 17 07:07:14 UTC 2012","overview":"<p>I am a Technology &amp; Small Business Enthusiast - I love helping businesses save money and to use technology efficiently and effectively. XeeMe on all of my social networks: http://xeeme.com/JustRight/ </p>\n\n<p>I have a long history in technology and I love the fact that computers and technology are constantly changing. Here&#8217;s how I started: I wrote my first computer program when I was 12 in 1974. My Middle School started a special program for kids on the Honor Roll to go to a local college to sit in and participate in college classes. I chose to sit in on Computer Science, Physics and Astronomy classes. Even though the technology was an antiquated key punch type of system with a 100 baud rate phone in a data coupler, I was hooked on technology from that point on. I wrote some Basic commands to form a simple program and tweaked the program until I got it to do what I wanted. </p>\n\n<p>I joined the Navy right out of High School and selected a specialty in the Advanced Electronics Field. I went to school my first two years in the Navy to become a technician for an analog computer with dials powered by synchros and servos and a phosphorous screen. I remember being excited when the system got an upgrade to add some LED readouts to the console. </p>\n\n<p>In 1982 while serving aboard a US Navy ship, I built my first Personal Computer. I soldered and assembled my Timex/Sinclair 2000 with 2K of memory and used a cassette deck as my storage device and had a 4 color CGA monitor. I remember ordering a 16K upgrade for the system and hearing those famous words: &#8220;You&#8217;ll never need more memory than that.&#8221; I had to write all of the programs that I used on that computer because there really were not any programs available. </p>\n\n<p>Of course, computers have come a long way since then and I have had my hands in them all along the way. I put together networks when networking first started using 10BaseT components back in the days of DOS and Windows 3.1 and I happily upgraded many of those networks to fast ethernet components and CAT 5 cable. I received training and certification in Gigabit ethernet standards as well. Now I deal a lot with wireless networks and just about any other type of networking method used today. </p>\n\n<p>I am the founder of Just Right, and I&#8217;m still running the company as the Director of Operations. I started Just Right in 1995 while still on active duty in the Navy and worked on building the business part-time. When I retired in 1997, the business was running at full speed and growing. I had a very easy transition from the military to civilian life. </p>\n\n<p>Now I am deeply interested in learning more about social media and only started my quest in November 2011. So I am still a newbie when it comes to social networking. The good thing is, I understand technology really well and I learn quickly.</p>","image":{"available_sizes":[[[105,150],"assets/images/resized/0016/9964/169964v2-max-150x150.jpg"],[[175,250],"assets/images/resized/0016/9964/169964v2-max-250x250.jpg"],[[315,450],"assets/images/resized/0016/9964/169964v2-max-450x450.jpg"]],"attribution":"<p>John Gibson</p>"},"degrees":[{"degree_type":"AA","subject":"Computer Science","institution":"National University","graduated_year":1988,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"","firm":{"name":"Just Right","permalink":"just-right","type_of_entity":"financial_org","image":{"available_sizes":[[[150,150],"assets/images/resized/0017/0426/170426v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0017/0426/170426v2-max-250x250.jpg"],[[450,450],"assets/images/resized/0017/0426/170426v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"","firm":{"name":"BofA San Diego 4S","permalink":"bofa-san-diego-4s","type_of_entity":"financial_org","image":null}},{"is_past":true,"title":"Director of Operations","firm":{"name":"Just Right","permalink":"just-right","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.Twitter.com/JustRightPC","title":"Twitter account"},{"external_url":"http://XeeMe.com/JustRight","title":"My entire social presence"},{"external_url":"http://www.linkedin.com/in/justright","title":"Linked in - personal"}]}