{"first_name":"John","last_name":"J. Freund","permalink":"john-j-freund","crunchbase_url":"http://www.crunchbase.com/person/john-j-freund","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Nov 30 23:40:37 UTC 2008","updated_at":"Mon Dec 01 05:47:54 UTC 2008","overview":"<p>John has been involved in founding, financing, managing and advising healthcare companies since 1982. He began his career at Morgan Stanley in New York, where he co-founded the Healthcare Group in the Corporate Finance Department and was later the original healthcare partner at Morgan Stanley Ventures. He then was an operating executive for six years as Executive Vice President of Acuson Corporation (an NYSE-traded company that is now part of Siemens), where he ran Marketing and led the cross-functional management of the company&#8217;s product introductions. In 1995, he licensed the technology that served as the core of Intuitive Surgical, Inc. (NASDAQ:ISRG), co-founded Intuitive and raised its initial venture capital. He then spent two years as the West Coast partner at the Private Equity group of Chancellor Capital Management (now INVESCO), before founding Skyline in 1997. He has experience with most of the major sectors of the healthcare investment market including medical devices, information technology, small molecule and protein therapeutics, biochips and diagnostics. He received a B.A. from Harvard College, an M.D. from Harvard Medical School, and an M.B.A. from Harvard Business School, where he was a Baker Scholar and won the Loeb Fellowship in Finance. He was the co-author of The Official MBA Handbook, which spent 16 weeks on the New York Times bestseller list in 1982. He loves golf and tennis, and is an ardent New York Yankee fan, always a problem at Skyline when the Bombers play the Red Sox.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0003/0364/30364v1-max-150x150.jpg"],[[240,240],"assets/images/resized/0003/0364/30364v1-max-250x250.jpg"],[[240,240],"assets/images/resized/0003/0364/30364v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Skyline Ventures","permalink":"skyline-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,32],"assets/images/resized/0003/0323/30323v1-max-150x150.jpg"],[[250,54],"assets/images/resized/0003/0323/30323v1-max-250x250.jpg"],[[450,97],"assets/images/resized/0003/0323/30323v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}