{"first_name":"John","last_name":"J. Rockwell","permalink":"john-j-rockwell","crunchbase_url":"http://www.crunchbase.com/person/john-j-rockwell","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 04 11:46:22 UTC 2009","updated_at":"Thu Jun 04 11:59:46 UTC 2009","overview":"<p>John has 20 years of experience investing in venture capital and developing companies commercializing applications of advanced materials and 25 years of financial investment experience. Prior to co-founding Element, John was a Partner at Advent International Corporation and managed the firm’s California office. John joined Advent in 1996 and participated in the direct investment activities of both Advent&#8217;s EnviroTech and Advent Energy II funds. His primary areas of investment focus include energy storage, alternative fuels, energy management, renewable energy, advanced materials, and supply chain management.</p>\n\n<p>Before Advent, John spent 7 years at Materia Ventures Associates, investing in and managing early-stage companies that were commercializing advanced material technologies. While at Materia, John also served as CEO of Luxar Corporation, a manufacturer of CO2 lasers for the medical market and as President of SSC, Inc., a manufacturer of high-performance ceramic oxide materials used in superconductors, fuel cells, catalysts, and other applications. From 1984 to 1988, John held various positions at 3M Corporation in its Acquisitions and Business Development Department.</p>\n\n<p>John received a BS in Business Administration from Michigan Technological University and a Masters degree in Business Administration from the University of Minnesota’s Carlson School of Management. John is also the past Chairman of the CleanTech Venture Network Advisory Board.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0004/6665/46665v1-max-150x150.jpg"],[[233,144],"assets/images/resized/0004/6665/46665v1-max-250x250.jpg"],[[233,144],"assets/images/resized/0004/6665/46665v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Masters degree","subject":"Business Administration","institution":"University of Minnesota’s Carlson School of Management","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Founder and Managing Director","firm":{"name":"Element Partners","permalink":"element-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,36],"assets/images/resized/0004/6656/46656v1-max-150x150.jpg"],[[214,52],"assets/images/resized/0004/6656/46656v1-max-250x250.jpg"],[[214,52],"assets/images/resized/0004/6656/46656v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}