{"first_name":"Jon","last_name":"Warner","permalink":"jon-warner-3","crunchbase_url":"http://www.crunchbase.com/person/jon-warner-3","homepage_url":"http://www.ReadyToManage.com","birthplace":"England","twitter_username":"ReadyToManage","blog_url":"http://blog.readytomanage.com/","blog_feed_url":"http://blog.readytomanage.com/feed/","affiliation_name":"Unaffiliated","born_year":1958,"born_month":9,"born_day":18,"tag_list":"coach, author, consultant, ceo","alias_list":null,"created_at":"Sat Mar 31 15:18:19 UTC 2012","updated_at":"Thu Apr 05 04:10:13 UTC 2012","overview":"<p>Jon’s management career spans more than 25 years in the U.K, U.S and Australia and he has worked as a senior executive in both public and private sector companies. </p>\n\n<p>Jon is Chairman of WCOD, an international management consulting firm, mainly focused on the banking and financial services world, (where he was the CEO until 2008). In this role Jon spent 4 years working with Barclays in the UK, 2 years with NAB in Australia, 6 years with HSBC internationally and 2 years with Lloyds TSB in the UK. Jon is also Chairman of Warner Results Coaching -a specialist executive coaching firm in the US and UK and on the Board of ReadyToManage Inc. </p>\n\n<p>In the past, Jon was CEO of Team Publications, a large Australian Specialist publisher, and prior to that spent 7 years in Exxon-Mobil (in the United Kingdom, Australia and Nigeria) ending his career there as a General manager deputy CEO and with responsibility for multiple functions, a staff of over 600 people and a budget of over £85 million. His career spanned a wide range of disciplines including finance, human resource management, engineering and production with a final position of Deputy MD and Director of Operations. His earlier career was spent in the industrial gas business working all over Europe and the United States of America (mainly in a range of sales, operational and human resource management positions). </p>\n\n<p>Jon has written several books on best-practice management topics in the last few years. Titles cover topics such as leadership, team development, process improvement, and managing under-performance. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}