{"first_name":"Jon","last_name":"Edney","permalink":"jon-edney","crunchbase_url":"http://www.crunchbase.com/person/jon-edney","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Ozmo Devices","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jun 02 17:18:06 UTC 2008","updated_at":"Wed Jun 18 17:24:35 UTC 2008","overview":"<p>Mr. Edney joined Ozmo Devices in 2006. An active member of the wireless LAN industry since 1993, he is widely recognized for his innovation and leadership in the development of new wireless technologies.</p>\n\n<p>In 1996, as co-founder and President of Intalk Inc., Mr. Edney was instrumental in the development and introduction of the first IEEE802.11 solutions. Intalk Inc. developed and sold IEEE802.11 access points and, in partnership with Intersil Corp., was very active in the creation of standards and technology for IEEE802.11b, the high-speed wireless standard. Nokia Corp. acquired Intalk Inc. in 1999 and Mr. Edney was appointed a Vice President in Nokia&#8217;s Wireless Business Communications group, where he was responsible for Access Point product development and contributed to the launch of the successful Nokia A032.</p>\n\n<p>In the early 1990s, Mr. Edney was General Manager of Symbionics Networks Ltd., a UK company that developed pioneering low-cost wireless LAN solutions.\nMr. Edney is an expert on security in wireless LANs and a contributor to the IEEE802.11i standards development. He is co-author of the book Real 802.11 Security, Wi-Fi Protected Access and 802.11i published by Addison-Wesley in 2003.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Vice President of Software","firm":{"name":"Ozmo Devices","permalink":"ozmo-devices","type_of_entity":"company","image":{"available_sizes":[[[150,80],"assets/images/resized/0001/9815/19815v1-max-150x150.jpg"],[[171,92],"assets/images/resized/0001/9815/19815v1-max-250x250.jpg"],[[171,92],"assets/images/resized/0001/9815/19815v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}