{"first_name":"Jon","last_name":"Goldman","permalink":"jon-goldman","crunchbase_url":"http://www.crunchbase.com/person/jon-goldman","homepage_url":"http://qlipso.com/","birthplace":"","twitter_username":"Veoh","blog_url":"http://blog.qlipso.com/","blog_feed_url":"http://blog.qlipso.com/feed/","affiliation_name":"Qlipso","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 18 15:56:22 UTC 2009","updated_at":"Mon Jul 19 21:34:41 UTC 2010","overview":"<p>Jon Goldman is the CEO of Qlipso, a multiuser content-sharing platform that enhances and expands people&#8217;s real-life social interactions online. </p>\n\n<p>Jon Goldman takes more than a decades’ experience in developing interactive digital content in the videogame industry to his role as chief executive officer of Qlipso (http://www.qlipso.com). He joined the multiuser content-sharing platform company in early 2009 and oversees roll-out of the Qlipso social-viewing platform, which enables people to extend and enhance their real-life social lives online.</p>\n\n<p>In March 2010, Goldman played an instrumental role in Qlipso’s successful purchase of significantly all of the assets of the online video site Veoh (http://www.veoh.com). This acquisition propelled Qlipso from a small R&amp;D company to one of the world’s leading online video and social-content companies and enabled the integration of social features within much of the world’s mainstream digital content. </p>\n\n<p>Goldman most recently served as Chairman and CEO of Foundation 9 Entertainment, the largest independent videogame company in the world. Along with some close friends in the mid-1990s, he started this multinational company, which, at its peak, employed nearly one thousand talented game developers around the world with a gameography of more than 500 titles and multiple million-plus sellers.</p>\n\n<p>Prior to co-founding Foundation 9 Entertainment, Goldman was a co-founder of Backbone Entertainment and ImaginEngine, two of the videogame companies that became the basis of Foundation 9 Entertainment. </p>\n\n<p>Goldman began his career as an associate at investment banking advisory firm International Strategic Alliances, specializing in developing strategic partnerships between U.S. and Asian technology companies. </p>\n\n<p>Goldman has spoken at some of the technology and media industry’s most respected events, including Digital Hollywood, the iHollywood Forum, Electronic Entertainment Expo Game Developer’s Conference and D.I.C.E. He sits on the Board of Directors for New York-based philanthropy Common Cents, which is the leading children’s service learning non-profit. </p>\n\n<p>A magna cum laude graduate in East Asian Studies from Harvard, Goldman continued his study of Asian culture with a Mombusho fellowship from the University of Kyoto. He lives and works in Venice, Calif., with his wife and two daughters. </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0009/4176/94176v2-max-150x150.jpg"],[[132,198],"assets/images/resized/0009/4176/94176v2-max-250x250.jpg"],[[132,198],"assets/images/resized/0009/4176/94176v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO and founder","firm":{"name":"Qlipso","permalink":"qlipso","type_of_entity":"company","image":{"available_sizes":[[[150,71],"assets/images/resized/0006/6689/66689v1-max-150x150.png"],[[193,92],"assets/images/resized/0006/6689/66689v1-max-250x250.png"],[[193,92],"assets/images/resized/0006/6689/66689v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://qlipso.com/","title":"Qlipso"},{"external_url":"http://www.veoh.com/","title":"Veoh"},{"external_url":"http://blog.qlipso.com/","title":"My Blog"},{"external_url":"http://www.linkedin.com/profile?viewProfile=&key=652373&authToken=zoP7&authType=NAME_SEARCH&locale=en_US&srchindex=1&srchid=08117a16-afcf-4d8a-bb79-f6da777f408b&srchtotal=541&pvs=ps&goback=.fps_jon+goldman_*1_*1_*1_*1_*1_*1_*1_Y_*1_*1_*1_false_1_R_true_*2","title":"LinkedIn Profile"}]}