{"first_name":"Jon","last_name":"Bonanno","permalink":"jon-bonanno","crunchbase_url":"http://www.crunchbase.com/person/jon-bonanno","homepage_url":"http://www.sustainablepowerassets.com","birthplace":"","twitter_username":"greenbonanno","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"it, wireless, games, clean-tech, cleantech, online-marketing, web-2-0, social-media","alias_list":null,"created_at":"Wed Dec 15 07:49:24 UTC 2010","updated_at":"Tue Dec 21 07:05:53 UTC 2010","overview":"<p>Jon Bonanno makes people smile, enables them to thrive, challenges himself and ones near him to be the most and engages in a real way.</p>\n\n<p>Through his outgoing and charismatic personality, Jon leads by example.  Initially as a founder and operator of several successful start-ups in Internet billing, wireless streaming and community network marketing (now called social media :-)), he currently invests in, develops and operates cleantech and new media companies.  With a clear objective of positive global impact, Jon strives to work with the best people on projects that allow all participants to achieve elegantly and exercise their personal skills at a level of mastery that continues to improve.</p>\n\n<p>Building culture and learning into all aspects of his life, a central compass of purpose guides him towards betterment of the world we all live in.  Whether through removing fossil fuel from our energy mix with low-cost and reliable renewable energy sources, developing new business models to empower the general public to benefit from the shifting energy infrastructure or engaging in a dialog of  web 2.0 impact/call to action, he leads with integrity, creativity and vision.  At the core, is a belief that capitalism is one of the exceptional levers that can be used to improve health, environment, politics and general well-being for multitudes of people.  It must be profitable, to be truly sustainable.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0011/4165/114165v2-max-150x150.jpg"],[[200,250],"assets/images/resized/0011/4165/114165v2-max-250x250.jpg"],[[360,450],"assets/images/resized/0011/4165/114165v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}