{"first_name":"Jon","last_name":"Stillman","permalink":"jon-stillman","crunchbase_url":"http://www.crunchbase.com/person/jon-stillman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Feb 26 19:10:44 UTC 2008","updated_at":"Mon May 18 10:55:53 UTC 2009","overview":"<p>Jon joined High Peaks Venture Partners in January 2005, bringing over 20 years of experience in executive technology management. In addition to his role at High Peaks, Jon is Managing Director of Assembla, Inc., an early stage software company focused on bringing the advantages of collaborative open source models to specific vertical industries, including securities research and online marketing.</p>\n\n<p>Previously, Jon founded and led Half Moon Ventures, where he provided strategic consulting services, interim executive management, and technical due diligence in support of investments and acquisitions. One of his first engagements was as CEO of an early-stage software services company focused on industry-specific collaboration and procurement solutions for the media production industry.</p>\n\n<p>Before this, Jon was SVP of Technology and Strategy at divine, Inc., where he was directly responsible for identifying and/or evaluating for investment or acquisition over 100 companies from technology, strategy, and operational perspectives. In addition, he was responsible for setting technology investment strategy and helping both large and small businesses build market leadership positions.</p>\n\n<p>Prior to divine, Jon spent over 14 years at GE’s Global Research Center in roles including original research (in distributed information management, collaboration, and temporal reasoning), leading teams to bring advanced software ideas to practical and profitable application, and providing technology and strategic due diligence for acquisition, partnering, and investment candidates. His most recent role with GE was as Director of eBusiness Technologies, where he was responsible for starting, overseeing, and providing technical direction for a number of GE’s e-business ventures. He also regularly provided strategic consulting to the e-business leaders of many of the GE businesses and has been a strategic technology advisor to Lockheed Martin.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0004/4403/44403v1-max-150x150.jpg"],[[167,250],"assets/images/resized/0004/4403/44403v1-max-250x250.jpg"],[[180,269],"assets/images/resized/0004/4403/44403v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Venture Partner","firm":{"name":"High Peaks Venture Partners","permalink":"high-peaks-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,42],"assets/images/resized/0001/3798/13798v5-max-150x150.png"],[[164,47],"assets/images/resized/0001/3798/13798v5-max-250x250.png"],[[164,47],"assets/images/resized/0001/3798/13798v5-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Board Member","firm":{"name":"Apprenda","permalink":"apprenda","type_of_entity":"company","image":{"available_sizes":[[[150,31],"assets/images/resized/0003/1069/31069v4-max-150x150.jpg"],[[250,52],"assets/images/resized/0003/1069/31069v4-max-250x250.jpg"],[[351,74],"assets/images/resized/0003/1069/31069v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}