{"first_name":"jon","last_name":"willison","permalink":"jon-willison-2","crunchbase_url":"http://www.crunchbase.com/person/jon-willison-2","homepage_url":"http://list-on-mls.blogspot.com/","birthplace":"","twitter_username":"listflatefeegm","blog_url":"http://list-on-mls.blogspot.com/","blog_feed_url":"http://list-on-mls.blogspot.com/","affiliation_name":"Unaffiliated","born_year":1985,"born_month":3,"born_day":18,"tag_list":"real-estate-listing, list-on-mls, flat-fee-broker","alias_list":null,"created_at":"Tue Sep 28 05:49:33 UTC 2010","updated_at":"Fri Oct 08 19:01:05 UTC 2010","overview":"<p>In this economic downturn where some have shut their business or someone have lost their job saving money is very important. If you are looking to sell your property one can make savings by getting in contact with a flat fee broker to list on MLS. Listing your property the right way is very important to attract the right potential buyers and their view on your real estate listing. When you make up your mind to list on MLS, flat fee broker Continental Real Estate Group will help you in doing all the paper work required for your real estate listing. For this flat fee broker will ask you about your property you are looking to sell. </p>\n\n<p>Depending on real estate listing package you sign up for you will be required to upload images of your property to support the best for your property. More images you attach with your real estate listing the better are the chances of your property been sold quickly. </p>\n\n<p>Continental Real Estate Group will list your property in MLS which will also be listed in national MLS database. Once your real estate listing gets in national MLS database your real estate listing will get maximum exposure it needs to get sold. You have bright chances of getting flooded with queries and get a good price for your property. You pay only a flat fee to flat fee broker for only the services you opt for. Besides this you will pay small percentage of sales commission to buyers’ agent when deal is closed. </p>\n\n<p>If you calculate the amount of time you might save when you list on MLS, you might be surprised. Equally you end up with saving huge amount of money with list on MLS done by flat fee broker. For more information and details on real estate listing process by flat fee broker Continental Real Estate Group visit www.listflatfeeonmls.com, www.listonmlsbyowner.com, www.listmyhomeinmls.com.</p>","image":{"available_sizes":[[[150,89],"assets/images/resized/0010/3344/103344v2-max-150x150.jpg"],[[213,127],"assets/images/resized/0010/3344/103344v2-max-250x250.jpg"],[[213,127],"assets/images/resized/0010/3344/103344v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}