{"first_name":"Jon","last_name":"DeVaan","permalink":"jon-devaan","crunchbase_url":"http://www.crunchbase.com/person/jon-devaan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jul 23 22:26:13 UTC 2008","updated_at":"Wed Jul 23 22:26:33 UTC 2008","overview":"<p>As senior vice president of the Windows Core Operating System Division, Jon DeVaan manages the engineering team responsible for creating the core components and architecture of Microsoft Windows. In addition to his Windows responsibilities, DeVaan works across Microsoft on Engineering Excellence, and is responsible for the standards, strategies and direction of the software-engineering discipline at the company.</p>\n\n<p>DeVaan is a 22-year Microsoft veteran, and his extensive experience and knowledge have established him as a respected leader in the technology industry. DeVaan has held a variety of executive and management positions while at Microsoft. Prior to his current role, he started the new corporate function of Engineering Excellence, across all Microsoft products.</p>\n\n<p>Previously, DeVaan managed the TV Division at Microsoft, responsible for the UltimateTV service and the Microsoft TV software platform. DeVaan co-managed Microsoft&#8217;s Consumer and Commerce Group, where he helped design and initiate the turnaround strategy for MSN. DeVaan led Microsoft&#8217;s Desktop Applications Division, growing the business to US$7 billion in annual revenues. Responsible for the Microsoft Office family of applications and advanced application technologies, DeVaan led the initial design of Microsoft Office 2000, setting the direction of the product to seamlessly integrate Internet technologies and make them easier to use. In addition to serving as vice president of development and director of development for Office95 and 97, DeVaan worked in various capacities ranging from Excel software design engineer to development manager. His leadership and experience provided essential management of cross-platform technology and helped pioneer the development processes used to create Microsoft products. DeVaan has been a guest speaker at many events on the topic of software engineering and in the interactive and cable TV industries. Most notably, DeVaan served as a panelist with United Nations Secretary General Kofi Annan at the 2000 United Nations&#8217; World Television Forum to discuss the convergence of TV, digital technology and the Internet.</p>\n\n<p>DeVaan holds bachelor&#8217;s degrees in mathematics and computer science from Oregon State University, and holds patents in the area of simplifying user interface elements in PC applications.</p>\n\n<p>DeVaan serves as a trustee of the Oregon State University Foundation, as a technical advisor to the Oregon Innovation Council, and as an ambassador for United Way of King County. </p>","image":{"available_sizes":[[[118,150],"assets/images/resized/0002/2649/22649v1-max-150x150.jpg"],[[162,205],"assets/images/resized/0002/2649/22649v1-max-250x250.jpg"],[[162,205],"assets/images/resized/0002/2649/22649v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Senior Vice President, Windows Core Operating System Division","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}