{"first_name":"Jon","last_name":"Dobson","permalink":"jon-dobson","crunchbase_url":"http://www.crunchbase.com/person/jon-dobson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 27 06:48:12 UTC 2009","updated_at":"Wed May 27 06:48:54 UTC 2009","overview":"<p>holds a personal chair in Biophysics and Biomedical Engineering at the Institute for Science &amp; Technology in Medicine (ISTM), Keele University and an Eminent Scholar Visiting Professorship at the Department of Materials Science &amp; Engineering, University of Florida. He has a B.Sc. and M.Sc. from the University of Florida and a Ph.D. from the Swiss Federal Institute of Technology (ETH-Zurich, 1991). In 2004, Professor Dobson became a Royal Society Wolfson Research Merit Fellow and was elected as Fellow of the Royal Society of Medicine and Fellow of the Institute for Nanotechnology in 2007. He has more than 140 peer-reviewed publications and has been an invited speaker at more than 25 institutes &amp; scientific meetings, including the recent Royal Society of Medicine / US Food &amp; Drug Administration Conference on Gene Therapy: State of the Art. Since 2003, he has authored 15 invited review articles for journals such as Nature Nanotechnology,  Journal of Physics D and Gene Therapy.</p>\n\n<p>Professor Dobson was the recipient of a UK Medical Research Council Milstein Award in 2008 and co-recipient of a Wellcome Trust Showcase Award in 2002. He is on the editorial board of seven journals, including IEEE Transactions on NanoBioscience and Recent Patents on DNA and Gene Sequences and is a member of the EPSRC Peer Review College. He has been a reviewer for more than 40 journals and funding bodies including Nature Materials, Nature Nanotechnology, The Royal Society, The EU, the UK EPSRC, BBSRC and MRC, and the US National Science Foundation</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Director ","firm":{"name":"nanoTherics","permalink":"nanotherics","type_of_entity":"company","image":{"available_sizes":[[[150,37],"assets/images/resized/0004/5625/45625v1-max-150x150.png"],[[250,63],"assets/images/resized/0004/5625/45625v1-max-250x250.png"],[[250,63],"assets/images/resized/0004/5625/45625v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}