{"first_name":"Jonathan","last_name":"R. Wallace","permalink":"jonathan-r-wallace","crunchbase_url":"http://www.crunchbase.com/person/jonathan-r-wallace","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 05 11:22:53 UTC 2009","updated_at":"Fri Jun 05 11:25:10 UTC 2009","overview":"<p>Since co-founding WWC Capital Group in 1998, Jonathan has focused his efforts on business services and financial services where he has been responsible for guiding growth-stage companies. Jonathan represents WWC Capital on the Board of First Equity Card, Exmplar, and Double Positive. He has also been responsible for the firm’s highly successful Internet advertising investments that have included the WeatherBug and Advertising.com.</p>\n\n<p>Jonathan is widely regarded as an expert in designing capital structures for middle market companies with the objective of increasing flexibility and/or lowering financing costs in the capital structure. Companies use his capital structure advice to help them achieve vital strategic objectives such as: financing an acquisition, retirement of a shareholder equity position, or raising development capital. During his long career as an investment banker, Jonathan was responsible for the placement of over $3.5 billion of senior debt, subordinated debt, and equity. He has financed the capital needs of over 40 Fortune 500 companies.</p>\n\n<p>Jonathan also has extensive experience in a wide variety merger and acquisition situations. He has been involved with more than 30 mergers or acquisitions with values ranging from $5 million to $400 million. His extensive background in this area enables him to help companies plan exit and liquidity strategies and execute against those plans.</p>\n\n<p>Jonathan received his MBA with honors from the Darden School of Business and BS in Commerce from the University of Virginia&#8217;s McIntire School of Commerce. He serves on the board of directors of the Cure for Juvenile Diabetes and has been a past director on the Board of the WeatherBug. Jonathan lives in Reston, Virginia with his wife and two children.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0004/6910/46910v1-max-150x150.jpg"],[[125,175],"assets/images/resized/0004/6910/46910v1-max-250x250.jpg"],[[125,175],"assets/images/resized/0004/6910/46910v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"","institution":"Darden School of Business","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"WWC Capital Fund","permalink":"wwc-capital-fund","type_of_entity":"financial_org","image":{"available_sizes":[[[144,58],"assets/images/resized/0002/9738/29738v1-max-150x150.png"],[[144,58],"assets/images/resized/0002/9738/29738v1-max-250x250.png"],[[144,58],"assets/images/resized/0002/9738/29738v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}