{"first_name":"Jonathan","last_name":"Blank","permalink":"jonathan-blank-2","crunchbase_url":"http://www.crunchbase.com/person/jonathan-blank-2","homepage_url":"http://www.JonathanBlank.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Reading Kingdom","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jul 11 21:39:26 UTC 2012","updated_at":"Wed Jul 11 22:18:59 UTC 2012","overview":"<p>Jonathan Blank is the CEO of Reading Kingdom and an award-winning creative technologist, writer and filmmaker.</p>\n\n<p>Reading Kingdom: Jonathan is the CEO of Reading Kingdom (www.readingkingdom.com), a patented and revolutionary, research-based, adaptive online program that teaches children how to read and write. Jonathan developed the software in conjunction with his mother, Dr. Marion Blank, the Co-director of the Developmental Neuropsychiatry Program at Columbia University, who is one of the world’s top experts in reading and language as well as a recipient of the Upton Sinclair Award which honors individuals who have\nmade a significant contribution to education.</p>\n\n<p>Creative Technologist: Jonathan founded Wildform (www.wildform.com), an award-winning video technology company that created Flix, the first Flash video encoding software which revolutionized the web video landscape.\nJonathan sold the Flix product line to On2 Technologies which was acquired by Google. Jonathan also licensed Wildform technology to leading companies such as Adobe, Sony, Quark, and Autodesk. Before Wildform, Jonathan started one of the first music streaming websites on the Internet, which he sold to a group of investors. He was also a pioneer in putting multimedia projects on the Internet, including the first movie site on the Web.</p>\n\n<p>Writer: Jonathan&#8217;s writing interests include dramatic storytelling in screenplays and stage plays, non-fiction books and articles as well as fiction. He has written numerous screenplays including those for his own films. Jonathan has spent over 25 years studying high-level martial arts, meditation, Eastern philosophy and esoteric metaphysical practices with many remarkable teachers\nin the US, Asia and Europe and this has led him to write extensively on these subjects. He is the co-author, with one of his teachers, of Secrets of Dragon Gate: Ancient Taoist Practices for Health, Wealth and the Art of Sexual Yoga, published by Tarcher/Penguin, the premier publisher of mind, body, and spirit titles, that lucidly details the history, philosophy and core practices of the 800 year old Dragon\nGate Taoist tradition. He is also the co-author of Still as a Mountain, Powerful as Thunder (Shambhala Publications) about Buddhist chi gung and meditation which Jonathan wrote with another of his teachers. Jonathan is also working\non a play about Abraham Lincoln.</p>\n\n<p>Filmmaker: Jonathan has written, produced and directed\na number of award-winning and critically acclaimed films\nincluding Sex, Drugs &amp; Democracy (&#8220;A seductive argument&#8221;\n&#8211;Roger Ebert), Anarchy TV (&#8220;A wild, crazy and twisted comedy!&#8221; &#8211;Jan Wahl of KRON-TV), and Collecting America (&#8220;Fascinating…3 ½ stars&#8221; &#8211;Joseph Gelmis, New York Newsday) and the short film, Karma Express. (All of these films are available through Amazon.)</p>\n\n<p>Jonathan has a BA and an MFA from Columbia University in New York.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0020/0310/200310v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0020/0310/200310v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0020/0310/200310v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"","institution":"Columbia University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MFA","subject":"","institution":"Columbia University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Reading Kingdom","permalink":"reading-kingdom","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.ReadingKingdom.com","title":"Reading Kingdom"},{"external_url":"http://www.JonathanBlank.com","title":"Personal page"},{"external_url":"http://jonathanblank.com/Jonathan-Blank-Reviews.pdf","title":"Reviews"}]}