{"first_name":"Jonathan","last_name":"Present","permalink":"jonathan-present","crunchbase_url":"http://www.crunchbase.com/person/jonathan-present","homepage_url":"http://Voxalot.com","birthplace":"Grosse Pointe Farms, Michigan","twitter_username":"jpresent","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1972,"born_month":8,"born_day":11,"tag_list":"sales, business-development, strategic-alliances, channels","alias_list":null,"created_at":"Thu Sep 27 09:36:09 UTC 2012","updated_at":"Mon Oct 15 16:50:43 UTC 2012","overview":"<p>International Startup Sales/Business Development veteran</p>\n\n<p>Jonathan&#8217;s experience includes direct sales, selling through various types of channel organizations worldwide, and building Sales teams from the inception point outward. Jon has a documented record of quota attainment, a comprehensive understanding of the sales process, expertise in the development of account strategies, exceptional telephone, interpersonal and presentation skills, as well as a demonstrated ability to identify strategic business opportunities, and build profitable, long term relationships with senior-level executives and colleagues in order to create new products or lines of business, increase sales of existing products, and improve competitive positioning. </p>\n\n<p>His skills in Business Development encompass performing competitive analysis, creating strategic relationships and directing new business services that complement existing offerings, in addition to driving the negotiation process; developing best practices for alliance execution; and providing input into product development in order to incorporate customer needs and expectations.</p>\n\n<p>He excels in building relationships that result in recurring revenue and providing thought leadership to others in the company. Former Executive at Cisco Systems, and a number of worldwide Startups.</p>","image":{"available_sizes":[[[103,150],"assets/images/resized/0021/3295/213295v2-max-150x150.jpg"],[[173,250],"assets/images/resized/0021/3295/213295v2-max-250x250.jpg"],[[228,329],"assets/images/resized/0021/3295/213295v2-max-450x450.jpg"]],"attribution":"<p>Voxalot</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}