{"first_name":"Jonathan","last_name":"Sheena","permalink":"jonathan-sheena","crunchbase_url":"http://www.crunchbase.com/person/jonathan-sheena","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jun 20 09:15:03 UTC 2009","updated_at":"Sat Jun 20 09:15:45 UTC 2009","overview":"<p>Mr. Sheena is company co-founder and an experienced entrepreneur with proven success in technology innovation. Before co-founding GSN, Mr. Sheena founded PocketThis which has offices in the UK and the US and sells cutting edge server technology to mobile networks worldwide. Mr. Sheena&#8217;s background is in personalization technology. While a graduate student at MIT, and in partnership with the Associated Press, Reuters, Knight Ridder, ABC, and the New York Times, he built the first web based personalized newspaper called &#8220;Fishwrap&#8221;. The technology was licensed by and deployed to newspapers worldwide, most notably the San Francisco Chronicle. After MIT, Mr. Sheena worked as a lead architect at Firefly, a pioneering company in online community, personalization and collaborative filtering. Firefly was purchased by Microsoft, where Mr. Sheena then worked to bring online the largest running personalization and online identity system used by tens of millions of people around the globe. He holds both M.S. and B.S. degrees from MIT as well as a number of patents in internet and mobile technology.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CTO","firm":{"name":"Gene Security Network","permalink":"gene-security-network","type_of_entity":"company","image":{"available_sizes":[[[150,77],"assets/images/resized/0004/9843/49843v1-max-150x150.jpg"],[[212,109],"assets/images/resized/0004/9843/49843v1-max-250x250.jpg"],[[212,109],"assets/images/resized/0004/9843/49843v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}