{"first_name":"Jonathon","last_name":"Nevett","permalink":"jonathon-nevett","crunchbase_url":"http://www.crunchbase.com/person/jonathon-nevett","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Donuts","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 05 21:47:18 UTC 2012","updated_at":"Sat Jun 09 10:32:34 UTC 2012","overview":"<p>Jon Nevett, Co-Founder and Executive Vice President, Corporate Affairs</p>\n\n<p>Jon Nevett is widely respected as a contributor to domain name business development and policy.  He recently served as President of Domain Dimensions, LLC, consulting on various domain name issues.  Previously, Jon served as Senior Vice President at Network Solutions, where he was Network Solutions’ primary point of contact with ICANN, the U.S. Congress, the Department of Commerce, other federal agencies, and domain name registries.  He also served as Chairman of the Board of NameJet, Network Solutions’ joint venture with eNom, providing domain auction and listing services in the secondary market.  He also was Chairman of Central Registry Solutions, Network Solutions’ joint venture to provide registry services related to the introduction of new top-level domains.  </p>\n\n<p>Jon served on ICANN’s Implementation Recommendation Team (IRT) and the Special Trademark Issue team (STI) advising ICANN on how to protect trademarks in new top-level domains.  From 2006-09, Jon served as the elected Chair of the ICANN Registrar Stakeholder Group and co-chaired the U.S. Council for International Business’ Domain Name System Working Group.  In 2009, Jon was appointed to the U.S. Department of Commerce’s Online Safety and Technology Working Group related to issues of child safety and the Web. </p>\n\n<p>Prior to joining Network Solutions, Jon spent more than seven years with the MCI Legal Department and more than three years at the law firm of Kirkland and Ellis.  Jon received his Juris Doctor cum laude from Harvard Law School and his undergraduate degree with honors from Binghamton University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-founder & EVP","firm":{"name":"Donuts","permalink":"donuts","type_of_entity":"company","image":{"available_sizes":[[[150,38],"assets/images/resized/0019/4113/194113v1-max-150x150.png"],[[193,50],"assets/images/resized/0019/4113/194113v1-max-250x250.png"],[[193,50],"assets/images/resized/0019/4113/194113v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}