{"first_name":"Jonathan","last_name":"Gordon","permalink":"jonathan-gordon","crunchbase_url":"http://www.crunchbase.com/person/jonathan-gordon","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 23 00:50:17 UTC 2009","updated_at":"Tue Jun 23 00:52:30 UTC 2009","overview":"<p>Jonathan Gordon has been a successful executive, entrepreneur and investor for over 30 years. He has been at the forefront of many historic market and technology changes in the high tech global economy. </p>\n\n<p>Mr. Gordon is the founder of Ametron Technologies, Inc., a consulting and licensing firm that helps entrepreneurs and technologists with business development and monetizing their Intellectual Property and inventions. Recent clients have included Picassa/Lifescape (sold to Google), a photo management tool; Corestreet, a provider of security software; Liquid Machines,a provider of enterprise rights management technology and solutions and Bitzmart/ Stealth Media Labs, a technology used to embed information into digital audio and video streams with playback through Windows Media Player 9 Series. </p>\n\n<p>Before Ametron, Mr. Gordon was CEO of mGen, Inc., an e-learning enterprise software company, which was focused on 1st Responder market opportunities within DOD and other government agencies, such as the Navy/Marine Intranet, US Dept. of Agriculture and the US Army.</p>\n\n<p>Prior to that, he was CEO and founder of EndPoints, Inc.(sold to Flextronics and Archi-tech, Taiwan) , a fabless semiconductor company, whose imaging chips powered high volume, low cost consumer digital cameras. Preceding EndPoints, Mr. Gordon was President of DiagSoft (sold to Sykes Enterprises), a PC hardware diagnostic and manufacturing test company.</p>\n\n<p>Subsequent to EndPoints, Mr. Gordon was the founder of Phoenix Publishing (sold to Softbank). Mr. Gordon was also President of Paterson Labs, which he sold to Phoenix Technologies Inc. for Paterson’ s founder, Tim Paterson (the author of the MS-DOS operating system).</p>\n\n<p>Mr. Gordon has built international sales and marketing organizations for several notable companies like Phoenix Technologies, who he assisted in their IPO as their first VP of Sales. Additionally, he was VP of Sales of Graphic Software Systems, an early PC software pioneer who had graphic software on the original IBM XT and AT.</p>\n\n<p>Jonathan’s early sales and marketing career included Physical Data Inc. (sold to Honeywell), a start up instrumentation company, who made digital waveform recorders for use in fusion reactor and munitions testing. He also was a sales engineer with Tektronix and helped introduce the first low cost graphic terminals for mini and mainframe computing.</p>\n\n<p>Mr. Gordon attended the University of Wisconsin and Penn Morton College.</p>","image":{"available_sizes":[[[105,100],"assets/images/resized/0005/0220/50220v1-max-150x150.jpg"],[[105,100],"assets/images/resized/0005/0220/50220v1-max-250x250.jpg"],[[105,100],"assets/images/resized/0005/0220/50220v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Stage 1 Ventures","permalink":"stage-1-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,38],"assets/images/resized/0005/0218/50218v1-max-150x150.jpg"],[[213,54],"assets/images/resized/0005/0218/50218v1-max-250x250.jpg"],[[213,54],"assets/images/resized/0005/0218/50218v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}