{"first_name":"Jonathan","last_name":"Christensen","permalink":"jonathan-christensen","crunchbase_url":"http://www.crunchbase.com/person/jonathan-christensen","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Mar 03 17:49:16 UTC 2009","updated_at":"Mon Mar 19 22:12:00 UTC 2012","overview":"<p>Jonathan Christensen has more than 15 years of experience shaping strategy for the growth of IP communications in start-ups and world class organizations such as Skype, Microsoft, and Time Warner.</p>\n\n<p>In 2005, Jonathan co-founded Camino Networks where he was CEO until it was acquired by Skype. He is currently a senior member of the Skype team leading core technology development for audio and video, as well as initiatives for voice quality, network interconnect, and business adoption.</p>\n\n<p>Prior to Skype/Camino, Jonathan was CTO and VP of products at FaceTime Communications, where he led the company&#8217;s product strategy in a shift from call center applications to real time communications security solutions.</p>\n\n<p>At Microsoft, Jonathan lead program management for the company’s Real-Time Communications group and delivered the first generation of its SIP based products (aka Live Communications Server). Christensen also held group manager roles in the Network Solutions Groups and MSN Voice Services groups where he was responsible for business and product development.</p>\n\n<p>Prior to joining Microsoft Corporation, Jonathan held management positions at Time Warner, pioneering commercial Internet services including access, hosting, and Web design. While at Time Warner, he was instrumental in bringing to market the first generation of consumer broadband services.</p>\n\n<p>Jonathan has a Master of Business Administration from the University of Hawaii at Manoa and a Bachelor of Arts in Law and Society from the University of California at Santa Barbara.</p>","image":{"available_sizes":[[[80,100],"assets/images/resized/0003/7280/37280v1-max-150x150.png"],[[80,100],"assets/images/resized/0003/7280/37280v1-max-250x250.png"],[[80,100],"assets/images/resized/0003/7280/37280v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"VP & General Manager, Platform","firm":{"name":"Skype","permalink":"skype","type_of_entity":"company","image":{"available_sizes":[[[150,66],"assets/images/resized/0000/1387/1387v12-max-150x150.jpg"],[[250,110],"assets/images/resized/0000/1387/1387v12-max-250x250.jpg"],[[315,139],"assets/images/resized/0000/1387/1387v12-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}