{"first_name":"Joon","last_name":"Shin","permalink":"joon-shin","crunchbase_url":"http://www.crunchbase.com/person/joon-shin","homepage_url":"http://www.ipnetzone.com","birthplace":"","twitter_username":"joonshin","blog_url":"","blog_feed_url":"","affiliation_name":"IPNETZONE COMMUNICATIONS INC.","born_year":null,"born_month":null,"born_day":null,"tag_list":"joon-shin, strategy-development, executive-management, business-development, consulting, continuous-quality-improvement, employee-training, new-product-introductions, operational-excellence, technology-management, business-transformation, lean-six-sigma","alias_list":null,"created_at":"Fri Jun 11 03:38:17 UTC 2010","updated_at":"Fri Sep 17 15:57:10 UTC 2010","overview":"<p>Mr. Shin possesses continuous intellectual curiosity in the intersections of business and technology and over thirteen years of well-rounded and seasoned leadership of complex initiatives working with many diverse teams across several industries. He is currently the President and CEO for IPNETZONE COMMUNICATIONS INC., a global network provider, and has held senior leadership positions that demand: program management, business transformation, product development, business development, strategic positioning and technology management. Beyond his skills in adapting to changing environments, Mr. Shin has proven to be a strong team builder, which includes years of mentoring, conflict resolutions, training and coaching of his staff and peers to transfer his knowledge of best practices and his fervent focus on the customer and the company’s return on investment. His success is largely driven from his passion in understanding internal and external customers’ points of view, lines of businesses, and requirements in support of their goals and needs, which has resulted in millions of dollars of year-over-year realizations of benefits from business and technological innovations. Between his business savvy, operations experience, ability to bridge those needs to technological capabilities, and, as evidenced in his accomplishments, Mr. Shin is consistently well positioned to offer timely and relevant solutions for competitive advantages, regardless of industry or corporate culture. Mr. Shin completed the Executive Master&#8217;s in Technology Management program from Wharton School of Business and Penn Engineering at the University of Pennsylvania and received his Bachelors of Science in Mechanical Engineering from Lehigh University. </p>","image":null,"degrees":[{"degree_type":"Masters","subject":"Technology Management","institution":"University of Pennsylvania (Wharton School of Business & Penn Engineering)","graduated_year":2006,"graduated_month":null,"graduated_day":null},{"degree_type":"Bachelors","subject":"Mechanical Engineering","institution":"Lehigh University","graduated_year":1997,"graduated_month":null,"graduated_day":null},{"degree_type":"Diploma","subject":"","institution":"Valley Forge Military Academy","graduated_year":1993,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President & CEO","firm":{"name":"IPNETZONE COMMUNICATIONS INC.","permalink":"ipnetzone-communications-inc","type_of_entity":"company","image":{"available_sizes":[[[150,31],"assets/images/resized/0010/1760/101760v2-max-150x150.png"],[[250,51],"assets/images/resized/0010/1760/101760v2-max-250x250.png"],[[450,93],"assets/images/resized/0010/1760/101760v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.reuters.com/article/idUS218478+26-Aug-2009+PRN20090826","title":"IPNETZONE Names Joon Shin President & Chief Executive Officer"}],"web_presences":[{"external_url":"http://www.linkedin.com/in/joonshin","title":"Joon's LinkedIn Profile"},{"external_url":"http://twitter.com/joonshin","title":"Joon's Twitter Profile"}]}