{"first_name":"Jordan","last_name":"Birnbaum","permalink":"jordan-birnbaum","crunchbase_url":"http://www.crunchbase.com/person/jordan-birnbaum","homepage_url":"http://www.jordanbirnbaum.net","birthplace":"Long Island, NY","twitter_username":"JordanBirnbaum","blog_url":"","blog_feed_url":"","affiliation_name":"Juno Online Services","born_year":1971,"born_month":4,"born_day":5,"tag_list":"jordan-birnbaum-juno, jordan-birnbaum-vanguard, richard-belzer, juno-online-services, comedy, entertainment","alias_list":null,"created_at":"Sun Oct 21 14:12:57 UTC 2012","updated_at":"Sat Nov 03 22:30:04 UTC 2012","overview":"<p>The person behind the media and entertainment mogul Jordan Birnbaum</p>\n\n<p>Jordan Birnbaum is a comical and captivating guy. Born in the early seventies; he grew up in Great Neck, NY and ultimately launched his professional career in the nineties during dot com boom. Jordan Birnbaum loves animals, comedy and writing and is devoted to his young niece and nephew. He loves entertaining and multi-media and also thoroughly relishes taking the opportunity to point out the absurdity of nonsensical political notions. Being flung head first into commercial success at a young age, Jordan Birnbaum has learned to maintain a sense of humor during good times and bad, which has proven an invaluable tool in navigating the the entrepreneurial waters of his career. </p>\n\n<p>Educating Jordan Birnbaum</p>\n\n<p>Jordan Birnbaum finished school and went on to Cornell University where he concentrated on consumer economics and housing while completing his Bachelor of Science degree in Policy Analysis. At Cornell University, where he was on the Dean’s list and produced an independent study with Prof. Dean Lillard, Jordan Birnbaum spent a semester in field study with the American Red Cross. He was part of developing and implementing a Homelessness Intervention and Prevention program during this time.</p>\n\n<p>Early career</p>\n\n<p>After university, Jordan Birnbaum joined an investment bank to gain professional experience. At D.E. Shaw &amp; Co. Jordan made quite an impact and was given the due responsibility of managing a substantial portfolio and eventually playing a pivotal role in the live trading of the business in the Japanese Stock Exchange. D.E. Shaw &amp; Co. provided Jordan Birnbaum with a chance to expand his talents and an opportunity to realise an inkling of his true range of capabilities.</p>\n\n<p>Jordan Birnbaum enters the online arena</p>\n\n<p>After demonstrating his abilities in the financial arena, Jordan started working in the emerging Internet market, helping to launch Juno Online Services, Inc.  Jordan Birnbaum transformed the online services industry when he hatched an innovative idea to boost subscriptions by means of an in-store distribution deal with the video and music conglomerate Blockbuster. This was a stepping stone to a number of very successful years at Juno where Jordan continued working until investing in Qtopia; a failing business that Jordan Birnbaum transformed into being a prime venue in the entertainment industry in Los Angeles until today.</p>\n\n<p>What is Jordan Birnbaum currently busy with?</p>\n\n<p>Always on trend with technological advancements and turning modernization to his advantage, Jordan Birnbaum is embracing the latest and greatest online tools for the marketing and delivery of his visionary new project. Social media will be his broadcasting tool and online podcasts his method of delivery. Scheduling the launch of the exciting project flanking the US presidential elections, Jordan and his co-conspirator Richard Belzer are sure to beguile fans globally. Richard Belzer, known for his role as Detective Munch in Law &amp; Order SVU and superlative humour met Jordan Birnbaum in Los Angeles at Vanguard. The two discovered a shared affinity with political satire while working together on a comedy production. </p>","image":null,"degrees":[{"degree_type":"BS","subject":"Policy Analysis with a concentration in Consumer Economics and Housing","institution":"Cornell University","graduated_year":1993,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Co-Founder","firm":{"name":"The Secret Beatnik Party","permalink":"the-secret-beatnik-party","type_of_entity":"company","image":null}},{"is_past":true,"title":"Senior Vice President","firm":{"name":"Juno Online Services","permalink":"juno-online-services","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://articles.latimes.com/2005/aug/04/news/wk-night4","title":"http://articles.latimes.com/2005/aug/04/news/wk-night4"},{"external_url":"http://www.siliconinvestor.com/readmsg.aspx?msgid=11049688","title":"Trans World Entertainment and Juno Sign Exclusive Music Retailer Agreement"},{"external_url":"http://mixonline.com/mag/audio_vanguard/","title":"Club Profile: Vanguard"}],"web_presences":[{"external_url":"http://www.jordanbirnbaumjuno.com","title":"Jordan Birnbaum - Juno Career"},{"external_url":"http://www.jordanbirnbaum.org","title":"Jordan Birnbaum - Wiki Page"},{"external_url":"https://sites.google.com/site/jordanbirnbaumjuno/","title":"Jordan Birnbaum on Google Sites"}]}