{"first_name":"Jordan","last_name":"Combe","permalink":"jordan-combe","crunchbase_url":"http://www.crunchbase.com/person/jordan-combe","homepage_url":"http://www.jordancombe.co.uk/","birthplace":"South East England","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"jordan-combe, london, management-consulting, investment-venture, entrepreneurship, combe-jordan","alias_list":null,"created_at":"Sat Nov 03 15:39:23 UTC 2012","updated_at":"Sun Nov 04 00:58:24 UTC 2012","overview":"<p>Jordan Combe is a man of family, a lover of Mexican food, a dog enthusiast and a skilled business strategist. His passion is unchanged from field to field and he channels all of his energy into whatever pursuit he puts his mind to, be it raising his 12 and 16 years old children or making piles of money for small and medium sized businesses. Known in London pubs as the miracle worker, Jordan Combe is savvy at saving businesses from bankruptcy and financial strife by using one simple tool: strategy. </p>\n\n<p>A miracle worker in the making</p>\n\n<p>Jordan Combe moved from Dover to London in the 1980s to pursue undergraduate studies in accounting. His first job out in the field was at a young, but already highly successful, company where he served as a clerk in the accounting department. As a bright and talented young financial whiz, Jordan Combe worked his way up the corporate ladder over the course of the next decade. He did not stay at one company, however, but instead moved around as he moved up. By the end of a decade, his role reported directly to the Chief Financial Officer of an engineering company in the city. One of the great advantages of moving around to different companies is truly learning the ins and outs of the business world on the strategic level. At each company, he was able to examine and analyze their business practices and, it turns out, his mind was tabbing information for later use as a consultant.</p>\n\n<p>Heading off on his own</p>\n\n<p>Having established an impressive network with many valuable contacts, Jordan Combe decided that he was ready to head off on his own and begin the consulting phase of his career. Towards the end of his time as a salaried employee, he had made a number of investments in small start ups. A few of these proved to be very lucrative, which provided him with the capital to start his own project. Jordan Combe’s main interests lie in strategic planning and lean management. He identified that many companies could avoid bankruptcy or fiscal crisis if they just simply adjusted their business practices and reorganized their strategy. Re-thinking such corporate decisions as outsourcing or cutting costs, while also identifying ways in which companies need to maximize, Jordan Combe consulted a plethora of businesses from trouble zone back to competitive on the market.</p>\n\n<p>Investing with a conscience</p>\n\n<p>Another interest that Jordan Combe developed through his years in the accounting world was micro finance. Through his consulting work, he noticed that businesses often needed to be frugal while also coming up with innovative new ways for raising capital. In light of banks’ hesitation to invest, Jordan Combe came up with a new idea to re-brand himself as a micro venture capitalist. This would effectively position him as a truly unique service for small and medium sized business. He could provide consulting to strategize for success while also providing the loan investment that companies were desperately in need of. The combination proved to be a success as well as fulfilling. </p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0021/8632/218632v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0021/8632/218632v2-max-250x250.jpg"],[[187,281],"assets/images/resized/0021/8632/218632v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.jordancombe.net","title":"Jordan Combe bio page"},{"external_url":"http://www.jordancombe.org","title":"Who is Jordan Combe"},{"external_url":"http://jordancombe.gather.com/","title":"Jordan Combe on Gather"},{"external_url":"http://www.visualcv.com/jordancombe","title":"Jordan Combe's resume"}],"web_presences":[]}