{"first_name":"Jordan","last_name":"Madewell","permalink":"jordan-madewell","crunchbase_url":"http://www.crunchbase.com/person/jordan-madewell","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Dec 23 21:54:01 UTC 2011","updated_at":"Sat Dec 24 05:07:46 UTC 2011","overview":"<p>Jordan Madewell is a connector.  His day to day trade is the insurance industry where he connects customers with the right insurance companies, and is involved with other strategic relationships that allow him to connect inventors or small start-ups with patent experts and investors for fund different projects and opportunities.  He owns an independent insurance agency in Lubbock, Texas and an agency in Ruidoso, New Mexico, and has been a co-host of the 950am Radio program &#8220;The Money Talk Show&#8221; with Michael Jon Byers over the past 3-4 years in Lubbock.  </p>\n\n<p>Jordan is also affiliated with the Dave Ramsey Show as a Trusted Adviser in the Endorsed Local Provider Program.</p>\n\n<p>Jordan&#8217;s other areas of connectivity have allowed him to work on brokering different business deals in the areas of Precious Metals, Commodities, Energy, and Security among others. His experience in Start-ups include a lighting company, property management firm, insurance agencies, and real estate development.</p>\n\n<p>Jordan is also a Christian and enjoys spending time with his wife and daughter.  He is a coordinator of the Texas Student Leadership Forum on Faith &amp; Values in Austin, Texas that engages university student leaders to follow the leadership tenets of Jesus of Nazareth which are Purpose, Vision, Service, Commitment, and Forgiveness/Reconciliation.  He also serves on the board of trustees for Camp Blue Haven, a non-profit Christian Summer Camp, The Bridge of Lubbock, a non-profit that helps at-risk kids.  </p>","image":null,"degrees":[{"degree_type":"Business Administration","subject":"","institution":"Lubbock Christian University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}