{"first_name":"Jordan","last_name":"Baltimore","permalink":"jordan-baltimore","crunchbase_url":"http://www.crunchbase.com/person/jordan-baltimore","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Apr 23 18:47:22 UTC 2009","updated_at":"Fri Apr 24 16:20:41 UTC 2009","overview":"<p>Before graduating from New York University&#8217;s Stern School of Business, Jordan Scott Baltimore had already launched and sold his first venture, an IT Services firm that worked with some of New York&#8217;s leading retailers. Having sold that business in 1996, Jordan went on to grow a single-site computer store into one of the country&#8217;s Top 100 CE Retailers, with sales of over $5 million from a 700 square foot location.</p>\n\n<p>Jordan then earned his MBA from Duke University&#8217;s Fuqua School of Business at the age of 25, while working as a Strategy &amp; Marketing teaching and research assistant and also working nearly full-time hours at Circuit City in Durham, North Carolina, where the idea for Oyster Digital Media was born. Jordan was also an early member of the strategic marketing team at Viacore, a high tech supply chain startup in Southern California that was eventually sold to IBM.</p>\n\n<p>Jordan joined Goldman Sachs in 2001 before leaving that firm to become a founding member of Empirical Research Partners, an equity research boutique. Returning to industry, Jordan became COO of a regional building materials distribution firm that tripled in size under his direction. He left after three years to launch Ocean Supply, an international distribution and development company based in New Jersey and in the Turks &amp; Caicos Islands.</p>\n\n<p>In 2007, Jordan brought together nearly 20 years of experience in marketing, retail, technology, operations and finance to launch Oyster Digital Media with a team of leading executives from retail, technology &amp; media.</p>\n\n<p>In his &#8220;spare&#8221; time, Jordan is the Director of Baseball Operations at Frozen Ropes, responsible for launching and managing the organization&#8217;s Youth Developmental and Travel Baseball program in New York City. He specializes in instructing and coaching ballplayers of ages 5-11, and also continues to play Shortstop and Center Field at every opportunity. Jordan and his wife live in Manhattan and enjoy playing bocce in Central Park and golfing together. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Oyster Digital Media","permalink":"oyster-digital-media","type_of_entity":"company","image":{"available_sizes":[[[150,77],"assets/images/resized/0004/2517/42517v1-max-150x150.jpg"],[[250,128],"assets/images/resized/0004/2517/42517v1-max-250x250.jpg"],[[254,131],"assets/images/resized/0004/2517/42517v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}