{"first_name":"Jorge","last_name":"Gomez","permalink":"jorge-gomez","crunchbase_url":"http://www.crunchbase.com/person/jorge-gomez","homepage_url":"htt://www.jorelyskincare.com","birthplace":"Orlando, FL","twitter_username":"","blog_url":"http://jorelyskincare.wordpress.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"jorely, advanced-skin-care-products, skin-care-products-online, skin-care, wrinkle-creams, anti-aging-skin-care, beauty-products, body, body-product, face, exfoliants, scrubs, toners, cleansers, skin-care-reviews","alias_list":null,"created_at":"Sun May 02 20:05:37 UTC 2010","updated_at":"Mon May 03 19:49:41 UTC 2010","overview":"<p>Our company was founded with the concept of providing our customers the highest quality and most effective skin care products at the best possible price.  Jorelyskincare.com is a collection of products that are formulated to address everyday needs with minimal time and costs. </p>\n\n<p>We have been in business since 2006 and have thousands of satisfied customers.  Since we pride ourselves in providing highly effective products and personal customer service, most customers are repeat customers.  We provide our customers with an effective way to shop and teach our customers the proper use skin care products in order to achieve the best results.</p>\n\n<p>We carry an extensive line of products for your skin care regimen.  Our cleansers, toners, exfoliants, masks and treatments for all areas of the face and body are your best tools to achieve radiant skin.</p>\n\n<p>For this, we have and will continue to work and create, day by day, products that will enrich your skin. At Jorelyskincare.com you will find products formulated for every type of skin. Jorelyskincare.com offers you the finest top quality skin care products. Our botanical blends allow you to achieve a younger, firmer and healthier looking complexion. You can always rely on Jorelyskincare.com to provide the best products for all your skin care needs.</p>","image":{"available_sizes":[[[150,93],"assets/images/resized/0008/5679/85679v2-max-150x150.jpg"],[[250,156],"assets/images/resized/0008/5679/85679v2-max-250x250.jpg"],[[450,281],"assets/images/resized/0008/5679/85679v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}