{"first_name":"Jose Pablo","last_name":"Rivera","permalink":"jose-pablo-rivera","crunchbase_url":"http://www.crunchbase.com/person/jose-pablo-rivera","homepage_url":"","birthplace":"","twitter_username":"JPFUTBOLITO","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1985,"born_month":4,"born_day":3,"tag_list":"","alias_list":null,"created_at":"Mon Nov 08 07:26:20 UTC 2010","updated_at":"Fri Nov 12 03:31:20 UTC 2010","overview":"<p>Pablo Rivera, A highly motivated Individual with Mobile advertising experience and a self starter.  Pablo entered the Mobile Advertising World when Joining 4INFO in Feb 2008.  4INFO is a large independent mobile media company in the US: managing mobile media, marketing, and advertising to tens of millions of users.</p>\n\n<p>One of Pablo&#8217;s first contribution to 4INFO was Introducing for the first time Mobile Spanish language services to the company&#8217;s SMS publishing network.  This was the foundation for enabling 4INFO to connect with Spanish-speaking users and advertisers. Pablo also managed the delivery of all these Spanish messages and ads via 4INFO&#8217;s publishing and ad serving platforms.</p>\n\n<p>Currently Pablo is 4INFO&#8217;s Campaign Manager where he helps Publishing Partners to drive sales and implement solutions for their advertising campaigns.\nAccount manage and Traffic all advertising campaigns from signature to set up for 4INFO’s partners sales and branded advertisers.</p>\n\n<p>Prior to joining 4INFO, Pablo studied at Notre Dame de Namur University in Belmont CA where he received his BS in Business Administrations with a focus in International Business and a Minor in Spanish.  He also played for the University soccer team, this is where part of his leadership, discipline and self-starter mind evolved from.</p>","image":null,"degrees":[{"degree_type":"B.S. Business Administrations","subject":"Business, International Business, Latin Studies","institution":"Notre Dame de Namur University","graduated_year":2008,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}