{"first_name":"Jose","last_name":"Gonzalez","permalink":"jose-gonzalez-3","crunchbase_url":"http://www.crunchbase.com/person/jose-gonzalez-3","homepage_url":"http://www.easyclocking.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Nov 29 19:10:47 UTC 2012","updated_at":"Wed Dec 05 07:48:30 UTC 2012","overview":"<p>Easy Clocking® is a leading edge manufacturer of high quality Time &amp; Attendance Management Systems, Software and Services. Our 7 years of experience has labeled Easy Clocking as a reliable name in the time &amp; attendance sector. Our global presence has reached over 30 countries. Our name is trusted in over 30,000 time &amp; attendance systems installed in the world today, to a variety of markets including government agencies, law enforcement, financial services, healthcare, education, commercial enterprises, industrial, construction, hospitality and the retail industry.</p>\n\n<p>Our research &amp; development team at Easy Clocking® is at all times concentrating on improving our existing solutions and innovating new ones. With over 7 years experience and consolidated workforce management skills, we respond rapidly to your needs, no matter how complex they are. Matched by business-focused, technical support, our response to your objectives has led to the highest levels of customer satisfaction in the industry. At the heart of the company is a team of skilled product developers, programmers and technical support staff. Along with sales, marketing and administration staff, they are committed to providing our customers with an unrivaled expertise, service and support.</p>\n\n<p>Our state of the art fingerprint sensor has been developed and perfected over the last 7 years using our new generation fingerprint algorithm. Our unique function recreates a template to heal broken fingerprint lines allowing the sensor to update the best image for the user every scan, making it possible to verify fingerprints quickly and more accurately. Over the years we have acquired numerous intellectual property rights and patents. All of our products have been awarded CE, UL and FCC certifications ensuring our clients the highest level of quality in the industry.</p>","image":{"available_sizes":[[[150,105],"assets/images/resized/0022/3057/223057v2-max-150x150.jpg"],[[250,175],"assets/images/resized/0022/3057/223057v2-max-250x250.jpg"],[[450,315],"assets/images/resized/0022/3057/223057v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}