{"first_name":"Jose Carlos","last_name":"O'Reilly Torres","permalink":"jose-carlos-oreilly-torres","crunchbase_url":"http://www.crunchbase.com/person/jose-carlos-oreilly-torres","homepage_url":"","birthplace":"Brazil","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Feb 28 16:59:33 UTC 2012","updated_at":"Sun Mar 04 23:01:52 UTC 2012","overview":"<p>He is the new CFO at larala.com. Carlos has a great background and experience and now he join larala.com because he believes that it could be the new internet worldwide success</p>\n\n<p>Some of his background\n• Head of Macro-Economic Analyzes Department and responsible for the creation of the sales division at BBI – Banco Bradesco de Investimentos ;\n• Experience developed as Banco Bradesco de Investimentos as chief manager in issuing securities at the local and international market for the biggest Brazilian companies, deeply knowledge from the legal steps to reach US and European securities market;  \n• Associate Partner at a Consultancy company for projects of M&amp;A, financial restructuring and IPO’s.\nAccomplishments:\n• Participation in the process of privatization of CVRD as Bradesco’s team leader, together with the North American broker Merrill Lynch, both contracted banks for BNDES (Brazilian Developing Bank) to coordinate the process of public offering for the company’s shares;\n• Relationship with the largest Brazilian business leaderships and technical knowledge of the dynamic sectors of the Brazilian economy;\n• He have prepared and presented the winning proposal to generate a Telecom company with GasPetro assets, a US$ 500 million project for this start up company, for the local Petroleum company – Petrobras and its subsidiary - GasPetro;\n• Starting from the year of 1997, I had as a main function to be the main articulator for the contacts from Bradesco with international Financial institutions as: Lehman Brothers, Merrill Lynch, J.P.Morgan, to access the global securities markets in joint operations, in order to allow local issuers options of international funding at a lower cost, visited the main Investment banks in New York;\n• As result they had the following operations: ADR-I with the Banco Lehman Brothers for BomPreço (Supermarket chain from Northeast of Brazil), Latasa’s IPO also through the ADR level I, secondary offering to Ericsson’s shares together with Salomon Brothers, road-show for&#8221; Qualified Investors&#8221; in the United States.  He also has participated actively in the elaboration of the ADR-III of OPP with Merrill Lynch and many others;\n• He has accompanied the whole distribution, local and international, and the road shows from those deals above, participating as Global Manager.\n• Followed the evolution of the capital market products in order to support Bradesco’s customers and promoting cross-selling business for the Commercial Bank;\n• Participation in several researches developed by the National Confederation of the Industry (Europe Division), in order to propose improvements in the Brazilian foreign trade.</p>\n\n<p>Professional:\n• Meta Asset Management – Partner 2011\n• MJ Partners. Partner - Projects of financial restructuring.  2002;\n• Banco Bradesco. Department of Stock market. Departmental Manager 1990-2000;\n• Banco Bradesco. Bradesco CTVM S.A.. Stock Exchange Broker 1986-1990;\n• National confederation of the Industry. 01/1980 to 04/1983. Foreign Trade Department.\nBrazil, March of 2012.</p>","image":null,"degrees":[{"degree_type":"eMBA","subject":"","institution":"Trium","graduated_year":2004,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}