{"first_name":"Jose","last_name":"Caballer","permalink":"jose-caballer","crunchbase_url":"http://www.crunchbase.com/person/jose-caballer","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Nov 24 21:51:27 UTC 2008","updated_at":"Fri Oct 05 06:51:12 UTC 2012","overview":"<p>Jose Caballer is the Chief Education Officer at The Skool, an online education movement that aims to teach the standard systems for building successful online businesses. He is the product of a mother who was a teacher and a father who was a preacher mixed in with a graphic design education at Art Center College of Design.</p>\n\n<p>He took a front row seat in the .COM boom working at Razorfish, one of the first digital agencies where he went from designer to Design Director of the Los Angeles office by the tender age of 28. In 2001, he left Razorfish to start The Groop - a boutique digital agency that allowed him to work with Al Gore, Jamie Oliver, Thomas Keller of The French Laundry, Alice Waters of Chez Panisse/The Edible School Yard Project, and corporate clients such as Disney, News Corp’s Myspace and over 30 start-ups including ThisNext, Savings.com, Storkbrokers and Hunuku.</p>\n\n<p>Today, Jose combines his 15 years of experience as a web designer and his passion for teaching to share the gospel of Web Design to over 20,000 people in his popular weekly show This Week in Web Design, which is broadcast live and posted on YouTube and iTunes every week. He has also helped train hundreds of students, freelancers, entrepreneurs and professionals at weekend workshops, LIVE webinars and online videos at The Skool.</p>","image":{"available_sizes":[[[150,146],"assets/images/resized/0005/5693/55693v2-max-150x150.png"],[[250,243],"assets/images/resized/0005/5693/55693v2-max-250x250.png"],[[360,351],"assets/images/resized/0005/5693/55693v2-max-450x450.png"]],"attribution":"<p>Jose Caballer Teaching at Seminar</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[{"description":"Jose became Chief Education Officer of The Skool ","stoned_year":2012,"stoned_month":1,"stoned_day":15,"source_url":"http://theskoolrocks.com","source_text":null,"source_description":"","stoneable_type":"Person","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"first_name":"Jose","last_name":"Caballer","permalink":"jose-caballer"}}],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://theskoolrocks.com","title":""}]}