{"first_name":"Jose","last_name":"Roda","permalink":"jose-roda","crunchbase_url":"http://www.crunchbase.com/person/jose-roda","homepage_url":"https://plus.google.com/104512172650466124288/posts","birthplace":"Phoenix, Az","twitter_username":"TechWrxx","blog_url":"http://joseroda.wordpress.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Oct 21 23:20:15 UTC 2012","updated_at":"Wed Oct 31 00:39:45 UTC 2012","overview":"<p>Jose Roda is Co-Founder and CEO of TechWrxx.com a Web Design and Social Media Firm. Located in Phoenix, Az. </p>\n\n<p>Jose Roda was born and raised in Phoenix, Az. He excelled at academic achievements, earning the Presidential Award of Excellence in Grade School, which indicated he was at the top 2.5 percent on a National level. Through out High School he continued the same aptitude and intelligence. However he was always bored with rules and always questioned established protocol and challenged authority whenever he could. </p>\n\n<p>Finding College a regurgitation of facts he felt he already knew Jose Roda decided to strike it on his own. He worked for America West Airlines for 13 years and traveled around the world. After his marriage of 14 years ended, he went in to call center management and start up. Something he did with great efficiency. He successfully set up a call center for a legal start-up in the valley. Realizing that a specific market was not being catered to. Jose Roda and a friend, Brett Ver Woert who is a Web Design and Social Media Expert used Jose&#8217;s nowhow to launch TechWrxx.com, focusing on bi-lingual, international small to medium sized businesses, and offering Bi-lingual websites and Social Media packages at 1/2 the cost of what the large firms were charging coupled with excellent one on one service. </p>\n\n<p>Business has grown quickly and currently TechWrxx.com is looking to expand and both partners are quite eager to bring on another partner who is experienced in Web Design and Social Media.  </p>\n\n<p>Jose also runs several blogs: Thoughts On Being an Entrepreneur. joseroda.wordpress.com and Nerd To The Core. http://nerdtothecore.com/ </p>\n\n<p>Jose Roda can be reached at Jose@TechWrxx.com   </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}