{"first_name":"Joseph","last_name":"C. Hutts","permalink":"joseph-c-hutts","crunchbase_url":"http://www.crunchbase.com/person/joseph-c-hutts","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Feb 20 12:56:21 UTC 2011","updated_at":"Sun Feb 20 12:57:18 UTC 2011","overview":"<p>Joe began his healthcare career working in administrative roles for hospitals in Wisconsin and Kansas City before joining Hospital Affiliates International as the Vice President of Operations where he had direct responsibility for up to six hospitals under the company&#8217;s management. Several years later, he joined Hospital Corporation of America where he held several roles, including Senior Vice President of Operations and President of HCA Management Company. Joe had direct responsibility for approximately 90 of HCA&#8217;s owned hospitals which together generated revenue of approximately $1.5 billion. Joe later helped HCA merge HCA Health Plans into a joint venture with Equitable Life Assurance Society of America to form Equicor, a new managed care company generating annual revenues in excess of $2 billion and where he served as Chief Operating Officer and Vice Chairman. After the emergence of Equicor, Joe co-founded Phycor, a private practice management company. As Phycor&#8217;s CEO, Joe led the company from a start-up to a publically traded company generating $1.5 billion in revenue through the operations of 55 multispecialty clinics with 3,900 physicians and an additional 35 Independent Physicians Associations representing another 19,000 physicians and a disease management company. After Phycor, Joe co-founded and served as CEO of Surgis, a private equity backed outpatient surgery center company. Under Joe&#8217;s leadership, Surgis quickly grew to become the largest privately held ambulatory surgery center company in the country. It was after the sale of Surgis, that BreatheAmerica was formed.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0012/3028/123028v1-max-150x150.jpg"],[[200,250],"assets/images/resized/0012/3028/123028v1-max-250x250.jpg"],[[200,250],"assets/images/resized/0012/3028/123028v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Executive Officer ","firm":{"name":"BreatheAmerica","permalink":"breathe-america","type_of_entity":"company","image":{"available_sizes":[[[150,24],"assets/images/resized/0012/3024/123024v1-max-150x150.png"],[[250,40],"assets/images/resized/0012/3024/123024v1-max-250x250.png"],[[343,55],"assets/images/resized/0012/3024/123024v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}