{"first_name":"Josef","last_name":"Zankowicz","permalink":"josef-zankowicz","crunchbase_url":"http://www.crunchbase.com/person/josef-zankowicz","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue May 20 02:31:13 UTC 2008","updated_at":"Thu Nov 27 09:54:49 UTC 2008","overview":"<p>Josef Zankowicz has over 20 years experience as a business and communications strategist in technology spanning software, Internet, and medical markets. He has worked with start-ups and established companies such as Apple, ATI, Dupont, Delrina and Symantec. During his career Mr. Zankowicz has successfully defined new product categories and grown concepts into leading business and consumer brands. His award-winning publicity campaigns with products like FormFlow, pcAnywhere, WinFax, PhotoSuite, and VideoWave achieved global exposure through numerous trade and business media sources.</p>\n\n<p>Zankowicz’s work with investors and financial analysts supported over $700 million in private placements, mergers, acquisitions, and public offerings on the TSX and the NASDAQ. In 1987, he co-founded and directed the Ontario Software Developers Association (now ITAC Ontario) and was also active with Washington-based Software Developers Association (now SIIA) during the early 1990s. He currently sits as a board member and or advisor with a number of Canadian start-ups.</p>\n\n<p>Zankowicz holds a Bachelor of Science, Applied Math, from the University of Western Ontario, and undertook study in Architecture at the University of Toronto. He has written as a featured columnist and appeared in numerous print and TV interviews in Canada, US and Europe. He’s also credited with innovating the first digital camera pager and the USB thin-client computer. </p>","image":{"available_sizes":[[[150,115],"assets/images/resized/0002/9782/29782v1-max-150x150.jpg"],[[216,166],"assets/images/resized/0002/9782/29782v1-max-250x250.jpg"],[[216,166],"assets/images/resized/0002/9782/29782v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Speechbobble","permalink":"speechbobble","type_of_entity":"company","image":{"available_sizes":[[[150,32],"assets/images/resized/0014/9407/149407v2-max-150x150.jpg"],[[250,53],"assets/images/resized/0014/9407/149407v2-max-250x250.jpg"],[[418,90],"assets/images/resized/0014/9407/149407v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}