{"first_name":"Josh","last_name":"Bevan","permalink":"josh-bevan","crunchbase_url":"http://www.crunchbase.com/person/josh-bevan","homepage_url":"","birthplace":"","twitter_username":"jabevan","blog_url":"","blog_feed_url":"","affiliation_name":"Alpinestars","born_year":1975,"born_month":11,"born_day":11,"tag_list":"e-commerce, html, css, online-marketing, entrepreneurship, start-up-environments, operations, social-media-marketing, vendor-management, offshore-management, marketing-roi, email-marketing, database-segmentation","alias_list":null,"created_at":"Mon Jan 23 05:36:21 UTC 2012","updated_at":"Mon Jan 23 19:11:33 UTC 2012","overview":"<p>Josh Bevan has an extensive background in Media and Information Systems, and business experience that spans the globe, including Argentina, Brazil, China, India, Pakistan, South Korea, Ukraine, and Vietnam. He is an accomplished business strategist, and has a proven track record in seeking and implementing organizational efficiency and cost reduction.</p>\n\n<p>In college Josh studied business, Asian culture, digital media, and film. He wrote a business plan for Rajio, a Japanese influenced community web site, allowing teens to create profiles, find friends, build blogs, chat, and share music. Entered by one of his mentors and professors, the plan became a finalist in the N.C. State University 7th Annual Carroll Joyner Business Plan Competition (2000).</p>\n\n<p>In 2000 he graduated with a Bachelors of Multidisciplinary Studies from North Carolina State University and in 2008 he received a Master’s in Information Systems from the University of Phoenix. He was introduced to HTML in 1994, published his first Web site in 1996, and began streaming video online in 1999. He also received a certificate from Duke University as a Web Commerce Professional.</p>\n\n<p>Josh worked in the Internet and Information Systems field until 2006, when he left a Director of Information Technology position at Adhesion Technologies to manage Brahma Beverage Distribution, Inc. The company gained a foothold in wholesale DSD distribution and vending with customized machines, designed by Josh, which accepted credit cards and were wirelessly connected to the Internet. This revolution in vending machine technology allowed the company to remotely monitor sales, inventory, and system status.</p>\n\n<p>In January 2007 Josh sold the business and launched his career in motorsports with a job consulting for SPEED.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0017/1304/171304v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0017/1304/171304v2-max-250x250.jpg"],[[300,300],"assets/images/resized/0017/1304/171304v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"Multidisciplinary Studies","institution":"North Carolina State University","graduated_year":2000,"graduated_month":null,"graduated_day":null},{"degree_type":"MIS","subject":"Management of Information Systems","institution":"University of Phoenix","graduated_year":2008,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Director of Ecommerce","firm":{"name":"Alpinestars","permalink":"alpinestars","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://twitter.com/#!/jabevan","title":"Twitter"},{"external_url":"http://www.linkedin.com/in/jabevan","title":"LinkedIn Profile"},{"external_url":"http://klout.com/#/jabevan","title":"Klout"}]}