{"first_name":"Josh","last_name":"Grotstein","permalink":"josh-grotstein-2","crunchbase_url":"http://www.crunchbase.com/person/josh-grotstein-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 28 09:33:20 UTC 2008","updated_at":"Thu Jul 05 02:36:05 UTC 2012","overview":"<p>Josh Grotstein is a Partner and Co-Founder of SAS Investors, a venture capital firm created to grow the Mid-Atlantic and Northeast&#8217;s most promising seed- and early-stage high-technology ventures.</p>\n\n<p>Josh has 22 years of marketing, business development, operations and investing experience, most of which has been in divisions and subsidiaries of Fortune 500 companies, where he has often performed the role of general manager and change agent for new and emerging technology-based ventures. Josh holds an MBA from Harvard Business School and a B.A. from Brown University where he graduated Phi Beta Kappa and magna cum laude. Josh has been recognized by Crain&#8217;s, New York Magazine, and Broadcasting &amp; Cable as a technology leader in the New York area.</p>\n\n<p>After business school and previous positions at J. Walter Thompson advertising and McKinsey consulting, Josh began work in affiliate sales and marketing with the then recently launched CNBC cable network. Distinguishing himself in those capacities, he was promoted to vice-president of business development, where he launched numerous ventures on behalf of the cable network, and where he served as the President of the New York chapter of the Cable Marketing Association (CTAM). Josh was then asked to move to the parent company, NBC, where he founded and became the first general manager of NBC Online Ventures. In that capacity, he played a key role in establishing the NBC-Microsoft joint venture from which MSNBC was created.</p>\n\n<p>After NBC, Mr. Grotstein moved to Prodigy Services to become the Senior Vice-President of content and commerce reporting to the CEO. In this capacity, he was a member of the senior executive team leading the company&#8217;s spin-out (from IBM and Sears) and restructuring of the company&#8217;s business model away from a proprietary online service and towards a value-added ISP, in an effort that eventually led to the company&#8217;s successful IPO.</p>\n\n<p>Subsequently, Mr. Grotstein was recruited by Citigroup&#8217;s (at the time, &#8220;Citicorp&#8217;s&#8221;) CEO and the Executive Vice President of Advanced Development to serve as the Division Executive for global e-commerce and Internet programs.</p>\n\n<p>At Citigroup, his team of over 500 people was responsible for successfully deploying Internet banking in sixteen countries around the world and striking major e-commerce distribution relationships with companies such as Microsoft, AOL, and Netscape. While at Citigroup, Josh and his organizations were also responsible for strategic licensing relationships and/or equity investments in Internet companies such as 724 Solutions, MySimon, Netcentives, GlobeSet, Yodlee, About.Com, Worldgate, and Virgin Atlantic&#8217;s UK-based ISP service, as well as playing a founding role in the formation of Identrus. In addition, Josh oversaw the development of three new &#8220;bank agnostic/open finance&#8221; programs in the consumer and small business space.</p>\n\n<p>Mr. Grotstein co-founded SAS Investors with George Abraham to facilitate the creation and growth of seed- and early-stage technology companies in the tri-state, Mid-Atlantic and Northeast regions of the United States. Located in New York City and backed by Canaan Partners, Rho Capital, and Sevin Rosen Funds, from whom George and Josh successfully raised $30 million to launch the fund in January of 2001, SAS Investors is positioned as one of the region&#8217;s leading backers and builders of early stage core technology companies.</p>\n\n<p>Mr. Grotstein currently sits on the boards of Multi-spectral Imaging, Motionbox, PermissionTV, and Backfence.com, and has served as a board member for Enpirion and Lemur Networks all while at SAS Investors.</p>","image":null,"degrees":[{"degree_type":"MBA","subject":"","institution":"Harvard","graduated_year":1991,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Partner and Co-Founder","firm":{"name":"SAS Investors","permalink":"sas-investors","type_of_entity":"financial_org","image":{"available_sizes":[[[102,80],"assets/images/resized/0002/9871/29871v1-max-150x150.jpg"],[[102,80],"assets/images/resized/0002/9871/29871v1-max-250x250.jpg"],[[102,80],"assets/images/resized/0002/9871/29871v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"CEO","firm":{"name":"Motionbox","permalink":"motionbox","type_of_entity":"company","image":null}},{"is_past":false,"title":"Board of Directors","firm":{"name":"eCaring","permalink":"ecaring","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0019/4391/194391v2-max-150x150.png"],[[250,250],"assets/images/resized/0019/4391/194391v2-max-250x250.png"],[[450,450],"assets/images/resized/0019/4391/194391v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[{"description":"Investor in SkillSlate.","stoned_year":2009,"stoned_month":null,"stoned_day":null,"source_url":"http://www.skillslate.com/press/funding","source_text":null,"source_description":"SkillSlate.com","stoneable_type":"Person","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"first_name":"Josh","last_name":"Grotstein","permalink":"josh-grotstein-2"}}],"video_embeds":[],"external_links":[],"web_presences":[]}