{"first_name":"Josh","last_name":"Sookman","permalink":"josh-sookman-2","crunchbase_url":"http://www.crunchbase.com/person/josh-sookman-2","homepage_url":"","birthplace":"Toronto, ON","twitter_username":"jsookman","blog_url":"http://startuplifeblog.com","blog_feed_url":"http://feeds.feedburner.com/sookman","affiliation_name":"Unaffiliated","born_year":1983,"born_month":7,"born_day":23,"tag_list":"","alias_list":null,"created_at":"Fri Apr 16 14:07:06 UTC 2010","updated_at":"Mon Apr 19 18:29:20 UTC 2010","overview":"<p>Josh is an Analyst at the BlackBerry Partners Fund and at RBC Venture Partners.</p>\n\n<p>At the BlackBerry Partners Fund, he is primarily responsible for conducting due diligence and writing investment recommendations for prospective investments in the mobile sector. He also works closely with portfolio companies to develop business strategies, enhance product development, and improve user experience. Josh has developed expertise in mobile social networking and location-aware applications, mobile commerce, mobile advertising, and mobile search.</p>\n\n<p>At RBC Venture Partners, similarly, Josh is responsible for conducting due diligence and writing investment recommendations for prospective investments in the financial services and enterprise software markets.</p>\n\n<p>Josh currently sits on the Steering Committee of the Mobile Experience Innovation Center (MEIC), and the Individual Membership Committee and Mentorship Committee of Toronto Biotechnology Initiative (TBI).</p>\n\n<p>In 2009, and again in 2010, Josh helped judge the Social eChallenge Competition at Stanford University; from Feb-May 2009 he mentored Overseas Education Center (OEC), a Stanford team that was building a not-for-profit educational facility in Cambodia to help local students get top-tier educations abroad. During that timeframe, Josh was also invited to judge the regional Venture Capital Investment Competition (VCIC) round at MIT, where he had the chance to judge and give feedback to MBA teams during a series of VC simulations.</p>\n\n<p>Prior to this, Josh had founded and operated four private companies while completing his high school and undergraduate degrees. One venture, CampusTutors Corporation, was an angel-backed company that provided a web-based, tutor-matching service at three university campuses and grew to over 150 employees and contractors.</p>\n\n<p>He loves wakeboarding and playing squash.</p>","image":{"available_sizes":[[[150,126],"assets/images/resized/0008/4126/84126v2-max-150x150.jpg"],[[250,210],"assets/images/resized/0008/4126/84126v2-max-250x250.jpg"],[[450,379],"assets/images/resized/0008/4126/84126v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/jsookman","title":"Twitter"},{"external_url":"http://www.linkedin.com/in/jsookman","title":"LinkedIn"}]}