{"first_name":"Josh","last_name":"Bell","permalink":"josh-bell","crunchbase_url":"http://www.crunchbase.com/person/josh-bell","homepage_url":"","birthplace":"","twitter_username":"joshbell","blog_url":"","blog_feed_url":"","affiliation_name":"Dawn Capital","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Apr 23 15:39:29 UTC 2009","updated_at":"Fri Mar 18 20:13:27 UTC 2011","overview":"<p>Josh Bell is an Associate Partner and Head of Financial Services at Dawn Capital.</p>\n\n<p>Prior to Dawn, Josh worked with McKinsey &amp; Company, managing teams that advised boards of Fortune global 500 financial institutions based in London, Geneva, Amsterdam and New York. Over the past 5 years, Josh has developed strong working relationships with many of the key senior executives, particularly in Europe. Josh has in particular extensive experience working with clients in private equity, corporate finance and retail strategy. Most recently, Josh was recognised within the firm as a leading financial services expert in Europe.</p>\n\n<p>Within his retail and wholesale banking work, Josh devoted significant time to informing clients on the impact of new technologies on their industries, and helping to assess and implement these technologies for their businesses.</p>\n\n<p>In addition to his private sector client work, Josh was also integral to supporting McKinsey’s relationship with the World Economic Forum, leading McKinsey support for the WEF&#8217;s financial services knowledge initiatives and activities, principally for the Davos conferences in 2006 and 2007.</p>\n\n<p>Prior to McKinsey, Josh served in 2002 as an external, independent consultant to Lloyd’s of London, leading their risk analysis, market segmentation and phasing for their online risk management exchange.</p>\n\n<p>Josh was a Graduate Scholar at Oxford University in Mathematics. He was subsequently a Research Fellow at Harvard University in Economics and Game Theory, publishing papers in Game Theory and IT Security journals before studying operational research and advanced financial modelling at Cambridge University, as part of an MPhil in Statistics; his MPhil research was supported by the Rand Institute of Santa Monica, California.</p>","image":{"available_sizes":[[[128,128],"assets/images/resized/0012/6326/126326v1-max-150x150.jpg"],[[128,128],"assets/images/resized/0012/6326/126326v1-max-250x250.jpg"],[[128,128],"assets/images/resized/0012/6326/126326v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Haversack","permalink":"haversack","type_of_entity":"company","image":{"available_sizes":[[[150,72],"assets/images/resized/0018/5434/185434v2-max-150x150.jpg"],[[250,119],"assets/images/resized/0018/5434/185434v2-max-250x250.jpg"],[[300,144],"assets/images/resized/0018/5434/185434v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Head of Financial Services","firm":{"name":"Dawn Capital","permalink":"dawn-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,33],"assets/images/resized/0004/2763/42763v2-max-150x150.png"],[[221,49],"assets/images/resized/0004/2763/42763v2-max-250x250.png"],[[221,49],"assets/images/resized/0004/2763/42763v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}