{"first_name":"Joshua","last_name":"Kerrigan","permalink":"joshua-kerrigan","crunchbase_url":"http://www.crunchbase.com/person/joshua-kerrigan","homepage_url":"http://www.joshuakerrigan.com","birthplace":"","twitter_username":"joshua_kerrigan","blog_url":"http://independent.academia.edu/JoshuaKerrigan/blog","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1981,"born_month":5,"born_day":25,"tag_list":"joshua-kerrigan","alias_list":null,"created_at":"Sun May 06 22:39:08 UTC 2012","updated_at":"Thu May 10 03:09:53 UTC 2012","overview":"<p>Joshua Kerrigan is an entrepreneur with a keen eye for business opportunities.  His company, Yacht Management, Inc., provides delivery, storage, and maintenance services to over 200 yachts.  No project or yacht has been too big for him to take on.  Based out of south Florida with hopes of expanding his services, Kerrigan has seen a lot of success out on the docks.  His passion for what he does and his ambition to do it well no matter what it takes shines through his work.  Many people in the industry recognize his young success and go-getter attitude.  Kerrigan started his first yacht maintenance company at the age of 15, after all.  However, when he’s not running his own company, Joshua Kerrigan is proud to help his country by putting his boating skills to use.  Kerrigan has joined the U.S. Customs and Border Protection’s Local Boaters Option Program.  As a part of this program, Kerrigan and others in it can help the CBP by processing low-risk boat arrivals into U.S. water.  By volunteering his time, Kerrigan helps expedite the border-crossing process out in the seas, allowing the CBP to spend its time keeping illegal substances and boaters out of the nation’s borders.</p>","image":{"available_sizes":[[[100,100],"assets/images/resized/0018/8079/188079v2-max-150x150.jpg"],[[100,100],"assets/images/resized/0018/8079/188079v2-max-250x250.jpg"],[[100,100],"assets/images/resized/0018/8079/188079v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}