{"first_name":"Josh","last_name":"Eikov","permalink":"josh-eikov","crunchbase_url":"http://www.crunchbase.com/person/josh-eikov","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"E3D Labs","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue May 18 22:32:44 UTC 2010","updated_at":"Sat Dec 18 01:47:06 UTC 2010","overview":"<p>Mr. L. Joshua Eikov is a visionary and dynamic leader with a unique blend of strategic finance, business and technological management experiences across the telecommunications, Internet, real estate, entertainment and consumer electronics industries within entrepreneurial and venture-based private and public corporations.</p>\n\n<p>Mr. Eikov is the Managing Director of Baron General Capital LLC a merchant banking and corporate consultancy. Previous to Baron General Josh helped clients such as Target Email Direct a provider of interactive and email marketing products and services in a turnaround and expansion program as their Interim CTO and he was the Chief Strategist at eBRANDsolutions, a branding and marketing firm that consulted to the Global 1000 on issues of eBusiness, product design, digital marketing and branding and international brand expansion. Josh was the Founder and CEO of i-Titan Communications Networks, a manufacturer and designer of wireless broadband products. Josh served as President and Chief Executive Officer of DigiCon Technologies, Inc., a CTI (Computer Telephony Integration) based systems integration Company that was sold to a publicly traded Company in 1998. DigiCon created and developed a global systems architecture that allowed a user to access their email text-to-speech via any touch-tone or cellular telephone. The Company also developed an international data network that had an emphasis in telemedicine, which was accessible via telephone. Prior to founding DigiCon he founded Faceted Information Systems. The Company provided consulting services in information technology and financial information systems including, LAN/WAN systems design to Wall Street and institutional clients. Josh was also instrumental in the design and construction of FIS-Tech Computers. The Company was sold in 1995.</p>\n\n<p>Josh attended East Stroudsburg University and is a graduate of the Advanced Management Program at Harvard University and the Executive Compliance Program at Tulane Law School . Josh has also received a certificate in Negotiation from the University of Windsor Law School and is a Web of Culture Certified Web Globalist. He is a Member of The Council of Communications Advisors, the Society for Competitive Intelligence, the Internet Engineering Task Force (ITEF), the International Telecommunications Union (ITU) and the Institute of Electrical and Electronics Engineers (IEEE).</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"","firm":{"name":"E3D Labs","permalink":"e3d-labs","type_of_entity":"company","image":{"available_sizes":[[[150,97],"assets/images/resized/0008/7679/87679v2-max-150x150.png"],[[209,136],"assets/images/resized/0008/7679/87679v2-max-250x250.png"],[[209,136],"assets/images/resized/0008/7679/87679v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}