{"first_name":"Jost","last_name":"Braukmann","permalink":"jost-braukmann","crunchbase_url":"http://www.crunchbase.com/person/jost-braukmann","homepage_url":"http://www.jb-business.com","birthplace":"Germany","twitter_username":"JostBraukmann","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1957,"born_month":4,"born_day":8,"tag_list":"ma-mergers-acquisitions-business-development","alias_list":null,"created_at":"Tue Jun 19 17:57:44 UTC 2012","updated_at":"Thu Jun 21 23:06:46 UTC 2012","overview":"<ol>\n<li><p>WHO WE ARE\nJB Business Consulting is an experienced strategy-management-consultancy in the field of corporate development with an emphasis on business development and mergers and acquisitions. \nMore than 100 (successful) M&amp;A projects over the last 20 years mean that we are the ideal consultancy to find strategic expansions for your company, targeting, for example, technologies, markets, regions, human and machinery capacities, product development, winning major customers or brands or vice versa, optimising the sale of your company and finding strategic or financial partners.\nFurther details can be found on our homepage:  www.jb-business.com </p></li>\n<li><p>WHAT WE DO\nOur consultants advise companies on subjects such as the strategic development of business segments, the sale of companies, corporation spin-offs, corporate succession in medium-sized companies, and restructuring themes, our constant aim is to generate profitable and sustainable growth for our clients.</p></li>\n</ol>\n\n<p>We specialise in the following:\n• Strategic planning/implementation\n• Business development\n• Customer-relationship management\n• Professional planning for taking over and selling companies\n• Target and investor screening\n• Restructuring and financial advice\n• M&amp;A Post merger integration\n• Change management</p>\n\n<p>Our services range from analysis and strategic development to implementation management. We see ourselves as a connecting element between corporate strategy and its translation into concrete programmes and measures.\nOur focus lies in branches with international dynamics of change.\n, </p>\n\n<ol>\n<li>HOW WE WORK\nWe combine the scientific intelligence of a strategy consultancy with professional M&amp;A and investor-research and the hands on mentality of our consultants.\nWe combine the scientific intelligence of a strategy consultancy with professional M&amp;A and investor-research and the hands on mentality of our consultants.\nThrough rigorous research for relevant information from external and internal data sources our research department is able to ensure an optimised target and investor screening for our mandate’s use.\nWe use several approaches, from the heavily methodologically influenced analysis to workshop based strategies using our various tools.</li>\n</ol>","image":{"available_sizes":[[[100,150],"assets/images/resized/0019/6200/196200v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0019/6200/196200v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0019/6200/196200v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}