{"first_name":"Juan","last_name":"Fraiz","permalink":"juan-fraiz","crunchbase_url":"http://www.crunchbase.com/person/juan-fraiz","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Nov 27 10:40:02 UTC 2008","updated_at":"Sat Nov 29 13:38:08 UTC 2008","overview":"<p>Juan Fraiz serves as CFO of SaaS Capital and brings with him a key mix of banking and software experience.</p>\n\n<p>Prior to SaaS Capital, he was with The Sant Corporation as vice president of finance and administration, responsible for the company’s finance, legal and support operations.  Before this, Juan was corporate vice president and CFO at Compass CS, Inc., integrating key functions and negotiating the restructuring of a $25MM leverage buyout.  He also served in finance management roles at Mercy Health Partners, Elumenn Solutions, Inc., and ChoiceCare Corporation, adding to his financial expertise.</p>\n\n<p>In banking, Juan focused on corporate-wide financial, SEC, and regulatory functions for NationsBank Corporation, the third largest bank holding company in the United States (now known as Bank of America.)  In addition, he was senior vice president and CFO for Boston Trade Bank where he implemented strategic planning, leading to a successful turn around of the bank. His early career was with the public accounting firm of PricewaterhouseCoopers where he worked extensively with banks and other financial services firms and multinational publicly-held companies.</p>\n\n<p>Juan received his BS in accounting and finance from the Krannert School of Management at Purdue University.  He is a Certified Public Accountant and member of AICPA and FEI</p>","image":{"available_sizes":[[[150,75],"assets/images/resized/0002/9789/29789v1-max-150x150.jpg"],[[200,100],"assets/images/resized/0002/9789/29789v1-max-250x250.jpg"],[[200,100],"assets/images/resized/0002/9789/29789v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"CFO","firm":{"name":"SaaS Capital","permalink":"saas-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,64],"assets/images/resized/0002/9785/29785v11-max-150x150.png"],[[250,108],"assets/images/resized/0002/9785/29785v11-max-250x250.png"],[[450,194],"assets/images/resized/0002/9785/29785v11-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}