{"first_name":"Juan","last_name":"Pablo Possenti","permalink":"juan-pablo-possenti","crunchbase_url":"http://www.crunchbase.com/person/juan-pablo-possenti","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Go Go Go","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Nov 21 18:07:01 UTC 2011","updated_at":"Fri Dec 16 02:09:11 UTC 2011","overview":"<p>As the founder and CEO of Go Go Go, Juan possess a solid professional background in business development, management and administration with exemplary skill in all facets of marketing, customer service and technical solutions. Go Go Go is an online company specializing in shipping, logistics, and courier services based out of Miami, Florida. Its mission is to provide a full range of personalized services that strategically meet the shipping needs and requirements of clientele throughout the world through the latest in online technology. Go Go Go is an enterprise that was formulated with PTA Consultants as its parent company.</p>\n\n<p>Several years ago, Juan spearheaded the start-up of PTA Consultants Inc. in Coral Gables, Florida, a company specializing in providing contracted technology solutions. This consisted of overseeing technical support to businesses and individual customers of large corporations. This also entailed administering all business development, including identifying client needs and providing effective solutions through third party service providers. Juan successfully oversaw company growth and handled all financial reporting. PTA Consultants has recently expanded and now provides business consulting services to assist companies in business startups, growth, and profitability, including developing an online presence.</p>\n\n<p>Juan has also functioned in the capacity of a Financial Analyst. This entailed preparing thorough analyses and reports for some of Miami&#8217;s largest companies and organizations. He also worked for six years as Chief Technical Officer (CTO) and Manager for TechXperts in Florida. This has included all aspects of management, sales, and providing service and technical support to customers. Juan has been involved with computers and technology all of his life, which included working in a family computer business as a young teen.</p>\n\n<p>Juan also received a Bachelor of Business Administration from Florida International University, Miami, where he was recognized on the Dean’s List for several semesters.</p>\n\n<p>Holding numerous technical certifications and accreditations, Juan possesses a comprehensive knowledge in all facets of technology and computers. He excels at communicating and working closely with others in the development of new ventures. He also speaks both English and Spanish with an understanding of Italian.</p>","image":null,"degrees":[{"degree_type":"Bachelor of Business Administration","subject":"Management Information Systems, Finance & Real Estate","institution":"Florida International University","graduated_year":2009,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder & CEO","firm":{"name":"Go Go Go","permalink":"go-go-go","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0016/4992/164992v2-max-150x150.jpg"],[[250,83],"assets/images/resized/0016/4992/164992v2-max-250x250.jpg"],[[450,150],"assets/images/resized/0016/4992/164992v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/profile/view?id=55514069","title":""}]}