{"first_name":"Juan","last_name":"De Abreu","permalink":"juan-de-abreu","crunchbase_url":"http://www.crunchbase.com/person/juan-de-abreu","homepage_url":"http://www.getcs.com","birthplace":"","twitter_username":"juandeabreu","blog_url":"","blog_feed_url":"","affiliation_name":"Common Sense","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jun 16 17:22:55 UTC 2008","updated_at":"Fri Sep 24 17:57:56 UTC 2010","overview":"<p>Juan is VP - Delivery Director and Project Director at Common Sense, an international technology products and services company with headquarters in Buenos Aires, Argentina and San Antonio, Texas. At Common Sense, Juan develops strategic plans to help clients meet their business goals, retain and grow their existing customer base, and attract new customers to achieve sales and growth goals.</p>\n\n<p>Juan takes great pride in having spent 19 years of his career working for various companies analyzing business processes and developing and implementing Information Systems using web and other technologies and solutions, making business systems more efficient and cost effective.</p>\n\n<p>Juan believes that it is critical to implement technology solutions that are a win for a company and the customers its serves. His passion is to make people’s jobs easier, business processes more efficient, and a company’s bottom line more profitable.</p>\n\n<p>Before joining Common Sense, Juan worked for Advantage-Rent-A Car, based in San Antonio, Texas, for seven years. One of his first assignments was to perform a six-month business analysis of gas consumption by Advantage locations, as a result of that he developed a system to save the company up to 50 percent in gas expenses – a remarkable feat with today’s high gas prices. </p>\n\n<p>The business analysis was performed in several stages, which included tests and evaluations. During the same time period, Juan developed new, innovative business processes to streamline record-keeping for car maintenance, car sales, reservations, collections, accounting integration, inventory management and it was responsible for the operation of all internet booking engines, servicing all Advantage customer and partners worldwide.</p>\n\n<p>Juan is originally from Caracas, Venezuela. Before moving to San Antonio he worked for the Dunes Hotel and Beach Resort in Caracas. He was the project leader of a major and successful assignment to convert the company’s sales, time share and reservations operations; financial systems; and credit and collections processes to third-party software that made employee functions easier, streamlined critical business operations, and made a positive impact on the company’ bottom line.</p>\n\n<p>Before his tenure at the resort, he was a systems specialist at Cygnus Integadores de Sistemas, an Information Technology company in Caracas, where he focused on design, development and implementation of technology applications for the financial and educational clients.</p>\n\n<p>Juan has extensive experience in database management and Web technology applications, and an array of custom business processing systems applications. He is highly experienced in the analysis, design, implementation and project management of software applications and strives to stay at least one step ahead of technology through continuous learning practices.</p>\n\n<p>Juan holds a Bachelor’s degree in Computer Science from el Instituto Universitario Nueva Esparta in Caracas, Venezuela. His clients and colleagues find him to be resourceful, personable, energetic and focused on results.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0002/5744/25744v4-max-150x150.jpg"],[[200,200],"assets/images/resized/0002/5744/25744v4-max-250x250.jpg"],[[200,200],"assets/images/resized/0002/5744/25744v4-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"","subject":"Computer Science","institution":"Universidad Nueva Esparta","graduated_year":1994,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"VP - Delivery Director","firm":{"name":"Making Sense","permalink":"making-sense","type_of_entity":"company","image":{"available_sizes":[[[150,108],"assets/images/resized/0002/1196/21196v5-max-150x150.png"],[[235,170],"assets/images/resized/0002/1196/21196v5-max-250x250.png"],[[235,170],"assets/images/resized/0002/1196/21196v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/juandeabreu","title":"Juan De Abreu"},{"external_url":"http://twitter.com/juandeabreu","title":"Juan De Abreu"}]}