{"first_name":"Jud","last_name":"Bowman","permalink":"jud-bowman","crunchbase_url":"http://www.crunchbase.com/person/jud-bowman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jan 16 08:37:31 UTC 2010","updated_at":"Tue Feb 23 00:27:50 UTC 2010","overview":"<p>Jud is the President &amp; CEO of PocketGear, and led the acquisition of PocketGear from Motricity in June 2008. Prior to PocketGear, Jud co-founded Motricity in September 1999 and was instrumental in raising $400 million of venture capital and growing Motricity to more than $100 million in annual revenues and 500 employees globally. As Motricity&#8217;s Chief Technology Officer, Jud was the chief architect of one of the industry&#8217;s leading mobile content delivery platforms that delivers more than $1 billion of content to mobile phones per year and was named the 2006 Best Service Delivery Platform by the GSM Association, Best Content Service Delivery Platform by Mobile Entertainment magazine and honored by Frost &amp; Sullivan as the Premium Mobile Content Platform of the Year in 2005.</p>\n\n<p>Jud has spoken at conferences across 4 continents, including CTIA Wireless, CES, the Red Herring 100 Conference, European Technology Roundtable Exhibition (ETRE) in Athens, The Forum on Global Leadership, Wireless Strategy, Mobile Internet Summit and PCIA GlobalXchange, and is a frequent guest speaker at Duke University&#8217;s Fuqua School of Business and University of North Carolina&#8217;s Kenan-Flagler Business School. Jud has also spoken at venture capital and investment banking conferences, including the Goldman Sachs Internet Conference, Lehman Brothers Worldwide Wireless and Wireline Conference, and Pacific Crest Technology Forum. Jud has been featured in over 500 national media publications, including profiles in the Wall Street Journal, BusinessWeek, CNN/CNNfn, Red Herring, Financial Times, Wireless Week and a cover story in the December 2002 issue of Wireless Review.</p>\n\n<p>Jud has been named as one of the world&#8217;s &#8220;Top 100 Young Innovators&#8221; by MIT&#8217;s Technology Review and one of &#8220;Tech&#8217;s Best Young Entrepreneurs&#8221; by BusinessWeek in 2007. He was also recognized as a winner of the Carolinas&#8217; Ernst &amp; Young &#8220;Entrepreneur of the Year&#8221; award in 2001. Jud is currently on leave from Stanford University, where he has been named a President&#8217;s Scholar, and is a graduate of the North Carolina School of Science and Mathematics.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President, CEO","firm":{"name":"Appia","permalink":"appia","type_of_entity":"company","image":{"available_sizes":[[[150,54],"assets/images/resized/0012/4831/124831v2-max-150x150.png"],[[250,90],"assets/images/resized/0012/4831/124831v2-max-250x250.png"],[[450,162],"assets/images/resized/0012/4831/124831v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"","firm":{"name":"Triangle StartUp Factory","permalink":"triangle-startup-factory","type_of_entity":"company","image":null}},{"is_past":true,"title":"CTO","firm":{"name":"Motricity","permalink":"motricity","type_of_entity":"company","image":{"available_sizes":[[[150,38],"assets/images/resized/0006/9658/69658v2-max-150x150.png"],[[250,64],"assets/images/resized/0006/9658/69658v2-max-250x250.png"],[[335,87],"assets/images/resized/0006/9658/69658v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}