{"first_name":"Judy","last_name":"Albers","permalink":"judy-albers","crunchbase_url":"http://www.crunchbase.com/person/judy-albers","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 23 08:06:05 UTC 2009","updated_at":"Tue Jun 23 08:06:40 UTC 2009","overview":"<p>Judy Albers is the Chief Operating Officer at Excell. Judy has been instrumental in the establishment of many start-up companies based upon technologies spun out of Upstate NY universities and corporations, particularly in analyzing the commercial potential of the new technologies, developing commercialization strategies, positioning and planning early business operations, and providing seed stage capital. Her current focus is on co-managing the Excell Partners Fund and structuring equity-based deals.</p>\n\n<p>Prior to joining Excell, Judy was a Vice President at Trillium Group, another Rochester-based Venture Capital firm, where she co-managed the University Technology Seed Fund, now fully invested. Judy also previously taught Environmental Chemistry at Bates College in Lewiston, Maine. Her classes were the largest in the department, teaching over a hundred non-majors every semester in lectures and laboratory. Prior to that, she served for several years at the Center for Naval Analyses in Washington, D.C. as a defense analyst. Her job was to develop and link analytical conclusions on Navy systems, tactics, and operations to practical recommendations for implementation by the Navy&#8217;s top-level decision makers at the Pentagon. For two years, Judy was assigned to the Commander ASW Forces U.S. Sixth Fleet in Naples, Italy where she provided quantitative assessments to the Admiral’s staff on the effectiveness of anti-submarine warfare systems and platforms in the Mediterranean theater. She was also previously a research chemist at 3M Company in St. Paul, Minnesota.</p>\n\n<p>Judy holds a B.S. in Chemistry from Duke University, a Ph.D. in Inorganic Chemistry from Brandeis University, and completed her post-doc in Chemistry at Princeton University.</p>\n\n<p>In addition to her work at Excell, Judy is a co-developer and co-facilitator of the Pre-Seed Workshop currently serving Buffalo, Rochester, Syracuse, Ithaca, Geneva, Albany, New York City, and Long Island.  She is also a frequent speaker and panelist at entrepreneurship conferences, business plan competitions, and venture events. An academic at heart, her white papers can be downloaded from our white papers archive.</p>\n\n<p>Judy can be reached at (585) 389-6104 or jalbers@excellny.com.</p>","image":{"available_sizes":[[[115,150],"assets/images/resized/0005/0289/50289v1-max-150x150.jpg"],[[150,195],"assets/images/resized/0005/0289/50289v1-max-250x250.jpg"],[[150,195],"assets/images/resized/0005/0289/50289v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"COO","firm":{"name":"Excell Partners","permalink":"excell-partners-2","type_of_entity":"financial_org","image":{"available_sizes":[[[143,87],"assets/images/resized/0005/0287/50287v1-max-150x150.png"],[[143,87],"assets/images/resized/0005/0287/50287v1-max-250x250.png"],[[143,87],"assets/images/resized/0005/0287/50287v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}