{"first_name":"Juel","last_name":"Rogers","permalink":"juel-rogers","crunchbase_url":"http://www.crunchbase.com/person/juel-rogers","homepage_url":"http://www.myspace.com/truthandmercy","birthplace":"Manila, Philippines","twitter_username":"twogorgeous","blog_url":"http://loveandwisdom-juel.blogspot.com/","blog_feed_url":"","affiliation_name":"US Bank","born_year":null,"born_month":null,"born_day":null,"tag_list":"fiction","alias_list":null,"created_at":"Fri Sep 17 20:32:04 UTC 2010","updated_at":"Thu Sep 23 03:25:15 UTC 2010","overview":"<p>Snake Eyes is the code name of a member of the G.I. Joe team. Much of his history and information, including his real name, place of birth, as well as almost everything else about him, have remained classified throughout all depictions of his origin. All that is known for certain about his military standing is that he holds the rank of U.S. Army Sergeant First Class (E-7), has undergone Drill Sergeant training, and is a former U.S. Army Special Forces Delta Operator. He is also the team&#8217;s resident hand to hand combat instructor. Very little else about his past has been revealed. He was originally billed by Hasbro Toys in 1982 as a Commando, but by 1984, in the pages of Marvel Comics, it became clear that he was also a full-fledged ninja master.</p>\n\n<p>In every version of his story, Snake Eyes is quiet in his movements and is a swift and deadly master of multiple martial arts. He is an expert in the use of the ninjatō and spike-knuckled trench knives (which he collects). He usually carries them in pairs but often uses only one. He is equally qualified with and willing to use standard weapons like firearms and explosives. Making him even more dangerous is that he rarely relies on one set of weapons to the exclusion of others. For instance, in one mission, Snake Eyes is confronted by a ninja with a sai and he defeats him by simply throwing a standard grenade at him. Snake Eyes did give up much of his ninja training in later issues of the G.I. Joe America&#8217;s Elite comic series. (see below)</p>\n\n<p>In keeping with his quiet personality, Snake Eyes usually wears what could perhaps best be described as a black &#8220;military ninja&#8221; bodysuit, along with a balaclava and visor to cover his face, which was disfigured in a helicopter explosion. Since then, Snake Eyes has had extensive plastic surgery to repair the damage to his face; he still has a few scars left, but his vocal cords cannot be repaired.</p>\n\n<p>When shown out of his uniform, Snake Eyes is a six feet one inch tall caucasian with an athletic build, blonde hair, and blue eyes. He has a pet wolf named Timber that has appeared several times in toys, comics, and animation.</p>\n\n<p>Snake Eyes has been shown in many of the continuities of comics and animated series to at some point being romantically involved with fellow G.I. Joe member Master Sergeant Shana M. O&#8217;Hara, a.k.a. Scarlett, and he has several apprentices, including Ophelia (deceased), Kamakura, Tiger Claw, and Jinx.</p>","image":null,"degrees":[{"degree_type":"Diploma","subject":"Basic Studies","institution":"McCluer Senior High","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Senior Shift Coordinator","firm":{"name":"US Bank","permalink":"us-bank","type_of_entity":"company","image":null}},{"is_past":true,"title":"Team Leader","firm":{"name":"Today's temporary","permalink":"todays-temporary","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://en.gravatar.com/alittle2gorgeous","title":""}],"web_presences":[{"external_url":"http://www.myspace.com/truthandmercy","title":""},{"external_url":"http://www.facebook.com/profile.php?id=766848713#!/profile.php?viewas=100000686899395","title":""}]}