{"first_name":"Juha","last_name":"Christensen","permalink":"juha-christensen-2","crunchbase_url":"http://www.crunchbase.com/person/juha-christensen-2","homepage_url":"http://cogniance.com/company/board_of_directors#juha_christensen","birthplace":"","twitter_username":"JuhaC","blog_url":"","blog_feed_url":"","affiliation_name":"Cogniance","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jul 10 11:35:08 UTC 2009","updated_at":"Thu Jul 16 20:26:24 UTC 2009","overview":"<p>Juha brings broad management, board level and investment expertise to Cogniance&#8217;s board. Voted one of the 25 most influential Europeans in Technology by Time Magazine, Juha has had profound impact on the industry though his efforts at companies like Symbian, Microsoft, Macromedia (now Adobe), Trolltech and Teleca.\nThrough Progression Partners and Sunstone Capital, Juha is involved at board level in multiple companies.\nJuha wrote the business plan and led the negotiations that brought Nokia, Motorola, Ericsson, Sony, Samsung and others together to create the mobile operating system company Symbian. Today, Symbian is the market leader in mobile operating systems. Later he ran Microsoft&#8217;s mobile platform efforts, bringing to market Pocket PC and Smartphone. After Microsoft, Juha served as President at Macromedia, bringing to market a range of diverse Internet and Mobile products.\nJuha is Partner at Progression Partners and Chairman of Cogniance and Cloudmade. He is a long serving member on the board of Teleca, the largest systems integrator in the mobile industry with over 2,000 employees. 40% of mobile phones worldwide are integrated by Teleca. He is an independent board member at VirtualLogix, the leader in embedded virtualization. Until recently, Juha served on the board of Trolltech through it&#8217;s IPO and subsequent sale to Nokia, and at Unwire until the exit to private equity firm LD Equities. Juha is also a founding Venture Partner at Copenhagen based Sunstone Capital, a leading European venture capital company with EUR 450 million under management.\nJuha brings innovation, solid execution experience and a &#8220;get down to business&#8221; attitude to the companies he is involved with.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"https://twitter.com/JuhaC","title":"Twitter"},{"external_url":"http://www.linkedin.com/in/juhachristensen","title":"LinkedIn"},{"external_url":"http://www.facebook.com/juhac","title":"Facebook"}],"web_presences":[]}