{"first_name":"Julie","last_name":"Meyer","permalink":"julie-meyer","crunchbase_url":"http://www.crunchbase.com/person/julie-meyer","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Mar 21 15:34:42 UTC 2008","updated_at":"Mon Mar 24 19:21:23 UTC 2008","overview":"<p>Since 1988 in Paris, Boston, and London, Julie Meyer has helped start-up businesses and industry standards to emerge and establish themselves. Ariadne Capital, founded in 2000 by Julie, invests in and advises game-changers in the digital media, communications and life services sectors.</p>\n\n<p>Julie is well-known for founding First Tuesday, the largest global network of entrepreneurs, which many credit for igniting the Internet generation in Europe. It was sold for $50 million in cash in and shares in July 2000. Julie has raised a lot of capital for start-ups in addition to overseeing $150 million of seed capital found for start-ups through First Tuesday. From 1998 to 1999, Julie was part of the team at NewMedia Investors [which became NewMedia Spark, an early stage investment firm, in October 1999] where she helped several companies, including lastminute.com, WGSN and Arc Cores raise significant venture capital financing and internationalise. Each of these businesses has had successful exits for their investors.</p>\n\n<p>Ariadne Capital were early advisors to Skype [now Ebay], Kashya [now EMC], and Espotting [now MIVA], three large European VC-backed success stories of the early 21st century. Current hits in her portfolio include 1Click2Fame, SpinVox, RealLife, Independent IP and FIDOR. Named a &#8220;Global Leader of Tomorrow by the World Economic Forum&#8221; and one of the top 30 most powerful women in Europe according to the Wall Street Journal, Julie&#8217;s mission is to back the best entrepreneurs in Europe with global ambitions. She was awarded &#8220;Entrepreneur of the Year&#8221; Award in October 2000 by Ernst &amp; Young U.K., and has been named by the Wall Street Journal one of the top 50 European Business Women.</p>\n\n<p>Influenced by Ayn Rand, Julie has frequently said that Ariadne Capital is ‘Atlas Shrugged in reverse.&#8217;</p>\n\n<p>She is setting up a foundation for girls in their teens to help them become addicted to achievement.</p>","image":{"available_sizes":[[[68,80],"assets/images/resized/0001/6139/16139v1-max-150x150.jpg"],[[68,80],"assets/images/resized/0001/6139/16139v1-max-250x250.jpg"],[[68,80],"assets/images/resized/0001/6139/16139v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"    Founder & CEO","firm":{"name":"Ariadne Capital","permalink":"ariadne-capital","type_of_entity":"company","image":{"available_sizes":[[[113,84],"assets/images/resized/0001/6159/16159v4-max-150x150.png"],[[113,84],"assets/images/resized/0001/6159/16159v4-max-250x250.png"],[[113,84],"assets/images/resized/0001/6159/16159v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}