{"first_name":"Julien","last_name":"Salanon","permalink":"julien-salanon","crunchbase_url":"http://www.crunchbase.com/person/julien-salanon","homepage_url":"http://www.intooch.com","birthplace":"France","twitter_username":"intooch","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1976,"born_month":11,"born_day":10,"tag_list":"","alias_list":null,"created_at":"Mon Jul 25 19:27:28 UTC 2011","updated_at":"Mon Aug 01 22:53:20 UTC 2011","overview":"<p>Julien is the founder and CEO of InTooch, a mobile social connecting application.</p>\n\n<p>Julien has over 12 years of experience in the Internet and Telecommunications industry. His extensive background includes working in a variety of functional areas which makes him well suited to leading the InTooch team.  Julien brings an extensive knowledge of the mobile internet market, as well as a hands-on experience in developing and deploying mobile services.</p>\n\n<p>Before founding InTooch, Julien led the western Europe business of OnePIN, a  Boston-based social address book solution provider. Prior to OnePIN, Julien managed AOL Europe&#8217;s strategic alliances, focusing on mobile initiatives. Before AOL, he was in charge of developing Vivendi-Universal Net&#8217;s SMS applications and gateway business. He also served as Qool.com&#8217;s director of marketing in San Francisco.</p>\n\n<p>Career Highlights</p>\n\n<p>Managed for AOL Europe the launch of AIM on i-mode with Bouygues Telecom, negotiated a reseller agreement with SFR and signed a $20M partnership with Thomson Telecom to launch AOL&#8217;s first triple-play offer in the world.\nDefined the user experience and launched Qool.com, acquired more than 2M users, ranking Qool.com as the 7th fastest growing website in december 2000 according to Nielsen&#8217;s net ratings. Involved in the leadership team to raise $17.5M from major institutional investors.\nJulien started his career as an investment banker at Lehman Brothers and graduated in business management from Europe&#8217;s leading business school, HEC in Paris.</p>","image":null,"degrees":[{"degree_type":"Master","subject":"Business Administration","institution":"HEC","graduated_year":2000,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.linkedin.com/pub/julien-salanon/0/25b/522","title":"LinkedIN"}],"web_presences":[]}