{"first_name":"Julie","last_name":"Larson-Green","permalink":"julie-larson-green","crunchbase_url":"http://www.crunchbase.com/person/julie-larson-green","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 28 06:31:16 UTC 2008","updated_at":"Mon Apr 27 04:14:56 UTC 2009","overview":"<p>As corporate vice president of program management for the Windows Experience at Microsoft, Julie Larson-Green oversees the design for the Microsoft Windows operating system. Her responsibilities include the end-user interaction design and overall experience for the Windows products after the release of Windows Vista, which will be available in 2007. She is responsible for program management, product design, usability and product planning within the engineering organization in the Microsoft Platform and Services Division under President Kevin Johnson.</p>\n\n<p>Larson-Green joined Microsoft in 1993 and has focused on user-interface design throughout her career. As a program manager in Development Tools and Languages, she was responsible for the first releases of Microsoft Visual C++ for 32-bit operating systems, also Microsoft’s first Windows-based development tools. She then assumed the role of development manager, overseeing the team responsible for Microsoft’s first customizable integrated development environment and user experience for the Windows environment. Moving to the Windows team, she led efforts in Internet Explorer 3.0 and 4.0, including features for the Web-integrated Windows desktop.</p>\n\n<p>Continuing her focus on end-user software, in 1997 Larson-Green joined the Office team and led program management for Microsoft Office FrontPage, including the early work in information worker servers. Most recently, she has been responsible for leading the user-interface design for Office XP, Office 2003 and the 2007 Office System, which is being applauded for the innovation and reinvention of the user experience for productivity software.</p>\n\n<p>Prior to Microsoft, Larson-Green held several positions in research and development in a Seattle-based company that developed market-leading desktop publishing software. She holds a master’s degree in software engineering from Seattle University and a bachelor’s degree in business administration from Western Washington University. A native of Washington state, she resides with her husband, a university professor, and her two children.</p>","image":{"available_sizes":[[[150,90],"assets/images/resized/0001/9533/19533v3-max-150x150.jpg"],[[250,150],"assets/images/resized/0001/9533/19533v3-max-250x250.jpg"],[[450,270],"assets/images/resized/0001/9533/19533v3-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.microsoft.com/presspass/exec/julielar/default.mspx\" title=\"Microsoft\" rel=\"nofollow\">Microsoft</a></p>"},"degrees":[{"degree_type":"Software Engineering","subject":"Master's Degree","institution":"Seattle University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"Business Administration","subject":"Bachelor's Degree","institution":"Western Washington University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Corporate Vice President, Windows Experience Program Management","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}