{"first_name":"Julius","last_name":"Goepp","permalink":"julius-goepp","crunchbase_url":"http://www.crunchbase.com/person/julius-goepp","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 14 14:07:40 UTC 2012","updated_at":"Thu Nov 22 04:24:53 UTC 2012","overview":"<p>Julius Goepp MD is a long-time physician with experience in a variety of fields in medicine, healthcare research, public health, and product development. Twenty-three years in active clinical practice at academic medical centers prepared him well for his current work in medical writing and healthcare consulting, with an emphasis on the relationships between healthcare providers and consumers.</p>\n\n<p>A graduate of the Johns Hopkins University, Julius studied abroad for one year at the Hebrew University of Jerusalem, pursuing his curiosity about the land, people, and politics of the historically fraught Middle Eastern countries. After completion of his undergraduate degree, Julius graduated from the University of Maryland School of Medicine, attaining his year’s award for Excellence in Pediatrics. He completed his internship and residency at The Children’s Hospital, Boston, home to Harvard University School of Medicine’s primary pediatric training program. Following a brief mini-sabbatical to conduct medical research in Egypt, Julius returned to Children’s Hospital to complete a Fellowship in Pediatric Emergency Medicine.</p>\n\n<p>Julius Goepp, MD, then pursued a research fellowship in Pediatric Infectious Diseases at Johns Hopkins, where he collaborated in field-testing vaccines for children, before settling on a career in Pediatric Emergency Medicine as a faculty member at Hopkins.</p>\n\n<p>Never laying aside his interest in infectious disease and public health, Julius Goepp became adjunct faculty at the Johns Hopkins School of Hygiene and Public Health, as well as the School of Nursing, where he collaborated with experts in those fields to examine innovative responses to Emergency Department overuse, aiming to improve the primary care experience for those living in poor and underserved communities.</p>\n\n<p>After founding the Pediatric Emergency Medicine fellowship at Johns Hopkins, Julius Goepp went on to lead the Division of Pediatric Emergency Medicine at the University of Rochester, where he contributed to development of an upgraded physical facility and an entirely renovated staff. His research interests expanded into the use of anthropological methods, particularly ethnography, as a means of understanding how and why people use healthcare in the observed patterns.</p>\n\n<p>Julius Goepp has continued to nourish those interests and contribute to the fields of healthcare and innovation in medicine as an inventor, product developer, and consultant to emerging small businesses. He has also consulted with major providers of healthcare education serving industry and governmental sectors. Goepp currently researches and writes about the role of nutrition and nutraceuticals in the prevention and mitigation of age-related chronic diseases, while continuing to offer consulting services to any group or institution in need of his breadth of experience and depth of knowledge.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0022/0368/220368v2-max-150x150.png"],[[250,153],"assets/images/resized/0022/0368/220368v2-max-250x250.png"],[[260,160],"assets/images/resized/0022/0368/220368v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}