{"first_name":"June","last_name":"Sarpong","permalink":"june-sarpong","crunchbase_url":"http://www.crunchbase.com/person/june-sarpong","homepage_url":"http://www.row6.com","birthplace":"London, England","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1977,"born_month":5,"born_day":31,"tag_list":"row6-com--wie-symposium, arianna-huffington, bono","alias_list":null,"created_at":"Sun Apr 03 11:39:56 UTC 2011","updated_at":"Sun Apr 10 23:48:26 UTC 2011","overview":"<p>June Sarpong has had a 12-year career which has already seen her become one of the most recognizable faces of British television, as well as being one of the UK’s most intelligent and dynamic young presenters.  She has also interviewed and introduced some of the world’s biggest names including: Nelson Mandela, HRH Prince of Wales, Gordon Brown, Tony Blair, Bill Clinton, Al Gore, Bono, George Clooney and 50 Cent. In July 2008 Sarpong founded Politics in the City.com, an innovative women’s lifestyle and news Internet site. </p>\n\n<p>Sarpong is an ambassador for the HM Prince Charles&#8217;s charity the Prince&#8217;s Trust and also campaigns for the Make Poverty History movement - she was awarded an MBE (Member of the British Empire) on the Queens 2007 new years honors list for services to broadcasting and charity. Alongside Will Smith she also hosted, Nelson Mandela’s 90th Birthday celebrations in London’s Hyde Park . </p>\n\n<p>June Sarpong is also the Co-Founder of The WIE Symposium (Women, Inspiration &amp;Enterprise) hosted by Arianna Huffington, Donna Karan and former UK first lady Sarah Brown. www.wienetwork.org</p>\n\n<p>In Sept 2011, Sarpong launches Row6.com a multi-platform site to get the world talking through storytelling, </p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0012/8986/128986v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0012/8986/128986v2-max-250x250.jpg"],[[299,450],"assets/images/resized/0012/8986/128986v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}