{"first_name":"Junitsu","last_name":"UCHIKATA","permalink":"junitsu-uchikata","crunchbase_url":"http://www.crunchbase.com/person/junitsu-uchikata","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 14 11:20:39 UTC 2008","updated_at":"Sun Nov 16 18:27:48 UTC 2008","overview":"<p>Junitsu Uchikata joined JAFCO Asia in 1995 and is currently Managing Director(Taiwan). In 2006, he is appointed as a member of the Investment Committee of JAFCO ASIA and is also a member of the board of JAFCO Investment (Asia Pacific) Ltd.</p>\n\n<p>As head of Taiwan, he has the overall responsibility for the coordination of investment activities in Taiwan since 2000. Junitsu is very experienced in local networking, technology investments and has contributed significant value added activities to the portfolio companies via the Taiwan and Japan development strategies, utilizing JAFCO’s extensive corporate and entrepreneurs’ contacts. Under his supervision, JAFCO Asia’s Taiwan office had made several successful IPO including EpiStar, Marketech International, C-Media, Wistron, Phison, System General and Kinik.</p>\n\n<p>Present board membership includes 8 portfolio companies in Taiwan. Under his supervision, JAFCO Asia’s Taiwan office has investment in more than 35 companies out of which more than 10 have been publicly listed or acquired.</p>\n\n<p>Junitsu started his private equity investment career as an investment officer with JAFCO Co., Ltd. in 1985. Prior to heading JAFCO Asia’s Taiwan office in 2000, he was responsible for investments in certain countries in South Asia. During his 20 years experience in private equity, he spent more than 12 years in Asia, including Hong Kong, Indonesia, Singapore and Taiwan. In 1993, he was also engaged in cross-border /domestic M&amp;A advisory business as Director, Asia Global Services Group, Arthur Andersen &amp; Co., Tokyo.</p>\n\n<p>Junitsu was born in Japan. He received his Bachelor of Business and Commerce from Keio University, Japan in 1985. </p>","image":{"available_sizes":[[[108,144],"assets/images/resized/0002/8679/28679v1-max-150x150.jpg"],[[108,144],"assets/images/resized/0002/8679/28679v1-max-250x250.jpg"],[[108,144],"assets/images/resized/0002/8679/28679v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director (Taiwan)","firm":{"name":"JAFCO Asia","permalink":"jafco-asia","type_of_entity":"financial_org","image":{"available_sizes":[[[150,50],"assets/images/resized/0002/8530/28530v2-max-150x150.jpg"],[[229,77],"assets/images/resized/0002/8530/28530v2-max-250x250.jpg"],[[229,77],"assets/images/resized/0002/8530/28530v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}