{"first_name":"Jurgen","last_name":"Scriba","permalink":"jurgen-scriba","crunchbase_url":"http://www.crunchbase.com/person/jurgen-scriba","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 28 20:57:33 UTC 2009","updated_at":"Wed Jan 28 20:57:33 UTC 2009","overview":"<p>If there is any constant in the live of Jurgen Scriba it might be an ongoing oscillation between science, technology and media. An experimental physicist and computer scientist by training, he received a PhD for researching novel semiconductor materials. He went on to a career in science writing being an editor at both rivaling German newsweeklies &#8220;Focus&#8221; and &#8220;Der Spiegel&#8221;.</p>\n\n<p>In 2000, feeling he had written enough stories on other people doing great stuff he co-founded a life science company in Munich (Advalytix AG) in which he served as COO and head of development.</p>\n\n<p>His name is found on international patents raging from micro fluidics and bio-analytical methods to control systems for pipe organs (but that&#8217;s, obviously, another story). After Advalytix was acquired by Olympus Live and Material Science he moved on to yet another life as a visual media artist.</p>\n\n<p>Blurring the line between still and moving pictures he works with image streams assembled from tens of thousands of individual pictures and image maps created from serial photographs. His photography project &#8220;Techscapes&#8221; which explores the emotional side of technology is currently on display in a special exhibition at the Deutsches Museum, Munich.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0003/5121/35121v1-max-150x150.jpg"],[[167,250],"assets/images/resized/0003/5121/35121v1-max-250x250.jpg"],[[240,359],"assets/images/resized/0003/5121/35121v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}