{"first_name":"Justin","last_name":"Hawkins","permalink":"justin-hawkins","crunchbase_url":"http://www.crunchbase.com/person/justin-hawkins","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"ChurchKey Can Co","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Mon May 07 19:35:27 UTC 2012","updated_at":"Mon May 07 19:35:50 UTC 2012","overview":"<p>A passionate designer and fair weather artist from Portland, Justin Hawkins has worked as graphic designer for more than 10 years. With experience at creative Pacific Northwest companies such as Nike, Weiden &amp; Kennedy and Peetkegler, Justin thrives on working with others to make interesting projects or products come to life.</p>\n\n<p>On a mission to discover his passion in life, Justin developed a keen interest in business, branding and marketing. After three years of researching and brainstorming projects that might be worth quitting his job over, he stumbled into the opportunity to create Churchkey Can Co. With the endless opportunities for collaboration and connecting with the community, it was the perfect fit.</p>\n\n<p>Justin has spent almost his entire life in the Pacific Northwest. Originally from Salem, Oregon, Justin attended school in Seattle before settling in Portland where he’s been for the past 10 years. When not enjoying great beer and food at one of the many amazing restaurants in Portland, he can be found exploring the natural wonders of the Pacific Northwest. He makes a point to get out of the city and connect with nature for at least a few hours every weekend.</p>\n\n<p>Most memorable beer experience:\n“Summer backyard BBQ in Portland – playing corn hole, sitting by the bonfire, watching Ghost Busters projected on a sheet and drinking beer my buddies brewed in their garages.”</p>","image":{"available_sizes":[[[150,144],"assets/images/resized/0018/8274/188274v1-max-150x150.jpg"],[[250,241],"assets/images/resized/0018/8274/188274v1-max-250x250.jpg"],[[450,434],"assets/images/resized/0018/8274/188274v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder & Creative Director","firm":{"name":"Churchkey Can Co","permalink":"churchkey-can-co","type_of_entity":"company","image":{"available_sizes":[[[150,83],"assets/images/resized/0018/8259/188259v1-max-150x150.png"],[[205,114],"assets/images/resized/0018/8259/188259v1-max-250x250.png"],[[205,114],"assets/images/resized/0018/8259/188259v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}