{"first_name":"Justin","last_name":"Etzin","permalink":"justin-etzin","crunchbase_url":"http://www.crunchbase.com/person/justin-etzin","homepage_url":"http://www.SeychellesEmbassy.com","birthplace":"Hong Kong","twitter_username":"JustinEtzin","blog_url":"http://www.JustinEtzin.com","blog_feed_url":"http://www.AltitudeLondon.com","affiliation_name":"Unaffiliated","born_year":1978,"born_month":2,"born_day":12,"tag_list":"justin-etzin, the-hon-justin-etzin, seychelles-embassy, altitude-london","alias_list":null,"created_at":"Fri Sep 24 03:36:35 UTC 2010","updated_at":"Fri Oct 08 20:04:14 UTC 2010","overview":"<p>The Honourable Justin Etzin is a leading international entrepreneur in corporate and consumer hospitality as well as residential and commercial boutique construction and development.</p>\n\n<p>The Honourable Justin Etzin (born 12 February 1978 in Hong Kong) is The Consul General of The Seychelles for The United States of America. A leading international entrepreneur in corporate and consumer hospitality as well as residential and commercial boutique construction and development he became a diplomat in November 2009 when he was appointed by The Seychelles Government as The Consul General of The Seychelles for The United States of America.</p>\n\n<p>Best known for designing and developing high-profile entertainment, retail and business venues worldwide including Altitude London which consist of his franchise in the United Kingdom with the Altitude 360 brand, along with The View Studios, The River Room and The MillBank Media Centre. Together the four venues form the largest riverside event complex and largest venue complex in a London skyscraper, Millbank Tower. Altitude 360 was used in May 2008 by The Mayor of London, Boris Johnson for his campaigning and election party. The MillBank Media Centre used in April / May 2010 by Prime Minister David Cameron &amp; The British Conservative Party as their Election campaign headquarters. It was from this venue in Millbank Tower that the Labour party took victory from the Conservatives in 1997 &amp; The Conservatives took office in May 2010. Altitude 360 was also the venue chosen by the UK Government to launch British Tourism Week in 2008, hosted by HRH Prince Charles and then Prime Minister Gordon Brown. The 2012 British Olympic Committee are using the venues for the Olympic Games and the venue was chosen by FIFA to launch the UKs 2018 World Cup bid.</p>\n\n<p>As The Seychelles Consul General Justin Etzin will be promoting trade, assisting companies to invest in the Seychelles in all areas with the first Seychelles Government Forum being held on 21st September 2010 in New York. He also will assist companies to import and export goods and services both inwardly and outwardly. Further to this he has a primary focus to assist in obtaining help and sponsorship for projects in the Seychelles to improve the medical &amp; health facilities that our offered.</p>\n\n<p>Justin Etzin lives between the Seychelles, &amp; the United States. In the Seychelles he is the owner of Seychelles Capital, a privately funded investment and development company. He is also actively involved and manages a self-funded charitable foundation, The Etzin Foundation, which provides special experiences for the terminally ill as well as funds life-saving medical equipment for hospitals that are in need of funding. In the United States of America he works for The Seychelles Government and is The Consul General for The Seychelles to The United States of America, with the Consulate based in New York &amp; Los Angeles.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0010/2931/102931v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0010/2931/102931v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0010/2931/102931v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}