{"first_name":"Justin","last_name":"Brownhill","permalink":"justin-brownhill","crunchbase_url":"http://www.crunchbase.com/person/justin-brownhill","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"The Receivables Exchange","born_year":null,"born_month":null,"born_day":null,"tag_list":"receivables-exchange, new-orleans-exchange, online-trading, working-capital, finance","alias_list":null,"created_at":"Sun Jun 08 03:28:19 UTC 2008","updated_at":"Tue Nov 04 04:01:39 UTC 2008","overview":"<p>Justin Brownhill is an experienced executive and strategic advisor to the capital markets, financial services and software sectors. </p>\n\n<p>Mr. Brownhill serves as the CEO of the New Orleans Exchange, an innovative online Asset-Based Lending exchange which he co-founded in early 2007.  The New Orleans Exchange is America’s first centralized marketplace for providing quick and efficient access to working capital for small and middle market companies, through its initial electronic trading platform The Receivables Exchange.  The Receivables Exchange provides a centralized marketplace for working capital management by connecting companies to a nationwide network of lenders who compete in real time to buy and trade commercial receivables. Based in New Orleans, the New Orleans Exchange is a leader in rebuilding the city&#8217;s economy, and has been recognized nationally by USA Today, Inc. Magazine and Business Week as one of a small group of companies bringing the entrepenurial spirit back to the city.  </p>\n\n<p>He was a Managing Director at Citigroup&#8217;s Corporate and Investment Bank where he was involved with Citigroup&#8217;s Institutional Trading Technology, Market Structure and Exchange Strategy teams. He was also an executive of Lava Trading, a leading global Equities and Foreign Exchange trading technology platform acquired by Citigroup in 2004. </p>\n\n<p>Previously, Brownhill was an investment banker in the Financial Institutions practice at Credit Suisse First Boston, Union Bank of Switzerland and Salomon Brothers where he worked on over $100 billion in M&amp;A transactions, and participated in many of the largest underwritings for his clients in the banking, brokerage and financial technology arena. Brownhill graduated with a Bachelor of Commerce with distinction from the Faculty of Management at the University of Calgary, Canada. He was a swimmer at an international level, and captained his national championship varsity team. He is an active member of the community, most notably as a former executive and Board Member for Minds Matter of NYC Inc., a volunteer organization for disadvantaged inner-city high school students to expand educational horizons. </p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0002/4912/24912v2-max-150x150.jpg"],[[187,250],"assets/images/resized/0002/4912/24912v2-max-250x250.jpg"],[[337,450],"assets/images/resized/0002/4912/24912v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BCOMM","subject":"Management & Finance","institution":"University of Calgary, Canada","graduated_year":1994,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Co-Founder","firm":{"name":"The Receivables Exchange","permalink":"the-receivables-exchange","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0002/6601/26601v2-max-150x150.jpg"],[[150,45],"assets/images/resized/0002/6601/26601v2-max-250x250.jpg"],[[150,45],"assets/images/resized/0002/6601/26601v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}