{"first_name":"Justin","last_name":"Dillon","permalink":"justin-dillon","crunchbase_url":"http://www.crunchbase.com/person/justin-dillon","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Fri Nov 04 19:01:51 UTC 2011","updated_at":"Fri Nov 04 19:01:51 UTC 2011","overview":"<p>Justin Dillon has been a musician all his life. Justin&#8217;s band, Tremolo, was featured on television shows, &#8220;The Mountain&#8221; and &#8220;North Shore,&#8221; as well as a variety of MTV shows including Pimp My Ride, Newlyweds, Bands Reunited, and Dismissed. With the release of their first album, Love Is the Greatest Revenge (2005, Flagship/Universal Records), Tremolo did something unique: they committed to donating fifty percent of the royalties to charities selected by their fans.</p>\n\n<p>Dillon came across the issue of Human Trafficking while touring in Russia. He met scores of girls whose ambition to come to west was being preyed upon by traffickers. During his visit, his interpreter, a young girl, shared with him the many &#8220;opportunities&#8221; that were being offered to her to come to west. Dillon investigated the bogus job opportunities and became incensed at how easy it was to trick them. After sharing with them the dangers of these proposals, he vowed to do something about this issue once he returned home. Upon arriving back in the United States he looked around to find organizations that were addressing the problem and found that they were few, small, and under-funded, but passionate. He immediately started hosting benefit concerts for these organizations in order to support and spread their work. His desire to put on a benefit concert soon grew into a &#8220;rockumentary&#8221; that combined both critically acclaimed artists and social luminaries in the film, CALL+RESPONSE. Justin and the film have been featured on CNN,Today Show, MSNBC, Dr. Phil Show, LA Times, Washington Post, Chicago Sun, Huffington Post, and the Seattle Times along with speaking engagements at the White House, Dept. of State, United Nations Events, Princeton University, Harvard University, and Columbia University.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0016/0884/160884v1-max-150x150.jpg"],[[224,168],"assets/images/resized/0016/0884/160884v1-max-250x250.jpg"],[[224,168],"assets/images/resized/0016/0884/160884v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}