{"first_name":"Just","last_name":"Energy","permalink":"just-energy","crunchbase_url":"http://www.crunchbase.com/person/just-energy","homepage_url":"http://www.justenergy.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Dec 09 08:24:16 UTC 2010","updated_at":"Tue Jan 11 21:10:31 UTC 2011","overview":"<p>Just Energy is a leading independent energy supplier with over 1.6 million electricity and natural gas customer accounts across the US and Canada. We are also the largest competitive green energy retailer in North America. With our green energy solutions, our customers can offset the negative impact their energy consumption has on the environment. \nTogether we&#8217;re making a cleaner, greener world.</p>\n\n<p>Just Energy is proud to provide peace of mind to homes and businesses. \nOur long term, fixed price and price protection programs provide protection from the inherent volatility of natural gas and electricity supply prices.</p>\n\n<p>Just Energy&#8217;s business involves the sale of natural gas and electricity to residential and commercial customers under long-term fixed-price or price-protected contracts (price protected for electricity). Just Energy is part of a group of companies that offer natural gas in Ontario, Manitoba, Alberta, Quebec, British Columbia, New York, Illinois, Indiana, Michigan, Ohio, and California, and electricity in Ontario, Alberta, New York, Massachusetts and Texas. Just Energy is a subsidiary of Just Energy Group Inc. (TSX: JE).</p>\n\n<p>By securing the price for natural gas or electricity under such contracts for a period of up to five years, Just Energy&#8217;s customers reduce or eliminate their exposure to changes in the price of these essential commodities.</p>\n\n<p>We are, and have been for some time, actively developing the launch of our Just Energy brand in the following jurisdictions: Pennsylvania, New Jersey, Connecticut, Maryland, D.C., Rhode Island, Georgia and Delaware.</p>\n\n<p>Click to visit our Website &lt;http://www.justenergy.com/&gt;</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}