{"first_name":"Justin","last_name":"Jarman","permalink":"justin-jarman","crunchbase_url":"http://www.crunchbase.com/person/justin-jarman","homepage_url":"http://www.youbetme.com","birthplace":"United States","twitter_username":"JustinJarman","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1983,"born_month":1,"born_day":2,"tag_list":"","alias_list":null,"created_at":"Tue Nov 22 17:39:34 UTC 2011","updated_at":"Tue May 01 08:27:30 UTC 2012","overview":"<p>While working at Merrill Lynch in the Global Wealth Management division, Mr. Jarman was recruited by Newport Mesa Financial, where he served as the head of loan origination and due diligence for an alternative asset hedge fund. While at Newport Mesa Financial, Mr. Jarman originated over $25M in premium finance loans, and conducted actuarial analysis on over 150 cases, which ultimately led to a zero percent default rate on loans originated. In late 2008, Mr. Jarman helped start up Bold Group, Inc.; a collateral management company for hedge funds, one of which was a Top Ten HSBC Ranked hedge fund with $2.5B in assets. Mr. Jarman served as a Partner and Senior Vice President of Portfolio Operations and serviced over $550M in assets, equating to approximately $65M in net present value. Mr. Jarman also played a key role in the operational due diligence for a client hedge fund, which led to the client securing a $60M bridge loan. </p>\n\n<p>In 2009, Mr. Jarman, along with his partners at Bold Group, Inc. co-founded, Community-Lenders, an internet micro lending company, offering short-term high-interest rate loans, which yielded a 73% annualized return after just 14 months of operation. In 2010, Justin was selected by Cal State Fullerton&#8217;s Mihaylo College for Entrepreneurship as an &#8220;Executive Entrepreneur in Residence&#8221;, where he mentored graduate students in New Ventures and Startup courses. In November 2010, Mr. Jarman left his partnership at Bold Group, Inc. to co-found, Youbetme, a technology based software and gaming company focusing on propositional wagering. Mr. Jarman and his partner successfully secured substantial funding from an angel investor in Silicon Vallley, CA. As the President, Mr. Jarman has identified and recruited the executive management team, oversees the company’s operational components, drafting of provisional patent claims, company finances, and the development of strategic partnerships. </p>\n\n<p>Mr. Jarman holds a Bachelor&#8217;s Degree in Business Economics from the University of Arizona.</p>","image":null,"degrees":[{"degree_type":"Bachelor of Arts","subject":"Business Economics","institution":"University of Arizona","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/justinjarman","title":""},{"external_url":"http://twitter.com/#!/justinjarman","title":""}]}