{"first_name":"K. David","last_name":"Pirnazar","permalink":"k-david-piirnazar","crunchbase_url":"http://www.crunchbase.com/person/k-david-piirnazar","homepage_url":"http://www.samesurf.com","birthplace":"","twitter_username":"samesurf","blog_url":"","blog_feed_url":"","affiliation_name":"samesurf/Actual Worlds","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jul 28 19:30:57 UTC 2011","updated_at":"Mon Sep 12 01:14:32 UTC 2011","overview":"<p>K. David Pirnazar is the Co-Founder and Chief Executive Officer of samesurf/Actual Worlds, Inc. where he is responsible for managing the company&#8217;s technical, business development and ancillary pursuits. samesurf is an emerging leader in the field of instant sharing of online content that was co-founded by CEO K. David Pirnazar and Sapient co-founder Jerry A. Greenberg in January 2009. Its patent-pending technology enables users to simultaneously surf and interact with the same sites together while generating highly targeted traffic for partnered sites. samesurf’s application and browser-based offerings enable every user to interact with online content, customer support personnel and each other in real-time. The technology is tailored to empower multiple users to shop, watch crystal clear videos, browse documents, book travel and surf the web together without requiring installs, plug-ins or downloads.</p>\n\n<p>Mr. Pirnazar was also the Founder and President of Epic Vids, Inc., an interactive publisher that developed branded products with partnered publishers and development studios in the interactive gaming space. In the console arena, Mr. Pirnazar conceived and executive produced console-based video games such as Fear and Respect for Midway Games and Warner Brothers Interactive (PlayStation 3, XBOX 360, PC, Handheld, and Mobile). Within this role, Mr. Pirnazar served as an early entrant into the mobile applications space and was among the first to recruit, negotiate and include in-world ads and product placements within interactive products. Most recently and via Epic Vids, Mr. Pirnazar conceived and developed a Unity-based application for Nike&#8217;s Empire Tested brand.</p>\n\n<p>Within the wireless applications space, Mr. Pirnazar co-founded Zen Interactive, LLC, a wireless games and applications publisher (&#8220;Zen&#8221;). Zen was the publishing arm of Blue Label Interactive, a mobile gaming and application development studio (&#8220;Blue Label&#8221;). At Zen, Mr. Pirnazar developed wireless games, apps and related digital products that incorporated readily identifiable brands such as entertainment and sports personalities. Zen entered into numerous license agreements with prominent partners to create wireless properties such as:  (1) Forrest Gump Ping Pong (with Paramount/Viacom Consumer Products); (2) Fear and Respect featuring Snoop Dogg: The Wireless Game (with Midway Games and Warner Brothers Interactive); (3) DMX Street Bikez (with Def Jam Artist/Actor, DMX and Bloodline Films, LLC); (4) Grease Dance Machine (with Paramount/Viacom Consumer Products); and (5) Frank Shamrock No Rules Fighting (with UFC Champion, Frank Shamrock and MMA Apparel Leader, Tap Out)</p>\n\n<p>Zen was sold to the remaining principals of Blue Label in conjunction with the sale of Blue Label to Konami (NYSE: KNM) in June of 2006.</p>\n\n<p>Mr. Pirnazar also serves as a transactional attorney who has practiced as an associate with Mayer, Brown, Rowe &amp; Mawe and Russ, August &amp; Kabat. He received his B.S. degree in finance and marketing from the University of Southern California, graduating magna cum laude. Mr. Pirnazar received his J.D. from the University of Southern California School of Law and is an active member of the California Bar.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder/Chief Executive Officer/Co-Founder","firm":{"name":"samesurf/Actual Worlds","permalink":"samesurf-actual-worlds","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0014/6754/146754v2-max-150x150.png"],[[250,83],"assets/images/resized/0014/6754/146754v2-max-250x250.png"],[[450,150],"assets/images/resized/0014/6754/146754v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}