{"first_name":"K.","last_name":"Kanthasamy","permalink":"k-kanthasamy","crunchbase_url":"http://www.crunchbase.com/person/k-kanthasamy","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Monetize Media","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Jun 07 09:04:21 UTC 2009","updated_at":"Fri Jun 12 19:12:30 UTC 2009","overview":"<p><em>* Director of Technology</em>*</p>\n\n<p>Kanthasamy brings eighteen years of information technology and software development experience, most recently as a Co-Founder and Managing Partner of .net Technologies Company, a business process automation company specializing in .NET and Java Web services. Prior to that, he worked at InterBase Corporation as a Senior Manager and Chief Software Architect and Designer. Kanthasamy has also served as a Chief Software Architect and Designer with global leaders of enterprise simulation solutions, on their implementation of its scalable cross-platform development frameworks, and Boeing, on the Web system of its fifteen billion dollar Future Combat Systems program in conjunction with the United States Department of Defense. Additionally, he did Project Management for IT Outsourcing in the United Kingdom and taught .NET courses at California State University, Fullerton and the University of California, Irvine. Kuna has obtained developer certifications from both Microsoft and Sun, and he earned his Masters in Computer Science and Bachelors in Software Engineering from the University of London and MBA from London Business School.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Director of Technology","firm":{"name":"Monetize Media","permalink":"monetizemedia","type_of_entity":"company","image":{"available_sizes":[[[150,25],"assets/images/resized/0004/7206/47206v2-max-150x150.png"],[[250,41],"assets/images/resized/0004/7206/47206v2-max-250x250.png"],[[450,75],"assets/images/resized/0004/7206/47206v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}