{"first_name":"Kabren","last_name":"Levinson","permalink":"kabren-levinson","crunchbase_url":"http://www.crunchbase.com/person/kabren-levinson","homepage_url":"http://kabrenlevinson.com","birthplace":"","twitter_username":null,"blog_url":"http://kabrenlevinson.com/blog/","blog_feed_url":"http://www.kabrenlevinson.com/blog/feed/","affiliation_name":"Unaffiliated","born_year":1990,"born_month":1,"born_day":21,"tag_list":"kabren, levinson, kabrenlevinson, podcaster, blogger, technologist, politics, philosophy","alias_list":null,"created_at":"Tue Sep 16 03:51:46 UTC 2008","updated_at":"Tue Nov 13 02:20:59 UTC 2012","overview":"<p>Kabren Levinson is currently a Technologist at Chitika, Inc., an online advertising and data analytics company located in Westborough, Massachusetts, a DJ, and a freelance designer. He has a B.A. in Philosophy from Bard College in Annandale-On-Hudson, New York. At Bard, he studied classics, literature, and philosophy with Thomas Bartscherer, Stephen Melville, Daniel Berthold, and Garry Hagberg. His study at Bard was interdisciplinary; Kabren is preoccupied with truth, identity, technology, music, design, and difference. His study focused primarily on Plato, Socrates, and Nietzsche; his Senior Thesis focused on the role of the philosopher in Plato&#8217;s dialogs.</p>\n\n<p>Kabren has worked in technological, political, artistic, and academic settings. Most recently, he served as Web and Graphic Design Intern and Technology Specialist at Bard College, designing websites for student groups and doing database development and logistics work with Bard&#8217;s Transportation Department. His work experience includes an internship with the Computing Culture group at the MIT Media Lab, a position as a Research Assistant for Chris Csikszentmihalyi, and a fellowship at the Difference and Media Project at Bard College, focusing on Media, Technology, and Programming. In addition, Kabren worked as a Specialist for two years at the Apple Store in Natick, Massachusetts.</p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0002/5134/25134v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0002/5134/25134v2-max-250x250.jpg"],[[450,298],"assets/images/resized/0002/5134/25134v2-max-450x450.jpg"]],"attribution":"<p>Kabren Levinson / <a href=\"http://www.nerdnewsradio.com\" title=\"Nerd News Radio\" rel=\"nofollow\">Nerd News Radio</a></p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/kabren","title":"Twitter"},{"external_url":"http://www.linkedin.com/in/kabren","title":"LinkedIn"},{"external_url":"http://flickr.com/photos/kabren/","title":"Flickr"},{"external_url":"http://kabren.me","title":"Blog"}]}