{"first_name":"Kai","last_name":"Stubbe","permalink":"kai-stubbe-3","crunchbase_url":"http://www.crunchbase.com/person/kai-stubbe-3","homepage_url":"","birthplace":"Bad Honnef, Germany","twitter_username":"KaiStubbe","blog_url":"","blog_feed_url":"","affiliation_name":"Rush49","born_year":1985,"born_month":4,"born_day":4,"tag_list":"career-entrepreneurship-props-igiveprops-props-me-kai-stubbe","alias_list":null,"created_at":"Thu Sep 13 23:45:12 UTC 2012","updated_at":"Wed Sep 19 16:20:00 UTC 2012","overview":"<p>Kai Walter Stubbe (born April 4, 1985) is a German-American entrepreneur and investor. Kai has studied abroad in Germany, Chile, Australia, and the United States and holds a Bachelor of Science in International Finance as well as a Master of Business Administration in Strategy and Finance. Kai’s diverse list of work experiences come from previous employers KPMG Advisory of Frankfurt-Germany in 2007, Mercedes Benz Auto Finance of Beijing-China in 2008, and Cartier of Los Angeles in 2011. Kai then co-founded his first IT company, Rush49, starting his expansive progression into the industry of entrepreneurial business.</p>\n\n<p>During his time in grad school, Stubbe started his own fraternity, Alpha Kai, that accumulated as many as seven-hundred and eighty members at it’s peak. After obtaining his MBA, Stubbe went on to become the sole owner and president of the company TigerBear Holding, an investment vehicle and incubator of his own business ideas. From then on Stubbe founded TradeUp Labs in the beginning of 2012, in which the company has incubated Props, SupperKing, Beathoven, and several other companies in future development. He is also a co-founder of the gaming company Jumpshot Games, and a partnering founder of the fashion label PopMolly.</p>\n\n<p>Birth and Childhood\nKai Walter Stubbe is the son of Hella Stubbe, a teacher and photographer, and Wolfgang Stubbe, a lawyer and lobbyist for the beverage industry, and was born in Bad Honnef, Germany. Stubbe is the only child of an active entrepreneur/business family, in which he gained personal work experience firsthand from his own parents. Stubbe kept himself busy with a broad interest and involvement in sports, such as tennis and golf, and work experience acquired from his parent’s family businesses. He is of German ancestry, and has spent his childhood in Bad Honnef, Germany up until the beginning of his college education.</p>\n\n<p>Education\nKai Stubbe graduated high school from Schloss Hagerhof Gymnasium of Bad Honnef-Germany in 2005, and went on to further his education at the Frankfurt School of Finance and Management for International Finance. From January to July of 2007, Stubbe began his study abroad at the Universidad of Vina Del Mar in Vina Del Mar, Chile, with a desire to gain creative ideas through a culture of diversity. After six months of study in Chile, he continued his educational voyage at Griffith University in Surfer’s Paradise, Australia. Stubbe’s journey did not end here, as his last stop was the city of Los Angeles, California in 2009. Stubbe tried for his Master of Financial Engineering at the University of California, Los Angeles (UCLA), but dropped out after his first class with the new decision to obtain his MBA in Strategy and Finance at Loyola Marymount University, also in Los Angeles. Stubbe’s education came to a successful finish in August of 2012, after graduating from the university. Stubbe credits his travels as a contributing force to his unrestrained knowledge of creative business and arts, as well as his gregarious business approach.</p>\n\n<p>Family Business and Early Work Experience\nKai Stubbe was born right into the business industry through entrepreneurial parents. Stubbe’s family hosted various and multiple business within the beverage and food industry, allowing Kai to take advantage of their business knowledge and developments through observation and hands-on experience. Kai participated in internships within his family companies, and was even required by his parents to work within an assembly line for the business during his summers out of school. Stubbe looks back on these experiences as tough while his other friends enjoyed their time off of school, but beneficial to his future as he learned the true meaning of work from his very own bloodline. Stubbe continued his work experience interning for Public Relation companies during holiday breaks away from school. Stubbe’s family relation to business and entrepreneurship exposed him to business decisions very early in life, revealing to him what he wanted for his own personal education and employment.</p>\n\n<p>Early Employment and Travel\nWhile studying International Business at the Frankfurt school of Finance and Management in Germany, Stubbe worked as a part-time employee for KMPG Advisory in the European Restructuring Unit. His involvement included, but was not limited to, research and pitching of several restructuring deals, maintaining databases, and being a creative and innovative member of his team. This early experience gave Stubbe the opportunity to combine the theoretical knowledge of his studies with hands-on business experiences. </p>\n\n<p>In 2007 through 2008, Stubbe did a Trainee programm with Mercedes Benz Auto Finance China in Beijing, China. He understood the driving power of the asian economy pretty quickly and had several mind changing experiences. Since then, he holds close contact with several people in China and is actively looking for collaborations between the United States and China. </p>\n\n<p>Entrepreneurship\nStubbe is a serial entrepreneur with companies covering Finance, IT, Fashion and Media. He is President of TigerBear Holding GmbH, which is managing his ventures, and also the founder of TradeUp Labs, a hybrid between an investment fund and business incubator. Present day, TradeUp Labs carries eight portfolio companies under its name, with more business concepts in current construction. </p>\n\n<p>Rush49\nWith the help of a fellow classmate and two other business partners, Kai co-founded Trolion Incorporated in the beginning of 2011.Trolion, as an incubator, developed the daily-deal website Rush49, that combined instant deals with location-based services. During his time at Trolion Inc., Kai was involved in business development and product strategy. He left the company in October of 2011 to pursue his own ideas and start implementing his vision for TigerBear Holding. Today, Rush49 is a recognized player in the daily-deal market, with Stubbe as a silent equity holder. </p>\n\n<p>Alpha Kai\nDuring his time at Loyola Marymount University, Kai Stubbe founded his own co-ed fraternity named Alpha Kai. AK was established out of the Ski team of Loyola Marymount, in which Stubbe held an ambassador title. As a result of the coordinated events, business brainstorming sessions within the team, and parties held by the fraternity, Alpha Kai gained over seven-hundred and eighty members at its peak. Following this large number of associates came AK’s own social network including students from Loyola Marymount University (LMU), University of Southern California (USC) and University of California, Los Angeles (UCLA). Although the fraternity found a quick and expansive success, Stubbe found it in his best interest to shut down operations close to graduation in order to focus on his other ventures, and eliminate distractions throughout his last school semester.</p>\n\n<p>TigerBear Holding GmbH\nTigerBear Holding is Stubbe’s investment vehicle, and is managing his investments and equity positions within several different companies. With offices in the Bahamas and Beverly Hills, TigerBear Holding is continuing to support Stubbe’s investments through a close-knit team of business professionals.</p>\n\n<p>TradeUp Labs<br/>\nFounded by Stubbe beginning of 2012, TradeUp Labs is a unique hybrid between an investment fund and a business incubator. TradeUp Labs has eight portfolio companies, as well as its own media house that is creating content in entertainment, fashion and technology. Current and future business investments and developments within TradeUp Labs include PopMolly, JumpShot Games, Props.me, SupperKing, Beathoven, and Modeology. </p>\n\n<p>JumpShot Games, PopMolly, and Props.me\nJumpShot Games was founded in 2012 in Beverly Hills and is developing mobile games. The first game will launch with iOS 6 towards the end of September 2012.</p>\n\n<p>PopMolly, TradeUp’s first fashion development, is an accessory brand, targeting younger demographics through its pivot in lifestyle, bright colors, and fun brand image. PopMolly’s innovative team, consisting of professionals with over twenty years of experience in fashion, management, and sales, has struck a growing response and interest within the European nightlife scene, and has also put forth an inventive line of glow-in-the-dark products. </p>\n\n<p>Props.me, TradeUp Labs’ newest development, is a social commerce that provides users with a chance to showcase who they are through the things they own, while also giving forth the option to buy, sell, trade, and simply share their belongings through a personal online profile of their images. Props.me is climbing the social media world through it’s creative concepts, social networking, and widespread press connections. Props.me’s development serves as a growing process of individual and social relations.</p>\n\n<p>SupperKing, Beathoven, and Modology\nSupperKing, Beathoven, and Modology, all currently in developmental construction, serve as TradeUp Labs’ startups-in-progress. SupperKing is a mobile app, targeted mostly towards students, young socials, and food-fanatics, that provides users with an area to showcase their cooking creations, offer plates/seats at their personal tables for a set price, and vise-versa purchase seats at another’s personal table. Charities can use the app to raise money for their causes, and chefs can use the app to promote their dishes and let users experience their creations on a personal level. </p>\n\n<p>Beathoven, a startup app in the like, is targeted towards music lovers of all genres. Users are able to follow their favorite musician artists, and are given a notification as to when that artist is present in their living area. The concept of Beathoven is to create a mobile database functionality for users to keep to date when their favorite artists are playing in their community, and stay in touch with the happenings and whereabouts of their own personalized musical realm. </p>\n\n<p>Modology, another mobile app, is a social networking platform created for the advantage of individuals within the entertainment world of modeling to connect with other users within the industry. Users are able to communicate, collaborate, and constitute work within their own personal concepts.</p>\n\n<p>While not caught up in the industry of business and creation, Kai Stubbe dedicated his time and effort to athletics such as tennis, golf, Kung-Fu, and ski. Stubbe made the first team of tennis club and held the captain title for four years, playing from age eleven to fifteen. Along with tennis, Stubbe also balanced golf since age thirteen, playing single handicap and spending a lot of time on the course. He credits his golfing years to also giving him a healthy balance between family and school, as he joined his parents frequently on the course to enjoy a mutual enjoyment within the sport. Stubbe continued his activity with a special Kung-Fu training, receiving individual lessons from three different personal trainers residing in Germany and China. He completed his training after obtaining two black belts in the sport. Stubbe is also credited as a passionate and active skier, and also held the title of ambassador of his ski team during his time at the Loyola Marymount University in Los Angeles. Stubbe continues to balance his interests through everyday involvement in sports activities. </p>","image":null,"degrees":[{"degree_type":"","subject":"International Finance","institution":"Frankfurt School of Finance","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"","subject":"International Finance","institution":"Universidad of Vina Del Mar","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"","subject":"International Finance","institution":"Griffith University ","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"Master Bachelor Associate ","subject":"Strategy and Finance","institution":"Loyola Marymount University","graduated_year":2012,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chief Executive Officer","firm":{"name":"TradeUp Labs","permalink":"tradeup-labs","type_of_entity":"company","image":null}},{"is_past":false,"title":"Chief Executive Officer ","firm":{"name":"Rush49","permalink":"rush49","type_of_entity":"company","image":null}},{"is_past":false,"title":"Chief Executive Officer","firm":{"name":"TigerBear Holding GmbH","permalink":"tigerbear-holding-gmbh","type_of_entity":"company","image":null}},{"is_past":false,"title":"Chief Executive Officer","firm":{"name":"PopMolly","permalink":"popmolly","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/KaiStubbe","title":"Twitter"},{"external_url":"http://www.linkedin.com/profile/view?id=29734129&locale=en_US&trk=tyah","title":"LinkedIn"}]}