{"first_name":"Kal","last_name":"Patel","permalink":"kal-patel","crunchbase_url":"http://www.crunchbase.com/person/kal-patel","homepage_url":"http://www.bestbuy.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"BestBuy","born_year":null,"born_month":null,"born_day":null,"tag_list":"bestbuy, best-buy, kal-patel","alias_list":"","created_at":"Mon Sep 14 21:13:49 UTC 2009","updated_at":"Mon Nov 02 12:48:49 UTC 2009","overview":"<p>As executive vice president of emerging business for Best Buy Co., Inc., a multinational retailer of technology and entertainment products and services, Kal Patel leads the company’s efforts to initiate, incubate and implement global growth opportunities while increasing the enterprise’s capabilities for innovation. He also focuses on building relationships with venture capitalists to enable Best Buy to learn from the experiences of others and quickly adapt best practices to advance the company’s business objectives.</p>\n\n<p>Patel joined Best Buy in 2003 as vice president of strategy. In 2005 he was named executive vice president of strategy and international where he played a leading role in exploring and leading the development of growth opportunities in new markets outside North American, including the company’s retail presence in China. In these roles, Patel was also instrumental in helping Best Buy transform into a radically different retailer — one that continually innovates through the insights from employees closest to customers.</p>\n\n<p>Prior to joining Best Buy, Patel was a Partner at Strategos, where he and his colleagues helped frame and implement major growth-driven transformation initiatives for clients across all industries. His clients included Aviva (formerly CGNU), Morgan Stanley, Roche Diagnostics, Whirlpool, Shell, Sonera and Analog Devices. Prior to joining Strategos, Patel worked for KPMG Consulting and Courtaulds PLC in the United Kingdom.</p>\n\n<p>Patel holds an MBA from the London Business School and a BA in chemical engineering from Leeds University.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0005/9740/59740v1-max-150x150.jpg"],[[100,150],"assets/images/resized/0005/9740/59740v1-max-250x250.jpg"],[[100,150],"assets/images/resized/0005/9740/59740v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}