{"first_name":"Kam","last_name":"Habibi","permalink":"kam-habibi","crunchbase_url":"http://www.crunchbase.com/person/kam-habibi","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Sep 21 06:34:33 UTC 2012","updated_at":"Wed Sep 26 20:37:54 UTC 2012","overview":"<p>Kam Habibi has founded and established multiple medical organizations and facilities, also certified by several major medical boards. More specifically, Dr. Habibi practices in chiropractics, but his education and professional career are very versatile. As a medical practitioner of this sort, he has had the ability to found a number of notable facilities. Kam Habibi holds certifications from the National Board of Chiropractic Examiners and one in Manipulation Under Anesthesia. However, his extensive education and diverse expertise have allowed him to do so. </p>\n\n<p>Kam Habibi first studied at Edison Community College, earning an Associate’s degree in 1992. Thereafter, he attended the Life Chiropractic University, finishing in 1996 as a licensed Chiropractic Physician. His coursework continued over the years, including an array of medical subjects. Some areas of his discipline include scoliosis, neurodegenerative disorders, and benign and malignant tumors of the spine. Among many others, all of Dr. Habibi’s academic courses chiefly encompass back and spine related subjects. </p>\n\n<p>1998 was the year Kam Habibi established his first medical practice, in Sunrise, Florida. He founded the Deerfield Beach Medical Center around 2006, and then the Deerfield Beach Outpatient Surgical Center in 20011. His affiliate offices are located throughout Florida, and he even has one in Atlanta, Georgia. Boca Raton, Orlando, Pompano Beach and Port St. Lucie are some of the areas where Dr. Habibi has also established medical facilities and offices. However, Kam Habibi’s professional roles are as diverse as his education. </p>\n\n<p>Kam Habibi is a member of the Florida Chiropractic Association, as well as several other medical organizations. He has served on the advisory board for Iranian Chiropractic Physician Federation and as President from 2005 to 2010. He has even served as a spokesperson for Alabama’s State Departments of Health, Education, Disability and more. Kam Habibi received a Lifetime Achievement Award from the Atlantic Chiropractic Association in 2011. </p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0021/2399/212399v2-max-150x150.png"],[[250,153],"assets/images/resized/0021/2399/212399v2-max-250x250.png"],[[260,160],"assets/images/resized/0021/2399/212399v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}