{"first_name":"Kapil","last_name":"Gupta","permalink":"kapil-gupta","crunchbase_url":"http://www.crunchbase.com/person/kapil-gupta","homepage_url":"http://www.outsourcecompanyservices.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"taxation-advisory-services, advisory-services, financial-services, management-training, recruitment-services, chartered-accountant-services-related-to-accounting, auditing, accounts-outsourcing, company-law-matters","alias_list":null,"created_at":"Thu May 24 07:17:04 UTC 2012","updated_at":"Thu May 24 14:44:54 UTC 2012","overview":"<p>Shella Consultants Business Solutions</p>\n\n<p>Established in the year 2003, Shella Consultants Business Solutions is a professionally managed organization known for offering Financial Accounting, Taxation Advisory, Audit, and Company Formation services. Our end to end solutions related to audits and accounts, payroll management and administration, taxation, company formation and company law have enabled us to cater to the leading corporate houses, SMEs and venture backed companies. </p>\n\n<p>“We are very clear about our objectives and this has enabled us to reach a commanding height in the industry. We emphasize a lot on the highest ethical standards to be maintained in our offices. Special attention is given regarding employment and equal opportunities. We are a member firm of AESC and abide by its laws. Besides, we have our own set of ethics strictly followed by us.” </p>\n\n<p>We are a well known organization engaged in offering financial, auditing, taxation and various other services to our clients. With the help of our financial experts, we are capable of providing Financial Accounting Services, Payroll Outsourcing, Taxation Advisory Services, Company Formation Services, Auditing Assurance Service and Training &amp; Development services. These accurate and efficient services are catered to the leading corporate houses, SME’s and venture backed companies. </p>\n\n<p>Phone : +(91)-(22)-40467600</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}