{"first_name":"Karam","last_name":"Flora","permalink":"karam-flora","crunchbase_url":"http://www.crunchbase.com/person/karam-flora","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1987,"born_month":10,"born_day":27,"tag_list":"","alias_list":null,"created_at":"Mon Oct 22 07:23:44 UTC 2012","updated_at":"Sat Nov 03 22:30:45 UTC 2012","overview":"<p>Karam Flora has six years of experience in corporate &amp; high tech marketing communications. He has extensive experience in strategizing, planning and implementing global social media and E - Marketing campaigns, having worked across Internet/e-commerce, telecommunications, technology, security, mobile /wireless and corporate clients. Karam has in-depth understanding of various sectors — Mobile apps, technology, List management, Webinar management, travel and ecommerce. He has vast knowledge of running global programmes for brands. Karam combines core expertise in creative socialweb strategy, planning, E Marketing expertise, client services and business development with a knack for seeing the bigger picture to help clients leverage opportunity into new levels of business success.</p>\n\n<p>In his current role, he is responsible for Conceptualizing and Ideating Creative Solutions for Brands with socialweb solutions. At Yippee his focus is to expand and overlook the Channel Sales and international exposure to Yippee .Prior to joining Yippee, Karam worked with Tangence and Wirkle as Social Media manager and Manager strategic alliance respectively. He managed the diverse range of clients Adobe, Macrovision, GE, Microsoft, Yasmo live, RS component, HP, MoneyGram, Marketo, Ecosign, Accuweather, Sybase, Blog TV, IBM, Anritsu, Pitney Bowes and many more. Karam holds a Bachelor of Commerce degree from Delhi University.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}