{"first_name":"karen","last_name":"Dempsey Carney","permalink":"karen-dempsey-carney","crunchbase_url":"http://www.crunchbase.com/person/karen-dempsey-carney","homepage_url":"http://www.alliancerelo.com","birthplace":"Glens Falls, NY","twitter_username":"NavyYardFan","blog_url":"http://www.alliancerelo.com","blog_feed_url":"http://www.alliancerelo.com","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"real-estate-boston, real-estate-charlestown, real-estate-navy-yard, relocation-boston, relocation-massachusetts","alias_list":null,"created_at":"Thu Nov 01 11:11:15 UTC 2012","updated_at":"Sun Nov 04 01:15:29 UTC 2012","overview":"<p>Karen is the owner-broker of Alliance Relocation a residential real estate company.  Karen has been helping clients successfully relocate from all over the world to communities throughout the Greater Boston area.  Karen also represents buyers and sellers of exclusive homes.</p>\n\n<p>Karen’s prior work experience includes; Citizens Bank where she was an account executive specializing in residential lending and Karen was a top-producing real estate agent with the Boston Office of Hunneman Coldwell Banker where she started working with relocation clients.</p>\n\n<p>Karen is a graduate of Boston University. She currently serves as a board member with the Friends of the Charlestown Navy Yard and has held prior board positions to include; The Town of Winchester Personnel Board, The Downtown Women’s Club, The Woman Business Founders  and has served on homeowner association boards.</p>\n\n<p>Karen supports a number of charities and is especially \npassionate about The Friends of Boston’s Homeless, BUILD in Boston which provides under-served young people with educational resources and the Massachusetts Commission for the Blind.  Karen has been certified as a level 1 professional ski instructor and has been a volunteer with the Vermont Adaptive Ski &amp; Sports program and Maine Handicapped Skiing.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0021/8259/218259v2-max-150x150.jpg"],[[240,240],"assets/images/resized/0021/8259/218259v2-max-250x250.jpg"],[[240,240],"assets/images/resized/0021/8259/218259v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}