{"first_name":"Karei Spa","last_name":"Karei Spa","permalink":"karei-spa-karei-spa","crunchbase_url":"http://www.crunchbase.com/person/karei-spa-karei-spa","homepage_url":"http://m-tri-r.com/karei/","birthplace":"Philippines","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1980,"born_month":1,"born_day":20,"tag_list":"karei-spa, spa-price-list, full-body-spa, whole-body-spa","alias_list":null,"created_at":"Mon Jan 17 15:48:55 UTC 2011","updated_at":"Tue Jan 25 03:42:05 UTC 2011","overview":"<p>An oasis of health and wellness awaits you at Karei Facial Care Centre &amp; Spa &amp; Wellness Hub!</p>\n\n<p>While close to everything, you’ll feel miles away when you escape to this urban retreat.</p>\n\n<p>Mock created a calming environment suggestive of Asian minimalism with a true Filipino flare by incorporating elements of water, earth, fire and air. Renewable and eco-friendly resources such as bamboo, recycled glass panels and low voc paint.    Our commitment to a healthy environment extends to our decision in using only recycled paper products, cups made from corn and plates fashioned from sugar cane while cleaning with eco-friendly and bio-degradable products. Recycling receptacles are provided throughout spa and we offer a product-packaging recycling discount program.</p>\n\n<p>The airy treatment rooms are gently illuminated by candlelight while the expansive relaxation atrium and outside terrace features waterfalls, providing a tranquil oasis for guests to enjoy either before or after treatments.</p>\n\n<p>Our team of treatment providers is dedicated to meeting each guest’s goals for health and wellness by working synergistically with the body’s recuperative abilities. We source the highest quality, fair-trade ingredients including organic essential oils, nut-free massage oils and our skin care line offers active ingredients based on natural botanicals while remaining free of sulfates, parabens and petro-chemicals.</p>\n\n<p>To ensure your day with us is a memorable one, our guest service associates happily provide 5-star customer service beginning with your initial telephone call, providing information on our treatments and booking your reservation; to being readily available to assist you while onsite.</p>\n\n<p>Monthly treatment promotions and special events offer guests new and creative treatments to experience while making these affordable to everyone.</p>","image":{"available_sizes":[[[150,45],"assets/images/resized/0011/7642/117642v2-max-150x150.jpg"],[[250,76],"assets/images/resized/0011/7642/117642v2-max-250x250.jpg"],[[450,137],"assets/images/resized/0011/7642/117642v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}