{"first_name":"Karen","last_name":"Guiden","permalink":"karen-guiden","crunchbase_url":"http://www.crunchbase.com/person/karen-guiden","homepage_url":"http://www.nosalpartners.com","birthplace":"Chicagoland area","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 12 19:19:53 UTC 2011","updated_at":"Tue Jul 12 19:44:38 UTC 2011","overview":"<p>Karen Guiden is Head of Global Research at Nosal Partners LLC, where she is responsible for research to support all aspects of the Executive Leadership Solutions™ process, including candidate identification, business development, and market intelligence.  Ms. Guiden is also in charge of maintaining the firm’s database.   Her industry expertise includes advanced technology, telecommunications, financial services, consumer products, professional services, and healthcare.</p>\n\n<p>Ms. Guiden was previously a consultant to The Waterman Group, during which time she provided research to support business development and candidate identification.  Before joining The Waterman Group, Ms. Guiden spent more than five years in various research and administrative roles with Highland Partners (formerly TMP Worldwide Executive Search), supporting consultants throughout North America. </p>\n\n<p>Prior to her tenure at Highland Partners, Ms. Guiden worked in the human resources department of Peoplesoft, where she conducted executive-level search assignments on behalf of the company’s marketing, sales, administrative, information technology, and product development organizations.  In addition, Ms. Guiden gathered competitive intelligence and partnered with recruiters in research development within the company’s worldwide recruiting unit.</p>\n\n<p>Earlier in her career, Ms. Guiden worked in the San Francisco office of Korn/Ferry International, where she provided consultants with critical research to support search engagements and business development activities.</p>\n\n<p>She is a member of the Bay Area Recruiters Association, Society for Human Resource Management, and Women in Technology International (WITI). </p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0014/3839/143839v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0014/3839/143839v2-max-250x250.jpg"],[[299,450],"assets/images/resized/0014/3839/143839v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.S.","subject":"Organization Management","institution":"Calumet College","graduated_year":1998,"graduated_month":null,"graduated_day":null},{"degree_type":"M.B.A.","subject":"Technology Management","institution":"University of Phoenix","graduated_year":2002,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/karen-guiden/2/491/11","title":""}]}