{"first_name":"Karl","last_name":"Maier","permalink":"karl-maier","crunchbase_url":"http://www.crunchbase.com/person/karl-maier","homepage_url":"http://www.google.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Market Force Information","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Feb 27 14:42:35 UTC 2010","updated_at":"Wed Aug 15 21:38:08 UTC 2012","overview":"<p>Karl Maier is responsible for the overall leadership and direction of Market Force Information, including all aspects of strategy and execution. In recognition of Market Force Information’s success and his outstanding leadership, Mr. Maier was honored as an Ernst &amp; Young Entrepreneur Of The Year® 2008 award winner in the Rocky Mountain region. Prior to founding Market Force Information, Mr. Maier was the Executive Chairman of the Board of Vector ESP, a provider of professional Information Technology services that was ultimately acquired by MTM Technologies, Inc., a publicly-traded IT services firm. Before Vector, Mr. Maier was the Chief Executive Officer of VIA NET.WORKS, a public international Internet service provider. He was recruited by the Board of Directors and successfully led the company’s turn-around. Prior to VIA, Mr. Maier was the President &amp; CEO of Cordillera Communications, Corp., a Latin American wireless service provider that was acquired by Nextel International. Prior to Cordillera, Mr. Maier worked in Germany serving as Vice President of Freyberg Hambros, a Frankfurt-based investment banking boutique, and as CFO of Berlin Kosmetik GmbH, a cosmetics manufacturer in Berlin. Previously, he was an Assistant Vice President at the Bank of Boston. He received a B.A. from Bowdoin College.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder, CEO","firm":{"name":"Market Force Information","permalink":"market-force-information","type_of_entity":"company","image":{"available_sizes":[[[150,85],"assets/images/resized/0007/8134/78134v2-max-150x150.png"],[[164,94],"assets/images/resized/0007/8134/78134v2-max-250x250.png"],[[164,94],"assets/images/resized/0007/8134/78134v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}