{"first_name":"Karl","last_name":"Robb","permalink":"karl-robb","crunchbase_url":"http://www.crunchbase.com/person/karl-robb","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri May 08 13:34:58 UTC 2009","updated_at":"Thu May 21 07:10:45 UTC 2009","overview":"<p>Mr. Robb is a 23-year Global Software Engineering Industry veteran, having worked 9 years in Western Europe, 9 in the USA and 5 in Eastern Europe. In March of 2004, Fathom Technology, a Hungarian software development outsourcing firm, where Mr. Robb was a co-founder and CEO, merged with EPAM Systems, whereupon Mr. Robb became Executive VP, Global Operations, and a member of the Board of Directors, of EPAM.</p>\n\n<p>Prior to co-founding Fathom Technology he was Vice-President, Software and E-Business, for Softtek, in Atlanta, GA, an outsourcing company in which Ernst &amp; Young was the largest shareholder with over 2,200 employees. In 1993 Mr. Robb co-founded Mobile Computing Systems, a Bay-Area Mobile Enterprise Development Platform and Vertical Applications provider in the US, UK and Italy, which was successfully listed and eventually acquired by the Malaysian Telecom operator. Previously he served as President of Victor Distribution A.B., a $30 million provider of specialized hardware and software solutions, covering 12 countries in Europe, North America, The Middle East and Asia. Subsequently he was promoted to VP Business Development of the $320 million parent company, Victor Tandy Europe AB (Sweden). He started his career in 1982 with the global solutions provider ICL, spending 7 years in the UK, Belgium and Sweden in a variety of roles in sales, product management and marketing of ERP solutions and also managing business with EU Governmental Institutions. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President of EU Operations, Executive Vice President","firm":{"name":"EPAM Systems","permalink":"epam-systems","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0004/3324/43324v2-max-150x150.png"],[[162,65],"assets/images/resized/0004/3324/43324v2-max-250x250.png"],[[162,65],"assets/images/resized/0004/3324/43324v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}