{"first_name":"Katelynd","last_name":"Kuhar","permalink":"katelynd-kuhar","crunchbase_url":"http://www.crunchbase.com/person/katelynd-kuhar","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"The Radio Station","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Oct 22 12:54:25 UTC 2012","updated_at":"Fri Nov 30 23:45:51 UTC 2012","overview":"<p>Hailing from Mississauga, Ontario, Katelynd relocated to Montreal, Quebec in 2008. With a background in theatre and acting, all areas of production and project development intrigue her. Her work with different organizations has provided her with a diverse skill-set that compliments her contributions to a variety of projects.</p>\n\n<p>As a producer and co-host on the first comedy show of the station’s lineup, Insert Radio Here, she entered The Radio Station community. One evening at a TRS meeting with Patrick Lortie and Reese Turner, the group had an epiphany about the company and now there’s nowhere to go but up! With a strong focus on creating a solid foundation for exponential growth within the team and within the community, she is always open to forming new strategic partnerships.</p>\n\n<p>Outside of The Radio Station, she is working on the development of a comedy television series and a cartoon series. She is also working with Montreal’s Animaze Animation Film Festival as it plans for the second year’s events. She also enjoys painting and writing, living with the belief that there are no limits to how we tell our stories and connect to one another.\n“Essentially, my ultimate goal is to collaborate with passionate and professional artists to turn ideas into actions. I love to be a part of the process of project development, and to assist in materializing and manifesting conditions to make the impossible INDEED possible!”</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Vice-President of Marketing","firm":{"name":"The Radio Station","permalink":"the-radio-station","type_of_entity":"company","image":{"available_sizes":[[[150,112],"assets/images/resized/0021/6605/216605v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0021/6605/216605v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0021/6605/216605v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}