{"first_name":"Kate","last_name":"Freeman Vet","permalink":"kate-freeman-vet","crunchbase_url":"http://www.crunchbase.com/person/kate-freeman-vet","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1976,"born_month":12,"born_day":18,"tag_list":"","alias_list":null,"created_at":"Wed Jul 18 15:40:50 UTC 2012","updated_at":"Thu Jul 19 09:49:39 UTC 2012","overview":"<p>In the realm of veterinary science, few are as dedicated and passionate as Kate Freeman. Since receiving her DVM from North Carolina State University, she has helped change the veterinary world for the better. She has initiated several studies and research projects, as well as taken part in even more. She has authored many scholarly papers on these topics and is considered a positive force in animal health science.\nFrom the moment she earned her degree, she has been hard at work. For Kate Freeman, her job extends past office hours and on-call hours. She considers herself a veterinarian at all hours of the day. She works with many animal rescues and shelters, even fostering many of the dogs herself. She supports and organizes community animal health events. Typically they are oriented around spaying and neutering pets. These programs are intended to provide services to families who can’t otherwise afford pet health care.\nThe exciting world of veterinary work has brought Kate Freeman to a myriad of interesting locations. Each of these places has introduced her to a new challenge, one she was ready and willing to accept. She has provided care to so many different animals, very little surprises her anymore. She has worked on raptors and seabirds, as well as mountain lions, wolves and sea turtles. She agrees that pets are our best friends, but also thinks wild animals need just as much attention and care. The time and effort she has given to this sort of medicine is extraordinary.\nIt’s no easy feat to become a veterinarian, but animal lover Kate Freeman has taken the job to new heights. Her dedication and spirit are unrivaled and prove just how successful and amazing a career in veterinary work can be. Kate Freeman is an inspiration to animal lovers and a beacon of quality animal care.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}