{"first_name":"Kathy","last_name":"Walker","permalink":"kathy-walker","crunchbase_url":"http://www.crunchbase.com/person/kathy-walker","homepage_url":"http://www.openairep.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Oct 13 15:19:57 UTC 2011","updated_at":"Sun Oct 30 22:59:11 UTC 2011","overview":"<p>Kathy is considered one of the top mobile network experts in the United States, and is a sought-after technology strategist and respected telecom veteran.  Kathy is one of an elite group of communications veterans who holds dual expertise in both the wireless and facility-based network realm, making her an invaluable resource to innovators and forward-thinkers who operate in that cross-over world.  Prior to joining OpenAir, Kathy served as Chief Network Officer for Sprint Nextel, a role in which she led the overall planning, design, and operations of Sprint Nextel’s wireless (CDMA and iDEN) and wireline (IP) networks. Among Kathy’s accomplishments:\n •Led the development and deployment of the first U.S. nationwide 3G wireless network\n•Nearly 30 years of carrier and wireless experience, most recently in the dual role of CIO and CNO (Chief Network Officer) of Sprint Nextel\n•Directed the planning, development and operation of Sprint’s wireline and wireless (CDMA and iDEN) networks, responsible for more than $10B  in annual capital and expense investments\n•Named to the first-ever prestigious Fierce Wireless &#8220;Top Women in Wireless&#8221; list  </p>\n\n<p>Additional Experience</p>\n\n<p>Kathy is an expert technology strategist and respected telecom operator, and has held extremely diverse responsibilities including planning and operating  complementary wireline and wireless networks, developing new data products , and managing large-scale integration projects in the IT and network worlds.</p>\n\n<p>Kathy is known for her ability to recognize talent and potential in the corporate and entrepreneurial space. She distinguished her organization&#8217;s capabilities by building national programs to promote recruitment, training and retention of technology talent.  When implemented, these programs were essential components of Sprint&#8217;s ability to develop and operate world class networks. Today that talent is distributed across numerous companies in the wireless and communications sectors.  Kathy actively maintains many of those contacts, and continues to grow her network of talented professionals, with a goal of engaging with and supporting them in fostering innovation and growth in the mobile and communications space. </p>\n\n<p>Kathy holds a bachelor’s degree in civil engineering from South Dakota State University and a master’s in science and professional engineering from Missouri S&amp;T, where she is a member of the school’s Women in Science &amp; Engineering Hall of Fame. She serves on the Trustees&#8217; Council for both schools. Kathy and her husband reside in Kansas City.</p>","image":{"available_sizes":[[[77,100],"assets/images/resized/0015/7983/157983v2-max-150x150.jpg"],[[77,100],"assets/images/resized/0015/7983/157983v2-max-250x250.jpg"],[[77,100],"assets/images/resized/0015/7983/157983v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}