{"first_name":"Katherine","last_name":"Hays","permalink":"katherine-hays","crunchbase_url":"http://www.crunchbase.com/person/katherine-hays","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jul 24 09:51:44 UTC 2009","updated_at":"Fri Jul 24 09:55:03 UTC 2009","overview":"<p>Katherine joined GenArts as CEO in June 2008. Prior to GenArts, Katherine was the co-founder and Chief Operating Officer of Massive Incorporated, creator and operator of the world’s first video game advertising network. In May 2006, Katherine led Massive’s sale to Microsoft Corp., where she then served for two years as a Senior Director for Microsoft and COO of Massive, and helped lead the post-acquisition integration. Katherine is the co-inventor and author of two technical patents relating to Massive’s real-time advertising solution. Katherine began her career in general management and finance specific to the media industry. She is a former equity research analyst with Goldman Sachs, where she covered global media companies, including AOL Time Warner, Disney, News Corp. and Vivendi Universal. She also headed the firm&#8217;s digital and interactive media team. Katherine worked in investment banking with Salomon Smith Barney in the firm’s media and communications practice prior to her time at Goldman. She graduated with honors from Princeton University with a degree in Art and Archaeology, and holds an MBA from The Harvard Business School.</p>\n\n<p>Katherine serves as a Board Member and Trustee for the George Eastman House, International Museum of Photography and Film, and serves on the Board of the American and international Friends of the Louvre, for the Musee du Louvre.</p>","image":{"available_sizes":[[[135,136],"assets/images/resized/0005/4135/54135v1-max-150x150.png"],[[135,136],"assets/images/resized/0005/4135/54135v1-max-250x250.png"],[[135,136],"assets/images/resized/0005/4135/54135v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"GenArts","permalink":"genarts","type_of_entity":"company","image":{"available_sizes":[[[150,19],"assets/images/resized/0002/2293/22293v6-max-150x150.jpg"],[[250,32],"assets/images/resized/0002/2293/22293v6-max-250x250.jpg"],[[450,58],"assets/images/resized/0002/2293/22293v6-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}