{"first_name":"Kathryne","last_name":"Carr","permalink":"kathryne-carr","crunchbase_url":"http://www.crunchbase.com/person/kathryne-carr","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon May 18 14:30:21 UTC 2009","updated_at":"Mon May 18 14:30:59 UTC 2009","overview":"<p>Prior to her association with Tall Oaks Capital, Kathryne co-founded Whetstone Partners, LLC in 1996 to help fund and grow new businesses in the healthcare sector. Whetstone Partners&#8217; clients included a number of seed and early stage companies that originated in several academic research institutions.  Whetstone also managed Platform Technology Holdings, an investor in several medical device companies, including SmartPill Diagnostics and Minrad International (AMEX: BUF).</p>\n\n<p>Ms. Carr has held several executive and managerial positions, including Vice President of Operations for Insmed Pharmaceuticals, Project Manager for Innotage Management, an investment management firm for healthcare start-up companies, and Director of Investor and Public Relations for Genetic Systems Corporation, before its acquisition by Bristol Myers. In addition, Ms. Carr was a Technical Staff member at MITRE Corporation and a Market Analyst for the Marketing Corporation of America.</p>\n\n<p>Her portfolio responsibilities include Aldagen, Biolex and MaxCyte. She is a member of the Board of Directors for SEBIO, the University of Virginia Patents Foundation and for the UVa-Coulter Foundation Translational Research Program.  Kathryne is a graduate of Allegheny College with BA in Political Science in addition to graduate studies in finance at American University.</p>","image":{"available_sizes":[[[120,100],"assets/images/resized/0004/4447/44447v1-max-150x150.jpg"],[[120,100],"assets/images/resized/0004/4447/44447v1-max-250x250.jpg"],[[120,100],"assets/images/resized/0004/4447/44447v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Tall Oaks Capital Partners","permalink":"tall-oaks-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,48],"assets/images/resized/0004/4446/44446v1-max-150x150.jpg"],[[224,72],"assets/images/resized/0004/4446/44446v1-max-250x250.jpg"],[[224,72],"assets/images/resized/0004/4446/44446v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}