{"first_name":"Kathleen","last_name":"Avery","permalink":"kathleen-avery","crunchbase_url":"http://www.crunchbase.com/person/kathleen-avery","homepage_url":"http://www.thepacheragroup.com","birthplace":"Ohio","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jul 13 00:22:01 UTC 2011","updated_at":"Wed Jul 13 17:31:40 UTC 2011","overview":"<p>Specialties\nRecruiting top talent focused on the technology sector.</p>\n\n<p>Extensive experience in providing executive and senior level search and consulting resources to technology-driven companies. Co-founded first company, a technical consulting firm, at 23.</p>\n\n<p>After the sale of this firm, founded The Avery Group, an executive search firm providing search resources to start-ups and rapidly-growing companies in the technology space.. Also launched a consulting division which she grew to a staff of 160 and sold to NASDEQ-listed company. Following this acquisition became an angel investor.</p>\n\n<p>Opened an art gallery specializing in Modern works (1900-1960) with particular emphasis on the School of Paris. She did most of her buying in Europe, and established the business as an important resource for the serious collector. She continues to see clients interested in art of this period.</p>\n\n<p>Has since returned to the executive search world, and is truly passionate about helping her clients grow amazing teams, from CxO, VP and Director-level positions to critical senior-level contributor talent. With the depth of understanding that comes from being a serial entrepreneur, and as a self-described start-up junkie, she is helping to build rock star teams for fascinating and &#8220;best of the best&#8221; client firms.</p>","image":{"available_sizes":[[[108,150],"assets/images/resized/0014/3890/143890v2-max-150x150.jpg"],[[181,250],"assets/images/resized/0014/3890/143890v2-max-250x250.jpg"],[[326,450],"assets/images/resized/0014/3890/143890v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}