{"first_name":"Kathleen","last_name":"Parker","permalink":"kathleen-parker","crunchbase_url":"http://www.crunchbase.com/person/kathleen-parker","homepage_url":"http://www.dailydac.com/","birthplace":"Chicago","twitter_username":"dailydac","blog_url":"http://www.dailydac.com/","blog_feed_url":"http://www.dailydac.com/","affiliation_name":"DailyDAC","born_year":1980,"born_month":5,"born_day":7,"tag_list":"deal-acquisition, buying-distressed-assets, buying-distressed-businesses, distressed-assets, distressed-businesses","alias_list":null,"created_at":"Thu Apr 19 13:41:02 UTC 2012","updated_at":"Tue Apr 24 22:25:24 UTC 2012","overview":"<p>DailyDAC serves as: DEAL ACQUISITION CENTRAL AND DEAL MAKER&#8217;S ANALYSIS AND COMMENTARY</p>\n\n<p>What we do: DailyDAC is a subscription-based deal aggregator focused on lower middle market, time sensitive situations.  DailyDAC provides subscribers with opportunities to purchase or provide capital to non-public companies and/or their assets.  </p>\n\n<p>DailyDAC&#8217;s Interactive Deal Database is where our deal flow is housed. Through a premium membership, our investors are able to see over 100+ active lower and middle market deal opportunities at any given time.  Premium membership is granted by visiting www.dailydac.com</p>\n\n<p>DailyDAC also offers a free version of our deal flow.  Through a weekly E-Newsletter, DailyDAC provides a non-actionable version of our deal flow giving readers a flavor for the deals housed on our Interactive Deal Database. For access to this free version of deal flow, go to www.dailydac.com to be added to the distribution list.<br/>\nSelling a company or select assets?  List it with DailyDAC.  DailyDACprovides the opportunity for professionals to list their sell-side engagements on our Interactive Deal Database AND our E-Newsletter, for FREE. DailyDACdoes not charge a commission or finder&#8217;s fee for deals closed from DailyDAC.  Our members are active investors subscribing to see deal flow. </p>\n\n<p>DailyDAC also provides Deal Maker&#8217;s Analysis of Commentary. Located on our website you will find DailyDAC&#8217;s suggested websites, blogs, books and DailyDAC Authored Content and Material about various topics including: Family Office, Venture Capital Investing, Private Equity, Estate Planning &amp; Asset Protection Strategices, Distressed Investing, Education for the Entrepreneur, M&amp;A 101, Bankruptcy 101, Finance and Accounting and Selling a Business?    </p>\n\n<p>DailyDAC also engages in Strategic Auction Firm Partnerships andDistressed Commerical Real Estate Partnerships. Other advertising opportunities are also available.  For more information please contact info@dailydac.com</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0018/5031/185031v2-max-150x150.jpg"],[[184,184],"assets/images/resized/0018/5031/185031v2-max-250x250.jpg"],[[184,184],"assets/images/resized/0018/5031/185031v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Director of Operations","firm":{"name":"DailyDAC","permalink":"dailydac","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.dailydac.com/","title":"www.dailydac.com"},{"external_url":"http://www.dailydac.com/blog/","title":"/www.dailydac.com/blog/"}]}