{"first_name":"Kea","last_name":"Tolbert-Thien","permalink":"kea-tolbert-thien","crunchbase_url":"http://www.crunchbase.com/person/kea-tolbert-thien","homepage_url":"http://www.tobabywithlove.com","birthplace":"Los Angeles,CA","twitter_username":"Tobabywithlove1","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1986,"born_month":1,"born_day":10,"tag_list":"to-baby-with-love, baby-love-boxes, childrens-consignment-los-angeles, used-baby-clothing-los-angeles, childrens-resale-los-angeles, childrens-buy-sell-and-trade-los-angeles, boxes-of-used-baby-clothes","alias_list":null,"created_at":"Wed Apr 20 22:21:21 UTC 2011","updated_at":"Mon Apr 25 01:15:54 UTC 2011","overview":"<p>To Baby With Love is a full service Children&#8217;s Consignment and Resale one stop shop! We have created a simple, fun, efficient, and convenient process for parents to sell their various items with other families seeking to buy at low affordable prices!! Our buy, sell, and trade option allows us to continuously give back by serving our families in need!</p>\n\n<p>Now offering The Baby Love Boxes! To Baby With Love is now offering and introducing our Baby Love Boxes, consisting of 60 pieces of clothing for $29.95. After your child grows out of their box of clothing, it to us , and we&#8217;ll send you your next set of clothing. We are the one and only children&#8217;s clothing and packaging swap in the Los Angeles area.  Our customers send us their unwanted children&#8217;s clothes and accessories in exchange of trading and/or purchasing our Baby Love Boxes containing a bigger size to accommodate that growing child.  Customers can call, or email and we will be happy to customize, send our standard box, or answer any questions.</p>\n\n<p>We always provide customers with fresh new, clean, and barely used options for an extremely affordable price. </p>","image":{"available_sizes":[[[150,86],"assets/images/resized/0013/1398/131398v2-max-150x150.jpg"],[[250,144],"assets/images/resized/0013/1398/131398v2-max-250x250.jpg"],[[450,260],"assets/images/resized/0013/1398/131398v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.tobabywithlove.com","title":"To Baby With Love Official Website"},{"external_url":"http://www.twitter.com/tobabywithlove1","title":"Twitter Page"},{"external_url":"http://www.facebook.com/tobabywithlove","title":"Facebook Page"}]}