{"first_name":"Keith","last_name":"M. Gottesdiener","permalink":"keith-m-gottesdiener","crunchbase_url":"http://www.crunchbase.com/person/keith-m-gottesdiener","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Nov 10 04:16:04 UTC 2011","updated_at":"Wed Nov 28 03:47:43 UTC 2012","overview":"<p>Dr. Keith M. Gottesdiener is Chief Executive Officer of Rhythm. He joined Rhythm after 16 years at Merck Research Laboratories. Dr. Gottesdiener joined Merck early clinical development in 1995, helping to transition compounds from the bench to the bedside and through to proof of concept. He held positions of increasing responsibility, eventually leading the early clinical development/clinical pharmacology department at Merck from 2001 through early 2006. From 2006-2011, he was a leader of Merck&#8217;s late clinical development organization, first overseeing the development of Merck&#8217;s infectious diseases and vaccine products through pivotal trials, registration, and life cycle management, including Gardasil™ (HPV Vaccine), Rotateq™ (rotavirus vaccine), Zostavax™ (zoster vaccine) and Isentress™ (HIV integrase inhibitor), among others. In 2008, Dr. Gottesdiener was appointed Late Stage Therapeutic Group Leader, and in that role led the late-stage clinical development efforts of Merck across all therapeutic areas. After the merger with Schering Plough in 2009, he continued as co-head of late development, most recently playing a leading role in the regulatory activities leading to the approval of boceprevir for Hepatitis C. Dr. Gottesdiener received his BA from Harvard College and his MD from the University of Pennsylvania. He completed his residency and fellowship at the Brigham and Women&#8217;s Hospital-Beth Israel Medical Center-Dana Farber Cancer Institute Children&#8217;s Hospital programs. After his fellowship, Dr. Gottesdiener did postdoctoral research in the laboratory of Dr. Jack Strominger at Dana Farber Cancer Institute working on the molecular immunology of the T-cell receptor. In 1986, he joined the faculty as an assistant professor at Columbia University, started an independent research laboratory with NIH RO-1 funding, focusing on gene transcription, and was Associate Clinical Professor of Medicine at the time he left to join Merck in 1995.</p>","image":null,"degrees":[{"degree_type":"MD","subject":"","institution":"University of Pennsylvania","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Rhythm Pharmaceuticals","permalink":"rhythm-pharmaceuticals","type_of_entity":"company","image":{"available_sizes":[[[150,70],"assets/images/resized/0008/0469/80469v10-max-150x150.jpg"],[[168,79],"assets/images/resized/0008/0469/80469v10-max-250x250.jpg"],[[168,79],"assets/images/resized/0008/0469/80469v10-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}