{"first_name":"Keith","last_name":"Powers","permalink":"keith-powers","crunchbase_url":"http://www.crunchbase.com/person/keith-powers","homepage_url":"http://www.powers.to","birthplace":"Brookline, MA","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1969,"born_month":6,"born_day":13,"tag_list":"rei-capital, x-prize, freecarmedia-com, beetle-boards, prizes, prize-capital, thunderbird, northeastern-university","alias_list":null,"created_at":"Sat Nov 29 03:54:32 UTC 2008","updated_at":"Sat Sep 08 21:23:52 UTC 2012","overview":"<p>Keith was formerly an Entrepreneur in Residence and Investment Director at REI Capital, where he \nidentified investment opportunities and played an active management role in several portfolio \ncompanies.  Prior to REI Capital, Keith was formerly the Co-Creator and COO at Prize Capital, LLC an innovative \nfinancial model at the intersection of invention, investment and philanthropy - where he remains a \nSenior Advisor.  Keith spun the Prize Capital model into a private company out of the X PRIZE \nFoundation where he was the EVP of Strategic Development  – where he spearheaded an effort to \ncreate a modern-day version of the Nobel Prize. To support this vision, he led a successful effort to \nexpand the Board of Trustees, and raised over $20M to support the development of a series of global \ninducement prizes in a variety of areas including energy, the environment/carbon, genomics, \nmedicine, nanotechnology, transportation, education and social entrepreneurship.\nHe previously started and sold several companies, including a non-traditional media  company in \n2000, and a Hispanic DRTV- advertising agency in 2003. From 1996-1999, Keith was the Director of \nOperations at Sun Apparel/The Polo Jeans Company, a $800M global manufacturer, distributor and \nretailer of casual apparel that was sold to Jones Apparel Group.\nCivic leadership, youth development and national service has long been a focus for Keith, including a \nstint at the US Embassy in Mexico City in 1994 and as a volunteer corps member and then later as a \nnational staff member with City Year, an “action tank” for national service. He his active on boards \nand is an advisor to several start-ups and non-profit organizations. His is also member of the NRDC&#8217;s \nEnvironmental Entrepreneurs (E2.org). \nKeith holds a B.A. from Northeastern University, an MBA from the Thunderbird School of Global \nManagement and has attended several executive seminars including Governing for Nonprofit \nExcellence: Critical Issues for Board Leadership at Harvard Business School. He has lived, worked, \nstudied or traveled to over 30 countries and is fluent in Spanish and proficient in Japanese.  He \ncurrently lives in Silicon Valley with his wife Michiko and their daughter Harmony</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0003/0120/30120v2-max-150x150.jpg"],[[200,200],"assets/images/resized/0003/0120/30120v2-max-250x250.jpg"],[[200,200],"assets/images/resized/0003/0120/30120v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}