{"first_name":"Keith","last_name":"Scott","permalink":"keith-scott","crunchbase_url":"http://www.crunchbase.com/person/keith-scott","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat May 30 06:05:24 UTC 2009","updated_at":"Sat May 30 06:05:51 UTC 2009","overview":"<pre><code>Keith Scott brings more than 15 years of CEO experience to UltraCell. Prior to UltraCell, Keith was CEO of NHT (Now Hear This), a high-end home theater equipment manufacturer. Keith has over 20 years experience in software and supply chain management companies. Keith was SVP Sales and Marketing at Alien Technology, a leader in the RFID market where he was responsible for building their go to market strategy. He was an Entrepreneur in Residence at Red Rock Ventures where he held interim CEO positions for portfolio companies and assisted in deal generation and evaluation. He served as CEO for venture-backed supply chain companies: Openshelf.com and Bindco, both of which were acquired. He also served as board member for SpinCircuit.com, a product life cycle management software company, which was an investment of Flextronics, Avnet and Cadence.\nPreviously, Mr. Scott served as CEO of Metcal, Inc., a proprietary heating technology company with products in electronics manufacturing, commercial foodservice and natural gas distribution equipment. He also was Sr. VP of Worldwide Sales and Marketing for Flextronics International, one of the world&amp;amp;#8217;s largest providers of electronics manufacturing services. Mr. Scott holds an MBA and a BA from UCLA.\n</code></pre>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Ultracell","permalink":"ultracell","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0004/6025/46025v1-max-150x150.jpg"],[[200,59],"assets/images/resized/0004/6025/46025v1-max-250x250.jpg"],[[200,59],"assets/images/resized/0004/6025/46025v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}