{"first_name":"Keith","last_name":"Grinstein","permalink":"keith-grinstein","crunchbase_url":"http://www.crunchbase.com/person/keith-grinstein","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Netsuite","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 24 12:26:08 UTC 2007","updated_at":"Thu Apr 09 00:37:43 UTC 2009","overview":"<p>Sadly, Mr Keith Grinstein passed away in September 2008.  Here&#8217;s a link:\nhttp://seattletimes.nwsource.com/html/localnews/2008214675_grinsteinobit30.html</p>\n\n<hr/>\n\n<p>Mr. Grinstein has more than fifteen years of executive and board experience spanning across the telecommunications, the Internet, and venture capital industries. He currently serves as chairman of Coinstar Inc. (NASDAQ: CSTR) and as a member of the board directors and audit committees of F5 Networks (NASDAQ: FFIV), Labor Ready (NYSE: LRW), and Nextera (NASDAQ: NXRA).</p>\n\n<p>Mr. Grinstein is a partner of Second Avenue Partners, a venture capital firm which is focused on emerging Internet businesses. He has held a number of senior executive positions, serving previously as Nextel International Inc.&#8217;s president and chief executive officer and prior to that president and chief executive officer of the Aviation Communications Division of AT&amp;T Wireless (formerly McCaw Cellular Communications).</p>\n\n<p>Mr. Grinstein is an experienced public company audit committee member and has lectured extensively on Sarbanes-Oxley compliance. In 2003, Mr. Grinstein testified in front of the US Senate Banking Committee on behalf of NASDAQ small and mid-cap companies regarding the effects of Sarbanes-Oxley legislation. Mr. Grinstein is also a frequent lecturer on Section 404 of Sarbanes-Oxley, executive compensation and director duties; and has lectured on director duties at the University of Washington Business School and Seattle University Law School.</p>\n\n<p>A successful venture capitalist, Mr. Grinstein was a seed-capital investor in Amazon.com (NASDAQ: AMZN). He is a founding partner of Second Avenue Partners, a VC group funding Pacific Northwest early-stage companies. In addition, he has been a driving force behind structuring a number of leading companies including Pathogenesis, VaxGen (VXGN: PK), Tegic, HouseValues (NASDAQ: SOLD), Wireless Services, Nordstrom.com of Nordstrom Inc. (NYSE: JWN), Superconductor Collider Corporation, Neah Power (NPWS: PK), Insitu, and Ice Energy.</p>\n\n<p>Mr. Grinstein holds a B.A. in education from Yale University and a J.D. magna cum laude from Georgetown University Law Center.</p>","image":{"available_sizes":[[[100,138],"assets/images/resized/0002/6204/26204v2-max-150x150.jpg"],[[100,138],"assets/images/resized/0002/6204/26204v2-max-250x250.jpg"],[[100,138],"assets/images/resized/0002/6204/26204v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}