{"first_name":"Keith","last_name":"Schaefer","permalink":"keith-schaefer","crunchbase_url":"http://www.crunchbase.com/person/keith-schaefer","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 23 01:45:03 UTC 2009","updated_at":"Tue Jun 23 01:48:16 UTC 2009","overview":"<p>KEITH SCHAEFER, Co-founder, Chief Executive Officer and President of BPL Global, Ltd., plans, directs and manages all aspects of the company’s strategy, business development, joint venture partnerships and financing.</p>\n\n<p>Over the past 24 years, Mr. Schaefer has held senior management positions with companies ranging from hyper-growth start-ups to Fortune 100s and a Global 500 company. He has co-founded or led more than ten start-ups and two buy-outs, and was instrumental in completing two Initial Public Offerings and nine trade sales.</p>\n\n<p>Prior to BPL Global, Schaefer was Senior Partner at Constellation Partners and previous to that Executive Partner and member of the Executive Committee at US Web/CKS. He served as Executive Vice President at Viacom and President of Paramount Communications Technology Group, where he established and successfully led the Venture Capital Group and set up early initiatives and strategic alliances with Microsoft and AOL. Previously, Schaefer held presidential and CEO positions at Computer Curriculum Corporation, Worlds of Wonder, and NEC Technologies. He began his career in sales and marketing at Procter &amp; Gamble, followed by Clorox, and then achieved the position of Executive Vice President at Atari Corporation.</p>\n\n<p>Mr. Schaefer earned a Bachelor of Science degree from The University of Pittsburgh and attended UCLA’s Graduate School of Business. He is the immediate past President of the Alumni Association and a current Trustee of the University of Pittsburgh, and is actively involved with the University’s $2 billion capital campaign. Schaefer co-founded and serves as a member of the Steering Committee of the Socrates Society at The Aspen Institute. Schaefer also co-authored the best-selling Internet marketing book Net Results, which is used as a reference text at leading business schools.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"BPL Global","permalink":"bpl-global","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0005/0232/50232v2-max-150x150.png"],[[213,65],"assets/images/resized/0005/0232/50232v2-max-250x250.png"],[[213,65],"assets/images/resized/0005/0232/50232v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}