{"first_name":"Keith","last_name":"Petri","permalink":"keith-petri","crunchbase_url":"http://www.crunchbase.com/person/keith-petri","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"iGottaGuide","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Apr 22 22:41:39 UTC 2011","updated_at":"Thu Apr 28 06:19:34 UTC 2011","overview":"<p>Keith Petri, founder of eBranding Me and avid blogger, is a graduate of Skidmore College in Saratoga Springs, NY. His studies in business, economics and studio art, along with an affinity for marketing, technology and entrepreneurship, have led to his current passion for social media and the new rules of digital networking. Through his prior entrepreneurial pursuits, blogging and extensive networking, Keith has seen the need for educating small businesses on how to utilize communication tools to engage their audiences and convert leads into sales. </p>\n\n<p>Throughout my past work experiences, entrepreneurial ventures and college education I have continuously shown interest in marketing communications. While working for both For Him Magazine (FHM) and Glazer Design I was exposed to conventional advertising methods and client-customer relationships. Soon afterwards, I was exposed to, and eventually in charge of, a strong direct marketing strategy executed through weekly e-mail campaigns for Englewood Wine Merchants. I eventually implemented these various tools to build my own successful freelance design and photography business.</p>\n\n<p>I chose to major in Management and Business at Skidmore College with the intention of focusing on Marketing. As part of my liberal arts education, I particularly enjoyed taking Sheldon Solomon’s psychology courses. With his guidance and study of Freud, Fromm, Horney and Becker’s theories, I was able to further understand why people do what they do when they do it. These courses further served to reinforce my interest in marketing.</p>\n\n<p>More recently, I have been intrigued by the constant technological advances that have the potential to enhance the connection between businesses and customers. With programs like Google Web History and other analytic software, marketers gain valuable information about prospective, current and past customers’ demographics. These tools proved to be beneficial for my research at the Intrepid Sea, Air &amp; Space Museum. I am excited about how these new technologies will be integrated into future marketing strategies. The same can be said for the explosive growth in social-networking sites.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0013/1844/131844v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0013/1844/131844v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0013/1844/131844v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder","firm":{"name":"iGottaGuide","permalink":"igottaguide","type_of_entity":"company","image":{"available_sizes":[[[150,30],"assets/images/resized/0013/1734/131734v2-max-150x150.png"],[[250,51],"assets/images/resized/0013/1734/131734v2-max-250x250.png"],[[450,92],"assets/images/resized/0013/1734/131734v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}