{"first_name":"Kelly","last_name":"Larabee","permalink":"kelly-larabee","crunchbase_url":"http://www.crunchbase.com/person/kelly-larabee","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"CornerWorld","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Feb 01 11:34:24 UTC 2008","updated_at":"Mon Jun 22 22:13:22 UTC 2009","overview":"<p>Kelly Larabee Morlan is an expert communications strategist who is responsible for promoting and guiding high-profile progressive technology businesses and ideas in online communications, entertainment and social networking. As a co-founder and communications director of CornerWorld, she spearheaded executive strategy, led communications and managed visibility and media campaigns. Most recently, Ms. Larabee was responsible for all global communications and strategy for Skype Technologies, a leading global Internet communications company, from inception though its lucrative sale to eBay in 2005. Prior to Skype, Ms. Larabee directed all aspects of media and communications strategy for KaZaA, also guiding the company through its acquisition. Previously, Larabee was vice president of Alexander Ogilvy, where she oversaw agency clients idealab!, Ziff-Davis’s GameSpot and Computer Shopper/NetBuyer, Infobeat, Hollywood Stock Exchange, Heidrick and Struggle’s LeadersOnline, Visitalk, Hewlett-Packard’s Enterprise Systems Group, and Nortel through its acquisition of Bay Networks. Prior to Alexander Ogilvy, Ms. Larabee worked as a public relations consultant in Washington, D.C. where she helped create the Campaign for Tobacco-Free Kids and worked with Fleishman-Hillard Inc on campaigns for early-stage client America Online and MasterCard’s online privacy initiatives. Her career began in the United States Senate, where she served as a staff assistant to Senator Herb Kohl from 1992 to 1995. Ms. Larabee serves on the boards of the Phoenix Parks and Conservation Foundation and the Encanto Palmcroft Historic Preservation Association. Ms. Larabee holds a Bachelor of Science degree in Political Science from Colorado State University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Secretary and Public Relations","firm":{"name":"CornerWorld","permalink":"cornerworld","type_of_entity":"company","image":{"available_sizes":[[[150,29],"assets/images/resized/0000/3373/3373v1-max-150x150.png"],[[151,30],"assets/images/resized/0000/3373/3373v1-max-250x250.png"],[[151,30],"assets/images/resized/0000/3373/3373v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}