{"first_name":"Kelly","last_name":"Herrell","permalink":"kelly-herrell","crunchbase_url":"http://www.crunchbase.com/person/kelly-herrell","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jun 17 02:32:33 UTC 2009","updated_at":"Wed Jun 17 02:33:02 UTC 2009","overview":"<p>As CEO and member of the Board of Directors, Kelly provides the strategic leadership and vision for Vyatta and drives it through to rapid execution. Kelly has a proven track record for growing companies based on open source in the systems, embedded and telephony industries. Before joining Vyatta, Kelly was the SVP of Strategic Operations at MontaVista Software, the world&#8217;s pre-eminent embedded Linux supplier, where he led the strategic focus into telecommunications equipment and mobile phones. Today operators around the world such as NTT DoCoMo have network infrastructure and tens of millions of mobile phones in use that are based on MontaVista Linux. Prior to joining MontaVista, Kelly was Vice President of Marketing for Cobalt Networks, the dominant provider of open source-based server appliances for web hosting. After helping drive the company growth through an explosive IPO and beyond, he played a key role in driving its successful $2.3B merger with Sun Microsystems. Previous to Cobalt, Kelly was VP of Marketing for CacheFlow (Nasdaq: BCSI), directed worldwide marketing for Oracle&#8217;s database products, and served in various product- and market-focused roles at NCR, Teradata and AT&amp;T. Kelly holds a Bachelor&#8217;s Degree with Honors in Marketing from Washington State University, and an MBA from Cornell University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Vyatta","permalink":"vyatta","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0004/8980/48980v1-max-150x150.png"],[[247,73],"assets/images/resized/0004/8980/48980v1-max-250x250.png"],[[247,73],"assets/images/resized/0004/8980/48980v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}