{"first_name":"Ken","last_name":"Banks","permalink":"ken-banks","crunchbase_url":"http://www.crunchbase.com/person/ken-banks","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jun 15 20:27:00 UTC 2008","updated_at":"Mon Jun 16 00:40:05 UTC 2008","overview":"<p>Ken Banks is the founder of <a href=\"http://www.crunchbase.com/company/frontlinesms\" title=\"Frontline SMS\">Frontline SMS</a> and <a href=\"http://www.Kiwanja.net\" title=\"Kiwanja.net\" rel=\"nofollow\">Kiwanja.net</a>.  He specializes in the application of mobile technology for positive social and environmental change in the developing world. He combines over 22 years in I.T. with over 15 years experience living and working throughout Africa in countries including Kenya, Nigeria (where he ran a primate sanctuary), South Africa, Mozambique, Cameroon, Zambia, Uganda and Zimbabwe. In 1999 he graduated from Sussex University with honours in Social Anthropology with Development Studies</p>\n\n<p>His vision is to empower others to create social change, and he does this by developing and providing tools to mostly grassroots organisations who seek to better use technology in their work. In 2007 he hit headline news on the BBC when his text messaging application - FrontlineSMS - was used to help monitor the Nigerian Presidential elections. Since launch the software has been successfully implemented in over forty countries including Afghanistan, Indonesia, Zimbabwe, the Philippines and Pakistan</p>\n\n<p>Ken has recently been interviewed by the BBC World Service, The Economist, BBC News Online, The New York Times, Nokia, Mongabay.com, The Africa Journal, White African and the Sussex University Alumni magazine, among many others, and he was recently invited to take part in an Aspen Institute round table discussion on the use of mobiles in activism and civic engagement. Ken has written about his work, and the wider role of mobile technology, for a number of publications including Pambazuka News, Didactics World and Vodafone Receiver magazine, and has a regular online column in PC World. He has also acted as an official judge for the Global Mobile Awards, the Mobile Messaging Awards and his own nGOmobile initiative, and is a regional judge for the 2008 Adjudication Panel for the African ICT Achievers Awards Programme</p>\n\n<p>He has spoken about the application of mobile technology at a number of conferences, workshops and organisations including Nokia, IDEO, Stanford University, the MacArthur Foundation, Amnesty International and the University of Arizona. He has also presented papers at the W3C Workshop on the Mobile Web in Developing Countries (Bangalore, 2006 and Sao Paulo, 2008) and the 16th International World Wide Web Conference (Canada, 2007), where he also sat on a specialist panel discussing web delivery models for emerging markets. Ken also spoke at the Mobile World Congress in Barcelona (2008), and delivered a keynote address at Mobile Messaging 2008 in Cannes</p>\n\n<p>Ken was recently awarded grants from the MacArthur Foundation and the Open Society Institute (OSI), and has been short listed for two mobile industry awards for the development of FrontlineSMS. Between 2006 and 2007 he was based at Stanford University as a Visiting Fellow on the Reuters Digital Vision Program. He currently spends his time between Cambridge (UK) and Stanford University in California.</p>","image":{"available_sizes":[[[150,123],"assets/images/resized/0002/0409/20409v2-max-150x150.jpg"],[[221,182],"assets/images/resized/0002/0409/20409v2-max-250x250.jpg"],[[221,182],"assets/images/resized/0002/0409/20409v2-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.kiwanja.net/kenbanks.htm\" title=\"Kiwanja.net\" rel=\"nofollow\">Kiwanja.net</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"FrontlineSMS","permalink":"frontlinesms","type_of_entity":"company","image":{"available_sizes":[[[150,97],"assets/images/resized/0002/0401/20401v3-max-150x150.jpg"],[[250,162],"assets/images/resized/0002/0401/20401v3-max-250x250.jpg"],[[450,292],"assets/images/resized/0002/0401/20401v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}