{"first_name":"Ken","last_name":"Klein","permalink":"ken-klein","crunchbase_url":"http://www.crunchbase.com/person/ken-klein","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 04 20:51:10 UTC 2009","updated_at":"Thu Jun 04 20:54:52 UTC 2009","overview":"<p>Ken Klein is Chairman of the Board, Chief Executive Officer, and President of Wind River. With more than 20 years of experience in the software industry, he is working to further extend Wind River&#8217;s leadership position by expanding customer and partner initiatives, continuing to drive the market shift from in-house development to commercial software adoption, and delivering innovative, leading-edge products. Target vertical markets include consumer electronics, aerospace and defense, industrial, automotive, medical, and networking equipment. He is responsible for the management of 1,460 employees in 15 countries.</p>\n\n<p>Before joining Wind River, Klein served as Chief Operating Officer and a board member of Mercury Interactive for 12 years. Klein and his team built Mercury from a pre-revenue startup into a software powerhouse with a peak market capitalization of $15B, 2,150 employees, operations in 35 countries, and membership in the NASDAQ 100 and S&amp;P 500. The team went on to grow the company to nearly $1B in annual revenue and to sell to Hewlett-Packard for $5B. Before his tenure at Mercury, Klein held various engineering, marketing, and management roles at Interactive Development Environments, Daisy Systems, and Hughes Aircraft Company.</p>\n\n<p>Klein earned a bachelor of science degree in electrical engineering and biomedical engineering from the University of Southern California. He is a USC Distinguished Alumnus, member of the USC School of Engineering Board of Councilors, founder of USC&#8217;s Klein Institute for Undergraduate Engineering Life (KIUEL), and a USC Trustee. He also serves on the boards of AmberPoint and BigFix.</p>","image":{"available_sizes":[[[102,150],"assets/images/resized/0004/6784/46784v1-max-150x150.jpg"],[[140,204],"assets/images/resized/0004/6784/46784v1-max-250x250.jpg"],[[140,204],"assets/images/resized/0004/6784/46784v1-max-450x450.jpg"]],"attribution":"<p>WindRiver.com</p>"},"degrees":[{"degree_type":"BSc","subject":"Electrical Engineering","institution":"USC","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President, CEO","firm":{"name":"Wind River","permalink":"wind-river","type_of_entity":"company","image":{"available_sizes":[[[150,16],"assets/images/resized/0004/6783/46783v1-max-150x150.png"],[[250,26],"assets/images/resized/0004/6783/46783v1-max-250x250.png"],[[271,29],"assets/images/resized/0004/6783/46783v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}