{"first_name":"Ken","last_name":"Greene","permalink":"ken-greene","crunchbase_url":"http://www.crunchbase.com/person/ken-greene","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 19 12:59:04 UTC 2009","updated_at":"Fri Jun 19 13:03:18 UTC 2009","overview":"<p>Ken Green, Ph.D., Senior Vice President of Scientific Affairs at Alimera Sciences, is responsible for all preclinical and clinical development activities supporting the company&#8217;s portfolio. He provides input to the project teams regarding clinical and preclinical trial design and development strategy and supports the marketing and sales organizations with input to post-marketing study strategies. Additionally, he serves as a member of the executive committee helping to define the overall strategic direction of the company.</p>\n\n<p>Prior to joining Alimera Sciences, Dr. Green worked with Lederle Laboratories, Storz Ophthalmics, Bausch &amp; Lomb, CIBA Vision and Novartis Ophthalmics. At Novartis Ophthalmics, Dr. Green served as the Global Head of Clinical Science, where he was involved with the development of Visudyne, Rescula and Zaditor in both the US and Europe. Dr. Green&#8217;s ophthalmology experience spans 15 years and includes clinical development experience in the areas of allergy, infection, glaucoma, age-related macular degeneration, diabetic retinopathy and myopia. In 2003, Dr. Green presented to an FDA advisory panel convened to define a clinical endpoint for the pharmacological treatment of myopia.\nHe earned his B.A. degree in chemistry from Southern Illinois University and a Ph.D. in organic chemistry from Ohio State University. He has published several papers and is listed as an inventor on several U.S. patents.</p>","image":{"available_sizes":[[[100,125],"assets/images/resized/0004/9640/49640v1-max-150x150.jpg"],[[100,125],"assets/images/resized/0004/9640/49640v1-max-250x250.jpg"],[[100,125],"assets/images/resized/0004/9640/49640v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Sr. Vice President & CSO ","firm":{"name":"Alimera Sciences","permalink":"alimera-sciences","type_of_entity":"company","image":{"available_sizes":[[[73,40],"assets/images/resized/0004/9636/49636v1-max-150x150.png"],[[73,40],"assets/images/resized/0004/9636/49636v1-max-250x250.png"],[[73,40],"assets/images/resized/0004/9636/49636v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}