{"first_name":"Ken","last_name":"Steele","permalink":"ken-steele","crunchbase_url":"http://www.crunchbase.com/person/ken-steele","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Chumby","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Dec 22 03:22:18 UTC 2007","updated_at":"Fri Mar 21 04:17:31 UTC 2008","overview":"<p>Ken Steele, Principal Software Architect and Founder of Chumby, has almost a decade of experience in the computer security industry. His primary focus has been on intrusion detection and prevention, vulnerability research and exploit analysis.</p>\n\n<p>During his time with Intrusion, Inc., Ken architected, developed and maintained a multi-tier, platform independent distributed automation framework, designed to conduct complex and comprehensive analysis of integrated network gateway appliances via multi-gigabit real-world network simulation. At Nokia Internet Communications he researched vulnerabilities and conducted penetration tests against their embedded Linux and FreeBSD based appliances. At Network Associates, he focused his work on network state engines and signature development for host and network based intrusion detection systems.</p>\n\n<p>Ken began his professional software career at the prestigious IBM Almaden Research Center where he was given the opportunity to explore and participate in a wide array of technologies. Ken is an advocate of open source technologies and continues to experiment in various open software projects, the latest revolving around the automation of malware detection through static analysis of Windows Portable Executables.</p>","image":{"available_sizes":[[[122,92],"assets/images/resized/0001/6009/16009v2-max-150x150.png"],[[122,92],"assets/images/resized/0001/6009/16009v2-max-250x250.png"],[[122,92],"assets/images/resized/0001/6009/16009v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Principal Software Architect and Founder","firm":{"name":"Chumby","permalink":"chumby","type_of_entity":"company","image":{"available_sizes":[[[150,43],"assets/images/resized/0000/2803/2803v1-max-150x150.png"],[[173,50],"assets/images/resized/0000/2803/2803v1-max-250x250.png"],[[173,50],"assets/images/resized/0000/2803/2803v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}