{"first_name":"Ken","last_name":"Gilmore","permalink":"ken-gilmore","crunchbase_url":"http://www.crunchbase.com/person/ken-gilmore","homepage_url":"http://www.kgequipment.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"truck-tool-boxes, migtig-welding, steel-fabricating, laser-cutting-service, metal-fabrication, landscaping-trailer, complete-hitch, custom-hitch, dump-truck, lift-gates, tool-boxes, cranes, welding-and-fabrication, fabrication-welding, stainless-steel-wel","alias_list":null,"created_at":"Wed Apr 18 18:47:21 UTC 2012","updated_at":"Tue Apr 24 09:37:22 UTC 2012","overview":"<p>All Metal Fabrication &amp; Welding Shop working with aluminum, steel, stainless steel. Shape, tack and spot weld metal using MIG/TIG Welding, laser cutting, and more.</p>\n\n<p>Metal fabricators in Bensalem, NE Phila. Custom truck body, dump trailers, truck tool boxes for pickups, flatbed trucks. TIG welding, metal cutting services for commercial bussiness in lower Bucks Co.</p>\n\n<p>Sheet metal fabrication of aluminum, Steel and Stainless Steel. A Complete custom metal fabrication shop.  Steel, Aluminum and Stainless Steel fabricator.</p>\n\n<p>Sheet metal fabrication of aluminum, Steel and Stainless Steel.Complete custom metal fabrication shop. Steel, Aluminum and Stainless Steel fabricator.</p>\n\n<p>Welding for manufacturing, industrial companies. Truck bed fabrication for landscapers. Tig welding, laser cutting, aluminum and iron fabrication. Fast service, affordable, call today.\nBristol, 19007, Bucks County, PA, Mig Welding, Metal Fabrication, fabrication company\n Welding, Metal Fabrication and Laser Cutting company. We use laser cutting &amp; welding applications: MIG, TIG and ARC Welding. Truck accessories and all equipment you need.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0018/4893/184893v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0018/4893/184893v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0018/4893/184893v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}