{"first_name":"Kendall","last_name":"McGiIl","permalink":"kendall-mcgil","crunchbase_url":"http://www.crunchbase.com/person/kendall-mcgil","homepage_url":"http://www.uptownbidz.com/index.php","birthplace":"","twitter_username":"uptownbidz","blog_url":"http://uptownbidz.com/Blog/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"auctions, auction-website, auction-websites, online-auction, online-auctions, bids, shopping","alias_list":null,"created_at":"Mon Sep 24 06:45:14 UTC 2012","updated_at":"Wed Nov 07 05:57:50 UTC 2012","overview":"<p>Uptownbidz\nUptownbidz is a new online auction site where users can buy, sell, auction, bid and swap on new and pre-owned merchandise available on our website. Uptownbidz was launched in 2012 by owners Kendall and Charisse McGill (CEO/CFO), and is based in and run out of (Orlando) Sanford, Florida. \nIn order to participate in the daily auctions, users must first register on Uptownbidz.com where registration is always free. Just go to our homepage and click on registration link at the top of the page or at the bottom of the page as well. This link will take you to the registration form which is quick and simple to fill out. The minimum age allowed at Uptownbidz is 18 years of age.\nOnce the registration and confirmation process is fully completed as a new Uptown member, you now have the options of buying, selling, or auctioning on merchandise already uploaded on our auction website or selling or auctioning your own personal possession of to the highest bidder or buyer. We always welcome individuals, entrepreneurs, business, and private auctioneers who want to sell their personal or business products on our site for nice profits! \nThere are several ways our users can bid on merchandise and other products on our site, such as Standard bidding, Proxy Bidding, Make an Offer, and Buy Out. No matter which of our bidding options you chose to use all are in real-time only.\nStandard bidding is the most common way to bid on an item, and is exactly the same as the process used in real-world auction rooms. You bid the minimum amount needed to outbid the current high bidder.\nA Proxy bid means that you bid an amount that is higher than necessary. Our auction software will raise your actual bid to the minimum necessary, but will remember your maximum bid. If someone else comes along and tries to outbid you, the auction software will automatically place additional bids on your behalf up to the value of your proxy bid. This means you can stay on top of the bidding without having to be near a computer.\nMaking an offer is another way to win an auction. Some sellers allow potential buyers to make an offer to buy their items, to avoid having to wait for the auction to finish. The Make Offer section of the listing also contains information about the price range in which offers can be made.\nThe Buy Out or Buy Now method is when you can bid or purchase an item in an auction. Some sellers allow items to be purchased instantly at a fixed rice, regardless of any auction bidding that has taken place. \nUptownbidz also uses a Reputation system like many other online auction websites. Your reputation provides an indicator of how much trading you have done on our auction site and allows other buyers and sellers to get an idea of your trustworthiness and experience. For each transaction that takes place, the buyer and seller can award each other a star rating from 1 to 5.\nUptownbidz allows its users to operate their own stores within the auction site. Selecting a store as a favorite allows you quick and easy access to it directly from the Member’s area, without having to search for it. Favorite Store at Uptownbidz is an excellent way for you to advertise, market and sell your merchandise worldwide to all our online users. You can opt to get a free store selling a limited amount of merchandise or you can opt to get a larger store, where you can sell a lot more merchandise. We encourage our users to get a lifetime membership which comes with the largest store available and is featured throughout our site in several different categories. </p>","image":{"available_sizes":[[[150,109],"assets/images/resized/0021/8863/218863v2-max-150x150.png"],[[250,181],"assets/images/resized/0021/8863/218863v2-max-250x250.png"],[[450,327],"assets/images/resized/0021/8863/218863v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.uptownbidz.com/index.php","title":"Online auction website Uptownbidz"}],"web_presences":[]}