{"first_name":"Kenneth","last_name":"Munoz","permalink":"kenneth-munoz","crunchbase_url":"http://www.crunchbase.com/person/kenneth-munoz","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 28 12:49:51 UTC 2008","updated_at":"Fri Nov 28 13:00:10 UTC 2008","overview":"<p>Kenneth Munoz joined SCP Worldwide, as a partner, effective July 15, 2005. Since SCP’s start-up in 2002, Mr. Munoz has acted as its counsel, negotiating and concluding a number of acquisitions and related sports, media and entertainment transactions that helped create the company SCP is today. Mr. Munoz was the critical player for SCP in its acquisition of the St. Louis Blues in 2006, as well as the complicated equity/debt structure utilized to complete this transaction. He is a co-investor with SCP in Running Subway, LLC, and serves on its board.</p>\n\n<p>Mr. Munoz most recently served as senior counsel in the New York office of the law firm of Sidley Austin Brown &amp; Wood from 2002 to 2005. His practice focused on general corporate matters in the industries of sports, media and entertainment. His client base included arena owners, sports team entrepreneurs and major sports leagues. Mr. Munoz represented team owners in each of the National Basketball Association and the National Hockey League.</p>\n\n<p>He also represented major arenas in the two largest U.S. markets, the Forum in Los Angeles, and Madison Square Garden in New York, in respect of numerous transactional matters − ranging from capital structuring transactions, to concessions/arena manager agreements to sponsorship partner agreements to general corporate advice.</p>\n\n<p>Before joining Sidley in May 2002, Mr. Munoz was Executive Vice President, Business Affairs and General Counsel for Madison Square Garden, L.P. for sixteen years. In this position, Mr. Munoz supervised a department of eight attorneys responsible for all relevant legal and business affairs matters facing MSG including entertainment and television business negotiations, player contracts, labor relations and litigation. He was also in charge of all new business development activities for MSG, including mergers and acquisitions. Prior to being named General Counsel in 1986, Mr. Munoz held several legal and business affairs positions with the company.</p>\n\n<p>During Mr. Munoz’s twenty four year career at MSG, Mr. Munoz helped put together many of the brand-building transactions and corporate moves that created the $1 billion company it is today, including the company’s 1997 acquisition of Radio City Productions. In 1988, Mr. Munoz led negotiations that resulted in MSG’s unprecedented contract to telecast New York Yankees games through 2000, a deal valued at the time at more than $500 million. In more recent years, he helped establish the New York Liberty, the company’s WNBA team and expanded MSG entertainment programming businesses. His appointment to the National Hockey League Board of Governors on behalf of the Blues was preceded by 16 years of the same service on the Boards of the NHL and the NBA during his MSG tenure. He also serves as a Governor on behalf of SCP&#8217;s Major League Soccer franchise, Real Salt Lake and is also a member of the League&#8217;s Labor Relations committee.</p>\n\n<p>Prior to his in-house positions at MSG, Mr. Munoz was an associate in the New York offices of the law firm, Fulbright and Jaworski.</p>\n\n<p>Mr. Munoz graduated from New York University School of Law (J.D., 1975) and obtained his B.A. from the State University of New York – New Paltz in 1972. He is a member of the New York State Bar Association and its Entertainment, Arts and Sports Law Section, and is active in alumni affairs of NYU Law School, participating in its annual Speaker’s Roundtable. Mr. Munoz resides in Douglas Manor, New York with his wife, Maryann. They have three children and one grandchild.</p>","image":{"available_sizes":[[[117,150],"assets/images/resized/0002/9956/29956v1-max-150x150.jpg"],[[150,192],"assets/images/resized/0002/9956/29956v1-max-250x250.jpg"],[[150,192],"assets/images/resized/0002/9956/29956v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Partner, SCP Worldwide","firm":{"name":"SCP Worldwide","permalink":"scp-worldwide","type_of_entity":"financial_org","image":{"available_sizes":[[[150,47],"assets/images/resized/0002/9946/29946v1-max-150x150.jpg"],[[250,79],"assets/images/resized/0002/9946/29946v1-max-250x250.jpg"],[[271,86],"assets/images/resized/0002/9946/29946v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}