{"first_name":"Kenneth","last_name":"Lewis","permalink":"kenneth-lewis","crunchbase_url":"http://www.crunchbase.com/person/kenneth-lewis","homepage_url":"http://www.KennethLewis.com","birthplace":"Chicago","twitter_username":"mrkenlewis","blog_url":"http://www.BreemaWellness.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1972,"born_month":null,"born_day":null,"tag_list":"psychology, transpersonal, breema, yoga, mediation, osho, emotions, marketing, hotel-marketing","alias_list":null,"created_at":"Thu Jul 15 23:44:39 UTC 2010","updated_at":"Mon Jul 19 19:24:53 UTC 2010","overview":"<p>Ken Lewis is a Certified Breema Bodywork Instructor,  a mediation teacher, facilitator of Veet Mano&#8217;s Emotional Freedom, Osho Active Mediation leader, hatha yoga instructor, and Osho group facilitator.  </p>\n\n<p>Ken produced the Harmonious New Year&#8217;s Eve events in Chicago during 2003 and 2004, bringing consciousness, celebration, intimacy, and joy into the New Year&#8217;s eve experience.  These well-attended events at the Holmes Place Health Club created a wave of smaller, community-center conscious events throughout Chicagoland.</p>\n\n<p>Additionally, Ken has been active in hotel marketing, a skill-set he developed in the name of supporting his family&#8217;s hotel businesses.  He operates a small, boutique firm called Organic Hotel Marketing.  He takes on limited clients, as he prefers to be in the world of mediation and spirituality.</p>\n\n<p>As of Fall 2010, Ken will be spending five years at the University of West Georgia, studying and researching Transpersonal Psychology, in pursuit of a doctoral degree and a career as a university professor.  He will be maintaining his spiritual activities throughout this period, with a particular emphasis on helping to prepare people for meditation.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.Breema.com","title":"Breema Bodywork"},{"external_url":"http://www.CarltonInnMidway.com","title":"Carlton Inn Midway"}],"web_presences":[]}