{"first_name":"Kent","last_name":"Leonard","permalink":"kent-leonard","crunchbase_url":"http://www.crunchbase.com/person/kent-leonard","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jul 29 17:53:25 UTC 2008","updated_at":"Tue Jul 29 17:57:26 UTC 2008","overview":"<p>As Vice President of Product Delivery at <a href=\"http://www.crunchbase.com/company/event-innovation\" title=\"Event Innovation\">Event Innovation</a>, Kent&#8217;s driving role is to provide overall direction and guidance for product delivery as well as day-to-day leadership and management of client support. Kent works with clients to define and articulate their tactical and strategic objectives and provides them with strategies for success.</p>\n\n<p>Kent Leonard is an accomplished information technology and operations leader who has been immersed in the e-Commerce and transaction-based technology industries since 1995. Kent brings broad experience in the cashless card industry ranging from strategic operations to professional services, training, installations and client support. Most recently, Kent held leadership positions with Blackboard Inc. (NASDAQ: BBBB) on the Strategic Planning and Global Operations Team and managing the Commerce Suite Global Services Department.</p>\n\n<p>Kent&#8217;s expertise in transaction systems ranges from smart cards, magnetic stripe cards, and proximity cards to the related software applications and hardware they require. As a highly regarded consultant he has advised and managed nearly a hundred transaction / card system implementations throughout North America. In addition, he actively participates in the industry&#8211;delivering presentations as a card technology / solution subject matter expert in settings such as the National Association of Campus Card Users (NACCU) conference, the National Association of College and University Business Officers (NACUBO) conference.</p>\n\n<p>Prior to Blackboard, Kent represented software services company, NYMA Inc. responsible for promoting and advancing of relations with the federal government through the design, development, and delivery of turnkey software solutions for the Department of Energy (DOE) and Science Applications International Corporation (SAIC).</p>\n\n<p>Kent received a Bachelor of Science degree from Virginia Polytechnic Institute and State University and is a member of the Project Management Institute.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"COO","firm":{"name":"Event Innovation","permalink":"event-innovation","type_of_entity":"company","image":{"available_sizes":[[[115,48],"assets/images/resized/0002/2892/22892v1-max-150x150.png"],[[115,48],"assets/images/resized/0002/2892/22892v1-max-250x250.png"],[[115,48],"assets/images/resized/0002/2892/22892v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}