{"first_name":"Kermit","last_name":"Nash","permalink":"kermit-nash","crunchbase_url":"http://www.crunchbase.com/person/kermit-nash","homepage_url":"http://www.gpmlaw.com/professionals/kermit-j-nash.aspx","birthplace":"Fargo ND","twitter_username":"kermitnash","blog_url":"http://www.entreviewblog.com/search/label/Kermit%20Nash","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1973,"born_month":3,"born_day":25,"tag_list":"startup, venture, international, hightech, medtech, private-equity, vc","alias_list":null,"created_at":"Tue May 08 17:02:30 UTC 2012","updated_at":"Thu May 10 19:08:40 UTC 2012","overview":"<p>Kermit is a principal at Gray Plant Mooty practicing in the firm’s Entrepreneurial Services group, and serves as corporate counsel to numerous privately-held domestic and international companies, advising his clients on all aspects of business operations and law with an emphasis in medical device &amp; biotechnology, business law, agribusiness, energy, and mergers &amp; acquisitions.</p>\n\n<p>Kermit represents and advises clients in a variety of industries, including high tech, medical devices, life sciences, private equity, agricultural and food processing, oil &amp; gas, manufacturing, software, and e-commerce. He also represents clients’ interests in various business transactions, including mergers and acquisitions, sales, financing, licensing, distribution intellectual property management, and strategic planning.</p>\n\n<p>Kermit counsels clients on commercialization strategies and he applies his value-added experience to advance his clients’ success through use of his network, business skills, and serving as “external in-house legal counsel.”</p>\n\n<p>Additionally, Kermit is a frequent presenter at international conferences regarding commercialization strategies for high tech and life science companies. He works with numerous Scandinavian and European-based companies in their U.S. fundraising, compliance, and operational requirements. Kermit has recently served as U.S. counsel to medical device, life science, and clean technology companies looking to integrate their technology and products into the U.S. market.</p>\n\n<p>While attending Hamline University School of Law, Kermit studied ethics and comparative international law at Rothsberg International School, Hebrew University, Mount Scopus Campus in Jerusalem, Israel. In his spare time, Kermit frequently lectures on business ethics, business law, and contracts. He has been an adjunct professor at Northwestern College for a number of years where he has taught business law, contracts, and business ethics. Kermit also frequently blogs on the firm’s entrepreneurial services blog at www.entreVIEWblog.com.</p>\n\n<p>Publications\n■“The US FDA Thinks Your Smartphone May Be A Medical Device,” Oslo Medtech Newsletter, October 2011\n■“Opportunities, Challenges Face Region’s Agricultural Exporters,” Prairie Business, February 2009\n■“A New Era in Design/Build Contracts,” coauthor, Chemical Technology, February 2008\nPresentations\n■“Collaborative Approaches between Research &amp; Industry and U.S. &amp; Norway and across Disciplines,” The Brain Science: The Next Frontier Conference, University of Minnesota, Minneapolis Minnesota, November 4, 2011\n■“Trends and Strategies: Entering the US Market With the Exit Strategy in Mind,” Medtech Switzerland Conference, Winterthur, Switzerland, June 20-22, 2011\n■“Capitalizing the Life Sciences Sector,” The Red River Valley Research Corridor Life Sciences Action Summit, Fargo, North Dakota, April 18, 2011\n■“Trends and Strategies: Entering the US Market With the Exit Strategy in Mind,” Medtech Market Insight: USA, Oslo, Norway, April 4, 2011\n■Finance Panel, panelist, Executive Summit, Willmar, Minnesota, October 29, 2010\n■“Strategy for Early Stage Investments in the US and in Europe,” European Cancer Cluster Conference, Oslo, Norway, September 16, 2010\n■“Capitalizing the Life Sciences Sector,” Life Sciences Action Summit, copresenter, Fargo, North Dakota, February 19, 2010\n■“Negotiating a Winning Contract,” Innovation in Health Care Conference, Innovation Norway, Asker, Norway, September 9, 2009\n■“Investing in Renewable Energy and Clean Tech: Insights During Turbulent Economic Times,” Midwest’s Premier Energy, Economic, and Environmental (E3) Conference, November 18, 2008\n■“Investing in the United States: Opportunities for Investing in Growth Companies for International Companies,” Innovation Norway, Oslo, Norway, November 2008\n■“Commercializing Your Technology in the United States, a Primer for Technology Companies,” Access-Mid Norway, Trondheim, Norway, November 2008\nEducation\n■Hamline University School of Law, J.D.\n■Hebrew University, Rothsberg International School, Jerusalem Israel\n■Northwestern College, B.A., summa cum laude\n■Association Free Lutheran Bible School, with honors\nBar Admissions\n■Minnesota\n■Nebraska\n■North Dakota\n■U.S. Court of Appeals, Eighth Circuit\n■U.S. District Court, District of Minnesota\n■U.S. Tax Court\nProfessional Activities\n■Hennepin County Bar Association, International &amp; Business Sections, member\n■Minnesota State Bar Association, member\n■Northwestern College, adjunct professor\n■TwinWest Chamber of Commerce, member\nHonors and Distinctions\n■“40 Under Forty,” Minneapolis/St. Paul Business Journal, 2012\n■“Rising Star,” Minnesota Law &amp; Politics, 2006, 2010\n■State of North Dakota, Special Assistant Attorney General\nCommunity Involvement\n■Institute for Biblical Archaeology, board of directors\n■North Dakota State College of Science Nanotechnology Advisory Board\n■North Dakota Trade Office, former board member\n■Norwegian-American Chamber of Commerce, Upper Midwest Chapter, board of directors, 2007-2012</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linked.com/kermitnash","title":""}]}