{"first_name":"Kerone","last_name":"India","permalink":"kerone-india","crunchbase_url":"http://www.crunchbase.com/person/kerone-india","homepage_url":"http://kerone.com","birthplace":"Mumbai","twitter_username":"Kerone75","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1985,"born_month":7,"born_day":9,"tag_list":"industrial-infrared-heater, industrial-heaters, domestic-heater-manufacturer, electric-heating-equipment, domestic-heaters, industrial-electric-heater-supplier, space-heater, silicon-carbide-heaters-mumbai, industrial-space-heater","alias_list":null,"created_at":"Fri Jan 14 06:21:54 UTC 2011","updated_at":"Tue Jan 25 02:21:09 UTC 2011","overview":"<p>KERONE is a recognized leader in the field of tubular electrical heating elements, known for the quality and performance of its products and its services. kerone aims at producing standard and customers specific electrical tubular heater for various industrial &amp; domestic use produced as per national &amp; international standards.</p>\n\n<p>Policy KERONE is to build client specific products &amp; services to meet the growing demand for industrial and home appliances. KERONE has fully integrated Manufacturing Facalities to meet all the requirements for producing tubular electrical heater.</p>\n\n<p>Specific to the need we have state of the art machines which can produce straight, modulated, multi-dimentional and client specific heater to international standard. Our testing facility is geared to qualify all our products to national &amp; international standards. Our products are stamped and rated as per ISI: 4159.</p>\n\n<p>KERONE is comprehensively ready to meet ever increasing need of all industrial &amp; domestic requirements and is fully geared to all futuristic demand. </p>","image":{"available_sizes":[[[150,32],"assets/images/resized/0011/7266/117266v2-max-150x150.jpg"],[[250,54],"assets/images/resized/0011/7266/117266v2-max-250x250.jpg"],[[300,65],"assets/images/resized/0011/7266/117266v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}