{"first_name":"Kerry","last_name":"Kelley","permalink":"kerry-kelley","crunchbase_url":"http://www.crunchbase.com/person/kerry-kelley","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Oct 05 21:31:12 UTC 2009","updated_at":"Mon Oct 05 21:32:13 UTC 2009","overview":"<pre><code> Kerry Kelley, Vice President &amp;amp; Board member\n</code></pre>\n\n<p>Kerry is an experienced technology executive with over 25 years of increasing responsibility for operations, business strategy, product planning &amp; development. Kerry began his career as an engineer developing office and factory automation tools for Georgia Pacific Corporation while completing an MS in Management at Georgia State University in Atlanta. In 1984, Kerry joined Apple Computer as a field engineer and technology consultant, supporting the sales force with product rollouts, technical presentations and product integration efforts.</p>\n\n<p>Moving to Portland in 1989, Kerry joined Now Software as a product line manager, leveraging design principles learned at Apple to win multiple industry awards and deliver the first peer to peer desktop calendar and contact manager products. He conceived and led the development of the first browser plug-ins for portable contacts and calendar events, which eventually led to today’s vcard and vcalendar standards. Joining Extensis in 1999 as VP of Products &amp; Services, Kerry positioned and led the company through the launch of web portal creativepro.com, converted several key software products to web services, and the successful sale and integration into strategic buyer ImageX.com.</p>\n\n<p>In 2002 Kerry became VP of Product Management at SnapNames.com, leading the company through a fundamental service and business model redesign from its initial subscription offering into the largest daily online auction of domain names in the world. The shift was responsible in driving revenue from $9 to $49 million over a 2-year period and culminated in the sale of the company to strategic investor Oversee.net in the Spring of 2007. After fulfilling post-sale company integration obligations, Kerry joined Brent to co-found Second Porch.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP, Board Member","firm":{"name":"Second Porch","permalink":"second-porch","type_of_entity":"company","image":{"available_sizes":[[[150,63],"assets/images/resized/0006/1729/61729v1-max-150x150.jpg"],[[183,77],"assets/images/resized/0006/1729/61729v1-max-250x250.jpg"],[[183,77],"assets/images/resized/0006/1729/61729v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}