{"first_name":"Kerry","last_name":"Lyons","permalink":"kerry-lyons","crunchbase_url":"http://www.crunchbase.com/person/kerry-lyons","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Apr 10 02:26:48 UTC 2012","updated_at":"Tue Apr 10 02:35:47 UTC 2012","overview":"<p>Kerry Lyons manages the House Party brand, online and off.\nKerry joined House Party in 2011, determined to strengthen internally what the company excels at doing for its clients — building brand and driving sales — by infusing the House Party personality into all client and consumer touch points.</p>\n\n<p>Before joining House Party, Kerry’s passion for building brands grew over a decade at some of New York’s leading advertising agencies, where she worked on some the world’s best-known brands, including Kellogg’s, British Airways and Johnson &amp; Johnson.</p>\n\n<p>As the agency and media landscape evolved, Kerry moved into the ad targeting space, joining Mindset Media, a digital media start-up focused on psychographic targeting. There she wore many hats in research, sales and marketing while helping the Mindset Media brand and revenue grow.</p>\n\n<p>Today Kerry feels she’s found the perfect home in House Party, a company that combines her passion for building brands with an entrepreneurial spirit.</p>\n\n<p>In her spare time, Kerry enjoys reading, writing, running and retrievers…not always in that order. A graduate of Villanova University, she lives in Westchester with her husband and five children, including identical triplet boys.</p>","image":null,"degrees":[{"degree_type":"","subject":"","institution":"Villanova University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"SVP, Marketing","firm":{"name":"House Party","permalink":"house-party","type_of_entity":"company","image":{"available_sizes":[[[150,46],"assets/images/resized/0003/8719/38719v3-max-150x150.jpg"],[[250,77],"assets/images/resized/0003/8719/38719v3-max-250x250.jpg"],[[450,139],"assets/images/resized/0003/8719/38719v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}