{"first_name":"Kerry","last_name":"Langstaff","permalink":"kerry-langstaff","crunchbase_url":"http://www.crunchbase.com/person/kerry-langstaff","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Aug 05 18:05:23 UTC 2008","updated_at":"Fri Jun 11 23:57:35 UTC 2010","overview":"<p>Kerry Langstaff oversees Quova&#8217;s marketing vision and product strategy. Prior to joining Quova, she was Principal of Langstaff Communications, a marketing communications agency with clients in the networking and security industry, including Cisco Systems and Juniper Networks. Previously she was Director of Marketing for 3Com Corporation responsible for worldwide small-medium business channel development and end-user marketing communications. Prior to that she was with the Silicon Valley practice of Ketchum Public Relations, where she managed clients including Adobe Systems and Digital Equipment Corporation.</p>\n\n<p>Langstaff is the winner of 15 industry awards for public relations, direct mail, advertising and collateral campaigns. In 1990 she received Accreditation from the Public Relations Society of America. APR is a mark of distinction for public relations professionals who demonstrate their commitment to the Profession and to its ethical practice.</p>\n\n<p>Kerry holds a Bachelor of Arts degree in Public Relations from San Diego State University. She is on the Board of the Santa Clara Valley Medical Foundation and has held board positions in the Silicon Valley Chapter of the Public Relations Society of America (PRSA) and the International Association of Business Communicators (IABC).</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Vice President of Marketing ","firm":{"name":"Quova","permalink":"quova","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0002/3361/23361v1-max-150x150.png"],[[165,53],"assets/images/resized/0002/3361/23361v1-max-250x250.png"],[[165,53],"assets/images/resized/0002/3361/23361v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}