{"first_name":"Kevin","last_name":"Cheetham","permalink":"kevin-cheetham","crunchbase_url":"http://www.crunchbase.com/person/kevin-cheetham","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Nov 08 02:38:42 UTC 2011","updated_at":"Mon Mar 12 12:27:21 UTC 2012","overview":"<p>Kevin Cheetham is the Chief Financial Officer of Virtustream with global responsibility for the accounting, finance, legal and human resources functions of the company.</p>\n\n<p>Prior to joining Virtustream, Kevin was with Gladstone Management, an investment advisor of publically traded investment funds. Kevin was President of Gladstone Administration, the external administrative investment advisor which provided all accounting, SEC reporting, internal audit, treasury, legal, regulatory compliance and investor relations functions to the Gladstone Funds.</p>\n\n<p>Before Gladstone, Kevin spent 6 years at SynXis Corporation, Software as a Service (SaaS) company, where he held the roles of EVP, CFO and Treasurer. He also held executive positions, including Vice President and Controller, at TREEV, Inc. (formerly Network Imaging Corporation), a NASDAQ listed Software Company and at Mobil Oil in the internal audit and treasury departments. Kevin began his career at Arthur Andersen &amp; Co, where he was part of the New York audit practice. </p>\n\n<p>Kevin has served on the Board of Innovectra Corporation. In June of 2005, he was a finalist for CFO of the Year for the Northern Virginia Technology Council (NVTC), the Maryland Council and the DC Tech Council. He is a CPA in the State of New Jersey and the Commonwealth of Virginia and holds a BBA from the University of Massachusetts (Amherst).</p>","image":{"available_sizes":[[[110,144],"assets/images/resized/0017/7749/177749v2-max-150x150.jpg"],[[110,144],"assets/images/resized/0017/7749/177749v2-max-250x250.jpg"],[[110,144],"assets/images/resized/0017/7749/177749v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"CFO","firm":{"name":"Virtustream","permalink":"virtustream","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0005/8999/58999v5-max-150x150.jpg"],[[250,74],"assets/images/resized/0005/8999/58999v5-max-250x250.jpg"],[[300,89],"assets/images/resized/0005/8999/58999v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}