{"first_name":"Kevin","last_name":"Nesgoda","permalink":"kevin-nesgoda","crunchbase_url":"http://www.crunchbase.com/person/kevin-nesgoda","homepage_url":"http://www.inplayfilms.com","birthplace":"Seattle, WA","twitter_username":"kdn4","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1981,"born_month":8,"born_day":15,"tag_list":"","alias_list":null,"created_at":"Sat Feb 13 10:37:51 UTC 2010","updated_at":"Mon Feb 15 21:55:10 UTC 2010","overview":"<p>Has been creative ever since he can remember. He’s been writing and winning awards since he was six years old. He was a member of young author’s through grade school, started playing with his dad’s video camera (that recorded straight to VHS cassettes) and making films that involved random toys and doing unique voices for each of them.</p>\n\n<p>In High School Kevin made one of the most notorious video projects in the school’s history. The film involved car chases, a fire fight, explosions and more explosions.</p>\n\n<p>Over the next few years Kevin focused on creating well developed characters and stories throughout college as he graduated from the University of Maryland with a degree in psychology and creative writing.</p>\n\n<p>Kevin then moved to Los Angeles and began working on numerous independent projects in numerous forms, mostly uncredited shorts and features as a script editor or story supervisor.</p>\n\n<p>Soon Kevin began working producing films and finding that he was a natural at it. He put on a few shorts and did feature.</p>\n\n<p>His major success came at selling a sitcom to NBC, but the writer’s strike in 2007 and then NBC’s subsequent change of management kept the show from ever being developed.</p>\n\n<p>Since returning to Seattle Kevin focused his energies on writing, producing and this time channel his control freak energies into directing. His first two films that he has directed have won a grand prize and taken a second and third place honors at two other festivals, respectively.</p>","image":{"available_sizes":[[[150,84],"assets/images/resized/0007/7034/77034v2-max-150x150.jpg"],[[250,140],"assets/images/resized/0007/7034/77034v2-max-250x250.jpg"],[[450,253],"assets/images/resized/0007/7034/77034v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelors of Science","subject":"Psychology","institution":"University of Maryland","graduated_year":2004,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}