{"first_name":"Kevin","last_name":"B. Bacon, Ph.D.","permalink":"kevin-b-bacon-ph-d","crunchbase_url":"http://www.crunchbase.com/person/kevin-b-bacon-ph-d","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jun 21 04:25:03 UTC 2009","updated_at":"Sun Jun 21 04:25:22 UTC 2009","overview":"<p>Dr. Bacon brings almost 20 years of drug discovery, development and management experience to Axikin.  Dr. Bacon, founded Axikin’s predecessor, Actimis Pharmaceuticals, in 2004, as a spin-off from Bayer Yakuhin Ltd.’s Respiratory Research Department in Kyoto, Japan, where he served as Vice President of respiratory diseases research.  He was latterly involved in negotiating the eventual sale, in a structured acquisition, of Actimis in June 2008, and the formation of Axikin to continue development of additional pre-clinical assets.  Prior to joining Bayer AG in 1999, Dr. Bacon was Associate Director of Immunology at Neurocrine Biosciences, Inc., in San Diego, and from 1994 to 1997 a Visiting Scientist at the DNAX Institute for Molecular Biology (a subsidiary of Schering Plough).  Dr. Bacon received his B.Sc. and Ph.D. in Pharmacology from the University of London and, following post-doctoral studies, joined the Glaxo Institute for Molecular Biology (now Merck-Serono) in Geneva, Switzerland as a staff scientist focused on inflammation research. Dr. Bacon is a co-author on numerous issued and filed patents, actively contributes to journals’ peer review process, and has published over 100 original manuscripts, book chapters and reviews in the field of drug discovery and inflammation biology.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President, Founder and Chief Scientific Officer","firm":{"name":"Axikin Pharmaceuticals","permalink":"axikin-pharmaceuticals","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0004/9917/49917v1-max-150x150.jpg"],[[250,89],"assets/images/resized/0004/9917/49917v1-max-250x250.jpg"],[[254,91],"assets/images/resized/0004/9917/49917v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}