{"first_name":"Kevin","last_name":"Ranford","permalink":"kevin-ranford","crunchbase_url":"http://www.crunchbase.com/person/kevin-ranford","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Poppin","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Apr 12 13:02:06 UTC 2012","updated_at":"Wed Apr 25 08:58:58 UTC 2012","overview":"<p>Kevin Ranford is an innovative leader with extensive experience building and scaling brands via multi-channel consumer marketing programs. In April 2012, Kevin joined the Poppin team as Chief Marketing Officer. In this new role, Kevin is responsible for customer acquisition, retention and branding initiatives across all channels.</p>\n\n<p>Prior to joining Poppin, Ranford was the Vice President of Online Marketing, Mobile &amp; Social Media for 1800Flowers (NYSE: FLWS).  At 1800Flowers, Kevin was responsible for creating and leading the strategic marketing vision, with a keen focus on leveraging new and emerging channels to drive profitable customer acquisition and retention programs.  As a first-mover in Mobile Commerce, Kevin and his team won several awards for best-in-class user experience and innovation in Mobile Marketing and Technology.  Similarly in Social Media, 1800Flowers was the first in its category to implement a Social Commerce program, and has been featured in Facebook’s case studies for best-of-breed social media campaigns.</p>\n\n<p>Prior to 1800Flowers, Kevin was the Senior Marketing Manager at ProFlowers (acquired by Liberty Media, NYSE: LMCB).  Before entering the flower and gifts vertical, Kevin was Senior Marketing Manager at one of the first Internet research firms, Jupiter Research (acquired by Forrester Research, NYSE: FORR), helping build the brand to IPO and merge with Media Metrix.</p>\n\n<p>Kevin served on the Advisory Board of Send The Trend (acquired by QVC). Send the Trend is a subscription based e-commerce site for accessories and beauty.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0018/5715/185715v2-max-150x150.jpg"],[[200,200],"assets/images/resized/0018/5715/185715v2-max-250x250.jpg"],[[200,200],"assets/images/resized/0018/5715/185715v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Marketing Officer","firm":{"name":"Poppin","permalink":"poppin","type_of_entity":"company","image":{"available_sizes":[[[150,46],"assets/images/resized/0017/5962/175962v3-max-150x150.png"],[[205,63],"assets/images/resized/0017/5962/175962v3-max-250x250.png"],[[205,63],"assets/images/resized/0017/5962/175962v3-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Vice President of Online Marketing, Mobile and Social Media","firm":{"name":"1800Flowers ","permalink":"1800flowers","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}