{"first_name":"Kevin","last_name":"Mayer","permalink":"kevin-mayer","crunchbase_url":"http://www.crunchbase.com/person/kevin-mayer","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 21 02:33:57 UTC 2008","updated_at":"Wed May 21 02:48:30 UTC 2008","overview":"<p>Kevin Mayer was appointed executive vice president of the new Corporate Strategy, Business Development and Technology Group in June 2005. Mayer leads the smaller, tightly-focused group as it targets emerging businesses new to Disney&#8217;s existing portfolio, manages cross-divisional issues and opportunities, and evaluates new technology and business models. The group is responsible for aiding in the evaluation and execution of potential acquisition transactions as well.</p>\n\n<p>Mayer rejoined Disney from L.E.K. Consulting LLC, where he was a partner and head of the Global Media and Entertainment practice. In that position his responsibilities included global oversight of all media-related due diligence efforts for mergers and acquisitions, development of business strategies for new technology ventures such as portable music devices, online music services, video on demand and broadband ISP services, and the creation of comprehensive anti-piracy strategies for motion picture studios and trade associations. He also devised plans for companies to offer electronic sell-through for movies, cable television networks, television programming and music.</p>\n\n<p>Prior to L.E.K., Mayer held leading positions at interactive and Internet businesses. As chairman and CEO of Clear Channel Interactive he managed all aspects of new media business, including content, sales, business and technology development, and distribution. While at Clear Channel, Mayer successfully launched local subscription ticketing services. He also served as president and CEO of Playboy.com, Inc. where he established the overall strategy and financial plans for the interactive business.</p>\n\n<p>While at Disney, Mayer worked in both strategic planning and at Walt Disney Internet Group. At the Internet group, he served as executive vice president and as such was responsible for the operations, business plans, creative direction and distribution of Disney&#8217;s popular Web sites, including ESPN.com and ABCNews.com. Mayer first joined Disney in 1993 as manager, Strategic Planning where he spearheaded strategy and business development for all of Disney&#8217;s interactive/Internet and television businesses worldwide.</p>\n\n<p>Mayer received his M.B.A. from Harvard University in 1990, and holds a M.S.E.E. from San Diego State University and a B.S.M.E. from Massachusetts Institute of Technology.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/8987/18987v1-max-150x150.jpg"],[[200,200],"assets/images/resized/0001/8987/18987v1-max-250x250.jpg"],[[200,200],"assets/images/resized/0001/8987/18987v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://corporate.disney.go.com/corporate/management_team.html\" title=\"Disney\" rel=\"nofollow\">Disney</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Executive Vice President, Corporate Strategy, Business Development and Technology Group, The Walt Disney Company","firm":{"name":"The Walt Disney Company","permalink":"the-walt-disney-company","type_of_entity":"company","image":{"available_sizes":[[[150,73],"assets/images/resized/0001/0929/10929v1-max-150x150.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-250x250.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}