{"first_name":"Kevin","last_name":"Riley","permalink":"kevin-riley-2","crunchbase_url":"http://www.crunchbase.com/person/kevin-riley-2","homepage_url":"http://www.mylifeofriley.com/","birthplace":"Butte, Montana","twitter_username":"kevineriley","blog_url":"http://www.mylifeofriley.com/blog.htm","blog_feed_url":"http://www.mylifeofriley.com/blog/rss","affiliation_name":"Florida Blue (Blue Cross Blue Shield Of  Florida)","born_year":1971,"born_month":10,"born_day":17,"tag_list":"","alias_list":null,"created_at":"Mon Oct 29 15:11:25 UTC 2012","updated_at":"Mon Nov 05 03:10:07 UTC 2012","overview":"<p>Kevin Riley is an innovative, dynamic, and astute senior executive with over 17 years of diverse, international work experience.  For the past several years his focus has been centered on designing and selling consumer-oriented solutions for businesses, much of it in healthcare.<br/>\nThe full story of Riley’s career shows a relentless pursuit to create meaningful experiences that drive consumer behaviors, and ultimately their actions. This has been accomplished through an evolving understanding and application of design, technology, process, and innovation. As a result, Riley has built many businesses – both for himself and for others. In each case, he has applied sound business fundamentals to transform concepts into innovative and sustainable models with confirmable return on investment. Moreover, he was able to create authentic stakeholder value. \nFortunate to learn strong leadership and management skills early in his career, Riley knows that great endeavors require great teams working in concert. It is for that reason that he has applied so much focus on how to design high performing diverse teams and develop great people. Riley is known as a visionary leader that can focus a hard-charging team on a common objective, in a harmonious manner, and deliver world-class results.<br/>\nWork success at an early age validates Riley’s natural and learned leadership abilities; his secret sauce is his mix of business model innovation, customer orientation, team commitment, and technical savvy. This has enabled him to “sweat the details” while keeping focus on the larger landscape - to drive vision to a reality.  Riley is highly skilled in using technology and process engineering to create the operational efficiencies for a business to thrive. He has delivered solutions for many Fortune 1000 companies across the globe.\nThroughout his career, Riley has been active in community and professional organizations. He is a member of numerous national health, retail, and innovation groups and is a sought out speaker and thought leader on health care innovation, retail strategy, and consumerism. He has served on several company boards and acted as a mentor for many start-up ventures. Riley earned a Bachelor of Science in Chemistry with honors from Sam Houston State University and a Master of Business Administration in Entrepreneurship from Rice University. He is also the recipient of many professional, academic and athletic honors. \nProfessionally, he brings exuberance to his work and is well regarded by his co-workers as a consistent, highly energetic, and thoughtful colleague that brings creativity and an inherent enthusiasm to each and every endeavor. Personally, Kevin is a proud husband and father, committed friend, avid angler, and music aficionado. The Riley Family spends a lot of time learning about how to make a better world together, which is the same approach he brings to his professional life.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0021/7722/217722v4-max-150x150.jpg"],[[250,250],"assets/images/resized/0021/7722/217722v4-max-250x250.jpg"],[[450,450],"assets/images/resized/0021/7722/217722v4-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"Entrepreneurship, Marketing","institution":"Rice University","graduated_year":1996,"graduated_month":null,"graduated_day":null},{"degree_type":"Bachelor of Science","subject":"Chemistry and English","institution":"Sam Houston State University","graduated_year":1994,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"President/CEO","firm":{"name":"GuideWell","permalink":"guidewell","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0018/1388/181388v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0018/1388/181388v2-max-250x250.jpg"],[[450,450],"assets/images/resized/0018/1388/181388v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Chief Innovation Officer","firm":{"name":"Florida Blue (Blue Cross Blue Shield Of  Florida)","permalink":"florida-blue-blue-cross-blue-shield-of-florida","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.bizjournals.com/jacksonville/print-edition/2011/08/19/blue-cross-launches-wellness-company.html","title":"Blue Cross launches wellness company"},{"external_url":"http://www.virginiabusiness.com/index.php/news/article/got-a-minute-get-a-shot/30/","title":"Got a minute? Get a shot"},{"external_url":"http://www.ajmc.com/conferences/ahip_2012/Creating-a-Culture-of-Innovation-in-a-Highly-Regulated-Market","title":"Creating a Culture of Innovation in a Highly Regulated Market"}],"web_presences":[{"external_url":"http://www.mylifeofriley.com/","title":"Website"},{"external_url":"http://www.mylifeofriley.com/blog.htm","title":"Blog"},{"external_url":"https://twitter.com/kevineriley","title":"Twiter"},{"external_url":"http://www.linkedin.com/in/kevineriley","title":"LinkedIn"},{"external_url":"http://www.slideshare.net/MyLIfeofRiley","title":"Slide Share"}]}