{"first_name":"Kevin","last_name":"Scott","permalink":"kevin-scott","crunchbase_url":"http://www.crunchbase.com/person/kevin-scott","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"AdMob","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Oct 16 10:34:10 UTC 2007","updated_at":"Tue Jul 26 21:10:35 UTC 2011","overview":"<p>Kevin Scott is VP of Engineering at LinkedIn where he is responsible for all software development, infrastructure, developer tools, and QA.</p>\n\n<p>Previously Kevin was a Sr. Director of Engineering at Google responsible for mobile advertising. Prior he spent 3 years as VP of Engineering and Technical Operations at AdMob, a pioneering mobile advertising startup that played a significant role in the ongoing mobile application and service boom by providing the primary means of monetization and distribution for tens of thousands of mobile businesses. AdMob was acquired by Google in May 2010 and at the time was the largest M&amp;A deal ever done by Google aside from Doubleclick and Youtube.\nPrior to AdMob, Kevin was a Sr. Engineering Manager at Google leading engineering teams responsible for identifying the ads most relevant to each query on google.com and for identifying and eliminating those ads which could lead to poor user experience. Kevin also directed the team of engineers in Google&#8217;s Atlanta office who built and are continually improving the Google Web Toolkit.</p>\n\n<p>Previously at Google, Kevin founded and headed the 25-person search engineering group in Google&#8217;s New York office. This group continues to be responsible for development of search infrastructure, advanced search user interfaces, and search relevance improvements on google.com. Among many other things, these teams are responsible for the text summaries displayed with every search result, the results plus box, and sitelinks. In the deep-dark past, Kevin worked on parts of Froogle, and a number of ad projects including ad conversion feedback and workflow automation.</p>\n\n<p>While at Google, Kevin was also responsible for organizing Google&#8217;s first faculty summit, established Google&#8217;s remote office engineering education and mentoring program, helped initiate Google&#8217;s engineering leadership development program, administered the company&#8217;s engineering job satisfaction assessment program, and was involved with two successful Google acquisitions, one as engineering diligence and integration lead.</p>\n\n<p>Prior to Google, Kevin was a visiting researcher and instructor of computer science at the Institute for Informatics at the University of Goettingen in Germany. Kevin is an alumnus of the Programming Language Systems Group at Microsoft Research, of the applied mathematics group atSGI/Cray Research, and of the computational biology group at the NCSA.</p>\n\n<p>Kevin is the recipient of a Google Founders Award for technical contributions to ads engineering and is a recipient of an Intel Graduate Fellowship. Kevin is the author of five refereed research papers and a large handful of pending patent applications. Kevin was a member-at-large of the ACM Council (7/06-8/07), a founding member of the ACM Professions Board, and a recipient of an ACM Recognition of Service award for co-organizing the 1999 ICFP programming contest.</p>\n\n<p>Kevin holds an MS in computer science from Wake Forest University and a BS in computer science from Lynchburg College. Kevin has been on leave from the computer science Ph.D. program at the University of Virginia since joining Google in 2003. Kevin is also a very proud graduate of the Central Virginia Governor&#8217;s School for Science and Technology.</p>\n\n<p>Feel free to contact me by e-mail at kevin dot scott at gmail dot com.</p>","image":{"available_sizes":[[[96,141],"assets/images/resized/0003/6538/36538v2-max-150x150.jpg"],[[96,141],"assets/images/resized/0003/6538/36538v2-max-250x250.jpg"],[[96,141],"assets/images/resized/0003/6538/36538v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"VP of Engineering","firm":{"name":"LinkedIn","permalink":"linkedin","type_of_entity":"company","image":{"available_sizes":[[[150,68],"assets/images/resized/0001/1055/11055v23-max-150x150.png"],[[150,68],"assets/images/resized/0001/1055/11055v23-max-250x250.png"],[[150,68],"assets/images/resized/0001/1055/11055v23-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"VP of Engineering ","firm":{"name":"AdMob","permalink":"admob","type_of_entity":"company","image":{"available_sizes":[[[150,49],"assets/images/resized/0000/0172/172v5-max-150x150.png"],[[250,81],"assets/images/resized/0000/0172/172v5-max-250x250.png"],[[300,98],"assets/images/resized/0000/0172/172v5-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Operations/Engineering Executive","firm":{"name":"AdMob","permalink":"admob","type_of_entity":"company","image":{"available_sizes":[[[150,49],"assets/images/resized/0000/0172/172v5-max-150x150.png"],[[250,81],"assets/images/resized/0000/0172/172v5-max-250x250.png"],[[300,98],"assets/images/resized/0000/0172/172v5-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Development","firm":{"name":"eCampus.com","permalink":"ecampus-com","type_of_entity":"company","image":{"available_sizes":[[[150,19],"assets/images/resized/0011/6296/116296v2-max-150x150.jpg"],[[250,32],"assets/images/resized/0011/6296/116296v2-max-250x250.jpg"],[[450,57],"assets/images/resized/0011/6296/116296v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}