{"first_name":"Kevin","last_name":"Callahan","permalink":"kevin-callahan","crunchbase_url":"http://www.crunchbase.com/person/kevin-callahan","homepage_url":"http://www.mapmyfitness.com","birthplace":"Amman, Jordan","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"MapMyFitness","born_year":null,"born_month":null,"born_day":null,"tag_list":"fitness-startup-marketing-product-founder-health","alias_list":null,"created_at":"Thu Jul 22 14:47:56 UTC 2010","updated_at":"Fri Nov 11 18:09:42 UTC 2011","overview":"<p>Kevin is currently the co-founder and VP of Innovation Strategy at MapMyFitness, a VC-backed (led by Austin Ventures) health and fitness company based in Austin, TX and Denver, CO.</p>\n\n<p>Kevin first became infatuated with technology as a kid — His first computer was a Commodore VIC-20 back in 1982. As the son of a State Department Diplomat, Kevin grew up moving around the world most of his childhood. From the middle east to asia and back again through africa. He&#8217;s also the proud product of a british boarding school education when he graduated from a small international college (highschool) in Swaziland.</p>\n\n<p>Kevin  attended Johns Hopkins University and received his BSc. in Mechanical Engineering (minor Economics) and was all set to join the ranks of rocket scientists everywhere.  He had spend 4 years building a background in thermal systems, worked at NASA, and was excited about the potential of joining a young aerospace startup like Orbital or Rotary Rockets.  However in his senior year of college Kevin discovered the dot-com world … and started his first company: EzMeals.com — an online good delivery system geared around college campuses.  Think DiningIn.com for colleges</p>\n\n<p>He was hooked – After graduating he moved to Boston and became employee #8 at another start-up that was geared around political news and information.  Voter.com would balloon to about 130 employees, raise (and spend) $30M, and last 2 years.  It was an exciting time to be a part of a start-up.  Lots of lessons learned …</p>\n\n<p>From there Kevin went on to work for several more start-ups — mobile software for the model/talent industry, online travel insurance products, and even a stint as a mgmt consultant (siebel) in the banking world.  His most fun gig was working as the Director of Development @ POPstick / a young interactive marketing agency that created personalized flash ads for companies like IBM, Microsoft, DuPont and more.  It was fun, it was hip, the CEO even made it on The Apprentice.  Needless to say he learned a lot of life lessons from that experience — not all of them positive. </p>\n\n<p>After Kevin left POPstick  he again went the route of online travel insurance — it was a unique product niche at the time with a lot of opportunities.  Post 9/11 however saw a lot of larger underwriters collapse their exotic offerings and this became more challenging.  The good part about that story was Kevin moved to San Diego to be poor and happy as he could live on the beach.  </p>\n\n<p>In San Diego he started the Callahan Group — a web/business consulting company where my projects ranged from real estate to telecommunications.  He then was hired as a full-time as a technical architect at SiteLab, a seo/interactive marketing agency in La Jolla. </p>\n\n<p>MapMyRun was officially born in the spring of 2005. Kevin developed the application for himself while I was training for a marathon. As his network of friends and Team in Training teammates learned about it, they pressured him to put the application online so that they could plot routes, share routes, etc. Putting the application online allowed Kevin to combine my running passion with his work experience in Internet development and marketing. </p>\n\n<p>MapMyRun then became MapMyFitness, Inc. and received a series-A round of financing lead by Austin Ventures in the summer of 2010.  MapMyFitness is now headquartered in Austin, TX with offices in Denver, CO and Boston, MA.</p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0010/4760/104760v2-max-150x150.jpg"],[[163,218],"assets/images/resized/0010/4760/104760v2-max-250x250.jpg"],[[163,218],"assets/images/resized/0010/4760/104760v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bsc","subject":"Mechanical Engineering","institution":"Johns Hopkins","graduated_year":1999,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"VP of Innovation Strategy & Co-Founder","firm":{"name":"MapMyFitness","permalink":"mapmyfitness","type_of_entity":"company","image":{"available_sizes":[[[150,32],"assets/images/resized/0009/4572/94572v2-max-150x150.png"],[[197,43],"assets/images/resized/0009/4572/94572v2-max-250x250.png"],[[197,43],"assets/images/resized/0009/4572/94572v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}