{"first_name":"Kevin","last_name":"Ross","permalink":"kevin-ross","crunchbase_url":"http://www.crunchbase.com/person/kevin-ross","homepage_url":"","birthplace":"Des Moines, Iowa","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1974,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Feb 08 20:55:44 UTC 2011","updated_at":"Tue Feb 15 01:04:54 UTC 2011","overview":"<p>Kevin Ross is an entrepreneur with a passion for bootstrapping and building profitable, sustainable companies that make a difference.</p>\n\n<p>Born in 1974 in Des Moines, Iowa, Kevin grew up around the central United States. Empowerment was never a question as a child, Kevin’s mother, step-father, uncle, and grandfather were all entrepreneurs, with each generation achieving greater successes.  Having lived in five different states throughout childhood, Kevin graduated high school in 1992,  then subsequently enrolled and graduated from Iowa State University in 1997 with a bachelors of science in management information systems.</p>\n\n<p>Kevin went on to work as a consultant for Tallan in 1998, developing software during the internet boom for companies such as Barnes and Noble and Ingram Micro before entering his first entrepreneurial venture.  Forming a company named e-GTG with an experienced ex-IBM global services consultant in 2000, Kevin brought the staff and landed the first two customers: Answers.com and Visa.  This venture was to be short lived, and Kevin learned very early that not all partners are created equal.</p>\n\n<p>Taking a break from the west coast technology boom, Kevin worked briefly in Iowa before moving to Nashville, Tennessee to work on a small startup called Bredex for the then to-be governor Phil Bredesen in 2001.  Bredex was sold to McGraw-Hill shortly before Bredesen launched his campaign for governor, and Kevin moved on to help another Tennessee company take on a challenging project.  In 2003, Kevin audited a project for Total E-Med, now Spheris.  An audit engagement quickly turned into a full time position, and Kevin thought he was well on his way down the path to be a corporate CIO.  Given the success of Spheris in 2005, the company was recapitalized and the executive management moved on.  Triggered by the arrival of new executive management, Kevin began to doubt his corporate path, and began to look again for an opportunity to set a new path as an entrepreneur.</p>\n\n<p>With a well-timed pink slip in-hand, Metova began as an ad-hoc game of scrabble in the Spring of 2006.  Searching for the opportunity, Kevin identified the mobile market would follow many trends seen through the 1990’s and early 2000’s.\nWith extensive experience in professional services, a five week runway, $8,000 charged to a credit card and a properly outfitted home office, Kevin set out with a laundry list that included establishing a brand identity, legal contracts, a company website, foundation technologies, and a partnership with Research in Motion.  On week two, Kevin landed Metova’s first client.</p>\n\n<p>Six months later, Metova, with several clients in tow, hired it’s first full time employee and moved into our first office.  Over the first two years, the first ten employees saw much change and were critical in establishing the lean financial, operational, and development processes that Metova uses as a baseline today.\nThree offices and just as many years later, Metova has grown to more than twenty employees that assist with all aspects of smartphone development including strategy, design, development, quality assurance, as well as providing cloud services to support application provisioning and in-application payment.  Metova now ranks among the best in the world in mobile application development.</p>","image":{"available_sizes":[[[147,150],"assets/images/resized/0012/1061/121061v2-max-150x150.jpg"],[[246,250],"assets/images/resized/0012/1061/121061v2-max-250x250.jpg"],[[443,450],"assets/images/resized/0012/1061/121061v2-max-450x450.jpg"]],"attribution":"<p>Jess Linares</p>"},"degrees":[{"degree_type":"Bachelors","subject":"MIS","institution":"Iowa State University","graduated_year":1997,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President and Founder","firm":{"name":"Metova","permalink":"metova","type_of_entity":"company","image":{"available_sizes":[[[150,35],"assets/images/resized/0012/1065/121065v2-max-150x150.png"],[[176,42],"assets/images/resized/0012/1065/121065v2-max-250x250.png"],[[176,42],"assets/images/resized/0012/1065/121065v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}