{"first_name":"Kevin","last_name":"Hailstock","permalink":"kevin-hailstock","crunchbase_url":"http://www.crunchbase.com/person/kevin-hailstock","homepage_url":"","birthplace":"Washington DC","twitter_username":"kbhincontact","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1978,"born_month":12,"born_day":22,"tag_list":"","alias_list":null,"created_at":"Sat Jul 14 00:42:24 UTC 2012","updated_at":"Sat Jul 14 23:16:58 UTC 2012","overview":"<p>Kevin Hailstock is a serial internet entrepreneur with internationally recognized certifications as an internet specialist, master developer, and e-commerce specialist.  In 2001 shortly after 9-11 post “.com bubble”, he co-founded Web Emerse, a web and voice technology firm which is focused on immersing individuals and organizations in the opportunities afforded by the internet to reach their end audience, strengthen their brands, and become more effective. </p>\n\n<p>In the years following Web Emerse’s inception, Hailstock has continually demonstrated the ability to build, motivate and lead globally oriented teams. He and Web Emerse have been engaged with a diverse range of clients from startups and entrepreneurs to non-profits such as 4-H, global hotel brands such as Hilton, the federal government,  National Institutes of Health (NIH) and a host of others.</p>\n\n<p>His expertise and focus on innovation has led to him educating mayors, for the National Conference of Black Mayors, on technology tools and how they relate to economic development. As early as 2005 he presented at a National Conference on a panel with Verizon and XM about “Digital Lifestyles – Phone Applications”. And in 2009 authored a paper “The Social Networking Effect on Management and Business”, published at the 2009 National Association of Management and Business (NAMB). </p>\n\n<p>Kevin Hailstock’s achievements early in his professional career have earned him recognition as a 2003 Top “40 Under Forty” awardee, by The Network Journal of NY. He was also named as one of 12 Top Minority Business Leaders 40 &amp; Under by The Source Magazine/ MD/DC Supplier Development Council, and profiled as “One to Watch” by the Minority Enterprise Advocate magazine. </p>\n\n<p>Hailstock’s civic involvement includes serving on committees of several local and international organizations. He is Technology Chair for the DC chapter of an international mentoring organization, and has served on the National Technology Committee, and as VP of Technology for the DC Chapter of the National Alliance of Market Developers. Also he was a Founding Donor and Charter Class mentor of the BEST Kids Mentor Program in Washington, DC. All of which led him to being named an Essence magazine  “Do-Right Man ” (2007)</p>\n\n<p>Hailstock is a two time graduate of Darden Business Executive programs and the Silicon Valley based Founder Institute Start-up accelerator. His latest venture Insightful Art for which he won the 2012 New York Entrepreneur week “Inferno” (business) pitch contest - seeks to make it easy for everyone to be an artist by giving users intelligent building blocks based on the personality and preferences, of the recipient. </p>","image":{"available_sizes":[[[77,107],"assets/images/resized/0020/0903/200903v2-max-150x150.jpg"],[[77,107],"assets/images/resized/0020/0903/200903v2-max-250x250.jpg"],[[77,107],"assets/images/resized/0020/0903/200903v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BS","subject":"Architecture","institution":"University of Virginia","graduated_year":2000,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}