{"first_name":"Kevin","last_name":"Hunter Memphis","permalink":"kevin-hunter-memphis","crunchbase_url":"http://www.crunchbase.com/person/kevin-hunter-memphis","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jul 16 13:42:38 UTC 2012","updated_at":"Mon Jul 16 21:02:02 UTC 2012","overview":"<p>Kevin Hunter Memphis is not your regular guy on the street. With a well rounded background in different business industries, he is poised to become the next top business professional. His education and early career choices have helped shape him into what he is today. </p>\n\n<p>Education</p>\n\n<p>He received his business degree from the University of Mississippi, majoring in marketing. The marketing course in his university covers the core of Business and Liberal Arts. It is from there that he acquired all the skills necessary to become a successful marketer, such as marketing research, consumer behavior, marketing globally, strategy and human resource management. When he finally graduated with a BS in Marketing, he was ready to take on the challenges in the real world. </p>\n\n<p>Early Career Choices</p>\n\n<p>Upon graduation, he managed to secure his first job in the automotive industry. Under his tenure as the General Manager for the multi-franchise automotive dealership, he has successfully managed all aspects of the $1.8 million operating budget, including being their dealer principal. He propelled his career further by taking up the position of Executive Director for Cellular One. As a board member, he dealt mainly with strategic liaison with an operating budget of $2.8 million annually. After Cellular One was sold to a telecommunications firm, he started his own advertising agency called Hunter, Mullinix and Lee (HML), which went on to win an award. The firm was later sold to three minority partners. </p>\n\n<p>Venturing into Sports </p>\n\n<p>Kevin Hunter Memphis has always been a huge sports fan. His foray into the sports arena started when he founded and managed the Memphis Pharaohs Arena Football team. He was responsible for directing business operations for the team. Under his leadership, the team had successfully clinched several league sponsorship and network television deals. He personally facilitated the team transition when it moved to Portland, Oregon. Later, he started Corporate Management Group to venture into motorsports arena. </p>\n\n<p>Insurance and Gaming</p>\n\n<p>He began his career in insurance as a commercial lines producer for Federated Insurance. In a relatively short period of time, he managed to make his way up to Chairman&#8217;s Council member designation where he achieved Chairman&#8217;s TOP 11 sales volume in just three years. From there, he expanded his role to Vice President at HUB International. After a successful run in the insurance industry, he moved on to the gaming industry where he led a $130 million major casino redevelopment in the Tunica. The success of the project had landed him the position of CEO at Riverton Tunica LLC. </p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/1190/201190v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/1190/201190v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/1190/201190v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}