{"first_name":"Kevin","last_name":"Desouza","permalink":"kevin-desouza","crunchbase_url":"http://www.crunchbase.com/person/kevin-desouza","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"iHear Network","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Tue Sep 27 21:33:43 UTC 2011","updated_at":"Thu Jul 19 01:10:28 UTC 2012","overview":"<p>Associate Dean for Research at the College of Public Programs at Arizona State University. </p>\n\n<p>Prior to ASU, Desouza was the director of the Metropolitan Institute and an associate professor at the Center for Public Administration and Policy at Virginia Tech. Before joining Virginia Tech, he was an associate professor at the University of Washington (UW) Information School and held adjunct appointments in the UW’s College of Engineering and at the Daniel J. Evans School of Public Affairs. At UW, he co-founded and directed the Institute for Innovation in Information Management (I3M); founded the Institute for National Security Education and Research, an inter-disciplinary, university-wide initiative, in August 2006 and served as its director until February 2008; and was an affiliate faculty member of the Center for American Politics and Public Policy. He holds a visiting professorship at the Faculty of Economics, University of Ljubljana. He has held visiting positions at the Center for International Studies at the London School of Economics and Political Science, the University of the Witwatersrand in South Africa, the Groupe Sup de Co Montpellier (GSCM) Business School in France, and the Accenture Institute for High Business Performance in Cambridge, Massachusetts (USA).  In the private sector, he founded the Engaged Enterprise and its think-tank, the Institute for Engaged Business Research. The Engaged Enterprise was a global strategy consulting firm with expertise in the areas of knowledge management, crisis management, strategic deployment of information systems, and government and competitive intelligence assignments.</p>\n\n<p>Desouza has authored, co-authored, and/or edited nine books and has published more than 125 articles in prestigious practitioner and academic journals. His work has also been featured by a number of publications such as Sloan Management Review, Harvard Business Review, Businessweek, Washington Internet Daily, Computerworld, KM Review, Government Health IT, and Human Resource Management International Digest. He has been interviewed by the press on outlets such as Voice of America, Manager (Slovenia), among others. He has been invited to edit special issues of several prominent journals such as Technology Forecasting and Social Change, Information Systems Journal, and the Journal of Strategic Information Systems, among others. In addition, he serves on a number of editorial boards, including the board of the Journal of Strategic Information Systems, and has reviewed research for government agencies such as the Research Council of Norway, the Finnish Funding Agency for Technology and Innovation, the National Research Foundation of South Africa, and the Qatar National Research Fund-Qatar Foundation, among others.</p>\n\n<p>Desouza has advised, briefed, and/or consulted for major international corporations and government organizations on strategic management issues ranging from management of information systems, to knowledge management, competitive intelligence, government intelligence operations, and crisis management. He is frequently an invited speaker on a number of cutting-edge business and technology topics for national and international, industry, and academic audiences. He has given more than sixty invited talks in a wide assortment of venues. Desouza has received over $1.4 million in research funding from both private and government organizations.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0020/1561/201561v2-max-150x150.jpg"],[[165,250],"assets/images/resized/0020/1561/201561v2-max-250x250.jpg"],[[199,300],"assets/images/resized/0020/1561/201561v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"PhD","subject":"Management of Information Systems","institution":"University of Illinois at Chicago","graduated_year":2006,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"Information Management","institution":"Illinois Institute of Technology","graduated_year":2001,"graduated_month":null,"graduated_day":null},{"degree_type":"B.Sc","subject":"Accounting and Information & Decision Sciences","institution":"University of Illinois at Chicago","graduated_year":2000,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Advisor","firm":{"name":"iHear Network","permalink":"ihear-network","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0012/3884/123884v5-max-150x150.png"],[[250,250],"assets/images/resized/0012/3884/123884v5-max-250x250.png"],[[256,256],"assets/images/resized/0012/3884/123884v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"https://www.facebook.com/kevincdesouza","title":""},{"external_url":"https://twitter.com/KevDesouza","title":""}],"web_presences":[{"external_url":"http://www.kevindesouza.net","title":""}]}