{"first_name":"Kevin","last_name":"B. Bacon","permalink":"kevin-b-bacon","crunchbase_url":"http://www.crunchbase.com/person/kevin-b-bacon","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jun 06 15:18:34 UTC 2009","updated_at":"Sat Jun 06 15:18:58 UTC 2009","overview":"<p>Dr. Bacon founded Actimis as a spin-off from Bayer Yakuhin Ltd.’s Respiratory Research Department in Kyoto, Japan. Dr. Bacon was most recently Vice President for Respiratory diseases research with line and matrix management responsibilities for respiratory small molecule therapeutic development company-wide. Dr. Bacon was also involved in establishing and managing major corporate collaborations and partnerships (Oxford Glycosciences, Entelos, Lion, Galapagos Genomics, Inc., as well as numerous academic and Institutional collaborations). Prior to joining Bayer in 1999, Dr. Bacon was Associate Director of Immunology at Neurocrine Biosciences, Inc., in San Diego, and from 1994 to 1997 a Visiting Scientist at the DNAX Institute for Molecular Biology (a subsidiary of Schering Plough), in Palo Alto. Dr. Bacon received his B.Sc. and Ph.D. in Pharmacology from the University of London (King’s College and United Medical and Dental Schools of Guy’s and St. Thomas’, respectively) and following post-doctoral studies, joined the Glaxo Institute for Molecular Biology (now Serono) in Geneva, Switzerland as a staff scientist focused on inflammation research. Dr. Bacon has published over 100 original manuscripts, book chapters and reviews and has been a regular contributor of original research to the field of chemokine biology since its inception with specific interest, and pioneering many studies, in the signaling mechanisms of these molecules and their biological roles in cells of the immune system.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder, CSO and Head of Research & Development ","firm":{"name":"Actimis Pharmaceuticals","permalink":"actimis-pharmaceuticals","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0004/7125/47125v1-max-150x150.jpg"],[[230,70],"assets/images/resized/0004/7125/47125v1-max-250x250.jpg"],[[230,70],"assets/images/resized/0004/7125/47125v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}