{"first_name":"Kevin","last_name":"L. Kemmerer","permalink":"kevin-l-kemmerer","crunchbase_url":"http://www.crunchbase.com/person/kevin-l-kemmerer","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Sep 23 21:25:29 UTC 2008","updated_at":"Wed May 05 01:06:26 UTC 2010","overview":"<p>As a member of Safeguard’s executive team, Kevin uses his market insight, business acumen and strategic vision to identify opportunities for Safeguard to partner with entrepreneurial companies in financial and fintech/payments, healthcare IT and Internet-based businesses.</p>\n\n<p>Kevin evaluates new opportunities and provides strategic and operational leadership to Safeguard and its rapidly growing partner companies. With over 10 years of experience in supporting entrepreneurs through venture capital, consulting, M&amp;A transactions and strategic planning, Kevin has a deep understanding of the challenges and opportunities facing Safeguard partner companies.</p>\n\n<p>Kevin has provided capital to and served in senior management positions with companies representing all stages of growth. Prior to joining Safeguard in June 2004, Kevin was a director with Kennet Venture Partners, where he sourced and managed software and technology-enabled services investments. He also served as a principal at Broadview International, where he co-led the firm’s Silicon Valley team focused on mergers and acquisitions in the software applications market. Earlier in his career, he was a manager in Deloitte &amp; Touche’s Management Consulting practice and a software developer at Salomon Brothers.</p>\n\n<p>Kevin received his MBA with a concentration in Entrepreneurial Management from The Wharton School of the University of Pennsylvania, and his BE in\nElectrical Engineering and Computer Science from Vanderbilt University.</p>\n\n<p>Kevin has established himself as a leader in the technology industry, having recently been recognized with the Philadelphia Business Journal’s ’40 under 40’ Award in 2008. Additionally, Kevin is a member of the Mid-Atlantic Capital (MAC) Alliance and the IT Investment Advisory Committee for the Ben Franklin Technology Partners of Southeastern Pennsylvania. He is also on the board of the Association for Corporate Growth (ACG) and serves as co-chair for ACG Philadelphia’s Program Committee. Additionally, he has served as a judge for the Eastern Technology Council’s Enterprise Awards. Kevin is a founding member of MindShare Philadelphia, a forum designed for aspiring technology and life sciences CEOs to collaborate and learn from their peers. He is also a member of the Board of Directors for Safeguard’s portfolio companies Advantedge Healthcare Solutions, Authentium and Bridgevine.</p>\n\n<p>EXPERIENCE</p>\n\n<pre><code>* Kennet Venture Partners – Director\n* Broadview International – Principal, M&amp;amp;A\n* Deloitte &amp;amp; Touche – Manager, Management Consulting\n* Salomon Brothers – Senior Programmer / Analyst\n</code></pre>\n\n<p>BOARD MEMBER\nSafeguard Partner Companies</p>\n\n<pre><code>* Advantedge Healthcare Solutions, Inc.\n* Authentium, Inc.\n* Bridgevine, Inc.\n</code></pre>\n\n<p>Independent Organizations</p>\n\n<pre><code>* Association for Corporate Growth (ACG) – Program Committee Co-Chair\n* Ben Franklin Technology Partners – Investment Advisory Board\n</code></pre>\n\n<p>EDUCATION</p>\n\n<pre><code>* BEE, Vanderbilt University\n* BCS, Vanderbilt University\n* MBA, The Wharton School\n</code></pre>","image":{"available_sizes":[[[108,150],"assets/images/resized/0002/5529/25529v1-max-150x150.jpg"],[[159,220],"assets/images/resized/0002/5529/25529v1-max-250x250.jpg"],[[159,220],"assets/images/resized/0002/5529/25529v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"","institution":"The Wharton School, University of Pennsylvania","graduated_year":1997,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"EVP and Managing Director, Technology Group, Technology Group","firm":{"name":"Safeguard Scientifics","permalink":"safeguard-scientifics","type_of_entity":"company","image":{"available_sizes":[[[150,31],"assets/images/resized/0006/7104/67104v3-max-150x150.jpg"],[[250,51],"assets/images/resized/0006/7104/67104v3-max-250x250.jpg"],[[450,93],"assets/images/resized/0006/7104/67104v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}