{"first_name":"Kevin","last_name":"O'Leary","permalink":"kevin-oleary","crunchbase_url":"http://www.crunchbase.com/person/kevin-oleary","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Tue Mar 29 08:48:20 UTC 2011","updated_at":"Fri Apr 01 01:19:46 UTC 2011","overview":"<p>Kevin O&#8217;Leary is an entrepreneur, venture capitalist, and television host.</p>\n\n<p>O&#8217;Leary started his own software company in his basement along with his 5 year partner Gary Babcock. His mother provided the seed investment of $10,000 which he used to start software publisher SoftKey. His partner Gary left just as numerous mergers and acquisitions allowed the company to become The Learning Company and O’Leary took control as president of the Boston based company. In 1999, the Learning Company was sold to Mattel for $3.7 billion USD.</p>\n\n<p>In 2003 he became co-investor and a director in Storage Now, a developer of climate controlled storage facilities. Through a series of development projects and acquisitions, Storage Now became Canada’s third largest owner/operator of storage services with facilities located in eleven cities serving such companies as Merck and Pfizer when it was acquired by the In Storage REIT in March 2007 for $110 million.</p>\n\n<p>In March 2007 O&#8217;Leary joined the advisory board of Genstar Capital, a private equity firm that focuses on investments in selected segments of life science and healthcare services, industrial technology, business services and software. Genstar Capital appointed O&#8217;Leary to its Strategic Advisory Board to seek new investment opportunities for its $1.2 billion fund. Kevin now has an office in West Palm Beach Florida.</p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0012/8224/128224v1-max-150x150.jpg"],[[187,250],"assets/images/resized/0012/8224/128224v1-max-250x250.jpg"],[[240,320],"assets/images/resized/0012/8224/128224v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}