{"first_name":"Kieran","last_name":"Galvin","permalink":"kieran-galvin-2","crunchbase_url":"http://www.crunchbase.com/person/kieran-galvin-2","homepage_url":"","birthplace":"Ireland","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1966,"born_month":5,"born_day":5,"tag_list":"","alias_list":null,"created_at":"Tue Jul 19 13:24:00 UTC 2011","updated_at":"Fri Jul 22 18:16:24 UTC 2011","overview":"<p>Kieran Galvin is a co-founder and CEO of igobubble, a mobile app that integrates location-aware social networking with continuously evolving digital content.</p>\n\n<p>He has a background in raising capital for unlisted trusts and syndicates and has held senior management roles for 15 years.</p>\n\n<p>Kieran is also CEO of Lumnus Media, which includes three other companies, namely: SAE Institute, B4 Film, Animation and Mobile Apps, and Luminus Television Centre.</p>\n\n<p>The three companies have natural synergies. SAE is the world&#8217;s largest media arts institute (one of 52 campuses in 23 countries) providing diploma to degree training in Film &amp; TV Production, Audio Engineering, Animation, Digital Journalism, Game Design and Multimedia. In addition to managing SAE Jordan, Kieran is responsible for expanding the brand in Egypt, Lebanon, Saudi Arabia, Iraq, Tunisia, Bahrain, and Morocco.</p>\n\n<p>B4 is a full-service production house covering 2D and 3D animation, along with film and video production for TVCs, corporates and documentaries, local production services for international films, and designing and developing mobile apps.</p>\n\n<p>Luminus Television Centre consists of 3 HD TV broadcast studios.</p>\n\n<p>All these businesses including a wide range of production and post-production studios - plus a specialist catering company and tech division, are under one roof.</p>\n\n<p>Kieran is also an accomplished film director. His feature films &#8220;Puppy&#8221; and &#8220;Feed&#8221; have been distributed in cinemas in New Zealand and the UK, and worldwide on DVD.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0014/5095/145095v2-max-150x150.jpg"],[[179,179],"assets/images/resized/0014/5095/145095v2-max-250x250.jpg"],[[179,179],"assets/images/resized/0014/5095/145095v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}