{"first_name":"Kieve","last_name":"Huffman","permalink":"kieve-huffman-2","crunchbase_url":"http://www.crunchbase.com/person/kieve-huffman-2","homepage_url":"http://www.dather.com","birthplace":"","twitter_username":"kh2468","blog_url":"http://blog.dather.com","blog_feed_url":"http://feeds.feedburner.com/TheOfficialDatherBlog?format=xml","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"social-media, photos, video, curation, organization, crowdsourcing, timeline, aggregation","alias_list":null,"created_at":"Wed Jul 28 20:28:14 UTC 2010","updated_at":"Wed Jul 28 20:35:25 UTC 2010","overview":"<p>Kieve is an accomplished digital media executive recognized for leadership ability and strategic vision with a proven track record of successes building digital media businesses.</p>\n\n<p>He is a digital media pioneer at the forefront of recognizing growth opportunities, creating innovative policies and forming new and unique operational business units. He&#8217;s had multiple successes in senior leadership positions with responsibilities for increasing revenues, creating business strategies and optimizing business operations in digital entertainment.</p>\n\n<p>Currently, Kieve is the Co-Founder of Dather.  Dather was created because the world needs a better way to organize and share media. Currently social media is scattered across the web: Facebook, YouTube, Flickr, Twitter, etc. It&#8217;s unorganized and it gets harder and harder to find anything over time. 30 billion pieces of this content are shared monthly on Facebook alone.</p>\n\n<p>Dather lets you collaboratively organize and curate photos, videos, blog posts, and tweets in one place. And it&#8217;s all on a timeline so it&#8217;s easy to find and share.</p>\n\n<p>His primary focus is on business development, investor relations, sales, and operations.  www.dather.com</p>","image":{"available_sizes":[[[118,150],"assets/images/resized/0009/5263/95263v2-max-150x150.jpg"],[[196,250],"assets/images/resized/0009/5263/95263v2-max-250x250.jpg"],[[354,450],"assets/images/resized/0009/5263/95263v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}