{"first_name":"Kihong","last_name":"Bae","permalink":"kihong-bae","crunchbase_url":"http://www.crunchbase.com/person/kihong-bae","homepage_url":"","birthplace":"South Korea","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"MusicShake","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Feb 05 22:41:34 UTC 2008","updated_at":"Mon May 19 22:46:39 UTC 2008","overview":"<p>Kihong Bae is the General Manager of Musicshake (http://musicshake.com), which is the first UGM (User Generated Music) company which allows anyone to create great music and share it with the world.</p>\n\n<p>Korean by birth, he grew up in Spain so was exposed to diversity ever since small. Kihong did his undergrad in Korea, and master’s at Stanford which is where he was mesmerized by the dynamics of Silicon Valley. Seeing all these entrepreneurs on campus (Jerry Yang, Larry Page etc..) stimulated his entrepreneurial juices.</p>\n\n<p>After school, Kihong worked for a PKI security startup called ValiCert which later got acquire by Tumbleweed Communications. Then went back to Korea to work with friends from MIT on a Korean Supply Chain Management solutions startup that’s still around. After 3 yrs at Zionex (the Supply Chain Management Company), he decided to get some exposure to the corporate world and worked as the Senior Marketing Manager at Microsoft Korea. He is currently doing his MBA at Wharton School, and working part-time as Musicshake’s Director.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"General Manager","firm":{"name":"Musicshake","permalink":"musicshake","type_of_entity":"company","image":{"available_sizes":[[[150,18],"assets/images/resized/0000/0208/208v1-max-150x150.jpg"],[[250,30],"assets/images/resized/0000/0208/208v1-max-250x250.jpg"],[[339,42],"assets/images/resized/0000/0208/208v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}