{"first_name":"Kimberlee","last_name":"White","permalink":"kimberlee-white-2","crunchbase_url":"http://www.crunchbase.com/person/kimberlee-white-2","homepage_url":"http://www.akmg.com","birthplace":"Los Angeles, CA","twitter_username":"akmgalerts","blog_url":"http://www.akmg.com/blog.html","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 29 22:10:45 UTC 2010","updated_at":"Wed Jun 30 19:50:11 UTC 2010","overview":"<p>Kimberlee White, the eldest sibling in a family of five from Southern California, took the soccer field by storm at age 6 and turned her talent into a Division I women&#8217;s college soccer scholarship at the University of California, Berkeley. After college, Kim switched focus to the world of marketing and showed her marketing prowess to financial giants like Arthur Andersen, Capital Research Group and HLHZ.</p>\n\n<p>When marketing money actually grew tiresome, Kim tackled the Internet advertising scene. She pioneered numerous successful online marketing campaigns for companies like Infosearch, Virtumundo and Hydra LLC, an LA based, Inc 500 ranked affiliate network. In her sales career, Kim has hired and trained over 100 sales executives and developed dozens of successful CPA advertising campaigns for well known and branded advertisers. Kim has a crucial understanding of the quality traffic that advertisers need in order to be successful and profitable in the CPA space, setting her reputation apart from many.</p>\n\n<p>Kim has met her greatest rewards and challenges as the President and Co-Founder of AKMG. With over a decade of experience in offline and online marketing, sales and client relations, Kim brings AKMG marketing knowledge and business strategy that cannot be easily replicated and continues to pioneer the growth and profitability of AKMG and it&#8217;s industry partners.</p>","image":{"available_sizes":[[[126,150],"assets/images/resized/0009/2044/92044v2-max-150x150.jpg"],[[211,250],"assets/images/resized/0009/2044/92044v2-max-250x250.jpg"],[[380,450],"assets/images/resized/0009/2044/92044v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/kimberleewhite","title":"LinkedIn"}]}