{"first_name":"Kimberley","last_name":"Partoll","permalink":"kimberley-partoll","crunchbase_url":"http://www.crunchbase.com/person/kimberley-partoll","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"AOL","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Mar 24 16:58:21 UTC 2008","updated_at":"Fri Jul 16 18:45:31 UTC 2010","overview":"<p>Kimberley A. Partoll is currently Chairman of the Board of NY-based PeekYou.com (http://www.peekyou.com), a free people-search engine, whose database contains public records and internet data for over 230 million people, and is growing every day. The information it collects about specific individuals includes real name, age, sex, physical address, e-mail address, online aliases, photos, blogs, personal profiles on popular websites, interests, schools, work history, etc.—and is packaged in individual profiles about each person. PeekYou searches and indexes people just as Google does with websites. PeekYou&#8217;s deep data is a unique resource through which businesses can acquire knowledge about their current and potential customers and thus execute highly targeted ad campaigns. The idea behind the database began in April 2006: the website was released a few months later in stealth mode, and now ranks as a top 5,000 web destination.</p>\n\n<p>As COO of AOL until October 1, 2009, Partoll oversaw the execution of AOL’s strategic areas, with a focus on expanding AOL’s offerings globally and to mobile platforms. Partoll’s operating scope included Business Development, Business Intelligence, Consumer and Brand Marketing, Mobile, Product Experience and Innovation. In addition, she managed AOL’s Access division, which included AOL’s subscription businesses, as well as AOL’s Global Operating Council.  </p>\n\n<p>With more than 20 years of marketing and general management experience in the telecommunications, cable, and Internet industries, Partoll joined AOL in 2002 as Senior Vice President, Broadband Marketing. At AOL, Partoll has also served as an Executive Vice President in various roles, including Marketing, Business Intelligence, and New Ventures.</p>\n\n<p>Partoll came to AOL from the cable industry.  At AT&amp;T Broadband, she served as Vice President, Marketing and Operations, and was responsible for leading the corporate marketing organization for its &#8220;triple play&#8221; bundle of video, telephony, and high-speed data products across a footprint of 28 million U.S. homes.\nPartoll began her career at AT&amp;T in the consumer long-distance business and held a variety of positions in consumer marketing, product management, and operations.  In 2000, Partoll rose to the executive rank at AT&amp;T and was responsible for managing AT&amp;T&#8217;s 67 million customers and a multi-billion-dollar revenue stream.</p>\n\n<p>Partoll attended the Executive Education Program at the Dartmouth College Amos Tuck School of Business and holds a bachelor&#8217;s degree in history from Duke University. She is an active mentor for various diversity groups and individuals at AOL, and a speaker for industry associations including Cable &amp; Telecommunications Association for Marketing and Women in Cable and Telecommunications.</p>","image":{"available_sizes":[[[117,150],"assets/images/resized/0001/6278/16278v3-max-150x150.jpg"],[[195,250],"assets/images/resized/0001/6278/16278v3-max-250x250.jpg"],[[210,269],"assets/images/resized/0001/6278/16278v3-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chairman of the Board","firm":{"name":"PeekYou","permalink":"peekyou","type_of_entity":"company","image":{"available_sizes":[[[150,36],"assets/images/resized/0011/9733/119733v6-max-150x150.png"],[[250,61],"assets/images/resized/0011/9733/119733v6-max-250x250.png"],[[413,101],"assets/images/resized/0011/9733/119733v6-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"COO","firm":{"name":"AOL","permalink":"aol","type_of_entity":"company","image":{"available_sizes":[[[150,84],"assets/images/resized/0000/4003/4003v5-max-150x150.png"],[[174,98],"assets/images/resized/0000/4003/4003v5-max-250x250.png"],[[174,98],"assets/images/resized/0000/4003/4003v5-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Executive Vice President of Customer Management and Paid Services","firm":{"name":"AOL","permalink":"aol","type_of_entity":"company","image":{"available_sizes":[[[150,84],"assets/images/resized/0000/4003/4003v5-max-150x150.png"],[[174,98],"assets/images/resized/0000/4003/4003v5-max-250x250.png"],[[174,98],"assets/images/resized/0000/4003/4003v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}