{"first_name":"Kirby","last_name":"Winfield","permalink":"kirby-winfield-2","crunchbase_url":"http://www.crunchbase.com/person/kirby-winfield-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Apr 04 12:22:29 UTC 2011","updated_at":"Mon Apr 04 12:25:58 UTC 2011","overview":"<p>Kirby Winfield is the President and Chief Revenue Officer of Mpire. Kirby joined Mpire in August, 2008, is responsible for the company’s strategic direction and overall management, and has been the acting CEO since August 2009. Before Mpire, Kirby operated Ascend Solutions, which provided strategic guidance for portfolio companies of Clearstone Venture Partners, Monster Venture Partners, and Wescom Capital. Prior to Ascend Solutions, Kirby was the General Manager and Vice President of the consumer Web site division of Marchex, Inc. (MCHX), overseeing more than 200,000 owned and operated Web sites. During his tenure, Marchex grew to 31 million unique monthly visitors and conducted a successful NASDAQ IPO. Prior to Marchex, Kirby was responsible for corporate, brand, and product marketing at Go2Net (acquired by InfoSpace [INSP]), which became a top 20 online network and conducted a successful NASDAQ IPO during his tenure. Kirby sits on the Board of Directors of SharperAgent, LLC, a leading provider of CRM and marketing services to real estate agents, speaks frequently at industry events, and invests in and advises a number of online media startups.</p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0012/9123/129123v1-max-150x150.jpg"],[[250,166],"assets/images/resized/0012/9123/129123v1-max-250x250.jpg"],[[270,180],"assets/images/resized/0012/9123/129123v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}