{"first_name":"Kirke","last_name":"Godfrey","permalink":"kirke-godfrey","crunchbase_url":"http://www.crunchbase.com/person/kirke-godfrey","homepage_url":"http://www.shapednoise.com","birthplace":"Perth Australia","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1961,"born_month":5,"born_day":7,"tag_list":"musician-sound-design-composer","alias_list":"","created_at":"Thu Apr 23 00:16:47 UTC 2009","updated_at":"Tue Aug 09 17:35:55 UTC 2011","overview":"<p>Australian composer and sound designer Kirke Godfrey started his musical career in Perth playing guitar with David McComb in the first incarnation of the ‘Triffids’, then after a year playing bass in a Tom Waits ‘cover’ band began playing guitar and bass with power-pop trio Flavors. He then joined the post-p[f]unk three-piece, ‘Big Red Tractor’, where he contributed vocals, guitar, bass, keyboards and &#8216;bugle&#8217;,to that band&#8217;s influential blend of minimalist trance grooves and chant vocals.</p>\n\n<p>After relocating to Sydney in the early 1980s with BRT, Kirke branched into production, working on albums and remixes for artists as varied as Machinations, INXS, The Angels, wry-core grunge band VRAG and pop dance &#8216;sensation&#8217; Collette, with DJ Pee Wee.\nWhile working as a session musician and programmer with fellow composer Cameron Giles, Kirke was offered (and very gladly accepted) by Simon Leadley a position as sound engineer at TrackDown recording studios, where he worked for several years recording and that turned to work producing singles and albums for dozens of acts from all around Australia.</p>\n\n<p>Together with Simon Leadley, Kirke set up an editing system at Trackdown studio with a DigiDesign AudioMedia system, and introduced so many musicians to the techniques of digital editing.</p>\n\n<p>Kirke began working in film in 1986 with a music and sound collage for the ABC documentary, The Built Environment. He has since composed and recorded numerous scores for television including Kaz Cooke&#8217;s &#8216;Gorgeous&#8217; (AFI Winner), an avant-garde classical score for &#8216;Muttaburrasarus&#8217; (AFI Nominee) and two seasons underscore for the commercial soap &#8216;Paradise Beach&#8217;. He has also composed and co-composed cues on feature films with composers Felicity Fox (Redheads and The Last Crop) and Alistair Jones (Blood Brothers, Vacant Possession, Radiance) while continuing to work on short films, television, theatre and commercials. Toward the end of 1989 he met and worked with Hans Zimmer on Green Card at Rhino Studio, At the time Sydneys top recording studio, where he was invited to Los Angeles by Hans.</p>\n\n<p>On a trip to London, Paris, New York, and Los Angeles, Kirke spent time with composer Hans Zimmerwhile working on Regarding Henry, at his studio Media Ventures, before making a side trip to San Francisco to the Lucas Films Ranch to preview Backdraft, where he met George Lucas and chatted to Ron Howard - about baseball, (of course).</p>\n\n<p>Kirke has also worked on sound design for Anaconda 2 and assisted Hans Zimmer on the recording of score for Mission Impossible 2 here in Sydney.</p>\n\n<p>Kirke&#8217;s diverse musical abilities have extended to tracks for Graeme Murphy&#8217;s ballet &#8216;Fornicon&#8217;, and to the recording of two albums with Egyptian vocalist Shadee Selim. The Shadee project took almost four years to complete, with digital multi-track tapes being sent between Sydney and Cairo to record live performances by some of Egypt&#8217;s top musicians. The first album, Ya Yo, was launched in December 96 in Cairo, where it was both critically and commercially acclaimed, the follow up EP Mahabouba receiving airplay on Sydney&#8217;s Drum+Bass programs.</p>\n\n<p>Kirke was then invited to join a select group of post production companies working together in a wonderful post house in Redfern Sydney, where he composed music and designed sounds for hundreds of television commercials for several international directors and some of Australia&#8217;s top directors and advertising agencies.</p>\n\n<p>In 2000 Kirke composed the world version of Hoytes cinema chains new Cinemaxx billboard, withSimon Leadley providing the superb Surround Mix.</p>\n\n<p>In 2004 Kirke composed and produced all the music and sound design for SBS television&#8217;s Re-Branding, encompassing a wide range of styles, from a melange of classical and ethnic instruments from around the world, to very abstract synthetic sound design work.</p>\n\n<p>Following (yet another) trip to Paris, in 2006 Kirke moved his studio to the glorious Bondi Beach where he continues &#8216;shaping noise&#8217; for television commercials, short films and some feature film work, and has been taking on &#8216;The Wiggles&#8217; with some music for children.</p>\n\n<p>Toward the end of 2007 Kirke acted as music editor and mixer (stereo and 5.1) for the TV documentary ‘Seed Hunter’</p>\n\n<p>Kirke has just Completed a Score for Australian Feature ‘The Clinic’ with Simon Leadley, Jason Fernandez and Angela Little.</p>\n\n<p>Kirke continues to write his own compositions for a follow up to his album  &#8216;tHings fRom iN hEre&#8217;, and Is currently working on a feature film, and is a guest lecturer at the Australian Film, Television and Radio School.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://soundcloud.com/kirkeshapednoise","title":"soundcloud"}],"web_presences":[{"external_url":"http://www.shapednoise.com","title":"Home Page"},{"external_url":"http://twitter.com/shapednoise","title":"Twitter"},{"external_url":"http://twitter.com/shapednoise","title":"Twitter"}]}