{"first_name":"Kirk","last_name":"Campbell","permalink":"kirk-campbell","crunchbase_url":"http://www.crunchbase.com/person/kirk-campbell","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Feb 16 10:37:16 UTC 2011","updated_at":"Wed Feb 16 10:43:19 UTC 2011","overview":"<p>Kirk Campbell joined IDC as Chief Operating Officer in 1990 and became President and CEO in 1991. Under his leadership, IDC has rapidly strengthened its position in the technology market intelligence business. Since 1990 IDC&#8217;s revenues have increased ten times to over $320 million, the number of employees has quadrupled to 1,600, and the number of countries which IDC research covers has grown from 25 to over 110. As a result, IDC offers the most comprehensive market intelligence available on all key technology segments from the internet, PCs, systems, peripherals and semiconductors to software, services, telecommunications, vertical markets and distribution channels. IDC has invested heavily in developing an unrivaled research network at the worldwide, regional, and country levels.</p>\n\n<p>Mr. Campbell joined International Data Group in 1988 as a Vice President responsible for corporate business planning and analysis for over 100 IDG business units. Prior to his position at IDG, Mr. Campbell was Vice President, Finance and Corporate Development for PennWell Publishing, a high-tech information and publishing company. He also held financial positions with Exxon Corporation. Mr. Campbell earned a Bachelor&#8217;s degree from Stanford University and a Master&#8217;s degree from Princeton University. He also was a Fulbright Scholar at the Free University in Berlin, Germany.</p>","image":{"available_sizes":[[[100,73],"assets/images/resized/0012/2293/122293v1-max-150x150.png"],[[100,73],"assets/images/resized/0012/2293/122293v1-max-250x250.png"],[[100,73],"assets/images/resized/0012/2293/122293v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President and CEO","firm":{"name":"IDC","permalink":"idc","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0012/2291/122291v1-max-150x150.jpg"],[[170,68],"assets/images/resized/0012/2291/122291v1-max-250x250.jpg"],[[170,68],"assets/images/resized/0012/2291/122291v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}