{"first_name":"Kirk","last_name":"Coburn","permalink":"kirk-coburn","crunchbase_url":"http://www.crunchbase.com/person/kirk-coburn","homepage_url":"http://www.surgeaccelerator.com","birthplace":"Houston","twitter_username":"kirkcoburn","blog_url":"http://surgeaccelerator.com/blog/","blog_feed_url":"","affiliation_name":"SURGE Accelerator","born_year":1971,"born_month":null,"born_day":null,"tag_list":"surge, accelerator, techstars, smart-grid, energy-trading, etrm, digital-oilfield, energy-efficiency, regulatory-compliance","alias_list":null,"created_at":"Sun Dec 18 22:58:26 UTC 2011","updated_at":"Mon Dec 19 23:01:37 UTC 2011","overview":"<p>Kirk Coburn is Co-founder &amp; Managing Director of SURGE Accelerator - an accelerator for entrepreneurs, startup companies, and later-stage companies who are solving the world&#8217;s energy problems using software.</p>\n\n<p>Coburn is an entrepreneur and start-up advocate that has founded three companies from idea creation, market validation, team building, fund raising, company launch, operational execution and successful acquisition. A Houstonian by birth, Coburn spent his business and entrepreneurial career in Austin and the East Coast before relocating back to Houston to lead and join the SURGE project.</p>\n\n<p>Prior to leading SURGE, Coburn created and was CEO of Chief Outsiders (acq. 2010), a Houston-based company with offices in Texas, Florida, Georgia and New York. Prior to Chief Outsiders, Coburn launched The PGA TOUR Network on Sirius XM (acq. by SIRI) and founded Pure Golf, a leading provider of golf, tennis, and outdoor programming to the satellite radio industry. Coburn started and was managing partner of BLUSH Marketing, an experiential and promotions agency that connects consumers with technology at major events including the NFL, PGA TOUR, MLB, NHL, NASCAR, US Open and more.</p>\n\n<p>Coburn has worked as an outsourced executive (CMO, COO, CFO) for high-growth companies in the Technology, Enterprise Software, Supply Chain, Consumer Web, Construction, Entertainment, and Finance industries.</p>\n\n<p>Coburn received his MBA and BBA in finance and accounting from the University of Texas at Austin. Coburn was a runner-up in UT&#8217;s Moot Corp Business Plan competition.</p>\n\n<p>Coburn is active in the community serving as an ambassador to the Texas Children’s Hospital, a supporter of the Rice Alliance and sponsor of the Houston Technology Center. Coburn is an ultra-endurance runner, open-water swimmer, competitive golfer, and seventh-generation Texan. In August 2010, Coburn finished his first 100 mile run, the Leadville Trail 100.</p>","image":null,"degrees":[{"degree_type":"BBA","subject":"Finance & Accounting","institution":"University of Texas at Austin - The Red McCombs School of Business","graduated_year":1994,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"University of Texas at Austin - The Red McCombs School of Business","graduated_year":2005,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Board Member, Co-founder & Managing Director","firm":{"name":"SURGE Accelerator","permalink":"surge-accelerator","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}