{"first_name":"Kirk","last_name":"Dunn","permalink":"kirk-dunn","crunchbase_url":"http://www.crunchbase.com/person/kirk-dunn","homepage_url":"","birthplace":"United States","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 08 01:48:54 UTC 2012","updated_at":"Fri Aug 31 18:31:59 UTC 2012","overview":"<p>Kirk is the COO of Cloudera where he uses his diversified range of technology engineering, marketing, sales and management experience to oversee Cloudera’s business operations. During his nearly 20-year career, Kirk has worked extensively with established companies, high-growth organizations and Fortune 200 accounts, successfully building strategic sales and product divisions, and leading international expansions. </p>\n\n<p>Kirk served as the CEO of PowerFile, Inc, which was successfully sold to Hitachi LG Data Storage, and was CEO of Bang Networks Inc. Prior to joining Bang Networks, Kirk served as VP of North American Field Operations at Inktomi. He came to Inktomi from Network Equipment Technologies, Inc. (NET), where he held executive positions in sales, marketing and professional services. Kirk also worked for IBM in senior sales positions. He holds a BA in mathematics and applied sciences from the University of California, Los Angeles.</p>\n\n<p>Speaking experience: He has been a featured panelist at The Economist&#8217;s Technology Frontiers Conference in London and the Churchhill Club, in addition to other high profile appearances at tier one industry events.  </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0020/5381/205381v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0020/5381/205381v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0020/5381/205381v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.cloudera.com/company/press-center/releases/kirk-dunn-joins-cloudera-executive-staff-team-as-chief-operating-officer/","title":"Kirk Appointed COO of Cloudera"}],"web_presences":[{"external_url":"http://www.linkedin.com/pub/kirk-dunn/0/bb/255","title":"LinkedIn"}]}