{"first_name":"KIRK","last_name":"LANTERMAN","permalink":"kirk-lanterman","crunchbase_url":"http://www.crunchbase.com/person/kirk-lanterman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 11 00:38:04 UTC 2009","updated_at":"Thu Jun 11 00:39:02 UTC 2009","overview":"<p>Kirk is Founder, Chairman and CEO of Kirlan Venture Capital, Inc., which serves as the General Partner of the Partnerships that invest in the various portfolio companies. Kirk provides investment advice, reviews and approves all investment decisions of the Kirlan investment partnerships and participates in actively monitoring the progress of all of the Kirlan portfolio companies. Under his direction the Kirlan investment partnerships have become some of the most successful venture funds in the industry. Since its founding in 1992, Kirlan Venture Capital, Inc. has invested in 36 companies, most of which either successfully completed an IPO or were acquired by another company. </p>\n\n<p>Kirk is also Chairman and CEO of Holland America Line Westours, Inc. (HAL) and Windstar Cruises Ltd., a subsidiary of HAL. Since he became CEO in 1989, HAL has grown considerably and has become recognized as a world leader in the premier cruise line business. A graduate of the University of Washington and a Certified Public Accountant, Kirk began his career in public accounting with Price Waterhouse. In 1970 he joined the financial management team at Westours, Inc., becoming president in 1979. When HAL consolidated its operations in Seattle in 1983, Kirk became president of HAL, serving in that capacity until becoming CEO in 1989. In 1997 he was also appointed as chairman. As a leader in the cruise industry, Kirk has held many industry executive positions, including serving two terms as chairman of the Cruise Lines International Association, president of the Alaska Visitors Association, vice chairman of the International Council of Cruise Lines and president of the Northwest Cruiseship Association. In addition to HAL and Westours, Kirk currently serves on the board of directors of Carnival Corporation (parent company of HAL and Carnival Cruise Lines) and Usibelli Coal Mine, Inc</p>","image":{"available_sizes":[[[128,136],"assets/images/resized/0004/7981/47981v1-max-150x150.png"],[[128,136],"assets/images/resized/0004/7981/47981v1-max-250x250.png"],[[128,136],"assets/images/resized/0004/7981/47981v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chairman","firm":{"name":"Kirlan Venture Capital","permalink":"kirlan-venture-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[126,100],"assets/images/resized/0004/7980/47980v1-max-150x150.jpg"],[[126,100],"assets/images/resized/0004/7980/47980v1-max-250x250.jpg"],[[126,100],"assets/images/resized/0004/7980/47980v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}