{"first_name":"Kison","last_name":"Patel","permalink":"kison-patel","crunchbase_url":"http://www.crunchbase.com/person/kison-patel","homepage_url":"http://fiexe.com","birthplace":"","twitter_username":"fiexe","blog_url":"http://fundology.com","blog_feed_url":"","affiliation_name":"FIEXE","born_year":1981,"born_month":8,"born_day":23,"tag_list":"fiexe, private-investments, private-investment-network, equity-deals, equity, debt-deals, debt, investment-network, accredited-investment","alias_list":null,"created_at":"Tue Nov 06 02:18:02 UTC 2012","updated_at":"Thu Nov 22 06:27:28 UTC 2012","overview":"<p>Kison Patel is the President of FIEXE Corporation. FIEXE is a platform to market private investment deals for investment bankers, middle market business owners, high net-worth individual and institutional investors.</p>\n\n<p>Kison is an experienced M&amp;A and Finance advisor with a 12 year track record as an investor. He has been an active force in both institutional and non-institutional business and commercial real estate ventures. </p>\n\n<p>Since 2005, Kison has been a founder and principal of TransAtlantic Investments &amp; Advisory, which provides advanced mergers and acquisitions and corporate finance advisory services to financial institutions and middle market companies. </p>\n\n<p>More broadly, Kison’s work for TransAtlantic includes all aspects of business management and financing. He acts as fund manager, equity and debt investor. He likewise develops and maintains significant relationships with key clientele, develops and implements new sales and marketing strategies, and provides consulting services to buyers and sellers in both commercial real estate and business transactions. </p>\n\n<p>Kison’s business acumen encompasses a wide range of skills. He has unique expertise in leading effective sales teams and is a proven sales performer in terms of initiating, negotiating, and closing deals. Kison is thoroughly familiar with all aspects of business management and has successfully increased sales and profitability for many enterprises, with an emphasis on financing commercial properties such as hotels, multi-family, and retail centers. </p>\n\n<p>Kison has founded the National Hotel Exchange in 2003, which focus on transaction and financial services. All told, he has advised on over $150 million in real estate developments and $570 million in acquisitions and finance.</p>","image":{"available_sizes":[[[100,100],"assets/images/resized/0022/0640/220640v2-max-150x150.jpg"],[[100,100],"assets/images/resized/0022/0640/220640v2-max-250x250.jpg"],[[100,100],"assets/images/resized/0022/0640/220640v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President","firm":{"name":"FIEXE","permalink":"fiexe","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}