{"first_name":"Klas","last_name":"Gustafsson","permalink":"klas-gustafsson","crunchbase_url":"http://www.crunchbase.com/person/klas-gustafsson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 11 17:04:16 UTC 2009","updated_at":"Thu Jun 11 22:16:28 UTC 2009","overview":"<p>Klas Gustafsson  is an investment director for the Sustainable Technologies Fund.\nMr. Gustafsson has spent the last 10 years within the venture capital industry. Prior to joining the Sustainable Technologies Fund, Mr. Gustafsson worked for leading venture capital firms like Northzone Ventures and AB Traction. After studying business administration at the University of Uppsala, Mr. Gustafsson started to work for ALMI Uppsala. ALMI is a government owned investment company focusing on financing SME’s. At ALMI, Mr. Gustafsson worked both within finance and management consulting, focusing on growth assignments.</p>\n\n<p>After 5 years at ALMI, Mr. Gustafsson joined AB Traction, a publicly traded investment company. At Traction Mr. Gustafsson was responsible for the portfolio of venture investments. He also held board seats, for example on the publicly traded pharmaceutical company Biophausia, among several other board assignments.</p>\n\n<p>In 2001, after finalizing an MBA at Warwick Business School and a short period at Telia Business Innovation, Mr. Gustafsson started to work as senior investment manager at Northzone Ventures. At Northzone, Mr. Gustafsson was lead in Envox, a 20 MUSD software company with its headquarters in Boston, USA. He also had a board assignment at Ibistic AS, a Norwegian e-procurement company. In 2003, Mr. Gustafsson joined AB Traction for a second term. He became chairman of the board in the contract staffing company Arvako (sold to Randstad) and board member of the publicly traded education company Academedia.</p>\n\n<p>In 2005, after more than 10 years as an employee within the venture capital industry, Mr. Gustafsson decided to start his own investment company. His first investment, Nordic Camping did an IPO in late 2006. He has also worked as a consultant in various growth companies, focusing on financing and M &amp; A activities. One assignment worth mentioning is Norstel, a cleantech company backed by Eqvitec, Creandum and Northzone. Mr. Gustafsson joined the Sustainable Technologies Fund in early 2008 as investment director and partner.</p>","image":{"available_sizes":[[[107,137],"assets/images/resized/0004/8057/48057v1-max-150x150.png"],[[107,137],"assets/images/resized/0004/8057/48057v1-max-250x250.png"],[[107,137],"assets/images/resized/0004/8057/48057v1-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"","institution":"Warwick Business School","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Investment Director","firm":{"name":"Sustainable Technologies Fund","permalink":"sustainable-technologies-fund","type_of_entity":"financial_org","image":{"available_sizes":[[[150,32],"assets/images/resized/0004/8054/48054v1-max-150x150.png"],[[186,40],"assets/images/resized/0004/8054/48054v1-max-250x250.png"],[[186,40],"assets/images/resized/0004/8054/48054v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}