{"first_name":"Konny","last_name":"Zsigo","permalink":"konny-zsigo","crunchbase_url":"http://www.crunchbase.com/person/konny-zsigo","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"WDA","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Dec 28 18:53:29 UTC 2011","updated_at":"Sat Jan 07 13:18:48 UTC 2012","overview":"<p>Konstantin J. Zsigo (Konny) is one of the pioneers in the wireless industry and a central figure among the wireless developer community. Hand-building one of the first known cellular data modems, Konny&#8217;s influence extends across the entire wireless data space literally from the beginning. He regularly interacts with executives, technologists and strategists at all levels. Many people credit their success in the mobile business to Konny’s soft-spoken guidance and influence. Over his 20 year career he has been quoted in hundreds of articles, spoken at dozens wireless conferences, written numerous white papers, articles and books and has personally delivered training to over 35,000 people. His entire career has been dedicated to driving the wireless data industry to success and profitability. </p>\n\n<p>Konny founded his first company at the age of 17 and never looked back. It financed his education at Michigan State University from which he graduated in 1988, with high honors, as an electrical engineer. </p>\n\n<p>He founded Zsigo Wireless Data Consultants the following year with a stash of credit cards and an idea that computers would someday be connected to wireless phones. That idea was the start of a thriving training and consulting business. Zsigo Wireless provided training to sales, management, and technical employees in the wireless industry. It enjoyed an 85% market share. </p>\n\n<p>Konny sold the training business in 1999 and retained his role as President for two years, during which time the company doubled its sales. In June, 2001, Konny formed Wireless Developer Agency (WDA). </p>\n\n<p>Konny holds a B.S. in Electrical Engineering from Michigan State University. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President and Founder","firm":{"name":"WDA","permalink":"wda","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0016/7244/167244v11-max-150x150.png"],[[250,250],"assets/images/resized/0016/7244/167244v11-max-250x250.png"],[[450,450],"assets/images/resized/0016/7244/167244v11-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}