{"first_name":"koovs","last_name":"koov","permalink":"koovs-koov","crunchbase_url":"http://www.crunchbase.com/person/koovs-koov","homepage_url":"http://www.koovs.com","birthplace":"bangalore","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1988,"born_month":2,"born_day":18,"tag_list":"discounts, deals, coupon, offers, voucher","alias_list":null,"created_at":"Thu May 19 11:57:23 UTC 2011","updated_at":"Mon May 23 14:34:19 UTC 2011","overview":"<p>Koovs is India&#8217;s fastest growing service community site which has captured the imagination of young people across India. Founded by a team of IIT alumni who have brought in their expertise from the internet industry. Koovs is a Bangalore based start up and one point solution for all your desires.\nKoovs is a place to find and buy all kind of products at a much discounted price. The deals we flaunt are a pool of the best that you can enjoy - discover products that suit you. This gives you the possibility of choosing the best deal from the best service provider and grab discounted koov (coupon) available only on our website.\nWhether it&#8217;s a luxury stay at 5 star hotel &#8220;or&#8221; for a lovely lunch/ dinner with that someone special or with your loved ones in the best bistro &#8220;or&#8221; a mobile store for a much awaited dream to be fulfilled to have the latest blackberry, iphone &#8220;or&#8221; for your fitness regime amidst your stressful work life at fitness one &#8220;or&#8221; a special treatment for that flawless skin in Kaya Skin Clinic - Koovs has it all at a unbelievable discounted price only for you.\nGet more together is the concept of our website. We aim to bring people with similar elegance together at one place and facilitate them getting the best price from the best service provider. Discounts and sales are right here at our online koov store database.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}