{"first_name":"Kripalu ji","last_name":"Maharaj","permalink":"kripalu-ji-maharaj","crunchbase_url":"http://www.crunchbase.com/person/kripalu-ji-maharaj","homepage_url":"http://jkp.org.in","birthplace":"India","twitter_username":"kripalujimahara","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 28 20:04:18 UTC 2012","updated_at":"Wed Dec 05 07:43:57 UTC 2012","overview":"<p>Eternally liberated divine personalities descend on earth from time to time for the welfare of humankind. Jagadguru Shri Kripalu Ji Maharaj is one such divine personality. He is lovingly called Shri Maharaj Ji by His devotees. Through enlightening discourses and chanting of the holy name, He has been making unceasing efforts to reveal the true philosophy from the Vedic scriptures to mankind in the simplest form possible so that they can attain their true goal of God Realisation.\nShri Maharaj Ji makes no distinction of caste, creed, colour or race. With His infinite love and compassion, He gathers all into the purity of His divine embrace. His divine effulgence shines through all He says, all He does and all He is. Each and every seeker is amazed to see how approachable He is and enjoys the special privilege of receiving individual attention from Him. Thus, He makes each person feel that they belong to Him. His tall, stately and regal, yet childlike personality, have an indefinable attraction that draws all to Him, whether young or old, men or women or of any country or language. The all-satisfying love that emanates from Him makes each person feel the affection of a parent, friend and teacher, all in one. It is very easy to become a recipient because there is no other giver like Shri Maharaj Ji. True to His name &#8220;Kripalu&#8221;, He is the very &#8220;Ocean of Grace&#8221;.</p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0022/2864/222864v3-max-150x150.jpg"],[[250,166],"assets/images/resized/0022/2864/222864v3-max-250x250.jpg"],[[450,299],"assets/images/resized/0022/2864/222864v3-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}