{"first_name":"Krish","last_name":"Mantripragada","permalink":"krish-mantripragada","crunchbase_url":"http://www.crunchbase.com/person/krish-mantripragada","homepage_url":"http://www.linkedin.com/in/krishmantripragada","birthplace":"New Delhi, India","twitter_username":"kmantri","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Apr 26 22:44:10 UTC 2011","updated_at":"Fri Nov 30 05:17:08 UTC 2012","overview":"<p>Krish is currently Group Vice President of Product Management at SAP, responsible for next generation business analytics applications in Sales, Supply Chain, Consumer Marketing and other areas in the Enterprise &amp; their Networks leveraging power of Real-Time (HANA), Social (Streamwork, JAM) and Cloud. Previously, Krish was responsible for worldwide strategy, definition and delivery of end to end Supply Chain products at SAP. He was earlier the GM and Program Director for SAP&#8217;s RFID &amp; Auto-ID solutions.</p>\n\n<p>Prior to SAP, Krish has held several leadership positions at i2 Technologies, Agile Software and United Technologies Research.</p>\n\n<p>Krish has over 15 years of experience in Supply Chain Management, Commerce and RFID/Auto-ID solutions across enterprise software, industry and academia. He has held management and research positions in companies like i2 Technologies, Agile Software, and United Technologies and has worked with numerous large companies worldwide.</p>\n\n<p>Krish holds a PhD in Mech Eng from MIT specializing in Supply Chain Management with a PhD minor in Management from MIT Sloan School of Management. He is a graduate of IIT Delhi. Krish lives in Cupertino with his wife and their two children.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0013/2097/132097v2-max-150x150.jpg"],[[160,200],"assets/images/resized/0013/2097/132097v2-max-250x250.jpg"],[[160,200],"assets/images/resized/0013/2097/132097v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}