{"first_name":"Kristopher","last_name":"Gerner","permalink":"kristopher-gerner","crunchbase_url":"http://www.crunchbase.com/person/kristopher-gerner","homepage_url":"http://www.photosbykristopher.com","birthplace":"Burlington, NC","twitter_username":"photogkris","blog_url":"http://photosbykristopher.com/blog","blog_feed_url":"","affiliation_name":"Photos by Kristopher","born_year":1978,"born_month":3,"born_day":4,"tag_list":"wedding, portait, photographer, raleigh, durham, chapel-hill, myrtle-beach, charlotte","alias_list":null,"created_at":"Mon Sep 10 18:33:26 UTC 2012","updated_at":"Mon Sep 17 23:04:36 UTC 2012","overview":"<p>Kristopher Gerner is a wedding and portrait photographer based in North Carolina. </p>\n\n<p>Photos by Kristopher fine art wedding photography is committed to provide personalized attention to those who believe in love! Weddings are very special occasions and as such every wedding is approached in a unique, intimate, fine art fashion. Kristopher&#8217;s passion for photography helps him to create exceptionally beautiful collection of those happy, real moments distilled through out the event.</p>\n\n<p>Having a wedding is an exhaustive experience, and you want your wedding event preparations to be smooth and not more stressful that it already is. Hence, you want a digital wedding photographer who can have a calming influence on your wedding day. We can be that wedding studio. You want a digital photographer who can capture those fleeting moments in your wedding that could otherwise slide away with time. We offer elegant yet candid -spontaneous - photojournalist / photo journalistic documentary style wedding portrait photography, Good luck with your wedding! </p>\n\n<p>Whether your family has lots of children or is just a small family or engagement shoot, we can deliver beautiful photography that your family will enjoy for years to come. Affordable family photography is a special art in being able to get group shots that look natural. When searching for family lifestyle and commercial prints photographers in Wilmington NC, keep your eye and heart focused on that natural look that a great top photographer can deliver for your family portrait portfolios. You want your family shots to sparkle be beautiful and show the life and warmth that a family can cherish for years to come. We have great expertise.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Owner","firm":{"name":"Photos by Kristopher","permalink":"photos-by-kristopher","type_of_entity":"company","image":null}},{"is_past":true,"title":"","firm":{"name":"5150 Studios","permalink":"5150-studios","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.photosbykristopher.com","title":"Raleigh Wedding Photographers"},{"external_url":"http://www.linkedin.com/in/photosbykristopher","title":"LinkedIn"},{"external_url":"http://www.photographik.org/photosbykristopher","title":"Photographik"},{"external_url":"http://www.ppa.com/findaphotographer/32157/Kristopher-Gerner.php","title":"Professional Photographers of America"}]}