{"first_name":"Kumar","last_name":"Shiralagi","permalink":"kumar-shiralagi","crunchbase_url":"http://www.crunchbase.com/person/kumar-shiralagi","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Nov 22 13:31:31 UTC 2008","updated_at":"Sun Nov 23 08:27:05 UTC 2008","overview":"<p>Kumar Shiralagi is a Managing Director at NEA-IndoUS Ventures, based in Bangalore, India. Prior to joining NEA-IUV in 2007, he was the head of Intel Capital India, the venture capital group responsible for Indian investments. As the Country Director, he drove Intel&#8217;s India investments and had a very<br/>\nsuccessful run in making and managing investments and Exits. Notable companies in the portfolio were NIIT, Subex Systems, Futuresoft, R-systems, IndiaInfoline etc. and past Boards he has served on include Sasken Communications, Tejas Networks, Sharekhan, Nipuna, Deccanet, Real Image Media Technologies to name a few. </p>\n\n<p>Prior to joining Intel in 2003, he was the cofounder and Chief Operating Officer of Lytek Corporation in Arizona.  He has worked in Motorola in various areas ranging from technology development to corporate strategy and investments. After completing his Engineering in Electronics and Communications from National institute of Technology (formerly KREC), Karnataka, he worked in Electronics and Radar Development in 1984-85 in Bangalore.  He earned his PhD and MS in Electrical Engineering from Arizona State University and an MBA from Thunderbird, the American Graduate School of International Management. He has published over 60 papers in international journals and conferences, has 23 issued US patents, is a senior member of IEEE and a Charter member of TiE Bangalore.</p>","image":{"available_sizes":[[[132,132],"assets/images/resized/0002/9226/29226v1-max-150x150.jpg"],[[132,132],"assets/images/resized/0002/9226/29226v1-max-250x250.jpg"],[[132,132],"assets/images/resized/0002/9226/29226v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director, India","firm":{"name":"IndoUS Venture Partners","permalink":"nea-indous-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,60],"assets/images/resized/0002/9223/29223v1-max-150x150.jpg"],[[175,70],"assets/images/resized/0002/9223/29223v1-max-250x250.jpg"],[[175,70],"assets/images/resized/0002/9223/29223v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}