{"first_name":"Kunal","last_name":"Pandya","permalink":"kunal-pandya","crunchbase_url":"http://www.crunchbase.com/person/kunal-pandya","homepage_url":"http://www.ncrypted.net","birthplace":"Rajkot","twitter_username":"Ncrypted","blog_url":"http://blog.ncrypted.net","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1989,"born_month":5,"born_day":21,"tag_list":"ncrypted, ncrypted-technologies, web-development, web-development-company, software-development, software-development-company","alias_list":null,"created_at":"Tue May 29 09:56:37 UTC 2012","updated_at":"Tue Jun 05 05:25:47 UTC 2012","overview":"<p>Kunal Pandya is a young IT entrepreneur and management professional with a thrilling desire to accomplish new milestones in the IT industry by providing proficient range of services in the field of technology. After completing his IT engineering in 2003, he earned his Masters in Business Administration (MBA) from the Indian Institute of Planning &amp; Management (IIPM, Mumbai) in 2005. Prior to starting up the company, Kunal launched several web portals in different fields, a few of which have become one of the leading and profit-making portals in their respective fields today. To give a broader shape to his vision, he initiated a new venture in the form of NCrypted Technologies to provide high-end online and offline web as well as software development and application solutions to medium to large scale clients worldwide. Thus, he founded the company in the early 2006 and became a young and dynamic IT entrepreneur. With 10+ years of superior experience in the fields of internet technology, business intelligence, internet marketing and his touching skills of handling medium to large scale projects and teams, Kunal now directs the working of the company under his expert guidance. His high-end knowledge, skills and expertise in the field helps the company to expand its horizons and achieve new milestones everyday. </p>\n\n<p>Apart from NCrypted Technologies, Kunal Pandya is also on the board of 2 other technology and internet marketing companies. Kunal also maintains his blog at kunalpandya.com where he has given a deeper insight into different topics through some of his interesting articles. He is also a participating author of The NCrypted Blog. </p>","image":{"available_sizes":[[[150,44],"assets/images/resized/0019/2590/192590v2-max-150x150.png"],[[197,58],"assets/images/resized/0019/2590/192590v2-max-250x250.png"],[[197,58],"assets/images/resized/0019/2590/192590v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://twitter.com/NCrypted","title":"Twitter"},{"external_url":"http://www.facebook.com/ncryptedtechnologies","title":"Facebook"},{"external_url":"http://www.linkedin.com/company/ncrypted-technologies","title":"Linked in"}]}