{"first_name":"Kurt","last_name":"Heikkinen","permalink":"kurt-heikkinen","crunchbase_url":"http://www.crunchbase.com/person/kurt-heikkinen","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jul 22 17:48:32 UTC 2010","updated_at":"Thu May 31 20:51:31 UTC 2012","overview":"<p>As president and CEO of Montage Talent, Kurt Heikkinen has ultimate responsibility for all business operations and the overall success and growth of the company. A driven leader, Kurt has a proven track record of leading start-up companies and large enterprises through technology product launches to serve rapidly emerging markets and successfully completing operational turnarounds.</p>\n\n<p>Kurt has more than 20 years of enterprise software experience within the talent management and SaaS domains. He has held executive positions at PeopleSoft, Inc. where he was responsible for product strategy, development and support for their $400M HRMS business unit. During his tenure, he also served as the vice president of Global Support and helped grow PeopleSoft from $50 million to more than $1 billion in annual revenue. Additionally, he was a member of the executive team at Evolve, Inc. where he was instrumental in raising $45 million in funding. His leadership of their professional services and product development organizations helped bring the company through several product releases and a successful IPO. He has also served as vice president of eBanking Product Development at Metavante, and managing partner for Codeworks, Inc.</p>\n\n<p>Kurt has been drawn to the power of technology in improving business efficiency and efficacy since his first job after college where he implemented software to improve human resource functions. Having spent his entire career working with HR technology innovation, he understands how these organizations operate and is fluent in the technologies they use to run their functions and support their operations. During the course of his career, Heikkinen has had experience on both sides of the business; building the technology as well as marketing enterprise software externally.</p>\n\n<p>When Kurt was first introduced to the Montage Talent team in 2008, he saw the opportunity to make an impact and change the way work gets done. &#8220;I&#8217;ve always been driven by breaking new ground and building innovative businesses. I love this stage of a company and the process of taking an organization from strategy through execution. Whether it is growing PeopleSoft&#8217;s Asia/Pacific division or helping take Evolve, Inc. public, it&#8217;s about taking an organization with tremendous potential to an exponential level of growth,&#8221; Kurt explained. &#8220;Today&#8217;s industry and technology trends are aligning to make this solution extremely compelling. Our goal is to build a successful technology company that improves the way HR operates, and as we succeed, we will revolutionize the talent acquisition process.&#8221; he concluded.</p>\n\n<p>Kurt holds a Bachelor&#8217;s Degree in computer science from the University of Wisconsin-Milwaukee. He resides in Delafield, WI with his wife Doreen and their three children. </p>","image":{"available_sizes":[[[148,150],"assets/images/resized/0009/4587/94587v1-max-150x150.jpg"],[[248,250],"assets/images/resized/0009/4587/94587v1-max-250x250.jpg"],[[250,252],"assets/images/resized/0009/4587/94587v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BS","subject":"Computer Science","institution":"University of Wisconsin-Milwaukee","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Montage Talent","permalink":"montage-talent","type_of_entity":"company","image":{"available_sizes":[[[150,80],"assets/images/resized/0016/6489/166489v1-max-150x150.png"],[[232,125],"assets/images/resized/0016/6489/166489v1-max-250x250.png"],[[232,125],"assets/images/resized/0016/6489/166489v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}