{"first_name":"Kurt","last_name":"Andersen","permalink":"kurt-andersen","crunchbase_url":"http://www.crunchbase.com/person/kurt-andersen","homepage_url":"","birthplace":"","twitter_username":"KBAndersen","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Tue Dec 27 19:33:49 UTC 2011","updated_at":"Tue Dec 27 19:33:49 UTC 2011","overview":"<p>KURT ANDERSEN is a writer.</p>\n\n<p>He’s the author of the novels Heyday and Turn of the Century. Heyday was a New York Times bestseller that the Los Angeles Times called &#8220;a major work.&#8221; The New York Times Book Review said there is &#8220;something moving, a stirring spirit, in the energy of its amazement.&#8221; And the Chicago Sun-Times (and nine other papers) said it &#8220;deserves instant acceptance into the ranks [of] Thomas Berger&#8217;s Little Big Man, E.L. Doctorow&#8217;s Ragtime, [and] Gore Vidal&#8217;s Lincoln.&#8221; It was included on several best-books-of-the-year lists, including the New York Public Library&#8217;s, and won the Langum Prize as the best American historical novel of 2007. The New York Times called Turn of the Century &#8220;wickedly satirical&#8221; and &#8220;outrageously funny&#8221; and one of its Notable Books of the year, while The Wall Street Journal called it a &#8220;smart, funny and excruciatingly deft portrait of our age.&#8221;  It was a national bestseller. He is now at work on a new novel.</p>\n\n<p>Last year he published Reset, an &#8220;influential&#8221; (Huffington Post), &#8220;heavyweight&#8221; (USA Today) and &#8220;inspired and inspiring&#8221; (BoingBoing) essay about how America might change for the better coming out of the economic and financial crises of 2008 and 2009.</p>\n\n<p>He has also written for film, television and the stage. He has written screenplays for Walt Disney Pictures and Village Roadshow. Currently, GreeneStreet Films is developing Turn of the Century as a film, for which he is serving as an executive producer. He is also developing a series for HBO. During the 1990s he was executive producer and head writer of two prime-time specials for NBC, How to Be Famous and Hit List, starring Jerry Seinfeld and Julia Louis-Dreyfus, and a creator of three pilots for ABC and NBC. He was co-author of Loose Lips, a satirical off-Broadway revue that had long runs in New York and Los Angeles starring Bebe Neuwirth, Harry Shearer and Andy Richter. He has also written the books for musicals under development for Broadway.</p>\n\n<p>From 2004 through 2008 he wrote a column called &#8220;The Imperial  City&#8221; for New York (one of which is included in The Best American Magazine Writing 2008), and contributes to Vanity Fair (where piece of his won a 2009 Deadline Club Award). He was previously a columnist for The New Yorker (&#8220;The Culture Industry&#8221;) and Time (&#8220;Spectator&#8221;). He began his career in journalism at Time, where during the 1980s he was an award-winning writer on politics and criminal justice before becoming, for eight years, the magazine’s architecture and design critic.</p>\n\n<p>He is also host and co-creator of Studio 360, the Peabody Award-winning cultural magazine show produced by Public Radio International and WNYC and broadcast on 140 stations to 500,000 listeners each week. From 2001 through 2004 he served as a creative consultant to Universal Television, co-creating the Trio channel and helping to shape Universal&#8217;s cable programming.</p>\n\n<p>As an editor, he co-founded the transformative independent magazine Spy, which was nominated for two National Magazine Awards, and increased its circulation almost tenfold and became profitable after just three years. He also served as editor-in-chief of New York during the mid-90s, presiding over its editorial reinvigoration and record profitability. In 1999 he co-founded Inside, an online and print publication covering the media and entertainment industries, and in 2004 and 2005 he oversaw a relaunch of Colors magazine. In 2006 he co-founded Very Short List, an online service for cultural connoisseurs who would probably never call themselves &#8220;connoisseurs.&#8221; And he is editor-at-large for Random House, responsible for finding, conceiving, and overseeing non-fiction books.</p>\n\n<p>At the Smithsonian&#8217;s Cooper-Hewitt National Design Museum  in 2004, he curated an exhibit called “Faster, Cheaper, Newer, More: Revolutions of 1848.&#8221; He has since joined the board of trustees of the Cooper-Hewitt, and also serves on the board of the Pratt Institute. He graduated magna cum laude from Harvard College, where he was an editor of the Lampoon. He received an honorary doctorate from the Rhode Island School of Design in 2005, and in 2009 was Visionary in Residence at the Art Center College of Design in Pasadena. New York magazine named him one of the 100 People Who Changed New York.  He lives in Brooklyn with his wife, Anne Kreamer, and his daughters Kate and Lucy.</p>","image":{"available_sizes":[[[150,145],"assets/images/resized/0016/7806/167806v1-max-150x150.jpg"],[[250,242],"assets/images/resized/0016/7806/167806v1-max-250x250.jpg"],[[258,250],"assets/images/resized/0016/7806/167806v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}