{"first_name":"Kyle","last_name":"Lefkoff","permalink":"kyle-lefkoff","crunchbase_url":"http://www.crunchbase.com/person/kyle-lefkoff","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 08 07:53:07 UTC 2009","updated_at":"Mon Jun 08 07:55:15 UTC 2009","overview":"<p>Kyle Lefkoff, 49, is a Founder and General Partner of Boulder Ventures Ltd., a Boulder, Colorado-based venture capital fund with over $300 million in committed capital in five separate partnerships.  In his twenty-three year career as a venture capitalist, Mr. Lefkoff has invested in 58 Colorado companies, resulting in twelve IPOs and fifteen trade sales.</p>\n\n<p>Mr. Lefkoff&#8217;s representative life science investments include Hauser Chemical Research (NASDAQ: HAUS), NeXstar Pharmaceuticals (sold to Gilead Sciences), Array BioPharma (NASDAQ: ARRY), Dharmacon (sold to Fisher Scientific), Genomica (sold to Exelixis), ARCA Biopharma (NASDAQ: ABIO), Miragen Therapeutics, and Barofold.</p>\n\n<p>Representative information technology investments include McData (sold to EMC), Atlantes Corp. (sold to Metromail), Compatible Systems Corp. (sold to Cisco Systems), Wall Street on Demand (sold to Goldman Sachs), and LeftHand Networks (sold to Hewlett Packard).</p>\n\n<p>Representative natural foods retailing investments include Horizon Organic Dairy (sold to Dean Foods), Alfalfa&#8217;s Markets (sold to Wild Oats), and Fresh &amp; Wild PLC (sold to Whole Foods).</p>\n\n<p>Mr. Lefkoff is the Chairman of the Board of Array BioPharma and of Barofold Inc.  He is a Director of Centerstone Technologies, Metabolite Laboratories, Miragen Therapeutics, and Trust Company of America.  He is the past Chairman of the Venture Capital Association of Colorado and is an Adjunct Professor of Finance at the University of Colorado Leeds School of Business.</p>\n\n<p>Mr. Lefkoff received his B.A. in Economics from Vassar College (summa cum laude) in 1981.  In 1980, Mr. Lefkoff completed a Fellowship in Economic History at the London School of Economics.  In 1985, he completed his MBA in Finance at the University of Chicago.</p>\n\n<p>Mr. Lefkoff is an experienced alpinist and mountain guide with difficult ascents to his credit in the French Alps, Peruvian Andes, and the major ranges of North America.  He was a member of the 1986 American Expedition to the North Face of K2 and is a Lifetime Member and past Director of the American Mountain Guides Association.  Mr. Lefkoff serves as a Director and Treasurer of The Access Fund, a national climbing advocacy organization.</p>","image":{"available_sizes":[[[108,150],"assets/images/resized/0004/7296/47296v1-max-150x150.jpg"],[[131,181],"assets/images/resized/0004/7296/47296v1-max-250x250.jpg"],[[131,181],"assets/images/resized/0004/7296/47296v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Boulder Ventures","permalink":"boulder-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,83],"assets/images/resized/0001/1780/11780v1-max-150x150.png"],[[156,87],"assets/images/resized/0001/1780/11780v1-max-250x250.png"],[[156,87],"assets/images/resized/0001/1780/11780v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}