{"first_name":"L.","last_name":"Jacques Menard","permalink":"l-jacques-menard","crunchbase_url":"http://www.crunchbase.com/person/l-jacques-menard","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Oct 28 23:29:15 UTC 2008","updated_at":"Tue Oct 28 23:31:27 UTC 2008","overview":"<p>Jacques is Chair, BMO Capital Markets, Chair of BMO Nesbitt Burns, and President of BMO Financial Group, Quebec, overseeing the activities of BMO Bank of Montreal, its subsidiaries, and its more than 170 branches and 5,000 employees in the province.</p>\n\n<p>The list of organizations that have drawn on his abilities as a director is impressive. He is currently a director at Bowater Incorporated, the Canadian Public Accountability Board (CPAB), not to mention the many other boards on which he has sat over the years.</p>\n\n<p>A past Chairman of the Board of Hydro-Quebec, the Montreal Exchange, Trans-Canada Options Corporation and the Investment Dealers Association, Jacques has also been a board member of Gaz Métro, Rona Inc. and several other industry organizations during his more than 30-year career in the securities field. He is currently a member of the Advisory Board of the Institute of Corporate Directors (Quebec chapter) and a Board Associate of Canadian Policy Research Networks Inc.</p>\n\n<p>Over the years, Jacques has also been active in various economic and civic organizations. A Governor of the Conseil du patronat du Québec, he has also served as Chairman and President of the Board of Trade of Metropolitan Montreal and a member of the Economic Council of Canada.</p>\n\n<p>Known for his community involvement, Jacques is Co-chair of the Grandir en santé fundraising campaign of the Sainte-Justine Hospital Foundation and Honorary Chairman of EPOC MONTREAL, an organization that gives underprivileged youth access to the training they need in order to integrate into the community. He also holds a seat on the International Advisory Board of HEC Montréal, the Advisory Board of the Richard Ivey Business School and the Board of Directors of the Macdonald Stewart Foundation. He was a Director of Centraide of Greater Montreal for several years and Co-chairman of its fundraising campaign in 1992. He was also President of the Ordre des jeux du Québec in 1994.</p>\n\n<p>In 1993, in recognition of his deep social commitment, Concordia University’s Faculty of Commerce and Administration presented him with its Award of Distinction for his professional accomplishments and outstanding service to the community. In February 2002, he received the McGill University Faculty of Management Achievement Award in acknowledgement of these same qualities. In June 2001, Université de Sherbrooke’s Faculty of Administration awarded him an honorary doctorate.</p>\n\n<p>Jacques is an Officer of the Order of Canada. </p>","image":{"available_sizes":[[[105,150],"assets/images/resized/0002/7508/27508v1-max-150x150.jpg"],[[175,250],"assets/images/resized/0002/7508/27508v1-max-250x250.jpg"],[[316,450],"assets/images/resized/0002/7508/27508v1-max-450x450.jpg"]],"attribution":"<p>http://www2.bmo.com/bio/article/0,1099,contentCode-569<em>divId-4</em>langId-1_navCode-132,00.html</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}