{"first_name":"Lael","last_name":"Alexander","permalink":"lael-alexander","crunchbase_url":"http://www.crunchbase.com/person/lael-alexander","homepage_url":"http://www.noitavonne.com","birthplace":"Louisiana","twitter_username":"Noitavonne","blog_url":"https://2012tabletcomparison.blogspot.com/b/post-preview?token=8Ua2izoBAAA.qoyO0OH2W5rJeGzA6p5PIA.9JHk2SE0J1yqs7X066Ir7g&postId=4981563414698635453&type=POST#!/2012/10/the-noitavonne-embrace-tablet-compared.html","blog_feed_url":"http://feeds.feedburner.com/2012TabletComparison","affiliation_name":"Unaffiliated","born_year":1973,"born_month":7,"born_day":30,"tag_list":"loop, connectivity, noitavonne, innovator, designer, integrator, inventor, technology-developer","alias_list":null,"created_at":"Mon Oct 22 19:53:35 UTC 2012","updated_at":"Fri Nov 02 06:41:13 UTC 2012","overview":"<p>Lael Alexander\nFounder of Noitavonne™ ™ and inventor of the IP Loop Connectivity Protocol (802.11L) studied at Grambling State University prior to leaving school to join the Navy where he earned a commendation from the Admiral and The Navy Achievement Medal for his innovations in the development of a retention program for Naval human resources. After leaving the Navy he worked in the oil and gas sector where he continued to innovate new processes leading to the development of new roles designations in the refinery environment. After 14 years in oil and gas he formed PREMARC Turnkey Systems followed by Tide Wind Energy and Smart Grid Systems all of which ultimately led to the technological breakthroughs that gave birth to Noitavonne™ and a catalog of emerging devices.</p>\n\n<p>The visionary behind this products and services offered by Noitavonne, Lael A. Alexander, has a knack for building upon ideas to continually improve on what others might deem perfection. However, it is his experience in technology that spans decades and crosses multiple functional industry sectors ranging from healthcare to energy related segments that continue to prove up his concepts from a practitioners approach. The emergence of this technology and the devices in which it is currently being implemented has caused a seismic shift in the collective paradigm around how the world views mobility and impact how tablets, phones and personal computers as network devices will be used.</p>","image":{"available_sizes":[[[150,102],"assets/images/resized/0021/6693/216693v2-max-150x150.jpg"],[[250,170],"assets/images/resized/0021/6693/216693v2-max-250x250.jpg"],[[280,191],"assets/images/resized/0021/6693/216693v2-max-450x450.jpg"]],"attribution":"<p>CEO Lael Alexander Noitavonne</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}