{"first_name":"Lance","last_name":"LeMay","permalink":"lance-lemay","crunchbase_url":"http://www.crunchbase.com/person/lance-lemay","homepage_url":"http://www.openairep.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Oct 13 15:39:22 UTC 2011","updated_at":"Sun Oct 30 22:59:21 UTC 2011","overview":"<p>Lance is a seasoned and respected investor in the technology and innovation space. He is the founder of October Capital, a privately funded venture firm that invests primarily in innovative, technology-enabled businesses. Lance possesses an operational expertise, entrepreneurial mindset, and collaborative approach that make him stand out as a leader in the venture capital market and causes him to be a highly-sought-after board member. Known for his hands-on leadership style, Lance has mentored numerous successful entrepreneurs and management teams. Among Lance&#8217;s accomplishments:\n •Founder and Managing Partner of venture investment firm, October Capital\n •Led nine of the 12 investments made by October Capital\n •Held numerous active board seats and currently maintains three including eRecyclingCorps, Zave Networks and MachineryLink\n •Possesses deep network of operators and influencers\n •Expert board management experience and capabilities across multiple industries</p>\n\n<p>Additional Experience</p>\n\n<p>In his role as an investor and board member during the past 10 years, Lance has assisted management teams in developing and fleshing out ideas and innovative solutions across a range of industries including web-enabled enterprise services, mobile commerce, agricultural equipment services, digital media and advertising, publishing, logistics, wireless services, and financial services. Lance is known for his passion for early stage innovation, his ability to collaborate with entrepreneurs, and his willingness to work actively to help build businesses.</p>\n\n<p>As an advocate of entrepreneurship and venture investing, Lance is an oft-requested speaker and panelist. He has worked diligently for more than 10 years to stimulate innovation in the Midwest through entrepreneurship and venture investment. Lance holds a Bachelor&#8217;s degree in Environmental Studies from the University of Kansas. He lives in Kansas City with his wife and four daughters, two sets of twins.</p>","image":{"available_sizes":[[[116,150],"assets/images/resized/0015/7987/157987v2-max-150x150.jpg"],[[116,150],"assets/images/resized/0015/7987/157987v2-max-250x250.jpg"],[[116,150],"assets/images/resized/0015/7987/157987v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}