{"first_name":"laren","last_name":"daniel","permalink":"laren-daniel","crunchbase_url":"http://www.crunchbase.com/person/laren-daniel","homepage_url":"http://www.stellaraccessdatabaserepair.com/","birthplace":"United States","twitter_username":"larendaniel","blog_url":"http://www.stellaraccessdatabaserepair.com/blog/","blog_feed_url":"http://www.stellaraccessdatabaserepair.com/blog/?feed=rss2","affiliation_name":"Unaffiliated","born_year":1985,"born_month":7,"born_day":29,"tag_list":"stellar-file-repair, excel-repair, access-repair, bkf-repair, quickbooks-repair, powerpoint-repair, word-repair","alias_list":null,"created_at":"Wed Jan 05 07:39:53 UTC 2011","updated_at":"Fri Jan 07 23:14:04 UTC 2011","overview":"<p>Stellar Phoenix Access Recovery Software, a secure and easy to use application is designed to repair damaged, corrupted Microsoft Access (.mdb) files with Tables, Queries, Forms, Reports, Macros, Modules, Indexes, Relations, VBA code and password protected VBA code and other database objects. You can restore damaged Access files after instances of accidental format, software malfunction, virus attacks, unexpected system shutdown or even sabotage. Stellar Phoenix Access Recovery helps you repair and retrieve corrupted data from Access files in data corruption situations like when you can not open files and instead come across error messages. The Microsoft Jet Database Engine cannot open the file and Microsoft Access has encountered a problem and needs to be closed and so on. Stellar Phoenix Access Recovery is the best solution you can use when you are faced with a data loss situation affecting your Access databases. Stellar Phoenix Access Data Recovery v3.5 is a user-friendly Access database repair software that uses advanced technologies to scan and repair Access database files. It scans for damaged .mdb files, repair and restore it to a default location or to a folder specified by you. Stellar Phoenix Access Recovery repairs the files in a safe and non-destructive manner. The software offers you a live demonstration of its features through a free demo version. It shows the list of recoverable files in an easy to understand Windows based tree structure Simple to operate, with no prior technical skills required. If you find the desired results, purchase the activation key to active the software and save your precious data. The software is a must have utility for all user segments from home users to corporate houses to save heavy losses due to data loss. The Software supports MS Access 2010 / 2000 / 2002 / 2003 / 2007 and is compatible with Windows 9x/ Me/ NT/ 2000/ XP/ 2003/ Vista. It is backed up by 24X5 unlimited customer support and 30 days money back guarantee.</p>","image":{"available_sizes":[[[150,108],"assets/images/resized/0011/6259/116259v2-max-150x150.jpg"],[[250,180],"assets/images/resized/0011/6259/116259v2-max-250x250.jpg"],[[400,288],"assets/images/resized/0011/6259/116259v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}