{"first_name":"Larry","last_name":"Weir","permalink":"larry-weir","crunchbase_url":"http://www.crunchbase.com/person/larry-weir","homepage_url":"http://larryweir.com","birthplace":"Los Angeles, CA","twitter_username":"LarryWeir","blog_url":"http://www.myspace.com/27185723/blog","blog_feed_url":"http://www.myspace.com/27185723/blog/rss","affiliation_name":"Unaffiliated","born_year":1952,"born_month":4,"born_day":11,"tag_list":"larry-weir, new-music-weekly, backstage-entertainment, spins-tracking-system, national-record-promotion, radio-promotion, teen-witch, teen-witch-the-musical","alias_list":null,"created_at":"Thu Oct 15 04:47:18 UTC 2009","updated_at":"Thu Aug 02 21:06:34 UTC 2012","overview":"<p>LARRY WEIR BIO</p>\n\n<p>Larry Weir began his music career in the San Diego area in 1967. As a singer/guitarist inspired by the Beatles and composers Burt Bacharach &amp; Jimmy Webb, Larry Weir formed a pop band &#8220;The Royal Enterprise&#8221; comprised of brother Tom Weir (now a renowned recording engineer), sister Maria Werth (who has become a teacher/session bass player) and a few neighbors. The band had a local radio hit with one of Larry Weir ‘s first compositions in 1968, &#8220;Boy It&#8217;s All In Your Head&#8221;.</p>\n\n<p>In 1970 Larry Weir‘s family, comprised of mother Maria, a classical pianist and Larry Weir, his architect/builder father, along with 8 brothers and sisters, moved to the city of Oxnard in Ventura County. While attending his senior year at Oxnard High, Larry Weir recruited many of the siblings in forming a band called &#8220;The Family&#8221;. It was also during this time that Larry Weir wrote, produced, acted and starred in three original musicals. &#8220;Island&#8221; in 1971 while attending Ventura College in 1971, &#8220;Hobos Jungle&#8221; in &#8216;72 &amp; &#8220;House On Crossroad Alley&#8221; in 1973, all part of the Ventura County Youth Experimental Theatre, a group that he co-founded with Maria and Tom. The shows were all critical successes and were performed for thousands in the Ventura Country area. &#8220;I can&#8217;t believe we even pulled those productions off&#8221;, said Larry from his home in the West Hollywood, CA area that he shares with his wife of eight years, Masika Swain. &#8220;These musicals were huge productions that involved massive set designs (many constructed by my father), choreography, costumes, actors, singers, dancers along with a full orchestra&#8221;, he added. In 1974 the family moved back to the San Diego area leaving the musical era behind to concentrate on the new and improved family band, The Weirz, that now comprised all nine members of the family. A year later they found their first radio success by winning a spot of KGB radio&#8217;s &#8220;Homegrown #3&#8221; with an autobiographical song called &#8220;Gypsies From Bonsall&#8221;. The album sold over 50,000 copies in the local area and inspired the band to record a solo album &#8220;The Weirz&#8221; (&#8216;76) leading them to the Los Angeles area to be closer to the record industry.</p>\n\n<p>In 1979 The Weirz released another self-titled album, headlined the top clubs in the area from the infamous Troubadour, Starwood, The Whisky, among others. During one of the Troubadour shows, little brother Michael (now known as Michael Damian) caught media attention and ended up with a contract on the CBS daytime drama &#8220;The Young &amp; The Restless&#8221;. Larry Weir soon found himself writing a good deal of the songs that Michael would perform as this struggling waiter/singer character &amp; also moved Larry into a personal management capacity. The Weirz signed a deal with Curb Records in 1983 releasing singles in Europe and eventually had a US release in &#8220;Imagination&#8221; that included a video, appearances on American Bandstand, Dance Fever, television specials, while fueling them towards more headlining events. 1984 found even greater success for Larry as he helped engineer a deal for brother Michael with CBS records in Canada. &#8220;Love Is A Mystery&#8221; (Columbia) was a huge success, and Larry&#8217;s composition &#8220;She&#8217;s In A Different World&#8221; gave Michael a Canadian hit that was also featured on NBC&#8217;s &#8220;The Facts Of Life&#8221; and numerous television shows setting the plate for a major Canadian tour. A follow up album &#8220;Michael Damian&#8221; (CBS) released in 1987 brought even more tours along with another Larry original hit, &#8220;What Are You Looking For&#8221;. It was during this time that The Weirz performed their last tour as a band while opening for the Michael Damian shows. Larry became involved in composing songs and scores for movie soundtracks during the mid-eighties that included, &#8220;Return to Horror High&#8221;, &#8220;Something Special&#8221; &amp; the film musical &#8220;Teen Witch&#8221; that has gone on to become a cult hit having aired on cable and the Disney channel hundreds of times. &#8220;This was a unique experience in that they actually built some of the story line and dialogue around songs that I brought the producers after reading the original draft of the script&#8221;, said Weir. The success of &#8220;Teen Witch&#8221; would lead to the film &#8220;Dream A Little Dream&#8221; that would eventually land Larry a #1 record on the Billboard charts with his co-production of Michael Damian&#8217;s &#8220;Rock On&#8221; (A&amp;M/Cypress) in June of 1989. &#8220;It was a surreal experience watching the song climb week after week, and by week #12 we beat all the rest and had a #1!&#8221;, Larry reminisced. There were subsequent radio hits, &#8220;Cover Of Love&#8221; &amp; the AC/CHR Hit, &#8220;Was It Nothing At All&#8221; that gained a BMI publishing award for one of the &#8220;most played songs in 1990&#8221;. Another album followed for A&amp;M &#8220;Dreams Of Summer&#8221;. There were several more radio hits in &#8220;What A Price To Pay&#8221; and the Larry Weir penned &#8220;There&#8217;ll Never Be Another You&#8221; that was featured on everything from &#8220;The Young &amp; The Restless&#8221; to the Oprah Winfrey show. The mid-nineties found Larry, brother Tom and close friend Michael Parnell scoring the CBS series &#8220;Dangerous Curves&#8221;. &#8220;It was a thrill of a lifetime to have composed a theme for a network &#8220;primetime&#8221; show&#8221;, Larry Weir recalls. The show lasted only several seasons but gave him and his fellow composers worldwide recognition. Several other albums were produced with the Larry Weir, Michael Damain, &amp; Tom Weir combo. They included the 1994 &#8220;Reach Out To Me&#8221; (Scotti Brothers) and a charted single by the same name that made it&#8217;s national debut on Jay Leno&#8217;s Tonight Show. 1996 saw another album venture &#8220;Time Of The Season&#8221; (Wildcat) with another Larry Weir penned, &#8220;Never Walk Away&#8221; that charted top ten on the AC40 charts. After leaving A&amp;M and now working with independent labels, Larry Weir became quite heavily involved in record promotion, something he had an experience in by over-seeing the climb of &#8220;Rock On&#8221;. &#8220;I realized that I knew more people in radio then all of those independent record promoters we were spending large sums of money on&#8221;, recalls Larry. He began calling radio stations on a weekly basis in 1995 just to check up on the other promoters, and has been doing so ever since with his now established, &#8220;National Record Promotion&#8221;. Larry has gone on to work records for some of the greatest artists in the music industry including Crystal Waters, Marshall Tucker, Janis Ian, Peabo Bryson, Billy Vera, to name just a few. In 1998 he teamed up with fellow independent promoter Paul Loggins to form New Music Weekly, a trade publication that is fast becoming one of the most important trades in the music industry in breaking new artists. &#8220;The last thing I wanted was to have to start a trade publication, we needed a voice in the music industry and I&#8217;m so glad we made the move&#8221;, says Larry. All the work in record promotion and publishing a weekly trade magazine has helped to make Larry a better writer/producer. &#8220;I get all the CD&#8217;s that every label in America puts out each week, and I am able to get a real solid education as to what is working at radio&#8221;, he says.</p>\n\n<p>In 2008 the &#8220;Brothers Weir&#8221; formed Caption Records. The first releases have garnered critical, sales and chart success including &#8220;Teen Witch/The Musical&#8221;, Country recording artist Buck McCoy&#8217;s Top Dog album, and the soundtrack for the motion picture &#8220;Moondance Alexander&#8221;, which was written and directed by little brother Michael Damian. Larry composed and produced 6 out of the 12 tracks on the album. &#8220;Teen Witch the Musical&#8221; for which Larry also contributed to book, music &amp; lyrics is &#8220;Broadway Bound&#8221;. His National Record Promotion continues to be one of the top radio promotion companies in the nation &amp; Larry Weir ‘s work with ventures like the Independent Music Network &amp; the Artists Management Firm keeps him at the top of the music industry.</p>","image":{"available_sizes":[[[104,150],"assets/images/resized/0006/2771/62771v2-max-150x150.jpg"],[[173,250],"assets/images/resized/0006/2771/62771v2-max-250x250.jpg"],[[312,450],"assets/images/resized/0006/2771/62771v2-max-450x450.jpg"]],"attribution":"<p>Larry Weir</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://en.wikipedia.org/wiki/Larry_Weir_production_discography","title":"Discography on Wikipedia"},{"external_url":"http://en.wikipedia.org/wiki/Larry_Weir","title":"Larry Weir on Wikipedia"}],"web_presences":[{"external_url":"http://www.larryweir.com","title":"Larry Weir"},{"external_url":"http://www.biznik.com/members/larry-weir-larry-weir","title":"Larry Weir - biznik Profile"},{"external_url":"http://www.qik.com/larry-weir","title":"Larry Weir - qik Profile"},{"external_url":"http://www.free-press-release.com/news/200907/1248066446.html","title":"Press Releases about Larry Weir"},{"external_url":"http://twitter.com/LarryWeir","title":"Larry Weir - Twitter"},{"external_url":"http://imdb.com/name/nm0918611/","title":"Larry Weir - imdb"}]}