{"first_name":"Larry","last_name":"Irving","permalink":"larry-irving","crunchbase_url":"http://www.crunchbase.com/person/larry-irving","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Thu Nov 29 18:58:57 UTC 2012","updated_at":"Thu Nov 29 18:59:22 UTC 2012","overview":"<p>Larry Irving is the President and CEO of the Irving Group, a consulting firm providing strategic advice and assistance to international telecommunications and information technology companies, foundations and non-profit organizations. From September, 2009 to July, 2011, Mr. Irving served as Vice President for Global Government Affairs for the Hewlett-Packard Company, the world’s largest technology company.  Prior to founding the Irving Group in 1999, Mr. Irving served for almost seven years as Assistant Secretary of Commerce for Communications and Information and Administrator of the National Telecommunications and Information Administration (NTIA), where he was a principal advisor to the President, Vice President and Secretary of Commerce on domestic and international telecommunications and information technology issues.  Mr. Irving was one of the principal architects and advocates of the Clinton Administration&#8217;s telecommunications and Internet policies, and was a point person in the Clinton Administration&#8217;s successful efforts to reform the United States telecommunications laws. Those efforts resulted in passage of the Telecommunications Act of 1996, the most sweeping change in America s telecommunications laws in 60 years.Similarly, in international fora, Irving was an ardent advocate of regulatory reform. He represented the United States Government as Sherpa (lead coordinator for the U.S. Government) at the G-7&#8217;s first Ministerial meeting on the Global Information Society in Brussels, and at the Information Society and Development Conference in South Africa, the first Ministerial meeting between developing countries and developed countries to discuss the emerging global Internet. Mr. Irving was also a key member of the United States team that negotiated the World Trade Organization (WTO) agreement on basic telecommunication services.Mr. Irving is widely credited with coining the term the digital divide and sparking global interest in the issue. In large part due to his work to promote policies and develop programs to ensure access to advanced telecommunications and information technologies, Mr. Irving was named one of the fifty most influential persons in the &#8216;Year of the Internet&#8217; by Newsweek Magazine.Mr. Irving currently serves as a member of the Boards of Directors of the Public Broadcasting Service and ReliabilityFirst Corporation. He also serves on the Board of Visitors for Stanford Law School, the Board of Councilors for the Annenberg School of Communications at the University of Southern California, the Board of Visitors for the Weinberg College of Arts and Sciences of Northwestern University and the Director’s Circle for the Smithsonian American Art Museum.  He received a Bachelor of Arts degree from Northwestern University, and is a recipient of the University’s Alumni Merit Award for distinguished professional achievement. He is also a graduate of Stanford University School of Law, where he was elected President of his graduating class. . Mr. Irving co-chairs the PBS National Policy Advisory Committee and the Funding the Vision 2 Panel and serves on the Strategic Planning Advisory Group and Nominating and Governance Committee.</p>","image":{"available_sizes":[[[150,134],"assets/images/resized/0022/3052/223052v1-max-150x150.png"],[[183,164],"assets/images/resized/0022/3052/223052v1-max-250x250.png"],[[183,164],"assets/images/resized/0022/3052/223052v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}