{"first_name":"Larry","last_name":"Sanger","permalink":"larry-sanger","crunchbase_url":"http://www.crunchbase.com/person/larry-sanger","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Wikipedia","born_year":null,"born_month":null,"born_day":null,"tag_list":"knowledge","alias_list":"","created_at":"Tue Jun 05 18:50:43 UTC 2012","updated_at":"Sun Jun 24 03:03:22 UTC 2012","overview":"<p>Larry Sanger is an American philosopher, co-founder of Wikipedia, and the founder of Citizendium. He grew up in Anchorage, Alaska. From an early age he has been interested in philosophy. Sanger received a Bachelor of Arts in philosophy from Reed College in 1991 and a Doctor of Philosophy in philosophy from Ohio State University in 2000. Most of his philosophical work has focused on epistemology, the theory of knowledge.</p>\n\n<p>He has been involved with various online encyclopedia projects. He is the former editor-in-chief of Nupedia, chief organizer (2001–2002) of its successor, Wikipedia, and founding editor-in-chief of Citizendium. From his position at Nupedia, he assembled the process for article development. Sanger proposed implementing a wiki, which led directly to the creation of Wikipedia. Initially Wikipedia was a complementary project for Nupedia. He was Wikipedia&#8217;s early community leader and established many of its original policies. He spearheaded an alternative wiki-based project, Citizendium.</p>\n\n<p>Sanger left Wikipedia in 2002, and has since been critical of the project. He articulated that despite its merits, Wikipedia lacks credibility due to, among other things, a lack of respect for expertise. After leaving the project, Sanger taught philosophy at Ohio State University and was an early strategist for the expert-authored Encyclopedia of Earth. On September 15, 2006 he publicly announced Citizendium, first envisioned as a fork of Wikipedia. It was launched on March 25, 2007. Citizendium represents an effort to create a credible and free-access encyclopedia. Sanger had aimed to bring more accountability to the Internet encyclopedia model.</p>\n\n<p>He is currently working on developing educational projects for individuals behind WatchKnowLearn and is designing a program to teach children how to read. He started blogging on various subjects, including baby reading. He also works part-time as a writer, speaker, and consultant on the topic of collaborative online communities.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0019/4051/194051v1-max-150x150.jpg"],[[165,250],"assets/images/resized/0019/4051/194051v1-max-250x250.jpg"],[[175,264],"assets/images/resized/0019/4051/194051v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Co-Founder","firm":{"name":"Wikipedia","permalink":"wikipedia","type_of_entity":"company","image":{"available_sizes":[[[130,150],"assets/images/resized/0020/7177/207177v2-max-150x150.png"],[[135,155],"assets/images/resized/0020/7177/207177v2-max-250x250.png"],[[135,155],"assets/images/resized/0020/7177/207177v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}