{"first_name":"Larry","last_name":"Dennison","permalink":"larry-dennison","crunchbase_url":"http://www.crunchbase.com/person/larry-dennison","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri May 20 03:56:06 UTC 2011","updated_at":"Fri May 20 03:59:38 UTC 2011","overview":"<p>Larry Dennison brings to MetraTech his expertise in distributed systems, networking and OSS. Larry is responsible for product management and software architecture. He has a passion for building high-performance, scalable, reliable software, and he has developed and deployed products in some of the largest and most demanding customer networks in the world.  As a division scientist at Internet and parallel computing systems pioneer BBN Technologies, Larry began building massively parallel distributed systems including the BBN Butterfly parallel computer. After BBN, he co-founded Avici Systems (Nasdaq:AVCI) as chief architect and CTO to tackle the challenges of scalable core routing using distributed architecture designs based on his PhD thesis from MIT. The company went public in 2000 with one the most successful IPOs of the year. After Avici, Larry co-founded Soapstone Networks (Nasdaq:SOAP) a provider of multi-vendor resource and service control software. Most recently, Larry served as President and Chief Architect of Lightwolf Technologies.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Architecture Officer","firm":{"name":"MetraTech","permalink":"metratech","type_of_entity":"company","image":{"available_sizes":[[[150,42],"assets/images/resized/0013/5527/135527v1-max-150x150.jpg"],[[227,65],"assets/images/resized/0013/5527/135527v1-max-250x250.jpg"],[[227,65],"assets/images/resized/0013/5527/135527v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}