{"first_name":"Larry","last_name":"Fitzgibbon","permalink":"larry-fitzgibbon","crunchbase_url":"http://www.crunchbase.com/person/larry-fitzgibbon","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Demand Media","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Aug 31 15:04:36 UTC 2007","updated_at":"Tue Jul 24 09:55:37 UTC 2012","overview":"<p>Larry Fitzgibbon is an advisor, entrepreneur and media technology executive focused on building Internet media companies.</p>\n\n<p>Most recently, Larry was Executive Vice President of Media and Operations and a member of the founding team of Demand Media.  While at Demand Media, Larry also served as EVP, International and SVP, Monetization. During his tenure at Demand Larry oversaw the media division including, studio and web property operations, business development, monetization, and he was a key member of the executive team that led the company through its initial public offering in 2010.  Larry was responsible for guiding the launches and day-to-day management of the company’s award-winning media, mobile and social media properties, including eHow, LIVESTRONG.COM, TypeF and Cracked.com.  Under his management Demand Media’s portfolio of media properties grew to a worldwide audience of more than 140 million unique visitors, and annual revenue grew from $5MM to $150MM. </p>\n\n<p>Prior to Demand Media, Larry served as Vice President of Business Development at Citysearch, Inc., an operating business of IAC/InterActiveCorp.  At Citysearch, he developed and executed the company’s business and partnership strategy to drive its leadership position within the local search/Internet Yellow Pages marketplace.</p>\n\n<p>Earlier in his career, Larry was Vice President of Distribution at Intertainer, a pioneer in the burgeoning video-on-demand business. In this role, Larry designed and executed distribution strategy for the organization, while managing relationships with its film, television, Internet and cable partners.</p>\n\n<p>Larry is a supporter of the Lance Armstrong Foundation and a member of its Revenue Committee.</p>\n\n<p>Larry graduated from St. Louis University with a BA in Communications.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"EVP, Media and Operations","firm":{"name":"Demand Media","permalink":"demandmedia","type_of_entity":"company","image":{"available_sizes":[[[150,32],"assets/images/resized/0000/0247/247v3-max-150x150.png"],[[250,54],"assets/images/resized/0000/0247/247v3-max-250x250.png"],[[450,97],"assets/images/resized/0000/0247/247v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}