{"first_name":"Larry","last_name":"Logan","permalink":"larry-logan","crunchbase_url":"http://www.crunchbase.com/person/larry-logan","homepage_url":"http://www.zulutimecorp.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"cmo, digimarc, webmd, healtheon, zeba, absorbent-technologies, immersive-media","alias_list":null,"created_at":"Wed Apr 06 14:49:18 UTC 2011","updated_at":"Wed Apr 13 15:21:24 UTC 2011","overview":"<p>Larry is the Chief Marketing Officer at ZuluTime, responsible for facilitating growth, sales and marketing strategy.</p>\n\n<p>His career began as a creative director and marketer in Hollywood in association with 20th Century Fox, CBS, HBO, Columbia Pictures, and Paramount Pictures, among others. He is the recipient of more than 75 RIAA-certified Gold and Platinum records for retail marketing campaigns in the entertainment industry. </p>\n\n<p>Larry served as Director of Creative and Brand Marketing for Digimarc, playing a key role as the brand evangelist and the establishment of Digimarc as the world leader in digital watermarking technology. He also served as the Vice President for Marketing &amp; Communications at Healtheon/WebMD, which as Healtheon (HLTH) enjoyed the largest internet healthcare IPO and in its merger with WebMD the largest pure merger of internet companies at that time. </p>\n\n<p>Larry next spent four years performing due diligence principally in China as the CMO for a venture-funded holding company to acquire Chinese-based companies in the field of satellite communications, mobile technology and services. More recently, he served as the CMO for Absorbent Technologies, launching a new agricultural and consumer gardening technology that yielded higher plant yields using less water, and where he licensed the brand and technology to global manufacturers and distributors. </p>\n\n<p>Prior to ZuluTime he was the CMO for Immersive Media, the world leader in 360-degree interactive video technology and production services. Among his key projects was the filming of the 2010 Vancouver Olympic Games in360-degree video for NBC and coverage of the 2010 Haiti Earthquake in association with CNN.</p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0012/9482/129482v2-max-150x150.jpg"],[[80,80],"assets/images/resized/0012/9482/129482v2-max-250x250.jpg"],[[80,80],"assets/images/resized/0012/9482/129482v2-max-450x450.jpg"]],"attribution":"<p>Courtesy of WSJ</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}