{"first_name":"Lars","last_name":"Callary","permalink":"lars-callary","crunchbase_url":"http://www.crunchbase.com/person/lars-callary","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Future Ads","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 03 22:07:33 UTC 2012","updated_at":"Tue Jul 10 16:25:46 UTC 2012","overview":"<p>Lars heads up all of Future Ads’ marketing efforts and media buying, and is dedicated to driving ever-more gamers into the company’s platform. He also assists with product development, optimizing both existing business processes, and exploring new arenas.</p>\n\n<p>Prior to joining the company, he founded his own pay-for-performance marketing agency. Prior to that, he worked at performance marketing leader, Commission Junction, as a Publisher Development exec, and was also one of the founding employees at LeadPoint, the first online lead exchange marketplace, where he secured and managed key accounts on the publisher side. He earned his B.A. in Economics from the University of California, Santa Barbara.</p>\n\n<p>Lars owns and operates the popular boutique coffee shop, &#8220;Larbucks,&#8221; (i.e., his on-desk espresso machine), which is arguably the most popular coffee shop at Future Ads’ company headquarters, despite having consistently flat ($0) revenues. Although he’s not remotely artistic, he enjoys modern, minimalist design. He also loves mountain biking, snowboarding, cooking, traveling, spending time with his family, producing music (poorly) – and never stopping talking.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Executive Vice President, Marketing & Product Development","firm":{"name":"Future Ads","permalink":"future-ads","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0011/0205/110205v8-max-150x150.png"],[[180,180],"assets/images/resized/0011/0205/110205v8-max-250x250.png"],[[180,180],"assets/images/resized/0011/0205/110205v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}