{"first_name":"Lars","last_name":"Windhorst","permalink":"lars-windhorst","crunchbase_url":"http://www.crunchbase.com/person/lars-windhorst","homepage_url":"http://www.123larswindhorst.com/","birthplace":"Germany","twitter_username":"larswindhorst","blog_url":"","blog_feed_url":"","affiliation_name":"Sapinda Deutschland GmbH","born_year":null,"born_month":null,"born_day":null,"tag_list":"lars-windhorst, ceo, sapinda, uk, london, german, businessman, investor","alias_list":null,"created_at":"Sun Jun 07 09:00:25 UTC 2009","updated_at":"Wed May 02 05:08:21 UTC 2012","overview":"<p>In the beginning of the 1990´s Lars Windhorst was said to be Germany´s number one business founder and a unique example for entrepreneurial spirit. He was hailed as the &#8220;Wunderkind&#8221; of German economy and Ex-Chancellor Helmut Kohl was pleased about the economic offspring of Germany. Until 1997 Lars Windhorst accompanied the former prime minister at business delegations abroad. Lars Windhorst started his entrepreneurial activities with electronic components which he imported from the Far East and assembled to personal computers in Germany in order to sell them at profit. An internationally operating business conglomerate was set up by the teenager in no time.</p>\n\n<p>Lars Windhorst climbs up the career ladder</p>\n\n<p>In the early 90´s Lars Windhorst began trading electronic components and computer parts and revealed great finesse in negotiating.\nThe Business-Wunderkind always contrived to win the favor of the people surrounding him. At the age of 16 Lars Windhorst met 27-year-old Mellon Zhang who opened for him the doors to China and Hongkong. The sales director of a Chinese electronics company quit his job without further ado, became Windhorst´s partner and accompanied him on his way in the Far East. In 1993 then 17-year-old Lars Windhorst founded Windhorst Electronics GmbH and became the Wunderkind of German economy. With cleverness and incisiveness he quickly put into practice what big industrialists loose sleep over.</p>\n\n<p>Lars Windhorst to make millions of profit</p>\n\n<p>Shortly thereafter followed branches in China, Vietnam, and Europe. Lars Windhorst expanded his business rapidly and was further active in areas such as electronics, industry, trading, real estate and finance. With offices also based in Hong Kong the Windhorst group operated by 1995 in Germany, Europe and Asia to generate a turnover of 180 million Marks. In its second financial year the company of multi-talent Lars Windhorst translated more than twice as much into profits as in its first year. A mere 19 years old Lars Windhorst became Germany´s most successful entrepreneur. The young chief executive ran an international branch network of 20 establishments with over 200 employees world-wide.</p>\n\n<p>The Windhorst group and its operating areas</p>\n\n<p>Among the most important business fields within the European area were the distributions of electronic components, the assembly of personal computers as well as the production of advertising films.\nHis Asian companies conducted commerce with primary products and provided business consultancy and real estate business. In the course of business expansion, Lars Windhorst founded later on the trading and investment conglomerate  Windhorst AG and additional companies in  financial services, including Windhorst Capital Holding GmbH. Young and vibrant Lars Windhorst shifted its focus in the beginning of 2000 to the New Economy and made substantial investments in the internet area, telecommunications and media.</p>\n\n<p>The crisis of the New Economy that followed, threw the Windhorst group off balance which had to file for bankruptcy afterwards.</p>\n\n<p>Lars Windhorst, CEO of Sapinda Deutschland GmbH</p>\n\n<p>Nevertheless, exceptional talent Lars Windhorst keeps up. In 2004 Lars Windhorst co-founded the investment group Sapinda. With deft investment strategies in the field of business finance, Lars Windhorst shortly reached high profits for the company. The investment group, under the financial direction of a famous South African industrialist family, transacted investments of more than 2 billion EUR over the last 5 years.</p>\n\n<p>In 2007, Mr. Windhorst was seated behind the cockpit in a Bombardier Challenger 604 during takeoff from Kazakhstan when the plane suddenly crashed into a wall. The accident, which left one of the pilots dead, caused serious injuries to Lars Windhorst. He lost consciousness and found himself lying in the snow-covered wreckage with burns, bruises and broken ribs. Following four weeks in the hospital, he has barely recovered just when the stock market took a tumble. Due to the impact of the financial crisis in 2008, the company underwent a restructuring phase in the 2nd half of 2008. In April 2009 it took up its investment activities again under new corporate structure. In May 2009 Lars Windhorst founded Sapinda Deutschland GmbH.</p>\n\n<p>The investment and holding company Sapinda Deutschland GmbH manages public equity, private equity and global debt and is the German subsidiary of Sapinda Holding BV. In order to successfully move forward in the international investment market, Lars Windhorst selected a group of financial professionals to head Sapinda&#8217;s advisory board. The group is headed by Chairman Dr. Hubertus von Grünberg, who is also chairman at ABB Ltd in Zurich and a member of other international supervisory boards.  Lars Windhorst chose him to advise Sapinda&#8217;s management regarding all of its strategic decisions relating to major business investments. Lars Windhorst, together with other backers Robert Hersov and Dr. Kim, invests in the international capital market with a special emphasis on the raw materials market as well as agricultural production.</p>\n\n<p>Lars Windhorst Addresses Problems Facing the Younger Generation</p>\n\n<p>With a heart towards helping young people, Lars Windhorst joined the Mentor Foundation as a member of the board from 1997 through 2002. The group joins with government officials, parents and schools to teach youngsters how to avoid the pitfalls of drug abuse. The Queen of Sweden was one of the co-founders of the organization that is connected with the World Health Organization. A truly global endeavor, the international headquarters are located in the UK, with other offices in Germany, Lithuania, US, Lebanon, Columbia and Latvia. </p>","image":{"available_sizes":[[[150,102],"assets/images/resized/0004/8427/48427v2-max-150x150.jpg"],[[150,102],"assets/images/resized/0004/8427/48427v2-max-250x250.jpg"],[[150,102],"assets/images/resized/0004/8427/48427v2-max-450x450.jpg"]],"attribution":"<p>Lars Windhorst</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Sapinda Deutschland GmbH","permalink":"sapinda-deutschland-gmbh","type_of_entity":"financial_org","image":null}},{"is_past":false,"title":"CEO","firm":{"name":"Sapinda Deutschland GmbH","permalink":"sapinda-deutschland-gmbh","type_of_entity":"company","image":null}}],"investments":[{"funding_round":{"round_code":"unattributed","source_url":"http://www.finsmes.com/2011/12/sterecycle-raises-5-1m-equity-funding.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+finsmes%2FcNHu+%28FinSMEs%29","source_description":"Sterecycle Raises £5.1M in Equity Funding","raised_amount":5100000,"raised_currency_code":"GBP","funded_year":2011,"funded_month":12,"funded_day":22,"company":{"name":"Sterecycle","permalink":"sterecycle","image":{"available_sizes":[[[150,103],"assets/images/resized/0016/7471/167471v1-max-150x150.png"],[[241,167],"assets/images/resized/0016/7471/167471v1-max-250x250.png"],[[241,167],"assets/images/resized/0016/7471/167471v1-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.larswindhorstplaces.co.uk","title":"Lars Windhorst Places"}],"web_presences":[{"external_url":"http://www.facebook.com/WindhorstLars","title":"Lars Windhorst Facebook Page"},{"external_url":"http://www.larswindhorst.co.uk/","title":"Who is Lars Windhorst?"}]}