{"first_name":"Lars","last_name":"Thunell","permalink":"lars-thunell","crunchbase_url":"http://www.crunchbase.com/person/lars-thunell","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 13 11:30:25 UTC 2009","updated_at":"Thu Jun 25 13:17:08 UTC 2009","overview":"<p>Lars H. Thunell, a Swedish national, is Executive Vice President and CEO of IFC (International Finance Corporation), a member of the World Bank Group.</p>\n\n<p>Mr. Thunell is leading IFC in its mission to promote sustainable private sector development. Since joining the Corporation in January 2006, Mr. Thunell has advanced growth of IFC&#8217;s business and its mission to create opportunities in emerging markets and improve people&#8217;s lives. He has visited 60 developing countries to see firsthand how IFC can best help its clients with financing and advisory services, and endorsed further decentralization of IFC.</p>\n\n<p>Mr. Thunell joined IFC after a successful career in the financial services industry. Most recently, he was the Chief Executive Officer of SEB, a North European commercial and investment bank. In the 1990s, Mr. Thunell served as the Chief Executive Officer of Trygg-Hansa, a Swedish insurance company, and as Deputy Chief Executive Officer of Nordbanken.</p>\n\n<p>As President and Chief Executive Officer of Securum, an asset management company established by the Swedish government, he played a key role in the government&#8217;s strategy for resolving the country&#8217;s banking crisis of the 1990s. Under Mr. Thunell&#8217;s leadership, Securum was able to restructure and sell off distressed assets held by the government more quickly than originally expected, recovering value for the Swedish taxpayer.</p>\n\n<p>Previously, he worked at ABB Zurich and at American Express in New York. He has also held numerous board positions with international companies and nongovernmental organizations.</p>\n\n<p>Mr. Thunell graduated with a doctorate from the University of Stockholm and was a research fellow at the Harvard University Center for International Affairs.</p>","image":{"available_sizes":[[[119,131],"assets/images/resized/0005/0671/50671v1-max-150x150.jpg"],[[119,131],"assets/images/resized/0005/0671/50671v1-max-250x250.jpg"],[[119,131],"assets/images/resized/0005/0671/50671v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Executive Vice President and CEO","firm":{"name":"International Finance Corporation","permalink":"international-finance-corporation","type_of_entity":"financial_org","image":{"available_sizes":[[[150,29],"assets/images/resized/0004/3908/43908v1-max-150x150.jpg"],[[250,49],"assets/images/resized/0004/3908/43908v1-max-250x250.jpg"],[[299,59],"assets/images/resized/0004/3908/43908v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}