{"first_name":"LaTonya","last_name":"Higgins","permalink":"latonya-higgins","crunchbase_url":"http://www.crunchbase.com/person/latonya-higgins","homepage_url":"http://www.latonyahiggins.me","birthplace":"Los Angeles","twitter_username":"simplemonyworld","blog_url":"http://mobilehost.wordpress.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"latonya-higgins, diva-of-development, internet-marketing, global-business","alias_list":null,"created_at":"Wed Nov 03 05:18:59 UTC 2010","updated_at":"Thu Nov 04 17:47:29 UTC 2010","overview":"<p>LaTonya’s degree studies are in Internet Marketing and Advertising, which studies the science of how those on the Internet behave and the science of how to build virtual business based on that volume of behavior.   Upon completing the program, She will be automatically enrolled in a Dual Masters /Doctorate program for Global Marketing/Global Business and Enterprise.  LaTonya helps build your business online.  Besides helping entrepreneurs to establish an online presence she also help with brand awareness, understanding consumer behavior via the Internet and mobile platforms.  She commands such computer languages as HTML, HTML5, Python, Silverlight 4.  Her love and niche is mobile development and marketing.  LaTonya looks at the current status of a business and gives strategic advice on how to position the business, detailing the resources that will help a business grow.  Analyzing the data retrieved she can tell you how fast or slow business growth is to be determined.</p>\n\n<p>LaTonya’s hobbies and interest are all business related and her secondary passion is reading, she is a true business information junkie, she has even gone on dates to the bookstore.  She enjoys the Internet.  Although she has been told many times that she works to much, she personally feels if you are doing what you love then it really is not work.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0010/8431/108431v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0010/8431/108431v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0010/8431/108431v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.latonyahiggins.me","title":"Personal Page"},{"external_url":"http://www.facebook.com/divaofdevelopment","title":""}],"web_presences":[]}