{"first_name":"Laura","last_name":"Fox","permalink":"laura-fox","crunchbase_url":"http://www.crunchbase.com/person/laura-fox","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jul 10 18:05:25 UTC 2011","updated_at":"Sun Jul 10 18:13:34 UTC 2011","overview":"<p>Ms. Fox is an organized and resourceful professional who keeps cool under pressure and adapts to change when traditional solutions aren&#8217;t working. These qualities make her critical to the success of National Surgery Network (NSN) and its paradigm-shifting efforts to bring pre-negotiated global case rates to its clients.\nAt NSN, she is responsible for developing scalable processes across the company and overseeing sales and marketing, technology development, care coordination, and vendor relationships.</p>\n\n<p>Her ability to communicate effectively with people in all areas of the company is complemented by her rare expertise. Ms. Fox’s background in engineering brings unique problem-solving and logistical capabilities to NSN. Her experience with both Internet and public sector start-up companies gives her real-word knowledge of business process development, as well as sales and marketing.</p>\n\n<p>She began her career in Albuquerque, New Mexico specializing in water system design, evaluation, and construction in the city’s public works department. After that, she worked as an engineer with American Gem Mining, a small, start-up sapphire mining company in Montana. Her task: to thoroughly understand mining yields and to work with gemstone cutting facilities in China to increase production yield. In addition to improving processes for scalability, she was charged with developing extensive sales channels for large-scale distribution of cut gemstones. </p>\n\n<p>Ms. Fox left Montana to join an Internet start-up retailer in Seattle, Washington. There her job was to understand the company’s market and develop a merchandising plan to fill its distribution channel. She was then recruited by a larger start-up Internet retailer in Charlottesville, Virginia to work in merchandising and buying across multiple categories. That company went public during her tenure. </p>\n\n<p>Before joining NSN, Ms. Fox was co-founder of the Corrales International School, an International Baccalaureate language immersion charter school in New Mexico. She served as President of the Governing Council for three years. During this time she led the school through the rigorous public charter approval process with state and local agencies. She worked closely with architects, attorneys, and local agencies in the design, development, and ultimate approval of the school buildings. She was responsible for hiring and overall operations. The school continues to flourish and was one of the highest-performing schools in the state last year.</p>","image":{"available_sizes":[[[104,130],"assets/images/resized/0014/3370/143370v1-max-150x150.png"],[[104,130],"assets/images/resized/0014/3370/143370v1-max-250x250.png"],[[104,130],"assets/images/resized/0014/3370/143370v1-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"","subject":"Civil Engineering","institution":"South Dakota School of Mines and Technology","graduated_year":1994,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Director of Operations","firm":{"name":"National Surgery Network","permalink":"national-surgery-network","type_of_entity":"company","image":{"available_sizes":[[[150,33],"assets/images/resized/0014/3366/143366v1-max-150x150.jpg"],[[250,56],"assets/images/resized/0014/3366/143366v1-max-250x250.jpg"],[[408,92],"assets/images/resized/0014/3366/143366v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}