{"first_name":"Laurent","last_name":"Gil","permalink":"laurent-gil","crunchbase_url":"http://www.crunchbase.com/person/laurent-gil","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Viewdle","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Mar 25 06:18:03 UTC 2008","updated_at":"Thu Aug 06 06:23:10 UTC 2009","overview":"<p>Laurent Gil is president and ceo of Viewdle. He is responsible for Viewdle’s day-day-operations, including business strategy, business development activities and investor relations outreach.</p>\n\n<p>Prior to joining Viewdle, Laurent was a senior investment banker that held various positions in corporate finance and capital markets at the French investment bank Credit Agricole, with assignments in New York, Tokyo and Paris. During his MBA at Wharton, he co-founded a boutique investment bank in Brazil that completed several large transactions in the telecom sector in Latin America. He also co-founded and served as CFO of TAHO, a wireless internet service provider in Rio de Janeiro, which raised US $10MM in 2001 and subsequently launched a service of broadband wireless internet in communities. Additionally, Laurent has run a successful oil and gas exploration company, which was recently sold under his watch.</p>\n\n<p>Laurent is a Summa Cum Laude graduate from The University of Bordeaux in France with a B.S. in mathematics, physics and computer science; he holds a Master of Science degree in signal processing from the French graduate engineering school Supélec, a post-graduate degree in management from the Collège des Ingénieurs in Paris, France and an MBA from the Wharton School of Business, Philadelphia, USA (2003).</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"Viewdle","permalink":"viewdle","type_of_entity":"company","image":{"available_sizes":[[[150,133],"assets/images/resized/0000/0271/271v5-max-150x150.jpg"],[[250,222],"assets/images/resized/0000/0271/271v5-max-250x250.jpg"],[[450,399],"assets/images/resized/0000/0271/271v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}