{"first_name":"Lauren","last_name":"Jones","permalink":"lauren-jones","crunchbase_url":"http://www.crunchbase.com/person/lauren-jones","homepage_url":"http://www.LaurenJonesCollection.com","birthplace":"Jackson, Mississippi","twitter_username":"LaurenJonesShoe","blog_url":"http://www.LaurenJonesFootwear.blogspot.com","blog_feed_url":"http://www.myspace.com/laurenjoneswwediva","affiliation_name":"Lauren Jones Footwear","born_year":1982,"born_month":8,"born_day":27,"tag_list":"lauren-jones, expendables-actress, maxim-model, oprah-magazine, barkers-beauty, lauren-jones-footwear","alias_list":null,"created_at":"Fri Mar 12 00:55:46 UTC 2010","updated_at":"Fri Mar 12 01:31:11 UTC 2010","overview":"<p>Lauren Jones (born August 27, 1982) is an American film and television actress, model, Barker&#8217;s Beauty on the Price is Right, television and radio host, TV personality, occasional real estate entrepreneur and co-founder of the internationally recognized shoe company, Lauren Jones Footwear. As a footwear designer, Jones launched her line of women&#8217;s shoes in New York City in the Fall of 2009. Her line is known for its focus on femininity, fashion forward trends, and cost efficient price points.</p>\n\n<p>Jones was raised in Jackson, Mississippi, the only child of Debi Martinson Pearsall and Jim Jones, the granddaughter of Gloria Martinson, founder of the non-profit organization, Gleaners, and the great-niece of State Representative Rita Martinson (Madison, Mississippi). She attended junior high school at St. Andrew&#8217;s in Ridgeland, Mississippi, where she played Juliet in a school production of William Shakespeare&#8217;s play Romeo and Juliet. At age 14, Jones, accompanied by her mother and stepfather, moved from Jackson to Long Island. At 17, Jones was encouraged to pursue an acting career, subsequently living in London, England, Boston, Massachusetts, New York City, New York and Los Angeles, California. She was a high school homecoming queen and a varsity cheerleader.</p>\n\n<p>She came to prominence initially after winning a national modeling contest sponsored by Seventeen magazine in 2000, and appearing on Live with Regis and Kathie Lee.</p>\n\n<p>In 2003, Jones earned a BBA degree in design and management from Parsons School of Design[citation needed] and studied abroad at The University of Westminster in London, England. While in NY attaining her undergraduate degree, she concurrently studied theater, TV and film at various performing art schools.</p>\n\n<p>Jones has worked as a model, actress, product endorser, shoe designer and has engaged in occasional business pursuits in the real estate market.\nJ\nones began modeling as a teen, initially as a commercial print model for national brands and often live at promotional events. When she was 19, she signed with the Gilla Roos modeling agency, in New York City. Jones has also worked with Wilhelmina Models in New Orleans and United Talent Agency in Los Angeles. She has appeared in numerous advertising campaigns, including Axe deodorant, Burger King, Coppertone sunscreen and Met-Rx, of which Jones is an endorser, holding the title of Miss Met-Rx 2007. In 2001, Jones began to develop a reputation as a worldly, well written and persuasive spokemodel and business woman, being identified as &#8220;Billionaire Barbie&#8221;[1] whose fame was beginning to extend beyond the pages of magazines and the credits of film and TV. Jones is now known among marketers and in the entertainment industry as &#8220;Billionaire Barbie&#8221; after taking once unknown brands to global recognition and billion dollar sales revenues[2]. She has appeared in several magazines, including the August 2009 issue of Maxim. In the same month, she also appeared in the high profile publication O: The Oprah Magazine[3].</p>\n\n<p>Jones has appeared in other magazines including Fortune, Seventeen, Sync, and Men&#8217;s Health among others, as well as on the covers of Sound &amp; Vision, LA Health News, Tyler Today, New Living, and The New York Sportscene.</p>\n\n<p>In May 2009, Jones was cast in the star studded feature film The Expendables opposite Sylvester Stallone and Mickey Rourke as the character, Cheyenne, Mickey&#8217;s love interest in the film. Jones was cast for the part of Cheyenne by Sylvester Stallone, who wrote, directed and starred in the film.</p>\n\n<p>Jones guest appeared on Rescue Me in July 2008 &amp; has previously appeared on the Nickelodeon TV series The Naked Brothers Band as Double X. Jones has also appeared on MTV2&#8217;s Wonder Showzen, the soap opera, Guiding Light, in the feature film Spider-Man 3, and as a Barker&#8217;s Beauty on the CBS&#8217; game show The Price is Right, where she appeared for five weeks in April and May 2007 before leaving to film the TV show Anchorwoman.</p>\n\n<p>On stage, Jones has played the parts of Marty Maraschino in the production of Grease and Ti Moon in Once on This Island. Jones has studied the performing arts at schools such as The Actors Studio, Weist Barron and Three of Us Studios in NYC.</p>\n\n<p>Lauren Jones is also known as the star of Fox&#8217;s Anchorwoman. The show debuted August 22, 2007 on FOX.[2] The show was cancelled after a few episodes reportedly due to absymal ratings.</p>\n\n<p>Jones starred in the scripted/reality hybrid series Anchorwoman,[4] premiering on the Fox Broadcasting network August 22, 2007. Jones was cast as the principal role of Anchorwoman. The role was primarily scripted and part improvisational, with a great deal of comedic undertones. Some journalists voiced outspoken criticism of the scripted 30-day broadcast-news stunt at a small Tyler, Texas television station. Jones went on to interview with Bill O&#8217;Reilly on The O&#8217;Reilly Factor. The show was canceled from the network after airing two back to back episodes. The debut scored 2.0 rating on fast nationals, and reported to have 2.7 million viewers overall.[5]</p>\n\n<p>Prior to filming Anchorwoman, Jones worked on the Baywatch workout video series, Baywatch Beach Body Workout, with Lauren Jones, which released in stores and on the Internet on December 4, 2007.</p>\n\n<p>In late 2004-early 2005, Jones worked with the WWE on its SmackDown! brand and participated in the first ever SmackDown! Rookie Diva of the Year contest at No Way Out 2005. Videos went viral over the internet raking in thousands of views. Jones asked for her release of her contract to pursue other activities.</p>\n\n<p>In October 2005, Jones was named the official spokesperson of &#8220;MET-Rx&#8221;, a line of health supplements aimed at the fitness industry. She partnered with MET-Rx and collaborated in both health and fitness initiatives. She has been featured in the brands magalog (reaching over three million customers every month), and in the MET-Rx online community.</p>\n\n<p>As of October 2008, Jones ended her endorsement with MET-Rx.</p>\n\n<p>Jones is currently the Co-Founder and CFO of the nationally recognized, and rapidly expanding, brand and shoe line Lauren Jones. The first shoe collection hit runways October 2009 at the WeddingChannel Couture Show in New York City. Lauren Jones Footwear arrived in New York City showrooms December 3 and 4, 2009, in the Titan Showroom. Lauren Jones Footwear subsequently became a division of Titan Industries Inc., which also carries other well known brands such as Bebe, Badgley Mischka and Betsey Johnson.</p>\n\n<p>The first Lauren Jones shoe lines featured fashion forward bridal looks with subsuquent lines offering special occasion and evening footwear. Lauren Jones shoes now encompass bridal, special occasion, red carpet event, day wear and trends such as over the knee boots. Lauren Jones Shoes are available through major retailers such as Belk, Nordstrom.com, Zappos.com, Alfred Angelo and Endless.com beginning February 15, 2010.</p>\n\n<p>Jones currently makes Martinez Valero shoes available for purchase at her online store, LaurenJonesCollection.comLauren Jones Collection.</p>\n\n<p>In addition to Lauren Jones Shoes, Jones is also developing an accessories and swimwear line.</p>\n\n<p>Jones holds the following titles: Miss Mississippi USA 2009 (First Runner Up), Miss MET-Rx 2006/2007 (Winner), Miss New York UN 2007 (Winner), Miss New York USA 2007 (Finalist), Miss New York USA 2006 (Finalist), Homecoming Queen 2000 (Earl L. Vandermeulen HS)</p>","image":{"available_sizes":[[[94,150],"assets/images/resized/0008/0023/80023v2-max-150x150.jpg"],[[138,220],"assets/images/resized/0008/0023/80023v2-max-250x250.jpg"],[[138,220],"assets/images/resized/0008/0023/80023v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BBA","subject":"Design and Management","institution":"Parsons School of Design","graduated_year":2005,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CFO","firm":{"name":"Lauren Jones Footwear","permalink":"lauren-jones-footwear","type_of_entity":"company","image":{"available_sizes":[[[100,150],"assets/images/resized/0008/1393/81393v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0008/1393/81393v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0008/1393/81393v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://en.wikipedia.org/wiki/Lauren_Jones","title":"Wikipedia"},{"external_url":"http://www.foxnews.com/story/0,2933,288638,00.html","title":"FOXNews"},{"external_url":"http://www.wwd.com/footwear-news/designer-digest-bridal-shoes-2430063//?full=true","title":"WWD.com"}],"web_presences":[{"external_url":"http://www.twitter.com/LaurenJonesShoe","title":"The Official Twitter Page of Lauren Jones"},{"external_url":"http://www.LaurenJones.net","title":"The Official Website of Lauren Jones"},{"external_url":"http://www.facebook.com/pages/LaurenJonesFootwear","title":"The Official Facebook Fan Page of Lauren Jones Footwear"},{"external_url":"http://www.LaurenJonesFootwear.blogspot.com","title":"The Official Lauren Jones Footwear Blog"},{"external_url":"http://www.youtube.com/LaurenJonesTVMania","title":"The Official Youtube for Lauren Jones"},{"external_url":"http://www.LaurenJonesCollection.com","title":"The Official Website of the Lauren Jones Footwear Collection and Lifestyle Brand"}]}