{"first_name":"Laurie","last_name":"Lumenti Garty","permalink":"laurie-lumenti-garty","crunchbase_url":"http://www.crunchbase.com/person/laurie-lumenti-garty","homepage_url":"http://www.wellsfargo.com","birthplace":"USA","twitter_username":"llgarty","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Mar 04 21:32:50 UTC 2011","updated_at":"Sat Oct 13 04:13:08 UTC 2012","overview":"<p>Laurie Lumenti Garty is an Intrepreneur in Wells Fargo&#8217;s Technology &amp; Venture Services Group, where she is building a platform that will help entrepreneurs and investors who work with high growth startups.  </p>\n\n<p>Previously, Garty was a Managing Director in the Entrepreneur Services Group at SVB where she managed the company&#8217;s relationships with angel investors, incubators, local universities and a number of seed stage investors in the Bay Area.  She also covered the enterprise software sector.</p>\n\n<p>Prior to joining SVB Capital, Garty was the manager of Silicon Valley Bank&#8217;s Emerging Technologies Practice, where she led a team focused on early stage companies that were bootstrapped or backed by angel investors. Before joining Silicon Valley Bank, Garty was a lender and a Director in the Venture Capital Group at Comerica Bank. Previously, she worked in two Bay Area Startups - she was the Director of Strategic Alliances for Ditto.com and a Business Relationship Manager for iOwn.  She also worked for the FDIC, Bank of America and Capital Crossing Bank. </p>\n\n<p>With her diverse background, Garty has a unique combination of financial and operational experience that she is able to apply in her work with entrepreneurs.  She has developed an extensive network of angel investors, venture capitalists, entrepreneurs and CXOs, and is involved in many civic and industry organizations, including serving on the boards of directors and advisory boards of many.</p>\n\n<p>Garty currently sits on the Board of Directors of Watermark, where she Chairs the Marketing Committee and also sits on the Finance Committee.  She was previously on the Board of Directors for The Enterprise Network (TEN) and the advisory board for Astia. She was also a member of the National Center for Women in Information Technology and was very active working with the Angel Capital Association and Angel Resource Institute in helping them develop and launch their Halo Report. She is the author of a series of articles that address the concerns of entrepreneurs, including &#8220;Sowing the Seeds of a Successful Start-up&#8221; and &#8220;Portrait of a Modern-day Bootstrapper&#8221;.   Garty holds a bachelor&#8217;s degree in economics from Framingham State University and a certificate of special studies in management and administration from Harvard University Extension School. </p>\n\n<p>In her spare time when she is not helping startup entrepreneurs, women leaders or rescuing animals, Garty enjoys spending time with her husband, her 3 furry children (two dogs and a cat that resembles Stewie on Family Guy), running, painting, traveling and trying to become as good a cook as her Italian Grandmothers.  </p>\n\n<p>Twitter: @llgarty \nLinkedIn: http://www.linkedin.com/in/laurielumentigarty </p>","image":{"available_sizes":[[[150,130],"assets/images/resized/0012/5067/125067v2-max-150x150.jpg"],[[250,217],"assets/images/resized/0012/5067/125067v2-max-250x250.jpg"],[[387,336],"assets/images/resized/0012/5067/125067v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}