{"first_name":"Laura","last_name":"Grant","permalink":"laura-grant","crunchbase_url":"http://www.crunchbase.com/person/laura-grant","homepage_url":"http://www.tagdigital.co.uk","birthplace":"UK","twitter_username":"misslauragrant","blog_url":"http://www.tagdigital.co.uk/blog/","blog_feed_url":"http://www.tagdigital.co.uk/feed/","affiliation_name":"Unaffiliated","born_year":1986,"born_month":7,"born_day":1,"tag_list":"specialties-digital-advertising-strategies, client-communications, project-management, user-interface-accessibility, client-retention, online-advertising-campaigns, online-marketing, search-engine-marketing","alias_list":null,"created_at":"Fri Aug 03 11:29:16 UTC 2012","updated_at":"Sat Aug 04 14:50:00 UTC 2012","overview":"<p>Currently operating as Account Director with Tag Digital, Laura oversees the brand development and client relationship management of this online marketing agency. </p>\n\n<p>Laura has a strong track record both sides of the Atlantic in communications within the traditional and digital media space. </p>\n\n<p>Previous to this, Laura worked as Communications Director at Moviecom.tv, Global Red Herring 100 winner 2011, Los Angeles. Laura drove the marketing and awareness strategy of this high growth technology start-up. </p>\n\n<p>With a joint honours degree in Law &amp; English, Laura began her career in magazine publishing in New York, before embarking on production roles with STV and Setanta Sports back in the UK.</p>\n\n<p>Tag Digital helps companies engage with their existing and potential customers, build their brand online and drive sales.</p>\n\n<p>Tag Digital is built on fresh thinking, smart ideas, cost effective solutions and hard work. My role covers strategic brand development, client relationship management and all aspects of online marketing.</p>\n\n<p>Services include social and search engine marketing, web design, email marketing, online video and mobile app production. As well as bespoke training across all forms of online marketing.</p>","image":{"available_sizes":[[[93,150],"assets/images/resized/0020/4209/204209v2-max-150x150.png"],[[155,250],"assets/images/resized/0020/4209/204209v2-max-250x250.png"],[[182,292],"assets/images/resized/0020/4209/204209v2-max-450x450.png"]],"attribution":"<p>Laura Grant</p>"},"degrees":[{"degree_type":"BA Hons 2:1","subject":"Law & English","institution":"University of Strathclyde","graduated_year":2007,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://uk.linkedin.com/in/lauragrant1","title":"Linkedin "},{"external_url":"http://twitter.com/misslauragrant","title":"Twitter"}]}