{"first_name":"Laura","last_name":"B. Sachar","permalink":"laura-b-sachar","crunchbase_url":"http://www.crunchbase.com/person/laura-b-sachar","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"StarVest Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Dec 03 12:54:42 UTC 2008","updated_at":"Sun Mar 18 03:23:23 UTC 2012","overview":"<p>Ms. Sachar is a founder and general partner of StarVest Partners, a New York City based venture capital firm that invests in software, ecommerce and business services. </p>\n\n<p>Since founding StarVest in 1998, she has been active in multiple successful investments including Connected Corporation (acquired by Iron Mountain in 2004); MessageOne (acquired by Dell Computer in 2008); Newgistics (the leader in returns management); iCrossing (acquired by Hearst in 2010); Fieldglass (acquired by Madison Dearborn in 2010); ideeli (a  private event sales platform that was recently named number on the INC 500 list);   Veracode (a software as a service security management company);  NewComLink (a payment network platform); and Precision Demand (a platform that improves the performance of TV advertising). </p>\n\n<p>Prior to founding StarVest, Ms. Sachar was responsible for direct private equity investments at Gabelli Securities where she sourced digital media investments in Multex Systems, which was acquired by Thomson Reuters, and the first institutional round of Digital River (NASDAQ: DRIV).  In the early 1990&#8217;s, she founded Sachar Capital which sourced Redgate Software, a company that was founded by Ted Leonsis and eventually merged into AOL.  </p>\n\n<p>Ms. Sachar is also the Founding Chairman of the New York New Media Association Angel Investors Program, a professional nonprofit organization in which she assisted hundreds of early-stage New York area companies in accessing initial capital in addition to being a member of the Young Presidents Organization.</p>\n\n<p>She is a graduate of Barnard College, Columbia University and holds an MBA from the Columbia University Graduate School of Business. </p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0017/8629/178629v2-max-150x150.jpg"],[[170,170],"assets/images/resized/0017/8629/178629v2-max-250x250.jpg"],[[170,170],"assets/images/resized/0017/8629/178629v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"StarVest Partners","permalink":"starvest-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,94],"assets/images/resized/0003/0866/30866v1-max-150x150.jpg"],[[170,107],"assets/images/resized/0003/0866/30866v1-max-250x250.jpg"],[[170,107],"assets/images/resized/0003/0866/30866v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}