{"first_name":"Lauren","last_name":"Anderson","permalink":"lauren-anderson","crunchbase_url":"http://www.crunchbase.com/person/lauren-anderson","homepage_url":"http://cclab.collaborativeconsumption.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"CC Lab","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Mon Nov 14 23:21:56 UTC 2011","updated_at":"Mon Nov 14 23:30:42 UTC 2011","overview":"<p>Lauren Anderson is the Innovation Director for Collaborative Lab, working with organizations to deliver socially game-changing and profitable solutions in the Collaborative Consumption space, named by TIME as one of the &#8220;10 Ideas That Will Change The World.&#8221; She is a leading source of strategic knowledge for global entrepreneurs, journalists, and venture capitalists who want the latest market insights and best practices to stay ahead of the curve on new goods and services in the market.</p>\n\n<p>Lauren is a highly skilled public speaker and workshop facilitator, who has delivered keynotes in Europe, United States and Australia for organizations such as GigaOm, UNEP Future of Sustainable Lifestyles and Entrepreneurship, CPA Australia and the Brightest Young Minds Summit. Her presentations focus on how the latest collaborative technologies will influence the way we live, create, and consume.</p>\n\n<p>Lauren curates a bi-weekly ‘Collaborative Entrepreneurs’ column getting inside hot ventures from Airbnb to thredUP to TaskRabbit. Her work and thinking has appeared in Big Issue UK, Shareable.net, The Age Australia, ABC Radio Australia, Clarín, Westline, Canadian PROFIT Magazine, Mundo Estranho, Sustainable Industries Magazine, McGill Daily and In:genius. She played an instrumental role in building the Collaborative Consumption brand, growing global movement and researching the latest examples for International book editions of What’s Mine is Yours including the UK and Brazil.</p>\n\n<p>She holds a Bachelor of Creative Industries and Graduate Certificate in Philanthropy and Nonprofit Studies from Queensland University of Technology, and is currently completing a Master of Applied Innovation and Entrepreneurship from the University of Adelaide.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0016/2365/162365v1-max-150x150.jpg"],[[150,150],"assets/images/resized/0016/2365/162365v1-max-250x250.jpg"],[[150,150],"assets/images/resized/0016/2365/162365v1-max-450x450.jpg"]],"attribution":"<p>Collaborative Lab</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Innovation Director","firm":{"name":"Collaborative Lab","permalink":"collaborative-lab","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}