{"first_name":"Laura","last_name":"Lee","permalink":"laura-lee","crunchbase_url":"http://www.crunchbase.com/person/laura-lee","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Oct 22 17:44:16 UTC 2012","updated_at":"Sat Nov 03 22:37:46 UTC 2012","overview":"<p>Laura Lee is a Director and the Head of Entertainment East Partnerships for YouTube where she oversees all relationships with broadcasters, cable networks, film studios, aggregators, digital media, and original programming partners for the East Coast and Canada.  While at YouTube, she has cultivated numerous relationships with partners such as NBCUniversal, Discovery Networks, Lionsgate, Sony Pictures, CBS, and AETN among others, and led the launch of YouTube’s Rentals product (VOD).</p>\n\n<p>Prior to joining YouTube, Laura was Vice President and Head of Business Development and Operations for MTV Networks’ Music &amp; Logo Group.  During her four year tenure at MTVN, Laura helped lead the acquisition of Harmonix and launch several vertical broadband businesses.  She also served in various production and development roles at VH1 and Spike TV.  Before that, Laura worked at Time Warner in Special Projects in several capacities, including Interim Controller at Africana.com.  Laura began her career as a media investment banker for J.P. Morgan.</p>\n\n<p>Laura is a member of the International Academy of Arts and Sciences, serves as a mentor of Brown University&#8217;s Women&#8217;s Launch Pad, and has served as an advisor to the Harvard Digital Community and Social Networking Advisory Group.  </p>\n\n<p>A diehard Brooklynite, Laura is a graduate of Brown University and Harvard Business School and the proud mother of two rambunctious children.  </p>","image":{"available_sizes":[[[150,113],"assets/images/resized/0021/6653/216653v2-max-150x150.jpg"],[[250,189],"assets/images/resized/0021/6653/216653v2-max-250x250.jpg"],[[450,341],"assets/images/resized/0021/6653/216653v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"AB","subject":"Political Science","institution":"Brown University","graduated_year":1997,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"General Management","institution":"Harvard Business School","graduated_year":2003,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}