{"first_name":"Lawrence","last_name":"G. Miller","permalink":"lawrence-g-miller","crunchbase_url":"http://www.crunchbase.com/person/lawrence-g-miller","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue May 26 07:13:35 UTC 2009","updated_at":"Tue May 26 07:50:21 UTC 2009","overview":"<p>Dr. Miller is a Partner and Founder of Mediphase Venture Partners. He has invested in more than 25 private companies in life sciences/health care.</p>\n\n<p>Prior to founding Mediphase Venture Partners, Dr. Miller was Senior Vice President, Hambrecht &amp; Quist Capital Management in Boston from 1997-1999, where he was responsible for evaluating all private equity investments. Before joining H&amp;Q, he was Executive Vice President and Director, Internal Operations at Avicenna Systems Corp from 1996 to 1997. Avicenna was acquired by Synetic, Inc. (now WebMD) in 1996.</p>\n\n<p>From 1990 to 1996, Dr. Miller was Vice President at HPR, Inc. as the company underwent dramatic growth and a successful IPO in 1995. HPR was acquired by HBOC in 1997. Dr. Miller served as a Senior Scientist at the Health Data Institute, Inc. from 1985 to 1987. He has consulted extensively for major pharmaceutical companies, including Pfizer, Roche, Upjohn and Boehringer Ingelheim.</p>\n\n<p>Dr. Miller is trained as a physician and pharmacologist and was a faculty member in the Department of Pharmacology and Experimental Therapeutics at Tufts University School of Medicine in Boston. He has published more than 100 scientific papers, and received numerous awards in this field, including national awards from both major professional societies in clinical pharmacology. He is currently Adjunct Associate Professor of Pharmacology at Tufts and Instructor in Medicine at Harvard Medical School. Dr. Miller was educated at Harvard College, Cambridge University and Harvard Medical School, and completed his clinical training at the Massachusetts General Hospital in Boston. He is Board certified in Internal Medicine, Pulmonary Disease and Clinical Pharmacology.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founding Partner","firm":{"name":"Mediphase Venture Partners","permalink":"mediphase-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,77],"assets/images/resized/0003/2809/32809v1-max-150x150.png"],[[170,88],"assets/images/resized/0003/2809/32809v1-max-250x250.png"],[[170,88],"assets/images/resized/0003/2809/32809v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}