{"first_name":"Lawrence","last_name":"Cotter","permalink":"lawrence-cotter","crunchbase_url":"http://www.crunchbase.com/person/lawrence-cotter","homepage_url":"http://www.linkedin.com/in/lawrencecotter","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1970,"born_month":null,"born_day":null,"tag_list":"internet-startup, internet-turnaround, online-strategy, online-marketing, online-business-development","alias_list":null,"created_at":"Tue Jul 08 01:55:40 UTC 2008","updated_at":"Tue Jul 08 17:01:18 UTC 2008","overview":"<p>Mr. Cotter is the President for Capitol Media Group, the parent company of Apartment Home Living. Prior to his current role, Mr. Cotter was the Founder, CEO and President of Sandbox.com, an online Fantasy Sports provider. At Sandbox, Mr. Cotter sourced, negotiated and raised more than $25 million in venture capital from Paul Allen’s Vulcan Ventures, Time Warner, Next Generation Fund and others; steered overall company direction; led team of 110 employees including the direct management of sales, marketing and business development, which resulted in more than 8 million members and $20 million in online direct marketing revenue; and sourced, identified and negotiated asset sale to All Star Stats and NBC Universal. Prior to Sandbox, Mr. Cotter was the Director of Business Development and Franchising at Moovies, Inc. where he performed financial analysis and modeling, supporting the company’s overall strategy, resulting in a $3.0 million venture financing and a $36 million initial public offering; identified, negotiated and closed 18 acquisitions representing over 180 video store locations, 1.4 million members and $60 million in annual revenue; acquired and managed 53 franchise locations representing over 400,000 members and $10 million in annual revenue; and identified and facilitated negotiations with Video Update resulting in the sale of the company. Prior to Moovies, Mr. Cotter was a Senior Accountant at KPMG Peat Marwick. </p>\n\n<p>Mr. Cotter also pioneered the concept of an email alert system to recover lost and missing children for the National Center for Missing and Exploited Children.</p>\n\n<p>Mr. Cotter holds Bachelor of Business Administration, cum laude, in accounting from James Madison University, where he was also awarded Alton Wheelock Scholarship for Most Outstanding Accountant. Mr. Cotter received his Certified Public Accountant from the Commonwealth of Virginia in 1992.</p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0002/1592/21592v2-max-150x150.jpg"],[[80,80],"assets/images/resized/0002/1592/21592v2-max-250x250.jpg"],[[80,80],"assets/images/resized/0002/1592/21592v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BBA","subject":"Accounting","institution":"James Madison","graduated_year":1992,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/lawrencecotter","title":""}]}