{"first_name":"Layton","last_name":"Tamberlin","permalink":"layton-tamberlin-2","crunchbase_url":"http://www.crunchbase.com/person/layton-tamberlin-2","homepage_url":"http://www.laytontamberlin.org/","birthplace":"Shrewsbury","twitter_username":"laytontamberlin","blog_url":"","blog_feed_url":"","affiliation_name":"Merrill Lynch","born_year":1976,"born_month":null,"born_day":null,"tag_list":"layton-tamberlin, tamberlin-layton, co-founder, sullivan-street-partners, chairman, samedaydoctor, director, baby-concierge, private-equity, investments, london, united-kingdom","alias_list":null,"created_at":"Tue Oct 25 14:26:14 UTC 2011","updated_at":"Wed Oct 03 16:03:51 UTC 2012","overview":"<p>Layton Tamberlin began his finance career in 1998, when he joined Merrill Lynch UK as a professional in corporate finance and advisor in mergers and acquisitions. Throughout the four years of employment by Merrill Lynch UK, he was involved in acquisitions such as Newsquest (acquired by Gannett) and Rockware Group (acquired by Ardagh plc). He also acted as advisor on the IPOs of Generics Group plc, PHS Group plc and iTouch plc. In 1995 Merrill Lynch had acquired SmithNewCourt, strengthening its position as a top European investment bank.</p>\n\n<p>After leaving Merrill Lynch, Layton Tamberlin became part of the team at TDR Capital, as Manjit Dale and Stephen Robertson were establishing the firm. As a private equity firm with about â‚¬2.5 billion, most of its investments are located in Western Europe and come from all business sectors. Layton Tamberlin worked for TDR until 2009 and was a major part of many important deals. Some of the transactions that he was involved in were acquisitions of ASK, Pearl, Williams Scotsman, Pizza Express and Resolution. Of the investments made during those years, TDR Capital reports an IRR in excess of 70%.</p>\n\n<p>The next business venture Layton became involved in was Samedaydoctor, a privately owned health care clinic that accepts walk-in patients where he joined as its Chairman in 2009. Samedaydoctor was established in 2003 to offer easy access to General Practice medical care and specialized sexual health care services to the general population. From 2007, Samedaydoctor had increased its locations to cover eight different locations in England and Scotland and either owns or manages those clinics. Many of the services offered are now available online through a service launched in 2010.</p>\n\n<p>Current Business</p>\n\n<p>Layton Tamberlin is a partner, with Richard Sanders at Sullivan Street Partners. Richard Sanders, former Group Strategy Director at the John Lewis Partnership, has managed post-acquisition profit growth at over 50 companies, while at Bain, Burlington and as a private investor. Sullivan Street is a corporate finance boutique which advises entrepreneurs and high net worth individuals on acquiring or taking majority stakes in UK businesses with revenues of up to £50m. Using their combined expertise, they work with those companies to improve operations and generate growth.</p>\n\n<p>Personal Background</p>\n\n<p>Layton Tamberlin was born in Shrewsbury and attended Keble College at Oxford  University. He received a masters in Mathematics and Philosophy in 1998 and now lives in London with his wife and two young children.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0015/9508/159508v2-max-150x150.jpg"],[[175,175],"assets/images/resized/0015/9508/159508v2-max-250x250.jpg"],[[175,175],"assets/images/resized/0015/9508/159508v2-max-450x450.jpg"]],"attribution":"<p>Layton Tamberlin</p>"},"degrees":[{"degree_type":"Master","subject":"Mathematics and Philosophy","institution":"Keble College, Oxford","graduated_year":1998,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Co-Founder","firm":{"name":"Sullivan Street Partners","permalink":"sullivan-street-partners","type_of_entity":"company","image":{"available_sizes":[[[150,49],"assets/images/resized/0015/8823/158823v1-max-150x150.jpg"],[[250,82],"assets/images/resized/0015/8823/158823v1-max-250x250.jpg"],[[334,110],"assets/images/resized/0015/8823/158823v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Associate","firm":{"name":"Merrill Lynch","permalink":"merrill-lynch-2","type_of_entity":"financial_org","image":{"available_sizes":[[[150,48],"assets/images/resized/0006/1640/61640v1-max-150x150.jpg"],[[188,61],"assets/images/resized/0006/1640/61640v1-max-250x250.jpg"],[[188,61],"assets/images/resized/0006/1640/61640v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Director","firm":{"name":"TDR Capital","permalink":"tdr-capital","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.4networking.biz/Members/Details/43601","title":"Layton Tamberlin - 4networking Profile"},{"external_url":"http://www.sullivanstreet.co.uk","title":"Layton Tamberlin - Sullivan Street Partners"}],"web_presences":[{"external_url":"http://uk.linkedin.com/in/laytontamberlin","title":"Layton Tamberlin - Linkedin Profile"},{"external_url":"http://laytontamberlin.gather.com/","title":"Layton Tamberlin's Gather Profile"}]}