{"first_name":"Lea","last_name":"Bajc","permalink":"lea-bajc","crunchbase_url":"http://www.crunchbase.com/person/lea-bajc","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Tue Apr 06 10:11:47 UTC 2010","updated_at":"Sun Mar 18 02:04:18 UTC 2012","overview":"<p>Lea is an Investment Manager at Northzone Ventures, a leading European Venture Capital Partnership with a Nordic stronghold, focusing on early- and expansion-stage investments in the technology sector. Previously, Lea founded an advisory business specializing in the digital media and consumer internet space. Prior to business school, Lea spent five years at Morgan Stanley in Paris and London, where she completed rotations through the Mergers &amp; Acquisitions, Corporate Finance, Private Equity, and Leveraged Finance divisions. While at Morgan Stanley, Lea identified, evaluated, structured and negotiated a wide variety of transactions. While there, she was awarded a unique opportunity to focus on development of Morgan Stanley’s corporate strategy as a part of the Firm Management team. She led strategic projects, including the Balance Scorecard, First Connect, and Firm Relationship Management initiatives, which established consistent communication with clients and coordinated selling across divisions. Earlier, Lea worked at L’Oreal and McKinsey &amp; Co. in Sweden and at Ericsson in Austria. At L’Oreal she developed brand marketing strategies and marketing plans. At McKinsey, she completed a securitization strategy project within the Financial Institutions Group. At Ericsson she developed a client interface and marketing program for the business-to-business division. Lea holds an MSc in economics and business administration from Stockholm School of Economics and Hautes Etudes Commerciales, and an MBA degree from the Harvard Business School. Lea is a native speaker of Croatian and Swedish, fluent in English and French and proficient in German. She is also a certified nutritionist and a fitness instructor.</p>","image":{"available_sizes":[[[150,84],"assets/images/resized/0008/2960/82960v3-max-150x150.png"],[[250,141],"assets/images/resized/0008/2960/82960v3-max-250x250.png"],[[450,254],"assets/images/resized/0008/2960/82960v3-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Investment Manager","firm":{"name":"Northzone","permalink":"northzone-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,25],"assets/images/resized/0001/6117/16117v3-max-150x150.png"],[[250,41],"assets/images/resized/0001/6117/16117v3-max-250x250.png"],[[450,75],"assets/images/resized/0001/6117/16117v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}