{"first_name":"Leah","last_name":"Gabriel Nurik","permalink":"leah-gabriel-nurik","crunchbase_url":"http://www.crunchbase.com/person/leah-gabriel-nurik","homepage_url":"http://www.gabrielmarketing.com","birthplace":"","twitter_username":"LeahNurik","blog_url":"http://www.gabrielmarketing.com/blog","blog_feed_url":"http://www.gabrielmarketing.com/category/blog/feed","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"technology-marketing-company, technology, public-relations, business, marketing, startups, entrepreneur","alias_list":null,"created_at":"Tue Sep 20 21:10:25 UTC 2011","updated_at":"Sun Nov 13 23:02:36 UTC 2011","overview":"<p>Leah Gabriel Nurik is the Founder and President of Gabriel Marketing Group. She has been a marketing and business development consultant in the high-technology business for over ten years. Leah&#8217;s experience involves helping both early-and mid-stage companies either ramp-up or advance their current marketing and distribution efforts. Her background began in public relations and grew to include branding, corporate and marketing communications as well as lead generation, channel development, mergers and acquisition strategy and market identification.</p>\n\n<p>Leah has worked with software and hardware companies of all sizes, from incubators with less than 3 employees to Fortune 10 companies. Her resume includes executive-level strategic roles at large companies like Motorola and Symbol Technologies as well as leading marketing efforts for technology start-ups and incubators in the business-to-business software and wireless markets. She has worked for companies at all funding stages, including bootstrapped, Venture capital-funded, and public companies listed on a variety of stock exchanges, including the NYSE, Nasdaq and the Toronto Stock Exchange.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/leahnurik","title":"Twitter: @LeahNurik"},{"external_url":"http://www.facebook.com/lnurik","title":"Facebook: Leah Gabriel Nurik"}]}