{"first_name":"LED","last_name":"Bulbs","permalink":"led-bulbs","crunchbase_url":"http://www.crunchbase.com/person/led-bulbs","homepage_url":"http://www.ledbulbs.co.uk/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"12v-led, 12v-led-bulbs, deltech, deltech-led, dimmable-gu10-led, dimmable-led, dimmable-led-bulbs, dimmable-led-gu10, dimmable-led-light-bulbs, g4-led, g4-led-bulb, g9-led, gu10-led, gu10-led-50w, gu10-led-50w-equivalent, gu10-led-bulb, gu10-led-bulbs, gu","alias_list":null,"created_at":"Thu May 10 06:17:39 UTC 2012","updated_at":"Fri May 11 03:25:47 UTC 2012","overview":"<p>LED Light Bulbs</p>\n\n<p>Buy led light bulbs at LEDBulbs.co.uk where you can shop online for a wide range of light bulbs products.  They offer the lowest prices  for top quality branded products, and they buy large numbers of LED’s to get best prices which they pass on to their customers. </p>\n\n<p>Company overview </p>\n\n<p>LEDBulbs.co.uk* is one of the leading LED retailers in the UK and you can rest assured that they specialize in high quality LED products of all types, which last and are manufactured by leading companies.</p>\n\n<p>They offer the lowest prices we possibly can for top quality branded products, and they buy large numbers of LED’s to get best prices which they pass on to their customers. They offer a wide range of LED products for use in homes, offices, warehouses, factories, etc.  Their ranges of products are always growing and hold large stocks of most items, with a great choice and excellent prices.</p>\n\n<p>They have also recently redesigned our website to make ordering and re-ordering as simple as possible. To help you choose the right product to suit your requirements, their website makes it easy to find prices, specifications and energy ratings. They have written guides on buying LED bulbs so you are able to buy exactly what you need.  Their guides should ensure you have a trouble free changeover to LED lighting, and if you still have any questions their knowledgeable team is here to help.</p>\n\n<p>They try to focus on helping you to enjoy your shopping experience, and providing premium quality products which meet customer requirements. They always strive to improve their processes and procedures by sourcing the best possible prices and putting their customers and their needs first.</p>","image":{"available_sizes":[[[150,34],"assets/images/resized/0018/8830/188830v2-max-150x150.jpg"],[[250,57],"assets/images/resized/0018/8830/188830v2-max-250x250.jpg"],[[257,59],"assets/images/resized/0018/8830/188830v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.ledbulbs.co.uk","title":"GU10 LED 50W"},{"external_url":"http://www.ledbulbs.co.uk/Deltech-LED-Bulbs","title":"Deltech LED"},{"external_url":"http://www.ledbulbs.co.uk/Philips-LED-Bulbs","title":"Philips LED"},{"external_url":"http://www.ledbulbs.co.uk/products/G4+%26+G9+LED+Capsules","title":"LED G4"},{"external_url":"http://www.ledbulbs.co.uk/products/Golf+Ball+LED+Bulbs","title":"LED Lights"}],"web_presences":[]}