{"first_name":"Lee","last_name":"Johnston","permalink":"lee-johnston","crunchbase_url":"http://www.crunchbase.com/person/lee-johnston","homepage_url":"http://www.lee-johnston.com","birthplace":"Merced","twitter_username":"leestack","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1969,"born_month":11,"born_day":7,"tag_list":"mobile-product-development-concept-to-production, mobile-application-and-architecture-designdevelopment, enterprise-architecture, it-governance, service-oriented-architecture, human-collaborative-workflow, rapid-application-development, linux, apache, mac","alias_list":null,"created_at":"Wed Jul 04 00:30:41 UTC 2012","updated_at":"Wed Jul 04 08:33:54 UTC 2012","overview":"<p>Success in business today requires an exceptional technical leader who truly understands the business and its objectives better than anyone else in the company. Next, that leader must be able to translate business objectives into a technical roadmap that increases revenue, competitive advantage and market share. Finally, the last part of the puzzle is execution and the ability to communicate and inspire cross-functional teams to innovate and accomplish the seemingly impossible. This is literally the missing link&#8211;a leader at a senior level that really understands the business, is able to translate that into a compelling vision and then communicate and inspire cross-functional teams to advance, innovate and move the company to the next level.</p>\n\n<p>Why is technical leadership so critical to business success? It’s all about results and wasted effort. Without all three of the above attributes, Business Savvy, Vision and Execution, the enterprise can’t leap forward. The modern technical leader must have a passion for business, exceptional technical vision and leadership. It’s rare to find a leader with all three, but when you do the results are simply magical.</p>\n\n<p>Please check: http://bit.ly/Ksb4gW</p>","image":{"available_sizes":[[[117,150],"assets/images/resized/0019/8701/198701v2-max-150x150.jpg"],[[195,250],"assets/images/resized/0019/8701/198701v2-max-250x250.jpg"],[[351,450],"assets/images/resized/0019/8701/198701v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}