{"first_name":"Lee","last_name":"Gopadze","permalink":"lee-gopadze","crunchbase_url":"http://www.crunchbase.com/person/lee-gopadze","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jan 26 07:36:19 UTC 2011","updated_at":"Wed Jan 26 07:38:01 UTC 2011","overview":"<p>Lee Gopadze is a twenty-five year wireless communications industry executive having held senior management roles at both large and small wireless communications companies. Mr. Gopadze most recently was Senior Vice President and General Manager for the Wholesale Business Division of Covad Communications. Mr. Gopadze oversaw all sales, marketing, product management, and operations for that division. Mr. Gopadze also held similar positions with Covad’s Branded Business and Wireless Divisions during his 6-year tenure there. Mr. Gopadze began his career in wireless communications in 1981. He has held a variety of senior executive positions in Marketing, Sales and Operations at the wireless subsidiaries of Metromedia Telecommunications, Southwestern Bell, and AirTouch Communications. From 1997 thru early 2000, Lee held the positions of Corporate Vice President - Marketing &amp; Sales, Senior Vice President - Network Operations, and Senior Vice President - Corporate Planning &amp; Development at Metricom Inc. In 2000, Mr. Gopadze left Metricom to co-found SkyRiver Communications Inc., a license-exempt broadband wireless carrier and served as its President and Chief Executive Officer. Mr. Gopadze holds a B.A. from the University of California at Los Angeles and an M.A. from the University of Southern California. </p>","image":null,"degrees":[{"degree_type":"M.A.","subject":"","institution":"University of Southern California","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President and CEO","firm":{"name":"Proxim Wireless","permalink":"proxim-wireless","type_of_entity":"company","image":{"available_sizes":[[[150,33],"assets/images/resized/0005/6477/56477v2-max-150x150.jpg"],[[250,55],"assets/images/resized/0005/6477/56477v2-max-250x250.jpg"],[[450,100],"assets/images/resized/0005/6477/56477v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}