{"first_name":"Lee","last_name":"On","permalink":"lee-on","crunchbase_url":"http://www.crunchbase.com/person/lee-on","homepage_url":"http://www.actualprint.com","birthplace":"","twitter_username":"actualprint","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Aug 19 06:41:10 UTC 2010","updated_at":"Thu Aug 19 19:21:57 UTC 2010","overview":"<p>ActualPrint.com does full color printing on custom boxes. ActualPrint.com manufactures quality Custom Suitcase Boxes and custom Packaging Boxes with full color printing in very low prices and all the packaging supplies required for your custom boxes. ActualPrint.com is the Custom manufacturer of all the Custom Suitcase Boxes and Custom packaging boxes in any custom shape design and size according to your specifications thoughts and ideas at much discounted rates</p>\n\n<p>ActualPrint make custom boxes on both card and corrugated stock. Customized Packaging Boxes are widely used for packing general products such as electronic, stationery, food, cosmetics, hardware, toys, medicine, and other products at much discounted rates. Corrugated Folding Cartons are an excellent solution for storing and transporting a variety of small and big products it can handle all your customized need boxes at ease. </p>\n\n<p>Actual Print offers custom boxes in all sizes. We are able to design, print and manufacture Custom Suitcase Boxes with full color printing, with customers&#8217; own designs and specifications with complete satisfaction. We design and produce innovative Full color Printed Suitcase Boxes and Custom Packaging Boxes at wholesale rates. \nOur huge investment in capital equipment and manufacturing excellence ensures that we exceed our customer&#8217;s needs. We offer extensive range of printed Corrugated Medicine Cartons and Custom packaging Boxes on all the materials according to your own choice at much discounted rates. We are the proudly manufacturer of Corrugated Medicine Cartons, Cardboard Cartons and custom packaging Boxes according to your specifications at wholesale rates</p>\n\n<p>We have the widest range of print capabilities of any carton manufacturer in the region. Our technical expertise is unequalled and we focus on smooth integration into customer supply chains.\nWe offer high quality printing options. We offer custom made printed Beverage boxes exactly to the size, style and patterns you need. We also offer embossing, custom die cut telescoping boxes, sand effect, foil stamping, spot lamination, custom window beverage boxes, barcodes and aqueous effect for your customized beverage boxes at wholesale rates.</p>\n\n<p>We can print your Folding cartons with your requested Printing Options. ActualPrint.com does full color printing on custom boxes. ActualPrint make custom boxes on both card and corrugated stock. Custom Packaging Boxes are available in all the shapes, sizes, designs, color schemes and patterns on all the material according to your product requirement with all the custom options, and all the packaging solutions for your unique packaging boxes at wholesale rates. We offer best printing solutions to all the customers and offer highly professional and quality printing on all the customized packaging boxes and cartons.</p>\n\n<p>Actual Print offers custom boxes in all sizes. We are a CUSTOM PRINTING AND PACKAGING COMPANY we have all the Machinery in our Printing Department. Paperboard Folding Cartons and Custom packaging Boxes come in all shapes, designs and styles, from small and cute to big display boxes printed with your own artwork. These Paperboard Folding Cartons are designed to hold any shaped and all the boxes and products which you want to hold and present. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}