{"first_name":"Lee","last_name":"Greif","permalink":"lee-greif","crunchbase_url":"http://www.crunchbase.com/person/lee-greif","homepage_url":"http://www.linkedin.com/in/leegreif1","birthplace":"New York city","twitter_username":"leegreif0","blog_url":"http://www.leegreif.com","blog_feed_url":"","affiliation_name":"Menorah Medical Center","born_year":1945,"born_month":11,"born_day":20,"tag_list":"lee-greif, lee-h-greif, lee-harold-greif","alias_list":null,"created_at":"Sat Sep 11 18:31:39 UTC 2010","updated_at":"Thu Sep 30 20:01:43 UTC 2010","overview":"<p>Lee H. Greif, was born on November 20, 1945 in New York City to Adele and Murray Greif. He attended elementary public school in New York City and high school in Westport Connecticut. He graduated from the University of Connecticut in 1967 and its Law School in January 1971. He temporarily left law school in 1968 to serve six months in the Army reserves during the Vietnam War.</p>\n\n<p>While at the University of Connecticut he was elected President of his class for three years and President of the Student body. At the end of his freshman year he was the selected by the President of the University, Dr. Homer Babbidge, for a summer scholarship as a special assistant to United States Congressman Emilio Daddario (D-CT). After his first summer working for the Congressman, Daddario invited him to join his permanent staff. During college, he worked in the Congressman’s district office and summers’ in his Washington office. After law school he worked in the Congressman’s Washington office. During that service in Washington he took a central role in two successful congressional campaigns for Daddario. </p>\n\n<p>In 1972 he became Chief of Staff to US Congressman Peter Peyser (R-NY). He served in that job for four years during which time he worked on a number of special projects for then U.S. Vice President Nelson Rockefeller.</p>\n\n<p>His work in Washington as a congressional staff member, afforded him the opportunity to meet many interesting people, and be present during the end of the Vietnam War and through the Watergate period. He worked for a Democratic Congressman during the Vietnam War and a Republican Congressman during Watergate. </p>\n\n<p>Mr. Greif left Washington in 1976 to be President of a family retail business in Kansas City. While in Kansas City in addition to a very active involvement in civic activities (see addendum) he got involved in Real Estate investment and Development. Mr. Greif subsequently developed 500 apartment units, 1 million square feet of industrial property, and bought operated, renovated and profitably sold three commercial hotels. </p>\n\n<p>In 1998 Mr. Greif organized a collection company, Cannon Financial Company to purchase credit card and other previously charged off debt by financial institutions. That company merged with a public company, Advanced Financial Company to become it’s main operating division. After consulting with the company for two years, Mr. Greif then organized a commercial leasing company, Heritage Financial, that provided about $30 million annually in financing for asset based commercial equipment clients. </p>\n\n<p>In 2002, Greif joined with other investors to help put together a public company structure that after a trip to China was subsequently sold to a group of Chinese investors who were in the coal mining business in China. That company continues to report successful operations in coal and energy activities in China.</p>\n\n<p>Mr. Greif is married to Amy and is the father of three children. He lives in Prairie Village Kansas.</p>\n\n<p>Resume</p>\n\n<pre><code>        a) Government Chief of Staff to two Members of the United States Congress and   Assistant to Vice President of the United States Nelson Rockefeller\n</code></pre>\n\n<p>b) Credit Card Recovery - Directed the purchased of over $20 million in charged off credit card debt from financial institutions at a significant discount and employed numerous collectors to collect the debt at a significant profit. </p>\n\n<p>c) Real Estate – Projects included the development and tax exempt financing of a about 500 apartment units.  A very successful 70-acre Industrial land assemblage and development. The development and sale of a one million square foot industrial park, and the purchase, sale and in some cases, the operation of various types of income producing properties, including 3 Nationally franchised hotels. </p>\n\n<pre><code>d) Banking- Played an important role in the development of an Interstate banking    organization that employed 450 people with over $1 billion in assets at 14 locations.   Participated in the underwriting of commercial loans and leases, and advised on the     banks investments and growth strategies\n\ne) Equipment Leasing - Created a nationwide network of brokers and                          \nVendors who provided extensive deal flow that resulted in the funding, and sale of over     $50 Million annually in very profitable equipment leases\n\nf) Medical - Chairman of the Board of a 430 bed Hospital not for profit Hospital. 20 year   Board member. Greif saved the Hospital by selling it to a for profit institution\n\ng) Modular commercial building business- Sold, leased and installed modular commercial  building to start-up banks and other commercial businesses as well as for temporary school  classrooms\n</code></pre>\n\n<p>EDUCATION</p>\n\n<p>J.D., University of Connecticut School of Law \nB.A., Economics and Political Science, University of Connecticut\nMember Connecticut Bar</p>\n\n<p>Community Leadership</p>\n\n<p>Chairman of the Board of Menorah Medical Center (430-bed hospital) \n20 year Member of the Board of Menorah Medical Center \nMember, Executive Committee $1 Billion Health Care Organization 1993-1995\n Young Presidents&#8217; Organization \nDirector, American Cancer Society of Johnson County\nDirector and Member of Executive Committee, KCPT Public Television\nDirector, Theater League of Greater Kansas City\nChaired, Kansas City Fund Raising Committee - U.S. Holocaust Memorial\nSigma Alpha Epsilon Fraternity </p>\n\n<pre><code>.\n</code></pre>","image":{"available_sizes":[[[51,63],"assets/images/resized/0010/3494/103494v2-max-150x150.jpg"],[[51,63],"assets/images/resized/0010/3494/103494v2-max-250x250.jpg"],[[51,63],"assets/images/resized/0010/3494/103494v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.A","subject":"","institution":"University of Connecticut","graduated_year":1967,"graduated_month":null,"graduated_day":null},{"degree_type":"J.D","subject":"Law","institution":"University of Connecticut School of Law","graduated_year":1971,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Chairman of the Board","firm":{"name":"Menorah Medical Center","permalink":"menorah-medical-center","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.zachsballs.com/business/lee-greif-made-it-work-for-me/","title":"Blog post about Lee Greif"},{"external_url":"http://www.compmodcentral.net/business/lee-greif-the-pollitician/","title":"Post about Lee Greif"},{"external_url":"http://www.somewhatamiable.com/business/lee-greif-a-long-journey/","title":"Post about Lee Greif"},{"external_url":"http://www.articlenotices.com/business/lee-greif-ceo-of-family-business-for-four-years.html","title":"Article about Lee Greif"},{"external_url":"http://digg.com/news/world_news/Lee_Greif_Blog_6","title":"Digg of LeeGreif Blog"},{"external_url":"http://www.articleannouncements.com/articles/2008/general/lee-greif-politics-and-peter-peyers.html","title":"Article about Lee Greif"},{"external_url":"http://www.fchnh.com/business/lee-greif-gives-back-to-the-jewish-community/","title":"News about Lee Greif"},{"external_url":"http://www.botstreetjournal.com/2008/10/lee-greif-graduated-with-honors-from-university/","title":"Article about Lee Greif"},{"external_url":"http://www.101infoworld.com/information/7175/lee-greif-board-of-directors-at-menorah-medical/","title":"Article about Lee Greif"},{"external_url":"http://www.kcjc.com/197001018089/news/","title":"Editorial note"}],"web_presences":[{"external_url":"http://www.linkedin.com/in/leegreif1","title":"Lee Greif LinkedIn"},{"external_url":"http://www.naymz.com/leegreif","title":"Lee Greif Naymz"},{"external_url":"http://www.myllife.com/leegreif","title":"Lee Greif MyLife"},{"external_url":"http://www.plaxo.com/profile/show/231929457214?ppk=556271fbebb9a972fd99993a9316088dc8084218","title":"LeeGreif Plaxo"},{"external_url":"http://www.xing.com/profile/Lee_Greif2","title":"Lee Greif Xing"},{"external_url":"http://www.spoke.com/profiles/leegreif","title":"Lee Greif Spoke"},{"external_url":"http://www.twitter.com/leegreif0","title":"Follow Lee Greif on Twitter"},{"external_url":"http://www.leegreif.com","title":"Lee Greif Blog"},{"external_url":"http://www.squidoo.com/lee-greif","title":"Lee Greif Lens"},{"external_url":"http://www.facebook.com/lee.greif","title":"Lee Greif Facebook"},{"external_url":"http://person.yasni.com/lee+greif+1112885","title":"Lee Greif Yasni Expose"}]}