{"first_name":"Leighton","last_name":"Read","permalink":"leighton-read","crunchbase_url":"http://www.crunchbase.com/person/leighton-read","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Alloy Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Aug 04 13:32:32 UTC 2007","updated_at":"Thu Mar 26 20:38:26 UTC 2009","overview":"<p>Leighton Read is a General Partner in four Alloy funds investing with us in companies from 2001-2007. Before joining Alloy, Leighton spent 14 years as a biotechnology entrepreneur and investor. He co-founded Affymax NV, under the direction of Dr. Alejandro Zaffaroni, setting the stage for two successful spin-outs: Affymetrix and Maxygen. He founded Aviron, a biotechnology company best known as the developer of FluMist™, the intranasal influenza vaccine, where he served as Chairman and CEO until 1999 and Director until its acquisition by MedImmune in 2002. While at Alloy, he served as the first CEO of Avidia, a spin-out of Maxygen later acquired by Amgen. For over two decades, he has also been interested in the psychological principles that underlie successful electronic games and is currently devoting substantial time to his role as Chairman of Seriosity, a start-up leading in the application of game principles to the challenges of large enterprises. He received a B.S. from Rice University in Psychology and Biology (1973), an MD from the University of Texas Health Science Center at San Antonio (1976) and completed internal medicine training at Duke and the Peter Bent Brigham Hospital in Boston where he held appointments at the Harvard Medical School and School of Public Health. His research dealt with applications of decision theory in medicine, cost-effectiveness analysis and policy regarding medical innovation.</p>\n\n<p>Leighton is a director of Alexza Pharmaceuticals, AnaptysBio, Apptera, Cambrios Technologies, Genomatica, Opal Therapeutics, and Siluria. He also serves as a trustee or director of The BeneTech Initiative, BioVentures for Global Health, The UC Berkeley Foundation and School of Public Health Council and the Santa Fe Institute. His awards include several as co-inventor of technology underlying the Affymetrix GeneChip</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Alloy Ventures","permalink":"alloy-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[113,53],"assets/images/resized/0000/3916/3916v1-max-150x150.png"],[[113,53],"assets/images/resized/0000/3916/3916v1-max-250x250.png"],[[113,53],"assets/images/resized/0000/3916/3916v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}