{"first_name":"Lela","last_name":"Christine","permalink":"lela-christine","crunchbase_url":"http://www.crunchbase.com/person/lela-christine","homepage_url":"http://www.thepowerplayermag.com","birthplace":"Los Angeles","twitter_username":"powerplayermag","blog_url":"http://thepowerplayermagazine.wordpress.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"power-player-lifestyle, power-player-magazine, fashion, sports, music, film-tv, nintendo, celebrities, entertainment, health, news, art, culture","alias_list":null,"created_at":"Wed Jul 21 19:29:34 UTC 2010","updated_at":"Wed Jul 21 21:18:51 UTC 2010","overview":"<p>About The Power Player Lifestyle Magazine (thepowerplayermag.com): The Power Player Lifestyle Magazine delivers exactly what its title conveys: a focus on the top performers on all areas of Entertainment, Fashion, Beauty, Food, Travel, Health, Lifestyle, Sports and News. Observant news correspondents journey into the field to report the newest, trendiest, most delicious, most beautiful, healthiest, and coolest things going on in today&#8217;s international marketplace. But, not only do we touch upon every aspect of what&#8217;s hip, but we also investigate forthcoming trends in each industry. Sneak peeks, backstage coverage and interviews are only a few of the highlights in each month&#8217;s issue. Our look will evolve as we expand to connect with millions across the globe. The Power Player Lifestyle Magazine is what we term our visionary, innovative E-magazine focuses on powerful individuals who continue to make a positive and significant impact in the world today.</p>","image":{"available_sizes":[[[89,150],"assets/images/resized/0009/4478/94478v2-max-150x150.jpg"],[[149,250],"assets/images/resized/0009/4478/94478v2-max-250x250.jpg"],[[269,450],"assets/images/resized/0009/4478/94478v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}