{"first_name":"Len","last_name":"Lauer","permalink":"len-lauer-2","crunchbase_url":"http://www.crunchbase.com/person/len-lauer-2","homepage_url":"http://www.memjet.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Memjet ","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Nov 21 00:53:17 UTC 2010","updated_at":"Mon Nov 22 19:17:16 UTC 2010","overview":"<p>Len Lauer was appointed in January 2010 as Memjet’s president and chief executive officer in advance of the commercialization of the company’s color printing technologies. Len’s 30-year high-tech career includes executive positions with leading global technology innovators, developers and providers, including Qualcomm, Sprint, Bell Atlantic and IBM. He oversees all strategy and direction for Memjet’s global commercial business units, as well as operations, engineering, OEM partner development and manufacturing.</p>\n\n<p>Before joining Memjet, Len served as executive vice president and chief operating officer of Qualcomm, Inc., the world leader in next-generation mobile technologies, many of which can be found inside the world’s best known brands of cellphones and smartphones. Len joined Qualcomm in 2006 after nearly 9 years with Sprint. He served as president and chief operating officer for Sprint before the merger of Sprint and Nextel. He directed Sprint’s major initiative to deliver converged media and communication services. For this innovation, the company was honored with an Emmy Award for Outstanding Achievement in Engineering Development. Prior to the Sprint-Nextel merger, Len held several executive positions with Sprint, including president of Sprint PCS, president of Sprint&#8217;s consumer services group, president of Sprint Business, and president of the global markets group, where he directed marketing and sales, network operations, technology planning, product development and information technology. He joined Sprint in 1998.</p>\n\n<p>Prior to Sprint, Len was president and chief executive officer of Bell Atlantic-New Jersey. He also held a variety of management positions in marketing and sales over a 13-year period with IBM. Len serves on the board of directors for Western Digital.</p>","image":{"available_sizes":[[[150,146],"assets/images/resized/0011/1049/111049v2-max-150x150.jpg"],[[156,152],"assets/images/resized/0011/1049/111049v2-max-250x250.jpg"],[[156,152],"assets/images/resized/0011/1049/111049v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President and CEO","firm":{"name":"Memjet ","permalink":"memjet-technology","type_of_entity":"company","image":{"available_sizes":[[[150,39],"assets/images/resized/0007/9534/79534v5-max-150x150.jpg"],[[250,65],"assets/images/resized/0007/9534/79534v5-max-250x250.jpg"],[[450,118],"assets/images/resized/0007/9534/79534v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}