{"first_name":"Lena","last_name":"Kannappan","permalink":"lena-kannappan","crunchbase_url":"http://www.crunchbase.com/person/lena-kannappan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 07 17:49:12 UTC 2008","updated_at":"Wed May 07 17:49:59 UTC 2008","overview":"<p>Lena Kannappan brings 17 years of software industry experience including both senior technical and managerial roles in various segments including Digital Identity Management systems, Telecommunications Convergence services and applications, and E-Commerce applications.</p>\n\n<p>Before founding FuGen Solutions, Lena was the Director for Identity and Messaging group at France Telecom R&amp;D driving the efforts around Address Book, IM, Presence, SMS, Geo Location services and Social Networking looking at subscriber identity and privacy related issues. Lena chaired multiple industry standards committees including Liberty Alliance and Open Mobile Alliance in the areas of Federated Identity Management and Web Services Security. Prior to France Telecom, Lena was the Technology Strategist at Oblix (acquired by Oracle) where he worked with number of enterprise vendors to bring the architecture integration models including the first enterprise SSO integration for Siebel systems.</p>\n\n<p>Lena has been an invited speaker and panelist at various Identity Management and Web Services related conferences, seminars and workshops including CA World, RSA, Mobile Finance summit, Porvoo EU eGov eID forum, Stanford University and CMU-CERT-Cylab. Lena Kannappan founded startup companies in the past in Silicon Valley including an ebusiness consulting firm and an enterprise software product company. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder, President & CEO","firm":{"name":"FuGen Solutions","permalink":"fugen-solutions","type_of_entity":"company","image":{"available_sizes":[[[150,103],"assets/images/resized/0001/8100/18100v1-max-150x150.jpg"],[[160,110],"assets/images/resized/0001/8100/18100v1-max-250x250.jpg"],[[160,110],"assets/images/resized/0001/8100/18100v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}