{"first_name":"Leo","last_name":"Rocco","permalink":"leo-rocco","crunchbase_url":"http://www.crunchbase.com/person/leo-rocco","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Pago Mobile","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Sep 19 20:08:26 UTC 2011","updated_at":"Sun Jul 29 07:12:23 UTC 2012","overview":"<p>Leo Rocco is the Founder and CEO of GoPago, Inc. </p>\n\n<p>Leo is a lifelong entrepreneur with a strong background in engineering and product development, having worked with some of the world’s leading brands, and now he is applying his talents to change the face of commerce. He began coding in college and at the age of 20, developed an online learning system for engineers. Leo earned a degree in Mechanical Engineering and MIS at Kettering University in Michigan and with the help of a professor, his software was acquired by the Parametric Technology Corporation (PTC). He soon took on several leadership roles across the development, marketing, sales and services organizations during his tenure with PTC where he developed strong skills in product development. Leo was responsible for bridging the gap between technology and business through his work with companies such as NASA, Boeing, and Ferrari. He then joined the Trigo acquisition of IBM and went on to lead IBM Rational’s global software sales relationships with IBM’s marquee technology customers, including Intel, Cisco, HP, Oracle and eBay and helped them develop better software. The inspiration behind Pago came when he missed Barry Bonds record breaking 756th home run at AT&amp;T Park. </p>","image":null,"degrees":[{"degree_type":"","subject":"Mechanical Engineering and MIS","institution":"Kettering University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder and CEO","firm":{"name":"Pago Mobile","permalink":"pago-mobile","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0015/4838/154838v2-max-150x150.jpg"],[[190,58],"assets/images/resized/0015/4838/154838v2-max-250x250.jpg"],[[190,58],"assets/images/resized/0015/4838/154838v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}