{"first_name":"Leo","last_name":"Wang","permalink":"leo-wang","crunchbase_url":"http://www.crunchbase.com/person/leo-wang","homepage_url":"http://bossonly.com","birthplace":"China","twitter_username":"betashow","blog_url":"http://betashow.blogbus.com","blog_feed_url":"http://feedsky.blogbus.com/betashow_blogbus_com","affiliation_name":"Unaffiliated","born_year":1979,"born_month":8,"born_day":13,"tag_list":"china, shanghai, beijing, mobile-industry, mobile-web, events","alias_list":"","created_at":"Fri Oct 23 11:16:52 UTC 2009","updated_at":"Thu Jul 07 13:59:53 UTC 2011","overview":"<p>Leo Wang is the founder of Mobile2.0 Forum with 1,500+ professional members from the telecom, Internet and mobile industry. Leo is often called an extraordinary insider of China&#8217;s wireless industry and is very well connected in this sector. During the past 9 years, he&#8217;s been working in a number of fields: telecommunications, value-added services, social networking services, mobile applications, and handset platforms.</p>\n\n<p>The Mobile2.0 Forum, founded in 2007 and well-known around the world, is a top level, international communication platform where telecom, mobile, and Internet industry entrepreneurs, major corporations and venture capitalists can meet and share information, make new friends and explore business opportunities. </p>\n\n<p>Mobile2.0 Forum events usually consist of speeches, discussion panels, business matching, product demos and strategy workshops. According to different partners and sponsors, every event is structured differently and in a unique way.</p>\n\n<p>The Mobile2.0 Forum has already partnered with industry leaders like Qualcomm, Huawei, Deutsche Telekom, FT-Orange, Symbian Foundation, China Telecom and China Mobile. The Mobile2.0 Forum delivered 50+ top level events and attracted more than 1,500 industry elite members.</p>\n\n<p>The Mobile2.0 Forum serves as an activator for industry development. The&#8221;2.0&#8221; stands for &#8220;Next Generation&#8221; which can be interpreted as the slogan of the wireless Internet era, the contents &amp; applications era and the wireless digital revolution.</p>","image":{"available_sizes":[[[120,120],"assets/images/resized/0006/3468/63468v4-max-150x150.jpg"],[[120,120],"assets/images/resized/0006/3468/63468v4-max-250x250.jpg"],[[120,120],"assets/images/resized/0006/3468/63468v4-max-450x450.jpg"]],"attribution":"<p>new photo</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.bossonly.com/","title":"Boss Only"}]}