{"first_name":"Leonard","last_name":"Hirsch","permalink":"leonard-hirsch","crunchbase_url":"http://www.crunchbase.com/person/leonard-hirsch","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jun 06 15:05:57 UTC 2009","updated_at":"Sat Jun 06 15:11:05 UTC 2009","overview":"<p>Leonard P. Hirsch, CPA, is the Chief Financial Officer of NGN Capital. Mr. Hirsch comes to NGN Capital with over 15 years of experience in tax, accounting and financial administration. Most recently he was the Chief Financial Officer of Wheatley Partners, a venture capital group with $300 million under management, focused on software and technology related investments. In this role he was responsible for financial and tax reporting, limited partner communications, and fund administration. Prior to this position, he worked with a technology start-up as it grew from about twenty to over 100 employees upon the completion of venture capital financing. Mr. Hirsch’s responsibilities included financial reporting, tax compliance, budgeting, development of accounting policies, and general administrative matters. Mr. Hirsch began his career with PricewaterhouseCoopers, spending seven years in the New York office and specializing in corporate and partnership taxation. His clients ranged from start-ups to multinational corporations in the consumer, media, retail and financial service sectors. Mr. Hirsch received a B.S in business administration from the University of Vermont and a Masters in Accounting and Taxation from Fordham University.</p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0004/7123/47123v1-max-150x150.jpg"],[[165,220],"assets/images/resized/0004/7123/47123v1-max-250x250.jpg"],[[165,220],"assets/images/resized/0004/7123/47123v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CFO","firm":{"name":"NGN Capital","permalink":"ngn-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,35],"assets/images/resized/0004/2734/42734v1-max-150x150.jpg"],[[250,58],"assets/images/resized/0004/2734/42734v1-max-250x250.jpg"],[[300,70],"assets/images/resized/0004/2734/42734v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}