{"first_name":"Leon","last_name":"Cooper","permalink":"leon-cooper","crunchbase_url":"http://www.crunchbase.com/person/leon-cooper","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Nov 19 15:24:48 UTC 2008","updated_at":"Tue May 26 08:20:04 UTC 2009","overview":"<p>Mr.Cooper is the President and Chief Executive Officer of Grupo Deco America Corporation and its subsidiaries and has been since January 1, 2000.  Prior to that he was a Partner of Lewis, D&#8217;Amato, Brisbois &amp; Bisgaard in the Corporate Law Department and was the Group Leader for the firm&#8217;s Business Transaction Group.  His extensive professional experience includes title, real estate, trust and business litigation; corporate and securities transactions; particularly initial public offerings; secondary public offerings; private placements; leveraged buyouts; corporate finance; mergers and acquisitions; real estate transactions; labor law and equal opportunity issues; design and preparation of corporate preventive law programs, and alternative dispute resolutions.</p>\n\n<p>As the Chief Executive Officer and President of Grupo Deco America, he was responsible for the corporate organization of the subsidiaries, including Deco California Insurance Company, Deco Texas Partners, L.P. and Deco Trading Company.  He also provided leadership in acquiring the real property for the Pico Rivera project and the acquisitions of six funeral homes in California and two in Texas.  He has been active in developing relationships with financial institutions, insurance companies, and investment bankers.  He is negotiating financial arrangements and a private placement for Grupo Deco America.</p>\n\n<p>After graduating from UCLA with honors (1944-Phi Beta Kappa), Mr. Cooper earned his law degree at Harvard in 1949 and an L.L.M. at the University of Southern California, 1965.  He is a member of Los Angeles County and American Bar Associations and is admitted to practice in California, Massachusetts and before all U.S. District Courts in California, Ninth Circuit Court of Appeals, and the U.S. Supreme Court. </p>\n\n<p>Mr. Cooper is a former member and chairman of the California Alcoholic Beverage Control Appeals Board. Mr. Cooper has been a member and chairman of the Board of Directors of the Santa Catalina Conservancy, a member of the Board of Directors of the Weatherby Foundation, and a member of the Board of Advisers for Brookside Capital, Inc.</p>\n\n<p>Mr. Cooper holds the rank of Lt. Commander, USNR (ret.) for service at sea in destroyers during World War II and Korea.</p>","image":{"available_sizes":[[[150,147],"assets/images/resized/0004/5469/45469v1-max-150x150.jpg"],[[180,177],"assets/images/resized/0004/5469/45469v1-max-250x250.jpg"],[[180,177],"assets/images/resized/0004/5469/45469v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Board of Advisors","firm":{"name":"Brookside Capital","permalink":"brookside-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,18],"assets/images/resized/0000/3991/3991v1-max-150x150.png"],[[200,24],"assets/images/resized/0000/3991/3991v1-max-250x250.png"],[[200,24],"assets/images/resized/0000/3991/3991v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}