{"first_name":"Leslie","last_name":"Spring","permalink":"leslie-spring","crunchbase_url":"http://www.crunchbase.com/person/leslie-spring","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Cognitive Code","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Feb 05 22:41:36 UTC 2008","updated_at":"Thu Apr 16 22:36:35 UTC 2009","overview":"<p>Leslie Spring is the inventor and architect of Cognitive Code&#8217;s SILVIA platform.</p>\n\n<p>As CTO and Founder of Cognitive Code, he is responsible for the technology and product development arm of the company. Leslie also works with the company&#8217;s other executives and fellow board members to determine the overall direction and specific implementations of Cognitive Code&#8217;s business strategies.</p>\n\n<p>Leslie has been a professional software developer since the early 80s, and has worked on everything from hand coding machine-language 3d matrix transformations to managing large-scale development efforts and software groups. Leslie has been employed by and has consulted to videogame and entertainment companies such as Electronic Arts, Disney, and Sony Pictures. His responsibilities as Principal Engineer, Technical Director, and Software Architect for various projects have included heading teams to develop commercial products, as well as direct, hands-on development of a variety of graphics algorithms, gaming systems, and integrated development tools.</p>\n\n<p>Most recently, prior to Cognitive Code, he was responsible for creating the software architecture of Screenblast, Sony&#8217;s on-line content creation and sharing service, and developed all of Screenblast&#8217;s content management systems and associated user tools. In addition, while at Sony, Leslie developed four large-scale patented software technologies and shepherded these technologies through the entire patent process.</p>\n\n<p>At four years of age, Leslie saw the film, 2001: a Space Odyssey. It was at that moment that Leslie began his lifelong interest in and passion for artificial intelligence. It is that passion combined with decades of experience in developing practical, product-oriented systems that has culminated in the development of the SILVIA platform, and the founding of Cognitive Code as a business.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO/Chief Technology Officer","firm":{"name":"Cognitive Code","permalink":"cognitivecode","type_of_entity":"company","image":{"available_sizes":[[[148,90],"assets/images/resized/0000/0301/301v1-max-150x150.png"],[[148,90],"assets/images/resized/0000/0301/301v1-max-250x250.png"],[[148,90],"assets/images/resized/0000/0301/301v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}