{"first_name":"Leslie","last_name":"B. Daniels","permalink":"leslie-b-daniels","crunchbase_url":"http://www.crunchbase.com/person/leslie-b-daniels","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon May 18 13:02:57 UTC 2009","updated_at":"Mon May 18 13:03:43 UTC 2009","overview":"<p>Leslie B. Daniels</p>\n\n<p>Managing Partner</p>\n\n<p>Les Daniels, based in New York, was a founding partner of CAI in 1989.  He was previously President of Burdge, Daniels &amp; Co., Inc., a company engaged as a principal in venture capital and buyout investments, as well as the trading of private placement securities. Mr. Daniels was responsible for financing, overseeing and disposing of investments made on behalf of the Company. Prior to forming Burdge, Daniels, Mr. Daniels was a Senior Vice President of Blyth, Eastman, Dillon &amp; Co., having responsibility for the corporate fixed income sales and trading departments.</p>\n\n<p>Mr. Daniels is a former Director of Aster-Cephac SA, Douglas Machine &amp; Tool Co., Inc., IVAX Corporation, MIM Corporation, MIST Inc., Mylan Laboratories Inc., NBS Technologies Inc. and Safeguard Health Enterprises Inc. He was also Chairman of Zenith Laboratories, Inc. He currently serves as a Director of AeroSat Corporation and Bioanalytical Systems, Inc., and he is Chairman of TurboCombustor Technology Inc.</p>\n\n<p>Mr. Daniels has had substantial experience investing as a principal in the health care, aviation and aerospace industries. Over the last twenty years, Mr. Daniels has invested in numerous startup, venture capital and buyout transactions in various sectors across the health care spectrum including health maintenance organizations, generic drug companies, pre-clinial and clinical contract research organizations and pharmacy benefit companies. As a result, Mr. Daniels has established a broad base of relationships with people associated with the health care industry. More recently a concentration on the aviation and aerospace industries has provided a steady flow of transaction opportunities.</p>\n\n<p>Mr. Daniels is a graduate of Fordham University.</p>\n\n<p>E-mail: ldaniels@caifunds.com</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0004/4426/44426v1-max-150x150.jpg"],[[200,200],"assets/images/resized/0004/4426/44426v1-max-250x250.jpg"],[[200,200],"assets/images/resized/0004/4426/44426v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Partner","firm":{"name":"CAI","permalink":"cai","type_of_entity":"financial_org","image":{"available_sizes":[[[150,73],"assets/images/resized/0004/4416/44416v1-max-150x150.jpg"],[[230,112],"assets/images/resized/0004/4416/44416v1-max-250x250.jpg"],[[230,112],"assets/images/resized/0004/4416/44416v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}