{"first_name":"Lex","last_name":"Bradshaw-Zanger","permalink":"lex-bradshaw-zanger","crunchbase_url":"http://www.crunchbase.com/person/lex-bradshaw-zanger","homepage_url":"http://www.lexbz.me","birthplace":"","twitter_username":"LexBZ","blog_url":"http://www.relativelydigital.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"digital-strategist, brand-planner, geek","alias_list":null,"created_at":"Mon Jan 10 04:54:54 UTC 2011","updated_at":"Sat Jan 22 04:41:30 UTC 2011","overview":"<p>Before joining Leo Burnett, Lex was a 360° Business Director for JWT &amp; RMG Connect in Paris, and the WPP France Lead for the HSBC account – in this role he coordinated the work of the different agencies working for HSBC in France (media, research, creative, interactive) aswell as developing the strategy for the online banking business. Prior to this, Lex was the global marketing manager for Island Global Yachting (IGY Marinas) part of the Island Capital real estate merchant bank group. Here, he managed the launches of several mega yacht marina and restaurant brands in Europe, Caribbean and the Middle East, along with worldwide advertising and a $4 million launch event for the YHG Marina in St.Thomas.</p>\n\n<p>He has also worked for the relationship marketing group FullSIX, where he was responsible for US development and the management of the L’Oreal group of brands in North America, and also the Remy-Cointreau group for their online presence in France and the US. As a freelance marketing consultant, Lex has also worked on a number of projects under the Brancept name, covering clients in Europe and North America and industries from retail and entertainment to hospitality and tourism, some case studies can be found here.</p>\n\n<p>Lex began his career both as brand planner at The Richards Group, working with consultants and multi-nationals to take their brands beyond communications and into the heart of the organisation; and an account executive at OgilvyOne, where he coordinated on and offline advertising for IBM in the G4 countries across a number of business units.</p>\n\n<p>Lex is currently the Regional Director for Digital Strategy &amp; Innovation for Leo Burnett MENA and in this role he overseas the digital, direct and CRM competencies for the region, covering clients from General Motors to McDonald’s and P&amp;G to du Telecom. His team ranges from digital strategists and channel planners to interaction designers and the technical development team.</p>\n\n<p>He has an MBA in Strategy from the UPF in Barcelona, and undergraduate finance degrees from EuroMed Marseille and the Westminster (formerly Harrow) Business School in London. He is trilingual and truly multi-cultural.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0011/8151/118151v2-max-150x150.jpg"],[[200,200],"assets/images/resized/0011/8151/118151v2-max-250x250.jpg"],[[200,200],"assets/images/resized/0011/8151/118151v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"Strategy & Finance","institution":"UPF, Barcelona","graduated_year":2004,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/lexbz","title":"Twitter @LexBZ"},{"external_url":"http://www.linkedin.com/in/lexbradshawzanger","title":"LinkedIn"},{"external_url":"http://www.facebook.com/lexbz","title":"Facebook"}]}