{"first_name":"Lex","last_name":"Kogan","permalink":"lex-kogan","crunchbase_url":"http://www.crunchbase.com/person/lex-kogan","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Aug 06 06:53:17 UTC 2012","updated_at":"Mon Aug 06 16:08:25 UTC 2012","overview":"<p>An advocate for unique, useful health strategies, Lex Kogan makes perpetual efforts to help others. His method of treatment for addiction has gained in popularity over the years. At present, Costa Rica and Mexico use this innovative method to treat people afflicted with the disease of addiction. Implementing it into American medicine has been met with resistance. </p>\n\n<p>Lex Kogan has managed his own health with combinations of natural, holistic medicine and frequent checkups with a physician. This connective strategy has kept in good health for many years. For him, the use of therapy, meditation and medication works best. While advocating his treatment method, Lex Kogan encourages people to follow in a similar vein. </p>\n\n<p>Lex Kogan’s passion for ibogaine treatment was reinforced in 2007. He took a part on a popular TV show and was thereby exposed to the dark side of Hollywood. He found people struggling with drug and alcohol addiction everywhere. Lex Kogan sympathized with those suffering from the downward spiral and set out to find ways to help. </p>\n\n<p>Ibogaine is a natural root native to Africa, and has been used since the 19th century in African cultures. It is a part of many traditions, but is used for its anti-associative effects. It leads to a psychological and physical dissociation from addictive substances, proving useful in treating heroin and opiate addiction. Lex Kogan ibogaine therapy is currently used for a number of positive results.</p>\n\n<p>Ingesting ibogaine disrupts the psychological chain of addiction. It diminishes addictive urges to use a substance, meanwhile reducing withdrawal symptoms. This chemical disturbance allows patients to regain control of their actions much faster. With a reduction of symptoms and urges, the disease of addiction is more easily conquered.</p>\n\n<p>Lex Kogan ibogaine therapy is new, but proven to work. While it is not yet perfected, it has had countless cases of success over past years. It is a remarkable health strategy that has unquestioned results, and it is completely natural.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/4526/204526v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/4526/204526v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/4526/204526v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}