{"first_name":"Liam","last_name":"Dayan","permalink":"liam-dayan","crunchbase_url":"http://www.crunchbase.com/person/liam-dayan","homepage_url":"http://www.createcore.com","birthplace":"New York, NY","twitter_username":"liamdayan","blog_url":"","blog_feed_url":"","affiliation_name":"createCORE","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Mar 12 22:15:51 UTC 2011","updated_at":"Tue Mar 22 05:15:46 UTC 2011","overview":"<p>An award-winning industry leader, Liam is the Founder and CEO of createCORE. A lifetime technologist, he’s spent most of the last decade in the real estate space, most recently as CTO of Onboard Informatics and GM of their Listings Platform. There he led the effort to develop an expert system for aggregating and processing MLS data with contextual data sets, and the subsequent invention of the Lifestyle Listings Engine and search. Before entering the Real Estate space, Liam was the Founder and Principal Architect of Comp-Elite Solutions, Inc., where he was one of the principal consultants on technology matters to such companies as Microsoft, NCCI, Burger King, Interim Healthcare, and others.</p>\n\n<p>After the successful acquisition of Comp-Elite, Liam joined eNeighborhoods to lead the technology team where, in 2002, the company flagship product line was selected by the National Association of Realtors as a Realtor Benefit. In 2005, eNeighborhoods was ranked #84 on the Inc. 500 as well as #205 on the Deloitte Technology Fast 500 lists as one of the fastest growing technology companies, before the company’s ultimate acquisition by Dominion Enterprises. After a winning run with eNeighborhoods, Liam had the opportunity to join the Internet Advertising Group, Inc. as their CTO and Vice President of Technology. His tenure there saw IAG’s proprietary lead generation technology and platforms revamped, significant increases in their lead-gen and analysis capabilities, and dramatic advancement in the capabilities of the already talented team he found there.</p>\n\n<p>Well regarded in both real estate and the more general world of data, Liam has been a frequent speaker at industry events and serves as an expert resource for corporate and government boards, executives and agencies on technology issues and trends. Having lived in South Florida for more than two decades, he is nonetheless a lousy golfer. Plays a mean harmonica, though.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO & Founder","firm":{"name":"createCORE","permalink":"createcore","type_of_entity":"company","image":{"available_sizes":[[[150,26],"assets/images/resized/0012/6049/126049v2-max-150x150.jpg"],[[250,44],"assets/images/resized/0012/6049/126049v2-max-250x250.jpg"],[[260,46],"assets/images/resized/0012/6049/126049v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"General Manager (Listings Group), CTO","firm":{"name":"Onboard Informatics","permalink":"onboard-informatics","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/liamdayan","title":"LinkedIn"},{"external_url":"http://twitter.com/liamdayan","title":"Twitter"},{"external_url":"http://www.linkedin.com/in/liamdayan","title":"LinkedIn"},{"external_url":"http://www.facebook.com/liamdayan","title":"Facebook"}]}