{"first_name":"Lili","last_name":"Cheng","permalink":"lili-cheng","crunchbase_url":"http://www.crunchbase.com/person/lili-cheng","homepage_url":"","birthplace":"Tokyo","twitter_username":"lilich","blog_url":"","blog_feed_url":"","affiliation_name":"Microsoft","born_year":null,"born_month":null,"born_day":null,"tag_list":"microsoft, fuse, lili-cheng","alias_list":"","created_at":"Thu Oct 15 16:04:12 UTC 2009","updated_at":"Wed Oct 21 19:15:50 UTC 2009","overview":"<p>Lili Cheng is general manager of Microsoft’s Future Social Experiences (FUSE) Labs, which focuses on software and services that are centered on social connectivity, real-time experiences, and rich media.</p>\n\n<p>Previously, she was the director of the Creative Systems Group (CSG) within Microsoft Research.</p>\n\n<p>CSG developed several projects in the area of social computing and design, including Kodu, an Xbox 360 game to teach kids programming concepts; Salsa, a project that combines email and social networking concepts; and a project that rethinks how we view and share files within the operating system. Lili’s team also was responsible for Microsoft Research’s Design Expo and Social Computing Symposium.</p>\n\n<p>Previously, Lili was director of user experience for Microsoft Windows, where from 2004 to 2006 she oversaw design, user research, user assistance and advanced development for Windows Vista.</p>\n\n<p>Lili joined Microsoft in 1995, in the Virtual Worlds research group where she worked on social applications such as V-Chat and Comic Chat. She started the Social Computing Group within Microsoft Research in 2001, where the team built various social networking prototypes including Wallop (which spun out as a separate company in 2004), Photostory (which shipped in Windows), and the Sapphire project, an early vision for redesigning Windows.</p>\n\n<p>Prior to Microsoft, Lili worked in Apple Computer’s Advanced Technology Group, on the User Interface research team, where she focused on Quicktime Conferencing and Quicktime VR.</p>\n\n<p>Lili is also a registered architect; she worked in Tokyo and Los Angeles for Nihon Sekkei and Skidmore Owings and Merrill on commercial urban design and large-scale building projects. She has taught at NYU-Interactive Telecommunications as well as Harvard University.</p>\n\n<p>Lili was born in Tokyo, is married with three boys, and lives in Bellevue Washington.</p>","image":{"available_sizes":[[[150,94],"assets/images/resized/0006/2821/62821v2-max-150x150.jpg"],[[250,157],"assets/images/resized/0006/2821/62821v2-max-250x250.jpg"],[[339,214],"assets/images/resized/0006/2821/62821v2-max-450x450.jpg"]],"attribution":"<p>Joi Ito/ <a href=\"http://www.flickr.com/photos/joi/1394490187/\" title=\"Flickr\" rel=\"nofollow\">Flickr</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"General manager of the Future Social Experiences (FUSE) Labs","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"user interface researcher","firm":{"name":"Apple","permalink":"apple","type_of_entity":"company","image":{"available_sizes":[[[124,150],"assets/images/resized/0005/4061/54061v1-max-150x150.jpg"],[[206,250],"assets/images/resized/0005/4061/54061v1-max-250x250.jpg"],[[372,450],"assets/images/resized/0005/4061/54061v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}