{"first_name":"Lior","last_name":"Nuchi","permalink":"lior-nuchi-2","crunchbase_url":"http://www.crunchbase.com/person/lior-nuchi-2","homepage_url":"http://www.pillsburylaw.com/lior.nuchi","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"LOOLEE","born_year":1960,"born_month":8,"born_day":29,"tag_list":"","alias_list":null,"created_at":"Fri Jan 09 03:04:58 UTC 2009","updated_at":"Fri Jan 09 17:37:58 UTC 2009","overview":"<p>Mr. Nuchi has practiced corporate law in Silicon Valley for over 20 years. Mr. Nuchi focuses on complex transactions for a variety of clients, including corporations, investment firms, investment and commercial banks, universities and individuals.</p>\n\n<p>Mr. Nuchi has represented many companies in corporate and finance matters ranging from mergers and acquisitions to seed round financings and initial public offerings. He regularly advises CEOs, boards of directors and special committees on strategic and corporate governance issues and securities law matters. He has represented clients in more than 100 public and private company acquisitions, strategic alliances and financings, ranging in size from several billion dollars to start-up transactions. Mr. Nuchi’s client base includes leading companies in a wide range of industries such as internet/web2.0, media and entertainment, motion picture and television, animation, record and music publishing, production companies, restaurants, specialty and gourmet food producers, large food and beverage companies, wineries, retail chains, renewable energy, semiconductors, enterprise software, medical devices, pharmaceuticals, biotechnology, financial services and higher education. Mr. Nuchi also regularly represents clients in bet-the company litigation together with his litigation partners. Since the early 90’s Mr. Nuchi has participated in many of the most important transactions that have created the commercial internet and currently is engaged in cutting edge transactions bringing video and other broadband services to the internet as well as new wireless services.</p>\n\n<p>In addition to his corporate practice, throughout his career Mr. Nuchi has had an active and varied entertainment and media practice and has represented a wide range of participants in the entertainment world, including creative persons such as artists, actors and musicians, content providers, publishers and film and television studios on a wide range of licensing, distribution and financing transactions.</p>\n\n<p>Mr. Nuchi also has considerable experience in international transactions. Early in his career, Mr. Nuchi developed an interest in working with immigrant entrepreneurs and foreign companies and practiced law in Tokyo, Hong Kong and Tel Aviv, Israel. While in Israel, he participated in the formation of many of the key venture capital funds in Israel and represented these funds in portfolio company investments and in connection with exit transactions. In the last 15 years, Mr. Nuchi has worked on many of the foremost transactions involving Israeli IT, internet and life science companies. Currently, Mr. Nuchi is co-leader of the firm’s Israel practice group and leader of the cross-border transactions group in the Silicon Valley Office.</p>\n\n<p>Mr. Nuchi is listed in Who’s Who in American Law and Who’s Who in America.</p>","image":{"available_sizes":[[[90,119],"assets/images/resized/0003/3465/33465v2-max-150x150.jpg"],[[90,119],"assets/images/resized/0003/3465/33465v2-max-250x250.jpg"],[[90,119],"assets/images/resized/0003/3465/33465v2-max-450x450.jpg"]],"attribution":"<p>Lior Nuchi</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"CEO and Co-founder","firm":{"name":"LOOLEE","permalink":"loolee","type_of_entity":"company","image":null}},{"is_past":false,"title":"Partner","firm":{"name":"Pillsbury Winthrop Shaw Pittman","permalink":"pillsbury-winthrop-shaw-pittman","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.pillsburylaw.com/lior.nuchi","title":"Pillsbury Winthrop Shaw Pittman"}],"web_presences":[{"external_url":"http://www.zoominfo.com/people/Nuchi_Lior_254005500.aspx","title":""}]}