{"first_name":"Lisa","last_name":"Shields","permalink":"lisa-shields-2","crunchbase_url":"http://www.crunchbase.com/person/lisa-shields-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"hyperWALLET Systems","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jan 23 23:36:03 UTC 2009","updated_at":"Mon Feb 09 16:52:46 UTC 2009","overview":"<p>Lisa is the co-founder, President and Chief Executive Officer of hyperWALLET Systems Inc. She is responsible for guiding the company&#8217;s evolution from technology start-up to respected payments industry participant. In this regard, Lisa brings over 15 years of experience in an array of operationally sensitive international projects to bear. </p>\n\n<p>Prior to founding hyperWALLET, she served as e-commerce Development Manager for an Internet start-up specializing in high availability, real-time credit card processing. Earlier assignments included commercialization of a prototype criminal geographic targeting application to assist police investigators in pursuit of serious violent and serial offenders, management of an elite team on a project in noise and vibration prediction and control, and design and implementation of embedded real-time hydrodynamic submarine training software. </p>\n\n<p>Lisa was a founding director of the Wireless Innovation Society of British Columbia, and speaks frequently on payment and technology issues. She holds Bachelors and Masters of Science degrees in Engineering, both from the Massachusetts Institute of Technology. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder, President & CEO","firm":{"name":"hyperWALLET Systems","permalink":"hyperwallet-systems","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0003/4672/34672v2-max-150x150.png"],[[207,67],"assets/images/resized/0003/4672/34672v2-max-250x250.png"],[[207,67],"assets/images/resized/0003/4672/34672v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}