{"first_name":"Lisa","last_name":"Kreisler","permalink":"lisa-kreisler","crunchbase_url":"http://www.crunchbase.com/person/lisa-kreisler","homepage_url":"","birthplace":"Florida","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1983,"born_month":6,"born_day":16,"tag_list":"","alias_list":null,"created_at":"Tue Sep 11 06:49:06 UTC 2012","updated_at":"Mon Sep 17 23:14:15 UTC 2012","overview":"<p>Lisa Kreisler</p>\n\n<p>Lisa Kreisler is an experienced, committed educational professional. She holds decades of dedicated experience as a teacher, manager, consultant, and analyst. Currently, she is an educator in the Northern Tioga School district in Pennsylvania. She believes firmly in the power education holds for our youth. That’s why she continually dedicates herself to teaching the next generation the necessary skills for professional success.</p>\n\n<p>Background</p>\n\n<p>Lisa began her educational career as an undergraduate at Pennsylvania’s Lock Haven State University. She earned her degree with cum laude distinction. Her interest in business prompted her to pursue her MBA from SUNY Binghamton in 1988. She placed top priority on her education, earning a top 10% academic distinction for her graduate-level academics</p>\n\n<p>Upon graduation, Lisa worked tirelessly in both the professional and educational sectors. Her career focus has remained on managerial development and education both for her own development as well as the students she has taught.</p>\n\n<p>She has faithfully served in the following positions:</p>\n\n<p> Community college instructor\n Four year university instructor and facilitator\n Elementary/middle school teacher\n Professional consultant with her own firm, LJK Consulting\n Project Lead for a private company’s IT division\n Management of an IT firm’s customer support center</p>\n\n<p>The positions have varied, but all of them have reflected Lisa’s hard work, devotion, and focus on personal and professional development. Even during her work as a manager and project lead, many of her duties were related to education. From planning workshops to conducting training, education has always played a significant role in her life.</p>\n\n<p>With an impressive combination of professional and academic experience, Lisa Kreisler has the skills and experience to make a difference in her students’ lives. Her work has always taken her back to her passion of teaching. Now more than ever, Lisa truly values her role in helping young people develop into hardworking, career-oriented professionals.</p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0021/0817/210817v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0021/0817/210817v2-max-250x250.jpg"],[[260,173],"assets/images/resized/0021/0817/210817v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}