{"first_name":"Lister","last_name":"Delgado","permalink":"lister-delgado","crunchbase_url":"http://www.crunchbase.com/person/lister-delgado","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"IDEA Fund Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jun 05 11:56:48 UTC 2009","updated_at":"Fri Aug 03 19:12:11 UTC 2012","overview":"<p>Lister Delgado is passionate about entrepreneurship and company formation, and has been an early stage investor and advisor to entrepreneurs since 2001. During his career, Lister has led the evaluation of over 1,000 companies and has been a close advisor to more than 50 startups. In his role at IDEA Fund Partners, Lister is responsible for all aspects of the venture process, from deal sourcing and negotiation to management of portfolio investments. Currently, Lister serves on the boards of four portfolio companies; Argyle Social, Distil, Oncoscope and Windsor Circle. In addition, he represents the fund as an observer in two other portfolio companies; NextRay and Automated Insights (formerly StatSheet).</p>\n\n<p>Since 2006, concurrent with his investment responsibilities, Lister has led the design and implementation of the NC IDEA grants program. Under Lister’s leadership, NC IDEA has awarded over $2.1 million to 57 companies. More recently, Lister has been involved in implementing the FL IDEA grants program.</p>\n\n<p>Lister brings to his job a broad range of technical skills in diverse industry sectors, from ASIC design to software development and systems engineering. Prior to IDEA Fund Partners and NC IDEA, Lister worked for five years in the telecommunications and semiconductor industries, first at AT&amp;T Bell Labs, and later at Lucent Technologies. Lister received his Sc.B. in Electrical Engineering from Brown University, an M.S. in Computer Engineering from the University of Texas at Austin and an M.B.A. from the University of North Carolina at Chapel Hill.</p>","image":null,"degrees":[{"degree_type":"Bachelor's of science","subject":"Electrical engineering ","institution":"Brown University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"IDEA Fund Partners","permalink":"idea-fund-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,55],"assets/images/resized/0002/9206/29206v5-max-150x150.png"],[[250,92],"assets/images/resized/0002/9206/29206v5-max-250x250.png"],[[450,166],"assets/images/resized/0002/9206/29206v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}