{"first_name":"Liz","last_name":"Westover","permalink":"liz-westover","crunchbase_url":"http://www.crunchbase.com/person/liz-westover","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jun 01 04:37:51 UTC 2008","updated_at":"Sun Jun 01 05:50:55 UTC 2008","overview":"<p>Liz Westover has more than 20 years experience in technology marketing and specializes in new technology marketing and community building. As a longtime marketing consultant, Liz has worked with some of the most innovative companies in the industry, including Apple Computer, Netscape, Sun (Java Group), Linuxcare and Technorati. She worked with Technorati in its early days to help build its PR and marketing presence. She also helped build the first Java Developer Program, which included the first JavaOne Conference, and also helped build the fist Netscape Developer Program in support of the roll out of the Netscape 2.0 browser. She was an early member of the Marimba team where she was a marketing Director in charge of marketing communications, events, and the creation of its first Consultant Program. Liz is a six year veteran of Apple Computer where she held a number of roles within Apple&#8217;s Developer Group. Liz would like to travel anywhere in Mexico and counts anywhere in Italy as a favorite destination.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP Of Marketing","firm":{"name":"Offbeat Guides","permalink":"offbeat-guides","type_of_entity":"company","image":{"available_sizes":[[[150,67],"assets/images/resized/0001/9775/19775v3-max-150x150.jpg"],[[179,80],"assets/images/resized/0001/9775/19775v3-max-250x250.jpg"],[[179,80],"assets/images/resized/0001/9775/19775v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}