{"first_name":"liza","last_name":"klein","permalink":"liza-klein","crunchbase_url":"http://www.crunchbase.com/person/liza-klein","homepage_url":"http://www.linkedin.com/profile","birthplace":"Isreal","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1970,"born_month":7,"born_day":22,"tag_list":"operations--management, strategic-planning--execution, marketing-on-line, technology, human-resources-services","alias_list":null,"created_at":"Thu Feb 17 15:03:27 UTC 2011","updated_at":"Fri Feb 18 00:34:04 UTC 2011","overview":"<p>My Leadership - planning and leading implementation of growth from 1$ million company for 10$ million company !!.</p>\n\n<p>Network Infrastructure Technologies Inc. is a consulting company that focuses solely on the unique computing, networking and application needs of businesses. Serving over a thousand organizations . NITHealth services focus primarily on healthcare facilities like hospitals, medical offices, and laboratories.</p>\n\n<p>People Technology and Operations .</p>\n\n<p>Operations &amp; Management \nStrategic Planning &amp; Execution \nMarketing ON LINE \nTechnology\nHuman Resources Services</p>\n\n<p>ME :\nA successful entrepreneurial executive and consultant with 15 years experience leading start-ups, turnarounds and high-growth organizations to expansion and success.\n• Be able to introduce current technology concepts to improves processes (Mobile/saas application), reduce cycle times, increase service throughput, reduce overhead costs and optimize inventory levels along with implementing preventive systems.\n•Cutting-edge knowledge of technology and implementing new media marketing campaigns to create leads and builds business sales opportunity.\n•Be recognized as a strong leader, respected and serve as a mentor to develop people and other managers, at multi culture environment.\n•Bring all business facets together with courage, caring about internal and external clients and consistent implementation of core values to deliver long-term, sustainable results for clients.\n•Manage and lead organizational changes and restructure of organizations in time of merge.\n•Developed and upgraded strategic cannels and partnership relationships: Microsoft Gold Certified, Dell Enterprise, Cisco Certified, IBM, and government vendor.\n•Skillful with strategic business and departmental development, planning and management. \n•Served a broad range of clients from small start-ups to Fortune 500 corporations.\n•Strong needs analyzation and restructuring skills and adept at recruiting top talent. </p>\n\n<p>SpecialtiesMy Leadership - planning and leading implementation of growth from 1$ million company for 10$ million company !!.•</p>\n\n<p>Motivating leaders and organizations to achieve their full potential in performance, Empowering business, people-inside and ouside custmer by sharing professional information, Technology and Hr tool.\nIn-depth knowledge of Microsoft products: CRM, Share Point, Project Management, Exchange and Cisco products; solid understanding of infrastructure, sass, networks, applications.</p>","image":null,"degrees":[{"degree_type":"Msc","subject":"","institution":"Tel Aviv","graduated_year":1997,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/lizaklein","title":"Link"},{"external_url":"http://www.nitconnect.com/management_team.shtml","title":"Nithealth/connect"}]}