{"first_name":"Lonnie","last_name":"McNair","permalink":"lonnie-mcnair","crunchbase_url":"http://www.crunchbase.com/person/lonnie-mcnair","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jul 16 12:56:51 UTC 2012","updated_at":"Mon Jul 16 21:03:07 UTC 2012","overview":"<p>Lonnie McNair </p>\n\n<p>There are many among us who stand out simply because they take the time to help others. Of course, there are many more who try and fail. People like Lonnie McNair fall into the former category, because people like Lonnie have actually made differences that helped others.</p>\n\n<p>There&#8217;s a story to every great triumph. No success is instantaneous; as quick as some rises seem, there&#8217;s always an important journey involved. In Mr. McNair&#8217;s case, the road to success was long and involved intense dedication.</p>\n\n<p>Lonnie built a career around the highest form of patriotic service. For 24 years, he racked up successes and accomplishments in the U.S. Army. His work helped the armed services reach multiple goals over the years, increasing efficiency and operational readiness.</p>\n\n<p>Although the path was hard and arduous, Lonnie eventually reached the rank of Battalion Commander. This position required leadership skills as well as attention to detail. He was involved in developing leadership programs for over 250 managers and employees, imparting critical skills to entire organizations. He personally managed a fleet of 200 vehicles without experiencing a single incident. These accomplishments were by no means simple to achieve, but he was up to the challenges they posed.</p>\n\n<p>Of course, much of his work with soldiers and their families was more hands-on. He was directly involved in many of the higher-level decisions that determined ROTC officer candidates chances for retention. As Retention Board President, he helped decide how best to deal with those who had broken Army policies. Of course, these decisions were difficult, but someone had to make them. Lonnie McNair never once shied away from doing so in a way that helped all the parties involved as much as possible.</p>\n\n<p>As an Assistant Professor of Military Science, he increased Army Market Share by up to 50 percent throughout the state of North Carolina. This was critical to maintaining the high recruitment numbers necessary for American military roles in modern global conflicts. He also helped raise awareness of the work employees did. Not only did he help plan recruitment and retention of employees, Lonnie McNair also worked hard to improve the recognition they received for awards. </p>\n\n<p>McNair&#8217;s 24 years in the US Army helped him make changes that improved the lives of others. It also ensured that he had the skills necessary to transition to the civilian world and do community-changing work there as well. </p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/1182/201182v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/1182/201182v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/1182/201182v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}