{"first_name":"Lorelie Ortiz Luis","last_name":"Malate","permalink":"lorelie-ortiz-luis-malate","crunchbase_url":"http://www.crunchbase.com/person/lorelie-ortiz-luis-malate","homepage_url":"","birthplace":"Philippines","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Independent Nurisng Consultant","born_year":null,"born_month":null,"born_day":null,"tag_list":"nursing, healthcare, down-syndrome, registered-nurse","alias_list":null,"created_at":"Mon Sep 10 09:26:23 UTC 2012","updated_at":"Thu Oct 11 04:27:08 UTC 2012","overview":"<p>With some 20 years of experience to her credit, Lorelie Ortiz Luis Malate is an experienced nurse and educator, both in the US and in her native Philippines. She has worked in large hospitals in the Philippines and in the Middle East, and her exceptional administrative and management skills quickly took her to one of the top nursing positions in the Philippines where she became Chief Nursing officer in one of the leading hospitals in the province of Cavite, responsible for the nursing services in the 200 bed facility. At 28 years old, she was the youngest person to hold this position. Malate specializes in clinical management in the field of maternal and child nursing, as well as in nursing education.\nLorelie Malate has held various positions in care facilities and teaching institutes since moving to the United States. At the American Career College she was the Senior Assistant Nursing Program Director, where she was responsible for curriculum development and staff development on the management side, and the supervision of more than 1000 students per quarter, including their professional and practical training.  Later she became the Assistant Director of Nursing at Windsor Garden in Long Beach, CA where she was involved in a broad range of nursing and managerial tasks.\nCurrently Lorelie Malate is an independent nursing consultant, putting her experience and expertise to use in 11 different nursing facilities where she addresses issues from overseeing personnel and developing and implementing policies, through to coordinating patient care with the different members of the interdisciplinary team and quality assurance for the facility’s care level. She is also on the teaching staff of Irvine’s Stanbridge College, where she both lectures and trains nurses in a clinical setting at the Bellflower Medical Center.  In the scope of her responsibilities she evaluates the performance of nursing students in both clinical and classroom setting before they graduate, and helps prepare them for their NCLEX exams. Malate is also a certified instructor of the American Heart Association and trains licensed and non-licensed professionals in CPR and first aid. She is also a certified infant massage instructor and a member of Loving Touch – the infant massage instructor community.\nLorelie Malate is a “giver” – at both personal and professional levels. She participates in outreach programs in the Philippines, providing aid to disaster victims. She has also been invited to present and various nursing conferences, and has been interviewed for the Asian Journal. One of the causes closest to Lorelie Malate’s heart, having two children afflicted with Down syndrome, is the Down Syndrome Association, of which she is a member in California and in the Philippines. She is also a staunch supporter of CampVelles, a special needs learning center in the Philippines that offers early intervention programs for children who have special needs.\nLorelie Malate obtained her bachelor degree in nursing at the Emilio Aguinaldo College Manila, and her master degree is from Walden University in the US. Malate’s future plans for professional development include a doctorate in nursing and training as a speech pathologist.  </p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0021/0626/210626v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0021/0626/210626v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0021/0626/210626v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BS","subject":"Nursing","institution":"Emilio Aguinaldo College","graduated_year":1992,"graduated_month":null,"graduated_day":null},{"degree_type":"MS","subject":"Nursing Education","institution":"Walden University","graduated_year":2010,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"RN Clinical Consultant","firm":{"name":"Independent Nurisng Consultant","permalink":"independent-nurisng-consultant","type_of_entity":"company","image":null}},{"is_past":false,"title":"Theory and Clinical Instructor","firm":{"name":"Stanbridge College","permalink":"stanbridge-college","type_of_entity":"company","image":null}},{"is_past":true,"title":"Assistant Director of Nursing","firm":{"name":"Windsor Garden","permalink":"windsor-garden","type_of_entity":"company","image":null}},{"is_past":true,"title":"Senior Assistant Nursing Program Director","firm":{"name":"American Career College","permalink":"american-career-college","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.lorelieortizluismalate.com/","title":"Lorelie Ortiz Luis Malate Wiki Page"},{"external_url":"http://www.lorelieortizluismalate.net/","title":"Lorelie Ortiz Luis Malate - Who is Page"}],"web_presences":[{"external_url":"http://cvshare.net/lorelieortizluismalate","title":"Lorelie Ortiz Luis Malate Online Resume"},{"external_url":"http://www.lorelieortizluismalate.wordpress.com","title":"Lorelie Ortiz Luis Malate Online Resume Blog"},{"external_url":"http://www.lorelieortizluismalate.net/","title":"Lorelie Ortiz Luis Malate - Who is "},{"external_url":"http://www.lorelieortizluismalate.com/","title":"Lorelie Ortiz Luis Malate - Wiki Page"},{"external_url":"http://cvshare.net/lorelieortizluismalate","title":"Lorelie Ortiz Luis Malate Online Resume"},{"external_url":"http://www.lorelieortizluismalate.wordpress.com","title":"Lorelie Ortiz Luis Malate Online Blog"}]}