{"first_name":"Loreen","last_name":"Sherman","permalink":"loreen-sherman","crunchbase_url":"http://www.crunchbase.com/person/loreen-sherman","homepage_url":"http://www.loreensherman.com","birthplace":"Calgary","twitter_username":"LoreenSherman","blog_url":"http://www.businessskillsfortoday.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1961,"born_month":10,"born_day":4,"tag_list":"organizational-leadership, speak-on-leadership, leadership-development, loreen-sherman, business-leadership, high-impact-leadership, strategic-leadership, good-leadership-skills, executive-leadership-programs-","alias_list":null,"created_at":"Thu Jun 02 02:11:54 UTC 2011","updated_at":"Tue Jun 07 13:51:25 UTC 2011","overview":"<p>One line biography: High-impact Leader who builds with Strategic Tools for Success</p>\n\n<p>Educated at the University of Phoenix and McMaster University, with a Masters of Business Administration and a double-degree in Earth and Environmental Science, Loreen Sherman attained faculty certification with Meritus University. She is a business expert and speaks on leadership. Loreen has shared her knowledge with CEOs, directors, executives and managers. Her understanding of managerial decision making and organizational behavior is evident in her educational speeches on leadership development.</p>\n\n<p>Prior to founding Star-Ting Incorporated, Loreen founded two other businesses and has worked in the energy and oil-and gas industries. She is familiar with banking and securities and has over 20 years of inter-disciplinary experience. Loreen qualified as a candidate for the National Astronaut recruitment campaign. She is an honored member of the Heritage Registry of Who&#8217;s Who.\nLoreen is author of many business books including: The Book on Business Skills for Today; The Book on Leadership Skills for Today and The Book on Formulaic Communication.</p>\n\n<p>Loreen is a content based speaker. She shares her knowledge and has fresh insights to offer. She engages her audiences with real stories, case studies and vignettes to strengthen and position them in today&#8217;s information age. Loreen actively engages and connects with her audiences and probes them to explore and question. Many walk away still discussing her probing statement that &#8216;leaders are not born, they are taught&#8217;. Her messages are applicable to her audiences. She is a professional leadership speaker with a high-impact message. </p>\n\n<p>As a professional member of CAPS Loreen Sherman speaks to strengthen leaders. Her focus is revealing ways they can have higher impact, become better communicators, creative innovators and empowering motivators. Loreen is active in the community and has volunteered as: Ambassador for the Calgary Chamber of Commerce, SIFE Judge for the ACE National &amp; Regional Exhibitions and Captain for the Heart and Stroke Foundation. Perfect as your next speaker, Loreen leaves a part of her heart with every keynote. She is a tier one speaker. Her passion is contagious.</p>\n\n<p>Allow time for Loreen to personally interview your audience members to ensure the highest quality in all presentations. Book her to speak for you today!</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.loreensherman.com","title":"Loreen Michele Sherman Offers Information for Today's Business Leaders"},{"external_url":"http://www.businessskillsfortoday.com","title":"Business Skills for Today"}],"web_presences":[{"external_url":"http://twitter.com/LoreenSherman","title":"Loreen Sherman"},{"external_url":"http://www.linkedin.com/in/loreensherman","title":"Loreen Sherman"}]}