{"first_name":"Lori","last_name":"Andrews","permalink":"lori-andrews","crunchbase_url":"http://www.crunchbase.com/person/lori-andrews","homepage_url":"http://www.loriandrews.com/","birthplace":"","twitter_username":"LoriAndrewsJD","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Mon Mar 19 19:19:03 UTC 2012","updated_at":"Mon Mar 19 19:19:03 UTC 2012","overview":"<p>“When octuplets are born in Houston, when a dead man fathers a baby in Los Angeles, when ‘twins’ of different races are born after a medical mix-up in Manhattan, whom are you going to call?  Lori Andrews definitely is on the short list,” says USA Today.</p>\n\n<p>Lori works on the edge of new technology.  She’s advised companies, politicians, and consumers around the world about the personal and social impacts of genetic technologies, reproductive technologies, and nanotechnologies.  Now she’s focusing on how social networks are changing our lives, for good and ill. </p>\n\n<p>She started her consumer activism when she was seven and her Ken doll went bald.  Her letter to Mattel got action.  She’s been fighting for people’s rights ever since.</p>\n\n<p>Lori is the author of ten non-fiction books and three novels. She frequently appears on television, including on 60 Minutes, Good Morning America, and Nightline.  She has written for publications that include Playboy, Parade, New York, Vogue, Glamour, Self, Washington Post, Chicago Tribune, and Psychology Today.   </p>\n\n<p>The American Bar Association Journal calls Lori “a lawyer with a literary bent who has the scientific chops to rival any CSI investigator.”  In her current project, she is writing a Constitution covering social networks.  </p>","image":{"available_sizes":[[[150,137],"assets/images/resized/0018/0046/180046v1-max-150x150.jpg"],[[197,181],"assets/images/resized/0018/0046/180046v1-max-250x250.jpg"],[[197,181],"assets/images/resized/0018/0046/180046v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}