{"first_name":"Lori H.","last_name":"Schwartz","permalink":"lori-h-schwartz","crunchbase_url":"http://www.crunchbase.com/person/lori-h-schwartz","homepage_url":"http://www.mccannworldgroup.com","birthplace":"New York City","twitter_username":"worldofschwartz","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"httpwww-crunchbase-compeoplenew","alias_list":null,"created_at":"Fri Oct 28 14:48:25 UTC 2011","updated_at":"Mon Oct 31 18:40:12 UTC 2011","overview":"<p>As Chief Technology Catalyst for McCann Worldgroup, North America, Lori is responsible for driving technology innovation at one of the world&#8217;s largest marketing communications companies, with a focus on igniting IP creation for marketers and their brands. Lori looks at the areas of communication, entertainment and utility works with the clients and top creative and strategic executives of all Worldgroup companies to ensure understanding of new and evolving technology as well as emerging business models surrounding content and data enhancement. </p>\n\n<p>Previously, Lori was one of the key principals to launch(2006) the highly regarded Interpublic Emerging Media Lab. Lori was the Senior Vice President and Director of the IPG Lab for it&#8217;s first 5 years. Lori oversaw the group’s strategy, helping to keep clients and agencies ahead of the digital curve, driving innovation in the dramatically changing media landscape. She piloted brand interaction opportunities on behalf of Interpublic, as well as facilitated emerging media upfronts and exclusive deals for Interpublic agencies and clients, including Microsoft, Intel, General Motors, Nestlé and Sony.</p>\n\n<p>Los Angeles-based, she sits on the boards of The Academy of Television Arts and Sciences as an expert on new content platforms and business models for the future of television.</p>","image":null,"degrees":[{"degree_type":"BA","subject":"Drama","institution":"Tufts University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/worldofschwartz","title":"Linkedin"}]}