{"first_name":"Louise","last_name":"Hart","permalink":"louise-hart","crunchbase_url":"http://www.crunchbase.com/person/louise-hart","homepage_url":"http://www.steadyon.tv","birthplace":"Manchester, UK","twitter_username":"thelouisehart","blog_url":"","blog_feed_url":"","affiliation_name":"STEADY ON","born_year":null,"born_month":null,"born_day":null,"tag_list":"advertising, brand-strategy, digital-marketing, mobile-marketing, social-media, film, fashion, technology, steady-on-productions, louise-hart, bbc, sony-pictures, blu-ray, david-beckham, victoria-beckham, sony, target, adidas, independent-film-producers","alias_list":null,"created_at":"Fri May 06 14:18:21 UTC 2011","updated_at":"Tue May 31 03:18:02 UTC 2011","overview":"<p>Louise Hart is the founder and CEO of Steady On Productions, a brand strategy and management consultancy based in Hollywood which focuses on film, fashion and new digital media. Hart is fluent in Japanese and this has taken her on many adventures in television, advertising and film. She started out in London working on the team that launched the UK&#8217;s first digital TV channels, BBC Choice and BBC Knowledge. When young media maverick Stuart Murphy started developing BBC Three, he entrusted Hart with the development and production of a weekend of programming on a Japan theme, including a series exploring youth culture in Tokyo (Music, Fashion, Sex, Shopping and the Future) and an English-dub of the cult anime Lum the Invader Girl. After working on various TV productions for the BBC and RDF Media, she set up a production division at the boutique London talent agency WSK Artists, representing art directors, stylists and photographers, where she produced various ad campaigns for the Japanese market, including Tokyo Beauty Center (TBC) ads featuring David and Victoria Beckham. In 2003, Hart returned to Los Angeles (where she had spent her teenage years) and joined the team launching Blu-ray at Sony Pictures. This placed her at the center of the notorious format war and as a result she is now known in the industry for her key role in defeating the HD DVD competition. Hart conceived of the idea to set up Steady On while at Sony and in 2009 she decided to strike out on her own as a consultant currently for Sony, Target, Adidas and various independent film producers and fashion designers. Hart holds a Bachelor of Arts Honors Degree in Drama and Theatre Arts from Goldsmiths, University of London. </p>","image":{"available_sizes":[[[150,106],"assets/images/resized/0013/6934/136934v2-max-150x150.jpg"],[[250,177],"assets/images/resized/0013/6934/136934v2-max-250x250.jpg"],[[450,318],"assets/images/resized/0013/6934/136934v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA (HONS)","subject":"Drama and Theatre Arts","institution":"Goldsmiths, University of London","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder and CEO","firm":{"name":"STEADY ON","permalink":"steady-on","type_of_entity":"company","image":{"available_sizes":[[[150,92],"assets/images/resized/0013/3509/133509v2-max-150x150.png"],[[250,153],"assets/images/resized/0013/3509/133509v2-max-250x250.png"],[[329,202],"assets/images/resized/0013/3509/133509v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/thelouisehart","title":"Personal Tweets"},{"external_url":"http://www.imdb.com/name/nm3590616/","title":"IMDB profile"},{"external_url":"http://www.linkedin.com/in/louisehart","title":"LinkedIn profile"},{"external_url":"http://www.steadyon.tv","title":"STEADY ON site"},{"external_url":"http://www.twitter.com/SteadyOnTweets","title":"STEADY ON Tweets"},{"external_url":"http://www.facebook.com/louise.hart","title":"Facebook"}]}