{"first_name":"Luc","last_name":"Goguen","permalink":"luc-goguen","crunchbase_url":"http://www.crunchbase.com/person/luc-goguen","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Gogii Games","born_year":null,"born_month":null,"born_day":null,"tag_list":"executive-producer","alias_list":null,"created_at":"Tue May 03 17:10:52 UTC 2011","updated_at":"Wed Jul 06 19:06:15 UTC 2011","overview":"<p>Executive Producer</p>\n\n<p>As executive producer at Gogii Games, Goguen oversees the design and production of all titles released under the Gogii Games banner.  A member of the organization since its founding in 2006, Goguen joined the firm with seven years of extensive experience garnered as a game designer and producer at Toy Box Games.  Since becoming an executive producer with Gogii Games, Goguen has produced over forty fully published casual games including more than twenty Top Ten games and a more than standard amount of Number 1 game titles, including Nanny Mania and Escape from Paradise.  </p>\n\n<p>As an avid enthusiast and consumer of casual games, Goguen is constantly seeking ways to innovate and streamline game mechanics and development.  Aside from acting as the executive producer, and involving himself directly as a game designer on a range of titles throughout the year, Goguen is also responsible for the day to day management of the studio’s team. In short, like many in the casual gaming industry, Goguen’s job description is expansive and not easily summarized.</p>\n\n<p>Believing that the company is only as good as its last release, Goguen is focused on delivering high quality, high value and highly profitable games. When not plotting out a design, or managing in house productions, Goguen can be found spending time with his family. Or if time allows, on the rink and in the net.  If Ipad’s were regulation approved hockey gear, he’d certainly bring that to the blue line. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Executive Producer","firm":{"name":"Gogii Games","permalink":"gogii-games","type_of_entity":"company","image":{"available_sizes":[[[150,90],"assets/images/resized/0013/3038/133038v2-max-150x150.png"],[[250,150],"assets/images/resized/0013/3038/133038v2-max-250x250.png"],[[450,270],"assets/images/resized/0013/3038/133038v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}