{"first_name":"Luc","last_name":"Leroy","permalink":"luc-leroy","crunchbase_url":"http://www.crunchbase.com/person/luc-leroy","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"luc-leroy-software-engineer-3d-adobe-semaphora-ultrapimiento-okyz-sportdrive-porsche","alias_list":null,"created_at":"Wed May 12 05:35:36 UTC 2010","updated_at":"Wed Oct 10 13:35:41 UTC 2012","overview":"<p>Luc Leroy is an engineer and entrepreneur living in the San Francisco Bay Area, California.</p>\n\n<p>Luc Leroy was co-founder of Semaphora, one of the first companies to provide a realtime, interactive 3D solution for the Internet. </p>\n\n<p>Luc started is career in 1994 in Paris, France as a software engineer where he worked on Artlantis Render, one of the first realtime ray tracers. Then he became associate and engineering manager at Digimedia Interactive where he developed breaking edge realtime animation systems using motion capture and video broadcasting. He resigned in 1999 while he disagreed with the executive management of the company and founded Semaphora.</p>\n\n<p>When the market collapsed in 2002 Luc was driving a small software company (Ultra Pimiento, also known on the Web as &#8216;the hackers group&#8217;). \nThen he joined Francois Lemasne who was founding Okyz and prototyped the first Capture 3D application on DirectX then OpenGL. Luc was still acting as director of software architecture when Adobe acquired Okyz in December 2004.\nLuc is currently an engineering manager at Adobe Systems.</p>\n\n<p>Known for designing strong technologies Luc filed several key patent applications, at this day half of them have been issued. Most architectures he designed and implement are still used by major software companies today.</p>\n\n<p>In addition to be involved in different startups, Luc is also an amateur wine maker and car racing entusiast (several championships) who&#8217;s worked for the race car industry (Porsche, SportDrive, Renault, Ferrari) taking advantage of his skills in both software and mechanical design. </p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0008/6868/86868v2-max-150x150.jpg"],[[80,80],"assets/images/resized/0008/6868/86868v2-max-250x250.jpg"],[[80,80],"assets/images/resized/0008/6868/86868v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BS","subject":"computer Science","institution":"Paris XIII University","graduated_year":1994,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}