{"first_name":"Lucian","last_name":"Tarnowski","permalink":"lucian-tarnowski","crunchbase_url":"http://www.crunchbase.com/person/lucian-tarnowski","homepage_url":"http://www.BraveNewTalent.com","birthplace":"UK","twitter_username":"","blog_url":"http://LucianTarnowski.com/blog","blog_feed_url":"","affiliation_name":"BraveNewTalent","born_year":1984,"born_month":1,"born_day":4,"tag_list":"lucian-tarnowski-bravenewtalent-com-one-young-world-brave-new-talent-take-heart-india-india-generation-y","alias_list":null,"created_at":"Thu Apr 09 19:30:35 UTC 2009","updated_at":"Thu Feb 02 04:36:31 UTC 2012","overview":"<p>Lucian is Founder and CEO of BraveNewTalent.com, the platform that builds online communities around education and employment. He is on a mission to democratise professional education through a peer to peer model of learning via online communities.</p>\n\n<p>He has been honoured as Europe’s youngest Young Global Leader (YGL) by the World Economic Forum.  He is also winner of the Global Enterprising Young Brit of 2009.  He was named as one of Britain’s rising business stars by The Spectator Business and is on the UKTI (UK Trade and Investment’s) Global Entrepreneur Program with BraveNewTalent being described by the UK Government as a “Technology Company of Exceptional Potential”.</p>\n\n<p>Lucian has experience of using social media to build online communities around youth leadership. In 2010 he led the social media outreach for  One Young World - An initiative to give young people a place to engage and have their voices heard about their future. BraveNewTalent successfully engaged over 100,000 young people from more than 140 countries without any advertising budget.</p>\n\n<p>Lucian has a long association to India and is a youth advisor for Next Generation India on the Board of the UK India Business Council. In his spare time he runs Take Heart India, a no overheads charity that provides blind and handicapped students in rural India with the IT and employment skills that guarantee them a job for life. Lucian speaks to audiences around the world about the phenomenal change that is taking place around how we work, learn and communicate.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0004/0727/40727v6-max-150x150.jpg"],[[166,250],"assets/images/resized/0004/0727/40727v6-max-250x250.jpg"],[[300,450],"assets/images/resized/0004/0727/40727v6-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO & Founder","firm":{"name":"BraveNewTalent","permalink":"bravenewtalent","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0007/8735/78735v5-max-150x150.jpg"],[[250,57],"assets/images/resized/0007/8735/78735v5-max-250x250.jpg"],[[450,103],"assets/images/resized/0007/8735/78735v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/luciantarnowski","title":"TWITTER"}]}