{"first_name":"Lucy P.","last_name":"Marcus","permalink":"lucy-marcus","crunchbase_url":"http://www.crunchbase.com/person/lucy-marcus","homepage_url":"http://marcusventures.com","birthplace":"","twitter_username":"lucymarcus","blog_url":"http://www.marcusventures.com/notebook","blog_feed_url":"","affiliation_name":"Mobius Life Sciences Fund","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Fri Mar 04 08:36:27 UTC 2011","updated_at":"Fri May 04 02:49:07 UTC 2012","overview":"<p>Lucy is the founder and CEO of Marcus Venture Consulting, Ltd. Committed to fostering sustainable success for funding organisations, Marcus Venture Consulting works with venture capital and private equity funds, institutions and corporations to build strong funding businesses. She is also Professor of Leadership and Governance at IE Business School focusing on corporate governance, ethics and leadership. Lucy writes an opinion column and has a tv show “In the Boardroom with Lucy Marcus” for Reuters on the intersection of boards and leadership.</p>\n\n<p>Lucy serves as non-executive chair of the Mobius Life Sciences Fund, chair of the Mobius Life Sciences Fund Investment Panel, and is non-executive director and chair of the board audit committee of BioCity Nottingham. She is a CIBAM Cambridge Associate at the University of Cambridge’s Centre for International Business and Management (CIBAM). She is co-founder, judge and served as chair of the board of the Aspen Institute Energy and Environment Awards, and is a member of the international advisory board of the IE Business School. She is the co-founder and chair of “Leadership in Conflict” which develops leaders in conflict and post-conflict zones and also applies those lessons to leading in some of the most challenging environments, sectors, and spaces in the world, from health care to boardrooms. Lucy is a regular contributor to Harvard Business Review, BusinessWeek, Huffington Post, CSRWire, and other global publications, writing on boards, leadership, ethics and innovation.</p>\n\n<p>Lucy served as an independent non-executive director and treasurer on the board of the International Step-by-Step Association (ISSA). She served on the advisory board of the University of Cambridge’s Judge Business School, was a fellow at the Judge Business School and was a non-executive director and board treasurer and fellow of the British-American Project. She also served on the board of the Wellesley College Business Leadership Council. Lucy is also the chair of The Global Task Force on Building Women Leaders, and the founder of HighTech Women.</p>\n\n<p>Bringing a 360 degree perspective, Lucy has worked in a number of sectors from software development and the internet to government and financial services. Prior to founding Marcus Venture Consulting, Lucy was co-founder and VP of Marketing and Sales of an enterprise management software company, she was responsible for EMEA Marketing and Business Development at Infinity Financial Technologies, ran the EMEA operations of a communications consulting company, and worked at Price Waterhouse in the East European Services Division and at the US Treasury Department’s Economic Policy Division.</p>\n\n<p>Lucy was awarded the 2011 Thinkers 50 “Future Thinkers Award”, was voted one of 6 of “Britain’s Best Connected Women” in the UK Institute of Directors’ Director Magazine, and was ranked 19th in the Reuters &amp; Klout 50 “Most Influential Execs on the Web”. Named as a World Economic Forum Global Leader for Tomorrow, she was the recipient of the Yale University “Rising Star of Corporate Governance” Award, and was selected for one of the 2011 National Association Corporate Directors (NACD) Directorship 100 lists. She is a fellow of the Aspen Institute Crown Fellowship Program and a fellow of the British-American Project. She was selected to take part in the BMW Foundation Transatlantic Forums, and the Council of the United States and Italy’s Young Leaders Forum. Lucy was voted one of the most influential voices on Twitter of 2011 &amp; 2012 in The Independent Newspaper, was ranked 43rd of the “Most Powerful Britons on Twitter” in 2010, and has been shortlisted for a 2012 Shorty Award in Finance. Lucy was featured as “Director of the Month” in Director Magazine, was listed as a “face to watch” in Management Today Magazine’s list of Britain’s 50 Most Powerful Women, and in Business Age Magazine’s “10 Women Changing the Direction of British Business”. She serves on the Steering Committee for The Wall Street Journal Task Force on Women in the Economy.</p>\n\n<p>A regular speaker on global economic trends and best practices for corporate governance leadership, private equity, venture capital, entrepreneurship, technology, and women in business, Lucy is frequently quoted in the press, including the New York Times, the Wall Street Journal, the Financial Times, the International Herald Tribune, Newsweek, Reuters, Forbes, Investment Dealers’ Digest, Les Echos, the Guardian, Globes, The Korean Times, Financial News, and Venture Capital Journal. She has been profiled in the Financial Times, Tornado-Insider Magazine, and Lynne Franks’ Seedfusion. Lucy has appeared on CNBC, Sky Business Report, and BBC World Service; her articles have been published in Mediaite and Management Today Magazine, amongst others. She was also profiled in the book “Powerful Women: Dancing on the Glass Ceiling” (Wiley 2001), and contributed to “Women in the New Economy: A Regional Perspective” (The Smith Institute 2001). </p>\n\n<p>A dual American and British citizen, Lucy holds a B.A. from Wellesley College (Wellesley, Massachusetts) and an M.Phil. from the University of Cambridge (Cambridge, England). </p>","image":{"available_sizes":[[[150,147],"assets/images/resized/0012/4959/124959v1-max-150x150.jpg"],[[250,245],"assets/images/resized/0012/4959/124959v1-max-250x250.jpg"],[[450,442],"assets/images/resized/0012/4959/124959v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"Political Science & History","institution":"Wellesley College","graduated_year":1993,"graduated_month":null,"graduated_day":null},{"degree_type":"M.Phil. ","subject":"Political Theory and Intellectual History","institution":"University of Cambridge ","graduated_year":1996,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Non-Executive Board Chair","firm":{"name":"Mobius Life Sciences Fund","permalink":"mobius-life-sciences-fund","type_of_entity":"company","image":null}},{"is_past":false,"title":"Non-Executive Director, Chair Board Audit Committee","firm":{"name":"BioCity Nottingham","permalink":"biocity-nottingham","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"<object type='application/x-shockwave-flash' data='http://www.reuters.com/resources_v2/flash/video_embed.swf?videoId=231749197&edition=BETAUS' id='rcomVideo_231749197' width='420' height='236.25'> <param name='movie' value='http://www.reuters.com/resources_v2/flash/video_embed.swf?videoId=231749197&edition=BETAUS'></param> <param name='allowFullScreen' value='true'></param> <param name='allowScriptAccess' value='always'></param> <param name='wmode' value='transparent'></param> <embed src='http://www.reuters.com/resources_v2/flash/video_embed.swf?videoId=231749197&edition=BETAUS' type='application/x-shockwave-flash' allowfullscreen='true' allowScriptAccess='always' width='420' height='236.25' wmode='transparent'></embed> </object> ","description":""},{"embed_code":"<object type='application/x-shockwave-flash' data='http://www.reuters.com/resources_v2/flash/video_embed.swf?videoId=232125412&edition=BETAUS' id='rcomVideo_232125412' width='420' height='236.25'> <param name='movie' value='http://www.reuters.com/resources_v2/flash/video_embed.swf?videoId=232125412&edition=BETAUS'></param> <param name='allowFullScreen' value='true'></param> <param name='allowScriptAccess' value='always'></param> <param name='wmode' value='transparent'></param> <embed src='http://www.reuters.com/resources_v2/flash/video_embed.swf?videoId=232125412&edition=BETAUS' type='application/x-shockwave-flash' allowfullscreen='true' allowScriptAccess='always' width='420' height='236.25' wmode='transparent'></embed> </object> ","description":""},{"embed_code":"<object type='application/x-shockwave-flash' data='http://www.reuters.com/resources_v2/flash/video_embed.swf?videoId=232485472&edition=UK' id='rcomVideo_232485472' width='420' height='236.25'> <param name='movie' value='http://www.reuters.com/resources_v2/flash/video_embed.swf?videoId=232485472&edition=UK'></param> <param name='allowFullScreen' value='true'></param> <param name='allowScriptAccess' value='always'></param> <param name='wmode' value='transparent'></param> <embed src='http://www.reuters.com/resources_v2/flash/video_embed.swf?videoId=232485472&edition=UK' type='application/x-shockwave-flash' allowfullscreen='true' allowScriptAccess='always' width='420' height='236.25' wmode='transparent'></embed> </object> ","description":""}],"external_links":[],"web_presences":[{"external_url":"http://blogs.reuters.com/lucy-marcus","title":"Lucy P. Marcus on Reuters"}]}