{"first_name":"Luigi","last_name":"Scollo","permalink":"luigi-scollo","crunchbase_url":"http://www.crunchbase.com/person/luigi-scollo","homepage_url":"http://www.pettoysusa.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Pet Toys USA","born_year":1970,"born_month":3,"born_day":15,"tag_list":"pet-toys-usa--dog-pet-toys, cat-pet-toys, bird-pet-toys, reptile-pet-toys, made-in-the-usa","alias_list":null,"created_at":"Mon Oct 15 20:01:58 UTC 2012","updated_at":"Fri Nov 02 06:33:46 UTC 2012","overview":"<p>The emerging trend of pet parents has also brought about high demand for premium pet products and services. Since pets are often considered family members, pet owners frequently indulge them with all-natural and organic pet foods, treats and high quality plush toys, in addition to services such as grooming and day care.\nDuring the economic downturn, when consumers of all income levels tightened their belts, pet parents cut back on their personal discretionary spending first before spending less on their pets. \nAt Pet Toys USA we understand your love for your furry friends. That’s why we offer you nothing but the best quality merchandise for you and your furry companions. We represent the best product manufactures in the country with the highest quality customer service; and a life time of companionship with your furry family member. \nPet Toys USA takes tremendous pride in its quality control and customer satisfaction. When products are ordered, they are shipped!\nAlmost all Pet Toys USA sales professionals have spent years in the retail pet product field. Their product knowledge and retail pet experiences are invaluable resources to the customers they serve.\nThe Pet Toys USA Team industry professionals care. The management, sales, and support teams work hard every day to help improve the quality of life for you and your pets in the marketplace</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Owner","firm":{"name":"Pet Toys USA","permalink":"pet-toys-usa","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}