{"first_name":"Luis","last_name":"Chaparro","permalink":"luis-chaparro","crunchbase_url":"http://www.crunchbase.com/person/luis-chaparro","homepage_url":"http://www.getfrankly.com/","birthplace":"Colombia","twitter_username":"","blog_url":"http://luischaparro.tumblr.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1980,"born_month":1,"born_day":11,"tag_list":"","alias_list":null,"created_at":"Fri Apr 29 04:24:22 UTC 2011","updated_at":"Sat Jun 18 13:47:53 UTC 2011","overview":"<p>Luis Started his first company back in 2006. He loves to walk different paths and to discover some others.\nPassionate about design </p>\n\n<p>The brand was born in the middle of 2006, in Bogota-Colombia. Since the time I was studying to obtain my bachelor’s degree on industrial design, I had always have an enormous interest in screen printing techniques and its possibilities.\nBy the time I got my bachelor’s degree I decided to move on with the idea -driven by passion- I had in mind for a couple of years. Finally I was giving the step to design and produce some t-shirts, caps and put them out there in the market. That was one of the biggest decisions I made for my life because it makes me realize that this was something I wanted to do for the rest of my days.\nI decided to mix some of my passions. Back in 2006 some friend of mine introduced me to Ultimate Frisbee… it was something like love at first sight; it was the perfect excuse for me to give life to the brand.\nBrand beginnings were like a hobby, everything started small and suddendly grow bigger, things begun to move faster we had people coming into our website asking for products and here we are 3 years after, still rocking the market loving what we do.\nWe feel proud for the things we’ve done so far we know there’s a long and hard road to walk, but here we are facing everyday giants and giving every positive thing we have to satisfy our fans.</p>","image":{"available_sizes":[[[104,150],"assets/images/resized/0013/9785/139785v2-max-150x150.jpg"],[[174,250],"assets/images/resized/0013/9785/139785v2-max-250x250.jpg"],[[279,400],"assets/images/resized/0013/9785/139785v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://rebelsdefy.tumblr.com/","title":""}]}