{"first_name":"Luis","last_name":"Montalván","permalink":"luis-montalvn","crunchbase_url":"http://www.crunchbase.com/person/luis-montalvn","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Aug 16 14:15:10 UTC 2012","updated_at":"Sat Aug 18 01:31:50 UTC 2012","overview":"<p>Luis Montalván is a former Army soldier and current advocator for war veterans. He completed two tours with the Army before returning home. After active duty, he developed psychological and emotional problems, classified under Post-Traumatic Stress Disorder. Through the help of a service dog, Montalván regained well-being and now supports fellow servicemen. </p>\n\n<p>Montalván’s life goal was not always to serve in the military. After high school, he pursued Sociology at the University of Maryland, College Park. In addition to his coursework, he participated in the Reserve Officers’ Training Corps program (ROTC). Upon completing his studies, he decided to begin join the Army, partially due to ROTC’s impact.</p>\n\n<p>So, he opted to begin his basic training at Fort Knox, KY. The rigorous regiment trained him well for his military future. In addition to basic training, he also involved him in Pathfinder and Sapper. After basic training, he became available for active, international duty.</p>\n\n<p>Thus, in 2003, he was chosen to serve the country with its efforts in Iraq. During his time there, he acted as Tank leader and Scout Platoon leader. Additionally, he had many other duties, such as desert patrol. He was also chosen to assist in establishing the Al Waleed port-of-entry. Montalván, after his first tour ended, decided to proceed in order to another assignment Iraq.</p>\n\n<p>After his second assignment, Montalván experienced a common psychological and emotional change that many servicemen do. Post-Traumatic Stress Disorder affects many who’ve valiantly fought for the country. For Montalván, the only things he found healing were writing and his service dog, Tuesday.</p>\n\n<p>As such, Montalván began to write about his experienced in war and with PTSD. Until Tuesday recounts his many stories from his Iraq tours, and how Tuesday helped him heal. In addition, he has published several articles as well as made television appearances. Luis Montalván now fights for the right and health of his fellow veterans who’ve fought for our country.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/6383/206383v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/6383/206383v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/6383/206383v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}