{"first_name":"Luke","last_name":"Mackwitty","permalink":"luke-mackwitty","crunchbase_url":"http://www.crunchbase.com/person/luke-mackwitty","homepage_url":"http://www.poolsupply360.com/","birthplace":"California","twitter_username":"poolsonline","blog_url":"http://blog.poolsupply360.com/","blog_feed_url":"http://feeds.feedburner.com/poolsupply360/cuOz","affiliation_name":"Unaffiliated","born_year":1983,"born_month":12,"born_day":2,"tag_list":"pool-supply, pool-heaters, swimming-pool-heaters","alias_list":null,"created_at":"Wed Apr 25 11:05:34 UTC 2012","updated_at":"Fri May 04 03:59:49 UTC 2012","overview":"<p>Pool Supply 360 has successfully completed its 25 years of experience in the swimming pool areas of service, distribution, retail, commercial and e-commerce.  We proudly announce the launch of new range of swimming pool heaters.</p>\n\n<p>We are strongly founded and growing company located in Orange County, California for more than 20 years. We have many warehouses that help in reducing shipping lead times. We are proud to say that we offer the best technical support and installation in all the areas throughout the country.</p>\n\n<p>At Pool Supply 360, we are specialized in handling the biggest hurdle of consumers, the installation. We are able to do it as we have local technicians to handle your problems immediately.</p>\n\n<p>We, at Pool Supply 360, have now a range of pool heaters that buyers can make their own choices. Moreover, the added advantage of contacting us is that we offer complete support and technical assistance on finalizing the sale. In fact, we are very happy to announce that we are the legal warranty station for almost all the products that we sell. </p>\n\n<p>Pool Supply 360 has over 20 trucks in Orange County and we ensure happy shopping and perfect installation, anytime you need. So just think about us as the first stop, you will realize that you may not need to look beyond us.</p>\n\n<p>We, at Pool Supply 360 have all major brands pool heaters to support in ground pools and above ground pools. Your investment will serve your purpose as the pool heaters will work without any restriction all the year. With our pool heaters you can feel ensured of extending your swimming session.</p>\n\n<p>We have all the best and energy efficient pool heaters and our extensive selection covers a range of gas and propane pool heaters or even options like Millivolt, ASME, Cupro-Nickle Low NOx or huge commercial pool heaters. We offer everything you need and have every product as in stock. You can find pool heaters of Hayward, Pentair, Raypak, Jandy and Sta-Rite and also heat pumps.</p>\n\n<p>Pool heaters are a must and to understand varied heating options, click on ‘selecting the right heating option’. This will give you a clear picture of what you need. There are models such as H-series, Max-E-Therm, Hi-E and MasterTemp, all represent popular swimming pool heaters and we have all these products with us in stock.</p>\n\n<p>We ensure great prices, eco friendly pool heaters for your swimming pool. Take a leap confidently into your swimming pool as Pool Supply 360 ensures strong backing.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}