{"first_name":"Luke","last_name":"Wood","permalink":"luke-wood","crunchbase_url":"http://www.crunchbase.com/person/luke-wood","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"RIAA, Recording Industry Association of America","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 14 04:21:07 UTC 2009","updated_at":"Tue Oct 16 05:34:36 UTC 2012","overview":"<p>Luke Wood is President and Chief Operating Officer of Beats Electronics LLC, the parent company of Beats™ by Dr. Dre™ and Beats Audio™.  Bringing his experience as a music executive, marketing executive and musician, Wood joined Beats’ co-founders, renowned music executive Jimmy Iovine and legendary producer Dr. Dre, to create category-leading consumer products capable of reproducing the full spectrum of sound captured in professional recording studios.</p>\n\n<p>Prior to this appointment, Wood was Chief Strategy Officer of Interscope Geffen A&amp;M (IGA) and President of the imprint DGC Records. Wood oversaw the company’s traditional and digital business development, its emerging business and revenue, including 360 degree deals, and its operational strategy. </p>\n\n<p>As DGC President, Wood was responsible for all A&amp;R and marketing decisions as well as for developing and guiding the label’s artist roster, which featured some of the biggest names in rock, including Weezer, All American Rejects, Rise Against, and Yeah Yeah Yeahs, among many others. He was also the founder of Tiny Evil Records.</p>\n\n<p>Wood began his career with Geffen Records in 1991 as a Director of Publicity, representing such bands as Nirvana and Sonic Youth. He subsequently served as Geffen’s Director of Marketing, and later as Vice President of A&amp;R at DreamWorks Records. In 2003, Wood joined Interscope Records (as part of its merger with DreamWorks) as Executive Vice President of A&amp;R, having signed such artists as Jimmy Eat World, Elliott Smith and AFI. More recently at Interscope he developed label deals with Downtown Records and signed artists such as TV on the Radio, All Time Low and Yelawolf.</p>\n\n<p>Wood is also a lifelong producer, songwriter and musician.  He signed a publishing deal with Universal Music Group in 1996 and that same year his band, Sammy, released its third album, Tales of Great Neck Glory, on Geffen/DGC Records.</p>\n\n<p>Wood earned a Bachelor of Arts degree from Wesleyan University with a major in American Studies.</p>","image":null,"degrees":[{"degree_type":"BA","subject":"American Studies","institution":"Wesleyan University","graduated_year":1991,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Board of Directors","firm":{"name":"RIAA, Recording Industry Association of America","permalink":"riaa","type_of_entity":"company","image":{"available_sizes":[[[100,100],"assets/images/resized/0003/3773/33773v1-max-150x150.png"],[[100,100],"assets/images/resized/0003/3773/33773v1-max-250x250.png"],[[100,100],"assets/images/resized/0003/3773/33773v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Director of A&R","firm":{"name":"Dreamworks Records","permalink":"dreamworks-records","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}