{"first_name":"Lyle","last_name":"Fong","permalink":"lyle-fong","crunchbase_url":"http://www.crunchbase.com/person/lyle-fong","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Lithium Technologies","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Aug 09 05:07:39 UTC 2007","updated_at":"Tue May 04 18:30:26 UTC 2010","overview":"<p>Lyle is responsible for the strategic direction and corporate vision at Lithium. He assumed the role of CEO in December, 2006.</p>\n\n<p>Prior to starting Lithium Technologies, Lyle co-founded GX Media, where he was the CTO. He drove the development of Gamers.com, which was rated the #1 independent gaming portal by Nielsen NetRatings. Lyle was instrumental in raising a total of $15M in funding led by CMGI, negotiating multi-million dollar technology licensing deals with Dell, Sony, AltaVista, and Ziff-Davis, and spearheading the spin-off of Lithium Technologies. Lyle was also the driving force behind the creation of technologies for professional gaming, including a global rankings system, tournament engine, and a real-time match reporting and spectating system. These technologies were the key success factors behind the AMD PGL, the most successful and highly acclaimed professional gaming league to date with over 100 million media impressions, and also numerous tournaments for Sega.</p>\n\n<p>Before Lithium Technologies and GX Media, Lyle launched two other startups - a specialized computer services business which has since expanded into one of the largest ISPs in China and a software consulting business, NetStreams.</p>\n\n<p>Lyle studied at UC Berkeley, majoring in Computer Science, where he received the Hewlett-Packard Scholarship Award and National Youth Leadership Award.</p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0000/9454/9454v1-max-150x150.jpg"],[[80,80],"assets/images/resized/0000/9454/9454v1-max-250x250.jpg"],[[80,80],"assets/images/resized/0000/9454/9454v1-max-450x450.jpg"]],"attribution":null},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Strategist","firm":{"name":"Lithium Technologies","permalink":"lithiumtechnologies","type_of_entity":"company","image":{"available_sizes":[[[150,54],"assets/images/resized/0000/4156/4156v8-max-150x150.png"],[[165,60],"assets/images/resized/0000/4156/4156v8-max-250x250.png"],[[165,60],"assets/images/resized/0000/4156/4156v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}