{"first_name":"Lyn","last_name":"Mettler","permalink":"lyn-mettler","crunchbase_url":"http://www.crunchbase.com/person/lyn-mettler","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Step Ahead","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Feb 24 19:25:21 UTC 2010","updated_at":"Wed Feb 24 21:01:48 UTC 2010","overview":"<p>Lyn has worked in public relations and journalism in a variety of capacities for the past 11 years with a special interest in using the Web to market and increase awareness of her clients.</p>\n\n<p>She opened Mettler Public Relations in 2005, providing traditional public relations services to her myriad clients, including I’On Group, European tour company Breakaway Adventures, Wentworth Mansion, Cenegenics Carolinas, Charleston Parks Conservancy and more, securing coverage in media outlets such as USA Today, the New York Times, Delta’s Sky Magazine, Associated Press and Southern Living.</p>\n\n<p>In 2009, she merged Mettler Public Relations with Step Ahead Inc, a company she created to help clients strategically engage and manage social media tools, to combine the best of traditional public relations with the power of online technologies.</p>\n\n<p>Past public relations roles include serving as account director for E. Boineau &amp; Company, a marketing and public relations firm in Charleston, S.C., as well as media relations coordinator for Indiana University-Purdue University Indianapolis, where she secured coverage on CNN, the Weather Channel and in U.S. News &amp; World Report, and community relations coordinator for Borders Books &amp; Music in Indianapolis.</p>\n\n<p>Lyn also has extensive experience as a journalist for both print and television media. Currently a freelance writer, she has written for both Charleston-area and national publications that include Charleston Home, the Charleston Regional Business Journal, Island Memories, Executive Traveler, Private Air, Pregnancy, Dance Teacher and many more. She was formerly an editor for iParenting Media, which produced the national magazine, Family Energy, and an award-winning Web site for parents, iParenting.com. Lyn also worked in television news as a writer for both the Cincinnati and Indianapolis Fox affiliates and as a member of the production crew at WCBD, the NBC affiliate in Charleston, S.C.</p>\n\n<p>Lyn donates her time to assist with public relations for the annual Charleston Digital Corridor iFive:K run, the inaugural Charleston Marathon planned for 2010, as well as the MOMS Club of Mt Pleasant. She’s also served on the public relations committee for Dorchester Habitat for Humanity and provided public relations assistance to Pet Helpers, a local animal shelter. Lyn is active in the Public Relations Society of America, helped found Social Media Club Charleston and regularly speaks on the topic of social media and public relations to a variety of organizations throughout South Carolina. She was also named one of the Forty Under 40 top business leaders in Charleston in 2009 by the Charleston Regional Business Journal.</p>\n\n<p>Lyn holds a bachelor’s degree in public and corporate communications from Butler University in Indianapolis and a certificate in Web design from Purdue University. She currently lives in Mt. Pleasant, S.C., with her husband and two sons.</p>","image":null,"degrees":[{"degree_type":"Bachelor’s degree ","subject":"public and corporate communications","institution":"Butler University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"","firm":{"name":"Step Ahead","permalink":"step-ahead","type_of_entity":"company","image":{"available_sizes":[[[150,57],"assets/images/resized/0007/8121/78121v2-max-150x150.png"],[[250,96],"assets/images/resized/0007/8121/78121v2-max-250x250.png"],[[383,148],"assets/images/resized/0007/8121/78121v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}