{"first_name":"Lynn","last_name":"R. Rhodes","permalink":"lynn-r-rhodes","crunchbase_url":"http://www.crunchbase.com/person/lynn-r-rhodes","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Feb 20 14:11:36 UTC 2011","updated_at":"Sun Feb 20 14:13:30 UTC 2011","overview":"<p>Ms. Rhodes has over twenty years’ experience in banking finance and accounting.  She recently served as senior vice-president and chief financial officer of Fifth Third Bank, NA (Tennessee) where she also served as regional chief financial officer for Tennessee and Kentucky.  Her experience includes financial analysis, budgeting, forecasting, facilities management and regulatory oversight for all finance-related activities.  Prior to her tenure with Fifth Third Bank, she served as financial manager for Tennessee for AmSouth Bank and served in various positions, including controller positions for the corporate and trust and investment management divisions of First American National Bank prior to its merger with AmSouth.  Ms. Rhodes also served in various positions with Sovran/NationsBank for five years.  She is a 1987 graduate of the University of Tennessee at Knoxville where she earned a BS degree in Business Administration with a major in Finance.  She is a member of the Junior League of Nashville.  She and her husband Jeff live in Franklin. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Financial Officer ","firm":{"name":"Capstar Bank","permalink":"capstar-bank","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0012/3041/123041v1-max-150x150.png"],[[250,58],"assets/images/resized/0012/3041/123041v1-max-250x250.png"],[[258,60],"assets/images/resized/0012/3041/123041v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}