{"first_name":"Lyor","last_name":"Cohen","permalink":"lyor-cohen","crunchbase_url":"http://www.crunchbase.com/person/lyor-cohen","homepage_url":"http://www.wmg.com/management/lyorcohen","birthplace":"","twitter_username":"LyorCohen13","blog_url":"","blog_feed_url":"","affiliation_name":"Warner Music Group","born_year":1959,"born_month":10,"born_day":3,"tag_list":"warner-music-group","alias_list":null,"created_at":"Thu Jan 20 22:49:53 UTC 2011","updated_at":"Tue Feb 01 23:03:59 UTC 2011","overview":"<p>Lyor Cohen, Warner Music Group&#8217;s (WMG) Vice Chairman, Warner Music Group and Chairman and CEO, Recorded Music – Americas and the U.K., is responsible for all aspects of WMG&#8217;s U.S., U.K., Latin American and Canadian recorded-music operations, including the U.S. labels groups – The Atlantic Records Group and Warner Bros. Records; WEA Corp., the company&#8217;s sales, marketing and retail distribution company; and Rhino Entertainment, WMG&#8217;s catalog-marketing division.  Cohen joined the company shortly after Time Warner&#8217;s sale of WMG to an investor group led by Edgar Bronfman, Jr.</p>\n\n<p>Cohen was responsible for the restructuring of WMG’s Recorded Music division in 2004 and for leading the company’s transition from a physical to a digital music company. Between 2004 and 2008, under his leadership, WMG has consistently outperformed its music industry peers in Current and Overall Album share improvement and has had the No.1 label in the U.S. in three of the past four years. In 2007, WMG’s Recorded Music business grew from the fourth- to the third-largest in the world and, in both fiscal 2007 and fiscal 2008, achieved its highest album share in a decade.</p>\n\n<p>Prior to joining WMG, Cohen was head of Island Def Jam, where he led the growth and cultivation of its world-class roster of artists and record labels, including Def Jam, Island Records, Roc-A-Fella, Lost Highway, The Inc, American, Def Soul, Def Soul Classics to Roadrunner records which produced the multi-platinum Nickelback.</p>\n\n<p>Known for developing and guiding the careers of many early pioneers of rap music, including LL Cool J, Public Enemy, Run DMC, Kurtis Blow and the Beastie Boys,  Cohen is widely credited with expanding Island Def Jam beyond its hip-hop roots to include a wider range of musical genres. These top artists include Melissa Etheridge, Elvis Costello, Bon Jovi, Mariah Carey, Shania Twain, Ashanti, Everlast, Ryan Adams, Nickelback, Slipknot, Hoobastank, Sum 41 and Slayer.</p>\n\n<p>After becoming President of Def Jam records in 1988, a label founded by Russell Simmons and producer Rick Rubin, Cohen signed acts such as DJ Jazzy Jeff and the Fresh Prince, Eric B and Rakim, EPMD, Slick Rick and 3rd Bass to the label.  </p>\n\n<p>Prior to Def Jam, Cohen led the day-to-day operations at Rush Management, one of the most innovative and powerful rap and hip-hop management companies, which he founded with partner Russell Simmons.  Cohen joined Rush Entertainment as the road manager for Run DMC and eventually began managing all of the Rush acts on the first national rap tours, including the &#8220;Raising Hell&#8221; tour of 1986 featuring Run DMC and the Beastie Boys. Cohen and  Simmons were also partners in clothing enterprise Phat Farm.</p>\n\n<p>Cohen first became involved in the music business nearly two decades ago as a rap pioneer and concert promoter in Los Angeles, where he was one of the first to book and promote such acts as Social Distortion, Fear, Fishbone, Circle Jerks, Red Hot Chili Peppers and Run DMC.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0011/8285/118285v2-max-150x150.jpg"],[[106,160],"assets/images/resized/0011/8285/118285v2-max-250x250.jpg"],[[106,160],"assets/images/resized/0011/8285/118285v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Vice Chairman and Chairman and CEO, Recorded Music - Americas and the U.K.","firm":{"name":"Warner Music Group","permalink":"warner-music-group","type_of_entity":"company","image":{"available_sizes":[[[150,30],"assets/images/resized/0003/3761/33761v1-max-150x150.png"],[[250,50],"assets/images/resized/0003/3761/33761v1-max-250x250.png"],[[323,65],"assets/images/resized/0003/3761/33761v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://investing.businessweek.com/research/stocks/people/person.asp?personId=20759520&ticker=WMG:US","title":"Businessweek"},{"external_url":"http://people.forbes.com/profile/lyor-cohen/85377","title":"Forbes"},{"external_url":"http://www.retaggr.com/Page/LyorCohen","title":"Retaggr"},{"external_url":"http://www.ziggs.com/apps/profile/Contacts.aspx?uid=158944","title":"Ziggs"},{"external_url":"http://www.fastpitchnetworking.com/profile.cfm?ContactID=52405353","title":"Fastpitch"}],"web_presences":[{"external_url":"http://twitter.com/#!/LyorCohen13","title":"Twitter"},{"external_url":"http://www.linkedin.com/pub/lyor-cohen/25/a74/464","title":"LinkedIn"},{"external_url":"http://www.facebook.com/LyorCohen13","title":"Facebook"}]}