{"first_name":"M.","last_name":"Hutcheson Craig","permalink":"m-hutcheson-craig","crunchbase_url":"http://www.crunchbase.com/person/m-hutcheson-craig","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"YourMembership.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Mar 25 20:10:42 UTC 2011","updated_at":"Fri Apr 08 02:15:07 UTC 2011","overview":"<p>As YourMembership.com&#8217;s Chief Technology Officer and co-founder, Hutch leads the SaaS development team, managed services division and oversees the on-site network operation center of the company.</p>\n\n<p>Hutch previously worked with American Information Systems (AIS), the largest ISP in Chicago that was later acquired by Exodus Communications. There, as a software/systems engineer, he began his system administration and programming career just as the commercial Internet began. Hutch helped architect some of the first Microsoft ASP and Site Server based websites, and during his career at AIS he worked with Microsoft in conjunction with COMDEX to roll out the official release of Site Server. His backend systems and programming integration customers included: L&#8217;eggs, Sara Lee, Crain&#8217;s Chicago Business, the American Marketing Association and Follett Corp.</p>\n\n<p>Prior to YourMembership.com, Hutch co-founded DataGlyphics Inc. and served as the web development company&#8217;s chief software architect. With DataGlyphics, he guided the groundbreaking development of the original FlashPhotos.com application. In 2000, Hutch (and CEO Bill Stover) organized the spin off of another DataGlyphics creation, YourAlumni.com, into its own corporation, called YourMembership.com Inc.</p>\n\n<p>Hutch earned a bachelor&#8217;s degree in science from the University of Miami and holds MCSE, MCP, and MCP + Internet certifications from Microsoft.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CTO + Co-Founder","firm":{"name":"YourMembership.com","permalink":"yourmembership-com","type_of_entity":"company","image":{"available_sizes":[[[150,24],"assets/images/resized/0012/9200/129200v2-max-150x150.tiff"],[[250,41],"assets/images/resized/0012/9200/129200v2-max-250x250.tiff"],[[450,74],"assets/images/resized/0012/9200/129200v2-max-450x450.tiff"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}