{"first_name":"Maciej","last_name":"Skotniczny","permalink":"maciej-skotniczny","crunchbase_url":"http://www.crunchbase.com/person/maciej-skotniczny","homepage_url":"http://www.iif.pl","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Solidex","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Feb 24 11:35:28 UTC 2010","updated_at":"Wed Feb 24 20:08:22 UTC 2010","overview":"<p>Maciej Skotniczny is Senior Partner and VP Finance in Internet Investment Fund (IIF Group).</p>\n\n<p>Maciej Skotniczny cooperates with IIF SA since August 2006. First, he was a Financial Director and since July 2007, he is vice-president of the board of IIF SA. He also holds positions in boards of companies from the IIF Group and he is a member of the Investment Committee of the IIF SEED FUND. He was responsible for organizing and obtaining financing for the IIF SEED FUND, then for execution of the investment process and developing the fund’s portfolio, acting as member of the board and later an independent proxy for the company. As a member of the IIF Seed Fund Investment Committee he evaluated and opinioned financial and business assumptions of investment projects. </p>\n\n<p>At present, Maciej Skotniczny is the Vice-President of the Board of IIF SA, responsible for finances of the company and owner’s supervision over selected investment projects. </p>\n\n<p>In July 2008, Maciej Skotniczny successfully completed the Software Park project. The investment project located in the Special Economic Zone in Cracow was sold to the Vienna-based Europolis fund. Thanks to proper execution of the project and accurate timing, this project generated an above-average return on investment – IRR at the level of 177%.</p>\n\n<p>He gained his experience in managing and creating companies first as a specialist and then Representative of the Board of SOLIDEX SA in the years 1999-2004, and since 2004 as a consultant, partner and chief economist in the company Contract Consulting Sp. z o.o. (formerly Contract Consulting Kumela i Wspólnicy Sp.J.), where he held the position of president of the board, project manager and expert in key projects, he rendered consultancy services to many companies and organizations like  Telekomunikacja Polska S.A., KGHM S.A., City Hall of Warsaw, Agency for Industrial Development WSK &#8220;PZL RZESZÓW&#8221; S.A., PKN Orlen S.A., Poczta Polska and many others. </p>\n\n<p>Maciej Skotniczny is also the author or co-author of documentation and consultant to many investment projects, including several dozen co-financed by the EU (for both enterprises and local government units). He participated in the process of obtaining EU subsidies for some of the largest investment projects, which raised financing from EU structural funds (including the project to modernize the street Aleje Jerozolimskie in Warsaw). He has huge experience in raising funds from the EU, investment financing and the capital market. </p>\n\n<p>Maciej Skotniczny is a graduate of AGH University of Science and Technology in Cracow where he studied financial management. </p>","image":{"available_sizes":[[[106,142],"assets/images/resized/0007/8045/78045v2-max-150x150.png"],[[106,142],"assets/images/resized/0007/8045/78045v2-max-250x250.png"],[[106,142],"assets/images/resized/0007/8045/78045v2-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"master’s degree","subject":"financial management","institution":"AGH University of Science and Technology","graduated_year":1999,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Vice President","firm":{"name":"Internet Investment Fund (IIF)","permalink":"internet-investment-fund-iif","type_of_entity":"financial_org","image":{"available_sizes":[[[150,27],"assets/images/resized/0007/3666/73666v2-max-150x150.png"],[[250,46],"assets/images/resized/0007/3666/73666v2-max-250x250.png"],[[313,58],"assets/images/resized/0007/3666/73666v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Partner","firm":{"name":"Contract Consulting","permalink":"contract-consulting","type_of_entity":"company","image":null}},{"is_past":true,"title":"Representative of the Board","firm":{"name":"Solidex","permalink":"solidex","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}