{"first_name":"Madhu","last_name":"Yarlagadda","permalink":"madhu-yarlagadda-3","crunchbase_url":"http://www.crunchbase.com/person/madhu-yarlagadda-3","homepage_url":"http://yahoo.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Yahoo!","born_year":null,"born_month":null,"born_day":null,"tag_list":"yahoo, messenger, octel, mobile","alias_list":null,"created_at":"Wed May 14 04:31:55 UTC 2008","updated_at":"Thu Aug 19 10:23:15 UTC 2010","overview":"<p>Madhu Yarlagadda was most recently the Chief Development Officer of Skype.</p>\n\n<p>He was with Yahoo since 1999 and has held several key leadership positions. Currently he is the VP of Engineering for ICE (Integrated Consumer Experiences). He  leads the engineering effort for Yahoo! Home Page world’s most visited web page, MyYahoo, Buzz, Profiles, ToolBar, Mobile, Maps and Local. Most recently he led the effort to unite 35+ different code bases of Yahoo! home page for each of the different countries around the world into a single manageable code base.</p>\n\n<p>Before taking on this current role, Madhu was the VP of engineering for Yahoo communities (2003 to 2007) that included Yahoo! messenger, Voice (VoIP), Video, Flickr and Yahoo! Groups. In this role, he was instrumental in enabling Yahoo messenger to become the largest messaging client in the US, surpassing ICQ, AIM, MSN Messenger and Google Talk. </p>\n\n<p>Madhu started his career at Yahoo! in 1999 as the GM for Yahoo! Mobile (1999 to 2003). He was responsible for developing operations and management of Yahoo! Mobile strategy to extend Yahoo beyond the desktop.  Under his lead Yahoo! mobile grew to being the most popular mobile designation across 18 countries.</p>\n\n<p>Throughout his early career, Yarlagadda has held various senior technical and management positions at OcTel Communication Corporation, acquired by Lucent Technologies, and at OnLive Technologies where he worked on the world&#8217;s first virtual worlds, VoIP and real time web applications. He holds more than 15 patents spanning numerous engineering innovations.</p>\n\n<p>Prior to joining Yahoo, Madhu served as founder, president and CEO of MyQuest, Inc., a real-time messaging company acquired by Yahoo in 1999. Earlier in his career, Madhu also served as founder and CTO of ISSG, an enhanced telecommunications application provider. While at ISSG, Madhu was responsible for establishing successful relationships with major telecommunications providers such as Lucent Technologies, and he helped develop a large customer base which includes Airtouch, SBC, AT&amp;T, Bell Atlantic, SNET, USWest, Korea Telecom, Centennial, Global Telecom and Telesp. </p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0001/8557/18557v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0001/8557/18557v2-max-250x250.jpg"],[[450,300],"assets/images/resized/0001/8557/18557v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Chief Development Officer","firm":{"name":"Skype","permalink":"skype","type_of_entity":"company","image":{"available_sizes":[[[150,66],"assets/images/resized/0000/1387/1387v12-max-150x150.jpg"],[[250,110],"assets/images/resized/0000/1387/1387v12-max-250x250.jpg"],[[315,139],"assets/images/resized/0000/1387/1387v12-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"VP of Engineering, Yahoo! Messenger","firm":{"name":"Yahoo!","permalink":"yahoo","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0001/0836/10836v9-max-150x150.png"],[[226,81],"assets/images/resized/0001/0836/10836v9-max-250x250.png"],[[226,81],"assets/images/resized/0001/0836/10836v9-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://careers.yahoo.com/eprofiles.php?n=1&id=3","title":"Yahoo Employee Profile"}]}