{"first_name":"Mahesh","last_name":"Veerina","permalink":"mahesh-veerina","crunchbase_url":"http://www.crunchbase.com/person/mahesh-veerina","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 26 02:11:11 UTC 2009","updated_at":"Fri Jun 26 02:18:16 UTC 2009","overview":"<p>Mahesh is the founder and CEO of Azingo, Inc. Mahesh is a seasoned Silicon Valley entrepreneur and technology executive with over 18 years experience in the technology industry.</p>\n\n<p>Prior to Azingo, Mahesh was Vice President at Nokia Internet Communications for the small office products division. Mahesh has founded two successful technology companies over the last 10 years. Mahesh was the Founder, President and CEO of Ramp Networks, Inc. (NASDAQ: RAMP) from 1996-2001. Ramp Networks was a pioneer in the Internet access and security appliances for the small office and enterprise remote office market segments. Mahesh grew Ramp from a small technology startup to a publicly traded company with market capitalization of over US$450M.</p>\n\n<p>Nokia (NYSE: NOK) acquired Ramp Networks in 2001. Mahesh was founding CEO and Chairman of FlowWise Networks, Inc., an IP routing acceleration company from 1994-1997. Network Equipment Technologies (NASDAQ: NET) acquired FlowWise Networks in 1998. Early in his career Mahesh held several engineering and technology lead positions at Amdahl Corporation and Synoptics. Mahesh has also co-founded, advised, and served on the boards of several venture-backed technology startups in Silicon Valley. Mahesh has a MS degree in Computer Engineering from Purdue University, West Lafayette. He also holds a MS degree in Electronics from Andhra University, India.</p>","image":{"available_sizes":[[[100,133],"assets/images/resized/0005/0783/50783v1-max-150x150.jpg"],[[100,133],"assets/images/resized/0005/0783/50783v1-max-250x250.jpg"],[[100,133],"assets/images/resized/0005/0783/50783v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Azingo","permalink":"azingo","type_of_entity":"company","image":{"available_sizes":[[[150,70],"assets/images/resized/0005/0780/50780v1-max-150x150.png"],[[167,78],"assets/images/resized/0005/0780/50780v1-max-250x250.png"],[[167,78],"assets/images/resized/0005/0780/50780v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}