{"first_name":"Mahesh","last_name":"Ram","permalink":"mahesh-ram","crunchbase_url":"http://www.crunchbase.com/person/mahesh-ram","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"GlobalEnglish","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Mar 19 19:55:24 UTC 2011","updated_at":"Sun Sep 16 01:43:12 UTC 2012","overview":"<p>Mahesh Ram is the Chief Executive Officer of GlobalEnglish Corporation.  GlobalEnglish is the global leader in providing a cloud-based, SaaS solution for improving Business English communications at the world&#8217;s leading global companies.   GlobalEnglish customers include over 450 of the world&#8217;s largest companies including IBM, P&amp;G, HP, Pfizer, China Construction Bank, Saudi Aramco, etc.   </p>\n\n<p>Mahesh has more than 20 years of US and international experience in executive management, working in both venture-backed early stage companies and leading global multinationals.  As CEO, Mahesh has led GlobalEnglish to record revenues and continuous profitability while dramatically expanding the Company&#8217;s product offerings to its customers via mobile and social platforms.  </p>\n\n<p>In July 2012, Mahesh led the Company through a successful acquisition by Pearson PLC (UK:PSON), the world&#8217;s largest education and publishing company.  Prior to the acquisition, Mahesh also served as a member of the GlobalEnglish Board of Directors.</p>\n\n<p>Prior to becoming CEO at GlobalEnglish, Mahesh served in a unique array of roles, spanning both Sales and Product leadership.</p>\n\n<p>As EVP of Product Development for GlobalEnglish, he directed the development of the Company&#8217;s innovative GlobalEnglish Suite including the critically acclaimed Bloom social collaboration platform and LinGo mobile platform.  Under his leadership, the product team pivoted to an Agile development model rapidly, and delivered 5 major releases in one year (all ahead of schedule) thereby dramatically transforming the Company&#8217;s competitive position in the marketplace.  </p>\n\n<p>Prior to that role, Mahesh served as EVP of Corporate Sales for the Company for nearly 10 years, where he built the global direct sales force and revenue stream from the Company&#8217;s inception (zero revenues) to a high growth, high profit, enterprise software leader in its space.   This included building a direct salesforce in over 20 countries including the U.S., China, Brazil, India, and EMEA.  </p>\n\n<p>Prior to joining GlobalEnglish, Mahesh held C-level positions with the Thomson Corporation (now ThomsonReuters) in the Tax Publishing and Learning divisions.  Prior to Thomson, he was Director of Online Search Services at CCH-LIS, a leading subsidiary of the CCH/Wolters Kluwer professional publishing group.</p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0013/0431/130431v2-max-150x150.jpg"],[[80,80],"assets/images/resized/0013/0431/130431v2-max-250x250.jpg"],[[80,80],"assets/images/resized/0013/0431/130431v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Executive Officer","firm":{"name":"GlobalEnglish","permalink":"globalenglish","type_of_entity":"company","image":{"available_sizes":[[[150,30],"assets/images/resized/0011/7016/117016v8-max-150x150.png"],[[250,50],"assets/images/resized/0011/7016/117016v8-max-250x250.png"],[[260,52],"assets/images/resized/0011/7016/117016v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}