{"first_name":"manish","last_name":"behera","permalink":"manish-behera","crunchbase_url":"http://www.crunchbase.com/person/manish-behera","homepage_url":"http://www.fugenx.com","birthplace":"bangalore","twitter_username":"manish","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1988,"born_month":11,"born_day":4,"tag_list":"","alias_list":null,"created_at":"Mon Jan 03 07:32:57 UTC 2011","updated_at":"Mon Jan 03 15:53:30 UTC 2011","overview":"<p>We are a professional mobile software applications development company providing high end solutions &amp; services for multiple applications for the most popular communicative device of today’s age, the iPhone, BlackBerry, Android, iPad,BADA, Symbian  and Windows. Defying all limitations to excellence, we go beyond merely developing customized applications for you. We extend ourselves to utilize our professional expertise in applying the knowledge of various SDKs, that builds a platform for an amazing range of advanced technologies, that could create wonders while enhancing the functionality of your iPhone and iPod touch or any other applications. We firmly believe our wide experience in smart phone Application Development.</p>\n\n<p>We have dedicated Smartphone application developers/Programmers, iPhone Application Developers and we allow you to choose and hire them exclusively to understand your project requirements and assist you execute the solutions. You can Hire iPhone Developer, Hire other smart phone Application Developer/Programmer to get started today. Also, learn more about iPhone 3GS Games/Mac Games Development and get going from this moment itself. We also provide customized iPad Application Development Services for Apple&#8217;s newly introduced device &#8220;iPad&#8221; which is also known as Apple iTampon or iPad Tablet PC. Development of iphone web applications and custom iPhone apps, iPod touch apps with the new iPhone OS 4.0 and iPhone SDK 4.0 beta shall truly be encouraging with this new version providing scope of interaction and better usage.\nOur global presence is there in London (UK), LA (USA), Bangalore (India).</p>\n\n<p>For more details you can visit us: www.fugenx.com \nEmail us your requirement now and get a FREE Quote in next 24Hrs: info@fugenx.com\nPh: 1-213-995-8091</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.fugenx.com","title":"FUGENX"}]}