{"first_name":"Manish","last_name":"Kumar","permalink":"manish-kumar-9","crunchbase_url":"http://www.crunchbase.com/person/manish-kumar-9","homepage_url":"http://www.kotaksecurities.com/home/index.html","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Kotak Securities","born_year":null,"born_month":null,"born_day":null,"tag_list":"kotak-securities, kotak-securities-managment, kotak-head-of-hr, manish-kumar, manish-kumar-kotak","alias_list":null,"created_at":"Wed Jan 11 07:16:47 UTC 2012","updated_at":"Fri Jan 13 22:13:41 UTC 2012","overview":"<p>Manish Kumar is the Executive Vice President and Head of Human Resources (HR) at Kotak Securities Ltd. – India’s leading stock brokerage firm from the Kotak Mahindra Group. Kotak Securities is an industry leader in Retail Broking (Equities and other financial products) and Depository Services business.</p>\n\n<p>Manish has been a part of the Kotak Group since 2007, but he comes with an overall industry experience of almost 19 years in the field of human resources. Prior to taking up the position as Head of Human Resources, Manish was associated with Steel Authority of India Limited (SAIL) and Philips Electronics India Limited.</p>\n\n<p>Manish started his professional years with SAIL, working as a Shop Floor Personnel Manager from 1991 to 1993. After a 2 year break to pursue his MBA, Manish joined Philips in the year 1995. He moved up the professional ladder to become the Director of Human Resources (HR) – Consumer Electronics and People Services. He held this position briefly, only to take up his current position at Kotak Securities.</p>\n\n<p>At Kotak Securities, Manish has implemented a lot of processes and seen the scenario evolve. Reading is his passion and he applies a lot of what he learns to his professional environment  </p>\n\n<p>Manish Kumar holds a Bachelors Degree in Science – Geology (B.Sc – Geology). He has also done his Masters in Applied Geology from Indian Institute of Technology - Bombay (IIT – Bombay) – India’s premier graduate school. He also dons a post graduate diploma in Personnel Management and Industry Relations from XLRI, Jamshedpur, India – one of India’s top B Schools. </p>","image":null,"degrees":[{"degree_type":"MBA, HR","subject":"Human Resources","institution":"XLRI Jamshedpur","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Executive Vice President & Head of Human Resource","firm":{"name":"Kotak Securities","permalink":"kotak-securities","type_of_entity":"company","image":{"available_sizes":[[[150,62],"assets/images/resized/0011/4911/114911v4-max-150x150.jpg"],[[250,103],"assets/images/resized/0011/4911/114911v4-max-250x250.jpg"],[[397,165],"assets/images/resized/0011/4911/114911v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://blog.timesjobs.com/2009/09/employee-recognition-programs-work-if-managed-effectively-manish-kumar-sr-vp-hr-head-kotak-securities/","title":"Manish Kumar Featured on Times Job"}],"web_presences":[]}