{"first_name":"Mantis","last_name":"Evar","permalink":"mantis-evar","crunchbase_url":"http://www.crunchbase.com/person/mantis-evar","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Indaba Music","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Dec 25 18:34:06 UTC 2007","updated_at":"Thu Dec 11 02:16:42 UTC 2008","overview":"<p>As a musician Mantis has performed live with Stevie Ray Vaughn and Joey DeFrancesco. While home he acted as studio manager for TKO Recording Studios until he eventually set his focus on live sound where he has worked with Dr. Billy Taylor and Freddie Hubbard.</p>\n\n<p>As audio consultant for Sam Ash Music, Mantis has designed and maintained sound systems for many New York City hotspots including the Limelight, Palladium and The Tunnel as well as live systems used by Metallica and Guns &#8216;N&#8217; Roses. After a few years at Capitol Records working with Beastie Boys, Butthole Surfers, Yoko Ono and Jon Spencer Blues Explosion, Mantis transferred to Blue Note Records where his list of credits grew to include Joe Chambers, Ron Carter, Joe Lovano, Pat Martino and Chucho Valdes. During a two-year residence at hallowed jazz shrine Village Vanguard, Evar recorded jazz greats such as Martial Solal, Greg Osby, Jim Hall, Bill Charlap, Bill Frisell, the Chucho Valdes Quartet and many others.</p>\n\n<p>A musical dedication by trumpeter Erik Truffaz whose recording titled Mantis has been released internationally. &#8220;A man like this music, arms wide open, to embrace the world and take it somewhere else.&#8221; Joel Bastard (writer, poet. publication: &#8216;Beule&#8217;, Gallimard)</p>\n\n<p>Mantis currently operates the Indaba Music Studio and is in partnership with Indaba Music, an online music collaboration service that allows musicians to post files of their work, listen to other musicians&#8217; posts and create sessions where multiple parties can collaborate on a specific project. Associated with professional and independent artists, Indaba Music supports all genres of music and can be found at www.indabamusic.com.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder","firm":{"name":"Indaba Music","permalink":"indabamusic","type_of_entity":"company","image":{"available_sizes":[[[150,31],"assets/images/resized/0000/2908/2908v3-max-150x150.jpg"],[[250,52],"assets/images/resized/0000/2908/2908v3-max-250x250.jpg"],[[450,94],"assets/images/resized/0000/2908/2908v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}