{"first_name":"María","last_name":"Paz Gillet","permalink":"mara-paz-gillet","crunchbase_url":"http://www.crunchbase.com/person/mara-paz-gillet","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Happyshop","born_year":null,"born_month":null,"born_day":null,"tag_list":"mobile-marketer, ecommerce, latam, chile, retail, digital-expert, marketing, digital, mobile, mcommrce, shopkick","alias_list":null,"created_at":"Thu Sep 01 19:27:42 UTC 2011","updated_at":"Thu Nov 24 07:20:01 UTC 2011","overview":"<p>Professional and Entrepreneur with strong digital background. \nOver 11 years of experience in E-Business for leading companies. (E-Commerce, E-Sevices, E-marketing and strategic new business development).</p>\n\n<p>Digital &amp; Mobile Retail Expert.</p>\n\n<p>Especialidades\nMobile Marketing, Mobile Commerce, E-Commerce, Digital Marketing, Multi-channel strategy, Behavioral Targeting, Business Management, Marketing Strategy, Business Planning, Start-up Development, Web 2.0, Merchandising Strategy, Social Shopping, Consumer Generated Content, Interactive Marketing, Social Media Optimization.</p>\n\n<p>Experiencia</p>\n\n<p>VP Product &amp; Co-Founder\nHappyShop\nPrivately Held; Marketing and Advertising industry\nJanuary 2011 – Present (10 months)</p>\n\n<p>Leading a passionate and talent product development team building the next level (Mobile) Shopping Experience.</p>\n\n<p>Create and Lead the product strategy and plans, including product development, product marketing and business development</p>\n\n<p>About the company:</p>\n\n<p>HappyShop is a Mobile Location Based In-Store start-up, aiming to resolve inefficiency in the last mile digital marketing space (Digital in the Real world) and to prepare brands for the new consumer behavior. (Smartconsumer)</p>\n\n<p>Founded in early 2011 and developed by accomplished Digital Marketing, Retail, BI and CPG executives, with over 25 combined years experience.</p>\n\n<p>HappyShop provides a technology platform to merchants/Retail businesses and CPG looking to connect to consumers with Social, Mobile and location-targeted content.</p>\n\n<p>Happyshop mission is to connect brands &amp; retailers loyal shoppers with the products and promotions they sell, based on the specific interests, location, and preferences of their customers, in real-time. Our team is creating an environment that enables communication to increase the impact of advertising. (Giving RELEVANCE)</p>\n\n<p>We help brands to make SmartMarketing to adapt to the New Consumer.</p>\n\n<p>HappyShop was the recipient of Innova Chile&#8217;s price and has also earned a government sponsored grant, allowing the start-up to attract the interest of various early stage investors and recently received important capital in series A funding.</p>\n\n<p>We are hiring! We seek only the best and passionate talent to join our seasoned team to further develop our value proposition in the LATAM market.</p>\n\n<p>You want be a Betatester? Register at www.happyshop.mobi\nInnovation Director &amp; Digital Development\nCencosud S.A.\nPrivately Held; Retail industry\nDecember 2009 – December 2010 (1 year 1 month)</p>\n\n<p>My principle function was to define the guidelines and basis used to generate the digital strategy of every business of all the business units of this retail.</p>\n\n<p>Including:</p>\n\n<ul>\n<li><p>Digital Evangelist: Proposing, promoting and facilitating the inclusion of new communication technologies (online advertising, social media, mobile, etc.) and e-commerce for all Cencosud businesses.</p></li>\n<li><p>Creating conditions, structures, and tools to adapt more quickly to increasingly digitally active and multichannel clients. </p></li>\n<li><p>Finding opportunities for innovation and anticipating what will commonly impact consumers and sales channels, especially digital.\nE-Business &amp; Digital Marketing Director\nCencosud\nPrivately Held; Retail industry\nOctober 2002 – December 2009 (7 years 3 months)</p></li>\n</ul>\n\n<p>Business Lead for Paris.cl (Mass Merchant), Jumbo.cl (Groceries) and Easy.cl (Home Improvement). \nAnd Interactive Marketing Strategy for this online retail.\nMaria Paz tiene 1 recomendación (1 persona a su cargo) como:\n1º Bernardo Acoria Gonzalez, Jefe de Venta Telefónica Gerencia Corporativa Comunicacion Digital y Medios Digitales, Cencosud\nFounder\nChilearte.com\nInternet industry\nOctober 1999 – October 2002 (3 years 1 month)</p>\n\n<p>Founder of the first virtual art gallery in Chile in 1999</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0016/3629/163629v2-max-150x150.jpg"],[[200,200],"assets/images/resized/0016/3629/163629v2-max-250x250.jpg"],[[200,200],"assets/images/resized/0016/3629/163629v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder & President","firm":{"name":"Happyshop","permalink":"happyshop","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0015/3562/153562v2-max-150x150.png"],[[250,83],"assets/images/resized/0015/3562/153562v2-max-250x250.png"],[[450,150],"assets/images/resized/0015/3562/153562v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}