{"first_name":"Marc","last_name":"Woodward","permalink":"marc-woodward","crunchbase_url":"http://www.crunchbase.com/person/marc-woodward","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Nov 22 13:59:48 UTC 2008","updated_at":"Sat Nov 22 14:02:02 UTC 2008","overview":"<p>Marc joined Neo Technology Ventures in 2004 and has more than a decade of commercial experience with top-tier firms in the venture capital, investment banking, and consulting industries in the US and Australia. Throughout his career, Marc has been involved in early-stage and growth investment transactions and as a Director and Board Observer, he has helped guide numerous start-up and emerging technology companies. </p>\n\n<p>Marc led Neo&#8217;s investments in and is a Director of SigNav, Genbook, and Open Kernel Labs. Marc also led Neo&#8217;s investment in RPO and is an Observer on the company&#8217;s Board of Directors. Marc travels extensively in the United States and more recently China in support of the Neo portfolio, and has built an extensive fundraising, service provider, and business development network. Prior to Neo, Marc was an Associate Director with the Australasian Media &amp; Communications Fund (AMCF), a $120M growth stage venture capital fund in Sydney. While at AMCF, Marc led the firm&#8217;s investment in Peregrine Semiconductor Corp  and subsequently served on the company&#8217;s Board of Directors.  </p>\n\n<p>Previously, Marc was a Senior Associate at Battery Ventures, a US$2B venture capital fund in Silicon Valley, where he helped direct investments in the communications industry. Marc co-led Battery&#8217;s wireless industry investment strategy and helped direct the firm&#8217;s investment in Airespace, a leading provider of enterprise wireless infrastructure. Airespace was acquired by Cisco Systems (NASDAQ: CSCO) for approximately US$450 million in 2005. Marc also led Battery&#8217;s investment in E*Offering, which was acquired by Wit Capital Group for approximately US$330 million in 2000. Marc also contributed to Battery’s investment in Aurora Networks and subsequently served as an observer on the Board of Directors. </p>\n\n<p>Previously, he was a Technology Research Analyst with Wells Fargo Van Kasper, an investment banking firm in San Francisco, where he analyzed public and private companies in the communications industry. Prior to that, he was a Consultant in the Telecommunications Group of Accenture. Marc graduated from Georgetown University (Washington DC) with a Bachelor of Science degree with major concentrations in Finance and International Business. </p>\n\n<p>Marc has specific interest in Internet, Mobile, and Cleantech investment opportunities. </p>\n\n<p>Contact: marc.woodward@ntfund.com </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Neo Technology Ventures","permalink":"neo-technology-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[102,95],"assets/images/resized/0002/9228/29228v1-max-150x150.jpg"],[[102,95],"assets/images/resized/0002/9228/29228v1-max-250x250.jpg"],[[102,95],"assets/images/resized/0002/9228/29228v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}