{"first_name":"Marc-Antoine","last_name":"Benglia","permalink":"marc-antoine-benglia","crunchbase_url":"http://www.crunchbase.com/person/marc-antoine-benglia","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue May 27 17:56:35 UTC 2008","updated_at":"Tue May 27 19:18:30 UTC 2008","overview":"<p>Marc-Antoine Benglia is co-founder, President and Chief Executive Officer of Axentra Corporation. Before joining Axentra&#8217;s Executive team in the spring of 2003, Marc-Antoine served as Chairman and President of Hemera Technologies Inc., a leading digital image content provider and digital image management tools developer he co-founded in 1997. During his tenure at Hemera, Marc-Antoine established one of the largest collections of digital images in the world, amassing more than 1.5 million digital image files sold through web, catalog and retail channels worldwide.</p>\n\n<p>Prior to co-founding Hemera, Marc-Antoine occupied a managerial position in the European Public Relations Department of Corel Corporation and served as Director of Sales and Marketing at G&amp;A Imaging Ltd., a developer of business-to-business software.</p>\n\n<p>Marc-Antoine actively participates on the boards of several Canadian high technology companies and not-for-profit organizations.</p>\n\n<p>A Harvard Business School OPM graduate (Harvard University, Boston, Mass), Marc-Antoine also holds a Masters Degree in International Affairs from the Norman Paterson School of International Affairs (Carleton University, Ottawa, Canada), and a Bachelor of Arts in Political Science from Université Laval (Québec, Canada).</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President and Chief Executive Officer","firm":{"name":"Axentra","permalink":"axentra","type_of_entity":"company","image":{"available_sizes":[[[150,46],"assets/images/resized/0001/9450/19450v1-max-150x150.png"],[[209,65],"assets/images/resized/0001/9450/19450v1-max-250x250.png"],[[209,65],"assets/images/resized/0001/9450/19450v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}