{"first_name":"Marc","last_name":"Gottschalk","permalink":"marc-gottschalk","crunchbase_url":"http://www.crunchbase.com/person/marc-gottschalk","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Aug 20 10:42:52 UTC 2011","updated_at":"Sat Aug 20 10:51:49 UTC 2011","overview":"<p>Proterra’s Chief Business Development Officer and General Counsel Marc Gottschalk is focused on accelerating Proterra’s transit bus business. Having served as co-chair of the Energy and Clean Technology practice at Silicon Valley powerhouse law firm Wilson Sonsini Goodrich and Rosati (WSGR) prior to joining Proterra, Mr. Gottschalk has tremendous insight to help Proterra accomplish the company’s overall business mission.<br/>\nMr. Gottschalk, named a California Superlawyer by Law and Politics Magazine from 2006-2010, is one of a small inner circle in Silicon Valley who pioneered the U.S. cleantech sector and helped shape it into a new driver for global innovation and economic growth. WSGR’s cleantech practice has helped dozens of innovative cleantech companies, including Proterra, go to market since 2003. Mr. Gottschalk is also a co-founder of the Cleantech Open, the world leading organization that provides all the resources inventors and entrepreneurs need to take their cleantech innovations from concept to operating business. Mr. Gottschalk continues to be a California-based advisor to WSGR and remains on the board of the Cleantech Open.</p>","image":null,"degrees":[{"degree_type":"Bachelor of Arts","subject":"","institution":"Grinnell College","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chief Business Development Officer and General Counsel","firm":{"name":"Proterra","permalink":"proterra","type_of_entity":"company","image":{"available_sizes":[[[150,21],"assets/images/resized/0009/0076/90076v1-max-150x150.png"],[[250,36],"assets/images/resized/0009/0076/90076v1-max-250x250.png"],[[450,65],"assets/images/resized/0009/0076/90076v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}