{"first_name":"Marc","last_name":"Dulude","permalink":"marc-dulude","crunchbase_url":"http://www.crunchbase.com/person/marc-dulude","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Mar 02 05:13:15 UTC 2012","updated_at":"Fri Mar 02 05:13:35 UTC 2012","overview":"<p>Marc Dulude is responsible for setting the direction, culture and the evolution of the company and manages all aspects of Rand Worldwide’s group of companies. Prior to leading Rand Worldwide, Marc was a General Partner at Ampersand Ventures and has spent his career primarily in the field of engineering and product management. Prior to Ampersand, Marc was the Chief Executive Officer of Moldflow from 1996 to 2002 where he directed the company’s global operations and Initial Public Offering (IPO) of stock on the NASDAQ market, one of the top ranked IPO’s in 2000. Marc also held the position of Senior Vice President of Marketing and was a corporate officer at Parametric Technology Corporation (PTC), where he had the overall responsibility for product line management as well as the creation and dissemination of supporting marketing materials and activities. Marc has also held leading CAD/CAM/CAE and development management positions at Bell Northern Research (BNR), the research arm of Northern Telecom, and ICAM Technologies Corporation. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Executive Officer","firm":{"name":"RAND Worldwide","permalink":"rand-worldwide","type_of_entity":"company","image":{"available_sizes":[[[150,56],"assets/images/resized/0017/6643/176643v1-max-150x150.jpg"],[[189,71],"assets/images/resized/0017/6643/176643v1-max-250x250.jpg"],[[189,71],"assets/images/resized/0017/6643/176643v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}