{"first_name":"Marc","last_name":"Spilker","permalink":"marc-spilker","crunchbase_url":"http://www.crunchbase.com/person/marc-spilker","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Apollo Global Management, LLC ","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Aug 18 18:49:04 UTC 2011","updated_at":"Mon Nov 14 22:15:01 UTC 2011","overview":"<p>Marc Spilker  is currently President of Apollo Global Management, a multinational alternative assets management firm based in New York City.\nBorn and raised in Long Island, New York, he is a 1982 graduate of W.C. Mepham High School. He received a BSE (Bachelor of Science in Economics) from the Wharton School of the University of Pennsylvania in 1986. While at Wharton, he played lacrosse. In 1986, Spilker went to work for O’Connor and Associates, a Chicago derivatives trading house.</p>\n\n<p>In May 2010 after 20 years of distinguished service, Spilker retired from Goldman Sachs, a global investment banking and securities firm based in New York City. At the time of retirement, he was co-head of the Investment Management Division (IMD, consisting of Goldman Sachs Asset Management (GSAM) and Private Wealth Management (PWM). Spilker assumed the position in June 2008.</p>\n\n<p>Spilker joined Goldman Sachs in 1990 and was named partner in 1996. He was the head of Fixed Income, Currency and Commodities in Japan from 1997 to 2000. He joined IMD in 2006 as head of Global Alternative Asset Management. Previously, Spilker was responsible for U.S. Equities Trading and Global Equity Derivatives. He was a member of the firm-wide Management Committee and Business Practices Committee. He also served as Co-Chair of the IMD Operating Committee and Chair of the IMD Reputational Care Committee.</p>\n\n<p>Effective December 1, 2010, Spilker was appointed by Apollo Global Management to the newly created position of President. Spilker will run the day-to-day operations of Apollo and sit on the Company’s Executive Committee.</p>","image":{"available_sizes":[[[130,150],"assets/images/resized/0015/7653/157653v2-max-150x150.jpg"],[[216,250],"assets/images/resized/0015/7653/157653v2-max-250x250.jpg"],[[260,300],"assets/images/resized/0015/7653/157653v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President","firm":{"name":"Apollo Global Management, LLC ","permalink":"apollo-global-management-llc","type_of_entity":"financial_org","image":{"available_sizes":[[[150,60],"assets/images/resized/0022/0596/220596v1-max-150x150.png"],[[164,66],"assets/images/resized/0022/0596/220596v1-max-250x250.png"],[[164,66],"assets/images/resized/0022/0596/220596v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/marcspilker","title":"Marc Spilker Twitter "},{"external_url":"http://www.linkedin.com/in/marcspilker","title":"Marc Spilker LinkedIn "}]}