{"first_name":"Marc","last_name":"Meyer","permalink":"marc-meyer-2","crunchbase_url":"http://www.crunchbase.com/person/marc-meyer-2","homepage_url":"http://www.ey.com","birthplace":"","twitter_username":"marc_meyer","blog_url":"http://www.directmarketingobservations.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"digital-marketing, digital, social-media, web-2-0, marketing, e-commerce","alias_list":null,"created_at":"Wed Jan 26 20:13:37 UTC 2011","updated_at":"Thu Feb 03 07:36:53 UTC 2011","overview":"<p>Marc Meyer is currently the Digital and Social Media Strategist for Ernst and Young.</p>\n\n<p>Prior to joining E&amp;Y, he held positions ranging from web developer, internet marketing specialist, software sales., &amp; project manager, to positions of VP of sales &amp; marketing, Dir. of Internet marketing, Dir. of Social Media and SEO, to Dir. of e-commerce.</p>\n\n<p>Coupled with his tech background, my sales, marketing, and management background consisted of being one of the top sales people at CEI (Computer Enterprises Inc.) for almost 3 years. CEI is an app. development, integration and management services co. in which he generated over $9 million in revenue &amp; was consistently a leader in call volume, pipeline/ opportunities, lead generation, to training new hires, to closing sales. This resulted in quick advancement to EVP of sales &amp; marketing for a dot com startup.</p>\n\n<p>His social media blog can be found in the Adage Power 150, The top 5 of all social media marketing blogs ranked by Post Rank Analytics; and in the top 15 of the Junta 42 Content Marketing blogs list.</p>\n\n<p>He is the co-founder of HashTag Social Media which is a weekly Twitter based chat featuring the preeminent thought leaders of Social Media, Digital Marketing and Public Relations, discussing the business of Social Media and to date it has featured over 90 tweetchats on the business of social media.</p>\n\n<p>This past year, Marc won a Hermes creative award for co-creating a Twitter Town Hall on Healthcare, been recognized as one of the top social media strategists to look out for in 2010 and 2011, and has been voted one of the top 20 social media professionals to follow on Twitter</p>\n\n<p>http://www.ey.com\nhttp://www.directmarketingobservations.com\nhttp://www.hashtagsocialmedia.com</p>","image":{"available_sizes":[[[149,150],"assets/images/resized/0011/9127/119127v2-max-150x150.jpg"],[[249,250],"assets/images/resized/0011/9127/119127v2-max-250x250.jpg"],[[250,251],"assets/images/resized/0011/9127/119127v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://Twitter.com/marc_meyer","title":"Twitter"},{"external_url":"http://www.linkedin.com/in/marctmeyer","title":"Linkedin"}]}