{"first_name":"Marcelo","last_name":"Ballona","permalink":"marcelo-ballona","crunchbase_url":"http://www.crunchbase.com/person/marcelo-ballona","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Club Point","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Nov 14 21:48:25 UTC 2011","updated_at":"Thu Jun 21 09:04:13 UTC 2012","overview":"<p>Educated at the University of Southern California, Marcelo Ballona earned a degree in Executive Education and Business Administration from UCLA’s Anderson School of Management. Prior to completing his studies, Marcelo Ballona gained experience as Vice President of Sales and Marketing for Mandic, a privately held Internet service provider based in Brazil. In this role, Marcelo Ballona optimized company resources, strengthening the management team and refining marketing strategies. After departing from Mandic, Marcelo Ballona founded Yahoo! Brazil, serving as Sales Director while overseeing company expansion. Marcelo Ballona was responsible for ensuring Yahoo! Brazil’s successful launch, a task he completed over the course of only one year. Moving on to serve as Chief Executive Officer of Diarios Associados, Investnews, and Groove Partners/Synergic, Marcelo Ballona employed his knowledge of web-based technologies and marketing to lead each company with skill, exhibiting great acumen in business development. In 2005, Marcelo Ballona founded Submarino, creating the largest e-commerce firm in Latin America over the course of four years. Personally responsible for hiring Submarino’s Chief Information Officer, Marcelo Ballona created a company that Bill Gates called “an example for all users of commerce servers in the world.” After Submarino’s successful initial public offering, Microsoft invited Marcelo Ballona to participate in a national advertising campaign, “How to make your first million on the web.” A major shareholder until 2005, Marcelo Ballona passed on leadership duties to the Chief Information Officer, who serves as Submarino’s Chief Executive Officer today. Marcelo Ballona moved on to serve in a variety of leadership roles for companies with a global share in Internet marketing, information technologies, and new media such as NetGames, Inc./Level UP! BPO, Groove Partners, Inc., and Sapient. Was Sapient’s Managing Director for Latin America and Brazil, Marcelo Ballona is also a sought-after speaker for e-commerce industry conferences. The European Telecom Network Operators’ Association (ETNO) selected Marcelo Ballona as the opening speaker at a CEO summit in Venice, where Marcelo Ballona shared the knowledge he has gained over the course of his career with other leaders in the telecom industry. Additionally, Microsoft Latin America recognized Marcelo Ballona for his innovative web service business strategies. Aside from his impressive work in the business world, Marcelo Ballona supports numerous charities such as the Children’s Institute, a hospital for terminally ill children.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Advisory Board","firm":{"name":"Club Point","permalink":"club-point","type_of_entity":"company","image":{"available_sizes":[[[150,96],"assets/images/resized/0010/5007/105007v2-max-150x150.jpg"],[[250,160],"assets/images/resized/0010/5007/105007v2-max-250x250.jpg"],[[450,288],"assets/images/resized/0010/5007/105007v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Advisory Board","firm":{"name":"Rush Points","permalink":"rush-points-llc","type_of_entity":"company","image":null}},{"is_past":true,"title":"Board Member/Advisor","firm":{"name":"Qranio","permalink":"qranio","type_of_entity":"company","image":{"available_sizes":[[[141,150],"assets/images/resized/0016/5207/165207v5-max-150x150.png"],[[235,250],"assets/images/resized/0016/5207/165207v5-max-250x250.png"],[[424,450],"assets/images/resized/0016/5207/165207v5-max-450x450.png"]],"attribution":null}}}],"investments":[{"funding_round":{"round_code":"angel","source_url":"","source_description":"","raised_amount":250000,"raised_currency_code":"USD","funded_year":2012,"funded_month":2,"funded_day":1,"company":{"name":"Rush Points","permalink":"rush-points-llc","image":null}}}],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.linkedin.com/in/ballona","title":"Linkedin"}],"web_presences":[{"external_url":"http://www.marceloballona.brandyourself.com","title":"BrandYourself.com"},{"external_url":"http://www.linkedin.com/in/ballona","title":"Marcelo Ballona"},{"external_url":"http://www.facebook.com/marceloballona","title":"Facebook Marcelo Ballona"},{"external_url":"http://www.twitter.com/marceloballona","title":"Twitter Marcelo Ballona"}]}