{"first_name":"Marc","last_name":"West","permalink":"marc-west","crunchbase_url":"http://www.crunchbase.com/person/marc-west","homepage_url":"http://www.mamapedia.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"bd--strategy, fund-raising, sales, marketing--technology, operations, new-product-creation, marketing, social-media, saas, cloud, big-data, privacy-and-security--shareholder-value-creation, customer-acquisition--web, mobile-and-social-technology-and-custo","alias_list":null,"created_at":"Thu Nov 15 17:25:14 UTC 2012","updated_at":"Thu Nov 22 05:00:38 UTC 2012","overview":"<p>A proven senior executive with superb leadership skills and a solid track record of generating meaningful shareholder value. Launched and scaled notable consumer/ Internet companies as well as generated growth and improved operating margins at companies from the Fortune 500 to startups. Deep strategic vision along with a measurable record of market place excellence. A strong passion for positioning / building / growing successful companies and brands while achieving measurable returns on investment. Both strategically and operationally skilled to create a well balanced ‘move the needle’ capability in highly competitive markets while developing the organizational muscle for sustainable growth.</p>\n\n<p>Numerous technology advisory and startup board experiences.</p>\n\n<p>Specialties\nBD / Strategy, fund raising, sales, marketing. Technology, operations, new product creation and launch. Passionate about creating and delivering shareholder value through highly engaged customers. Extensive traditional internal, web, mobile and social technology and customer marketing background. Have managed from two person startups to significant teams. Fundraised and funded numerous new business initiatives.</p>","image":{"available_sizes":[[[103,150],"assets/images/resized/0022/0566/220566v2-max-150x150.jpg"],[[173,250],"assets/images/resized/0022/0566/220566v2-max-250x250.jpg"],[[200,289],"assets/images/resized/0022/0566/220566v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/marc-west/0/69/a8b","title":"linkedin"}]}