{"first_name":"Marcos","last_name":"Cuevas","permalink":"marcos-cuevas","crunchbase_url":"http://www.crunchbase.com/person/marcos-cuevas","homepage_url":"http://layers.com","birthplace":"Barcelona, Spain","twitter_username":"marcoscuevas","blog_url":"http://blog.layers.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1973,"born_month":4,"born_day":11,"tag_list":"","alias_list":null,"created_at":"Sun Jun 26 22:49:58 UTC 2011","updated_at":"Mon Jun 27 18:21:09 UTC 2011","overview":"<p>Marcos Cuevas is a Barcelona-based entrepreneur and Founder and CEO of Layers, your personalized social channel. Layers offers an elegant, fluid way to see what your friends are sharing on social networks, letting all your networks flow together.</p>\n\n<p>Marcos founded his first company, Acquamedia, a global mobile content retailer, when he was just 28 years old. By the time he decided to move on to new projects, Acquamedia was a market leader in the European mobile entertainment space and earning some 7 million Euros per year.</p>\n\n<p>In 2008, Marcos founded Layers upon realizing that there was much more that could be done with websites than what existing technology had to offer: why not let users write on their favorite sites, add their own contributions and share media? </p>\n\n<p>That was the original premise of Layers and today the product is constantly evolving to make using the Web a more social, more enjoyable experience for users. Layers lets you share, discover and interact with everything you care about all in one place.  It offers the best way for people to consume personalized content curated by their friends or the people they admire on any platform:  browser, iOS, Android and TV.</p>\n\n<p>Marcos is a frequent speaker at tech events both in Europe and Silicon Valley and shares his expertise in entrepreneurship and business development with university students, budding entrepreneurs and on several advisory boards.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0014/1091/141091v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0014/1091/141091v2-max-250x250.jpg"],[[250,250],"assets/images/resized/0014/1091/141091v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO and Founder","firm":{"name":"Layers","permalink":"layers","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0014/4756/144756v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0014/4756/144756v2-max-250x250.jpg"],[[300,300],"assets/images/resized/0014/4756/144756v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}