{"first_name":"Marco","last_name":"Borges","permalink":"marco-borges","crunchbase_url":"http://www.crunchbase.com/person/marco-borges","homepage_url":"https://www.22daysnutrition.com","birthplace":"Miami","twitter_username":"22daysnutrition","blog_url":"http://www.22daysnutrition.com/blog","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1978,"born_month":1,"born_day":1,"tag_list":"22days, nutirition-bar, protien-bar","alias_list":null,"created_at":"Tue Nov 23 11:14:14 UTC 2010","updated_at":"Wed Dec 08 10:20:18 UTC 2010","overview":"<p>Nature’s Power </p>\n\n<p>We believe that foods made with the finest natural ingredients satisfy not only the body but also the spirit. That’s why we created 22 Days nutritional products, a smart alternative to many of the well-known nutrition products on the market. Our vegan and vegetarian products are specially formulated using raw and organic superfoods, including the exceptional benefits of hemp and rice protein. When you eat well, you live well and the benefits go beyond the individual and can actually positively affect our environment.</p>\n\n<p>Inspiring a New Way</p>\n\n<p>As part of an overall healthy diet, 22 Days nutrition products are lightly sweetened with organic ingredients and do not contain high fructose corn syrup, gluten or soy. Additionally, these delicious bars and smoothies are free of trans fats, cholesterol and low in sodium. Whether the goal is to improve overall health and fitness levels, or train for a triathlon, 22 Days nutrition products inspire through taste, attitude, and a global conscience, replacing hunger with a healthy habit.</p>\n\n<p>Creating Lasting Change</p>\n\n<p>It was recently discovered that the human mind takes almost exactly 21 days to adjust to a major life change. We applied this principal to helping people live a healthier, more energetic and productive life. At 22days, we are committed to providing the nutrition and the tools to help make a positive and healthy difference everyday.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}