{"first_name":"Marco","last_name":"Villa","permalink":"marco-villa","crunchbase_url":"http://www.crunchbase.com/person/marco-villa","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Italian Angels for Growth","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Sep 20 23:03:00 UTC 2010","updated_at":"Fri Dec 10 19:00:52 UTC 2010","overview":"<p>Marco Villa is a Business Angel and is the Vice President and Managing Director of Italian Angels for Growth - IAG, that he co-founded in 2007.\nMarco is also owner and Managing Director of Mirade Ventures Srl, a boutique venture firm specializing in equity investments in high-potential start-up businesses. Marco has invested in Italy and abroad across industries and is involved as an investor, executive and non-executive director in start up businesses in Italy, China and Latvia.\nMarco’s career gives him unique experience in angel investing, entrepreneurship, management, business development, strategic planning, corporate social responsibility, leadership development, innovation and creativity.  Marco is a frequent speaker on these topics and has contributed to several events as well as to University courses at, among others, Stanford University, Bocconi University (Milan), LUISS University (Rome) and Fudan University (Shanghai).\nPreviously Marco has been Director and Head of Business Development at Villa &amp; Bonaldi (www.villabonaldi.com),  a production company in the oil &amp; gas processing industry and Manager in the global office of PricewaterhouseCoopers (www.pwc.com), based in London, New York and Amsterdam. Before joining the private sector and has held various positions in two global nongovernmental organizations: the Society for International Development (www.sidint.org) and AIESEC (www.aiesec.org), where he has also been a recipient of the Global Alumni Contribution Award.\nMarco holds a Master degree in Economics and Business Administration and has received executive education in Private Equity and Venture Capital.\nMarco is an passionate traveller and has visited more than 70 countries. In his free time he enjoys skiing, scuba diving and music.</p>","image":{"available_sizes":[[[122,150],"assets/images/resized/0011/3260/113260v2-max-150x150.jpg"],[[153,187],"assets/images/resized/0011/3260/113260v2-max-250x250.jpg"],[[153,187],"assets/images/resized/0011/3260/113260v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director and Vice President","firm":{"name":"Italian Angels for Growth","permalink":"italian-angels-for-growth","type_of_entity":"financial_org","image":{"available_sizes":[[[150,39],"assets/images/resized/0010/7216/107216v1-max-150x150.png"],[[250,66],"assets/images/resized/0010/7216/107216v1-max-250x250.png"],[[272,72],"assets/images/resized/0010/7216/107216v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}