{"first_name":"Marc","last_name":"Davis","permalink":"marc-davis","crunchbase_url":"http://www.crunchbase.com/person/marc-davis","homepage_url":"http://marcdavis.me","birthplace":"Los Angeles, CA","twitter_username":"marcedavis","blog_url":"http://marcdavis.me","blog_feed_url":"http://marcdavis.me/category/blog/feed","affiliation_name":"Yahoo!","born_year":1962,"born_month":10,"born_day":19,"tag_list":"yahoo","alias_list":null,"created_at":"Wed Jul 09 01:13:01 UTC 2008","updated_at":"Fri Dec 10 19:16:32 UTC 2010","overview":"<p>Marc Davis invents mobile, social, media, and personal data technologies that connect people, the web, and the world. With a twenty year career of technology research and development spanning the MIT Media Lab, Interval Research, UC Berkeley, Yahoo!, Invention Arts, and Microsoft, he has done pioneering work in context-aware computing, computer vision, mobile media metadata, social media, mobile and social advertising, and personal data technologies and applications. He has transformed his ideas into over 150 patent applications, as well as numerous research prototypes, products, and publications. Marc Davis is a Partner Architect at Microsoft working on the vision and technology strategy for Microsoft’s Online Services Division.</p>\n\n<p>Before Microsoft, Marc Davis was Chief Scientist at Invention Arts, where he focused on new approaches to how people can better control, share, and benefit from their personal data. His ideas on Personal Data Banking and Exchange inform a joint project with the World Economic Forum and other organizations to redesign the personal data ecosystem. Before Invention Arts, Marc Davis was Chief Scientist and Vice President of Early Stage Products (ESP) for Yahoo! Mobile, where he worked on innovative products and platforms such as oneConnect, Social Pulse, the Yahoo! Open Strategy (Y!OS), and the vision demo for the future of Yahoo! shown at CES 2008. Marc Davis was also the Founding Director of Yahoo! Research Berkeley, where he and his teams developed ZoneTag and Zurfer (context-aware mobile photo upload, tagging, and browsing software), and TagMaps (a collective map of human attention created by analyzing millions of geocoded Flickr photos). Marc Davis served as an Assistant Professor at the UC Berkeley School of Information where he co-founded the UC Berkeley Center for New Media and directed Garage Cinema Research, where he led a multi-year Mobile Media Metadata research project that pioneered context-aware mobile media uploading, tagging, and sharing as well as context-aware face recognition.</p>\n\n<p>Marc Davis gives talks at leading conferences such as SXSW, Web 2.0 Expo, Telco 2.0, and Mobile 2.0, and his ideas and work have been featured in publications such as the New York Times, Atlantic Monthly, BBC News, TechCrunch, GigaOm, O’Reilly Radar, AllThingsD, SearchEngineLand, and ReadWriteWeb.</p>","image":{"available_sizes":[[[108,150],"assets/images/resized/0002/1698/21698v1-max-150x150.jpg"],[[173,240],"assets/images/resized/0002/1698/21698v1-max-250x250.jpg"],[[173,240],"assets/images/resized/0002/1698/21698v1-max-450x450.jpg"]],"attribution":"<p>Marc Davis / [Yahoo360)(http://360.yahoo.com/profile-N_9w6bg8erQdA0jtGFsziM3Y)</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Partner Architect, Online Services Division","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Chief Scientist, Yahoo Connected Life","firm":{"name":"Yahoo!","permalink":"yahoo","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0001/0836/10836v9-max-150x150.png"],[[226,81],"assets/images/resized/0001/0836/10836v9-max-250x250.png"],[[226,81],"assets/images/resized/0001/0836/10836v9-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://twitter.com/#!/marcedavis","title":"Twitter"},{"external_url":"http://www.honestly.com/profile?id=83942","title":"Honestly.com Reviews"}]}