{"first_name":"Marc","last_name":"Cenedella","permalink":"marc-cenedella-2","crunchbase_url":"http://www.crunchbase.com/person/marc-cenedella-2","homepage_url":"http://www.theladders.com","birthplace":"","twitter_username":"marccendella","blog_url":"","blog_feed_url":"","affiliation_name":"TheLadders","born_year":1969,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Mar 24 18:11:43 UTC 2011","updated_at":"Sun Jun 24 18:54:03 UTC 2012","overview":"<p>Marc is a populist scientist of employment. His passion in life is jobs, their sociology and culture: the process by which everyone passes from family through school and into a career. It&#8217;s the second most-important thing in people&#8217;s lives, after love and family and as a result, the subject of jobs itself is Marc&#8217;s chosen devotion in his professional life. A widely recognized thought leader on job search, career management, recruiting and business, Marc is frequently sought out by national media outlets and organizations for his expert commentary on employment and entrepreneurial related issues.</p>\n\n<p>Marc Cenedella is the founder and chief executive officer of TheLadders.com, the world&#8217;s leading online community for $100K+ jobs and $100K+ job seekers. </p>\n\n<p>Marc started TheLadders.com in 2003 to make finding a professional job a lot easier and transformed the way candidates and recruiters connect online. With a membership base of 4 million, TheLadders.com job search and recruitment model has been embraced by executives and employers alike, with the company ranking #1 for overall satisfaction in an independent survey of recruiters.</p>\n\n<p>TheLadders.com has received numerous accolades, including the 2009 Webby Award for Best Employment Website, 2009 Best Companies to Work for New York, and the Most Valuable Start-up in New York by Silicon Alley Insider.  </p>\n\n<p>Prior to founding TheLadders.com, Marc was a senior vice president at HotJobs.com. Previously, Marc was an associate vice president at The Riverside Company, a New York-based private equity firm. </p>\n\n<p>Marc holds an MBA with high distinction from Harvard Business School, where he was named a Baker Scholar. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"TheLadders","permalink":"theladders","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0001/2452/12452v1-max-150x150.png"],[[183,62],"assets/images/resized/0001/2452/12452v1-max-250x250.png"],[[183,62],"assets/images/resized/0001/2452/12452v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}