{"first_name":"Marc","last_name":"Canter","permalink":"marc-canter","crunchbase_url":"http://www.crunchbase.com/person/marc-canter","homepage_url":"http://marc.blogs.it/","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Broadband Mechanics","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jul 12 10:09:06 UTC 2007","updated_at":"Wed Feb 18 20:10:51 UTC 2009","overview":"<p>Marc Canter is the CEO of Broadband Mechanics, founder of the company that became Macromedia, and well-known for his views on technology and politics. </p>\n\n<p>Marc Canter, CEO of Broadband Mechanics (BBM) is a 25+ year veteran of the software business. BBM is a boutique social networking design and platform shop - specializing in building systems that support the open stack, custom semi-private networks and strategic thinking.</p>\n\n<p>Marc is an advocate of open social networking, open standards and what he calls the ‘open mesh‘. A speaker and panel moderator at many conferences around the world, Marc is not afraid to ask the hard questions which highlight the desire for users to control their own data and software developers to not be locked into web 1.0 strategies.</p>\n\n<p>Marc was the co-founder of MacroMind, which became Macromedia. While with MacroMind Marc helped develop:</p>\n\n<ul>\n<li><p>the world’s first multimedia player - now known as Flash, originally called Shockwave. The original player was the VideoWorkls player - first created in Dec. 1984. Every Macintosh shipped with a player disc from 1986.</p></li>\n<li><p>the world’s first multimedia authoring system. Before MacroMind multimedia was craeted by programming. MacroMind helped introduce (along with Apple’s Hypercard) the notion of end-user ‘authoring‘ - where a simple scripting langauge and a timeline notional system were utilized to get images, sounds, animations and video synchronized and interactive - over time. First available in 1987.</p></li>\n<li><p>the world’s first cross-platform authoring system - popularizing the notion of “author once, play back many places“. Content developers could create their interactive applications once, and play them back on Macintoshs or PCs. That was back in 1989.</p></li>\n</ul>\n\n<p>Mentioned in several books, a leading blogger and web personality - Marc is also known as a father of five kids and Reggae enthusiast.</p>\n\n<p>Broadband Mechanics offers a social networking platform called PeopleAggregator in two ways:</p>\n\n<ul>\n<li><p>as a SaaS hosted model - where BBM handles all details of running the system</p></li>\n<li><p>in source code available form - priced for both startups and enterprises</p></li>\n</ul>\n\n<p>Broadband Mechanics also offers strategic consulting, design and work for hire build out of customized systems. This notion of a white labeled platforms - is something upon which BBM’s business model is based. BBM believes that many nations, brands and entities will wish to not leave themselves locked up in the vices of the BigCo platforms and control their own destiny.</p>\n\n<p>BBM’s live sites (built with PeopleAggregator) include:</p>\n\n<ul>\n<li><p>ROTCLink.com - the U.S. Army ROTC program’s social network (run for MRM Worldwide)</p></li>\n<li><p>BellVideoStore.ca - Bell Canada’s movie downloading site (where we added social features)</p></li>\n<li><p>iTimes.com - theTimesofIndia’s social network</p></li>\n<li><p>leamiche.donnamoderna.com - Mondadori’s Italian women’s social network (Berlusconi company)</p></li>\n<li><p>rocklandNY.tv - a community for citizens of Rockland County, NY</p></li>\n<li><p>GTChannnel.com - a drifter car enthusiast scoial network</p></li>\n<li><p>Cyama.com - a religious youth site</p></li>\n</ul>\n\n<p>After leaving Macromedia in 1992 Marc produced an interactive music video band, called the Mediaband (1992-94), the Marc Canter Show (1995) and a cyber theme restaurant operating system - Mediabar (1996-97.)</p>\n\n<p>Marc then co-developed an interactive flat panel display for SuperBowl XXXII (1997-98), a digital city architecture for Trieste, Italy (1998), an IPTV authoring system for NOW.com (1999), was a co-founder of Digiscents (1999) and helped craete numerous other designs and architectures for AOL, Reuters, eCast and other startups throughout the 90’s</p>\n\n<p>A complete timeline of Marc’s life can be found here.</p>\n\n<p>Here is Marc’s wikipedia page.</p>","image":{"available_sizes":[[[115,149],"assets/images/resized/0001/0342/10342v1-max-150x150.jpg"],[[115,149],"assets/images/resized/0001/0342/10342v1-max-250x250.jpg"],[[115,149],"assets/images/resized/0001/0342/10342v1-max-450x450.jpg"]],"attribution":null},"degrees":[],"relationships":[{"is_past":null,"title":"Chairman and CEO","firm":{"name":"Broadband Mechanics","permalink":"broadbandmechanics","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0000/3274/3274v1-max-150x150.png"],[[200,68],"assets/images/resized/0000/3274/3274v1-max-250x250.png"],[[200,68],"assets/images/resized/0000/3274/3274v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}