{"first_name":"Margo","last_name":"Drakos","permalink":"margo-drakos","crunchbase_url":"http://www.crunchbase.com/person/margo-drakos","homepage_url":"http://www.MargoDrakos.com","birthplace":"Columbus, Ohio","twitter_username":"MargoDrakos","blog_url":"","blog_feed_url":"","affiliation_name":"InstantEncore.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jan 02 23:43:17 UTC 2012","updated_at":"Thu Aug 09 19:19:10 UTC 2012","overview":"<p>A cellist turned technology entrepreneur, Margo Drakos is the Vice President of Business Development for Morphlabs, a recognized leader providing private cloud solutions for enterprises.  Ms. Drakos serves as a Strategic Advisor to Perpetual Value Partners, a private equity advisory firm focused on emerging markets, and Compagnie Financiere Otto, an independent portfolio manager group. She is also an advisor and angel investor in several technology start-ups.  Prior, Ms. Drakos was a Partner at the SwitchCase Group, a partner capital firm creating and supporting a portfolio of technology ventures including InstantEncore.com, a digital asset management platform for the performing arts she co-founded.</p>\n\n<p>Ms. Drakos is the Founder and President of AppBridge, an initiative of the World Economic Forum and commitment of the Clinton Global Initiative, designed to bring education and economic opportunity to those in poverty through mobile applications. In 2012, AppBridge launched the first Ideas &amp; Apps Challenge Competition in the Philippines in partnership with Globe Telecom and local organizations. The Challenge Competition will move to India in September in partnership with the Global Leadership and Education foundation. In 2010 Ms. Drakos was honored by the World Economic Forum as a Young Global Leader and in 2011, became a member of the Clinton Global Initiative.</p>\n\n<p>Ms. Drakos began her professional career early as a cellist, performing as a soloist and chamber musician throughout Asia, Europe, South America, and the US. The former cellist of the American String Quartet, Ms. Drakos also held posts as Principal Cellist of the San Diego and Seattle Symphonies and the Associate Principal Cellist of the Pittsburgh Symphony. Ms. Drakos served as Artist-in-Residence and professor at Manhattan School of Music and Aspen Music Festival, produced for Naxos Records and recorded for Sony Classical and Arabesque Records. </p>\n\n<p>At fifteen, Ms. Drakos entered music conservatory as a double major in cello and composition. She is a graduate of the prestigious Curtis Institute of Music in Philadelphia.  Ms. Drakos received a Master Degree in Human Rights from Columbia University, and an Executive Degree in Global Leadership and Public Policy from the Kennedy School of Government at Harvard University. Her academic publications have appeared in The International Affairs Review, The Stanford Social Innovation Review and The Cornell International Law Journal.</p>\n\n<p>Ms. Drakos is a frequent guest speaker on digital media, entrepreneurship and “The Age of participation”.  Highlights from her 2011-12 speaking engagements include the Global Competitiveness Forum of Saudi Arabia, Louisiana State University, National Arts Marketing Conference, NetImpact Conference, Techventure in Singapore, UCLA Anderson School of Business, and the World Economic Forum at Davos.</p>\n\n<p>Ms. Drakos lives in Los Angeles and Missouri with her husband.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"AppBridge","permalink":"appbridge","type_of_entity":"company","image":null}},{"is_past":false,"title":"Co-Founder","firm":{"name":"InstantEncore.com","permalink":"instantencore-com","type_of_entity":"company","image":{"available_sizes":[[[136,38],"assets/images/resized/0017/5763/175763v1-max-150x150.jpg"],[[136,38],"assets/images/resized/0017/5763/175763v1-max-250x250.jpg"],[[136,38],"assets/images/resized/0017/5763/175763v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Advisor","firm":{"name":"ReelSurfer","permalink":"reelsurfer","type_of_entity":"company","image":{"available_sizes":[[[150,57],"assets/images/resized/0003/4753/34753v4-max-150x150.png"],[[250,95],"assets/images/resized/0003/4753/34753v4-max-250x250.png"],[[450,171],"assets/images/resized/0003/4753/34753v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}