{"first_name":"Marge","last_name":"Breya","permalink":"marge-breya","crunchbase_url":"http://www.crunchbase.com/person/marge-breya","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Oct 14 21:25:33 UTC 2009","updated_at":"Wed Oct 14 21:26:45 UTC 2009","overview":"<p>Marge Breya is executive vice president and general manager of the Intelligence Platform Group (IPG) at <a href=\"/company/sap\" title=\"SAP\" rel=\"nofollow\">SAP</a> BusinessObjects and of the NetWeaver Solution Management organization at SAP AG. Breya brings more than 25 years of experience as a technology visionary to SAP. In her current role, Breya oversees responsibility for determining the roadmap and GTM strategy for SAP’s business intelligence (BI) and enterprise information management (EIM) solutions as well as the SAP NetWeaver platform.</p>\n\n<p>Previously, Breya was at Business Objects SA, where she was general manager for the company’s primary product-line businesses: core BI, EIM and midmarket solutions. She also served as Business Objects’ chief marketing officer (CMO) where she was responsible for developing the company’s vision and strategy, establishing its brand value proposition, and running all marketing and communications functions worldwide.</p>\n\n<p>Prior to joining SAP via the Business Objects acquisition, Breya served in a number of executive management roles at technology giants such as BEA Systems, where she was senior vice president (SVP), CMO, and chief strategy officer (CSO); and Sun Microsystems.</p>\n\n<p>Breya holds a bachelor’s degree in electrical engineering from the University of Illinois (Urbana/Champaign) and a master’s degree in business administration from the University of Oregon.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0006/2724/62724v1-max-150x150.jpg"],[[166,250],"assets/images/resized/0006/2724/62724v1-max-250x250.jpg"],[[300,450],"assets/images/resized/0006/2724/62724v1-max-450x450.jpg"]],"attribution":"<p>SAP.com</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"EVP, General Manager, Intelligence Platform Group","firm":{"name":"SAP","permalink":"sap","type_of_entity":"company","image":{"available_sizes":[[[66,33],"assets/images/resized/0003/1474/31474v4-max-150x150.png"],[[66,33],"assets/images/resized/0003/1474/31474v4-max-250x250.png"],[[66,33],"assets/images/resized/0003/1474/31474v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}