{"first_name":"Marian","last_name":"Salzman","permalink":"marian-salzman","crunchbase_url":"http://www.crunchbase.com/person/marian-salzman","homepage_url":"","birthplace":"","twitter_username":"mariansalzman","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":"","created_at":"Tue May 24 16:19:01 UTC 2011","updated_at":"Wed Dec 14 22:44:04 UTC 2011","overview":"<p>Marian Salzman is the CEO of Euro RSCG Worldwide PR, North America, and Euro RSCG Life PR. She took over as ERWW PR’s president in August 2009, bringing laser-like focus to the agency’s social media and grassroots campaigning—a homecoming, as she had previously spent five years as chief strategic officer of Euro RSCG Worldwide. After just 19 months at the helm, Marian was named PRWeek’s 2011 PR Professional of the Year. She was also named PR Agency Team Leader for the PR News PR People Awards and finalist for Lifetime Achievement and Service Executive of the Year for the Stevie Awards for Women in Business (all 2010), and is the 2011 Golden Bridge Blogger of the Year, Lifetime Achievement winner, and part of its Management Team of the Year (with two ERWW colleagues), plus PR News‘ 2011 Agency PR Professional of the Year. In addition, her four-part series on the brain that she wrote for the Huffington Post won a 2011 Bronze SABRE (Superior Achievement in Branding and Reputation) award for Speech or Bylined Article and was given honorable mention in the PR News Platinum PR Awards’ Blog category; her blogging in general won her a silver Bulldog Stars of PR for PR Blogger of the Year and was named the PR News Digital PR’s Best Blog. In April 2011, Marian was named CEO of ERWW PR.</p>\n\n<p>Before returning to Euro RSCG, Marian was CMO at global PR giant Porter Novelli. She drove Porter’s brand positioning and executed thought leadership, reputation management and social media programs, including the creation of Porter’s pop-up agency Jack + Bill, which in one year won PRWeek’s PR Innovation of the Year, the industry’s innovation SABRE and the top Bulldog award.</p>\n\n<p>Named one of the world’s top five trendspotters, she has managed other trendspotters around the globe for more than 15 years. She has been CMO at JWT Worldwide, worldwide director of TBWA’s Department of the Future, and director of consumer insights and emerging media at Chiat/Day. With Jay Chiat, she co-founded Cyberdialogue, the world’s first online market research company, in 1992.</p>\n\n<p>In addition to her closely watched and widely reported-on annual trends forecast, Marian has contributed regular trends columns to Forbes.com’s CMO Network and CNBC.com and written for Adweek, PRWeek, PR News and Marketing Week (U.K.). She currently blogs at the Huffington Post, the Holmes Report, eurorscgpr.com and eurorscgsocial.com. Marian is also the author or co-author of 15 books, including Next Now and The Future of Men.</p>\n\n<p>She is a member of the mentoring board of Brown University’s Women in Business and an adviser to the Berlin School of Creative Leadership’s M.B.A. program. She created Tweet to ReMIND (ReMIND.org or #tweettoremind), a community-based effort to raise money and awareness for the Bob Woodruff Family Foundation, on whose board she serves. Marian is currently a member of the Agency Management Committee of the Council of Public Relations Firms and president of the Fairfield County (Connecticut) Public Relations Association.</p>\n\n<p>Marian graduated from Brown University with top honors. She now lives in Stamford, Conn.</p>","image":{"available_sizes":[[[128,150],"assets/images/resized/0016/6459/166459v1-max-150x150.jpg"],[[214,250],"assets/images/resized/0016/6459/166459v1-max-250x250.jpg"],[[300,350],"assets/images/resized/0016/6459/166459v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO, North America Euro RSCG Worldwide PR","firm":{"name":"Euro RSCG Worldwide","permalink":"euro-rscg-worldwide","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}