{"first_name":"Maria","last_name":"Zaghi","permalink":"maria-zaghi","crunchbase_url":"http://www.crunchbase.com/person/maria-zaghi","homepage_url":"http://www.tec.com.gt","birthplace":"Guatemala","twitter_username":"mzaghi","blog_url":"http://mzaghi.wordpress.com","blog_feed_url":"http://mzaghi.wordpress.com/feed/","affiliation_name":"Unaffiliated","born_year":1962,"born_month":6,"born_day":16,"tag_list":"","alias_list":null,"created_at":"Sun Jan 22 14:10:18 UTC 2012","updated_at":"Mon Jan 23 07:04:48 UTC 2012","overview":"<p>Maria Zaghi is in charge of Business Develpment in  Campus Tecnologico (Campus TEC) in Guatemala which is one of the first technology parks in the Central American region.  The park includes more than a 100 companies and entrepreneurs in the ICT sector (Information and Communication Technologies).</p>\n\n<p>She has had a a 20-year experience in the implementation of projects and entrepreneur efforts related to ICTs in Latin America.  She has been the leader for serveral ICT agendas in Guatemala including the e-guatemala strategy as an resercher of the Information Committee in the National Science Council; she leads the National E-commerce and Information Society Commission of Guatemala and is also a professor in ICT programs for Universidad Del Valle, Francisco Marroquin University, Landívar University and Universidad Galileo in Guatemala.  Her expertise in education includes the following areas: System Analysis, Operations Research, Computer Science, Administration of Projects, Strategic Administration, High Tech Seminars, Leadership/Entrepreneurship courses and Computer Science applied to Education.</p>\n\n<p>Ms. Zaghi has an MBA degree from the University of Maryland in College Park, with a specialization in MIS and an undergraduate degree in Computer Science from the Francisco Marroquin University in Guatemala. </p>\n\n<p>She has been a senior consultant for local projects in Guatemala related to financial systems, energy sector financial systems,  Internet, e-commerce, e-education, e-inclusion,  among others, but she has also been  an international consultant for projects related to ICTs for the Inter-American Development Bank,  World Bank, the European Community, ICDF (Taiwan), World Summit Award, US AID programs,  Gateway Development Foundation, the Nature Conservancy, Non-Aligned Movement Centre for South-South Technical Cooperation (Singapore), GAIA (Spain), Pan-American Health Organization, Exxon and Price Waterhouse Coopers.  </p>","image":null,"degrees":[{"degree_type":"MBA","subject":"MIS","institution":"University of Maryland","graduated_year":1986,"graduated_month":null,"graduated_day":null},{"degree_type":"BS","subject":"Computer Science","institution":"Francisco Marroquin University","graduated_year":1984,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://gt.linkedin.com/in/mzaghi","title":"Linkedin profile"}]}