{"first_name":"Marilyn","last_name":"Thomas","permalink":"marilyn-thomas","crunchbase_url":"http://www.crunchbase.com/person/marilyn-thomas","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Nov 19 15:24:47 UTC 2008","updated_at":"Tue May 26 08:19:18 UTC 2009","overview":"<p>Thomas received her Bachelor of Arts from Marian College of Fond du Lac in 1965\n(English and Education).  Followed by a Master of Arts, University of Minnesota, 1973 (English), a Doctor of Philosophy, University of Minnesota, Cumulative GPA 3.89, 1976 (English).  Thomas participated in Post-Doctoral Research Fellowships at Yale University: National Endowment for the Humanities, 1980; Oxford University: 1995, 1998, and 1999; and Cambridge University: National Endowment for the Humanities, 2002.</p>\n\n<p>Thomas started her teaching profession in 1965 with elementary education; returned to Marian College for 10 years where she served both as administrator and teacher and in 1986 Thomas graced the staff at Menlo College in Atherton, CA where she still resides.   Thomas has been a member of the Board of Directors for Brookside Capital since 1996. Thomas’ publications include Church, City, and Labyrinth in Brontë, Dickens, Hardy, and Butor, Peter Lang Publishing Inc. New York, 1993;  and Victorian Conscience: F. W. Robertson, (biography) Peter Lang Publishing, 2001.</p>\n\n<p>Professional Membership Affiliations:  Member, Board of Directors of Brookside Capital, San Francisco, CA, 1996 – Present; Honorary Member, Board of Governors, Harris Manchester College, Oxford University; Member, Association of Business Communicators (1986 - 1990); Member, Association of Literary Scholars and Critics (ALSC) 1998 – Present; Listed in the Directory of American Scholars published by Gale Research; National Association of Scholars, 2000 to Present; Nineteenth Century Studies Association, 2000 to Present; Association of British Popular Culture, 2002 to Present; and Modern Language Association, 2003 to Present.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0004/5468/45468v1-max-150x150.jpg"],[[250,187],"assets/images/resized/0004/5468/45468v1-max-250x250.jpg"],[[450,337],"assets/images/resized/0004/5468/45468v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Board of Advisors","firm":{"name":"Brookside Capital","permalink":"brookside-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,18],"assets/images/resized/0000/3991/3991v1-max-150x150.png"],[[200,24],"assets/images/resized/0000/3991/3991v1-max-250x250.png"],[[200,24],"assets/images/resized/0000/3991/3991v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}