{"first_name":"Mari Anne","last_name":"Vanella","permalink":"mari-anne-vanella","crunchbase_url":"http://www.crunchbase.com/person/mari-anne-vanella","homepage_url":"http://www.VanellaGroup.com","birthplace":"California","twitter_username":"vanellagroup","blog_url":"http://accountdevelopment.blogspot.com/","blog_feed_url":"http://accountdevelopment.blogspot.com/feeds/posts/default?alt=rss","affiliation_name":"Unaffiliated","born_year":1962,"born_month":null,"born_day":null,"tag_list":"marketing-for-high-tech, technology-sales, telesales-for-technology","alias_list":null,"created_at":"Mon Nov 10 04:28:22 UTC 2008","updated_at":"Mon Mar 26 02:55:04 UTC 2012","overview":"<p>Mari Anne Vanella is CEO of The Vanella Group, Inc., one of the leading providers of telemarketing-based lead generation and tele-services  for the high tech industry.  The Vanella Group, Inc. is mentioned by The Aberdeen Group in their last 2 Outsourced B2B TeleServices Studies as a provider in the Market Intelligence-to-Opportunity solution space by identifying rich sales intelligence through one-on-one peer discussions with executives. </p>\n\n<p>Ms. Vanella&#8217;s background includes successful performance as Vice President and Director at companies such as The EC Company (now ADX), PictureTalk, a subsidiary of Drake International (one of the world&#8217;s largest IT solution and staffing firms), Global Knowledge, a $500M IT Training and consulting firm, and most recently at Skyline Computer Corporation, where she led the Cisco Training Products organization to a leading position within 12 months. Prior to these she founded Procom, a sales development firm based in the Silicon Valley serving customers such as State Farm Insurance, Waddell &amp; Reed, AmeriPro, and many others.  Ms. Vanella has held a seat on the Cisco Training Advisory Council where she contributed to the planning and direction of Cisco&#8217;s Training and Certification programs.  She has also been published in Certification Magazine and by the Computing Technology Industry Association (ITTA).  Her knowledge of technology acquisition and the entire sales process gives her the insight and ability to engineer lead generation programs that are both results-based and cost-effective. Her executive leadership roles in national sales organizations with field reps, sales engineers and customer service teams brings in-depth knowledge and hands-on experience to the table.  The methodology she implements at her firm results in a solution that has unmatched results performing 5x above the industry standards published by the DMA.</p>\n\n<p>Her industry affiliations include:</p>\n\n<ul>\n<li>Founding Member of Women In Technology International&#8217;s (WITI) Global Executive Network</li>\n<li>The Direct Marketing Association (DMA) of Northern California</li>\n<li>Honorary Member of Sales &amp; Marketing Executives International (SMEI)</li>\n<li>The American Marketing Association</li>\n<li>Silicon Valley AMA, SVASE (Silicon Valley Association of Startup Entrepreneurs)</li>\n<li>Women in Consulting</li>\n<li>National Association of Female Executives.  </li>\n</ul>\n\n<p>Recently she has authored the book &#8220;42 Rules of Cold Calling Executives&#8221; which is available on Amazon.com and other retail channels.  Ms. Vanella&#8217;s graduate studies in Business Management were through the Edinburgh School of Business, Heriot-Watt University.  </p>\n\n<p>In 2010 and 2011 Mari Anne was Nominated for the list of Top 50 Most Influential People in Sales Lead Management.  This year Mari Anne is listed as one of the &#8220;20 Women to Watch in 2011 in Sales Lead Management&#8221; and has also received nomination for 2012.</p>\n\n<p>Active on the speaking circuit, Mari Anne has presented at Cloudforce 2010, Dreamforce 2011, and has been featured on StartupNation, Selling Power, Salesforce.com, the DMA of Northern California, and regularly presents at sales kickoffs throughout the United States.</p>","image":{"available_sizes":[[[118,150],"assets/images/resized/0002/8160/28160v2-max-150x150.jpg"],[[196,250],"assets/images/resized/0002/8160/28160v2-max-250x250.jpg"],[[354,450],"assets/images/resized/0002/8160/28160v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA Candidate","subject":"","institution":"Heriot-Watt University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[{"description":"The Vanella Group, Inc. celebrates 10th delivering lead generation programs to technology providers.","stoned_year":2011,"stoned_month":4,"stoned_day":1,"source_url":"","source_text":null,"source_description":"","stoneable_type":"Person","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"first_name":"Mari Anne","last_name":"Vanella","permalink":"mari-anne-vanella"}}],"video_embeds":[],"external_links":[{"external_url":"http://accountdevelopment.blogspot.com","title":"Mari Anne's Insights Into Cold Calling Blog"}],"web_presences":[{"external_url":"http://www.linkedin.com/myprofile?trk=hb_upphoto&goback=%2Ehom","title":"LinkedIn Profile"},{"external_url":"http://www.amazon.com/Rules-Cold-Calling-Executives-Telemarketing/dp/0979942829/ref=sr_1_1?ie=UTF8&s=books&qid=1226291254&sr=8-1","title":"Mari Anne' Book \"42 Rules of Cold Calling Executives\""}]}