{"first_name":"Maria","last_name":"Moreno","permalink":"maria-moreno","crunchbase_url":"http://www.crunchbase.com/person/maria-moreno","homepage_url":"http://www.asginternational.co.uk","birthplace":"Bristol","twitter_username":"ASGSymfony","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"symfony, symfony2, zend, php, doctrine, lamp, project, developers, ctos, it-director, it-managers, project-and-programme-managment, senior-appointments, programming, on-shoring, search-and-selection, headhunting, technical-team-creation-","alias_list":null,"created_at":"Mon Oct 15 11:25:57 UTC 2012","updated_at":"Fri Nov 02 03:29:17 UTC 2012","overview":"<p>Maria is a Senior IT Recruitment Consultant, specialising in Symfony development from junior developers to visionary CTO&#8217;s. </p>\n\n<p>Over the years Maria has forged exceptionally strong networks allowing her to offer specific candidate pools of permanent &amp; contract professionals within the Symfony and more general PHP Space. She is particularly skilled at identifying key staff for Start-ups and has placed a number of game changing CTO&#8217;s into new companies in the London area.</p>\n\n<p>Maria is fully trained in complex interviewing techniques, technical testing, multi-level communication, networking, beyond the job spec matching and efficient process management.</p>\n\n<p>She is responsible for reacting to her client’s requirements with high speed and accuracy using her established network and database together with targeted headhunting and referrals.</p>\n\n<p>Maria recruit&#8217;s for digital agencies, technology companies and end-user IT departments, of all types and sizes from multinational blue chips, to small yet nimble independent, high growth businesses. </p>\n\n<p>Much of Maria&#8217;s work is in London and the Home Counties however, she is not restricted and has clients and candidates all over the UK and Europe.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0021/5554/215554v2-max-150x150.jpg"],[[150,150],"assets/images/resized/0021/5554/215554v2-max-250x250.jpg"],[[150,150],"assets/images/resized/0021/5554/215554v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA (Hons)","subject":"Classical and Medieval Studies","institution":"University of Reading","graduated_year":2001,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}