{"first_name":"Maria","last_name":"Kolitsida","permalink":"maria-kolitsida","crunchbase_url":"http://www.crunchbase.com/person/maria-kolitsida","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Teez.mobi","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Aug 06 14:18:58 UTC 2011","updated_at":"Thu Jan 12 08:30:07 UTC 2012","overview":"<p>Maria has co-founded Teez.me and is heading Operational, Legal and Financial requirements for Teez.me, i.e. the legal establishment of the startup, the preparation of financial documents; and the implementation of operations. </p>\n\n<p>She has worked for 7 years as a Strategic Lobbyist in London and Brussels for The Coca-Cola Company, McCormick and PepsiCo and as a Business Innovation Manager supporting pioneer R&amp;D. Furthermore, she has worked as a Regulatory Affairs Manager for multinationals, conducting regulatory assessments, ensuring legal compliance and liaising between industry, authority and local Trade Standards. </p>\n\n<p>As an entrepreneur, Maria is also the co-founder of MackSyn Ltd, a company that builds commercial channels in emerging markets and promotes small medium size food companies.</p>\n\n<p>During the last 10 years, she has actively participate in the development of European strategies and regulations, consulting international food companies on the current international food law (North America, Asia, North Africa) and European (European Commission, Member States) and contributing to publications on European, North American and North African legislation.\nMaria holds an MBA from the University of Liverpool UK, a Certificate in EU Food Law from Michigan University, a Masters of Science in Food Biotechnology, Reading University and a BSc Biology from the Aristotle University of Thessaloniki, Greece.</p>\n\n<p>&#8230; and is beautiful!</p>","image":{"available_sizes":[[[82,150],"assets/images/resized/0015/2057/152057v2-max-150x150.jpg"],[[137,250],"assets/images/resized/0015/2057/152057v2-max-250x250.jpg"],[[247,450],"assets/images/resized/0015/2057/152057v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Co-founder & COO","firm":{"name":"Teez.mobi","permalink":"teez-mobi","type_of_entity":"company","image":{"available_sizes":[[[150,31],"assets/images/resized/0014/8157/148157v2-max-150x150.png"],[[250,52],"assets/images/resized/0014/8157/148157v2-max-250x250.png"],[[281,59],"assets/images/resized/0014/8157/148157v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}