{"first_name":"Mario","last_name":"Zorz","permalink":"mario-zorz","crunchbase_url":"http://www.crunchbase.com/person/mario-zorz","homepage_url":"http://prosciuttohome.boutiquestartups.com/","birthplace":"Argentina","twitter_username":null,"blog_url":"http://prosciutto.boutiquestartups.com/","blog_feed_url":"http://prosciutto.boutiquestartups.com/./rss.php?blogId=1&profile=atom","affiliation_name":"Iken Solutions","born_year":1978,"born_month":3,"born_day":7,"tag_list":"","alias_list":null,"created_at":"Tue Dec 30 18:03:11 UTC 2008","updated_at":"Thu Jan 20 01:33:47 UTC 2011","overview":"<p>Mario is leading the deployment of revolutionary content platform Mooga for big content providers and mobile operators for iKen Solutions (see www.infinitemoco.com and www.ikensolutions.com).</p>\n\n<p>WURFL contributor since September 2008.</p>\n\n<p>Mario has more than 8 years of experience in mobile technologies, design, development and implementation of products and mobile solutions for different industries throughout Latin America. Always linked to telecommunications and development communities since his early days, his career takes a strong mobile orientation in year 2000 when joining Movilogic (www.movilogic.com), with several prizes won and mentioned in specialized press, particularly around the company handbanking product specially designed for BankBoston Brazil and MoviMap, the very first mobile navigation software made in LatAm launching it successfully with Renault Clio GPS limited series in Argentina and Mexico (Palm Excellence Award 2003). Mario was also the product head for salesforce automation solution, sold to many different industries.</p>\n\n<p>In year 2004 Mario was hired by widely-known mobile operator Telefonica Moviles (www.movistar.com.ar), as VAS Senior Engineer, leading the WAP and PoC (PushToTalk Over Cellular) projects regionally. Remarkable experiences in Movistar are the RFP and design of CDS (Content Delivery System) repository, which is still one of the most renowned systems working on mobile operators today in the region; and the implementation of interoperability systems for PoC over CDMA and GSM in all Telefonica Moviles operations in Latin America, leading different teams of up to 70 people.</p>\n\n<p>In year 2006 Mario was hired by Mobile2Biz a local content company later merged with NetPeople International (now ZED), as Southern Cone Regional IT Manager. Since year 2003 Mario helps in ZA Systems Development (www.zasysdev.com.ar), in the role of core R&amp;D consultant. </p>","image":{"available_sizes":[[[82,150],"assets/images/resized/0003/4472/34472v4-max-150x150.jpg"],[[118,214],"assets/images/resized/0003/4472/34472v4-max-250x250.jpg"],[[118,214],"assets/images/resized/0003/4472/34472v4-max-450x450.jpg"]],"attribution":"<p>mario shallari</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"VP Technology and Operations","firm":{"name":"Iken Solutions","permalink":"iken-solutions","type_of_entity":"company","image":{"available_sizes":[[[150,65],"assets/images/resized/0003/2841/32841v5-max-150x150.jpg"],[[250,108],"assets/images/resized/0003/2841/32841v5-max-250x250.jpg"],[[450,196],"assets/images/resized/0003/2841/32841v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}