{"first_name":"Mariette","last_name":"Wharton","permalink":"mariette-wharton","crunchbase_url":"http://www.crunchbase.com/person/mariette-wharton","homepage_url":"http://www.vidtel.com","birthplace":"USA","twitter_username":"mariettewharton","blog_url":"http://www.vidtel.com/community","blog_feed_url":"http://www.vidtel.com/feed/atom.html","affiliation_name":"Unaffiliated","born_year":1969,"born_month":3,"born_day":20,"tag_list":"mariette-johnson-wharton, vidtel, middlebury-college, price-waterhouse, management-consulting, chief-marketing-officer, corporate-environmental-responsiblity, green-tech, clean-tech, columbia-university","alias_list":null,"created_at":"Tue Dec 06 20:49:49 UTC 2011","updated_at":"Mon Jul 09 18:53:33 UTC 2012","overview":"<p>Mariette is a co-founder of Vidtel, a pioneer in cloud-based any-to-any video conferencing service. She and her team recognized the need for small-medium size enterprises to transform their businesses by participating in business-grade video conferencing rather than incurring travel expenses for face-to-face meetings or being forced to the lowest common denominator of communication (phone or free video services).  Since the company&#8217;s inception, Mariette has been a key leader at Vidtel, helping to create and market the video equivalent to the telephone network (PSTN) with the goal to enable any video-enabled device to seamlessly interoperate with any other.  </p>\n\n<p>As the chief marketing officer, Mariette led the successful launch of the first cloud, any-to-any video conferencing solution in the world.  In the video conferencing industry, different vendors&#8217; technologies can&#8217;t connect, effectively creating proprietary video islands and stifling business-to-business usage. Today, Vidtel&#8217;s cloud service brings together, on-demand, video technologies from nearly 100% of the standards-based video conferencing technologies as well as Skype and Google Talk. This service allows multiple parties to come together with video on conference room video systems, video phones, PCs/Macs, tablets and smartphones without IT setup, infrastructure investment and video expertise. </p>\n\n<p>At the beginning of her career, in Mariette was a management consultant to Fortune 100 financial services companies.  Among her achievements was developing mortgage-lending programs for an underserved market (low-moderate income) for Chemical Bank and Citibank. She led focus groups among the target audience and provided recommendations that allowed her clients to garner over $100 million in business from a previously under-served market in the NY metro area while fulfilling a commitment to develop a thriving  local community.</p>\n\n<p>Mariette provided thought leadership in the mid-1990s about the means by which corporations could engage in win-win business practices for both the bottom line and the environment.  She was active as a Board Member, Co-Chair and panel judge in environmental initiatives to pursue this double bottom line, many years before the terms &#8220;clean tech&#8221; and &#8220;green tech&#8221; were coined. She was involved in determining corporate environmental responsibility awards, evaluating companies such as Clairol that were re-tooling packaging plastics to withstand re-heating and enable recycling. </p>\n\n<p>In the mid-1990s, Mariette became the director of competitiveness for a Washington, DC-based think tank, now part of the World Resources Institute. At the Management Institute for Environment and Business, Mariette conducted industry research studies that were used by the US EPA in environmental law policy-making and that were later published. Mariette&#8217;s work became the basis for MBA case studies at top-tier MBA programs, demonstrating that making business decisions that leave a positive impact on the environment can also be positive for the bottom line. This work led her to conduct consulting programs with Fortune 500 companies in the Strategic Risk and Analysis group at Price Waterhouse Coopers that were designed to move the corporate compass toward choosing environmentally-friendly materials and methods over environmentally-harmful ones without sacrificing shareholder value.</p>\n\n<p>Mariette has been an active volunteer in creating educational, athletic, community and environmental citizenship in her community. She currently serves as a member of the Site Council for the Los Altos School District, supporting the development of differentiated learning strategies. As an active Los Altos Art Docent, Mariette provides art lessons on a voluntary basis to hundreds of elementary school children. For the last 4 years, Mariette has been a Boy Scouts of America den leader and member of the BSA&#8217;s local Leadership Council.  She has been involved in leading classroom sessions for Project Cornerstone as an Asset Building Champion, empowering students to achieve and develop interpersonal assets. Mariette has also served as a Los Altos Little League assistant coach and an AYSO soccer referee. Over the last 20 years, Mariette has been active in promoting corporate environmental responsibility. She has served as a panel judge for corporate environmental awards, co-chair of Greenwich Earth Day and on the Board of Directors of a National Audubon Society chapter.  Mariette has also volunteered time to academic institutions at the college and university level for over 15 years, serving on Columbia University and Middlebury College alumni admissions panels.</p>","image":{"available_sizes":[[[88,150],"assets/images/resized/0017/7416/177416v4-max-150x150.jpg"],[[148,250],"assets/images/resized/0017/7416/177416v4-max-250x250.jpg"],[[266,450],"assets/images/resized/0017/7416/177416v4-max-450x450.jpg"]],"attribution":"<p>Gary Elsasser</p>"},"degrees":[{"degree_type":"BA","subject":"Political Science, French","institution":"Middlebury College","graduated_year":1991,"graduated_month":null,"graduated_day":null},{"degree_type":"GC","subject":"Economics and Politics","institution":"London School of Economics and Political Science","graduated_year":1990,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"Strategy & Operations ","institution":"Columbia University Graduate School of Business","graduated_year":1998,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[{"description":"VP, Marketing / Co-Founder of Vidtel","stoned_year":2008,"stoned_month":4,"stoned_day":1,"source_url":"http://www.telecomreseller.com/wp-content/uploads/2012/06/Telecom-Reseller-MayJun-2012.pdf#page=28","source_text":null,"source_description":"Telecom Reseller","stoneable_type":"Person","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"first_name":"Mariette","last_name":"Wharton","permalink":"mariette-wharton"}}],"video_embeds":[{"embed_code":"<iframe width=\"560\" height=\"315\" src=\"http://www.youtube.com/embed/NxytJXp8QbU\" frameborder=\"0\" allowfullscreen></iframe>","description":"<p>Vidtel Intro</p>"},{"embed_code":"<iframe width=\"560\" height=\"315\" src=\"http://www.youtube.com/embed/6Cn1y5vpYGo\" frameborder=\"0\" allowfullscreen></iframe>","description":"<p>Vidtel Demo</p>"}],"external_links":[{"external_url":"http://www.infocus.com/labs/all/visual-communication-%2526-collaboration/top-10-reasons-video-conferencing-will-be-easy-making-","title":"Top 10 Reasons Video Conferencing Will be As Easy as Making A Phone Call"},{"external_url":"http://smallbiztechnology.com/archive/2009/03/video-telephones-less-than-the.html/","title":"Less Than the Jetsons and Way Beyond Skype"},{"external_url":"http://www.infocus.com/labs/all/visual-communication-%2526-collaboration/smbs-need-affordable-devices-and-hosted-service-get-hi","title":"SMBs Need Affordable Devices and A Hosted Service to Get Into High-Quality Video Conferencing "},{"external_url":"http://www.vidtel.com/community","title":"Vidtel Blog"},{"external_url":"http://www.vidtel.com/who-we-are.html","title":"Vidtel Executive Management Team Bios"}],"web_presences":[{"external_url":"http://www.vidtel.com","title":"Vidtel"},{"external_url":"http://paper.li/MarietteWharton/1332607971","title":"WomenEntrepreneurship"},{"external_url":"http://paper.li/MarietteWharton/1332607971","title":"WomenEntrepreneurship"},{"external_url":"http://www.linkedin.com/#mariettewharton","title":"LinkedIn"},{"external_url":"http://twitter.com/#!/mariettewharton","title":"Twitter"}]}