{"first_name":"Maria","last_name":"Siemionow","permalink":"maria-siemionow","crunchbase_url":"http://www.crunchbase.com/person/maria-siemionow","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 27 09:46:03 UTC 2009","updated_at":"Wed May 27 09:49:33 UTC 2009","overview":"<p>A leader in the fields of microsurgery and transplantation, Dr. Siemionow serves as Director of Plastic Surgery Research and Head of Microsurgery Training at the Cleveland Clinic. For the past twelve years, she has been devoted to studies on transplantation tolerance and immune modulation. During her career as a mentor, she has trained over 75 surgeons from all over the world. Her leadership skills were confirmed by her election to the post of President of American Society for Peripheral Nerve in 2005. Working on different transplantation models and immunosuppressive protocols, she has published over 180 peer reviewed articles on transplantation, tolerance, and tissue regeneration. For her work on transplantation and tolerance she has been awarded the prestigious Folkert Belzer Award in Transplantation in Nagoya, Japan. Maria has established unique transplantation protocols and has vigorously pursued transplant solutions that improve survival while reducing the risks of immunosuppression. Maria developed the unique patented protocols utilizing the therapeutic antibody which Tolera plans to commercialize.</p>\n\n<p>Dr. Siemionow’s work has been featured in the New York Times, the Chicago Tribune, the New York Daily News, the Cleveland Plain Dealer, Dermatology Times, Newsweek, People Magazine, and Cleveland Magazine, in which she was chosen one of the most interesting people of 2006. Dr. Siemionow has also appeared on local and national radio and television broadcasts including NPR’s All Things Considered, The Today Show, CNN, NBC Nightly News, ABC, and CBS.</p>","image":{"available_sizes":[[[110,110],"assets/images/resized/0004/5657/45657v1-max-150x150.jpg"],[[110,110],"assets/images/resized/0004/5657/45657v1-max-250x250.jpg"],[[110,110],"assets/images/resized/0004/5657/45657v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Medical Officer","firm":{"name":"Tolera Therapeutics","permalink":"tolera-therapeutics","type_of_entity":"company","image":{"available_sizes":[[[138,79],"assets/images/resized/0004/5655/45655v1-max-150x150.jpg"],[[138,79],"assets/images/resized/0004/5655/45655v1-max-250x250.jpg"],[[138,79],"assets/images/resized/0004/5655/45655v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}