{"first_name":"Mark","last_name":"McLaughlin","permalink":"mark-mclaughlin","crunchbase_url":"http://www.crunchbase.com/person/mark-mclaughlin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Palo Alto Networks","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Aug 02 01:40:59 UTC 2011","updated_at":"Wed Jun 20 13:40:34 UTC 2012","overview":"<p>Mark D. McLaughlin has served as our Chief Executive Officer and President and as a member of our board of directors since August 2011, and as the Chairman of our board of directors since April 2012. From March 2000 through July 2011, Mr. McLaughlin served in several roles, including as President and Chief Executive Officer and as a director, at VeriSign, Inc., a provider of Internet infrastructure services to various networks worldwide. Prior to joining VeriSign, Mr. McLaughlin was Vice President, Sales and Business Development at Signio Inc., an Internet payment company acquired by VeriSign in February 2000. In January 2011, President Barack Obama appointed Mr. McLaughlin to serve on the Presidents National Security Telecommunications Advisory Committee, which is composed of private sector CEOs and experts who advise the U.S. Government on matters likely to impact or threaten the operation and security of the telecommunications systems in the United States. Mr. McLaughlin holds a B.S. in Political Science from the U.S. Military Academy at West Point and a J.D. from Seattle University. Mr. McLaughlin was selected to serve on our board of directors because of the perspective and experience he brings as our Chief Executive Officer and his extensive background in the technology industry.\nSource: S-1, 2012 </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Palo Alto Networks","permalink":"palo-alto-networks","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0002/3816/23816v1-max-150x150.png"],[[189,44],"assets/images/resized/0002/3816/23816v1-max-250x250.png"],[[189,44],"assets/images/resized/0002/3816/23816v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}