{"first_name":"Mark","last_name":"LaRosa","permalink":"mark-larosa","crunchbase_url":"http://www.crunchbase.com/person/mark-larosa","homepage_url":"http://www.marklarosa.com","birthplace":"New Jersey","twitter_username":null,"blog_url":"http://www.quotacrush.com","blog_feed_url":"http://www.quotacrush.com/index.php/feed/","affiliation_name":"Dynamic Mobile Data","born_year":1971,"born_month":5,"born_day":26,"tag_list":"","alias_list":null,"created_at":"Tue Jul 01 17:54:38 UTC 2008","updated_at":"Mon Apr 02 06:47:39 UTC 2012","overview":"<p>Mark LaRosa is the founder of QuotaCrush.  Started as a blog on sales techniques for start-ups, now QuotaCrush provides outsourced sales consulting and services to several start-ups, incubators, and universities.  QuotaCrush is also in the process of creating an innovative suite of software solutions for sales teams and managers in start-ups.</p>\n\n<p>Prior to QuotaCrush, Mark was also the founder of  Dynamic Mobile Data (DMD: www.dynamicmobiledata.com), a wireless enterprise software company focused on vehicle location and dispatch. He built and sold his innovative MobileDispatch solution to many large clients including Kraft/Nabisco, Pepsi, AIG, UPS, Airborne Express (now DHL), and Purolator Courier. </p>\n\n<p>Through his work at DMD, LaRosa secured a patent for his innovative wireless infrastructure both in Australia and the United States. At DEMOmobile 2003, a prestigious conference held for leaders in mobile computing, he was awarded one of the few DEMOgod awards for his innovative product Heads-Up.</p>\n\n<p>Between wrapping up his work at DMD, and founding QuotaCrush, Mark helped several start-ups and turn-arounds with sales and sales strategy.  Most recently, Mark served as VP of Sales at Angelsoft, where he tripled sales performance.  Angelsoft is a start-up founded by David S. Rose which provides software for the entire early stage community.  Under LaRosa&#8217;s leadership, Angelsoft became the undisputed software platform for angel groups, and gained significant traction in venture firms, incubators, business plan competitions and more.  The company went from 150 clients to over 450 clients in one year.</p>\n\n<p>Prior to Angelsoft, LaRosa built a North-East region for Air2Web (www.air2web.com) - a mobile marketing firm located in Atlanta. Proctor and Gamble, NBC/Universal, MTV, FedEx, USAir, CitiGroup and others became customers through LaRosa&#8217;s efforts. When he left Air2Web, the northeast region had gone from non-existent to a region supporting 3 individuals bringing in millions of dollars.</p>\n\n<p>LaRosa also re-established sales for the direct marketing vertical market for a turn-around company in collections IRMC (Now iQor: www.iqor.com).  Mark salvaged strained relationship with large customers and brought new customers to the table. By the end of his tenure, he had not only salvaged the vertical, but nearly doubled its size by landing customers such as Publisher&#8217;s Clearing House, Bookspan, BMG and Guthy-Renker.</p>\n\n<p>LaRosa is currently on the Board of Trustees of Stevens Institute of Technology and a founding board member of the Executive Council on Sales and Services - part of the SIIA.  </p>\n\n<p>LaRosa is active in the NY entrepreneurial and investment community, and lives in Northern New Jersey with his wife and three children.</p>","image":{"available_sizes":[[[128,150],"assets/images/resized/0003/2890/32890v2-max-150x150.jpg"],[[214,250],"assets/images/resized/0003/2890/32890v2-max-250x250.jpg"],[[296,345],"assets/images/resized/0003/2890/32890v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BS","subject":"MIS","institution":"Stevens Institute of Technology","graduated_year":1993,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"QuotaCrush","permalink":"quotacrush-3","type_of_entity":"company","image":null}},{"is_past":true,"title":"Founder","firm":{"name":"Dynamic Mobile Data","permalink":"dynamic-mobile-data","type_of_entity":"company","image":null}},{"is_past":true,"title":"VP of Business Development","firm":{"name":"IRMC (iQor)","permalink":"irmc-iqor","type_of_entity":"company","image":null}},{"is_past":true,"title":"VP, Strategic Partnerships","firm":{"name":"Gust","permalink":"gust","type_of_entity":"company","image":{"available_sizes":[[[150,121],"assets/images/resized/0002/4489/24489v7-max-150x150.jpg"],[[250,202],"assets/images/resized/0002/4489/24489v7-max-250x250.jpg"],[[450,364],"assets/images/resized/0002/4489/24489v7-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Senior Account Executive","firm":{"name":"Air2Web","permalink":"air2web","type_of_entity":"company","image":{"available_sizes":[[[149,80],"assets/images/resized/0006/4091/64091v1-max-150x150.jpg"],[[149,80],"assets/images/resized/0006/4091/64091v1-max-250x250.jpg"],[[149,80],"assets/images/resized/0006/4091/64091v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/marklarosa","title":"LinkedIn"},{"external_url":"http://www.twitter.com/mlarosa","title":"Twitter"}]}