{"first_name":"Mark","last_name":"Fruehan","permalink":"mark-fruehan","crunchbase_url":"http://www.crunchbase.com/person/mark-fruehan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Mobility Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"mark-fruehan","alias_list":null,"created_at":"Wed Jun 24 23:28:57 UTC 2009","updated_at":"Mon Aug 15 17:17:56 UTC 2011","overview":"<p>Mark Fruehan is a Partner at Mobility Ventures with over twenty years of wireless telecommunications business experience spanning a network operator, a manufacturer of customer premise equipment, a global wholesale distributor, an eCommerce fulfillment company and a software/ infrastructure utility in VeriSign. Mark also serves as Executive Vice President of Business Development at Ad Marvel, an Opera company.   Mark, is an industry recognized authority on mobile marketing &amp; advertising, and helped launch Ad Marvel to be a world leader in mobile advertising and successful sale to Opera.   Mark had broad based experiences in developing and launching new products, new channels and businesses from start-up, project management, client and partner relationships, process design &amp; implementation, contract management, investment strategies, mergers &amp; acquisitions.</p>\n\n<p>Mark previously served as the Vice President M&amp;A and Alliances and the Chief Business Development Officer at VeriSign. In this role, he identified strategic partners and services in the wireless world that would compliment VeriSign technology in the area of payments, security and navigation. Upon the formation of VeriSign Communication Services, he has taken on a similar role in leading the business development and strategy effort, responsible for managing strategic partnerships, business development activity and the launching of new products and services, as well, as Mergers and Acquisitions.</p>\n\n<p>Prior to joining VeriSign in February 2001, Mark Fruehan spent 5 years as Vice President of Global Services and Corporate Business Development for CellStar Corporation, the largest distributor and value-added logistics provider in the wireless space. Mark led the effort to expand CellStar&#8217;s reach globally via acquisitions, partnerships and new services to carriers, manufacturers and retailers all over the world. Thru acquisitions, partnerships and logistics services CellStar quickly grew to sales in excess of $2.25 Billion. Mark was a visionary in utilizing the Internet to manage all aspects of the fulfillment process in the handling of Customer Premise Equipment and expanding CellStar capabilities from a Wholesale distributors to the leading wireless value-added distributor.</p>\n\n<p>Previous to CellStar Mark was Sales Director from 1991 - 1996 for Fujitsu Network transmission Systems. He was responsible for handheld product road map, marketing, sales and support for North America, South America, Australia and Korea.</p>\n\n<p>Prior to joining Fujitsu, Mr. Fruehan served in various executive capacities for the Pennsylvania Super System of Vanguard Cellular Systems from 1986-1991, where he helped drive the strategy, sales and marketing in one of the premier Cellular One Affiliates. Annual revenues achieved were in excess to $100 million, with Vanguard holding a market share of over 65% in this region.</p>\n\n<p>Mark’s proven record of accomplishment in driving innovation, integrating newly acquired assets and quickly mobilizing forces such as business development and sales to move into new markets, channels and launch product offerings will be an asset to Mobility Ventures portfolio companies.</p>\n\n<p>Mark has a Bachelor of Science Degree in Economics from Penn State University and was also a Member of the 1982 NCAA Football National Championship Team.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0014/9317/149317v2-max-150x150.jpg"],[[200,200],"assets/images/resized/0014/9317/149317v2-max-250x250.jpg"],[[200,200],"assets/images/resized/0014/9317/149317v2-max-450x450.jpg"]],"attribution":"<p>Mark Fruehan</p>"},"degrees":[{"degree_type":"Bachelor of Science Degree ","subject":"Economics","institution":"Penn State University ","graduated_year":1983,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Mobility Ventures","permalink":"mobility-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,32],"assets/images/resized/0005/0619/50619v6-max-150x150.jpg"],[[250,54],"assets/images/resized/0005/0619/50619v6-max-250x250.jpg"],[[450,97],"assets/images/resized/0005/0619/50619v6-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://mobilityventures.com/team_mfruehan.php","title":"Mobility Ventures - Mark Fruehan bio"},{"external_url":"http://www.opera.com/press/releases/2010/01/20/","title":"Opera Software acquires Ad Marvel"},{"external_url":"http://www.globenewswire.com/newsroom/news.html?d=224434","title":"Axesstel Names Mark Fruehan to Board of Directors"}]}