{"first_name":"Mark","last_name":"Brooks","permalink":"mark-brooks-2","crunchbase_url":"http://www.crunchbase.com/person/mark-brooks-2","homepage_url":"http://www.onlinepersonalswatch.com/about.html","birthplace":"","twitter_username":"markcbrooks","blog_url":"http://www.onlinepersonalswatch.com","blog_feed_url":"","affiliation_name":"Online Personals Watch","born_year":1971,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jul 01 08:55:12 UTC 2009","updated_at":"Wed Sep 14 13:51:42 UTC 2011","overview":"<p>Internet Dating Business Consultant </p>\n\n<p>Mark Brooks operates a boutique consultancy that exclusively serves internet dating and social networking companies. He has advised the CEO&#8217;s of Friendster, Friendfinder, Cupid, Webdate, PlentyofFish, TRUE among others, and has worked in the online community space since 1998.</p>\n\n<p>When Mark earned his B.S. Engineering Management from the University of Hertfordshire (near London), online dating was just beginning to take shape on the message boards and forums of the internet. He originally ventured to the U.S.A. to help start a community aerial photography company in Pennsylvania in 1991.</p>\n\n<p>After graduating in 1994, he sold non-contact laser-based metrology and particle measuring systems to the likes of HP, Intel and Seagate.</p>\n\n<p>By 1998, Mark saw the potential that the internet held for helping people connect and moved to California to start Ace-Club.com, an adventure and social club serving Silicon Valley, and then help start eturn (now Remoba), an early competitor to Plaxo. In 1999 Mark helped develop an early personality profiling dating site called Hypermatch which was sold to EZBoard.</p>\n\n<p>In 2003 he worked with Jonathan Abrams at Friendster to seed the Friendster community through media relations, promoters and events. He then joined FriendFinder to assist Dr Conru and Dr Zhang with media relations and business development. He left FriendFinder with Dr Zhang to help design and build the personality profiling based diet site, Diet.com, and then worked as VP for Cupid.com to overhaul the site design and acquire a speed-dating company and expand it into 70 U.S. cities.</p>\n\n<p>June 2004 marked the first post on OnlinePersonalsWatch.com. &#8216;OPW&#8217; has become the #1 online resource for the business of online dating and matchmaking. SocialNetworkingWatch.com followed in August 2006.</p>\n\n<p>Mark&#8217;s expertise in the industry has made him a regular keynote speaker at conferences around the world and a highly sought after consultant to internet dating and social networking companies.</p>\n\n<p>He also writes for TechCrunch, and manages the speaker agenda and media relations for the Internet Dating &amp; Social Networking Conferences. Mark is currently the President of the Internet Dating Executive Alliance.</p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0005/3062/53062v1-max-150x150.jpg"],[[250,166],"assets/images/resized/0005/3062/53062v1-max-250x250.jpg"],[[450,299],"assets/images/resized/0005/3062/53062v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.S. (with hons)","subject":"Engineering Management","institution":"University of Hertfordshire (N.London)","graduated_year":1994,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Editor","firm":{"name":"Online Personals Watch","permalink":"online-personals-watch","type_of_entity":"company","image":{"available_sizes":[[[150,18],"assets/images/resized/0005/3059/53059v1-max-150x150.png"],[[250,31],"assets/images/resized/0005/3059/53059v1-max-250x250.png"],[[450,56],"assets/images/resized/0005/3059/53059v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}