{"first_name":"Marko","last_name":"Budgyk","permalink":"marko-budgyk","crunchbase_url":"http://www.crunchbase.com/person/marko-budgyk","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"E3D Labs","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue May 18 22:32:44 UTC 2010","updated_at":"Fri May 21 16:45:02 UTC 2010","overview":"<p>Budgyk has a BA from Pomona College in Economics and an MBA from the University of Chicago in Finance and Econometrics. After graduating in 1982, Mr. Budgyk was employed as an analyst for TOSCO, an oil refiner and oil shale development firm. TOSCO is now part of Conoco-Phillip. Subsequently, Mr. Budgyk joined Houlihan, Lokey, Howard &amp; Zukin (HLHZ), a global boutique investment bank headquartered in Los Angeles. He performed solvency opinions, valuation analysis and founded Houlihan, Lokey Investment Management. He became a Managing Director in 1990. Mr. Budgyk purchased the investment management division from HLHZ in 1994, forming Helix Investment Partners, a Registered Investment Advisor and Hedge Fund, employing a proprietary capital arbitrage strategy. Helix&#8217; clients included pension funds, endowments, family offices, fund-of funds, private banks and other institutional investors. At its peak, Helix managed $450 million. Mr. Budgyk also founded Helix Trading, an NASD registered broker-deal. He held a series 24 and series 7 license, among others.Helix was unwound in 2005, with capital returned to investors. In 2007, Mr. Budgyk co-founded Diamond Wealth Advisors, a Registered Investment Advisor and multi-family office. Diamond Wealth was unwound in November, 2008.</p>\n\n<p>Mr. Budgyk is currently the Chief Networking Officer of E3D Labs</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CNO","firm":{"name":"E3D Labs","permalink":"e3d-labs","type_of_entity":"company","image":{"available_sizes":[[[150,97],"assets/images/resized/0008/7679/87679v2-max-150x150.png"],[[209,136],"assets/images/resized/0008/7679/87679v2-max-250x250.png"],[[209,136],"assets/images/resized/0008/7679/87679v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}