{"first_name":"Mark","last_name":"G. Miller","permalink":"mark-miller-2","crunchbase_url":"http://www.crunchbase.com/person/mark-miller-2","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":"","created_at":"Wed May 07 21:58:03 UTC 2008","updated_at":"Mon Jun 22 17:13:27 UTC 2009","overview":"<p>Mark Miller adds over two decades of entrepreneurial leadership experience to Meakem Becker Venture Capital. In his role as Senior Director, Mark focuses on generating investment deal flow and strategic relationships for the firm. Before joining Meakem Becker in 2006, Mark was Chairman, Chief Executive Officer and President of Solutions Consulting, a leading business process and software implementation firm he founded in 1992 to serve Fortune 1000 clients. For three straight years, Solutions Consulting was recognized by Inc. Magazine as one of America’s Fastest Growing Companies. The company grew to nearly $50 million of revenue before he and other shareholders sold it to Perot Systems in 2000. He remained on as the CEO and President, while serving as a senior executive at Perot Systems until 2005.\nFrom the late 1980’s to early 90’s, Mark served in senior client management positions with the consulting firm of Accenture, leading global business and technology initiatives. Throughout his tenure with Solutions and Accenture he led business and systems integration initiatives at major companies including GlaxoSmithKline, Gerber, Domino Sugar, Ryerson Till, Calgon Carbon, Advanced Micro Devices, MicroAge, Tropicana, Heinz, Cargill, Kennametal, Nortel Networks and Wheeling Pittsburgh Steel. Prior to his consulting career, he served as a Senior Engineer for IBM, responsible for the implementation, support and operation of a state-of-the-art semiconductor manufacturing facility.\nMark is a graduate of Georgia Tech with a B.S. degree in Chemical Engineering and a Masters of Science in Metallurgy. He earned an M.B.A., Phi Beta Kappa, from the University of Pittsburgh’s Katz Graduate School of Business. Mark has received distinguished alumni awards from both institutions.\nMark has been married for twenty-two years. He and his wife, Kim, have three children.\nYou can contact Mark by emailing him at mmiller@mbvc.com.</p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0005/0157/50157v2-max-150x150.jpg"],[[120,160],"assets/images/resized/0005/0157/50157v2-max-250x250.jpg"],[[120,160],"assets/images/resized/0005/0157/50157v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Senior Director","firm":{"name":"Meakem Becker Venture Capital","permalink":"meakem-becker-venture-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,27],"assets/images/resized/0001/8151/18151v1-max-150x150.png"],[[250,45],"assets/images/resized/0001/8151/18151v1-max-250x250.png"],[[333,60],"assets/images/resized/0001/8151/18151v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}