{"first_name":"Mark","last_name":"Ashida","permalink":"mark-ashida","crunchbase_url":"http://www.crunchbase.com/person/mark-ashida","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 07 20:08:29 UTC 2008","updated_at":"Fri Nov 07 20:31:47 UTC 2008","overview":"<p>Mark Ashida joined OVP Venture Partners in 2007 and focuses on investments in infrastructure and enterprise software.</p>\n\n<p>Prior to joining OVP, Mark served as General Manager of Windows Enterprise Networking at Microsoft Corp., where he drove all development, testing and product management for Microsoft&#8217;s networking infrastructure and authentication servers, representing over $450 million in enterprise sales. In particular, Mark drove Network Access Protection (NAP), a major new networking initiative done in partnership with Cisco and over 100 security and networking companies. Prior to Microsoft, Mark was Chief Operating Officer at InterTrust, a public company. InterTrust provided secure trusted computing for web services and distribution and was the leading company in digital rights management. The company was sold to Sony and Philips for $450M in 2002. Before joining InterTrust, Mark was a General Manager at Intel Corporation, launched three companies, served as a turnaround specialist for troubled technology companies and spent time as a strategy consultant as a partner at Deloitte and Touche/Braxton Associates.  He currently serves on the Board of Directors for Avenda, DepotPoint and Serus, and is a Board Observer to Accelerator, Collaborative Software Initiative, Napera Networks, and Tzero.</p>\n\n<p>Mark received his undergraduate degree from Pomona College and his MBA from Harvard Business School. </p>","image":{"available_sizes":[[[150,143],"assets/images/resized/0002/8036/28036v2-max-150x150.jpg"],[[239,229],"assets/images/resized/0002/8036/28036v2-max-250x250.jpg"],[[239,229],"assets/images/resized/0002/8036/28036v2-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.ovp.com/the-team/managing-directors/mark-ashida.html\" title=\"OVP\" rel=\"nofollow\">OVP</a></p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}