{"first_name":"Mark","last_name":"Ruzomberka","permalink":"mark-ruzomberka","crunchbase_url":"http://www.crunchbase.com/person/mark-ruzomberka","homepage_url":"http://www.ruzomberka.com","birthplace":"","twitter_username":"","blog_url":"http://www.ruzomberka.com","blog_feed_url":"","affiliation_name":"Navteq","born_year":null,"born_month":null,"born_day":null,"tag_list":"penn-state, ist, sem, analytics","alias_list":null,"created_at":"Thu Oct 01 17:39:44 UTC 2009","updated_at":"Fri Oct 02 01:05:43 UTC 2009","overview":"<p>Mark Ruzomberka is a leader in the Global Digital Economy. </p>\n\n<p>In August 2009 Mark joined Unreal Marketing to work as a Search Engine Marketing Manager. Mark also works on Unreal’s spin-off company createTraffic.com. While Unreal Marketing is a long established agency with large clients createTraffic.com is a new start-up focusing on the explosive opportunities online for small business and local search. Mark has been a speaker at Search Engine Strategies - Chicago, eMetrics - Washington D.C. as well as for the Penn State University. </p>\n\n<p>Mark began his career when he joined Mobility Technologies in August 2003 while the company had roughly 250 people and covered only 14 major markets. In March 2005 the company name reverted back to Traffic.com. In January 2006 the Initial Public Offering on NASDAQ as TRFC was completed. At the same time he lead a project to analyze Traffic Incident data jointly with the IST department at Penn State. Over a year later the research that was started with Penn State directly led to reports that ran on a daily basis. Traffic.com analyzed thousands of rows of traffic data every day using Crystal Reports and automatically send the results to the field, for action.</p>\n\n<p>In late 2006 Chicago based map data company NAVTEQ tendered an offer to acquire Traffic.com. As of the completion of the Merger in 2007 they covered over 51 markets with nearly 700+ people at Traffic.com, making for a combined company of over 3,000 NAVTEQ employees. In early July 2008 Nokia completed their acquisition of NAVTEQ and thus, Traffic.com. This increased the size of the company from 250 to over 100,000 in less than 5 years.</p>","image":null,"degrees":[{"degree_type":"Bachelors","subject":"Information Sciences and Technology","institution":"Penn State","graduated_year":2003,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Senior Product Analyst","firm":{"name":"Navteq","permalink":"navteq","type_of_entity":"company","image":{"available_sizes":[[[150,33],"assets/images/resized/0009/0499/90499v1-max-150x150.jpg"],[[250,56],"assets/images/resized/0009/0499/90499v1-max-250x250.jpg"],[[263,59],"assets/images/resized/0009/0499/90499v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Data Quality Analyst","firm":{"name":"Traffic.com","permalink":"traffic-com","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/markruzomberka","title":"Mark Ruzomberka LinkedIn"}]}