{"first_name":"Mark","last_name":"Caruso","permalink":"mark-caruso","crunchbase_url":"http://www.crunchbase.com/person/mark-caruso","homepage_url":"http://www.carusolaw.com/","birthplace":"United States","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1950,"born_month":1,"born_day":1,"tag_list":"accident-attorney-albuquerque, auto-accident-attorney-albuquerque, brain-injury-attorney-albuquerque, car-accident-attorney-albuquerque, dog-bite-attorney-albuquerque, injury-attorney-albuquerque, albuquerque-accident-attorney, albuquerque-auto-accident-a","alias_list":null,"created_at":"Fri Nov 02 07:06:43 UTC 2012","updated_at":"Sun Nov 04 00:48:57 UTC 2012","overview":"<p>We Fight For You</p>\n\n<p>I want to personally thank you for considering the Personal Injury Law Center of Caruso Law Offices, PC. I realize that you have many options in seeking legal representation, and the number of alternatives can be quite overwhelming. In order to help you decide if our firm is right for you, I would like to tell you a little about myself and our firm.\nFor me, representing the rights of victims is more than a career-it’s a personal mission.\nBecause of our professionalism, honesty, and integrity (while still maintaining our aggressiveness), we enjoy an excellent reputation throughout the legal community. We represent injury victims nationwide as well as throughout New Mexico and California through our national network of aggressive and successful law firms.\nCaruso Law Offices, PC investigates every aspect of each case to achieve a successful presentation of our clients’ personal injury claims. We have the financial resources to take on any defendant, no matter how large or how rich. All of our attorneys are highly experienced, and our special approach to handling cases enables these attorneys to monitor, update and deal with each and every issue for the successful resolution of our clients’ claims. By using state of the art technology, in addition to having the very best teams available, we can pride ourselves in being able to obtain the absolute best results for our clients. When necessary, we also hire the best trial experts including accident reconstruction specialists, the best investigators, etc. for our clients’ claims.\nI graduated with honors from Pepperdine University in 1979 and with honors from Pepperdine University School of Law in 1982. I was a member of the Honor Board at Pepperdine University School of Law. I am licensed in all courts of California and New Mexico. Early in my career, I worked with the Federal Trade Commission in Los Angeles and as a lobbyist. For several years, I represented large corporations and insurance companies handling auto accident and products liabilities claims. From 1991 until 1995, I served as an elected State Representative. I have represented and continue to represent victims of auto accidents, premises liability, medical/dental/legal malpractice, breast implants, diet drugs (fen-phen and Redux) and Vioxx. I have regularly appeared in the new media to speak on auto accidents, diet drugs and breast implants.\nThe Personal Injury Law Center of Caruso Law Offices, PC is committed to the pursuit of justice. Our goal is to obtain outstanding results for our clients by holding the wrong-doers of society responsible for their actions. We believe that we can create a safer and more responsible community.\nOur goals are: to pursue justice for all; to reserve the constitutional right to a jury trial; to help protect those who cannot protect themselves; to help restore dignity and quality of life to our clients; to obtain compensation for the victims of accidents, negligence and corporate wrongdoing; to provide quality legal services; to uphold the dignity of the legal profession; to uphold the highest standards of ethical conduct and professional legal integrity; and to make our world a safer place.</p>","image":{"available_sizes":[[[135,150],"assets/images/resized/0021/8407/218407v2-max-150x150.jpg"],[[183,203],"assets/images/resized/0021/8407/218407v2-max-250x250.jpg"],[[183,203],"assets/images/resized/0021/8407/218407v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"","subject":"","institution":"Pepperdine University","graduated_year":1979,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.carusolaw.com/","title":"Caruso Law Offices, PC"}]}