{"first_name":"Mark","last_name":"Haidar","permalink":"mark-haidar","crunchbase_url":"http://www.crunchbase.com/person/mark-haidar","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"2GO Software Solutions","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Apr 10 17:15:16 UTC 2010","updated_at":"Fri Dec 23 12:05:41 UTC 2011","overview":"<p>Mark Haidar is a solution-oriented technologist and entrepreneur with extensive experience in building complex technology solutions and frameworks. Mark has done it all, including hardware, embedded, software, mobile, database, networking, security and wireless. He has single handedly built university web-based systems, 3D game engines, internet-to-home control and communication frameworks, autonomous mobile chairs, municipality records management solutions, vehicular communication frameworks, enterprise and consumer mobile applications, cloud-based logistics systems, medical software and multi-lingual ERP systems. </p>\n\n<p>Mark was the lead researcher on a state of the art R&amp;D; project funded by the US Army Tank Automotive Research Development Engineering Center (TARDEC). He was able to successfully research, design, develop, and validate an original service-oriented intra and inter-vehicle communication system for transportation, robotic, and military systems. He later founded Dialexa LLC, an I.T. Solutions company that offered a variety of affordable I.T. services and solutions for small and mid-size businesses and organizations in the Dallas Fort Worth metroplex. He was able to assemble and lead a local and international team of engineers in the Middle east and North Africa. In 2009, he joined 2GO Software Solutions Inc., a SAAS enterprise mobile software solutions company, as the Chief Technology Officer (CTO), where he spearheaded design, development, and support of 2GO’s products. With very limited resources, he was able to turnaround 2GO’s product lines from fragile to enterprise grade. </p>\n\n<p>Currently, Mark is a founder at Dialexa, a product-focused technology development shop and consultancy. Dialexa’s projects to date include various mobile applications, cloud computing, product consulting, complex algorithm development, hardware prototyping, UI&amp;UE; design, image processing, desktop application development and website development. Dialexa’s clients range from entrepreneurs looking to reduce technical risk and time to market, to publicly traded companies looking to bring in a team that can quickly execute products that may be beyond the abilities of their internal teams. Mark is trilingual and holds a Bachelor of Engineering in computer engineering and a Masters of Engineering in electrical engineering. He has numerous journal and conference publications and three patents pending.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder","firm":{"name":"Dialexa","permalink":"dialexa","type_of_entity":"company","image":{"available_sizes":[[[108,31],"assets/images/resized/0015/7782/157782v1-max-150x150.jpg"],[[108,31],"assets/images/resized/0015/7782/157782v1-max-250x250.jpg"],[[108,31],"assets/images/resized/0015/7782/157782v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"CTO","firm":{"name":"2GO Mobile Solutions","permalink":"2go-software-solutions","type_of_entity":"company","image":{"available_sizes":[[[125,56],"assets/images/resized/0008/3321/83321v3-max-150x150.png"],[[125,56],"assets/images/resized/0008/3321/83321v3-max-250x250.png"],[[125,56],"assets/images/resized/0008/3321/83321v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}