{"first_name":"Mark","last_name":"Gilbert","permalink":"mark-gilbert","crunchbase_url":"http://www.crunchbase.com/person/mark-gilbert","homepage_url":"http://u2project.com","birthplace":"Sacramento, CA","twitter_username":"markgilbert","blog_url":"http://u2project.com/blog","blog_feed_url":"http://u2project.com/feed","affiliation_name":"Unaffiliated","born_year":1957,"born_month":5,"born_day":10,"tag_list":"local-search-marketing, internet-video-marketing, search-engine-marketing, online-marketing, local-video-marketing, video-search-marketing, search-engine-optimization, seo, free-internet-marketing-tools","alias_list":null,"created_at":"Sat Jul 17 15:34:35 UTC 2010","updated_at":"Mon Jul 19 20:00:42 UTC 2010","overview":"<p>When Mark was still a young boy at home, his dad was a cookware salesman. Mark remembers his dad giving him bread knives to sell door to door when he was 12 years old when he wanted to earn money. He bought the knives from his dad for $1 and then sold them for $2. He would come home 5 or 6 knives sold in less than an hour, and felt like the richest kid on the block. That was the beginning of Mark&#8217;s entrepreneurial &amp; career. He&#8217;s been in sales and marketing ever since.</p>\n\n<p>In 1997 Mark decided to throw in the towel on a distriborship he owned in Northern California to pursue the Internet (whatever that meant at the time). All he knew then was that the Internet was going to be the next &#8220;gold rush&#8221;. So he loaded up the family and moved to Oregon, spending 12-14 hours a day, 7 days a week, studying Internet marketing patterns and business processes on the Internet.</p>\n\n<p>He decided to join a network marketing program and test some marketing processes on the Internet. The next 3 years Mark built several mlm organizations as large as 5,500 in one downline in 120 days or less, and wouuld be in and out of over 10 different companies. During that time, he found a common thread between all the companies he had joined: everyone needed fresh qualified prospects. The problem was that there was really no company that had built an online lead system that met the needs of the mlm industry.</p>\n\n<p>So he approached a member of one of his downlines, who was a sharp programmer, to bounce some ideas off of him. Together they both ended up building a system that would drive traffic to one landing page and distribute live inquiries simultaneously to hundreds of campaign participants, while keeping the data exclusive and organized in each participant&#8217;s password protected backoffice.</p>\n\n<p>This was revolutionary at the time (1999), and soon became the standard for &#8220;lead generation&#8221; companies who followed their footsteps. They developed online ad campaigns for many verticals, including Legal, Debt, Mortgage, and others, in addition to Business Opportunity seekers. They also went on to develop highly customized ad campaigns for other Internet Marketing companies.</p>\n\n<p>Today, Mark is fascinated by the social networking landscape with all the communities, applications, and strategies for building relationships first, and exposing products and services last. He says he will forever be experimenting with marketing and business processes to exploit the power of the Internet, with its benefits of innovation and automation for making money. </p>\n\n<p>Mark&#8217;s passion is helping local businessess get their footprint on the first page of Google and other search engines to dominate their competition. He feels stronger than ever about helping them today in the economic climate that is hurting most companies. He loves nothing more than putting a smile on his client&#8217;s face.</p>","image":{"available_sizes":[[[121,150],"assets/images/resized/0009/3952/93952v2-max-150x150.jpg"],[[162,200],"assets/images/resized/0009/3952/93952v2-max-250x250.jpg"],[[162,200],"assets/images/resized/0009/3952/93952v2-max-450x450.jpg"]],"attribution":"<p>CEO</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://u2project.com/about","title":"CEO"}],"web_presences":[{"external_url":"http://twitter.com/markgilbert","title":""},{"external_url":"http://www.linkedin.com/in/markgilbert","title":""},{"external_url":"http://www.betternetworker.com/members/u2projectcom","title":""},{"external_url":"http://www.facebook.com/the.markgilbert","title":""},{"external_url":"http://markgilbert.myplaxo.com","title":""}]}