{"first_name":"Mark","last_name":"Granahan","permalink":"mark-granahan","crunchbase_url":"http://www.crunchbase.com/person/mark-granahan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jul 23 14:08:42 UTC 2009","updated_at":"Thu Jul 23 14:09:17 UTC 2009","overview":"<p>Mr. Granahan is a founder and CEO of CICLON Semiconductor Device Corp. Prior to starting CICLON, Mr. Granahan held a variety of Business Management positions at Lucent Microelectronics (now Agere Systems). He was responsible for the creation of the Analog Products Division (APD) which generated over $250M in revenue growth in less than three years. He led the $150M acquisition of VTC HDD Preamp business solidifying Lucent’s position as the number one supplier of HDD components. While at Texas Instruments, Mr. Granahan was responsible for the global expansion of its Standard Linear Business which contributed over $200M in revenue growth for TI from 1987 to 1993.</p>\n\n<p>Mr. Granahan has over 20 years of experience in the Semiconductor industry. Through the years, Mr. Granahan has held a variety of Engineering, Product Line Management, Product Marketing, Business Development and Executive Management positions. Though his technical expertise was initially focused on Analog and Mixed Signals, his business management expertise includes Optical Components, Processors, and large digital System on Chip [SOC] solutions for the Communications market.</p>\n\n<p>Mr. Granahan received a B.S. in Materials Science from Penn State University and a M.S. in Management Science from the University of Texas.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President /CEO/Chairman","firm":{"name":"Ciclon Semiconductor Device Corporation","permalink":"ciclon-semiconductor-device-corporation","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0005/3991/53991v1-max-150x150.png"],[[250,57],"assets/images/resized/0005/3991/53991v1-max-250x250.png"],[[354,82],"assets/images/resized/0005/3991/53991v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}