{"first_name":"Mark","last_name":"Losh","permalink":"mark-losh","crunchbase_url":"http://www.crunchbase.com/person/mark-losh","homepage_url":"http://www.prevailventures.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"raising-venture-capital, sales-growth-strategies, business-planning, mergers-acquisitions, exits","alias_list":null,"created_at":"Sat Mar 20 19:21:08 UTC 2010","updated_at":"Sun Mar 21 04:11:22 UTC 2010","overview":"<p>As the Founder and Chief Executive of Prevail Ventures, Mark Losh is an advisor and mentor to high technology companies. Mark advises in the areas of; securing capital funding, business planning and modeling, market validation, go-to-market and growth strategies, sales and distribution models, strategic relationships, product roadmap and launch planning, and evaluating exit strategies. </p>\n\n<p>Mark is a sought after panelist and frequent contributor on topics related to the pros and cons of venture funding, entrepreneurialism, team building, and efficient scaling of high growth companies. During his 25 years as a high tech executive, Mark has significant experience in all aspects of the software, wireless, mobile, internet, and digital media markets.</p>\n\n<p>Mark spent 18 years building venture-backed software companies and has participated in more than two dozen rounds of financing, raising more than $200 million from blue chip venture and private equity firms, including Sequoia Capital, Greylock Partners, Mohr Davidow Ventures, Lightspeed Venture Partners, Granite Ventures, Crosspoint Ventures, Hummer Winblad, Norwest Ventures, Palm Ventures, and numerous others. His efforts have resulted in 2 IPO&#8217;s and 8 mergers creating greater than $3 billion in market value.</p>\n\n<p>Mark started and ran several Worldwide Field Operations organizations – sales, marketing, strategic alliances, product management, professional services, and technical support. These companies ranged in size from $0 in revenue to $180M in revenue and 1,200 employees. Mark has been responsible for securing and managing charter relationships &#8211; both directly with end user companies (always premier category leaders) and with multi-tiered distributors and strategic partners such as; Accenture, AOL, BEA, BMC, Compaq, EDS, HP, IBM, Microsoft, Oracle, KPMG, RSA, Sun Microsystems, T-Mobile, and Verizon Wireless.</p>\n\n<p>Prior to starting Prevail Ventures, Mark was Senior Vice President, Sales and Marketing at Brience, a leading supplier of wireless portal solutions (acquired by TSI Communications).  Mark also held executive positions with; Kenamea (acquired by Scivantage), Covalent Technologies (acquired by SpringSource), Shaman Corporation (acquired by Corporate Software and Technology), Foglight Software (acquired by Quest Software), UniKix Technologies (acquired by Sun Microsystems), KnowledgeWare, Inc., (acquired by Sterling Software), and Applied Data Research (acquired by Computer Associates). </p>\n\n<p>Mark graduated with Distinguished Honors in Computer Information Systems from Purdue University in December, 1985.</p>","image":{"available_sizes":[[[126,150],"assets/images/resized/0008/1108/81108v2-max-150x150.jpg"],[[210,250],"assets/images/resized/0008/1108/81108v2-max-250x250.jpg"],[[378,450],"assets/images/resized/0008/1108/81108v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BS","subject":"Computer Technology","institution":"Purdue University","graduated_year":1985,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/marklosh","title":"Mark Losh - LinkedIn"}]}