{"first_name":"Mark","last_name":"Hamade","permalink":"mark-hamade","crunchbase_url":"http://www.crunchbase.com/person/mark-hamade","homepage_url":"http://www.pkmsteel.com","birthplace":"Beirut, Lebanon","twitter_username":"markhamade","blog_url":"http://www.markhamade.com","blog_feed_url":"","affiliation_name":"PKM Steel","born_year":1974,"born_month":1,"born_day":28,"tag_list":"human-capital, recruiting, private-equity","alias_list":null,"created_at":"Tue Jul 08 18:50:31 UTC 2008","updated_at":"Wed Aug 17 19:22:28 UTC 2011","overview":"<p>A fit dynamic executor, change agent, visionary &amp; mentor skilled in leading organizations to success.  As a Chief Operating Officer of a group of companies in the manufacturing sector, including PKM Steel, Salina Steel, and MSS Transport, Mark Hamade carries executive level responsibilities in the areas of human resources and operations. His extensive business experience is uniquely positioned to help his companies leverage strengths and grow business. Mark leads the implementation of strategy and continues to forge relationships with key influences in the manufacturing industry.</p>\n\n<p>Mark enjoys more than 14 years of leadership experience with top-tier companies. He specializes in vision and mission re-engineering as well as setting goals and objectives for human resources. Mark ensures that each business recruits, maintains, develops and rewards a high-quality workforce in order to successfully manage change.</p>\n\n<p>His extensive business experience gives Mark a unique set of talents:: effective leadership, HR, P&amp;L management, strategic thinking, organizational design, behavior and architecture, social networking, solution identification, mergers and acquisitions, organizational performance, recruitment, investment (start-ups, angel, private, and venture) sales, consulting, compensation, international know how, executive coaching, strategic alliances, contract negotiations, motivational speaking, a key understanding of legal issues, presentation skills, ability to deal with people from all backgrounds, and a high level of administrative competency.</p>\n\n<p>Mark is passionate about all types of companies: Start-Ups, Early-Stage, Growing Companies and Fortune 500. He is equally dedicated to people, human capital and training. </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0002/1633/21633v4-max-150x150.jpg"],[[167,250],"assets/images/resized/0002/1633/21633v4-max-250x250.jpg"],[[291,434],"assets/images/resized/0002/1633/21633v4-max-450x450.jpg"]],"attribution":"<p>documents</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Operating Officer","firm":{"name":"Salina Steel","permalink":"salina-steel","type_of_entity":"company","image":null}},{"is_past":false,"title":"Chief Operating Officer","firm":{"name":"PKM Steel","permalink":"pkm-steel","type_of_entity":"company","image":null}},{"is_past":false,"title":"Chief Operating Officer","firm":{"name":"MSS Transport","permalink":"mss-transport","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}