{"first_name":"Mark","last_name":"Yellen","permalink":"mark-yellen","crunchbase_url":"http://www.crunchbase.com/person/mark-yellen","homepage_url":"http://myfilmconsult.com","birthplace":"Connecticut","twitter_username":"markhyellen","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"producer, film, entertainment, executive, consultant","alias_list":null,"created_at":"Wed Apr 13 16:57:24 UTC 2011","updated_at":"Sat Apr 16 18:34:40 UTC 2011","overview":"<p>Mark has extensive experience producing Feature Films, Music Videos and Commercials.  His feature film credits include the award winning Shiloh and its sequel, Shiloh Season; One Good Turn; Fist of the North Star; Amityville Dollhouse; Puerto Vallarta Squeeze; Blast; Montana; The Big Squeeze; Where the Rivers Flow North; and Guncrazy (in which Drew Barrymore was nominated for a Golden Globe), amongst others. A graduate of the San Francisco Art Institute, Mark cut his teeth working with Frances Ford Coppola at American Zoetrope where Mark produced his first Feature Film, Indigo. In addition to his tenure as a Feature Film Producer, Mark has extensive experience as a Second Unit Director, Line Producer, and First Assistant Director on Feature Films, Commercials and Music Videos. Mark also serves as a private consultant providing advising and mentoring services to individuals, emerging filmmakers, and established producers seeking creative guidance, production advice, logistic or information support throughout any stage of the filmmaking process. A member of the Producers Guild of America, Mark has several independent and studio feature films in active development. (http://imdb.com/name/nm0947390/)</p>","image":null,"degrees":[{"degree_type":"BA","subject":"Film","institution":"San Francisco Art Instutue","graduated_year":1985,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://imdb.com/name/nm0947390/","title":"IMDB"}],"web_presences":[{"external_url":"http://www.linkedin.com/home?trk=hb_tab_home_top","title":"LinkedIn"}]}