{"first_name":"Mark","last_name":"H. Corley","permalink":"mark-h-corley","crunchbase_url":"http://www.crunchbase.com/person/mark-h-corley","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"CWR Mobility","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jan 17 23:11:05 UTC 2011","updated_at":"Fri Jan 28 03:21:15 UTC 2011","overview":"<p>Mark Corley has more than 25 years of experience in high technology, including software, consulting and startup worlds as well as in global leaders KPMG and Microsoft.  He was named CEO of CWR Mobility BV in 2010 and has end-to-end responsibility for the entire business.  </p>\n\n<p>Corley was a General Manager in Microsoft’s Business Solutions division for seven years.  During this time, he was responsible for building Microsoft’s global Software + Service business for Dynamics CRM and he was also responsible for managing all channel strategy.</p>\n\n<p>Previously, he managed the division’s worldwide field organization, where he drove a 3-year change effort to integrate the stand-alone division into the rest of Microsoft.  Corley also managed the division’s marketing strategy, which included advertising, branding and go-to-market strategy.</p>\n\n<p>Prior to Microsoft, Corley worked for KPMG Consulting Inc.  In 2000 he was named managing director in the high-tech practice and lead partner for the Microsoft account where he oversaw all consulting services provided to Microsoft.  </p>\n\n<p>Corley moved to KPMG Consulting after five years as CEO of Los Angeles-based Select One, where he built and managed an alliance of IT-consulting firms.  He previously spent eight years as president of Software Creations, a full-service IT-consulting firm.</p>\n\n<p>Mark Corley holds a master of business administration degree from the University of Southern California and a bachelor of science degree in international management and finance from Georgetown University.  He has lived in Spain and Japan and speaks Spanish and some Japanese.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"CWR Mobility","permalink":"cwr-mobility","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0011/7749/117749v6-max-150x150.png"],[[200,200],"assets/images/resized/0011/7749/117749v6-max-250x250.png"],[[200,200],"assets/images/resized/0011/7749/117749v6-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}