{"first_name":"Mark","last_name":"Loder","permalink":"mark-loder","crunchbase_url":"http://www.crunchbase.com/person/mark-loder","homepage_url":"http://8140202.youngevityonline.com","birthplace":"Wingham","twitter_username":"mark_loder","blog_url":"","blog_feed_url":"","affiliation_name":"Natures Sunshine  Products","born_year":1958,"born_month":9,"born_day":6,"tag_list":"","alias_list":null,"created_at":"Mon Nov 22 19:36:18 UTC 2010","updated_at":"Tue Nov 23 00:38:42 UTC 2010","overview":"<p>Mark Loder is self-employed owner of Your Health Matters. He has been trained in several areas of expertese in the Health Industry. Particularly on products that improve your health and wellness. He has taken several courses on Natural Herbology, Body Systems and their function and herbs to treat diseases of the body. He also has several Doctors working with his company that have several degrees in health, nutrition, and prevention of disease in the human body as well as animal body systems. This education gives him several knowledgeable insights to treating diseases with a natural health outlook using herbology and other natural cleaning products that do not destroy the natural tissues of the body, ei. {No Harmful Chemicals, such as CHLORINE or ALCOHOL that destroy human tissue}. More and more people are turning to  natural health alternatives because of the serious side effects caused by drugs and cleaning chemicals used in hospitals where the side effects are worse only masking of the disease. Drugs and cleaning chemicals used to treat diseases really don&#8217;t help the patient but just cover up the symptoms. Drugs cause more health related issues for the patient which in the end natural health consellors like Mark Loder help to resolve because of the damage that has occurred form Drug Treatment Therapies by Doctors and the chemicals used in hospitals that cause more damage to the lungs, skin, and the immune system. Mark Loder has the insight into providing herbs and products that are safe with proper diagnosis, treatment, and appliaction of herbal products that help patients recover from diseases to build their immune system to fight such diseases. </p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0011/1242/111242v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0011/1242/111242v2-max-250x250.jpg"],[[450,299],"assets/images/resized/0011/1242/111242v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Natural Health Counsellor","subject":"Ntural Health Consultants Course","institution":"Natures Sunshine  Products","graduated_year":2001,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Counsellor","firm":{"name":"Natures Sunshine  Products","permalink":"natures-sunshine-products-2","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.mynsp.com/yourhealthmatters","title":"Health Counsellor"}],"web_presences":[{"external_url":"http://www.facebook.com/mark_loder1","title":"Herbalist"}]}