{"first_name":"Mark","last_name":"Yolton","permalink":"mark-yolton","crunchbase_url":"http://www.crunchbase.com/person/mark-yolton","homepage_url":"http://scn.sap.com/people/mark.yolton","birthplace":"Texas","twitter_username":"markyolton","blog_url":"http://scn.sap.com/people/mark.yolton/content#filterID=contentstatus%5Bpublished%5D~objecttype~objecttype%5Bblogpost%5D&sortKey=contentstatus%5Bpublished%5D~creationDateDesc&sortOrder=0","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1960,"born_month":5,"born_day":20,"tag_list":"sap-social-community","alias_list":null,"created_at":"Tue Jul 17 14:37:34 UTC 2012","updated_at":"Wed Jul 18 03:09:02 UTC 2012","overview":"<p>Mark Yolton is Senior Vice President of SAP Communities and Social Media at SAP.  </p>\n\n<p>This responsibility includes managing and leading: </p>\n\n<p>• The hosted social network for SAP professionals: the world-class SAP Community Network (SCN) at http://scn.sap.com </p>\n\n<p>• Events that serve this community, specifically global SAP TechEd conferences and the SAP Technology Forum series </p>\n\n<p>• SAP’s brand-level presence on public social media such as Facebook, Twitter, LinkedIn, YouTube, SlideShare, and others </p>\n\n<p>• The enabling tools, training, metrics and analytics, internal consulting, playbooks, governance, operating model, and strategies for SAP business units to lead with and leverage social media in their operations </p>\n\n<p>Mark Yolton has been leading the SAP Community Network and related SAP TechEd conferences for all of his 6+ years at SAP, at times also managed SAP’s standards and open source team, helped found SAP EcoHub (now SAP Store) online commerce site, and later added broader responsibility to lead SAP’s social media properties and social business strategy and execution.  </p>\n\n<p>Mark joined SAP by way of Sun Microsystems, PeopleSoft, Oracle, Unisys, and The Prudential.  His background includes field, regional, and headquarters roles in marketing, communications, global ecosystems, the web, and eBusiness.  </p>\n\n<p>Mark has degrees from Shippensburg University in Pennsylvania (Communications / Journalism / Marketing), and completed MBA coursework and continuing executive education at LaSalle University (Philadelphia, PA), at INSEAD (France), and at Stanford University (California).  </p>\n\n<p>Mark is a Board Observer with InnoCentive, which operates a crowd-sourced innovation marketplace. </p>\n\n<p>He volunteers as a Board Member of the Unity Care Group, a non-profit agency serving foster children and at-risk youth and families in the Silicon Valley.  </p>\n\n<p>A Philadelphia native, Mark lives in the San Francisco Bay Area and travels globally as he works with SAP customers, partners, and colleagues around the world.   </p>\n\n<p>Mark is married to Karen Yolton (of Kaiser-Permanente), has three adult children (Kim, Kendrick, Daniel) and two grandsons. </p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0020/1493/201493v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0020/1493/201493v2-max-250x250.jpg"],[[299,450],"assets/images/resized/0020/1493/201493v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}