{"first_name":"Mark","last_name":"Pollack","permalink":"mark-pollack","crunchbase_url":"http://www.crunchbase.com/person/mark-pollack","homepage_url":"http://www.markpollack.co.uk","birthplace":"London","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Aston Chase","born_year":null,"born_month":null,"born_day":null,"tag_list":"mark-pollack, aston-chase, london, real-estate, director","alias_list":null,"created_at":"Sun Dec 02 12:09:14 UTC 2012","updated_at":"Sun Dec 09 06:19:13 UTC 2012","overview":"<p>Mark Pollack is the co-founder and Director at Aston Chase, the specialty real estate and property Investment Company in London that caters to a high-end clientele. He has more than thirty years experience in marketing and advertising UK real properties that he uses to carry out his vision for the property market in London. He makes his home in London&#8217;s Hampstead Garden Suburb with his wife of twenty years and their children. The family enjoys an adventurous life together, including taking safaris in Africa to enjoy the diverse wildlife. When he&#8217;s not working, he enjoys running, cycling and joining in backgammon competitions. </p>\n\n<p>Early Business Life:</p>\n\n<p>As a child, Mark Pollack already exhibited characteristics of ambition and inclination for success. He attended his neighborhood school, the Hasmonean Grammar School, and upon graduation he immediately began working in the property and real estate market. His first business experience was with a firm in London&#8217;s Manchester Square, and he continued from there to work in many of the best property investment companies in the city. From each job that he held, he learnt more about the property investment and real estate market and began to envision what his own company might look like. During that time period, he ran into his old school chum, Richard Bernstone, who was of a like mind regarding the real estate market. The two put their heads together, created a business model and founded Aston Chase in 1985. </p>\n\n<p>Niche Real Estate Market in Upscale London:</p>\n\n<p>Since the establishment of Aston Chase, they have focused on niche properties that they market to a very limited but upscale clientele, which means they can offer exclusivity and pay personal attention to each of their clients. They have gained a reputation for their high work standards and their growth in following current trends in the industry. By targeting quality boutique services, they are able to successfully fulfill the needs of their clients by finding the perfect property for them.  The business has continued thriving through two separate economic downturns and is still growing, but restricts itself to the key areas that it knows best. Those are the high-class neighborhoods of Highgate, Hampstead, Maida Vale, St John&#8217;s Wood, Hampstead Garden Suburb, Primrose Hill, Little Venice and Regent&#8217;s Park. The firm now occupies offices in Regent&#8217;s Park as well as in Hampstead Garden Suburb and employs a loyal staff of twenty workers, most of them have been with the company for many years. </p>\n\n<p>Turning Hobbies into Philanthropy:</p>\n\n<p>As a champion backgammon player, Mark Pollack takes advantage of his skill to help raise urgent money for a few of his favourite charities. Through his playing, he has earned substantial donations for the Norwood Charity and in addition, he runs marathons for charity. When he ran in the London Marathon, he was successful in raising almost £30,000 that he donated to the Ray&#8217;s of Sunshine Children&#8217;s&#8217; Charity. He has also raised more than £50,000 by running in marathons in the UK and in the United States.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0022/4198/224198v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0022/4198/224198v2-max-250x250.jpg"],[[190,285],"assets/images/resized/0022/4198/224198v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"co-founder and director","firm":{"name":"Aston Chase","permalink":"aston-chase","type_of_entity":"company","image":{"available_sizes":[[[120,120],"assets/images/resized/0021/9046/219046v2-max-150x150.jpg"],[[120,120],"assets/images/resized/0021/9046/219046v2-max-250x250.jpg"],[[120,120],"assets/images/resized/0021/9046/219046v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.aboutmarkpollack.co.uk","title":"About Mark Pollack"}],"web_presences":[{"external_url":"http://markpollack.tumblr.com/","title":"Mark Pollack on Tumblr"},{"external_url":"http://cvshare.net/markpollack","title":"Mark Polack on Cvshare"},{"external_url":"http://markpollack953.wordpress.com/","title":"Mark Pollack on Wordpress"}]}