{"first_name":"Mark","last_name":"O'Hare","permalink":"mark-ohare","crunchbase_url":"http://www.crunchbase.com/person/mark-ohare","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Nov 20 04:04:14 UTC 2012","updated_at":"Tue Nov 20 04:05:14 UTC 2012","overview":"<p>Mark OHare is the Founder, President and CEO for Security First Corp. which he founded in 2002. Mark is also Chairman and CEO of DRC Computer Corporation a subsidiary of Security First Corp. Mark has over 32 years of experience in leading multi-million dollar commercial and government security, engineering, and manufacturing programs. Mark has held previous positions as Chief Executive Officer, President, Chief Operating Officer, Executive Vice President and General Manager for new start-up companies for Safeguard Scientifics incubator company XL Vision Inc 1998-2001. Prior to his work at XL Vision Inc., Mark was a Captain in the United States Navy, serving as the Principal Executive Officer (PEO) for the U.S. Navys Aircraft Carrier Program in a two star Admirals position as head of the U.S. Navys $25 billion Aircraft Carrier Program. In this role he was accountable for all aspects of the Department of Defenses Aircraft Carrier Program including acquisition, research and development, design, construction, delivery, overall budget and management of the entire Aircraft Carrier program. Mark served a distinguished career in the U.S. military enjoying such duties as Head of Aircraft Carrier New Construction and shipboard assignments as intelligence officer, Chief Engineer of ships including a Nuclear Aircraft Carrier. He was a certified Navy Engineer and was the U.S. senior technical advisor to the French and British navies on aircraft carriers. Mark received his Bachelors of Science Degree from the United States Naval Academy and his Masters Degree in Mechanical Engineering from the Naval Post Graduate School. He also attended the Senior Advanced Executive Schools at Northwestern University Kellogg Graduate School of Management and the Senior Executive Program at the University of Virginia Darden Graduate School of Business. </p>","image":null,"degrees":[{"degree_type":"Bachelors of Science ","subject":"","institution":"United States Naval Academy ","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President and CEO","firm":{"name":"Security First","permalink":"security-first","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0004/9184/49184v1-max-150x150.jpg"],[[250,100],"assets/images/resized/0004/9184/49184v1-max-250x250.jpg"],[[250,100],"assets/images/resized/0004/9184/49184v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}