{"first_name":"Mark","last_name":"Relph","permalink":"mark-relph","crunchbase_url":"http://www.crunchbase.com/person/mark-relph","homepage_url":"http://microsoft.com","birthplace":"Toronto","twitter_username":"mrelph","blog_url":"http://blogs.msdn.com/mark_relph","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"microsoft","alias_list":null,"created_at":"Fri Jun 11 19:02:59 UTC 2010","updated_at":"Mon Jun 14 23:58:16 UTC 2010","overview":"<p>As Senior Director of the Windows Developer &amp; Ecosystem Team, Mark Relph’s mission is to build a rich ecosystem of hardware and software partners for Windows.  This includes supporting world class compatibility and demonstrating that hardware and software innovation is a differentiating asset of the Windows franchise.  Mark is also focused on ensuring developers embrace Windows and building a clear message to developers &amp; ISVs why their long term bet for their business is the Windows platform.</p>\n\n<p>Mark is very engaged in the technology community and regularly tweets and blogs.  He also speaks about the future of technology and the industry at technology conferences across the North America.</p>\n\n<p>Previous to the role, Mark was the Vice President of the Developer &amp; Platform (DPE) Group for Microsoft Canada. In this role Mark was focused on enhancing Canada’s technology economy &amp; ecosystem.  His organization engaged with developers and IT professionals across Canada with an emphasis on building their skills and enriching their careers.  Mark was focused on stimulating the early adoption of key aspects of the Microsoft® platform such as Microsoft’s web platform and Software + Services strategy.  His team also worked to enhance the ecosystem of independent software vendors in Canada, including working with startups and the venture capital community.  Finally, Mark’s group worked with technology students and academic institutions across Canada to ensure that the next generation of ICT professionals is prepared for the future.</p>\n\n<p>Mark has held several other positions at Microsoft Canada including as the Group Manager of the Developer Evangelism Team and the Manager of the Network Service Provider Solutions Team.  Prior to that Mark was a Business Development Manager working with Canadian technology startups and venture capital firms.  Mark originally joined Microsoft as a Technology Specialist.   Before joining Microsoft in May 1998, Mark was a Systems Engineer at Digital Equipment specializing in development of Microsoft solutions.  </p>","image":{"available_sizes":[[[148,150],"assets/images/resized/0009/0289/90289v2-max-150x150.jpg"],[[248,250],"assets/images/resized/0009/0289/90289v2-max-250x250.jpg"],[[446,450],"assets/images/resized/0009/0289/90289v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}