{"first_name":"Mark","last_name":"Daymond","permalink":"mark-daymond","crunchbase_url":"http://www.crunchbase.com/person/mark-daymond","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Aug 04 10:51:17 UTC 2011","updated_at":"Thu Aug 04 10:58:39 UTC 2011","overview":"<p>Mark Daymond is responsible for product design and engineering at INRIX. He has over 21 years of experience designing and delivering complex software systems as well as managing multi-discipline, multi regional/cultural projects.\nPrior to INRIX, Daymond was an executive at Microsoft for 15 years serving in a number of senior positions most recently as Group Program Manager for the Media Center TV team. In this position, he was responsible for all aspects of the design and delivery of the Media Center TV product which included managing a multi-national team. Previously, Daymond was the Group Program Manager for the Automotive Business Unit where he oversaw the Windows Mobile based Automotive Operating System product range, the Voice Command product, the FIAT &#8220;Blue &amp; Me&#8221; voice-activated in car communications system and other instances of this telematics technology. After successful delivery of these products Daymond became Director of Platform Development responsible for the successful delivery and review of the ABU three year worldwide product roadmap strategy.\nPrior to the Automotive group, Daymond was GPM in the Languages division for a number of releases of Visual C++, Visual C# and Visual studio, where he was responsible for all aspects of product and language design. He also previously served as principal consultant for Microsoft Consulting Services in the UK offering architectural and system level design. He was then selected to be one of the two founding consultants to build the first MCS office in Hong Kong, where he continued to serve as Principal Consultant.\nBefore Microsoft, Daymond was a co-founder of Threadz, a UK software company, responsible for a Windows 2.0 debugging product as well as Threadz Organizer, a product later acquired by Lotus. Daymond&#8217;s previous experience includes the Operational Research Special Project Unit at British Airways, where OR techniques were applied to multi-purpose computing devices, including the original IBM PC.</p>","image":{"available_sizes":[[[131,150],"assets/images/resized/0014/7785/147785v1-max-150x150.jpg"],[[187,214],"assets/images/resized/0014/7785/147785v1-max-250x250.jpg"],[[187,214],"assets/images/resized/0014/7785/147785v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Senior Vice President of Engineering","firm":{"name":"INRIX","permalink":"inrix","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0006/8926/68926v2-max-150x150.jpg"],[[250,75],"assets/images/resized/0006/8926/68926v2-max-250x250.jpg"],[[450,136],"assets/images/resized/0006/8926/68926v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}