{"first_name":"Mark","last_name":"Grovic","permalink":"mark-a-grovic","crunchbase_url":"http://www.crunchbase.com/person/mark-a-grovic","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"New Markets Venture Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 26 14:54:37 UTC 2008","updated_at":"Sat Dec 11 07:21:25 UTC 2010","overview":"<p>Mark co-founded New Markets Venture Partners in 2003 and is a General Partner. Mark serves as Board Director for Moodlerooms and Workspace.com and previously served as Board Director for Innovative Biosensors and Lightningcast (sold to NYSE: TWX). Mark also serves as a board observer for Aldagen, BioSET, Overture Technologies, Paratek Microwave, Questar Assessment, and Vision Chain.</p>\n\n<p>Mark has been investing in high growth companies since 1992. Prior to New Markets, Mark was a Portfolio Manager for the Small Enterprise Assistance Funds (SEAF), a $200 million managed emerging market venture capital company, a Director of Estonia-based Baltic Small Equity Fund, a Co-Founder and Principal of the Templeton Emerging Europe Fund, as Principal of Templeton Direct Advisors, and a Portfolio Manager of Private Equities at the Calvert Group.</p>\n\n<p>Mark is a VC in Residence and Professor of Venture Capital and Ethics at the R.H. Smith School of Business at the University of Maryland (UMD). He has 10 years experience in higher education as an instructor and advisor to entrepreneurship and technology commercialization, serves on numerous technology transfer, incubator, and entrepreneurship committees in the mid-Atlantic, and has twice earned awards for his instruction at UMD and at Howard University. Mark is also a Board Director of the Baltimore Chapter of the National Foundation for Teaching Entrepreneurship (NFTE) and Emerson Preparatory High School in Washington, D.C.</p>\n\n<p>Mark graduated with Honors from the University of California, Berkeley, where he majored in Political Economies and received a Juris Doctor from the Georgetown University, where his focus was in international, tax, and corporate law. Mark has also completed graduate work in accounting and finance at the George Washington University and Pace University. Mark is married with two children.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"New Markets Venture Partners","permalink":"new-markets-venture-partners-2","type_of_entity":"financial_org","image":{"available_sizes":[[[150,30],"assets/images/resized/0002/9665/29665v3-max-150x150.jpg"],[[250,51],"assets/images/resized/0002/9665/29665v3-max-250x250.jpg"],[[450,92],"assets/images/resized/0002/9665/29665v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}