{"first_name":"Mark","last_name":"Hamilton","permalink":"mark-hamilton","crunchbase_url":"http://www.crunchbase.com/person/mark-hamilton","homepage_url":"http://www.venueincs.com","birthplace":"Brentwood","twitter_username":"venueinc","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"mark-hamilton, venue-inc, supreme-ventures-inc, organization-for-higher-learning, wealth","alias_list":null,"created_at":"Thu Apr 28 22:53:27 UTC 2011","updated_at":"Thu May 05 00:43:41 UTC 2011","overview":"<p>Mark Hamilton is an international businessman, who has had many successful ventures in various industries, but primarily pertaining to Entertainment, Technology, and the financial industry. Graduated with an AA degree from private technology college WestWood College at the age of 18 years old in October of 2000, from their starting his first company Mans Productions Inc and M.P.I which was a full service entertainment company launching along with other artists and entertainers himself as a solo artist known as Coo &#8220;The Ghetto Poet&#8221; and Notorious Coo. He later arranged a financially beneficial business deal with mega studio mogul Sony Corp Inc.\nSeveral years later Mark Hamilton started Venue Inc which would go onto become a company known for its diversified portfolio of various companies in many different industries. \nMark Hamilton is a very creative individual with a drive and mission to create businesses which provide innovative products and services to the mass public. Currently overseeing Three corporations Venue Inc doing business as Venue Live, Supreme Ventures and also a non profit company Organization For Higher Learning which provides financial literacy education to college aged students.\nEach one of these companies were started, founded, and created by Mr. Hamilton himself based on his own creative intuition and ideals. \nLooking to propel each one of these companies to becoming industry leaders in their respective industries Mr. Hamilton is the driving force giving these companies momentum.</p>","image":null,"degrees":[{"degree_type":"AA","subject":"Business management","institution":"Westwood","graduated_year":2000,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.venueincs.com","title":"Venue Inc"},{"external_url":"http://www.ofhlonline.org","title":"Organization For Higher Learning"},{"external_url":"http://www.supremeventuresinc.com","title":"Supreme Ventures Inc"}],"web_presences":[{"external_url":"http://www.linkedin.com/in/notoriousmarkhamilton","title":"Mark Hamilton Linkedin"},{"external_url":"http://facebook.com/venueinc","title":""}]}