{"first_name":"Mark","last_name":"Rubash","permalink":"mark-rubash-2","crunchbase_url":"http://www.crunchbase.com/person/mark-rubash-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Shutterfly","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Sep 13 16:25:24 UTC 2009","updated_at":"Sun Oct 02 01:58:53 UTC 2011","overview":"<p>Mark Rubash is Shutterfly’s Chief Financial Officer and is responsible for managing all financial activities, including long range strategic planning, financial planning and analysis, investor relations, mergers and acquisitions, accounting, and legal. Mark brings more than 25 years of experience to his role at Shutterfly, including nearly 20 years in the public accounting profession.</p>\n\n<p>Prior to joining Shutterfly, Mark was CFO of Rearden Commerce, and previous to that, senior vice president of finance at Yahoo!. Prior to joining Yahoo!, Mark held various senior leadership positions at eBay including chief accounting officer and vice president for finance and investor relations. During his tenure at eBay, Mr. Rubash led the finance organization through periods of extraordinary growth marked by increasing revenues from roughly $450 million to over $5 billion. Mark held corporate and operational finance responsibilities for both eBay and PayPal, one of the several acquisitions for which he led the due diligence and finance integration programs.</p>\n\n<p>Prior to eBay, Mark was an audit partner at PricewaterhouseCoopers LLP where he served as the global leader for the firm’s Internet Industry Practice. During this time, he also served as practice leader of the Silicon Valley Software Industry Practice. His clients included eBay, The Learning Company, Sony Computer Entertainment America, and Chevron Corporation. Mark began his career in the Audit &amp; Business Advisory Services practice at Ernst &amp; Whinney (now Ernst &amp; Young).</p>\n\n<p>He earned his Bachelor of Science degree in Accounting from California State University Sacramento and later became a Certified Public Accountant in the state of California. Mark presently serves as a member of the board and chairman of the audit committee of Intuitive Surgical, Inc. and Line 6 Corporation. He is also a member of the board and audit committee of Iron Planet.</p>","image":{"available_sizes":[[[106,150],"assets/images/resized/0015/5686/155686v2-max-150x150.jpg"],[[170,240],"assets/images/resized/0015/5686/155686v2-max-250x250.jpg"],[[170,240],"assets/images/resized/0015/5686/155686v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"CFO","firm":{"name":"Shutterfly","permalink":"shutterfly","type_of_entity":"company","image":{"available_sizes":[[[141,48],"assets/images/resized/0000/2266/2266v8-max-150x150.png"],[[141,48],"assets/images/resized/0000/2266/2266v8-max-250x250.png"],[[141,48],"assets/images/resized/0000/2266/2266v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}