{"first_name":"Mark","last_name":"Gaeto","permalink":"mark-gaeto","crunchbase_url":"http://www.crunchbase.com/person/mark-gaeto","homepage_url":"http://www.falconllc.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"investment-banking, ma, software, internet, ecommerce, social-media, marketing, sap, venture-capital, mergers-and-acquisitions, acquisitions","alias_list":null,"created_at":"Thu Aug 04 01:47:09 UTC 2011","updated_at":"Fri Aug 05 17:12:15 UTC 2011","overview":"<p>Mark is a Managing Director at Falcon Capital Partners, an M&amp;A transaction firm focused on information technology and software. He brings over 25 years of experience in the tech industry, as an owner, senior executive, sales executive, investor and advisor to leading software and IT services companies.  He has helped business owners and CEOs with exit planning, mergers and acquisitions, technology transfer, and the forming of strategic relationships.</p>\n\n<p>Mark invested in and operated ISC, a SAP implementation firm, where he implemented an aggressive growth initiative that resulted in the doubling of the business within 18 months. He orchestrated a highly successful sale of ISC to a NYSE firm and secured one of the highest valuations received for an IT service company.  Mark was a top performing global account executive at several leading technology companies and start-ups, including SAP America, Inc. where he exceeded 200% of his annual quota each year over a 7 year period.  Mark started his career with Electronic Data Systems as a systems engineer.</p>\n\n<p>Mark has a BBA and MBA from Temple University&#8217;s Fox School of Business.</p>","image":null,"degrees":[{"degree_type":"BBA","subject":"Finance","institution":"Temple University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"Temple University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.falconllc.com","title":""}]}