{"first_name":"Mark","last_name":"Strobeck","permalink":"mark-strobeck","crunchbase_url":"http://www.crunchbase.com/person/mark-strobeck","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 18 02:23:12 UTC 2009","updated_at":"Thu Jun 18 02:26:32 UTC 2009","overview":"<p>Mark joined Trevena, Inc as Chief Business Officer in January 2008.  Prior to this role, Mark was the Head of Business Development for GlaxoSmithKline&#8217;s Drug Discovery Division, where he led a team that reviewed, negotiated and completed a number of large, broad R&amp;D collaborations. Previously he was Vice President of Business Development for the Center of Excellence for External Drug Discovery (CEEDD), an innovative organization responsible for building an external drug discovery portfolio via a network of business development relationships. Mark was previously a Principal at SR One, the venture capital subsidiary of GlaxoSmithKline, where he focused on making investments in drug discovery, drug development, and research tools companies. While at SR One, he led the financings of Protein Forest, and Novalar Pharmaceuticals. He served on the Boards of Directors of Novalar Pharmaceuticals and Protein Forest and as a Board Observer of AlgoRx Pharmaceuticals  (ANSV), Conforma Therapeutics,  Rib-X Pharmaceuticals and Santarus, Inc (SNTS). Prior to joining SR One, Mark was at EuclidSR Partners where he served as a Board Observer to Fluidigm Corp. and KuDOS Pharmaceuticals. His last position prior to joining EuclidSR Partners was in the Division of Cardiovascular Medicine at the University of Pennsylvania. Mark earned a Ph.D. in Pharmacology and Biophysics from the University of Cincinnati and a B.Sc. from St. Lawrence University.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0004/9266/49266v1-max-150x150.jpg"],[[150,150],"assets/images/resized/0004/9266/49266v1-max-250x250.jpg"],[[150,150],"assets/images/resized/0004/9266/49266v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Business Officer","firm":{"name":"Trevena","permalink":"trevena","type_of_entity":"company","image":{"available_sizes":[[[135,79],"assets/images/resized/0004/9263/49263v1-max-150x150.jpg"],[[135,79],"assets/images/resized/0004/9263/49263v1-max-250x250.jpg"],[[135,79],"assets/images/resized/0004/9263/49263v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}