{"first_name":"Marnie","last_name":"Bennett","permalink":"marnie-bennett","crunchbase_url":"http://www.crunchbase.com/person/marnie-bennett","homepage_url":"","birthplace":"","twitter_username":"MarnieBennett","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1995,"born_month":11,"born_day":15,"tag_list":"","alias_list":null,"created_at":"Mon Jul 23 10:52:44 UTC 2012","updated_at":"Wed Jul 25 07:57:31 UTC 2012","overview":"<p>There is no doubt that one of the outstanding Realtors in Canada is Marnie Bennett. Following her graduation from Carleton University, with a degree in Law and Economics, she started her career which has offered her success and recognition for her achievements and contributions to her community. For example, one of her most valued recognitions was being named Ottawa&#8217;s Professional Businesswoman of the Year in 2008. This highly acclaimed honor is just one, of many rewards she has received through the years.</p>\n\n<p>She Has A Strong Presence On TV, Radio, And In Print</p>\n\n<p>Marnie has a large following and this has led her to share her expertise in public forums. CTV News recruited her as commentator as a real estate expert. This was followed by CBC News recruiting her as an expert on the condo market. She writes a column, &#8220;Property Talk,&#8221; for CanWest Global newspapers which has given her wide exposure. The magazine, &#8220;New Homes and Condos,&#8221; carries her &#8220;Home Smarts&#8221; column on a regular basis. Aside from all of this she also appears weekly on two different shows, &#8220;Business Class,&#8221; and &#8220;The Real Estate Hour.&#8221; Both of these are offered by Bell Media stations.</p>\n\n<p>Her Career Officially Begins In 1981</p>\n\n<p>Marnie Bennett started her career in 1981 as a Realtor. She proved to be a phenomenal Realtor and this was proven by her sales volume. She was one of the top producing agents across Canada. She continued on this same pace during the following years. She was then hired as an Executive Vice-President of a market leading home builder of estate and resort homes in Quebec and Ontario. Through her assistance the company grew so their gross annual sales exceeded $40,000,000. </p>\n\n<p>She Decides To Become An Independent Businesswoman</p>\n\n<p>During the middle of the 90s she felt there was a need for a more professional and imaginative approach to both sales and marketing. She opened her own boutique marketing firm where she became a &#8216;one stop shop&#8217; for developers, builders, property managers, and investors. In 2007 she broadened her business and opened &#8216;Bennett Real Estate Professionals.&#8217; </p>\n\n<p>Her services included providing real estate coaching and real estate investment advice. This year Realtor/Businesswoman Marnie Bennett followed her dream, and decided to use her 31 years of experience in real estate by opening a boutique real estate brokerage, &#8216;Bennett Property Shop Realty.&#8217; </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}