{"first_name":"Marta","last_name":"Kozak","permalink":"marta-kozak","crunchbase_url":"http://www.crunchbase.com/person/marta-kozak","homepage_url":"http://www.fusionedv.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"iphone--net-facebook-android-apps-entwicklung","alias_list":null,"created_at":"Tue Mar 15 21:57:33 UTC 2011","updated_at":"Tue Mar 22 17:14:47 UTC 2011","overview":"<p>Softwareentwicklung: .NET und Mobile Entwickler für Android, Iphone, Windwos Mobile und Symbian </p>\n\n<p>Softwareentwicklung Outsourcing-Partner FusionEDV bietet die Erstellung von .NET Anwendungen und mobile Applications für die vier verschiedenen mobile Betriebssysteme iPhone, iPad, Android, Windows Mobile und Symbian.\n(PM) Dresden, 13.03.2011 - FusionEDV hat sich auf die Entwicklung von Facebook und mobile Applications spezialisiert. FusionEDV Outsourcing Partner mit Sitz in Deutschland und Schweiz bietet die Erstellung von mobile Applications für die vier verschiedenen mobile Betriebssysteme Iphone, Android, Windows Mobile und Symbian. Als reiner Web ( .NET ), Facebook und Mobile Application Developer bietet Applicationworx keine Agenturleistung und richtet sich an Firmen mit weitestgehend fertigem Konzept, die so Kosten sparen können. FusionEdv eignet sich dadurch auch als Kooperationspartner für Softwareentwicklung Unternehmen.</p>\n\n<p>Fusionedv bietet für die .NET Framework und die mobile Systeme von Iphone, Android, Windows Mobile und Symbian Experten zur kostneguentige Programmierung der Applikationen. Fusionedv operiert unabhängig der Betriebssysteme der einzelnen Smartphones von Iphone, HTC, Nokia, Sony Erricson, Motoralla etc. und kann wirkt so beratend bei der Wahl des Systems für die mobile application.</p>\n\n<p>Der Kunde präsentiert FusionEdv das Konzept seiner Projekt oder mobile Application, anhand dessen erstellt Fusionedv ein Pflichtenheft und ein Lastenheft in Zusammenarbeit mit dem Kunden.</p>\n\n<p>Das Fusionedv bietet zusätzlich die Programmierung von J2EE, Content managment Systeme, Webseiten, Design die größtenteils auf allen Web ( .NET ) und mobilen Systeme über das mobile Internet und mobile Browser funktionieren. Kontakt über info@fusionedv.com</p>","image":{"available_sizes":[[[150,61],"assets/images/resized/0012/6398/126398v2-max-150x150.png"],[[153,63],"assets/images/resized/0012/6398/126398v2-max-250x250.png"],[[153,63],"assets/images/resized/0012/6398/126398v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"fusionedv","permalink":"fusionedv","type_of_entity":"company","image":{"available_sizes":[[[150,61],"assets/images/resized/0012/7565/127565v2-max-150x150.png"],[[153,63],"assets/images/resized/0012/7565/127565v2-max-250x250.png"],[[153,63],"assets/images/resized/0012/7565/127565v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}