{"first_name":"Martin","last_name":"Obert","permalink":"martin-obert","crunchbase_url":"http://www.crunchbase.com/person/martin-obert","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Gloofi","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat May 31 01:53:10 UTC 2008","updated_at":"Wed Mar 04 20:22:27 UTC 2009","overview":"<p>Martin was an IT Project Manager for many world top 100 companies but decided to go back to the roots, developing a tax/duty calculation software for international customers and sold it in 2007 to a British company.\nMartins IT background started in 1986 when computers like Commodore C64 and Commodore Amiga where in many German households. After college, Martin started to work for Germans largest phone company, Deutsche Telekom, owner of T-Mobile and got hooked directly into data communication.\nThe first steps for Martin in the Internet were hard, since you had to make an international phone call, using your 1200 baud modem to call AOL in the US!\nSince than, Martin worked in the Internet business, developing an e-commerce platform for Siemens to sell old stock items. After relocating to the US in 2000, Martin worked as a Project Manager for Siemens and IBM. In 2004 - 2005 his IT PM skills were used by the Walt Disney company to manage a project to enable Disney users signing up for an online Credit Card with Chase.\nAs of August 2008, Martin and his wife moved to the Silicon Valley to be right there where the &#8220;Internet&#8221;-action is.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Gloofi","permalink":"gloofi","type_of_entity":"company","image":{"available_sizes":[[[150,59],"assets/images/resized/0001/9733/19733v3-max-150x150.png"],[[174,69],"assets/images/resized/0001/9733/19733v3-max-250x250.png"],[[174,69],"assets/images/resized/0001/9733/19733v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}