{"first_name":"Marta","last_name":"Marine","permalink":"marta-marine","crunchbase_url":"http://www.crunchbase.com/person/marta-marine","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Locavorian","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Sep 17 19:02:15 UTC 2012","updated_at":"Sat Oct 20 03:13:31 UTC 2012","overview":"<p>Marta Marine is the co-founder and Marketing Director of Locavorian. She is responsible for the creation of the Locavorian brand, and manages all aspects related to branding, corporate communications, and design. She is in charge of social media, PR, and event planning. </p>\n\n<p>Starting as a creative copywriter in Orbital BBDO—an advertising and PR agency in Barcelona, Spain—and moving afterwards to corporate marketing and communications positions, she has been working in the communications arena since 2006. Previous to founding Locavorian, she worked as Communications Specialist at OneCarbon, a fast-paced, international, growth-oriented company dedicated to designing and implementing carbon reduction projects in developing countries.</p>\n\n<p>Marta holds a Bachelor’s Degree in Advertising and PR by Universidad Autónoma de Barcelona (Spain), and a Master’s degree in Marketing Management by Southampton Solent University (the UK). She carried out her Master’s thesis in Sustainable Marketing at Mudra Institute of Communications Ahmedabad (India). </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CFO and Marketing Director","firm":{"name":"Locavorian","permalink":"locavorian-platform","type_of_entity":"company","image":{"available_sizes":[[[150,55],"assets/images/resized/0021/1704/211704v2-max-150x150.jpg"],[[250,92],"assets/images/resized/0021/1704/211704v2-max-250x250.jpg"],[[450,167],"assets/images/resized/0021/1704/211704v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}