{"first_name":"Martin","last_name":"Siegal","permalink":"martin-siegal","crunchbase_url":"http://www.crunchbase.com/person/martin-siegal","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri May 18 22:41:51 UTC 2012","updated_at":"Fri May 18 22:42:30 UTC 2012","overview":"<p>Martin joined BrightLot in January 2007.  Prior to joining BrightLot, Martin spent 32 years at the Chrysler Corporation.  Among his numerous achievements and responsibilities at the company, Martin was the Western Regional Manager of Chrysler/Jeep/Dodge, overseeing 950 dealerships in distribution, product allocation, marketing, incentive programs, corporate advertising, and new dealership launches for the region.  Prior to this, Martin held a variety of dealership oversight positions in New York, Boston, Washington DC, Philadelphia, St Louis, Los Angeles, Denver, and San Francisco.  Martin also launched the Guam market for Chrysler/Jeep/Dodge, addressing pricing, positioning, incentive programs, dealer installation and training, personnel training, and facility construction.  Notably, earlier in his career, Martin was appointed by Lee Iacocca to coordinate the lobbying efforts of the Chrysler Corporation dealerships, employees, and union representatives to secure the Chrysler Corporation Government Loan Guarantee Bill.</p>\n\n<p>Prior to Chrysler, Martin worked for the General Motors Acceptance Corporation.  His responsibilities included new vehicle inventory reconciliation at dealerships.</p>\n\n<p>Martin graduated from Morris Harvey College, now University of Charleston, with degrees in Marketing and Industrial Psychology.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"BrightLot","permalink":"brightlot","type_of_entity":"company","image":{"available_sizes":[[[150,27],"assets/images/resized/0019/0529/190529v1-max-150x150.png"],[[250,45],"assets/images/resized/0019/0529/190529v1-max-250x250.png"],[[270,49],"assets/images/resized/0019/0529/190529v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}