{"first_name":"Martin","last_name":"Bueno","permalink":"martin-bueno","crunchbase_url":"http://www.crunchbase.com/person/martin-bueno","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Quorumm Digital Venture Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Dec 08 16:46:19 UTC 2010","updated_at":"Mon May 30 03:02:26 UTC 2011","overview":"<p>Martin is the Co-Founder and Managing Partner of Quorumm Digital Ventures, a third generation Venture Capital firm, focused on investment and building businesses in the high-growth Digital Marketing Sector, with over $500 Million under management.</p>\n\n<p>At Quorumm Digital Ventures, Martin worked closely with the Managing Directors and global partners to determine the appropriate strategy and vision to support all investment decisions of the fund, including alternative deal structures, M&amp;A and exits strategies for the portfolio companies.</p>\n\n<p>Angel Investor and Serial Entrepreneur, Martin lead more than 18 digital Pre-IPO startups from 1995 to 2005, including Fiera.com, Neocard,E-Food.com,OnYoyage.com and Mrbite.com. He is widely recognized as a Latin American pioneer in the internet space, starting the first commercial ISP (Los Pinos) in the early ’90.</p>\n\n<p>Before joining Quorumm, Martin was a member of the executive team for Havas Digital arm EuroRSCG in Latin America, leading the digital and Social Media initiatives in the region. Earlier, Martin was the Vice President of Digital for JWT, where he was responsible for the inception of the interactive marketing operation of the group in the early 2000.</p>\n\n<p>In 2010, martin was elected Chairman of the Digital Venture Capital Association (DVCA) where he led the transformation of the group, to become a global professional organization representing the digital VC and angel investment community.</p>\n\n<p>Apart from his professional work, Martin also plays a philanthropic roll in several social ventures funds, as an advisor and investor. He is a graduate of the National Technology University of Buenos Aires.</p>\n\n<p>He currently serves as a Co-Chairman in the Global Board of Directors at Quorumm Digital Venture Partners  LLP with Jack Hartmann.</p>","image":{"available_sizes":[[[134,150],"assets/images/resized/0012/9865/129865v2-max-150x150.jpg"],[[223,250],"assets/images/resized/0012/9865/129865v2-max-250x250.jpg"],[[402,450],"assets/images/resized/0012/9865/129865v2-max-450x450.jpg"]],"attribution":"<p>martin bueno</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"COO","firm":{"name":"Quorumm Digital Venture Partners","permalink":"quorumm-digital-venture-partners","type_of_entity":"company","image":{"available_sizes":[[[150,40],"assets/images/resized/0011/1048/111048v2-max-150x150.jpg"],[[246,67],"assets/images/resized/0011/1048/111048v2-max-250x250.jpg"],[[246,67],"assets/images/resized/0011/1048/111048v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}