{"first_name":"Marti","last_name":"Hearst","permalink":"marti-hearst","crunchbase_url":"http://www.crunchbase.com/person/marti-hearst","homepage_url":"http://people.ischool.berkeley.edu/~hearst/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"professor, uc-berkeley, search-engines, information-visualization, natural-language-processing, social-media, search-user-interfaces","alias_list":"","created_at":"Wed May 30 02:14:16 UTC 2012","updated_at":"Wed May 30 02:15:46 UTC 2012","overview":"<p>Dr. Marti Hearst is a professor in the School of Information at UC Berkeley, with an affiliate appointment in the Computer Science Division. Her primary research interests are user interfaces for search engines, information visualization, natural language processing, and empirical analysis of social media. She has recently completed the first book on Search User Interfaces.</p>\n\n<p>Prof. Hearst received BA, MS, and PhD degrees in Computer Science from the University of California at Berkeley, and she was a Member of the Research Staff at Xerox PARC from 1994 to 1997.</p>\n\n<p>Prof. Hearst has served on the Advisory Council of NSF&#8217;s CISE Directorate and was co-chair of the Web Board for CACM. She is a member of the Usage Panel for the American Heritage Dictionary and is on the Edge.org panel of experts. Prof. Hearst is on the editorial boards of ACM Transactions on the Web and ACM Transactions on Computer-Human Interaction and was formerly on the boards of Computational Linguistics, ACM Transactions on Information Systems, and IEEE Intelligent Systems.</p>\n\n<p>Prof. Hearst has received an NSF CAREER award, an IBM Faculty Award, a Google Research Award, an Okawa Foundation Fellowship, two Excellence in Teaching Awards, and has been principal investigator for more than $3M in research grants.</p>\n\n<p>Prof. Hearst was for many years a researcher in the QCA group at Xerox PARC, and before that a member of the BAIR group in graduate school. </p>","image":{"available_sizes":[[[95,130],"assets/images/resized/0019/3048/193048v1-max-150x150.jpg"],[[95,130],"assets/images/resized/0019/3048/193048v1-max-250x250.jpg"],[[95,130],"assets/images/resized/0019/3048/193048v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"PhD","subject":"Computer Science","institution":"University of California, Berkeley","graduated_year":1994,"graduated_month":null,"graduated_day":null},{"degree_type":"M.S.","subject":"Computer Science","institution":"University of California, Berkeley","graduated_year":1989,"graduated_month":null,"graduated_day":null},{"degree_type":"B.A.","subject":"Computer Science","institution":"University of California, Berkeley","graduated_year":1985,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}