{"first_name":"Martin","last_name":"Huml","permalink":"martin-huml","crunchbase_url":"http://www.crunchbase.com/person/martin-huml","homepage_url":"","birthplace":"","twitter_username":"martinhuml","blog_url":"","blog_feed_url":"","affiliation_name":"Socialbakers","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Sep 17 15:42:46 UTC 2011","updated_at":"Thu Jun 14 18:55:47 UTC 2012","overview":"<p>Martin is a Managing Partner and the founder of Runway Capital LLC, a private equity investment firm.  Runway works with great teams in both early-stage and growth-stage companies.   Martin looks for opportunities where his passion for providing hands-on help and advice can be merged with the desire and passion of the team to build an extraordinary business. </p>\n\n<p>Prior to starting his investment firm, Martin founded and ran a successful turnaround consulting company based in San Francisco.   From 2001- 2003, in the post internet bubble, Martin and his team advised venture capital firms on their portfolio companies including taking Interim CEO and COO roles.  The firm&#8217;s clients included Mayfield, Soros, Norwest, Weisel, JPMorgan CP, Oak, NEA, TCV, Bain Capital, and Pequot.  </p>\n\n<p>Prior to coming to San Francisco, Martin spent four years as a Principal in the Private Equity group of Credit Suisse First Boston in London and New York.   Martin&#8217;s investments were focused on Central and Eastern Europe.</p>\n\n<p>Martin began his business career as an entrepreneur and founder of several companies, most notably founding, running, and successfully selling a business which brought Apple Computer into the majority of Central and Eastern Europe.  This company was the exclusive marketer and distributor for the region, which included Russia, Czechoslovakia, and five republics of the formal Soviet Union.</p>\n\n<p>Martin graduated with honors with an M.S. in Electrical Engineering and Computer Science from the Czech Technical University, Prague, Czech Republic and holds a Post-Graduate Degree in Finance from the Stern School of Business, New York University. </p>\n\n<p>Apart from chairing the board of Socialbakers, Martin is currently a board member of Arena Solutions, where he served as Chairman for several years, board member of Agraquest, and the Chairman of Konsepti and OnSite Power.   Martin serves as a Trustee of the leading Central European modern art museum, DOX Prague.  He is an Honorary Trustee of the Heroic Imagination Project (HIP), a non-profit organization, which he co-founded with leading social psychologist and Stanford Professor Dr. Phillip Zimbardo.  He also served as the initial Chairman of the Board and founding Executive Director of HIP.   </p>","image":{"available_sizes":[[[140,105],"assets/images/resized/0015/4631/154631v2-max-150x150.jpg"],[[140,105],"assets/images/resized/0015/4631/154631v2-max-250x250.jpg"],[[140,105],"assets/images/resized/0015/4631/154631v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"M.S.","subject":"","institution":"Czech Technical Univercity","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"","subject":"","institution":"Stern School of Business, New York University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chairman of the Board","firm":{"name":"Socialbakers","permalink":"socialbakers","type_of_entity":"company","image":{"available_sizes":[[[150,40],"assets/images/resized/0010/4940/104940v9-max-150x150.jpg"],[[250,67],"assets/images/resized/0010/4940/104940v9-max-250x250.jpg"],[[450,121],"assets/images/resized/0010/4940/104940v9-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Board member","firm":{"name":"Arena Solutions","permalink":"arena-solutions","type_of_entity":"company","image":{"available_sizes":[[[107,67],"assets/images/resized/0010/6282/106282v2-max-150x150.png"],[[107,67],"assets/images/resized/0010/6282/106282v2-max-250x250.png"],[[107,67],"assets/images/resized/0010/6282/106282v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}