{"first_name":"Marty","last_name":"Cagan","permalink":"marty-cagan","crunchbase_url":"http://www.crunchbase.com/person/marty-cagan","homepage_url":"http://www.svpg.com","birthplace":"","twitter_username":"cagan","blog_url":"","blog_feed_url":"","affiliation_name":"Silicon Valley Technology Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Feb 04 09:53:33 UTC 2010","updated_at":"Wed Aug 11 17:35:20 UTC 2010","overview":"<p>Marty Cagan is the founding partner of the Silicon Valley Product Group, and was previously an executive at several Silicon Valley technology companies including  Hewlett-Packard, Netscape Communications, America Online, and most recently eBay.</p>\n\n<p>Before founding the Silicon Valley Product Group to pursue his interests in helping others create successful products through his writing, speaking, and training, Marty was most recently senior vice-president of product management and design for eBay, where he was responsible for defining products and services for the company’s global e-commerce trading site.</p>\n\n<p>Marty began his career at Hewlett-Packard Laboratories conducting research on software technology, and building several software products for other software developers.</p>\n\n<p>After HP, Marty joined a then young Netscape Communications Corporation, where he had the opportunity to participate in the birth of the Internet industry. Martin worked directly for co-founder Marc Andreessen, where he was vice-president for Netscape’s platform and tools, and later e-commerce applications, and worked to help Internet start-ups and Fortune 500 companies alike to understand and utilize the newly emerging technology.</p>\n\n<p>During his career, Marty has personally performed and managed most of the roles of a modern software product organization, including product management, software development, product marketing, user interface design, usability engineering, technical writing, software testing, engineering management, and general management.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Silicon Valley Product Group","permalink":"silicon-valley-technology-group","type_of_entity":"financial_org","image":{"available_sizes":[[[150,51],"assets/images/resized/0007/6013/76013v1-max-150x150.png"],[[250,86],"assets/images/resized/0007/6013/76013v1-max-250x250.png"],[[260,90],"assets/images/resized/0007/6013/76013v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}