{"first_name":"Martin","last_name":"Ollman","permalink":"martin-ollman","crunchbase_url":"http://www.crunchbase.com/person/martin-ollman","homepage_url":"http://hunome.com","birthplace":"UK","twitter_username":"hunome","blog_url":"http://hunome.com/blog","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"web-development, design, creative, ui, experienced, reuters, news-interactive, futurenet","alias_list":null,"created_at":"Mon May 10 23:57:32 UTC 2010","updated_at":"Mon Nov 26 02:53:55 UTC 2012","overview":"<p>Martin is Director Creative and Design at Hunome.</p>\n\n<p>Martin has a keen eye in to humanity through a number of lenses – literally through the camera as he is an award winning published photographer. His photography has appeared in over 25 international newspapers and he has written articles and features for several leading magazines. Perhaps more importantly through his creativity in user interface design.</p>\n\n<p>His extensive experience in web businesses and development comes from over 15+ years of designing and developing over 100 web sites, many of which include major content management and web publishing systems. Martin helped define the common web User Interface for major media organizations such as Reuters, the Fairfax Group, News Interactive and Future Publishing. In recent years Martin has been delivering advanced web applications for the Australian Government.</p>\n\n<p>He worked closely with Chris Anderson [TED curator] to build the leading website in Europe – Futurenet – in 1999. He also worked on building the very first Internet magazine in the United Kingdom as well as helped establish the subsequent publications dedicated to the Internet.</p>\n\n<p>The particular skills span: Adobe UI/Tools specialist, Photoshop Master, Certified Flex developer, Graphic design (CS4), LAMP, Usability Centered Design, UCD facilitator, micro-architectures, frameworks and SAAS.</p>\n\n<p>His technology and technical exposure: J2EE, RPC, offline apps, mobile apps, OO, MXML, XML, JSON, PHP, CSS, XHTML, JAVASCRIPT, SPARQL, RDF, FXG, SWF, AMFphp, AMF, streaming video/audio and online collaboration.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0008/6659/86659v2-max-150x150.jpg"],[[201,250],"assets/images/resized/0008/6659/86659v2-max-250x250.jpg"],[[362,450],"assets/images/resized/0008/6659/86659v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Director Creative and Design","firm":{"name":"Hunome","permalink":"hunome","type_of_entity":"company","image":{"available_sizes":[[[150,64],"assets/images/resized/0008/6578/86578v4-max-150x150.png"],[[250,106],"assets/images/resized/0008/6578/86578v4-max-250x250.png"],[[450,192],"assets/images/resized/0008/6578/86578v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/mollman","title":"Martin on Twitter"}]}