{"first_name":"Maru","last_name":"Perez","permalink":"maru-perez","crunchbase_url":"http://www.crunchbase.com/person/maru-perez","homepage_url":"http://www.mpsoftwareconsultant.com","birthplace":"","twitter_username":"mpscny","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1972,"born_month":3,"born_day":7,"tag_list":"","alias_list":null,"created_at":"Thu Dec 15 19:32:17 UTC 2011","updated_at":"Mon Dec 19 10:04:14 UTC 2011","overview":"<p>Maru Perez, Founder and CEO brings more than two decades of expertise of Software Development and Systems Applications for ERP and Technology management to MPSC.\nPrior to founder MPSC, she held  roles such as  Consultant, IT Director, Business Applications Development Manager for Fortune 100 and 500 companies including Epicor, Ecometry, Zones,Cold Water Creek and Delias in New York , Boston and Seattle. In prior IS leadership roles, she established application and development strategies, implemented several ERP systems, developed and supported system applications for businesses processes within various industries including distribution centers, manufacturing, call centers, and e-commerce to mention a few. \n&#8220;I started out my career developing ERP systems at 20 years old, while combining efforts on getting my Computer Science degree at the same time that held my first job in the IT department for a european 5 stars hotel chain, but what I was looking all this years was the opportunity to startup an IT consulting firm to combine my knowledge and experience with my passion for development&#8221;</p>\n\n<p>Maru&#8217;s favorite things include her two yorkies Oliver and Lola, electrotango music and B&amp;W photography.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0016/6575/166575v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0016/6575/166575v2-max-250x250.jpg"],[[240,360],"assets/images/resized/0016/6575/166575v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}