{"first_name":"Marv","last_name":"Scott","permalink":"marv-scott","crunchbase_url":"http://www.crunchbase.com/person/marv-scott","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1985,"born_month":2,"born_day":14,"tag_list":"","alias_list":null,"created_at":"Wed Aug 08 11:13:34 UTC 2012","updated_at":"Fri Aug 10 07:21:04 UTC 2012","overview":"<p>Marv Scott</p>\n\n<p>Marv Scott is committed to helping athletes perform at their top potential. In order to accomplish this goal, athletes are required to perform consistently at their peak. The services offered by Performance Health are vital to helping athletes achieve their best.</p>\n\n<p>Dr. Scott became interested in sports medicine while playing high school football for the Wheaton, Illinois Falcons. He loved the roar of the crowds as he led the team to much success on the football field. Coaches, athletic trainers and principals loved Marv and named him an All-American high school football player. Unfortunately, Marv was hurt with an injury to his abdomen that would have ended many careers.</p>\n\n<p>He was determined, however, that this injury would not end his career. Luckily, he found Dr. Phillip E. Claussen who was inducted into the National Fitness Hall of Fame in 2009 for his innovative use of chiropractic techniques to help athletes. Under the careful supervision of Dr. Claussen, Marv was cured of the original injury. </p>\n\n<p>He continued to work with Dr. Claussen, who kept him interested in novel training methods that were highly sought out by professional athletes including:\n• Joe Girardi\n• Scott Sanderson\n• Carlton Fisk </p>\n\n<p>After high school graduation, Marv went on to incorporate Dr. Claussen’s training principles as a running back for the University of Illinois. However, injuries continued to plague him despite his great training techniques. </p>\n\n<p>Forced to give up his dream of playing for this national powerhouse, he transferred to the University of Delaware. During his time at the University of Delaware he chose to concentrate on his studies in fitness becoming an All-American academic.</p>\n\n<p>Dr. Scott has never been scared of hard work. After his graduation, he then moved to Dayton, Ohio. During his time in Dayton, Marv was a television sports reporter covering the Dayton Dragons, Dayton Gems, Dayton Flyers and the Wright State Raiders on a regular basis. He also attended Wright State School of Medicine. </p>\n\n<p>However, Marv Scott knew that something was missing from his life. While he loved covering sports, he still missed playing sports. He decided to play for the Dayton Skyhawks of the Indoor Football League. Amazingly, he was successful at doing it all!</p>\n\n<p>After graduation from Wright State School of Medicine, Marv moved to New York City. There he became a well-loved sports reporter for WABC, helping lead it to become the number one local station. While working as a sports reporter, Dr. Scott completed his demanding medical residency at the world-famous Mount Sinai/Cabrini Medical Center.</p>\n\n<p>Opening Performance Health, a sports medicine clinic, has been a dream come true for Marv. Put the services of Marv Scott to work for you today.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/5014/205014v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/5014/205014v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/5014/205014v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}