{"first_name":"Marwan","last_name":"Jabri","permalink":"marwan-jabri","crunchbase_url":"http://www.crunchbase.com/person/marwan-jabri","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon May 12 18:20:13 UTC 2008","updated_at":"Mon May 12 18:52:09 UTC 2008","overview":"<p>&#8220;Dr. Marwan Jabri brings nearly twenty years of research and development expertise in multimedia communications systems and intelligent signal processing including voice and video compression and transcoding, and multimedia quality of service over narrow and broadband networks. Dr. Jabri is also the founder of Macchina, the predecessor to Dilithium, and acted as both the driving technical force as well as CEO. He has significant expertise in media communications protocols and their implementation inside real time systems, and was closely involved with the ITU in the development of the ITU H.324/H.324M standards.</p>\n\n<p>As Professor of Computer Engineering, University of Sydney (January 1996 - July 2001), and the Gordon &amp; Betty Moore endowed Chair Professor, the Oregon Health and Sciences University (OHSU) (January 2000 - 2005), Dr. Jabri is the author or co-author of 2 books, several patents and over 150 technical publications in leading international journals and conferences.</p>\n\n<p>He was the founder of the Systems Engineering and Design Automation Laboratory (SEDAL) at the University of Sydney, a world class research and development laboratory in its areas of activities. SEDAL undertook substantial commercial contracts for major Japanese and British companies in the area of real-time image and video compression. Dr. Jabri was also awarded the Outstanding Young Investigator Medal by the Australian Telecommunication and Electronics Research Board for contributions to the application of artificial intelligence techniques to real-world problems.</p>\n\n<p>Dr. Jabri has been a Visiting Scientist at the Salk Institute, San Diego, California and at Bell Laboratories, New Jersey. Dr. Jabri holds a License de Physique and a Maitrise de Physique, University of Paris 7, France, and a Ph.D. in Electrical Engineering from the University of Sydney.&#8221; (Source: <a href=\"http://www.dilithiumnetworks.com/company_info/management_team.asp\" title=\"Dilithium Networks\" rel=\"nofollow\">Dilithium Networks</a>)</p>","image":{"available_sizes":[[[118,141],"assets/images/resized/0001/8385/18385v1-max-150x150.png"],[[118,141],"assets/images/resized/0001/8385/18385v1-max-250x250.png"],[[118,141],"assets/images/resized/0001/8385/18385v1-max-450x450.png"]],"attribution":"<p><a href=\"http://www.dilithiumnetworks.com/company_info/management_team.asp\" title=\"Dilithium Networks\" rel=\"nofollow\">Dilithium Networks</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Co-founder & CTO","firm":{"name":"Dilithium Networks","permalink":"dilithium-networks","type_of_entity":"company","image":{"available_sizes":[[[150,40],"assets/images/resized/0001/8380/18380v1-max-150x150.png"],[[178,48],"assets/images/resized/0001/8380/18380v1-max-250x250.png"],[[178,48],"assets/images/resized/0001/8380/18380v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}