{"first_name":"Marysue","last_name":"Strong","permalink":"marysue-strong","crunchbase_url":"http://www.crunchbase.com/person/marysue-strong","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Lovetropolis.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Aug 24 20:39:46 UTC 2009","updated_at":"Tue Aug 25 16:27:10 UTC 2009","overview":"<p>Ms. Strong has substantial professional qualifications with entrepreneurial and executive experience.  Her graduate level training, international education and noteworthy occupational experience lend themselves to directing the financial planning and management of The Lombard Company, Inc.  Because she is the principal of Strong Management Solutions, LLC, Ms. Strong&#8217;s industrialist spirit suits the corporate culture of The Lombard Company, Inc.  Ms. Strong&#8217;s progressive management experience and comprehensive contract procurement management make her a formidable Chief Financial Officer.</p>\n\n<p>Ms. Strong received her undergraduate degree in Business Administration and Accounting from New Hampshire College.  She studied International Economics at North London Polytechnic in England and earned her MBA at the University of Phoenix.  Additionally, she completed the Howard County leadership program.  Previously, Ms. Strong provided training support to management and supervisory staff at Digital Systems International Corp.  More recently, she was the CFO of Planned Systems International, Inc. where her responsibilities included managing the accounting, contracts and security departments.  Ms. Strong is highly skilled in automated accounting system implementations in the public and private sector.  Importantly, she has managed profitability of multi-million dollar contracts, mergers and acquisitions.</p>\n\n<p>As CFO, Ms. Strong&#8217;s functions include supervising accounting-related matters necessary to ensure full recovery of costs and investments; planning and directing development of corporate finance/accounting policies, procedures and operating controls; planning, monitoring and reporting on business and financial strategies; and making recommendations regarding corporate-level negotiations, major partner/investor relationships, approvals and accreditations.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Financial Officer","firm":{"name":"Lovetropolis.com","permalink":"lovetropolis-com","type_of_entity":"company","image":{"available_sizes":[[[150,22],"assets/images/resized/0004/9655/49655v2-max-150x150.png"],[[250,36],"assets/images/resized/0004/9655/49655v2-max-250x250.png"],[[450,66],"assets/images/resized/0004/9655/49655v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}