{"first_name":"Mason","last_name":"Cole","permalink":"mason-cole-2","crunchbase_url":"http://www.crunchbase.com/person/mason-cole-2","homepage_url":"","birthplace":"","twitter_username":"mcolepdx","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1968,"born_month":null,"born_day":null,"tag_list":"donuts, internet, icann, tlds, domain-names","alias_list":null,"created_at":"Tue Jun 05 22:01:32 UTC 2012","updated_at":"Sat Jun 09 17:25:18 UTC 2012","overview":"<p>Mason Cole is Vice President of Communications and Industry Relations at Donuts Inc.</p>\n\n<p>Mason Cole is a veteran of the domain name industry and is a widely respected contributor to Internet policy and business development.  He was part of the founding management team at SnapNames.com, which invented the domain name aftermarket.  He edited and published State of the Domain, the industry’s first comprehensive source of domain name data, and also directly oversaw the prosecution and granting of 18 patents in the U.S., Canada and China.  After the successful sale of SnapNames to Oversee.net in 2007, Mason was VP of Communications and Industry Relations for the parent company, where he was responsible for public relations and communications for its five operating divisions, and for regulatory relationships with ICANN, the U.S. Congress, the U.S. Department of Commerce, and other federal agencies. Most recently, he was principal of 5x5 Communications, a policy and communications consultancy.</p>\n\n<p>Mason continues to serve in Internet policymaking leadership roles.  He was elected three times to chair ICANN’s Registrar Stakeholder Group and served in that position from 2009 to late 2011.  He since was elected to represent registrars as a member of the influential Generic Names Support Organization council, which advises the ICANN board on generic top-level domain policy.  In 2010, he was appointed to a select panel advising the White House on technical and policy issues in its initiative to combat illegal distribution of prescription medications.</p>\n\n<p>Prior to his involvement in the domain name industry, Mason held communications and public relations positions with companies in the investment management industry, including American Century Investments and Liberty Financial.  He began his career as a congressional aide to U.S. Rep. Bill Emerson.  Mason holds dual undergraduate degrees from Drury University.</p>","image":{"available_sizes":[[[135,150],"assets/images/resized/0019/4091/194091v2-max-150x150.jpg"],[[225,250],"assets/images/resized/0019/4091/194091v2-max-250x250.jpg"],[[337,374],"assets/images/resized/0019/4091/194091v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"","institution":"Drury University","graduated_year":1990,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}