{"first_name":"Massimo","last_name":"Fontana","permalink":"massimo-fontana","crunchbase_url":"http://www.crunchbase.com/person/massimo-fontana","homepage_url":"http://www.linkedin.com/in/mfontana","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"digital-media, advertising, audiencerate, data-provider, entrepreneur, audience-targeting","alias_list":null,"created_at":"Tue May 24 12:21:29 UTC 2011","updated_at":"Sat May 28 14:44:03 UTC 2011","overview":"<p>More than ten-year experience in the digital media industry. He has worked and led organisations of different sizes and scope in different countries, learning to operate in a true multicultural environment. Since the beginning of his career he has been exposed to the changes that innovative technologies have been increasingly bringing to business models, value chains, and lifestyles. His job has been helping companies to transform their operations to exploit the benefits of digital innovation, always working closely with end-user customers converting new technologies into tangible business benefits.</p>\n\n<p>He’s Co-founder and GM of AudienceRate an exciting startup focusing on the new data-driven online advertising models. </p>\n\n<p>Before launching AudienceRate, he has built out online divisions/subsidiaries for US and European companies (he was first employee of MSN.it and a key player in the development of AltaVista.it, now a Yahoo! Company; he has recently launched CPX Interactive in Europe). He also brings to the table a background in the financial markets as well as in the interactive mobile space -having served in senior roles at both Ericsson and Dada.net-</p>","image":{"available_sizes":[[[118,150],"assets/images/resized/0013/6159/136159v2-max-150x150.jpg"],[[197,250],"assets/images/resized/0013/6159/136159v2-max-250x250.jpg"],[[355,450],"assets/images/resized/0013/6159/136159v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}