{"first_name":"Mat","last_name":"Banik","permalink":"mat-banik","crunchbase_url":"http://www.crunchbase.com/person/mat-banik","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"ITeezy","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Aug 01 13:48:39 UTC 2010","updated_at":"Tue Aug 24 23:53:06 UTC 2010","overview":"<p>As the founder and acting CEO of ITeezy, Mr. Banik brings 11 years of IT development and support experience to the management team, including 3 years of Java programming experience and 7 years of small business IT support and troubleshooting experience as well as diverse IT security experience. Additionally, Mr. Banik is a Sun Microsystems certified Java programmer and developer, an IBM certified iSeries operator and administrator, and a CompTIA certified A+ hardware and software support consultant.</p>\n\n<p>Mr. Banik has been the acting CEO of ITeezy, Inc. since 2007, delivering services to clients via remote access, working on equipment mailed to the business, providing on-site maintenance and equipment/software updates, and offering phone support. </p>\n\n<p>Prior to starting ITeezy, Inc., Mat was a freelance programmer and IT consultant. He worked as a quality assurance tester for a variety of custom software solutions and as a Java programmer on private projects of larger corporations, solved math logic problems that have since been implemented in EJB containers, designed simple Web sites in JSP and HTML, and collaborated on open source projects to perfect programming skills.</p>\n\n<p>Before his freelance role, Mat was the IT administrator and operations manager at PPF Bank in Prague, Czech Republic. In this position, Mat received a work-related grant to attend Karl?s University, managed team of customer service operators, provided software training and troubleshooting, and managed the bank?s MIDAS DB2 database as well as the IBM servers, which included backup, end-of-day and -month procedures, user management, security, and network interconnectivity with Windows systems.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0009/5863/95863v4-max-150x150.jpg"],[[178,250],"assets/images/resized/0009/5863/95863v4-max-250x250.jpg"],[[321,450],"assets/images/resized/0009/5863/95863v4-max-450x450.jpg"]],"attribution":"<p>Mat Banik</p>"},"degrees":[],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"ITeezy","permalink":"iteezy","type_of_entity":"company","image":{"available_sizes":[[[150,80],"assets/images/resized/0009/5622/95622v2-max-150x150.png"],[[250,134],"assets/images/resized/0009/5622/95622v2-max-250x250.png"],[[260,140],"assets/images/resized/0009/5622/95622v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/iteezy","title":""}]}