{"first_name":"Matt","last_name":"Chasen","permalink":"matt-chasen","crunchbase_url":"http://www.crunchbase.com/person/matt-chasen","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"uShip","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Feb 05 22:42:07 UTC 2008","updated_at":"Wed Jun 23 05:41:09 UTC 2010","overview":"<p>As CEO, Matt leads uShip&#8217;s executive team in the company&#8217;s mission to create the most efficient marketplace for shipping that has ever existed. The idea for uShip was hatched in 2002 when Matt moved from Seattle to Austin in a half-full rented moving truck and has since grown into a global online transport marketplace. In 2010, Matt was a finalist for Ernst and Young&#8217;s Entrepeneur of the Year in Central Texas. Prior to founding uShip, Matt spent five years in business development and engineering roles at The Boeing Company in Seattle, Wash. He helped assess the technical and financial viability of new ventures including broadband in-flight Internet access and a theater ballistic missile defense system. Matt also led the avionics integration effort for the F-22 fighter aircraft and evaluated research proposals for NASA. Matt attended the McCombs School of Business at the University of Texas at Austin where he earned his MBA in May 2004. During business school, while turning the uShip idea into reality, Matt interned for the Austin office of Hunt Ventures where he evaluated new investment proposals. In addition to his MBA, Matt has a Bachelor of Science in Mechanical Engineering from The University of Texas at Austin.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO, Co-Founder, Board Member","firm":{"name":"uShip","permalink":"uship","type_of_entity":"company","image":{"available_sizes":[[[120,75],"assets/images/resized/0000/2035/2035v1-max-150x150.png"],[[120,75],"assets/images/resized/0000/2035/2035v1-max-250x250.png"],[[120,75],"assets/images/resized/0000/2035/2035v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}