{"first_name":"Matt","last_name":"Cockett","permalink":"matt-cockett","crunchbase_url":"http://www.crunchbase.com/person/matt-cockett","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Kilrush Digital ","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 30 16:33:26 UTC 2009","updated_at":"Sun Jul 12 22:21:53 UTC 2009","overview":"<p>Matt has been a part of the mobile content industry since its inception. Starting his career as part of the launch team for a web site backed by Reuters in the early dot.com era Matt moved into mobile as an early employee of the Vivendi and Vodafone-backed venture Vizzavi.</p>\n\n<p>Matt&#8217;s next step was to join O2 where he headed up the O2 downloads area and rapidly grew the division from a small income stream to a multi-million pound business. Additionally, Matt introduced several key service providers to O2 and delivered some of the first deals between major record labels and O2, as well as establishing early partnerships with magazine publishers, film houses and news companies. On leaving O2 in 2007 Matt held the position of Head of Music.</p>\n\n<p>Having worked with the UK&#8217;s leading operator, Matt decided to take a director role with a specialist digital agency supporting AEG, the company behind The O2. It was in this position that he reengaged with the founding team of MIG and was recruited on to the MIG advisory board where he consulted on the Media and Entertainment space.</p>\n\n<p>Matt went on to join MIG in a full time capacity in January this year to spearhead the growth of MIG&#8217;s latest new business venture Kilrush, a next generation mobile internet company.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Commercial Director","firm":{"name":"Kilrush Digital ","permalink":"kilrush-digital","type_of_entity":"company","image":{"available_sizes":[[[150,36],"assets/images/resized/0005/2125/52125v2-max-150x150.jpg"],[[250,61],"assets/images/resized/0005/2125/52125v2-max-250x250.jpg"],[[450,110],"assets/images/resized/0005/2125/52125v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}