{"first_name":"Matt","last_name":"Phillips","permalink":"matt-phillips-2","crunchbase_url":"http://www.crunchbase.com/person/matt-phillips-2","homepage_url":"http://www.seqcentral.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Aug 08 23:40:02 UTC 2010","updated_at":"Mon Aug 09 00:28:06 UTC 2010","overview":"<p>Matthew Phillips, co-founder of SeqCentral, LLC, is interested in data management and its presentation. The focus of his work at SeqCentral is the same as that of his professional career at an industry leading library software company: building tools that connect researchers to the data they seek.</p>\n\n<p>He holds a master of science in computer science degree from Virginia Polytechnic Institute and State University (Virginia Tech). While at Virginia Tech he contributed to the field of digital libraries under the advisement of one of the foremost experts in his field and became highly interested in information management and organization.</p>\n\n<p>Most of Matthew&#8217;s professional life has been spent as a software engineer at a leading global company that creates Visionary Technology in Library Solutions, VTLS Inc. In this position he made substantial contributions to the company&#8217;s digital repository product, VITAL, and to the company&#8217;s information discovery tool product, VISUALIZER.</p>\n\n<p>In addition to contributing to proprietary software, Matthew has given back to the open-source community in the form of code commits and by performing the thankless task of adding vital documentation. Specifically, he has contributed to the Fedora Commons Repository project, the open-source component VALET from VTLS, and a number of other digital libraries projects including two that he founded.</p>\n\n<p>Currently, Matthew is focused on building innovative and interactive online tools for SeqCentral, LLC, that connect researchers in the genomics community with the biological data they seek and to each other.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}