{"first_name":"Matt","last_name":"Smith","permalink":"matt-smith-5","crunchbase_url":"http://www.crunchbase.com/person/matt-smith-5","homepage_url":"http://www.swatchsearch.com","birthplace":"New York","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jul 13 17:39:36 UTC 2012","updated_at":"Sat Jul 14 11:47:00 UTC 2012","overview":"<p>Matt is the Chief Marketing Officer and Co-Founder at DesignIn, a social network company that created the visual search mobile application, SwatchSearch, which helps consumers to find stylish products that match their wardrobe and home décor.  </p>\n\n<p>Previously, Matt was the VP of Marketing &amp; Merchandising at smith+noble, a DTC subsidiary of the Home Shopping Network.  He also was the VP of Marketing/CMO for Del Monte Fresh North America and held senior marketing roles at Pepsi-Cola Company and Smugglers&#8217; Notch Resort.  </p>\n\n<p>Matt Smith is an accomplished senior marketing executive with over 20 years of business building success in highly competitive entrepreneurial and Fortune 100 corporate environments within the consumer products, hospitality and ecommerce arenas.  </p>\n\n<p>Throughout his career he has served as Brand Champion, quickly assimilating competitive, consumer trends and opportunities to help brands find their strategic and creative “voice”, delivering positive business results. In each of his responsibilities, he has developed and implemented successful and innovative integrated marketing solutions that increased sales, built market share, and significantly improved the bottom-line. </p>","image":{"available_sizes":[[[150,109],"assets/images/resized/0020/0812/200812v2-max-150x150.jpg"],[[250,182],"assets/images/resized/0020/0812/200812v2-max-250x250.jpg"],[[450,328],"assets/images/resized/0020/0812/200812v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}