{"first_name":"Matthew","last_name":"Scott","permalink":"matthew-scott","crunchbase_url":"http://www.crunchbase.com/person/matthew-scott","homepage_url":"http://www.lifesworkgroup.com","birthplace":"","twitter_username":null,"blog_url":"http://www.matthewrayscott.com","blog_feed_url":"http://site.lifesworkgroup.com/home/rss.xml","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Nov 03 23:35:51 UTC 2008","updated_at":"Sun Nov 09 19:06:17 UTC 2008","overview":"<p>Matthew entered the United States Army in 1985 serving in various leadership positions as a combat infantryman, a Special Forces Psychological Warfare specialist, commanding combat medics during Operation Desert Storm in Iraq, and a paratrooper Captain with the legendary 82nd Airborne Division.</p>\n\n<p>In 1994, he made the decision to leave the military and chose a position as a sales and marketing consultant in the biotechnology market and within seven years, he was a Co-Developer and a Vice President, Sales for  a biotechnology company in San Diego, California.</p>\n\n<p>In 2004, the biotechnology business unit he co-developed, sold for 16x times earnings. He had surpassed every career and financial goal he set for myself after leaving the military. After this event, he began to ask the questions that would direct his life’s work fulfilling his definition of success and significance. His discoveries led to the formation of The Life’s Work Group, Inc.</p>\n\n<p>Matthew Scott serves as the Founder &amp; Managing Director, The Strategic Incubator, a global consulting firm equipping leaders to align strategic vision with a tactical execution of revenue producing activities in taking a great idea and building a revenue-producing process.</p>\n\n<p>He is also the Managing Partner of The Trunk Club, a company that revolutionizes the way men shop for clothing and define their authentic style.</p>\n\n<p>He completed his Masters Degree in Management in 1991 and completed certification as a Certified Professional Coach sanctioned by the International Coaching Federation (ICF) in 2006.</p>\n\n<p>He currently resides in Oregon with his wife and three children living with intention next to the ski trails of Mt. Hood and the vineyards of Willamette Valley. </p>","image":{"available_sizes":[[[109,150],"assets/images/resized/0002/7772/27772v1-max-150x150.jpg"],[[182,250],"assets/images/resized/0002/7772/27772v1-max-250x250.jpg"],[[200,274],"assets/images/resized/0002/7772/27772v1-max-450x450.jpg"]],"attribution":"<p>http://site.lifesworkgroup.com/about-matthew-scott/</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/4/2a4/682","title":"LinkedIn Profile "},{"external_url":"http://twitter.com/menatpausecoach","title":"Twitter Profile "}]}