{"first_name":"Matt","last_name":"Zuga","permalink":"matt-zuga","crunchbase_url":"http://www.crunchbase.com/person/matt-zuga","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Dec 05 21:22:37 UTC 2008","updated_at":"Thu Jun 04 06:30:45 UTC 2009","overview":"<p>Mr. Zuga is a founder and managing member of Red Abbey Venture Partners. Mr. Zuga is responsible for managing all of the firm’s investments, which consist of 23 companies, 14 privately held and 9 publicly traded (see Portfolio). He is currently a BOD observer at Advanced BioHealing and Alba Therapeutics Corporation and, prior to its IPO, at Sirtris Pharmaceuticals. Mr. Zuga is a member of Red Abbey Venture Partners’ Investment Committee.</p>\n\n<p>From May 2000 to December 2003, Mr. Zuga was a Managing Director in the investment banking department of Legg Mason Wood Walker, Inc. and the Head of the Life Sciences Group. During that period, Legg Mason executed 22 financings and raised more than $1 billion for life sciences companies. Mr. Zuga was primarily responsible for the creation of the Life Sciences Investment Banking Group and developed relationships with a select group of companies in four distinct areas: biotechnology, specialty pharmaceuticals, drug discovery and genomics. Furthermore, over a career of more than ten years at Legg Mason, Mr. Zuga worked on a wide variety of investment banking transactions for a well-diversified group of clients.</p>\n\n<p>Mr. Zuga’s prior work experience includes positions at Raymond James &amp; Associates, Inc. (investment banking), Southeast Bank, N.A. (commercial lending), IBM Corporation (finance department) and General Motors Corporation (industrial engineering). From 1985 to 1991, Mr. Zuga was a member of the United States Air National Guard (Ohio and Florida).</p>\n\n<p>Mr. Zuga received an MBA from the Kenan-Flagler Business School at the University of North Carolina at Chapel Hill in 1993 and a BS in Business Administration/Finance from The Ohio State University in 1988.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Advisor","firm":{"name":"New Markets Venture Partners","permalink":"new-markets-venture-partners-2","type_of_entity":"financial_org","image":{"available_sizes":[[[150,30],"assets/images/resized/0002/9665/29665v3-max-150x150.jpg"],[[250,51],"assets/images/resized/0002/9665/29665v3-max-250x250.jpg"],[[450,92],"assets/images/resized/0002/9665/29665v3-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Managing Director","firm":{"name":"Red Abbey Venture Partners","permalink":"red-abbey-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,98],"assets/images/resized/0004/6604/46604v1-max-150x150.jpg"],[[175,115],"assets/images/resized/0004/6604/46604v1-max-250x250.jpg"],[[175,115],"assets/images/resized/0004/6604/46604v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}