{"first_name":"Matt","last_name":"Peschong","permalink":"matt-peschong","crunchbase_url":"http://www.crunchbase.com/person/matt-peschong","homepage_url":"http://www.mankatowebdesign.com/","birthplace":"Minneapolis, MN","twitter_username":"","blog_url":"http://www.mankatowebdesign.com/company-blog/","blog_feed_url":"http://www.mankatowebdesign.com/company-blog/rss","affiliation_name":"Manakto Web Design Corp. ","born_year":1984,"born_month":12,"born_day":17,"tag_list":"minneapolis-web-design, minneapolis-seo, mankato-web-design, matt-peschong","alias_list":null,"created_at":"Fri May 25 17:25:54 UTC 2012","updated_at":"Thu May 31 02:36:55 UTC 2012","overview":"<p>Matt Peschong, age 27, founded Mankato Web Design in 2005. Having developed his first website at the age of 11, Matt brings the experience and background necessary to provide personal one-on-one client relationships from conception to completion. Matt believes that unlike many web design companies out there, you should have 1 contact from the beginning of your project to the end. In many cases, Matt will be the only person you’ll ever want or need to talk to. This personal communication is possible because Matt has extensive experience with web design, programming, market research, and the competitive landscape of business throughout Minnesota.</p>\n\n<p>Matt brings over 13 years of business ownership, web design, and online marketing to Mankato Web Design. His ability to spot and capitalize on new and unique market trends is incomparable and keeps him ahead of the competition for his clients. Matt believes that high web rankings are only a single part of the puzzle. Matt believes that top ten rankings on the search engines or an attractive web design mean nothing unless that website is producing leads and new customers.</p>\n\n<p>As a self taught web designer from the age of 11, Matt has kept himself up to date on latest trends not by relying on books but actually building and producing businesses online and selling them after they become successful.</p>\n\n<p>Matt has earned his Bachelor’s Degree in 2008 from Mankato State University and has driven over 150,000 miles from Mankato to the Twin Cities over a 2 year period.</p>\n\n<p>In June 2009, after having driven those 150,000 miles, Matt decided to move the company to Andover, MN to reduce travel time to and from meetings and provide more flexible meeting arrangements. After realization that Andover, MN wasn’t the place for a 24 year old to really make a name for himself, he decided to leave the suburbs behind and move to the Uptown area of Minneapolis and currently offices out of Northeast Minneapolis.</p>\n\n<p>As of the end of 2012, Mankato Web Design has worked with well over 1,000 small businesses throughout Minnesota and the United States.</p>\n\n<p>In his free time, Matt is an active member of the “Big Brother, Big Sister” program and mentors a 13 year old named Brandon. Matt also is involved in dog transport for the “Paws for a Cause” organization to rescue abandoned and abused pets.  Matt is also a practicing student pilot at the Crystal Airport.</p>","image":null,"degrees":[{"degree_type":"Bachlelors","subject":"Marketing","institution":"Mankato State University","graduated_year":2005,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President","firm":{"name":"Manakto Web Design Corp. ","permalink":"manakto-web-design-corp","type_of_entity":"company","image":null}},{"is_past":false,"title":"Owner","firm":{"name":"Halloween Costumes Minnesota","permalink":"halloween-costumes-minnesota","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.mankatowebdesign.com","title":"Minneapolis Web Design"},{"external_url":"http://www.facebook.com/mankatowebdesign","title":"Facebook"},{"external_url":"https://plus.google.com/107731925793384127933","title":"Google +"}]}