{"first_name":"Matthew","last_name":"Friend","permalink":"matthew-friend","crunchbase_url":"http://www.crunchbase.com/person/matthew-friend","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jul 29 01:41:02 UTC 2008","updated_at":"Tue Jul 29 01:42:50 UTC 2008","overview":"<p>Matthew Friend comes to Landmark with a diverse background and expertise in both the Media and Government sectors. Prior to joining Landmark, Matthew worked as an analyst/media liaison for the US-China Economic and Security Review Commission, a bi-partisan commission chartered by Congress to review the national security implications of trade and economic ties between the United States and the People&#8217;s Republic of China. Matthew also spent time on the campaign trail as a staff member for former NY Governor George Pataki&#8217;s successful re-election bid in 2002. From there, Matthew went to the prestigious William Morris Agency, recognized as best-in-class in the entertainment business, where he served as a liaison for clients and buyers across the television and publishing departments, handling high-level business development and contract negotiations, and fostering deep connections across the media industry. At Landmark, Matthew is responsible for client acquisition activities as well as supporting executive relationships in the Media and Entertainment fields across a broad spectrum of Fortune 500 firms. Matthew graduated with Dean&#8217;s List Honors from the University of Maryland, College Park with a B.A. in Government and Politics and spent six months in Barcelona studying International Business and Marketing. </p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"General Partner","firm":{"name":"Landmark Ventures","permalink":"landmark-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,92],"assets/images/resized/0002/2859/22859v7-max-150x150.jpg"],[[250,153],"assets/images/resized/0002/2859/22859v7-max-250x250.jpg"],[[450,277],"assets/images/resized/0002/2859/22859v7-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}