{"first_name":"Matthew","last_name":"Vettese","permalink":"matthew-vettese","crunchbase_url":"http://www.crunchbase.com/person/matthew-vettese","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 17 06:13:01 UTC 2012","updated_at":"Wed Jul 18 02:52:41 UTC 2012","overview":"<p>Matthew Vettese Uses Condiments for Health </p>\n\n<p>Matthew Vettese earned a PhD in nutritional science and is a dietary consultant committed to getting Americans to eat better. He&#8217;s actively responding to America&#8217;s obesity epidemic by visiting schools and hospitals all over the country to educate people about eating for good health. As he says, &#8220;Increased awareness about diet is always a good thing.&#8221;</p>\n\n<p>Matthew thinks it&#8217;s as important to focus on what&#8217;s good to eat, as well as what foods or ingredients should be avoided. With that in mind, here are a couple of Matthew&#8217;s favorite healthy condiments to add to your diet.</p>\n\n<p>Expert Matthew Vettese&#8217;s Favorite Condiments</p>\n\n<ul>\n<li>Apple Cider Vinegar</li>\n</ul>\n\n<p>Apple cider vinegar is a great condiment to add into your diet in a number of ways. First, Matthew recommends taking two tablespoons of apple cider vinegar before each meal. It will give you a boost of energy and improve your digestive system. People interested in losing weight will be happy to know that it also makes it harder for your body to store the fat from your meal.</p>\n\n<p>It is a vinegar, and some people may find the taste of it on its own is too acidic. You can dilute the two tablespoons of apple cider vinegar by mixing it in a glass of water. Drinking your apple cider vinegar this way can also be better for your teeth, as the acidity of the undiluted vinegar can hurt tooth enamel.</p>\n\n<p>Apple cider vinegar is also a good option to use in a salad dressing. Mix it with some olive oil, lemon juice, garlic, and black pepper.</p>\n\n<ul>\n<li>Cinnamon</li>\n</ul>\n\n<p>The healthfulness of this spice is great news for people who like their desserts, but are trying to eat better. It can slow the blood sugar response to the food you&#8217;re eating. This means you&#8217;ll feel full longer and are less likely to suffer from sudden, intense hunger, which often results in bad food choices. This response to cinnamon can also help people who are pre-diabetic or have Diabetes.</p>\n\n<p>The heat of cinnamon is also believed to help ramp up your metabolism, which is more good news for people looking to lose weight. Matthew recommends adding cinnamon to your coffee or a healthy fruit shake. You can also add it to healthy snacks like unsweetened apple sauce or cottage cheese. Matthew Vettese wants you to enjoy eating healthy, so take advantage of these tips and other tips from Matthew that you can read about it on this site.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/1369/201369v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/1369/201369v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/1369/201369v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}