{"first_name":"Matthew S.","last_name":"Reno","permalink":"matthew-reno","crunchbase_url":"http://www.crunchbase.com/person/matthew-reno","homepage_url":"http://twitter.com/msreno","birthplace":"","twitter_username":"chaskiintl","blog_url":"","blog_feed_url":"","affiliation_name":"ChopChewy","born_year":null,"born_month":null,"born_day":null,"tag_list":"human-global-media, chopchewy, kiwi-ad-agency, kiwitogo, reno, matthew-s-, matthew, matt-reno, matthew-s--reno, business-development, los-angeles, found-gallery, found-la, marx--trotsky, brady-brim-deforest, tubefilter, streamy-awards, chaski, chaski-inte","alias_list":null,"created_at":"Wed Jun 18 23:23:32 UTC 2008","updated_at":"Mon Nov 22 19:39:52 UTC 2010","overview":"<p>Matthew Reno is a former executive at Human Global Media, and is presently a Co-Founder of ChopChewy. </p>\n\n<p>Human Global Media, Ltd. operates one of the first web development agencies in the United States. The company as it is known today, was formerly The Human Group, Ltd., established in 2003 after the restructuring of Online Computing and Net Success, founded in 1996 and 1995, respectively. </p>\n\n<p>Hg is a diversified media holdings company whose portfolio includes, among others, the Kiwi Ad Agency in Los Angeles. Kiwi specializes in web development and strategic online consulting. Human Global also operates Marx &amp; Trotsky, a private strategic web consultation firm, as well as the Found Gallery, displaying private art collections.</p>\n\n<p>In 2003 Matthew Reno joined the administration team at The Human Group to facilitate project management. He is credited with the strategic restructuring of the original five creative art groups into three: Kiwi, GrooveGrotto &amp; Walking Man Productions. In 2005, The Human Group re-branding and became Human Global Media, acquiring a series of related creative brands. Mr. Reno helped engineer a network of independent contractors to manage the increased workflow at Kiwi. Before his initial departure from Hg, Mr. Reno began CRM marketing for parent company Hg.</p>\n\n<p>In 2007, Mr. Reno returned to Human Global to manage new business development, overseeing a team of Account Managers. As an executive, Matthew expanded workflow at Kiwi through B2B network transactions, and he remains an active member of Digital LA, Web 2.0, Media Leaders, the Media &amp; Entertainment Club (LA), and is of counsel to the DataPortability Steering Committee.</p>\n\n<p>A collective of executives at Hg, including Mr. Reno, parlayed the development of ChopChewy, which is currently in private Beta.</p>","image":{"available_sizes":[[[119,150],"assets/images/resized/0003/7328/37328v2-max-150x150.jpg"],[[198,250],"assets/images/resized/0003/7328/37328v2-max-250x250.jpg"],[[357,450],"assets/images/resized/0003/7328/37328v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Co-Founder","firm":{"name":"ChopChewy","permalink":"chopchewy","type_of_entity":"company","image":{"available_sizes":[[[150,108],"assets/images/resized/0002/0639/20639v2-max-150x150.jpg"],[[250,181],"assets/images/resized/0002/0639/20639v2-max-250x250.jpg"],[[450,326],"assets/images/resized/0002/0639/20639v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.chaskiintl.com","title":"Managing Director"}],"web_presences":[{"external_url":"http://www.chaskiintl.com","title":"Chaski International, LLC"}]}