{"first_name":"Matthew","last_name":"Ponsford","permalink":"matthew-ponsford","crunchbase_url":"http://www.crunchbase.com/person/matthew-ponsford","homepage_url":"http://www.matthewponsford.com","birthplace":"Halifax, Nova Scotia, Canada","twitter_username":"MatthewPonsford","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1987,"born_month":12,"born_day":8,"tag_list":"","alias_list":null,"created_at":"Thu Feb 10 08:00:42 UTC 2011","updated_at":"Tue Aug 14 22:53:55 UTC 2012","overview":"<p>Matthew Ponsford is a J.D. candidate at the University of Ottawa Faculty of Law and holds dual Canadian/British citizenship. He currently serves on the Finance and Audit Committee of Amnesty International Canada&#8217;s Board of Directors.</p>\n\n<p>Matthew graduated first-class from Queen&#8217;s University (B.Sc., 2010) as a Queen&#8217;s Chancellor&#8217;s Scholar and a Canada Millennium Excellence Award National Laureate, one of 100 Canadian students awarded from 10,000 applicants. He holds the Duke of Edinburgh’s™ Gold Standard Award (2009), the Governor General of Canada&#8217;s Bronze Academic Medal (2006) and the Nova Scotia Lieutenant Governor&#8217;s Medal (2003).</p>\n\n<p>Ponsford founded and managed Minds Against Mines (MAM) in 2008, a global humanitarian and landmines awareness organization Queen&#8217;s University in Kingston, ON, Canada.</p>\n\n<p>Ponsford was responsible for the membership campaign drive, executive recruitment, first site-launch, infrastructure and constitutional development, as well as national partnership establishment with like-minded university undergraduates. Ponsford was able to secure long-term partnership agreements with organizations such as SOS Children&#8217;s Villages Canada, Mines Action Canada, and Youth Canada: Canada&#8217;s Top Resource for High School Students. Collaborative projects were also executed with the Canadian Red Cross, and MAM was the first landmines awareness organization to partner with SAREDO, an international rehabilitation and development project based in Africa.</p>\n\n<p>In addition to MAM, Ponsford founded and co-launched Canada&#8217;s first-ever Queen&#8217;s Pre-MBA Society for aspiring MBA graduates and young Canadian leaders. Prospective business graduates are able to connect, network and seek expert advice from leading business professionals across the country.</p>\n\n<p>While at Queen&#8217;s, Ponsford was a nominated finalist for a Rhodes Scholarship. </p>\n\n<p>Since 2006, he has attended 25 national conferences in Canada, the USA and Europe. His training expertise includes: team-building, facilitation, diversity and inclusiveness, alternative dispute resolution, policy development, planning/evaluation, communications strategy and public engagement.</p>\n\n<p>He has worked in numerous capacities with Amnesty International Canada. Involvements include representing the Canadian section as a delegate to the International Council Meeting in The Netherlands in 2011 and work with the National Business and Human Rights Program.</p>\n\n<p>He served as a Sarah Rosen Public Service Scholar at the Democratic National Committee in Washington, D.C., where he helped push forward President Barack Obama’s agenda for change during the 2010 midterm election cycle, assisting with the organization and execution of Presidential rallies in D.C., Maryland, Virginia and Ohio.</p>\n\n<p>In Canada, he worked briefly for the New Democratic Party of Canada during the 2011 federal election and has been consulted by numerous non-profit, non-governmental and private organizations. His experience includes briefings and work for several Members of Parliament, provincial and municipal politicians and advising the Nova Scotia Department of Economic and Rural Development and Tourism.</p>\n\n<p>Contact &amp; requests: mponsford@uottawa.ca / matthew.p.ponsford@gmail.com</p>","image":{"available_sizes":[[[114,150],"assets/images/resized/0012/1358/121358v5-max-150x150.jpg"],[[190,250],"assets/images/resized/0012/1358/121358v5-max-250x250.jpg"],[[342,450],"assets/images/resized/0012/1358/121358v5-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BSc","subject":"Biology, Environmental Studies","institution":"Queen's University","graduated_year":2010,"graduated_month":null,"graduated_day":null},{"degree_type":"JD","subject":"Law","institution":"University of Ottawa/Université d'Ottawa","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"","subject":"Post-Grad, Embassy and Diplomatic Scholars Program","institution":"Washington Internship Institute","graduated_year":2011,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/profile/edit?trk=hb_tab_pro_top","title":"LinkedIn Profile"},{"external_url":"ttp://www.facebook.com/matthewponsford","title":"Facebook Profile"},{"external_url":"http://www.twitter.com/matthewponsford","title":"Twitter Profile"},{"external_url":"http://queensu.academia.edu/MatthewPonsford","title":"Academia.Edu Profile"}]}