{"first_name":"Matthew","last_name":"Mandell","permalink":"matthew-mandell-2","crunchbase_url":"http://www.crunchbase.com/person/matthew-mandell-2","homepage_url":"http://www.MandellEnterprises.com","birthplace":"Montvale, NJ","twitter_username":"mattmandell","blog_url":"http://www.mandellenterprises.com/blog/","blog_feed_url":"","affiliation_name":"ConvenientCloset","born_year":1981,"born_month":11,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jan 18 16:27:01 UTC 2011","updated_at":"Thu Jan 27 06:59:36 UTC 2011","overview":"<p>Matt is the founder of ConvenientCloset.com, CityCentric.com, DCSnacks.com and Store4Summer.com. An entrepreneur in the true sense of the word, Matt founded his first company, Spotlight Productions in 1994. Spotlight Productions provided lights, music and fun foods for public and private events of all sizes throughout New Jersey and New York. What unites each of Matt&#8217;s ventures is his desire to lift the spirit of his customers and make their lives easier in simple ways.</p>\n\n<pre><code> For six years Matt served as a member of the Volunteer Ambulance Corps in Upper Saddle River, New Jersey as well as Emergency Medical Response Group in Washington, DC, amassing more than 3000 hours of community service riding on an ambulance. An avid guitar player, Matt chose to spend a week with luthier Frank Finocchio and hand-built an acoustic steel string guitar in the sumer of 2002.  \n\n In 2006, Matt joined a team at Avendra, a $2.5B procurement company, as the market strategy manager, developing strategic vision as well as creating and executing a value proposition for new market penetration. In 2008, Matt sold his summer storage company, Store4Summer.com to an Allied Van Lines franchisee. After 1.5 years at Avendra, the allure of managing the business that he built brought him back, returning him to a company that was rapidly increasing in size with over 25% growth in 2007. \n\n In 2008, Fox Business News profiled Matt for a national program to teach students about entrepreneurship. Matt is currently pursuing his MBA at GWU, as well as working to strengthen DCSnacks.com and develop new ventures. In September 2009, Matt launched CityCentric.com, a home cleaning and laundry delivery company serving Maryland, Washington, DC and Northern Virginia. Matt serves as a board member of the DC chapter of Entrepreneurs&amp;amp;#8217; Organization.\n\n Matt has been widely covered in national and local publicity, including Bon Appetit, New York Times, Washington Post, Washington Times, Washington Post Express, DCist.com, Fox 5, Fine Living Network, WTOP, NPR, Splendid Table, Campus CEO, Campus Technology, DailyCandy and many other blogs.\n</code></pre>","image":null,"degrees":[{"degree_type":"MA","subject":"Psychology","institution":"George Washington University","graduated_year":2004,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"Business","institution":"George Washington University","graduated_year":2010,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Director","firm":{"name":"ConvenientCloset","permalink":"convenientcloset","type_of_entity":"company","image":null}},{"is_past":false,"title":"Director","firm":{"name":"Store4Summer","permalink":"store4summer","type_of_entity":"company","image":null}},{"is_past":true,"title":"CEO","firm":{"name":"DCSnacks","permalink":"dcsnacks","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/mattmandell","title":"Twitter"},{"external_url":"http://www.mandellenterprises.com/blog/","title":"Blog"}]}