{"first_name":"Matthew","last_name":"Peters","permalink":"matthew-peters","crunchbase_url":"http://www.crunchbase.com/person/matthew-peters","homepage_url":"http://www.searchmanipulator.com","birthplace":"San Francisco","twitter_username":"SEOSearchMan","blog_url":"http://searchmanipulator.wordpress.com/searchmanipulator-com-reviews/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1979,"born_month":12,"born_day":16,"tag_list":"seo, matthew-peters, searchmanipulator-com, searchmanipulator-com-reviews, online-reputation-management, diy-seo","alias_list":null,"created_at":"Thu Sep 20 20:04:21 UTC 2012","updated_at":"Tue Sep 25 02:37:11 UTC 2012","overview":"<p>I am from San Francisco and am known for changing the online reputation management industry. Before the software I created, everyone had to spend thousands to Reputation.com. Now, you have the option of doing it yourself with easy to use software. This software has made other reputation management and SEO firms be less secretive with their services. They use to make it seem like it was rocket science, but the software I created &#8220;SearchManipulator Gold&#8221; allows anyone with no computer skills to do it themselves. </p>\n\n<p>While working in Redwood City at an online reputation management firm, I realized that the consumer should have the technology that we used. This inspired me to create &#8220;Do It Yourself&#8221; SEO Software. This software is easy to use, takes less than an hour to do, and has multiple purposes. You can suppress a negative website or review on your search results, you can promote a website through SEO, and you can increase your online presence which will prevent a negative website from emerging in the future. None of our clients thought a negative website would emerge about them, so we urge everyone to use the software before your search results become a problem. </p>\n\n<p>After popular demand, we now offer professional services where we handle everything for you from start to finish. Because of our award winning software, we can beat any competitors quote. We are the best in the industry, which is why we back up our services and software with a full money back guarantee. </p>","image":{"available_sizes":[[[150,146],"assets/images/resized/0021/2301/212301v2-max-150x150.jpg"],[[250,244],"assets/images/resized/0021/2301/212301v2-max-250x250.jpg"],[[450,440],"assets/images/resized/0021/2301/212301v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BS","subject":"Military Science","institution":"Loyola","graduated_year":2000,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.searchmanipulator.com","title":"Matthew Peter's New Company"}]}