{"first_name":"Matt","last_name":"Malgari","permalink":"matt-malgari","crunchbase_url":"http://www.crunchbase.com/person/matt-malgari","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Sep 14 13:10:14 UTC 2012","updated_at":"Thu Sep 20 22:30:48 UTC 2012","overview":"<p>A love of theater and performance was embedded in Matt Malgari from a young age. The former actor got his first taste of the limelight as a child, when he had a role in his town&#8217;s community theater musical production. As a high school student, Matt was accepted into a prestigious performing arts school. Attending a high school focused on the performing arts meant Malgari had the chance to study dance, singing and acting alongside of algebra and biology.</p>\n\n<p>After graduation, Matt moved to New York City with the hopes of launching his acting career. The going was rough at first, as Matt and his roommate and acting friend, Simon, spent days and weeks going to audition after audition without landing a role. Like many struggling actors, the two lived on a diet of ramen and found work as waiters while waiting for their big break. </p>\n\n<p>Matt&#8217;s big break came after a few years in the Big Apple. He landed a major role in a Broadway production, which soon led to more work on Broadway, as well as on television and in film. Matt Malgari also became known for his amazing vocal ability. When he wasn&#8217;t appearing on stage or on film, he performed at local clubs, singing the great classics and popular hits.</p>\n\n<p>The stress of the performer&#8217;s life soon took its toll on Matt, though. He loved acting, but didn&#8217;t love the strain of auditioning or the constant feeling of not knowing where his next loaf of bread would come from.  Another big change occurred in Matt&#8217;s life. He met his future wife, Julie, while performing at a club one night. Julie was the club&#8217;s manager. The two were married shortly thereafter.</p>\n\n<p>They moved to California in 2005, when Julie was offered a job out there. Matt was eager to move and restart his career, this time as a vocal and acting coach, not an actor. He held his first workshop in a West Hollywood studio, and things took off from there. Today, Matt Malgari&#8217;s workshops regularly sell out. In addition to teaching a group workshop every week, Matt also offers private coaching sessions for performers looking for a more one on one training experience.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0021/1345/211345v2-max-150x150.png"],[[250,153],"assets/images/resized/0021/1345/211345v2-max-250x250.png"],[[260,160],"assets/images/resized/0021/1345/211345v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}