{"first_name":"Matt","last_name":"Moynahan","permalink":"matt-moynahan","crunchbase_url":"http://www.crunchbase.com/person/matt-moynahan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jul 01 06:09:04 UTC 2009","updated_at":"Wed Jul 01 06:09:51 UTC 2009","overview":"<p>Matt Moynahan, chief executive officer of Veracode, is responsible for all aspects of the company, including strategy, operations, finance, product management, engineering, marketing and business development. He was recently named Ernst &amp; Young Entrepreneur of the Year 2008 award finalist and was recognized as one of the &#8220;40 Under 40&#8221; top leaders in Greater Boston by the Boston Business Journal.\nBefore joining Veracode, Mr. Moynahan was vice president of the Consumer Products and Solutions division at Symantec, where his key responsibilities included product management, product development and quality assurance. In that role, he was responsible for the definition and implementation of Symantec Online Services. He also held the position of vice president of product management for the client and host security division at Symantec, where he oversaw product management and product strategy for enterprise client and host product lines as well as the Norton consumer and small business product lines. Mr. Moynahan also served as Symantec’s senior director of strategic marketing, where he developed Symantec’s corporate business and marketing strategies.\nPrior to joining Symantec, Mr. Moynahan acquired 10 years experience in the industry through his work with leading technology and finance companies. He served as vice president of worldwide sales and corporate development at Reciprocal, Inc., a leading security management services provider. In that role, he oversaw all direct and indirect sales efforts, and developed technology alliances and strategic channel partnerships. At Reciprocal, Mr. Moynahan also served as general manager of the digital publishing and electronic software distribution divisions, where he was responsible for each division’s worldwide sales, marketing, product management and business development activities.\nEarlier in his career, Mr. Moynahan served as director of marketing and corporate development with OneWave, Inc., where he managed the company’s initial public offering (IPO), corporate financing, and market positioning. Mr. Moynahan also worked at the leading investment bank Goldman, Sachs &amp; Co., where he held positions in their leveraged finance, corporate finance, and equity capital market groups.\nMr. Moynahan earned his Bachelor of Arts degree in history from Williams College in Williamstown, Mass., and holds a Masters in Business Administration from Harvard University Graduate School of Business Administration in Boston.</p>","image":{"available_sizes":[[[131,131],"assets/images/resized/0005/1484/51484v1-max-150x150.jpg"],[[131,131],"assets/images/resized/0005/1484/51484v1-max-250x250.jpg"],[[131,131],"assets/images/resized/0005/1484/51484v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Co-Founder and CEO","firm":{"name":"Veracode","permalink":"veracode","type_of_entity":"company","image":{"available_sizes":[[[150,28],"assets/images/resized/0003/2950/32950v1-max-150x150.png"],[[237,45],"assets/images/resized/0003/2950/32950v1-max-250x250.png"],[[237,45],"assets/images/resized/0003/2950/32950v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}