{"first_name":"Matthew","last_name":"Strottman","permalink":"matthew-strottman","crunchbase_url":"http://www.crunchbase.com/person/matthew-strottman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue May 19 10:23:03 UTC 2009","updated_at":"Tue May 19 10:28:34 UTC 2009","overview":"<p>Matthew Strottman currently serves as Executive Vice President and Chief Financial Officer of In-Q-Tel, Inc., the independent strategic investment firm that identifies innovative technology solutions to support the mission of the CIA and broader U.S. Intelligence Community.  In that role, he is responsible for overseeing investment and portfolio analysis and for managing all corporate functions such as finance, accounting, corporate operations and human resources.  Prior to taking on the CFO responsibilities, Mr. Strottman served as the Senior Director of Investment Analysis at In-Q-Tel where he managed the vetting and due diligence of all potential investments as well as portfolio management involving tracking the financial performance and valuations of In-Q-Tel’s investments. </p>\n\n<p>Prior to joining In-Q-Tel, Mr. Strottman worked in the Technology Investment Banking Group at Friedman Billings Ramsey &amp; Co, Inc (Nasdaq: FBCM).  During his four years at FBR, Mr. Strottman executed public and private equity financing, merger and acquisition, restructuring, and venture capital transactions totaling over $3 billion.  Mr. Strottman began his career at PricewaterhouseCoopers, LLP in Los Angeles where he focused primarily on the real estate and technology industries.</p>","image":null,"degrees":[{"degree_type":"BA","subject":"","institution":"University of Notre Dame","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Executive Vice President and CFO","firm":{"name":"In-Q-Tel","permalink":"in-q-tel","type_of_entity":"financial_org","image":{"available_sizes":[[[125,91],"assets/images/resized/0002/9271/29271v1-max-150x150.png"],[[125,91],"assets/images/resized/0002/9271/29271v1-max-250x250.png"],[[125,91],"assets/images/resized/0002/9271/29271v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}