{"first_name":"Matt","last_name":"Burlage","permalink":"matt-burlage","crunchbase_url":"http://www.crunchbase.com/person/matt-burlage","homepage_url":"http://irg.biz","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"iRG Limited","born_year":null,"born_month":null,"born_day":null,"tag_list":"investment-banking, banking, finance, asia, hong-kong, japan, ipo, technology, media, telecom","alias_list":null,"created_at":"Sat Apr 26 05:52:05 UTC 2008","updated_at":"Mon Jul 14 23:47:58 UTC 2008","overview":"<p>Matthew Burlage is the Chief Executive Officer of IRG and has primary responsibility for the firm’s strategy and financial advisory business across the Asia Pacific region, including Japan. Matt is also responsible for the firm&#8217;s proprietary investments.</p>\n\n<p>Matt has spent the last two decades involved in corporate finance for Asia’s leading corporations, government enterprises and financial institutions. Before co-founding IRG, Matt was a Managing Director and Head of Industry Groups at Lehman Brothers in Hong Kong, where he created the first and largest dedicated technology, media and telecommunications (TMT) group at an investment bank in Asia. He built Asia’s leading TMT franchise and led the market, dominating lead management, advisory and strategic development for Asia Pacific’s leading TMT companies, including Hongkong Telecom, Korea Telecom, PT Indosat, PT Telkom, Pacific Internet, Korea Thrunet, Softbank, Yahoo Japan, PCCW, LG Group, and chinadotcom, among others. He has been an advisor on merger and acquisition strategy to Asia’s leading companies in Japan, Singapore, Hong Kong, Indonesia, China, Thailand, Taiwan, and Korea, as well as to leading global telecommunications operators in Europe and the U.S. Matt was ranked Number One in ex-Japan Corporate Asia, and Number Two in Corporate Asia, by Institutional Investor, and is a member of Institutional Investor’s Top 20 Global E-Finance Elite 2000 for Asia and Europe.</p>\n\n<p>Matt spearheads IRG’s investment of its own capital. Matt has built an impressive investment track record over the last several years. Relying on deep sector analysis, decades of Asian experience, an analysis of global trends and their applicability to Asia as well as a personal network across the Asia Pacific, Matt has managed the investment and montization of IRG&#8217;s recent investments and has personally participated in the corporate governance, strategy evolution and operational management of several of these efforts.</p>\n\n<p>Matt has an MBA from Harvard Business School, a BA from Yale University, and attended the Japanese Language Institute of Sophia University in Tokyo.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder & CEO","firm":{"name":"iRG Limited","permalink":"irg-limited","type_of_entity":"financial_org","image":null}},{"is_past":true,"title":"Managing Director & Head of Industry Groups","firm":{"name":"Lehman Brothers","permalink":"lehman-brothers","type_of_entity":"financial_org","image":{"available_sizes":[[[150,21],"assets/images/resized/0001/1387/11387v1-max-150x150.png"],[[219,32],"assets/images/resized/0001/1387/11387v1-max-250x250.png"],[[219,32],"assets/images/resized/0001/1387/11387v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}