{"first_name":"Matthijs","last_name":"van Leeuwen","permalink":"matthijs-van-leeuwen-2","crunchbase_url":"http://www.crunchbase.com/person/matthijs-van-leeuwen-2","homepage_url":"","birthplace":"Utrecht, Netherlands","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1980,"born_month":12,"born_day":13,"tag_list":"","alias_list":null,"created_at":"Tue Sep 25 07:48:34 UTC 2012","updated_at":"Thu Oct 11 18:29:27 UTC 2012","overview":"<p>Matthijs is an entrepreneur who gained significant experience in managing operational, BD/marketing and financial activities in two biotechnology start-ups in Cambridge (UK), Malaysia and Singapore. As a co-founder and COO in SimuGen he was responsible for raising VC funding, building a team, setting up a global supply chain, and securing key customers/partners. Currently, he&#8217;s involved as an entrepreneur in residence and COO in Camtech, a Singapore/Cambridge based technology incubator.</p>\n\n<p>In addition to his international entrepreneurial activities, Matthijs has been very active as a consultant at the Cambridge-MIT Institute and Library House in Cambridge (UK). He also worked as a Biosciences Analyst at Imperial Innovations in London where he performed due diligence and market analysis of spin-out, licensing and investment opportunities arising from Imperial College and external Universities/Research Institutes.</p>\n\n<p>Matthijs is trained at world class Universities in Europe such as the University of Cambridge and the University of Utrecht, where he gained a BsC in Biomedical Sciences and a MsC in Science &amp; Business. He has also been involved in a number of entrepreneurship and innovation programmes, such as the Cambridge University Entrepreneurs and the MIT Global Start-up Workshop.</p>","image":{"available_sizes":[[[129,150],"assets/images/resized/0021/2910/212910v2-max-150x150.jpg"],[[215,250],"assets/images/resized/0021/2910/212910v2-max-250x250.jpg"],[[388,450],"assets/images/resized/0021/2910/212910v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}