{"first_name":"Matthew","last_name":"J. McCooe","permalink":"matthew-j-mccooe","crunchbase_url":"http://www.crunchbase.com/person/matthew-j-mccooe","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jun 06 15:43:48 UTC 2009","updated_at":"Sat Jun 06 15:45:13 UTC 2009","overview":"<p>Matt joined CVP at its inception, coming from Columbia University Science and Technology Ventures (STV) where he managed a portfolio of spinout companies and the deployment of STV&#8217;s highly profitable seed fund. During his tenure at Columbia, eleven portfolio companies went public or were acquired by publicly traded companies. Prior to Columbia, Matt led two startup operations, both of which reached revenues in excess of $125MM and were acquired.</p>\n\n<p>In 1998, Matt co-founded Eureka Networks, a communications and application software organization. Earlier in his career, he managed product development, sales and marketing, and new product roll-outs for two Fortune 500 companies, Becton Dickinson and MCI. As a national sales leader at MCI, he rose to become marketing manager, launching MCI&#8217;s flagship voice and data products for Avantel, the company’s start-up joint venture in Latin America.</p>\n\n<p>At CVP, Matt focuses on early stage investments in communications, software and robotics. He represents CVP on the Board of RemoteReality, StackSafe and PacStar Communications.</p>\n\n<p>Matt earned an MBA from the Columbia University Graduate School of Business and a BA from Boston College. Matt serves on Columbia’s Private Equity and Venture Capital Advisory Board, and as an SBIR reviewer for the National Science Foundation. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founding Managing Partner  ","firm":{"name":"Chart Venture Partners","permalink":"chart-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,11],"assets/images/resized/0002/3381/23381v1-max-150x150.jpg"],[[250,19],"assets/images/resized/0002/3381/23381v1-max-250x250.jpg"],[[450,35],"assets/images/resized/0002/3381/23381v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}