{"first_name":"Matthew","last_name":"Emans","permalink":"matthew-emans","crunchbase_url":"http://www.crunchbase.com/person/matthew-emans","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Navic Networks","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jun 02 23:24:07 UTC 2008","updated_at":"Fri Jan 13 10:10:17 UTC 2012","overview":"<p>Matthew Emans is a technologist, strategist, and innovator. As Vice President of Product Management at Navic, Matthew was instrumental in the development of its industry-leading TV advertising solutions. Under his direction, Navic&#8217;s product vision was substantiated through acquisition by Microsoft in June 2008.</p>\n\n<p>Matthew is an experienced speaker in the television advertising and technology space. He has most recently presented at Ad Tech New York, SCTE and Digital Hollywood at CES. Matthew has a broad knowledge of advanced TV and  advertising solutions and is astutely perceptive of the industry’s current and future challenges. His areas of expertise cover a wide range of technologies, standards and TV topics including interactive television, addressable advertising, audience measurement, data-driven accountability, and new media business models.</p>\n\n<p>Prior to joining Navic in 2001, Matthew honed his skills in product strategy, systems architecture, and program management at Product Genesis, Inc., a strategic product development and consulting firm spun out of the MIT Innovation Center. Matthew earned a BS in Mechanical Engineering and Materials Science from Harvard College and has a background in robotics for medicine and control systems. He holds a number of patents related to optical biopsy systems and advanced surgical instruments.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP of Product Management","firm":{"name":"Navic Networks","permalink":"navic-networks","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0001/9847/19847v1-max-150x150.jpg"],[[246,87],"assets/images/resized/0001/9847/19847v1-max-250x250.jpg"],[[246,87],"assets/images/resized/0001/9847/19847v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}