{"first_name":"Matt","last_name":"Barrie","permalink":"matt-barrie","crunchbase_url":"http://www.crunchbase.com/person/matt-barrie","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Freelancer","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Aug 13 13:07:57 UTC 2009","updated_at":"Wed May 02 09:13:28 UTC 2012","overview":"<p>Matt Barrie is an award winning entrepreneur, technologist and lecturer. He is Chief Executive of Freelancer.com, the world&#8217;s largest outsourcing marketplace connecting over 2.5 million professionals from around the globe, and in the top 250 websites globally.</p>\n\n<p>Freelancer.com primarily connects small businesses and individuals from the western world with freelancers in the developing world, empowering entrepreneurs on both sides of the globe. To date, over 1 million projects have been outsourced through Freelancer.com.</p>\n\n<p>Matt is serial entrepreneur, previously as founder and CEO of Sensory Networks Inc., a vendor of high performance network security processors. Prior to this he founded a telecommunications hardware company, Dilithium Networks. Matt has raised over $40M USD in financing from venture capital, strategic investors and through government grants while running or assisting technology companies.</p>\n\n<p>For the last ten years has been an external lecturer at the Department of Electrical and Information Engineering at the University of Sydney, teaching Network Security, and starting in 2010, Technology Venture Creation. He is the co-author of over 20 US patent applications. Matt holds dual first class honours in Electrical Engineering and Science, a Masters in Applied Finance and a Masters in Electrical Engineering from Stanford.</p>\n\n<p>In 2006, he was awarded the State Pearcey Award for contribution to the IT&amp;T industry. In 2010 he was named Alumnus of the Year for the Faculty of Engineering and IT at the University of Sydney. In 2011 he was named inaugural BRW Entrepreneur of the Year, by Australia&#8217;s most prestigious business publication.</p>","image":{"available_sizes":[[[134,150],"assets/images/resized/0013/1053/131053v2-max-150x150.jpg"],[[223,250],"assets/images/resized/0013/1053/131053v2-max-250x250.jpg"],[[402,450],"assets/images/resized/0013/1053/131053v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MSEE","subject":"Electrical Engineering","institution":"Stanford University","graduated_year":1998,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chief Executive","firm":{"name":"Freelancer","permalink":"getafreelancer","type_of_entity":"company","image":{"available_sizes":[[[135,45],"assets/images/resized/0005/6323/56323v7-max-150x150.jpg"],[[135,45],"assets/images/resized/0005/6323/56323v7-max-250x250.jpg"],[[135,45],"assets/images/resized/0005/6323/56323v7-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}