{"first_name":"Maurice","last_name":"Dekatt","permalink":"maurice-dekatt","crunchbase_url":"http://www.crunchbase.com/person/maurice-dekatt","homepage_url":"http://www.youtube.com/user.bmxentertainmentcorp","birthplace":"","twitter_username":"dekatt23","blog_url":"http://bmxe.blogspot.com/","blog_feed_url":"http://www.xfruits.com/bmxentertainmentcorp/?id=111393","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Aug 08 13:01:46 UTC 2010","updated_at":"Sun Aug 08 22:16:22 UTC 2010","overview":"<p>BMX ENTERTAINMENT CORPORATION, BMXE<br/>\nBusiness Description\nBMX Entertainment Corporation, (&#8220;the Company&#8221;) BMXE, was incorporated in the state of Delaware, USA, diversified media company digital content customer solutions, consumer and consumer channels content to sell online global outlets.  The Company will market products utilizing new technology strategies such as innovative personal devices and digital distribution from own servers while providing company business information directly to consumers.</p>\n\n<p>The Company has data management services ability to provide timely information about the Company to its customers and potential customers. The Company believes that its business strategy and all its it with competitive advantages. These factors will contribute to the potential services growth, provides business success of the Company&#8217;s contractual operations in domestic and international countries.</p>\n\n<p>Summary of Business Strategy \nThis new strategy will drive development in the key aspects of the Company&#8217;s business and will grow its value for customers and shareholders. \nA. The strategy using acquisitions, strengthen performance for growth. The Organic Growth process, instruction and leadership assist in keeping the goals and objectives of the Company initiative at the forefront of the effort. Developing ongoing business and businesses for subsidiaries, a strategy that increases cash flow revenue. \nB. The company has seventeen subsidiaries in good standing, the categories are media, manufacturing, supplier, REIT, technology, retail, games, food, energy, publishing, financial, healthcare. Their current contracts that are in place domestic and international.\nC. We listed on the stock market under symbol BMXE not trading, currently under review with underwriters. &#8220;Our strength comes from the knowledge of our brands, our performance is driven by a passion to develop innovative technologies, and our focus on simplicity stems from the growth opportunities derived from being responsive to an ever changing marketplace.</p>\n\n<p>Looking for second round funding</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0009/6570/96570v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0009/6570/96570v2-max-250x250.jpg"],[[450,450],"assets/images/resized/0009/6570/96570v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}