{"first_name":"Maven","last_name":"Kumar","permalink":"maven-kumar","crunchbase_url":"http://www.crunchbase.com/person/maven-kumar","homepage_url":"http://www.emavens.com","birthplace":"New Delhi","twitter_username":"emavensolutions","blog_url":"http://emavens.blogspot.com","blog_feed_url":"","affiliation_name":"Emaven Solutions","born_year":1987,"born_month":7,"born_day":7,"tag_list":"web-design, web-development, web-design-company, web-development-company, india, indian-web-design-india","alias_list":null,"created_at":"Tue Nov 29 06:26:38 UTC 2011","updated_at":"Fri Dec 02 08:03:31 UTC 2011","overview":"<p>eMaven Solutions is Award winning Web Development Company and deliver IT solutions. Whether it&#8217;s a corporate website to raise customer awareness of services and products, an ecommerce website to power sales, web-based tool to streamline company operations, corporate identity development to enhance companies outlook or software solution to help business run smoother, eMavens has the experience and expertise to deliver and exceed expectations. We provide these services for small to big-sized businesses across the globe.</p>\n\n<p>We are Experts in :</p>\n\n<pre><code>Website Designing\nweb Development\neCommerce Solutions\nWebsite Promotions\nSeo Services\nsoftware development\nWeb Applications Development\n</code></pre>\n\n<p>EMaven Solution was founded by a highly motivated group of people with more then six years of experience in Internet Programming, Software Development and Graphics Industry. Our company is located in the New Delhi, India.</p>\n\n<p>EMaven Solutions deliver business solutions. Whether it&#8217;s an Internet marketing site to raise customer awareness of services and products, an ecommerce site to power sales, web-based tool to streamline company operations, corporate identity development to enhance companies outlook or software solution to help business run smoother, eMaven Solutions has the experience and expertise to deliver and exceed expectations. We provide these services for small to big-sized businesses across the globe. Our flexible hours, affordable rates and customer service make us the premier business solution provider.</p>\n\n<p>Our great strength lies in vast experience and extensive expertise in web designing, web development and Internet Marketing for customers in diverse industry areas. Ever since our inception, we have been growing at a consistent pace with impressive track record of completing all our projects on schedule and budget. Over a period of time we have earned lot of national and international clients, We have a strong customer-centric approach that ensures a stable and long-term relationship with our Clients and a significant portion of our revenue comes from repeat and referential business.</p>","image":null,"degrees":[{"degree_type":"","subject":"","institution":"University of Delhi","graduated_year":2003,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"SEO HEAD","firm":{"name":"eMaven Solutions","permalink":"emaven-solutions","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.emavens.com","title":"Web Development India"}],"web_presences":[{"external_url":"http://www.twitter.com/emavensolution","title":""},{"external_url":"http://www.facebook.com/emavens","title":""},{"external_url":"http://www.digg.com/emavens","title":""}]}