{"first_name":"Max","last_name":"Smith","permalink":"max-smith","crunchbase_url":"http://www.crunchbase.com/person/max-smith","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Talking Media Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Feb 27 21:35:51 UTC 2011","updated_at":"Wed Feb 08 23:49:59 UTC 2012","overview":"<p>Max Smith has been a senior finance executive in digital media and marketing for over 15 years for both large established companies (Gartner and Warner Music) as well as small entrepreneurial companies (TechRepublic and Linkshare). Throughout all, Smith managed strategic business planning processes which identified and leveraged business growth drivers. He has created and managed strategic growth budgets as well as budgets to restructure, downsize and ultimately sell companies. In addition to driving organic growth and corporate restructuring, Smith has managed the acquisition and integration of over 40 companies as well as many divestures in various business development roles. Throughout his CFO and Corporate Development roles, Smith has participated in many rounds of financing including angel, venture capital, IPO and debt.</p>\n\n<p>Smith co-founded and continues to support Talking Media Group, a directory and database of digital media companies.</p>\n\n<p>Smith has also served on non-profit boards including the Brooklyn Autism Center and the University of Michigan Club of New York Scholarship Fund. In addition, Smith currently serves on the Board of Advisors for Songza Media, Inc.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder","firm":{"name":"Talking Media Group","permalink":"talking-media-group","type_of_entity":"company","image":{"available_sizes":[[[150,85],"assets/images/resized/0012/4207/124207v2-max-150x150.jpg"],[[250,142],"assets/images/resized/0012/4207/124207v2-max-250x250.jpg"],[[252,144],"assets/images/resized/0012/4207/124207v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}