{"first_name":"Max-Michael","last_name":"Mayer","permalink":"max-michael-mayer","crunchbase_url":"http://www.crunchbase.com/person/max-michael-mayer","homepage_url":"http://www.propertybase.com","birthplace":"","twitter_username":"mmmayer","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jul 12 22:25:58 UTC 2012","updated_at":"Fri Jul 13 08:45:14 UTC 2012","overview":"<p>Max-Michael Mayer is Managing Director and Co-Founder of Propertybase, the leading real-estate CRM solution built entirely on the Force.com “software as a service” platform. He is also Co-Founder of goodsales.com, a company which has built a new and innovative productivity tool for agents and freelancers.</p>\n\n<p>Prior to Propertybase, Max-Michael has held leadership positions which include Vice President Sales Eastern Europe and North Africa of Aconex (www.aconex.com), the largest provider of online collaboration for construction and engineering projects, and Director Business Development of conject (www.conject.com), the European leader of on Demand ILM solutions for the real estate industry, where he was responsible for developing the market in the Middle East and Gulf region.</p>\n\n<p>Previously, he was co-founder and managing partner of a business consulting firm, where he was responsible for real estate and technology consulting. Among his clients were consulting companies like Accenture and various global Financial, Investment, and Property Development companies. A trained banker, Max-Michael Mayer studied economics and worked in the corporate finance division of the State Bank of Baden-Württemberg. </p>\n\n<p>About Propertybase:\nPropertybase is the leading real-estate CRM solution built entirely on the Force.com “software as a service” platform.  That means it exists entirely “in the cloud” and requires almost no IT investment or development from its users. Propertybase offers real-estate-specific sales, marketing, and after-sales tools, and provides a complete front- and back-office application for real estate developers, brokers, and agents. It integrates smoothly with any website and can exchange data with leading real estate portals everywhere. Propertybase has clients in Europe, North America, the Middle East and Australia. Propertybase is Made in Germany with its headquarters in Munich. For more information please visit www.propertybase.com.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0020/0632/200632v2-max-150x150.jpg"],[[180,180],"assets/images/resized/0020/0632/200632v2-max-250x250.jpg"],[[180,180],"assets/images/resized/0020/0632/200632v2-max-450x450.jpg"]],"attribution":"<p>Max-Michael Mayer</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director and Co-Founder","firm":{"name":"Propertybase","permalink":"propertybase","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0015/6084/156084v1-max-150x150.jpg"],[[250,74],"assets/images/resized/0015/6084/156084v1-max-250x250.jpg"],[[263,78],"assets/images/resized/0015/6084/156084v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}