{"first_name":"Maxine","last_name":"Gowen","permalink":"maxine-gowen","crunchbase_url":"http://www.crunchbase.com/person/maxine-gowen","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 18 02:23:11 UTC 2009","updated_at":"Thu Jun 18 02:25:18 UTC 2009","overview":"<p>Max is the founding President and CEO of Trevena.  Prior to this Max had a variety of leadership roles at GlaxoSmithKline (GSK) over a period of fifteen years.  She established and led the Center of Excellence for External Drug Discovery (CEEDD), an innovative new approach to externalizing drug discovery in big pharma.  She was previously Managing Partner at SR One, the venture capital subsidiary of GSK where she led their investments in companies such as Conforma Therapeutics, Zelos Therapeutics Inc., Predix Pharmaceuticals, Inc., Morphotek Inc., AlgoRx  and Santarus, Inc.   She served on the Board of Directions of these and other companies.  Until 2002 Max was Vice President, Drug Discovery, Musculoskeletal Diseases at GSK, responsible for drug discovery and early development for osteoporosis, arthritis and metastatic bone disease.  Max held a tenured academic position in the School of Pharmacology, University of Bath, UK from 1989-1992.  Max graduated with a B.Sc. in biochemistry from the University of Bristol, UK and received a Ph.D. in cell biology from the University of Sheffield, UK.  She received an MBA from the Wharton School, University of Pennsylvania.   Max is currently serving on the Board of Directors of Human Genome Sciences and the Board of Directors of the biotechnology industry association, Bio.  She has recently acted as an advisor to the R&amp;D organizations of Merck Research Labs and GSK.  </p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0004/9264/49264v1-max-150x150.jpg"],[[150,150],"assets/images/resized/0004/9264/49264v1-max-250x250.jpg"],[[150,150],"assets/images/resized/0004/9264/49264v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President and CEO","firm":{"name":"Trevena","permalink":"trevena","type_of_entity":"company","image":{"available_sizes":[[[135,79],"assets/images/resized/0004/9263/49263v1-max-150x150.jpg"],[[135,79],"assets/images/resized/0004/9263/49263v1-max-250x250.jpg"],[[135,79],"assets/images/resized/0004/9263/49263v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}