{"first_name":"Maxim","last_name":"Krasnykh","permalink":"maxim-maxim","crunchbase_url":"http://www.crunchbase.com/person/maxim-maxim","homepage_url":"http://ru.linkedin.com/in/krasnykh","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Aug 16 12:53:54 UTC 2012","updated_at":"Mon Aug 20 09:13:36 UTC 2012","overview":"<p>Intel Capital Director based in Moscow, responsible for investments in Russia and CIS. </p>\n\n<p>Intel Capital, Intel&#8217;s global investment and M&amp;A organization, makes equity investments in innovative technology start-ups and companies worldwide. Intel Capital invests in a broad range of companies offering hardware, software, and services targeting enterprise, home, mobility, health, consumer Internet, semiconductor manufacturing and cleantech. Since 1991, Intel Capital has invested more than $10bn in over 1,100 companies in 51 countries. In 2011, Intel Capital invested $526mm across 158 new deals with approximately 51% of funds invested outside the United States and Canada. </p>\n\n<p>Prior to joining Intel Capital, Maxim was Investment Director at Alfa Capital Partners, . At Alfa he completed a number of private equity transactions in Russia, Turkey and Kazakhstan, totaling ca. $200mm. \nBefore joining Alfa, Maxim worked in investment banking and direct investing at Fleming Family and Partners, a British multifamily office. \nHe started his career in the Corporate Finance group of PwC, advising Russian and multinational clients on M&amp;As, disposals and strategy. At PwC his focus was on telecommunications, media and technology and he completed over a dozen of advisory projects representing more than $1bn of capital. \nMaxim received his MBA from Columbia Business School in New York and a MS in Finance from Finance University in Moscow. He is a Member of the CFA Institute.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0020/6368/206368v2-max-150x150.jpg"],[[200,200],"assets/images/resized/0020/6368/206368v2-max-250x250.jpg"],[[200,200],"assets/images/resized/0020/6368/206368v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}