{"first_name":"May","last_name":"Liang","permalink":"may-liang","crunchbase_url":"http://www.crunchbase.com/person/may-liang","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Ruckus","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Aug 22 10:06:38 UTC 2007","updated_at":"Wed Jan 14 03:46:28 UTC 2009","overview":"<p>May Liang is General Counsel and Chief Financial Officer for Ruckus Network, Inc., a digital entertainment service for colleges and universities.</p>\n\n<p>Previously, Ms. Liang served for almost three years as Executive Director of the Epilepsy Therapy Development Project, a non-profit whose mission is to advance new treatments for epilepsy into the market by funding cutting edge epilepsy research.</p>\n\n<p>Ms. Liang also served as Vice President and Associate General Counsel at America Online, Inc. for almost eight years. Ms. Liang’s areas of expertise included intellectual property, technology licensing, telecommunications and employment law. Her responsibilities included serving as general counsel to the Netscape Communications and AOL Technologies divisions. Ms. Liang has also been an associate at Soble &amp; Associates in Washington, D.C., Foulston &amp; Siefkin in Wichita, Kansas and Ware &amp; Freidenrich in Palo Alto, California. </p>\n\n<p>Ms. Liang has written numerous articles relating to intellectual property and has frequently spoken on intellectual property and technology licensing issues. She has bachelor’s degrees in electrical engineering and political science from Stanford University and her law degree from the University of Michigan.</p>\n\n<p>Ms. Liang also sits on the Board of Directors of the Falls Church – McLean Children’s Center and on the Advisory Board of the YMCA – Fairfax County and is Chair of the YMCA – Fairfax County Gala Committee. She is a member of the Executive Committee and the Board of Directors for the Epilepsy Therapy Development Project. In addition, she is a member of the Stanford University Special Gifts Committee, the Sidwell Friends National Leadership Gift Board and has previously served on the advisory boards of George Washington University’s Virginia Campus and the American Corporate Counsel Association. She is also a Fellow of the U.S.-Japan Leadership Program and Co-Chair of its Executive Committee.</p>","image":{"available_sizes":[[[110,50],"assets/images/resized/0003/3769/33769v1-max-150x150.jpg"],[[110,50],"assets/images/resized/0003/3769/33769v1-max-250x250.jpg"],[[110,50],"assets/images/resized/0003/3769/33769v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":null,"title":"Board","firm":{"name":"Ruckus","permalink":"ruckus","type_of_entity":"company","image":{"available_sizes":[[[150,29],"assets/images/resized/0003/3765/33765v2-max-150x150.png"],[[186,37],"assets/images/resized/0003/3765/33765v2-max-250x250.png"],[[186,37],"assets/images/resized/0003/3765/33765v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}