{"first_name":"Mayer","last_name":"Reich","permalink":"mayer-reich","crunchbase_url":"http://www.crunchbase.com/person/mayer-reich","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"RankAbove","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Dec 04 13:42:01 UTC 2008","updated_at":"Tue Aug 18 17:08:06 UTC 2009","overview":"<p>Mayer is a seasoned serial Internet entrepreneur with an excellent track record, having led several successful consumer internet ventures, building the companies from the ground-up.</p>\n\n<p>Mayer commands an exceptional grasp of Internet industry knowledge and throughout his career has garnered the capacity to create, focus and drive ongoing business development activities. Mayer excels at negotiating partnerships; closing deals (many with Fortune 500 companies) and guiding and implementing business strategy. </p>\n\n<p>Prior to co-founding RankAbove in 2007, Mayer was CEO of ITS, a leading search marketing firm with offices in NY and Israel. Prior to ITS, Mayer led a major lead generation company in the role of Sales Manager, providing services to such companies as IndyMac Bank, WAMU, Chase and other leading lending institutions.</p>\n\n<p>Mayer is a regular guest speaker at Universities and not-for-profit organizations on the subjects of using the Internet to excel at business and entrepreneurship, and creating, maintaining and spreading a web presence. Mayer was invited to sit on the Advisory Board of Young Entrepreneurs’ Israel and is a Graduate of the Merage Fellowship.</p>\n\n<p>Mayer was born and raised in New York and now lives in a suburb of Jerusalem with his wife and four children. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"RankAbove","permalink":"rankabove","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0004/6443/46443v2-max-150x150.jpg"],[[250,83],"assets/images/resized/0004/6443/46443v2-max-250x250.jpg"],[[450,150],"assets/images/resized/0004/6443/46443v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}