{"first_name":"MCS","last_name":"Technologies Ltd","permalink":"mcs-technologies-ltd","crunchbase_url":"http://www.crunchbase.com/person/mcs-technologies-ltd","homepage_url":"http://mcstech.co.uk/","birthplace":"London","twitter_username":"mcstechnologies","blog_url":"http://mcstechnologies.blog.com/2012/08/15/what-we-do/","blog_feed_url":"http://mcstechnologies.blog.com/2012/08/15/what-we-do/","affiliation_name":"Unaffiliated","born_year":1982,"born_month":11,"born_day":21,"tag_list":"httpmcstech-co-uk","alias_list":null,"created_at":"Mon Aug 20 12:26:59 UTC 2012","updated_at":"Thu Aug 23 18:58:25 UTC 2012","overview":"<p>I’d like to introduce you to MCS Technologies and the kind of services we provide.</p>\n\n<p>MCS is a registered leading IT Services Company helps clients to achieve technical, operational and financial objectives through proper development, testing and communication processes. We believe our service offerings will widen your customer base besides facilitating your customers an additional value from your services. We provide both Product Engineering and Product Implementation services.</p>\n\n<p>MCS Technologies has deep knowledge and experience of executing projects using PHP &amp; .Net We have a team of talented professionals and have worked over numerous projects like E-Commerce website development, shopping carts with content management system, CRM Solutions; Community tools Web Calendars, Chat software, Discussion forum and many more for our global clients. Our technical team is well versed and has worked on complex system for custom application development.</p>\n\n<p>MCS Technologies provides a variety of web development services from e-commerce website development to Enterprise portal development. We have a proficient team of IT professionals working around various E-commerce and CMS solutions. We provide customization, implementation and integrations services around various CMS (Drupal, Joomla, WordPress, DNN, Umbraco, Kentico etc.) and E-commerce (Magento, OsCommerce, X-cart, Asp.Net Storefront, UberCart, OsCommerce etc.) solutions. We have a proficient team of IT professionals including MS certified programmers working in .Net (ASP.Net, C#, VB.Net), WCF, WPF and SharePoint 2007 &amp; 2010, Microsoft Azure and Microsoft 365.</p>\n\n<p>Please help to pass on this info to your near and dear ones</p>\n\n<p>We are near you,</p>\n\n<p>MCS Technologies Ltd\nUnit M1.12 Innovation Centre\n49 Oxford Street \nLeicester \nUnited Kingdom \nLE1 5XY\nPh:0044-8719769259\nPh:0044-207 0962069\nE:info@mcstech.co.uk</p>","image":{"available_sizes":[[[150,60],"assets/images/resized/0020/6954/206954v2-max-150x150.jpg"],[[180,73],"assets/images/resized/0020/6954/206954v2-max-250x250.jpg"],[[180,73],"assets/images/resized/0020/6954/206954v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://mcstech.co.uk/","title":""},{"external_url":"http://mcstechnologies.wordpress.com/2012/08/14/contact-us/","title":""}]}