{"first_name":"Mehmet","last_name":"Altinel","permalink":"mehmet-altinel","crunchbase_url":"http://www.crunchbase.com/person/mehmet-altinel","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jul 30 17:59:30 UTC 2008","updated_at":"Wed Jul 30 18:04:04 UTC 2008","overview":"<p>Mehmet spearheads Anvato&#8217;s advertising infrastructure and data analysis back-end. Mehmet is one of the leading experts on large scale data access and processing. He joined Anvato from IBM Research, where he innovated, architected and delivered pioneering technologies, shaping future directions of IBM&#8217;s Information Management products. At IBM, he was the founding member and technical lead in the DAMIA (DAta Mashup Fabric for Intranet Applications) project, which became the centerpiece of recently announced InfoSphere MashupHub product. He also architected the DBCache prototype, which allows dynamic caching of partial content from backend databases. Prior to IBM, Mehmet was a senior member of the technical staff at Hughes Network systems. Before that, he was a Research Scientist at computer science department, University of Maryland. Mehmet holds a Ph.D., M.S. and B.S. in Computer Science from the Middle East Technical University (METU), Turkey. He has published numerous papers and journal articles on information management area in prominent database conferences and other venues.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Anvato","permalink":"anvato","type_of_entity":"company","image":{"available_sizes":[[[150,22],"assets/images/resized/0002/3026/23026v1-max-150x150.png"],[[250,37],"assets/images/resized/0002/3026/23026v1-max-250x250.png"],[[450,66],"assets/images/resized/0002/3026/23026v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}