{"first_name":"Mehmet","last_name":"Akcin","permalink":"mehmet-akcin","crunchbase_url":"http://www.crunchbase.com/person/mehmet-akcin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 20 17:40:09 UTC 2008","updated_at":"Fri Jun 20 18:08:23 UTC 2008","overview":"<p>Mehmet Akcin has been appointed to Chief Engineer of IT Operations for ICANN.</p>\n\n<p>He was hired by ICANN as Network Engineer in early June, 2006.</p>\n\n<p>Mehmet attended previous ICANN meetings in Canada and New Zealand. He also attended and presented at different meetings such as NANOG, RIPE, and CIF.</p>\n\n<p>Prior to that, Mehmet worked for the Network Information Center of Puerto Rico, Gauss Research Laboratory (NIC.PR), helping the technical improvement of the ccTLD .PR. Mehmet was also involved with the foundation of the first Internet Exchange Point (IX.PR) in the Caribbean coordinated by NIC.PR.</p>\n\n<p>Upon moving to Puerto Rico, Mehmet volunteered to teach the basics of home networking and computer security for high school students while working as the Director of IT Operations at CIQA Inc., a Pharmaceutical Validation Engineering Company, in charge of 75+ employees and their needs for IT. In 2004, Mehmet worked at the University of Puerto Rico, Rio Piedras Campus, as the IT Advisor to the Dean of College of Natural Sciences and IT Advisor to the Executive Director of Academic and Administrative Technology.</p>\n\n<p>Mehmet was born in Istanbul, Turkey. He has been involved with Internet and computers since the early 1990s. In 1999, he was the host of the first Turkish radio show dedicated to the Internet and Technology. He has participated in the setup and administration of linux servers at the Istanbul Technical University and Marmara University in Turkey.</p>\n\n<p>Mehmet holds a BS in Computer Sciences. He is fluent in Turkish, English and Spanish.</p>","image":{"available_sizes":[[[104,150],"assets/images/resized/0002/0751/20751v1-max-150x150.jpg"],[[132,190],"assets/images/resized/0002/0751/20751v1-max-250x250.jpg"],[[132,190],"assets/images/resized/0002/0751/20751v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.icann.org/general/staff.html\" title=\"ICANN\" rel=\"nofollow\">ICANN</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Engineer, IT Operations","firm":{"name":"ICANN","permalink":"icann","type_of_entity":"company","image":{"available_sizes":[[[150,121],"assets/images/resized/0002/0748/20748v1-max-150x150.png"],[[171,139],"assets/images/resized/0002/0748/20748v1-max-250x250.png"],[[171,139],"assets/images/resized/0002/0748/20748v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}