{"first_name":"Meir","last_name":"Amarin","permalink":"meir-amarin-2","crunchbase_url":"http://www.crunchbase.com/person/meir-amarin-2","homepage_url":"http://www.homeland-security-portal.com","birthplace":"Israel","twitter_username":"","blog_url":"http://israel-hightech-networking.ning.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"business-development, sales, ececutive, high-tech, technology, startegy, leadership, israel, venture-capital, networking","alias_list":null,"created_at":"Thu Nov 12 09:18:20 UTC 2009","updated_at":"Thu Nov 12 15:55:34 UTC 2009","overview":"<p>Meir has been intensively involved with several of Israel&#8217;s and US companies in top executive sales &amp; BD positions. This has given him the opportunity to look around, learn and identify new and growing trends with in the High-Tech market in general and the Telecommunication as a special. </p>\n\n<p>Meir gained substantial business experience and professional contacts as a result of many working years, mainly in Europe. He us fluent in English, Spanish, Italian &amp; Hebrew.</p>\n\n<p>Former employees include: Israel-America Chamber of Commerce, Visonic Group, Actelis Networks Inc. and others.</p>\n\n<p>Some of Meir&#8217;s portfolio ventures include:</p>\n\n<p>Amaritech Group\nhttp://www.amaritech.com\nCreative attitude and constant innovation are fundamental to your business success. We constantly strive to deliver innovative strategies and solutions to the business arena, delivering superior value to our customers and partners.</p>\n\n<p>The Biotech &amp; Pharma Portal\nhttp://www.biotech-portal.com\nThe Biotech Portal (TBP) is an interactive platform and informative arena where industry professionals can register, advertise and obtain information regarding new products, new technologies, industry news, case studies, investment opportunities and much more. TBP is an online association, aimed at serving the communities of the Life Science, Biotechnology, Pharmaceuticals, Medical Devices and CleanTech industries.</p>\n\n<p>The Homeland Security Portal (HLSP)\nhttp://www.homeland-security-portal.com\nHLSP serves the business community of the security and defense industries. It is a new concept in information gathering and sharing, and has been designed with industry professionals in mind by providing not only global happenings related to this exciting field, but also links pertaining to the latest and greatest in industry-related products and services.</p>\n\n<p>Networking Group:\nIsrael High-Tech Industry Networking Group\nhttp://www.israel-hightech-networking.ning.com\nPromoting networking among high tech professionals of Israel.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}