{"first_name":"Mel","last_name":"Willmirth","permalink":"mel-willmirth","crunchbase_url":"http://www.crunchbase.com/person/mel-willmirth","homepage_url":"","birthplace":"Fresno, CA","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1966,"born_month":1,"born_day":29,"tag_list":"","alias_list":null,"created_at":"Sat Jan 08 22:46:44 UTC 2011","updated_at":"Thu Jan 20 02:13:51 UTC 2011","overview":"<p>Melvin Arthur Willmirth II parents were film and television producers. His first memory of being on planet earth was with his father on the set at the L.A. Zoo filming a M.O.W. (movie of the week) For NBC. He is a graduate of Columbine High School, Littleton, Colo. Mr. Willmirth also attended the University of Colorado at Denver, where he majored in electronic music and sound recording.</p>\n\n<p>He joined the military and completed the Army Counter-Intelligence agent assistant program and later graduated from the Counter-Intelligence Agent School where he earned his badge and credentials as a Special Agent. He served at the 4th INF. DIV. G2-CI, Fort Carson, Colo. While in service, he also graduated from the Air Force Indicators and Warnings Course. He held a Top-Secret special compartmentalized information (SCI) clearance. Mr. Willmirth earned a Distinguished Service medal for his dedicated work from the Army/DOD.</p>\n\n<p>Although a writer most of his life, his first success was a screenplay titled, Sleeper Cell which was optioned by Film Dallas. He wrote the speculation screenplay, Pirates of the Caribbean for Disney. He left the entertainment industry for several years and created some very successful businesses including an industrial chemical line, Mainline Technologies. Mainline serviced large companies and military bases throughout Arizona. Mr. Willmirth also created a small chain of bagel and coffee shops.\nFour years ago, Mr. Willmirth continued to pursue what God put him on this earth to do, writing screenplays and producing. He was paid to write for two years. In that time he wrote 4 screenplays, Against all Enemies, The Violence in Small Things, Below the Veil and Fernando’s Sand.</p>\n\n<p>Just over a year ago, Mr. Willmirth teamed up with Internationally Best Selling Author, Marc Fisher. They created Turning Point Pictures. TPP has approximately 40 film/television projects in various stages development. Recently, Mr. Willmirth and Mr. Fisher have opened offices at Sunset Gower (Columbia Pictures) Studios. Mr. Willmirth has written 11 screenplays/teleplays in his lifetime and just signed a producing deal with EMO Films. He has script doctored several projects including the film Outrage, starring Michael Madsen and Natasha Lyonne. Mr. Willmirth has worked in film finance including setting up gap financing for the film, Cadillac Records.</p>\n\n<p>Mr. Willmirth is also setting up the M. Willmirth Foundation, along with Dr. Martin Fusi, Professor of Film and T.V., to teach under privileged children the art of screenwriting and the craft of producing. He has also created the Empty Well Project to raise the awareness of the lack of water/dirty water crisis that kills 5 thousand children a day. With the support of Johnnie Maul, they hope to put an end to a problem that kills more human beings than war and disease combined. Mr. Willmirth is also a member in good standing of the All Cities Media Group.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}