{"first_name":"Melissa","last_name":"Breen","permalink":"melissa-breen","crunchbase_url":"http://www.crunchbase.com/person/melissa-breen","homepage_url":"http://www.smartfares.com","birthplace":"California","twitter_username":"smart_fares","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1964,"born_month":6,"born_day":5,"tag_list":"travel","alias_list":null,"created_at":"Thu Sep 27 14:56:41 UTC 2012","updated_at":"Fri Oct 19 21:31:27 UTC 2012","overview":"<p>Book A Discount Flight For Your Business trip AT SmartFares.com </p>\n\n<p>Some people have to fly out for a business trip at the last minute, making it hard to find a flight to the desired city, and a flight without several annoying connections. When you need to get somewhere fast for business, SmartFares.com is the online travel website for you. Smart Fares not only has the biggest selection of low-cost airfares all around the globe, on the most popular airlines, they also have outstanding customer service.</p>\n\n<p>SmartFares.com takes pride in providing value to their customers. Smart Fares works directly with the top airline companies all over the globe in order to get deeply discounted rates on flights. Smart Fares also works with travel wholesalers to add even more to their already large selection of available flights. These two practices is how Smart Fares is able to have one of the largest selection of airfares than any other website and brick-and-mortar travel agency in the world. Another way SmartFares.com increases their offerings is that they have the ability to post offers from multiple Global Distribution Systems, instead of just one. Most travel agencies only work from one Global Distribution System, limiting the number of flights available to their customers.</p>\n\n<p>In addition to having the largest selection of flights going to the hottest destinations all over the globe, Smart Fares provides unmatched customer service. In fact, the entire SmartFares.com company is built upon providing customers with a great online booking experience and outstanding customer service. No wonder people return to SmartFares.com over and over again to book their flights.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}