{"first_name":"Melissa","last_name":"Jordan Grey","permalink":"melissa-jordan-grey","crunchbase_url":"http://www.crunchbase.com/person/melissa-jordan-grey","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"NewBlue","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue May 04 19:10:07 UTC 2010","updated_at":"Mon Jul 18 17:48:11 UTC 2011","overview":"<p>Energetic, insightful and always original, Melissa Jordan Grey brings more than 23 years of experience as a seasoned creative technologist, serial entrepreneur and digital media artist. As Executive Chair/Chief Visionary Officer, and co-founder of digital video startup NewBlue, Inc., Grey assures that the company, known for its NewBlueFX line of desktop editing video effects, stays on the forefront and remains the fastest growing integrated video technology company in the market. It was her longtime vision of &#8220;video for everyone&#8221; that led to the creation of Vibop!, a video creation and social sharing app for mobile devices.</p>\n\n<p>Melissa&#8217;s passion for digital media began in the analog days of 8mm film and personal cassette recorders. As a child, she held an early fascination with communication technology. At age 9, she wrote her first radio show, at 12 created her first film and at 15 recorded her first record as a jazz saxophonist. After earning an undergraduate degree in media studies at Indiana University (Phi Beta Kappa, summa cum laude), she was one of 20 national recipients of the International Radio and Television Society Summer Fellowship in New York and went on to attend the University of Southern California&#8217;s master&#8217;s program in cinema-television.</p>\n\n<p>Her combined interests in music and television led her to co-found The Blue Ribbon SoundWorks, Ltd. at age 23. Blue Ribbon pioneered music, MIDI and audio technology, doubling in revenue and profit 5 years in a row. During Blue Ribbon&#8217;s 7 year life, Grey also composed the multimedia score for the City of Atlanta&#8217;s 1996 Olympic Bid. Bars&amp;Pipes multitrack MIDI sequencer, her debut software effort created with partner Todor Fay, broke ground in object-oriented user interface design and was followed by the successful release of 17 music software titles and 6 audio hardware products. Blue Ribbon&#8217;s AudioActive interactive music technology won Best of Comdex in 1995 and soon after, the company was acquired by Microsoft Corporation.</p>\n\n<p>At Microsoft, Grey served in a variety of leadership roles, including business development, strategic marketing and product design for digital media. Her group&#8217;s technology, the Interactive Music Architecture, found its way into Microsoft staples, including PowerPoint, MSN, Internet Explorer and ultimately Windows as part of the DirectX platform. Pushing the limits of interactive music at the time, she created Rifff, an online interactive music experience that featured musicians Paula Cole. BB King, Cindy Lauper and others. Before leaving Microsoft in 2000, Grey worked in its digital media division on prototypes to deliver personalized, convergence-oriented digital media experiences.</p>\n\n<p>For three years thereafter, Grey provided business and marketing consulting to Seattle area startups before co-founding NewBlue, Inc with Fay. When not dreaming of ways to monetize the merger of arts and technology, you&#8217;ll find her recording original music, driving her vintage Alfa Romeo and spending time on the beach with her husband and two sons.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder & Executive Chair","firm":{"name":"NewBlue","permalink":"newblue","type_of_entity":"company","image":{"available_sizes":[[[150,112],"assets/images/resized/0010/3914/103914v2-max-150x150.png"],[[250,186],"assets/images/resized/0010/3914/103914v2-max-250x250.png"],[[450,336],"assets/images/resized/0010/3914/103914v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}