{"first_name":"Melissa","last_name":"Whalley","permalink":"melissa-whalley-2","crunchbase_url":"http://www.crunchbase.com/person/melissa-whalley-2","homepage_url":"https://sites.google.com/site/americanshotz/","birthplace":"Windber, Pa","twitter_username":"melissawhalley","blog_url":"http://azbaruniversity.blogspot.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1989,"born_month":5,"born_day":3,"tag_list":"servsafe, alcohol, responsible-server-training, recognizing-signs-of-intoxication, know-the-correct-procedure-to-ask-for-id, minors, parties, underage-drinking, legal-responsiblity","alias_list":null,"created_at":"Sat Jun 05 14:50:55 UTC 2010","updated_at":"Tue Jun 08 20:47:55 UTC 2010","overview":"<p>Melissa provides responsible alcohol service education and training. </p>\n\n<p>Arizona Professional Education and Training Certificate Programs are recognized by the Arizona Department of Liquor Licenses and Control and our staff has been certified through the Servsafe Responsible Alcohol program. If your operation is issued a citation, participation in Arizona Professional Education and Training may result in a reduction in DLLC issued fines.</p>\n\n<p>Arizona Professional Education and Training program teaches the Servsafe Responsible Alcohol Service program.</p>\n\n<p>Arizona Professional Education and Training offers:</p>\n\n<p>National Restaurant Association ManageFirst Program:</p>\n\n<p>On-Line Proctor for Servsafe Alcohol class.</p>\n\n<p>On-Sale server Basic Training</p>\n\n<p>A Class for staff of on-sale licenses (restaurants, bars, clubs and hotels). This course covers current Arizona liquor law, liability concerns of licensed beverage servers, and procedures to deal with problem situations.</p>\n\n<p>Off-Sale Server Basic Training</p>\n\n<p>Designed for employees of off-sale licensed businesses (grocery, convenience and liquor stores). Laws specific to package liquor sales and skills focusing on recognition and refusal of illegal sales are emphasized.</p>\n\n<p>In-House Server Training</p>\n\n<p>At your convenience, one of our instructors conducts the Server Basic Training Program at your establishment exclusively for your staff. The Establishment must provide an on-site training atmosphere free of distractions. This class covers all the liquor law basics and any specific concerns related to your particular operation. Call to schedule a date and time.</p>\n\n<p>Concessions Program</p>\n\n<p>This program covers information pertinent to concession and special events. An emphasis on those laws necessary to safely and legally conduct business in specific, especially large setting - stadiums, concert halls, and licensed special ventures. This program also helps workers to effectively deal with problem situations.</p>\n\n<p>Off-Sale Train the Trainer program</p>\n\n<p>Available on a special contract basis, the Arizona Professional Education and Training educates and certifies professional trainers employed by off-sale liquor business, such as chain store. In accordance with DLLC rules, this program is available only to owners (licensees) of 20 or more licensed establishments. Upon satisfactory completion, trainers will be qualified to teach Arizona Professional Education and Training programs to other employees within their organization.</p>\n\n<p>Post Training Employee Observation</p>\n\n<p>Arizona Professional Education and Training conducts inspections at your establishment to determine if your employees are complying with state liquor laws and the policies of your business. These discreet &#8220;undercover&#8221; observations are performed by qualified Arizona Professional Education and Training Staff.</p>","image":{"available_sizes":[[[118,150],"assets/images/resized/0008/9620/89620v2-max-150x150.jpg"],[[198,250],"assets/images/resized/0008/9620/89620v2-max-250x250.jpg"],[[249,314],"assets/images/resized/0008/9620/89620v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}