{"first_name":"Melvin","last_name":"TEO Tian Sing, CFA CPA","permalink":"melvin-teo-tian-sing-cfa-cpa","crunchbase_url":"http://www.crunchbase.com/person/melvin-teo-tian-sing-cfa-cpa","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 14 11:20:40 UTC 2008","updated_at":"Sun Nov 16 18:33:27 UTC 2008","overview":"<p>Melvin Teo joined JAFCO Asia in 2002 and is currently Senior Director, Head of Operations. He is overall in charge of the operations of JAFCO Asia including the functions such as financial and tax accounting, planning and reporting relating to the fund and management company as well as corporate affairs and human resource matters of the JAFCO Asia.</p>\n\n<p>Prior to JAFCO Asia, he was senior manager with Arthur Andersen Singapore in the Assurance and Business Advisory Division. Melvin had 10 years of audit and financial consulting experience serving both listed and non-listed clients in a wide range of industries. Some of his clients include major investment banks, securities houses as well as fund management, venture capital, logistics, oil and gas, manufacturing and trading companies. He also had extensive experience involving IPO, internal audit and financial due diligence for merger and acquisition. One of the highlight of his career was his involvement in the financial review of 2 major banks in Korea and 10 joint-venture banks in Indonesia as part of the financial restructuring exercise required by the respective central banks in those countries under the ambit of the International Monetary Fund during the Asian Economic Crisis started in 1997.</p>\n\n<p>Melvin is a Singapore citizen. He earned his Bachelor of Accountancy (Hons) from the Nanyang Technological University in 1992. He is a Charterholder of the CFA Institute Chartered Financial Analysts designation (1999) as well as a Member of the Singapore Society Financial Analyst. He is a non-practicing member of the Institute Certified Public Accountant of Singapore. In 2001, he served as a Council Member of the Community Development Council for the Northeastern district of Singapore. </p>","image":{"available_sizes":[[[108,144],"assets/images/resized/0002/8681/28681v1-max-150x150.jpg"],[[108,144],"assets/images/resized/0002/8681/28681v1-max-250x250.jpg"],[[108,144],"assets/images/resized/0002/8681/28681v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Senior Director, Head (Operations)","firm":{"name":"JAFCO Asia","permalink":"jafco-asia","type_of_entity":"financial_org","image":{"available_sizes":[[[150,50],"assets/images/resized/0002/8530/28530v2-max-150x150.jpg"],[[229,77],"assets/images/resized/0002/8530/28530v2-max-250x250.jpg"],[[229,77],"assets/images/resized/0002/8530/28530v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}