{"first_name":"Mergim","last_name":"Riza","permalink":"mergim-riza","crunchbase_url":"http://www.crunchbase.com/person/mergim-riza","homepage_url":"http://www.mrautolist.com","birthplace":"Detriot, MI","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1971,"born_month":10,"born_day":10,"tag_list":"","alias_list":null,"created_at":"Wed May 30 22:17:06 UTC 2012","updated_at":"Fri Jun 08 02:30:10 UTC 2012","overview":"<p>Mergim Riza is a visionary, he sees&#8217; the future for what it can and will be.  He has created a site called MrAutoList.com with the intentions of creating millions of jobs and helping hard working Americans get a vehicle.  He believes that this one site can solve all of the problems that our economy is having.  </p>\n\n<p>MrAutoList.com is a membership based site, which allows us to purchase cars for them.  The benefit being, no interest and a low monthly (membership) payment of $200.  The benefit for dealerships across the country is, an untapped market, and never having to turn a buyer away again.  Members will pay their dues, we will also charge dealerships, Insurance agents, and others a monthly fee to advertise there products.  </p>\n\n<p>For example:  With funding of 2 million dollars, we will advertise our site on TV and radio ads.  Members will pay a yearly registration fee of $500, within two weeks of registering we will email them a confirmation number with a dealership and insurance agent to contact.  They will proceed to the dealership where they will pick out a new or used vehicle up to $15,000.  Two weeks after they will have there first membership fee and every month after thatfor six years.  For every 100 members we send to a dealership MrAutoList.com will payoff 5 cars per month per dealership\n.    </p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0019/3203/193203v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0019/3203/193203v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0019/3203/193203v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}