{"first_name":"Merrick","last_name":"Okamoto","permalink":"merrick-okamoto","crunchbase_url":"http://www.crunchbase.com/person/merrick-okamoto","homepage_url":"","birthplace":"Ukiah CA","twitter_username":"mokamoto","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1960,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue May 01 16:42:44 UTC 2012","updated_at":"Wed May 09 09:18:01 UTC 2012","overview":"<p>Founder/President Viking Asset Management</p>\n\n<p>Mr. Okamoto is the President of Viking and has been employed in the securities industry since 1983. Mr. Okamoto performs due diligence and research of potential investments for the Longview Funds, and he is responsible for all Viking trading operations.\nMr. Okamoto is widely recognized as an advanced trader and specialist in micro-cap and small-cap publicly traded stocks. He has been a frequent speaker at national trading venues: from 1987 to 1990, he hosted the television program, “The Income Report;” and has appeared on CNN and The MacNeil-Lehrer Report. \nBefore co-founding Viking in 2001, Mr. Okamoto co-founded and was the President of TradePortal.com, Inc. and TradePortal Securities in 1999. TradePortal Securities was a direct access execution brokerage firm which, along with its Trade Matrix™ software platform was sold toThompson Reuters Financial.  Prior to 1999, he held executive  positions at Lehman Brothers, Prudential Securities and Paine Webber. \nMr. Okamoto serves on the board of directors of publicly traded Optex Systems Inc (OPXS:OTCBB).\nMr. Okamoto is an investor in publicly traded MEDL Mobile Inc (MEDL:OTCBB), a rapidly grow App development company.</p>","image":{"available_sizes":[[[150,132],"assets/images/resized/0018/7425/187425v2-max-150x150.jpg"],[[250,221],"assets/images/resized/0018/7425/187425v2-max-250x250.jpg"],[[357,316],"assets/images/resized/0018/7425/187425v2-max-450x450.jpg"]],"attribution":"<p>Merrick Okamoto</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}