{"first_name":"Michael","last_name":"Paull","permalink":"michael-paull","crunchbase_url":"http://www.crunchbase.com/person/michael-paull","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 14 03:33:39 UTC 2009","updated_at":"Tue Jan 03 10:17:15 UTC 2012","overview":"<p>Michael Paull is the Executive Vice President of Global Digital Business for Sony Music Entertainment, Michael Paull oversees the development of the company&#8217;s digital business worldwide. He is responsible for working with the senior executive team in designing and implementing Sony Music&#8217;s\nglobal digital strategy, and is tasked with identifying and developing new and innovative digital products, business initiatives and models with both existing and new business partners. This includes managing global relationships with key business partners including Apple, Amazon, Google/YouTube, Vevo, Verizon, Vodafone, Nokia and Spotify.</p>\n\n<p>Prior to joining Sony Music in 2008, Mr. Paull served as Senior Vice President of Corporate Development and Strategy for the Fox Mobile Entertainment division of Fox Entertainment Group.</p>\n\n<p>From 2003 to 2007 Mr. Paull worked as an executive for Sony Pictures Entertainment, rising to Senior Vice President,\nDigital Services and Distribution.</p>\n\n<p>Prior to that Mr. Paull held executive positions at Time Warner and Artisan Entertainment. He spent his early career as a consultant at Boston Consulting Group and Price Waterhouse.</p>\n\n<p>Mr. Paull holds a master&#8217;s degree in business administration from the Harvard Business School.</p>","image":{"available_sizes":[[[117,150],"assets/images/resized/0003/3766/33766v1-max-150x150.jpg"],[[125,159],"assets/images/resized/0003/3766/33766v1-max-250x250.jpg"],[[125,159],"assets/images/resized/0003/3766/33766v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}