{"first_name":"Michael","last_name":"L. DeRosa","permalink":"michael-l-derosa","crunchbase_url":"http://www.crunchbase.com/person/michael-l-derosa","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 04 11:46:22 UTC 2009","updated_at":"Thu Jun 04 11:56:18 UTC 2009","overview":"<p>Michael has been investing in venture capital and private equity transactions in clean technology for over ten years. His primary sectors of focus include renewable and alternative energy, energy technology, biofuels, materials and chemicals, green building materials and recycling technology. From a strategic perspective, Michael focuses on working with established companies that are developing new products or business models designed to capitalize on emerging market needs for cost effective and sustainable solutions.</p>\n\n<p>Prior to Element, Michael was a partner in Cordova Ventures’ Industrial Technology Fund. At Cordova, Michael worked on all aspects of fund operations and served on the Fund’s investment committee. Prior to Cordova, Michael was a principal at EnerTech Capital Partners and a Senior Associate at the Safeguard International Fund. While at Safeguard, Michael was involved in the firm’s initial investment in REC, a Norwegian solar power company. Before starting his private equity career, Michael was a management consultant at Booz-Allen &amp; Hamilton focusing on the aerospace, building controls, and consumer products industries. Michael has also worked in the finance area at Ford Motor Company and in operations management at Weirton Steel.</p>\n\n<p>Michael holds a Bachelor’s degree in Electrical Engineering from Georgia Tech where he graduated first in his class. Michael received a Masters of Business Administration degree from the Wharton School of the University of Pennsylvania where he graduated as a Palmer Scholar (Top 5%).</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0004/6664/46664v1-max-150x150.jpg"],[[233,144],"assets/images/resized/0004/6664/46664v1-max-250x250.jpg"],[[233,144],"assets/images/resized/0004/6664/46664v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor’s degree","subject":"Electrical Engineering","institution":"Georgia Tech","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Element Partners","permalink":"element-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,36],"assets/images/resized/0004/6656/46656v1-max-150x150.jpg"],[[214,52],"assets/images/resized/0004/6656/46656v1-max-250x250.jpg"],[[214,52],"assets/images/resized/0004/6656/46656v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}