{"first_name":"Michael","last_name":"Ruley","permalink":"michael-ruley","crunchbase_url":"http://www.crunchbase.com/person/michael-ruley","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Aug 12 04:24:45 UTC 2011","updated_at":"Fri Aug 12 04:26:24 UTC 2011","overview":"<p>Mike Ruley brings an impressive record of leadership, experience and accomplishment in telecom, data access and managed services to his role as Airband CEO. Prior to the merger with Airband and Sparkplug, Ruley was the CEO of Sparkplug, a fixed-wireless service provider that offered services across five states, including the metropolitan areas of Chicago, Nashville, Des Moines, Phoenix and Las Vegas. Prior to Sparkplug, Ruley served as the CEO of Hawaiian Telecom, an independent telecommunications company based in Honolulu, Hawaii, that provides wireline, wireless, long distance, data, managed services and yellow pages to all of the major Hawaiian Islands.  Ruley’s in-depth industry experience includes: CEO of NextiraOne, a North American voice and data solutions business with about 3,500 employees; senior positions at XO Communications, including President of Market Sales where he managed about 1,500 people in sales, support, customer care and the indirect channel organizations that delivered nearly $1 billion in annual revenue; executive roles at Teleport Communications Group, a competitive local exchange carrier (CLEC) that is now part of AT&amp;T. Ruley currently serves on the boards of Tissue Genesis, Inc. and Allied Bioscience Services.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Airband Communications Holdings","permalink":"airband-communications-holdings","type_of_entity":"company","image":{"available_sizes":[[[150,76],"assets/images/resized/0003/4152/34152v2-max-150x150.png"],[[197,100],"assets/images/resized/0003/4152/34152v2-max-250x250.png"],[[197,100],"assets/images/resized/0003/4152/34152v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}