{"first_name":"Michael S","last_name":"Almony","permalink":"michael-s-almony","crunchbase_url":"http://www.crunchbase.com/person/michael-s-almony","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1983,"born_month":4,"born_day":11,"tag_list":"","alias_list":null,"created_at":"Tue Aug 14 14:31:48 UTC 2012","updated_at":"Fri Aug 17 14:48:47 UTC 2012","overview":"<p>Michael S Almony – Environmental Activist</p>\n\n<p>Like most Americans, Michael S Almony is incredibly concerned about the environment. The California resident believes that global warming is a fact, not a theory. “If you don’t believe that CO2 affects the atmosphere,” he says. “Then you’re simply an idiot.”</p>\n\n<p>As an active environmentalist, Mike Almony regularly volunteers time to help his natural community. In fact, he can regularly be spotted picking up trash along Los Angelas’ highways on the weekends. Unlike a lot of people who clean trash off our nation’s freeways, Almony does this out of the kindness of his heart. However, it should be noted that Almony’s environmental efforts hardly stop at cleaning highways.</p>\n\n<p>In addition to his volunteer work for the California Department of Highways, Almony is also an activist coordinator. The California resident has his own blog on which he discusses topical environmental events on a regular basis. Over the years, he has gathered an impressive following of like-minded people. This following has proven incredibly useful, as Almony also organizes petitions which require hundreds of signatures.</p>\n\n<p>As social media sites become more and more popular, these online petitions grow in power each day. Online petitions allow activists to connect with people of similar philosophies. Whereas these people may not be that powerful apart, social networks give great volume to their voices as a whole.</p>\n\n<p>Many of Michael S Almony’s petitions attempt to create restrictions on the drilling rights of oil companies. More specifically, Almony is an adamant opponent of fracking, a process which may leading scientists consider to be highly dangerous. A significant amount of evidence suggests that fracking may contaminate drinking water. There is also evidence linking fracking to unnatural seismic activity. </p>\n\n<p>While many people like to complain about the world’s problems, Michael S Almony takes action. His long history of environmental activism serves as an inspiration to all Earth-conscious individuals. </p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/5993/205993v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/5993/205993v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/5993/205993v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}