{"first_name":"Michael","last_name":"Terpin","permalink":"michael-terpin","crunchbase_url":"http://www.crunchbase.com/person/michael-terpin","homepage_url":"","birthplace":"","twitter_username":"michaelterpin","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Oct 06 19:10:44 UTC 2011","updated_at":"Thu Oct 27 17:57:41 UTC 2011","overview":"<p>Michael Terpin has operated a leading high-tech PR and online marketing firm since 1990. During the &#8220;first Internet boom&#8221; he and his team launched such brands as the America Online Greenhouse, EarthLink, the Motley Fool and Jupiter Communications. Today, they represent a variety of Web 2.0, consumer electronics/videogame, wireless and IT companies, including Augmentum, BitGravity, CyberDefender, Entropia Universe, MyPublicInfo, the Red Herring and Xandros.</p>\n\n<p>In 1999, Michael spun off our newswire division, Internet Wire, as a standalone company and raised more than $25 million from top-tier investors including Hummer Winblad and Sequoia Capital. Following a strategic investment by NASDAQ in 2003, the company changed its name to Market Wire and was sold to CCN/Matthews in April 2006, which in turn was sold to OMERS Capital Partners in December, 2006, for more than $100 million. Marketwire (www.marketwire.com) is currently the world&#8217;s third largest public relations/investor relations newswire.</p>\n\n<p>Michael&#8217;s latest venture is Social Radius (www.socialradius.com), a social media marketing firm specializing in social media outreach, social media content creation and socially-based traffic building, lead generation and search optimization. Their  client roster includes Bombay Sapphire, Constant Contact, David Lynch Foundation, Dazzboard, Denihan Hospitality Group, Digital Media Wire, Mogreet, Philips, Power.com, Rallycast, Red Herring, SproutBaby, TuneWiki and VenueGen.</p>\n\n<p>One of our biggest successes was the launch and viral seeding of the &#8220;Yes We Can&#8221; video by Black-Eyed Peas lead singer Will.i.am in support of the Obama campaign (www.yeswecansong.com). This campaign garnered more than 40 million views of the full video, as well as traditional media coverage of more than one billion impressions, including six articles in the New York Times and prominent interviews on The Today Show, CNN, CNBC and other leading media outlets worldwide. The effort won both an Emmy and a Webby.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0015/7083/157083v2-max-150x150.jpg"],[[200,200],"assets/images/resized/0015/7083/157083v2-max-250x250.jpg"],[[200,200],"assets/images/resized/0015/7083/157083v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.entrepreneur.com/article/217353","title":"How Do You Make Something Go Viral?"}],"web_presences":[]}