{"first_name":"Michael","last_name":"Behzadi","permalink":"michael-behzadi","crunchbase_url":"http://www.crunchbase.com/person/michael-behzadi","homepage_url":"","birthplace":"","twitter_username":"MichaelBehzadi","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1976,"born_month":6,"born_day":19,"tag_list":"","alias_list":null,"created_at":"Fri Aug 24 11:55:11 UTC 2012","updated_at":"Thu Aug 30 19:49:26 UTC 2012","overview":"<p>Michael Behzadi \nMichael Behzadi is a professional day trader with over twenty years of stock market experience. He met great financial success in the market and could retire if he so desired. He remains involved in the market though. The inflow of money enables him to stay involved in his hobbies, and the experience is vital for his seminars.</p>\n\n<p>When he isn’t focusing on his stock portfolio, Michael Behzadi often gives lectures and lessons on how to trade in the market effectively. He is a highly respected trader, and his opinion and advice is heeded by most stock market professionals. He has delivered speeches to sold-out theaters, and crowded business auditoriums. He is one of the industry’s most enthusiastic traders, netting large profits for himself as well as his clients.</p>\n\n<p>But not all of his time is spent on the market; often Michael Behzadi has his head in the clouds. He has logged several hundred hours on hang-gliders. He cherishes his hobby, and uses his funds to enhance the sport every year. He has personally financed studies on the materials used to make gliders. He was also a test subject in the studies, and his efforts resulted in revised glider composition. He is now the proud owner of a specialized glider that is much lighter and more aerodynamic. He enjoys longer and smoother flights with his unique equipment.</p>\n\n<p>Behzadi is in the process of plotting a record breaking flight. The journey will have him navigate the northern most border of Oklahoma. Part way through the flight, Michael Behzadi’s pilot will ‘catch’ him in the air, and restore him to a higher altitude in order to complete the trip. He is bringing a bagged lunch for the several-hour endeavor.</p>\n\n<p>Michael Behzadi, day-trader, and hang-gliding enthusiast is a man of many talents. He has explored a career in counseling and is proficient in many instruments, including the piano, violin and accordion.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/7951/207951v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/7951/207951v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/7951/207951v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}