{"first_name":"Michael","last_name":"Perlis","permalink":"michael-perlis","crunchbase_url":"http://www.crunchbase.com/person/michael-perlis","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"SoftBank Capital","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 01 13:02:17 UTC 2007","updated_at":"Tue Oct 16 05:34:59 UTC 2012","overview":"<p>Mike Perlis is a media industry CEO with over 25 years experience managing a wide range of content and multimedia brands. He joined Forbes from SoftBank Capital, where he served as a General Partner. </p>\n\n<p>Mr. Michael S. Perlis, Mike has been the President and Chief Executive Officer of Forbes Media LLC since December 1, 2010.</p>\n\n<p>Mr. Perlis joined SoftBank Capital in 2000 from SoftBank&#8217;s former subsidiary, Ziff-Davis. He has served as a media industry CEO with over 20 years experience managing a wide range of content and multi-media brands. Until its sale in 2000, Mr. Perlis was President and CEO of Ziff-Davis Publishing. He was responsible for the management of these pre-eminent technology publishing properties and related products worldwide. Mr. Perlis dramatically repositioned the core Ziff-Davis brands from a PC focus to an Internet-centric position.</p>\n\n<p>Before joining Ziff-Davis, Mr. Perlis was President at TVSM from 1996 to 1998, the largest publisher of customized television listings and guidance in print and on-line. He directed all strategy and operations, culminating in the sale of the company to NewsCorp.</p>\n\n<p>From 1989 to 1994, Mr. Perlis was the President of the Playboy Publishing Group, overseeing all publishing and related product activity worldwide. The Playboy brand was actively exported overseas during these years, resulting in operations in 17 countries. He also was responsible for the launch of the Playboy new media initiative (playboy.com) and managed the company’s direct marketing businesses.</p>\n\n<p>Mr. Perlis was previously the President and CEO of IDG Peterborough, publisher of Gentlemen&#8217;s Quarterly and built the Rodale Active Sports Network (including the founding of Men&#8217;s Health &amp; Women&#8217;s Health, and the acquisition of Runner&#8217;s World). He began his career in media as the co-fo under of New England Publications in Camden, Maine.</p>\n\n<p>Mr. Perlis serves on the boards of several companies, including The Huffington Post, Paltalk, and Associated Content. Mr. Perlis served on the boards of Enpocket (sold to Nokia), Industry Brains (sold to Marchex), Zinio (sold to Gilvest) and World Publications (sold to Bonnier). All transactions took place in 2006-2007. Mr. Perlis is highly respected as an organizational and marketing professional and is a regular speaker at media and related industry gatherings.</p>\n\n<p>Mr. Perlis is a graduate of Syracuse University. He also serves on the board of the Newhouse School of Public Communications and is a trustee of Outward Bound.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0001/8184/18184v8-max-150x150.jpg"],[[166,250],"assets/images/resized/0001/8184/18184v8-max-250x250.jpg"],[[299,450],"assets/images/resized/0001/8184/18184v8-max-450x450.jpg"]],"attribution":"<p>Forbes Media</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Special Partner","firm":{"name":"SoftBank Capital","permalink":"softbank-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,36],"assets/images/resized/0000/3955/3955v3-max-150x150.png"],[[250,60],"assets/images/resized/0000/3955/3955v3-max-250x250.png"],[[358,86],"assets/images/resized/0000/3955/3955v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}