{"first_name":"michael","last_name":"chill","permalink":"michael-chill","crunchbase_url":"http://www.crunchbase.com/person/michael-chill","homepage_url":"http://www.tradove.com","birthplace":"China","twitter_username":"","blog_url":"http://www.tradove.com/industries.jsp","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1981,"born_month":1,"born_day":17,"tag_list":"b2b-search-engine","alias_list":null,"created_at":"Wed May 11 08:21:48 UTC 2011","updated_at":"Fri May 13 14:28:35 UTC 2011","overview":"<p>TraDove, an abbreviation of Trade Dove, suggests a dove (or pigeon) bird that transmits trade information. We aim to solve a major business trade problem ignored by major search engines and B2B platforms. That is, help corporate buyers and sellers, large and small, to better find and connect with each other, and to facilitate trading between and among them. And that is our slogan: Find, Connect, and Trade. We are building one of the largest dedicated search engines designed to help corporate buyers find suppliers for the products and services they need. Our networks span both local and global markets. We also help corporate sellers find target buyers for the products and services they supply. With this search engine and platform, we accelerate connect- ions between company buyers and sellers and facilitate trading among them.\nPrincipal users of this free search engine service will be corporate procurement and supply chain personnel in particular&#8211;or any employees who buy products and services for the company. When the employee needs to find a supplier, he inputs a product or service name into our search engine.  We display a precisely ranked product or service supplier list. This list can be local, by country, or by industry. Those product or service suppliers who want extra attention can bid for the sponsored links on the right, top and bottom of our displayed page, just like advertisers bid for general  search engine space.\n Our searched results differ from those provided by general search engines. We block out  irrelevant information like news and encyclopedia descriptions. We drill down to provide direct product and service provider web site information. Potential corporate buyers will not need to spend tens of minutes of time digging out supplier information. They can find local, domestic or international suppliers quickly and precisely. Because our traffic is more intentional and business buying oriented, advertisers who are product and service suppliers are willing to spend more money to bid on the sponsored links. \nWe are different from directory based and semi-automatic B2B sites like Alibaba.com: -we don’t just target mid to small companies, but companies of all sizes in the world. There is  no result-irrelevant annual membership fee. Advertising suppliers pay by visiting clicks, thus results based. We are automatic and thus more scalable. Check us out at www.tradove.comor www.tradove.com/industries.jsp.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}