{"first_name":"Michael","last_name":"Bohdjalian","permalink":"michael-bohdjalian-2","crunchbase_url":"http://www.crunchbase.com/person/michael-bohdjalian-2","homepage_url":"http://www.michaelbohdjalian.co.uk/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Bohdjalian Asset Management Ltd","born_year":1983,"born_month":null,"born_day":null,"tag_list":"michael-bohdjalian, london, coloured-diamonds, investments","alias_list":null,"created_at":"Sun Oct 07 09:59:31 UTC 2012","updated_at":"Mon Oct 29 01:06:37 UTC 2012","overview":"<p>British born Michael Bohdjalian started his career off as an equity broker after graduating from Warwick Univeristy in Coventry in 2005. His chosen field of study being Economics and Politics came in handy when he started working as a broker where he got experience with raising funds for companies active in the AIM market. Rarity and growth potential was Michael’s most pertinent area of focus and he concentrated his attention on small to medium companies demonstrating substantial prospects of fiscal expansion. His interest in and flair for fundraising for financial resource investments as well as his ability to make quick gains in this area prompted him to eventually venture into entrepreneurship. \nIn 2009 Michael Bohdjalian started consulting in his aptly named business Bodjalian Asset Management Ltd. In this endeavour, Michael discovered his capacity for realising the possible gains of budding investments for clients. He noticed that he was not only talented at gathering the means to realise investments, but also to recognise prospectively lucrative outlays. With an aptitude for investments and a flair for following through, Michael again started focusing on rarity and growth potential and the trade area of precious gemstones perked his interest. Precious stones are exactly that; precious, and although trading in rubies, sapphires and emeralds can be a valuable way to earn money, diamonds have always been the proverbial girl’s best friend, and in this case, the trader’s best friend also. Michael became fascinated with the diamond trade and started researching the field. \nWith his highly acute propensity towards sound investments Michael did not limit himself to diamonds alone. He made a very important discovery when he found that one of the rarest and most precious commodities in the world is coloured diamonds. As with any other product that has an increasing demand and declining availability, coloured diamonds are of unparalleled investment value. During his research, Michael soon discovered that yellow, orange and brown diamonds are the entry point at which investors usually initialise their collections. He also discovered that blue, green, pink and especially red diamonds are even more prized. These stones are so rare, only one in approximately ten thousand diamonds are coloured naturally. Armed with this knowledge and a passion for the industry, Michael sources buyers and sellers alike and offers his services as expert advisor and also as purveyor of authenticity. \nAs it is possible to artificially create these treasured stones, it is of utmost importance to ensure the stones are bona fide naturally coloured diamonds. For this reason it is imperative to have expert assistance which is precisely what Michael Bohdjalian provides for a nominal fee. The rarest coloured diamonds are seldom for sale and it takes somebody, such as Michael, who is in the thick of the market to source potential transactions. Michael also finds genuine buyers or facilitates auctions. The rarity of the stones translates to the rarity of true experts in the field and this is where Michael found his forte when trading with these rare commodities became his focal point and his area of expertise.</p>","image":null,"degrees":[{"degree_type":"B.Sc.","subject":"Economics and Politics","institution":"warwick university","graduated_year":2005,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Director","firm":{"name":"Bohdjalian Asset Management Ltd","permalink":"bohdjalian-asset-management-ltd","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.michaelbohdjalian.org","title":"Michael Bohdjalian - Independent Coloured Diamonds Consultant "}],"web_presences":[]}