{"first_name":"Michael","last_name":"Chin","permalink":"michael-chin","crunchbase_url":"http://www.crunchbase.com/person/michael-chin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"SocialFlow","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Mar 14 07:36:34 UTC 2008","updated_at":"Wed Oct 10 13:14:26 UTC 2012","overview":"<p>Michael Chin is the VP of Business Development at SocialFlow. Previously the VP of Marketing, Michael helped to build SocialFlow as an industry leader in social media optimization. He was particularly instrumental in establishing the company as the optimization solution for the social media efforts of major news organizations and Fortune 100 brands.</p>\n\n<p>Before joining SocialFlow, Michael was SVP, Marketing at KickApps, a leading social media platform. Additionally, he worked on a variety of brands in online media and entertainment while at at Deep Focus, a leading agency that delivers online engagement, and also with Bite Communications, a global communications consultancy that serves blue chip companies and emerging start-up brands. Prior to that, Michael was Founder/Director of Marketing at StormPlay Entertainment Systems and an Account Manager at Niehaus Ryan Wong.</p>\n\n<p>Michael is considered a leading authority in social media marketing and is a frequent speaker at conferences such as CES, Digital Hollywood, CMO Summit, The Digital Media Conference, DPAC II, Digiday and Ragtime UK. He has guest lectured on social media and interactive marketing at Columbia University, Baruch College and Bentley University’s MBA program.</p>\n\n<p>Michael has worked with numerous well-known brands throughout his career, including Calvin Klein, WeightWatchers, Hearst, Sony Television, Harpo, AMC, Virgin, BEA Systems, VERITAS Software, Become.com, Creative Labs and Netscape.</p>\n\n<p>Michael has a B.A. in Politics with certificates in Legal Studies and Peace &amp; Justice Studies from the University of San Francisco. </p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0001/5754/15754v1-max-150x150.jpg"],[[125,167],"assets/images/resized/0001/5754/15754v1-max-250x250.jpg"],[[125,167],"assets/images/resized/0001/5754/15754v1-max-450x450.jpg"]],"attribution":"<p>http://www.kickapps.com/about-us/people.html</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"VP, Marketing","firm":{"name":"SocialFlow","permalink":"socialflow","type_of_entity":"company","image":{"available_sizes":[[[150,51],"assets/images/resized/0009/0174/90174v2-max-150x150.png"],[[250,86],"assets/images/resized/0009/0174/90174v2-max-250x250.png"],[[450,155],"assets/images/resized/0009/0174/90174v2-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"SVP, Marketing","firm":{"name":"KickApps","permalink":"kickapps","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}