{"first_name":"Michael","last_name":"Hunkapiller","permalink":"michael-hunkapiller","crunchbase_url":"http://www.crunchbase.com/person/michael-hunkapiller","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Alloy Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Aug 04 13:33:02 UTC 2007","updated_at":"Thu Mar 26 20:38:43 UTC 2009","overview":"<p>Michael Hunkapiller joined Alloy in 2004 after 30-year career in bioscience research and executive management in the life science industry. He focuses on investments in life science research tools and instrumentation, as well as clinical diagnostics.</p>\n\n<p>Operating experience\nA renowned scientist, entrepreneur and life science industry executive, Mike brings a unique mix of experience to Alloy. He spent 21 years at Applied Biosystems (NASDAQ: LIFE), which he co-founded and helped grow from startup to almost $2 billion in annual revenues supplying instrument and reagent systems for life science research. At ABI, he held several positions, most recently president and general manager. He was also a founder of ABI&#8217;s sister company Celera Genomics (NASDAQ: CRA) and senior vice president of Applera Corp. (their parent company). Prior to joining ABI, Mike was a senior research fellow in the Division of Biology at the California Institute of Technology. He has authored more than 100 scientific publications, is an inventor on more than two dozen patents and has served on the editorial boards of several scientific journals. He has received several awards for his contributions to life science research, especially for his invention of the automated Gene and Protein Sequencer used to sequence the human genome. He was recently elected to the National Academy of Engineering for his life-long dedication to the human genome mapping project and the field of comparative genetics. He received a B.S. in Chemistry from Oklahoma Baptist University in 1970 and a Ph.D. in Chemical Biology from the Division of Chemistry and Chemical Engineering at Caltech in 1974.</p>\n\n<p>Current board seats\nMike serves on the board of directors of Codon Devices, Fluidigm, Pacific Biosciences, NuGEN, Artemis Health, and Raindance Technologies. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Alloy Ventures","permalink":"alloy-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[113,53],"assets/images/resized/0000/3916/3916v1-max-150x150.png"],[[113,53],"assets/images/resized/0000/3916/3916v1-max-250x250.png"],[[113,53],"assets/images/resized/0000/3916/3916v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}