{"first_name":"Michael","last_name":"Rosenberg","permalink":"michael-rosenberg-2","crunchbase_url":"http://www.crunchbase.com/person/michael-rosenberg-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Future Ads","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 19 19:45:39 UTC 2012","updated_at":"Tue Jul 10 08:26:54 UTC 2012","overview":"<p>As COO of Future Ads for the past 4 years, Michael is responsible for the company’s daily operating activities, including Sales, Customer Service, Account Management and Business Development. He works to ensure that clients, partners and employees are delighted with their Future Ads experience. A veteran of online marketing, business development and e-commerce since 1999, he previously worked at several online trailblazers, including as a Vice President of America Online, Senior Vice President at Autobytel Inc., and Chief Marketing Officer at LeadPoint. Pre-Web, he functioned as an offline marketing expert, working at Procter &amp; Gamble, Bain &amp; Company and H.J. Heinz. He has been a critical force in Future Ads’ transformation from small start-up to a large enterprise, and never stops working to drive more traffic and revenue to the company’s ever-expanding properties. He graduated Cum Laude from Montreal’s McGill University and lives in Laguna Beach CA with his family.</p>\n\n<p>A Canadian, he loves ice hockey (but not curling). He also enjoys surfing, attempting to learn guitar, and driving his kids to sporting events.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"COO","firm":{"name":"Future Ads","permalink":"future-ads","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0011/0205/110205v8-max-150x150.png"],[[180,180],"assets/images/resized/0011/0205/110205v8-max-250x250.png"],[[180,180],"assets/images/resized/0011/0205/110205v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}