{"first_name":"Michael","last_name":"Montemarano","permalink":"michael-montemarano","crunchbase_url":"http://www.crunchbase.com/person/michael-montemarano","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Aug 15 08:52:03 UTC 2011","updated_at":"Mon Aug 15 08:56:06 UTC 2011","overview":"<p>With more than twenty years of executive financial management experience in the telecommunications sector, Michael Montemarano serves as chief financial officer for LightSquared. He is responsible for the company’s daily financial operations including accounting, tax, cash management and treasury. He also oversees the development and implementation of budgeting, forecasting, and the financial controls process. He leads the diligence and negotiations for strategic investors, vendor financing, and debt raising and is responsible for the company’s investor relations activity.\nPreviously, Mr. Montemarano most recently served as chief financial officer for Advantedge Healthcare Solutions and for Simpler Networks. Before joining Simpler Networks, Mr. Montemarano held a number of senior financial positions at Lucent Technologies/AT&amp;T and Avaya. As vice president of finance, he played a leading role in Lucent Technologies&#8217; IPO and the Avaya spin-off and led a global team of over 250 employees in North America, Europe, South America and Asia. He also oversaw the financial operations of an $8 billion division that became Avaya, implemented operating enhancements, and led special teams to integrate major acquisitions. Mr. Montemarano was senior vice president and controller for Cendant&#8217;s $3 billion Hospitality Division and served as CFO of global customer operations at Dun &amp; Bradstreet. He is a CPA and holds an MBA in Finance from Fairleigh Dickinson University in Madison, New Jersey.</p>","image":{"available_sizes":[[[117,150],"assets/images/resized/0014/9487/149487v1-max-150x150.jpg"],[[150,191],"assets/images/resized/0014/9487/149487v1-max-250x250.jpg"],[[150,191],"assets/images/resized/0014/9487/149487v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"Finance","institution":"Fairleigh Dickinson University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Chief Financial Officer","firm":{"name":"LightSquared","permalink":"lightsquared","type_of_entity":"company","image":{"available_sizes":[[[150,26],"assets/images/resized/0012/6125/126125v2-max-150x150.jpg"],[[250,44],"assets/images/resized/0012/6125/126125v2-max-250x250.jpg"],[[362,65],"assets/images/resized/0012/6125/126125v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}