{"first_name":"Michael","last_name":"Bloomberg","permalink":"michael-bloomberg","crunchbase_url":"http://www.crunchbase.com/person/michael-bloomberg","homepage_url":"http://mikebloomberg.com","birthplace":"","twitter_username":"MikeBloomberg","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":"mike bloomberg","created_at":"Thu Jul 10 18:36:26 UTC 2008","updated_at":"Thu Dec 01 18:27:22 UTC 2011","overview":"<p>Michael R. Bloomberg is the 108th Mayor of the City of New York. He was first elected in November 2001, two months after the terrorist attacks on 9/11.</p>\n\n<p>Born on February 14, 1942 in Boston and raised in a middle class home in Medford, Massachusetts, Michael Bloomberg attended Johns Hopkins University, where he paid his tuition by taking loans and working as a parking lot attendant. After college, he went on to receive an MBA from Harvard Business School. </p>\n\n<p>In 1966, he was hired by a Wall Street firm, Salomon Brothers, for an entry-level job. He quickly rose through the ranks at Salomon, overseeing equity trading and sales before heading up the firm’s information systems. When Salomon was acquired in 1981, he was let go from the firm. With a vision of an information company that would use emerging technology to bring transparency and efficiency to the buyers and sellers of financial securities, he launched a small startup company called Bloomberg LP. Today, Bloomberg LP has over 300,000 subscribers to its financial news and information service in over 160 countries around the globe. Headquartered in New York City, the company has about 13,000 employees worldwide.</p>\n\n<p>Already deeply involved in civic affairs, he officially entered public life in 2001, when he entered the race for Mayor of the City of New York. After entering City Hall, Mayor Bloomberg won control of New York City&#8217;s broken public school system and turned it around by raising standards, promoting innovation, and holding schools accountable for success. He spurred economic growth and job creation by revitalizing old industrial areas and strengthening key industries, including new media, film and television, bio-science, technology, and higher education. The Mayor’s Five Borough Economic Opportunity Plan helped bring the City through the national recession as quickly as possible and helped avoid the level of job losses that many experts had forecast and that other cities experienced. He has also launched programs that encourage entrepreneurship, combat poverty, and help people acquire the skills they need to build careers.</p>\n\n<p>Mayor Bloomberg is the father of two daughters, Emma and Georgina.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0016/4264/164264v1-max-150x150.jpg"],[[180,180],"assets/images/resized/0016/4264/164264v1-max-250x250.jpg"],[[180,180],"assets/images/resized/0016/4264/164264v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Bloomberg","permalink":"bloomberg","type_of_entity":"company","image":{"available_sizes":[[[150,36],"assets/images/resized/0002/1883/21883v1-max-150x150.png"],[[171,42],"assets/images/resized/0002/1883/21883v1-max-250x250.png"],[[171,42],"assets/images/resized/0002/1883/21883v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.mikebloomberg.com","title":"MikeBloomberg.com"},{"external_url":"http://twitter.com/MikeBloomberg","title":"@MikeBloomberg"}],"web_presences":[]}