{"first_name":"Michael","last_name":"Vanderslice","permalink":"michael-vanderslice","crunchbase_url":"http://www.crunchbase.com/person/michael-vanderslice","homepage_url":"","birthplace":"Douglassville PA","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"MD Tech Pro","born_year":null,"born_month":null,"born_day":null,"tag_list":"managed-services, electronic-medical-record-software, emr, start-up","alias_list":null,"created_at":"Wed Jan 11 06:30:55 UTC 2012","updated_at":"Fri Jan 13 22:10:30 UTC 2012","overview":"<p>Michael Vanderslice has extensive experience in developing and growing national service and technology related companies. From 2001 through 2006, Mr. Vanderslice served as COO of Geeks On Call. Michael led the company from start-up through a very successful national expansion in the US. Mr. Vanderslice assisted in raising equity for Geeks On Calls national expansion through angel and VC funding. Geeks On Call provided on-site and remote support IT services for residential and business customers and was the most successful franchise offering IT services during that period. In December 2005 Entrepreneur Magazine named Geeks On Call the best new franchise concept of the prior 5 years. From 2006 through 2009 Mr. Vanderslice went on to provide consulting services to numerous service and technology organizations including Staples EasyTech, 1800GOTJUNK, Insight and numerous other start-up organizations. As of January 2010 Mr. Vanderslice is serving as CEO of MD Tech Pro, a healthcare IT services organization that provides managed IT services and electronic medical records software solutions for medical practices. MD Tech Pro is quickly expanding throughout the US with national expansion also planned.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"MD Tech Pro","permalink":"md-tech-pro","type_of_entity":"company","image":null}},{"is_past":true,"title":"CEO","firm":{"name":"BizElevate","permalink":"bizelevate","type_of_entity":"company","image":null}},{"is_past":true,"title":"COO","firm":{"name":"Geeks On Call","permalink":"geeks-on-call","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/mslice","title":""}]}