{"first_name":"Michael","last_name":"A. Rotgin","permalink":"michael-a-rotgin","crunchbase_url":"http://www.crunchbase.com/person/michael-a-rotgin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Nov 30 17:19:15 UTC 2008","updated_at":"Sun Nov 30 17:22:32 UTC 2008","overview":"<p>Prior to joining Shelter, Mr. Rotgin was a principal at Rolling Oaks Capital, a Southern California based private investment fund. Before joining Rolling Oaks, Mr. Rotgin practiced corporate law in New York and Washington, D.C. where he represented domestic and foreign companies involved in a broad array of industries in connection with public offerings and private placements of debt and equity securities, mergers and acquisitions, securities laws compliance, and general corporate counseling. Mr. Rotgin worked for several members of Congress, was a staff member to the United States Senate Committee on Banking, Housing and Urban Affairs and served as a team member of the economics cluster for a United States Presidential transition team.</p>\n\n<p>In his various capacities, Mr. Rotgin has assisted many developing and established companies in formulating and executing all types of business strategies in the areas of corporate operations, financial planning, executive recruitment, market development, corporate valuations, and securing funds.</p>\n\n<p>Mr. Rotgin has been an invited speaker and participant in venture capital industry symposia and has been a judge of the Wharton School of Business Annual Business Plan Competition.</p>\n\n<p>Mr. Rotgin received a Bachelor of Science in economics with a concentration in finance from the Wharton School of the University of Pennsylvania, a Bachelor of Arts in history from the College of Arts and Sciences of the University of Pennsylvania, and a Juris Doctor from Georgetown University Law Center. Mr. Rotgin has also completed post-graduate course work at the University of California, Los Angeles, in data network protocols and systems and network architecture.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Shelter Capital Partners","permalink":"shelter-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,55],"assets/images/resized/0003/0251/30251v1-max-150x150.jpg"],[[157,58],"assets/images/resized/0003/0251/30251v1-max-250x250.jpg"],[[157,58],"assets/images/resized/0003/0251/30251v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}