{"first_name":"Michael","last_name":"Jay Solomon","permalink":"michael-jay-solomon","crunchbase_url":"http://www.crunchbase.com/person/michael-jay-solomon","homepage_url":"http://www.michaeljaysolomon.com","birthplace":"","twitter_username":"mjaysolomon","blog_url":"","blog_feed_url":"","affiliation_name":"Truli Media Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"michael-jay-solomon, michael-solomon, truli-media-group, warner-brothers, top-10-hollywood-executives","alias_list":"","created_at":"Mon Apr 05 18:44:08 UTC 2010","updated_at":"Sat Aug 25 01:11:26 UTC 2012","overview":"<p>Michael Jay Solomon began his career in film distribution by loading films onto trucks for United Artists at the age of 18 while attending NYU at night.  When Michael Jay Solomon was 21, he joined United Artists’ International Division and sold theatrical films from Panama to Central America, and later Bogota, Colombia and Lima, Peru.  Michael Jay Solomon then started up MCA/Universal’s, now Comcast, Latin American Television Division while based in Mexico and later Brazil, and put most of the TV stations on the air in Latin America.  By age 30, Michael Jay Solomon became MCA/Universal’s, now Comcast, youngest vice president, and eventually had all international responsibilities.</p>\n\n<p>After eight years with United Artists and 14 years with MCA, Michael Jay Solmon co-founded Telepictures Corporation, which went on to become the largest U.S. television syndication company (they created TV syndication) and one of the largest international television distribution companies, as well as the owner and operator of six television stations in the U.S. and the publisher of six magazines, including US Magazine.  Telepictures became a public company (NASDAQ) after only 14 months under the leadership of Michael Jay Solomon as Chairman and CEO.</p>\n\n<p>When Telepictures merged with Lorimar to form Lorimar Telepictures Corp. (American Stock Exchange), Michael Jay Solomon became the new company’s President and served on its Board of Directors.  Michael Jay Solmon, with his partners, led Lorimar Telepictures to become the largest television production and distribution company in the world, producing TV series such as Dallas, Falcon Crest, Knot’s Landing and many more at their studios, which was formally the MGM Studios and is now SONY Studios.</p>\n\n<p>When Lorimar Telepictures was acquired by Warner Bros., Michael Jay Solomon became President of Warner Bros. International Television, heading up the company’s sales and marketing to television, cable and satellite companies internationally.  Under Michael Jay Solomon leadership, Warner Bros. became the largest (by 2.5 times) TV program distribution company in the world. Michael Jay Solomon was also responsible for investments in the telecommunications area internationally.  Michael Jay Solomon is a co-founder of HBO OLE (now HBO Latin America), the leading pay-TV service in Latin America, and opened the door to Western programming in China, Russia, India and many more third-world countries.  Michael Jay Solmon also co-founded the first satellite-delivered station in Scandinavia (SF Succe), co-owned a TV and feature film production company in India (Armitraj-Solomon).  Michael Jay Solomon was the first international distributor of The Grammys, MTV and “E” Entertainment Channel. Michael Jay Solomon is a Founder of the American Film Market Association, a film industry event.</p>\n\n<p>Michael Jay Solomon followed a five-year tenure at Warner Bros. in which Michael Jay Solomon increased international television revenues more than 400 percent and built a lasting international structure. Michael Jay Solomon left to launch his own television communications company, Solomon Entertainment Enterprises.  Michael Jay Solomon distributed independent TV product to the international market and formed a partnership with Canal Plus (France) and UFA (Germany) to produce TV movies.</p>\n\n<p>For three years, Michael Jay Solomon created El Camino Entertainment Group, Inc. (now called North American Midway), the largest Midway operating company in North America, by consolidating six of the most important family-run companies in the U.S. and Canada, consisting of rides, food and games, serving state and county fairs.  This business was bought out by a large investment fund, and then a management buy-out.</p>\n\n<p>Michael Jay Solomon later partnered with SMGBB (Shanghai Media Group Broadband) and RAYV (an Israeli company), which streams Chinese language broadcast networks live on the internet worldwide.  There are approximately 75 million Chinese living outside of China.</p>\n\n<p>Michael Jay Solomon is Co-Founder and Chairman of Film Domain, which is a film distribution company focused on worldwide distribution to digital platforms.  Film Domain will acquire library content from licensors worldwide by paying an advance and/or guaranteeing minimum marketing spends.  Moreover, Michael Jay Solomon’s Film Domain also plans to acquire foreign language versions from international distributors, to be used outside their original country.  While content will be diverse, appealing to the universe of consumers, each group of assets will be promoted using innovative, internet-based marketing techniques and social networks targeting particular interest or demographic niches.</p>\n\n<p>Michael Jay Solomon now focuses all of his time on the Truli Media Group, which he founded and of which he is CEO and President.  Under the website www.truli.net it will be the largest aggregator of family-based Christian and family oriented content.  Truli.net will also serve as a social networking site, deliver hundreds of sermons weekly from ministries through the U.S. and abroad, have faith-based films and music, and market faith-based merchandise, plus many other features.  Truli.net will be delivered on all digital platforms via the internet.  Truli.net launched July 10, 2012.</p>\n\n<p>Michael Jay Solomon serves on the Board of Overseers of New York University’s Stern School of Business (twenty-six years), and the Board of the Beverly Hills Performing Arts Center.  Michael Jay Solomon is a Founder of The Sam Spiegel Film &amp; Television School in Jerusalem, and was Founding Chairman of The Jerusalem Foundation of the West Coast of the United States.  Michael Jay Solomon has also just been elected as the Honorary Chairman of the Actors Equity of China, being the first American to ever hold this post.</p>\n\n<p>Michael Jay Solomon was educated at New York University’s Stern School of Business and Boston’s Emerson College. Michael Jay Solomon was awarded an honorary Doctor of Law degree.  Michael Jay Solomon is a member of the international honor society, Beta Gama Sigma.  Membership is the highest recognition a business student can receive anywhere in the world.</p>","image":{"available_sizes":[[[102,150],"assets/images/resized/0020/8073/208073v1-max-150x150.jpg"],[[146,213],"assets/images/resized/0020/8073/208073v1-max-250x250.jpg"],[[146,213],"assets/images/resized/0020/8073/208073v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President & CEO","firm":{"name":"Truli Media Group","permalink":"truli-media-group","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/mjaysolomon","title":"Twitter"},{"external_url":"http://www.facebook.com/MichaelJaySolomon","title":"Facebook"},{"external_url":"http://www.linkedin.com/pub/michael-jay-solomon/1b/687/282","title":"LinkedIn"}]}