{"first_name":"Michael","last_name":"J. Cromwell III","permalink":"michael-j-cromwell-iii","crunchbase_url":"http://www.crunchbase.com/person/michael-j-cromwell-iii","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 05 11:22:53 UTC 2009","updated_at":"Fri Jun 05 11:28:40 UTC 2009","overview":"<p>Mike co-founded WWC Capital Group in 1998. He focuses his efforts on companies in the information technology and business services markets, where he has been responsible for both investing in growth stage companies as well as providing merger and acquisition advisory services. Mike represents WWC Capital on the Boards of BrightDoor Systems, Social Solutions, Catalyst IT Services, and Preferred Systems and Solutions. He was also responsible for the firm&#8217;s successful investment in the public IT services company named Perficient, its investment in Lighthammer which was sold to SAP, as well as for other successful transactions in the information technology market.</p>\n\n<p>Prior to founding WWC, Mike&#8217;s experience combined substantial operating and financial management responsibility with significant visible success in executing an acquisition program of over 20 transactions and raising the capital to fund such transactions. He has been a senior executive with a major systems integrator, an entrepreneur with a small software firm and also an attorney in a large regional law firm.</p>\n\n<p>In his successful tenure as a senior operating and financial manager in the IT market, Mike had worked extensively with both services and enterprise software companies in the government and commercial sectors. He has invested in IT companies as well as helped them to achieve their merger and acquisition goals. Mike has advised on over $1 billion of such transactions. Mike has worked extensively in those segments of the IT markets that place a premium on strategic insight, including the following: network security, healthcare information, transaction processing and industrial data collection and control.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0004/6911/46911v1-max-150x150.jpg"],[[125,175],"assets/images/resized/0004/6911/46911v1-max-250x250.jpg"],[[125,175],"assets/images/resized/0004/6911/46911v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"JD","subject":"","institution":"Georgetown University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"WWC Capital Fund","permalink":"wwc-capital-fund","type_of_entity":"financial_org","image":{"available_sizes":[[[144,58],"assets/images/resized/0002/9738/29738v1-max-150x150.png"],[[144,58],"assets/images/resized/0002/9738/29738v1-max-250x250.png"],[[144,58],"assets/images/resized/0002/9738/29738v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}