{"first_name":"Michael","last_name":"Lombard","permalink":"michael-lombard","crunchbase_url":"http://www.crunchbase.com/person/michael-lombard","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Lovetropolis.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jun 18 17:18:10 UTC 2009","updated_at":"Fri Jun 19 18:45:48 UTC 2009","overview":"<p>Mr. Lombard has a diverse professional background with extensive entrepreneurial and executive experience.  His formal educational training and practical career experience have prepared him well to provide the creative direction for Lovetropolis.com and the corporate oversight of The Lombard Company, Inc.  Because he has previously owned and run a successful SME, Mr. Lombard is adept at directing strategic business development and creating marketshare for new, innovative products.  Mr. Lombard possesses persuasive oral communication skills and is accomplished in succeeding in dynamic, fast-paced settings.</p>\n\n<p>Mr. Lombard holds undergraduate degrees in Business Management and in Government and Politics from the University of Maryland.  Mr. Lombard started QLT Records &amp; Management and received lucrative artist development deals from Atlantic, Intersound and Navarre Corp. Records.  Through the 1990s, Mr. Lombard was instrumental in obtaining recording contracts for more than ten artists with major labels such as Def Jam Island Records, Sony, Columbia and Warner Music, while also securing a publishing contract for himself with Warner Chappell Music for writing and publishing.  Mr. Lombard&#8217;s accomplishments were well-recognized and highlighted in industry publications like Billboard Magazine and in entertainment publications like Straight from the Streets.</p>\n\n<p>Mr. Lombard started the Lombard Company, Inc. to create a state of the art, high quality dating website.  Lovetropolis.com was developed to outdistance the competition and to become one of the premier online dating services.</p>\n\n<p>As CEO, Mr. Lombard&#8217;s broad responsibilities include directing the development of corporate objectives, policies, budgets and operating plans; identifying, developing and directing the implementation of business strategy; planning and directing the company&#8217;s activities to achieve corporate targets and standards for financial performance, quality and culture; recruiting, selecting and developing executive team members; guiding the functions and performance of the executive team; and developing and maintaining corporate culture, values and reputation in the market and with all staff, customers, contributers, partners and regulatory/official bodies.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chairman/CEO","firm":{"name":"Lovetropolis.com","permalink":"lovetropolis-com","type_of_entity":"company","image":{"available_sizes":[[[150,22],"assets/images/resized/0004/9655/49655v2-max-150x150.png"],[[250,36],"assets/images/resized/0004/9655/49655v2-max-250x250.png"],[[450,66],"assets/images/resized/0004/9655/49655v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}