{"first_name":"Michael","last_name":"Woods","permalink":"michael-woods","crunchbase_url":"http://www.crunchbase.com/person/michael-woods","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":"","created_at":"Fri Nov 28 13:22:37 UTC 2008","updated_at":"Wed May 27 17:21:48 UTC 2009","overview":"<p>Michael Woods is a Vice President of SDL Capital and the portfolio manager of SDL Capital Partners, the firm&#8217;s proprietary hedge fund. He is also responsible for developing the firm&#8217;s public market investment strategy. SDL Capital Partners is a special situations fund focused on employing non-traditional investment strategies across a range of markets including small cap equity, distressed debt and equity and various derivative markets. Michael employs a highly disciplined investment approach grounded on fundamental bottom-up research and analysis.</p>\n\n<p>Prior to joining SDL Capital, Michael was employed by Imperial Capital, a boutique investment bank focused in high yield and distressed debt. At Imperial, Michael worked on the institutional trading desk conducting proprietary credit research of distressed companies and analysis of special situations including bankruptcies, recapitalizations and capital structure arbitrage.</p>\n\n<p>Before joining Imperial Capital, Michael held various positions with Thomas Weisel Partners, first in the firm&#8217;s mergers and acquisitions group and later in the private equity group where he was responsible for a wide range of valuation, analysis and due diligence that supported various technology related transactions and investments. While in the private equity group, Michael assisted the firm in beginning a special opportunities fund to capitalize on the distressed debt and mezzanine markets.</p>\n\n<p>Michael began his career in investment banking as an analyst with UBS, previously Dillon Read &amp; Company, where he worked on numerous domestic and cross-border corporate finance, mergers and acquisition and leveraged buyout transactions in a variety of industries.</p>\n\n<p>Michael received a B.A. in Finance, with honors, from the University of Colorado at Boulder in 1998.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":" Vice President, Portfolio Manager","firm":{"name":"SDL Ventures","permalink":"sdl-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[144,128],"assets/images/resized/0002/9959/29959v1-max-150x150.jpg"],[[144,128],"assets/images/resized/0002/9959/29959v1-max-250x250.jpg"],[[144,128],"assets/images/resized/0002/9959/29959v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}