{"first_name":"Michael","last_name":"A. Slawson","permalink":"michael-a-slawson","crunchbase_url":"http://www.crunchbase.com/person/michael-a-slawson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Alliance Technology Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"mike, arch, ho-slawson","alias_list":null,"created_at":"Sat Jun 20 05:57:50 UTC 2009","updated_at":"Mon Jul 18 20:02:26 UTC 2011","overview":"<p>Mike Slawson joined Alliance Technology Ventures as a General Partner in 1998. He leads ATV&#8217;s investment and portfolio management activities in information technology, specializing in semiconductor and communications technology. Mike currently serves on the board of directors of Nitronex, OmniGuide Communications, SyChip, Xytrans and Ziptronix. He also is a board observer at Pathfire and SecureWorks. Mike was previously a director at Mindlever (sold to Centra Software), RF Solutions (sold to Anadigics), Verifiber (sold to Bandwidth9) and XtremeSpectrum (sold to Motorola). He also was a board observer at Novera (sold to Mercator Software).\nPrior to ATV, Mike was selected for the two-year Kauffman Fellows Program in 1996 and spent his fellowship working in early-stage technology investing at ARCH Venture Partners in Chicago under the mentorship of Steve Lazarus. At ARCH, Mike was involved in the launch of Bandwidth Solutions (now Xtera Communications) where he wrote the initial business plan and co-authored a patent. Mike began his venture career as an investment professional at the North Carolina Technological Development Authority in Research Triangle Park, NC in 1995.</p>\n\n<p>Prior to entering venture capital, Mike spent eight years in electrical engineering and project management positions at Hewlett-Packard, Siemens, and Alcatel. At Alcatel, Mike co-authored two patents in photonics and fiber optic systems. He holds an MBA from the University of North Carolina at Chapel Hill (where he was awarded a North Carolina Business Foundation Fellowship and a Washington Campus Fellowship), an MSEE from North Carolina State University, and a BSEE (magna cum laude) from Vanderbilt University (where he was awarded a James B. Geddes Scholarship). Mike serves on the board of the Atlanta Venture Forum and is regularly a judge at Venture Capital Investment Competition events.</p>\n\n<p>He may be reached on the Internet at slawson@alliancetechventures.com.</p>","image":{"available_sizes":[[[117,150],"assets/images/resized/0004/9819/49819v1-max-150x150.jpg"],[[195,250],"assets/images/resized/0004/9819/49819v1-max-250x250.jpg"],[[224,286],"assets/images/resized/0004/9819/49819v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General partner","firm":{"name":"Alliance Technology Ventures","permalink":"alliance-technology-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,45],"assets/images/resized/0004/9817/49817v2-max-150x150.jpg"],[[250,75],"assets/images/resized/0004/9817/49817v2-max-250x250.jpg"],[[450,136],"assets/images/resized/0004/9817/49817v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}