{"first_name":"Michael","last_name":"Goldberg","permalink":"michael-goldberg","crunchbase_url":"http://www.crunchbase.com/person/michael-goldberg","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Nov 06 15:12:40 UTC 2008","updated_at":"Thu Nov 06 16:02:25 UTC 2008","overview":"<p>Michael Goldberg joined MDV in 2005 and leads life science investments in the areas of molecular diagnostics, personalized medicine and wireless healthcare with particular interest in oncology, cardiology, immunology and neuroscience. He also leverages his knowledge of plant genetics and microbiology in support of the firm&#8217;s energy investing.</p>\n\n<p>Prior to joining MDV Michael was Managing Director of Jasper Capital and Co-chair of the California Research and Cures Coalition ($3 billion Prop 71 stem cell campaign). He has also held senior management and operations roles including serving as Chairman and CEO of OnCare, an oncology services company he founded in 1995.</p>\n\n<p>Previously, Michael was Founder and Chief Executive Officer of Axion Inc., a cancer-focused healthcare service company he started in 1987 and sold to Bristol-Myers Squibb in 1996. Prior to his tenure with Axion, Michael was a member of the Operating Committee and director of Corporate Development at Cetus Corporation (Novartis), one of the first biotech companies and the developer of PCR technology. He was also a co-founder of Agracetus, a joint venture with W.R. Grace &amp; Co. (Monsanto), involved in plant genetic engineering. He was responsible for the commercialization of the company&#8217;s agricultural technology.</p>\n\n<p>Michael serves as a board member of the California Institute for Regenerative Medicine and of the Western Association of Venture Capitalists. He is also on the advisory councils of the Caltech Division of Biology, the Harvard Center for Genetics and Genomics, the Stanford Neuroscience Institute and the Berkeley Center for Law and Technology. Michael is a member of the Personalized Medicine Coalition and an honorary trustee of the National Childhood Cancer Foundation.</p>\n\n<p>Michael received a B.A. from Brandeis University and an M.B.A. from Stanford Graduate School of Business</p>","image":{"available_sizes":[[[102,150],"assets/images/resized/0002/7930/27930v2-max-150x150.jpg"],[[166,242],"assets/images/resized/0002/7930/27930v2-max-250x250.jpg"],[[166,242],"assets/images/resized/0002/7930/27930v2-max-450x450.jpg"]],"attribution":"<p>Michael Goldberg / <a href=\"http://www.mdv.com\" title=\"MDV\" rel=\"nofollow\">MDV</a></p>"},"degrees":[],"relationships":[{"is_past":true,"title":"Partner","firm":{"name":"Mohr Davidow Ventures","permalink":"mohr-davidow-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,58],"assets/images/resized/0001/9292/19292v3-max-150x150.jpg"],[[250,97],"assets/images/resized/0001/9292/19292v3-max-250x250.jpg"],[[450,176],"assets/images/resized/0001/9292/19292v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}