{"first_name":"Michael","last_name":"J. Greer","permalink":"michael-j-greer","crunchbase_url":"http://www.crunchbase.com/person/michael-j-greer","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 15 20:23:27 UTC 2009","updated_at":"Mon Jun 15 20:24:15 UTC 2009","overview":"<p>Since entering the financial sector in 1981, Mr. Greer has significant experience as an investment banker, financial advisor, corporate executive and entrepreneur. As Waveland’s CEO, he specializes in sourcing and structuring energy and private equity transactions, identifying sources of capital, and advising clients through all stages of corporate growth. Since co-founding Waveland Capital Partners in 2000, he has established the firm as a highly regarded boutique investment bank that has consistently performed for its clients in both good and difficult market conditions. Mr. Greer previously served as Managing Director of Taurus Capital Group, LLC, where he led the firm’s private equity operations. During his career, Mr. Greer has also been actively involved in the oil and gas exploration industry. Mr. Greer founded Energy Partners, Inc. to co-venture natural gas exploration and production projects in California’s Sacramento Basin. Energy Partners was later acquired by Benton Oil and Gas Company, a FINRA-traded exploration and production company. Through Mr. Greer’s efforts, Benton Oil expanded its operations to include major projects in the Texas-Louisiana Gulf Coast. The company was also active in Russia and Venezuela. Mr. Greer is a licensed General Securities Principal with FINRA.</p>","image":{"available_sizes":[[[95,141],"assets/images/resized/0004/8662/48662v1-max-150x150.jpg"],[[95,141],"assets/images/resized/0004/8662/48662v1-max-250x250.jpg"],[[95,141],"assets/images/resized/0004/8662/48662v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chairman and Chief Executive Officer","firm":{"name":"Waveland Venture Partners","permalink":"waveland-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[136,65],"assets/images/resized/0004/8660/48660v1-max-150x150.jpg"],[[136,65],"assets/images/resized/0004/8660/48660v1-max-250x250.jpg"],[[136,65],"assets/images/resized/0004/8660/48660v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}