{"first_name":"Michela","last_name":"Ledwidge","permalink":"michela-ledwidge","crunchbase_url":"http://www.crunchbase.com/person/michela-ledwidge","homepage_url":"http://michelaledwidge.com","birthplace":"Canberra","twitter_username":"michela","blog_url":"http://thequality.com/people/michela/weblog/","blog_feed_url":"http://thequality.com/people/michela/weblog/index.xml","affiliation_name":"Mod Productions","born_year":null,"born_month":null,"born_day":null,"tag_list":"media, technology, remixable, interactive, cinema, storytelling","alias_list":null,"created_at":"Fri May 13 06:05:23 UTC 2011","updated_at":"Fri Nov 04 22:01:24 UTC 2011","overview":"<p>Michela Ledwidge is an artist, entrepreneur and technologist.</p>\n\n<p>Since 1993 she has specialised in pulling together creative and technical teams to work on cutting edge projects. Her focus is on developing original cross media properties and assisting clients to define and deliver their content and services. 2009 projects include strategy to heritage film and TV companies, design/production of iPhone games, production of a cross-platform children&#8217;s TV series, and creation of the University of Sydney&#8217;s post graduate remixable media course.</p>\n\n<p>Michela has been a media producer since the early nineties. She moved away from the live band scene after discovering the Web in its infancy. In January 1993 she set up the first web site in Sydney, Australia, and her consultancy thequality.com.</p>\n\n<p>Michela has directed a wide range of high profile projects encompassing film-making, publishing, broadcasting, commerce, music, and IT. She was the first webmaster of the National Library of Australia and technical lead on the BBC&#8217;s first online community system.</p>\n\n<p>Michela explores and prods the gaps between traditional and interactive media. In 2001 she wrote, directed and produced the multi-lingual interactive short film Horses for Courses which was awarded the web3d art prize at SIGGRAPH that year.</p>\n\n<p>In 2004, Michela founded the UK production company MOD Films with an Invention and Innovations award from NESTA to develop next-generation film content and related web services. In June 2005 Michela&#8217;s film Sanctuary became the first 35mm production to clear audience re-use rights with professional actors using Creative Commons licenses.</p>\n\n<p>In 2007 she was a technical architect on the BBC iPlayer project and consulted to the post production company Molinare.</p>\n\n<p>In 2009 Michela won the Sydney Film Festival&#8217;s inaugural Peter Rasmussen Innovation Award in acknowledgement of her cutting edge screen projects.</p>\n\n<p>Michela&#8217;s vision is of remixable films that can be re-used and re-played like video games. As a VJ, Michela performs with films, treating each like a musical instrument.</p>\n\n<p>She has been a member of the Web3D Consortium, the UK Cabinet Office Special Interest Group on Open Source Software, and the BAFTA Interactive Entertainment Committee (2002-2004).</p>\n\n<p>Michela&#8217;s work has been shown in London, Milan, Salzburg, Singapore, Canberra, Sydney, the Gold Coast, Göteborg, Paris, New York, and Los Angeles. It has been covered in publications such as The New Paper, internet.au, Wired, The Financial Times, The Guardian, and The Wall Street Journal.</p>\n\n<p>Michela is currently based in Sydney but works on projects across the globe with creative studio Mod Productions. She is the creator of Rack&amp;Pin an online media production platform and also teaches a post-graduate unit, Remixable Media, at the University of Sydney.</p>","image":{"available_sizes":[[[143,111],"assets/images/resized/0013/4462/134462v2-max-150x150.jpg"],[[143,111],"assets/images/resized/0013/4462/134462v2-max-250x250.jpg"],[[143,111],"assets/images/resized/0013/4462/134462v2-max-450x450.jpg"]],"attribution":"<p>Michela Ledwidge / michelaledwidge.com</p>"},"degrees":[{"degree_type":"Bachelor of Arts","subject":"Computer Science, French","institution":"University of Sydney","graduated_year":1993,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Director","firm":{"name":"Mod Productions","permalink":"mod-productions","type_of_entity":"company","image":{"available_sizes":[[[97,47],"assets/images/resized/0016/0494/160494v2-max-150x150.png"],[[97,47],"assets/images/resized/0016/0494/160494v2-max-250x250.png"],[[97,47],"assets/images/resized/0016/0494/160494v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/michela","title":"michela"}]}