{"first_name":"Michael","last_name":"Anthofer","permalink":"michael-anthofer","crunchbase_url":"http://www.crunchbase.com/person/michael-anthofer","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Mar 03 04:03:53 UTC 2012","updated_at":"Sat Mar 03 04:07:34 UTC 2012","overview":"<p>Michael Anthofer is executive vice president and chief financial officer (CFO) of Tessera. Anthofer joined the company in September 2008 and is responsible for the company&#8217;s finance office, accounting, strategic planning and investor relations. He brings more than 30 years of technology company financial expertise to his position as he works to expand Tessera&#8217;s business footprint, and help manage and execute its long-term growth strategy.</p>\n\n<p>Anthofer came to Tessera from Kodiak Networks Inc., a privately held provider of mobile solutions to wireless providers, which he joined in 2003 as vice president and CFO. Prior to Kodiak, he served as senior vice president and CFO of Smartpipes Inc., a maker of network access control software. Before joining Smartpipes, Inc., in 2001, Anthofer was senior vice president and CFO of Concentric Network Corp., which merged with Nextlink Communications to form XO Communications. During his tenure, he grew the company from $2 million in annual revenue to over $250 million in five years, and was instrumental in taking the company public in August of 1997. Prior to Concentric, Anthofer served as executive vice president and CFO of Shared Resources Exchange Inc., a digital switching equipment maker. Earlier, he held several vice president level positions at DSC Communications Corporation, a Fortune 1000 corporation.</p>","image":{"available_sizes":[[[92,92],"assets/images/resized/0017/6788/176788v1-max-150x150.jpg"],[[92,92],"assets/images/resized/0017/6788/176788v1-max-250x250.jpg"],[[92,92],"assets/images/resized/0017/6788/176788v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Executive Vice President and CFO","firm":{"name":"Tessera","permalink":"tessera","type_of_entity":"company","image":{"available_sizes":[[[150,39],"assets/images/resized/0003/9005/39005v2-max-150x150.jpg"],[[250,66],"assets/images/resized/0003/9005/39005v2-max-250x250.jpg"],[[267,71],"assets/images/resized/0003/9005/39005v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}