{"first_name":"Michael","last_name":"Mullan","permalink":"michael-mullan","crunchbase_url":"http://www.crunchbase.com/person/michael-mullan","homepage_url":"http://www.michaelmullan.org/","birthplace":"Farnborough, Kent","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Royal Free Hospital and Friern Hospital","born_year":1956,"born_month":1,"born_day":11,"tag_list":"neurodegenerative-disorders, roskamp-institute, sarasota, alzheimers-disease","alias_list":null,"created_at":"Wed Oct 10 11:46:00 UTC 2012","updated_at":"Tue Oct 30 23:50:57 UTC 2012","overview":"<p>As a specialist in neurodegenerative disorders, Michael Mullan is trying to find a long lasting cure for diseases that affect the brain. He has worked in various medical organizations and has won multiple awards that enable him to continue his research into diseases and conditions. He currently serves as CEO and President of Roskamp Institute, an organization that he has been working with since 1994. He has received numerous honors and awards for his continued work and research, both during his university studies and during his professional medical career as he makes important inroads into the understanding and cure of neurodegenerative disorders. He currently makes his home in Sarasota, Florida in the US, where the Roskamp Institute is located.</p>\n\n<p>Projects and Honors and Prizes</p>\n\n<p>The important research committees that Michael Mullan has been responsible for or worked on is extensive, but since 2009, he has been a Collaborator in a Congressionally directed medical research programs award called &#8220;Identification of Biological Pathways Implicated in Hippocampal Dysfunction and Cognitive Impairment in Gulf War Illness.&#8221; During those years he was also a consultant at the Alzheimer&#8217;s Association and worked on &#8220;Development of a Novel Screening Approach for MCI and Early Alzheimer&#8217;s Disease.&#8221; He has worked as a Principal Investigator for the Department of Defense where he studied &#8220;Proteomic Analysis of Biomarkers and Pathogenesis of TBI.&#8221; In 2008-2009 he was also a consultant for the James and Esther King Biomedical Research Program: SMTT, where he worked on the &#8220;Treatment of Lung Adenocarcinoma and Metastasis by Antiangiogenic Fragment of Abeta.&#8221; In earlier years, he was the Principal Investigator for the ONDCP Award, &#8220;Proteomic and Genomic Analysis of Drug Abuse&#8221;, the Principal Investigator for FACRI, Microglial Activation and Neuronal Amyloid Precursor Protein Processing, for the VA Merit Award, &#8220;CD40: Microglial Activation, APP Processing and Tau Phosphorylation and for the VA Award, &#8220;Proteomic Analysis of Cellular Response to Biological Warfare Agents.&#8221;</p>\n\n<p>Educational Achievements and Additional Awards</p>\n\n<p>During his studies of medicine at the London University, Michael Mullan was chosen for the 1984 Hoechst Elective Award for his study of genetic at Institute of Psychiatry. At the completion of his studies in 1985, he was awarded an MBBS. He continued his studies at the Royal College of Psychiatrist and earned an MRCPsych in 1990. Some of the awards and prizes he received while studying were the Ethel Williams Scholarship from the Royal Free Hospital in recognition of the postgraduate research that he did pertaining to Alzheimer&#8217;s disease. He also earned the registrar posting for the Bethlem and Maudsley Special Health Authority Research for his contribution to clinical studies and molecular genetics of Familial Alzheimer&#8217;s Disease. For the three years following, he worked on a Clinical Research Fellowship that was granted by the Mental Health Foundation to support research into the clinicogenetic correlates of Familial Alzheimer&#8217;s Disease. The study provided for learning in appropriate techniques that are involved in the study of molecular genetics, including statistical analysis. He followed through with his studies by earning a Doctorate in Philosophy in 1993 for his studies of Molecular Genetics from the London University. </p>","image":{"available_sizes":[[[117,150],"assets/images/resized/0021/5005/215005v2-max-150x150.jpg"],[[195,250],"assets/images/resized/0021/5005/215005v2-max-250x250.jpg"],[[250,320],"assets/images/resized/0021/5005/215005v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"PhD","subject":"Molecular Genetics","institution":"London University","graduated_year":1993,"graduated_month":null,"graduated_day":null},{"degree_type":"MRCPsych","subject":"Psychiatry","institution":"Royal College of Pyschiatrist","graduated_year":1990,"graduated_month":null,"graduated_day":null},{"degree_type":"MBBS","subject":"Medicine","institution":"London University","graduated_year":1985,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President & CEO","firm":{"name":"Roskamp Institute","permalink":"roskamp-institute","type_of_entity":"company","image":null}},{"is_past":true,"title":"Registrar/Senior Registrar","firm":{"name":"Royal Free Hospital and Friern Hospital","permalink":"royal-free-hospital-and-friern-hospital","type_of_entity":"company","image":null}},{"is_past":true,"title":"Director","firm":{"name":"Roskamp Laboratories","permalink":"roskamp-laboratories","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://en.wikipedia.org/wiki/Michael_Mullan","title":"Michael Mullan on Wikipedia"}],"web_presences":[{"external_url":"http://michaelmullan.net/","title":"Michael Mullan Bio Page"},{"external_url":"http://network.nature.com/profile/michaelmullan","title":"Michael Mullan Nature Profile"}]}