{"first_name":"Michael","last_name":"Santullo","permalink":"michael-santullo","crunchbase_url":"http://www.crunchbase.com/person/michael-santullo","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Aug 24 17:29:10 UTC 2011","updated_at":"Wed Aug 24 17:32:40 UTC 2011","overview":"<p>Michael was the CEO and co-founder of the early Internet start-up Four11. He led the company from two-person start-up until the successful acquisition by Yahoo in 1997. Since leaving Yahoo, Michael has become actively involved with a number of early stage companies. He was an investor and board member with DirectHit, a successful search company acquired by Ask Jeeves in 2000. Currently, he is an advisor to ProspX, Brandmail Solutions, and GoGoVerde.</p>\n\n<p>Michael is a board member and co-founder of the Clean Tech Open, the nation’s leading competition for clean technology start-ups. Michael is also a partner with the Cleantech Circle, a group of serial entrepreneurs and investors based in Silicon Valley who are committed to the growth and adoption of renewable energy generation and resource/energy efficiency technologies.</p>\n\n<p>Prior to Four11, Michael spent 10 years in a variety of engineering, project management, and product marketing roles working on products ranging from consumer electronics to high speed fiber optic transmission systems. His achievements from this period include a patent in the field of telecommunications and a Business Week Product Design Award. Michael holds a BSEE from M.I.T.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Advisor","firm":{"name":"Bloodhound","permalink":"bloodhound","type_of_entity":"company","image":{"available_sizes":[[[126,150],"assets/images/resized/0015/0907/150907v1-max-150x150.png"],[[210,250],"assets/images/resized/0015/0907/150907v1-max-250x250.png"],[[243,288],"assets/images/resized/0015/0907/150907v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}