{"first_name":"Michael","last_name":"McCarthy","permalink":"michael-mccarthy","crunchbase_url":"http://www.crunchbase.com/person/michael-mccarthy","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 28 12:49:51 UTC 2008","updated_at":"Fri Nov 28 12:56:30 UTC 2008","overview":"<p>Michael McCarthy joined SCP Worldwide in July 2005 and was recently named Vice-Chairman of the St. Louis Blues, where he oversees day-to-day operations for the National Hockey League franchise. Additionally, he also played an instrumental role in SCP Worldwide’s recent purchase of the Peoria Rivermen and also serves as the Chairman of SCP’s highly acclaimed sports, entertainment and media production company, Tupelo Honey Productions.</p>\n\n<p>Mr. McCarthy, prior to joining SCP, served as President of Madison Square Garden Networks Group (MSG Network/FSN New York), a position he held during his 23-year career with the organization. During his tenure, he oversaw the sports and news production and programming that led to an extraordinary 75 Emmy Awards and 250 Emmy Award Nominations.</p>\n\n<p>In addition to the many Emmy Awards, Mr. McCarthy&#8217;s creativity and programming prowess were recognized as he and his staff garnered many other accolades throughout the industry, including the national Cable ACE Award, International Festival Award, two-time Pro Max Marketing Awards, Bandies Award and The Mark Award.</p>\n\n<p>Mr. McCarthy started at Madison Square Garden Networks as an intern in college, and worked his way upward as a Production Assistant, Producer, Senior Producer, Executive Producer to the Vice President of Programming and Production, where he was able to shape MSG Network into the premier sports regional network in the country. He steadily moved up to Senior Vice President of Programming and Production and was given the responsibility of overseeing Fox Sports New York, where he transformed the regional network into another award-winning regional sports leader.</p>\n\n<p>Mr. McCarthy became Executive Vice President, and later President, where he served on the Madison Square Garden Executive Board. He also served on the CTANY Board. One of Mr. McCarthy&#8217;s legacies at MSG Networks was as an active member of the Cheering for Children Board, where he was very instrumental in the charity that aided after-school programs for children in the metropolitan New York area.</p>\n\n<p>As the leader of Madison Square Garden Networks Group, Mr. McCarthy had the responsibility of overseeing the entire operation of MSG Network, Fox Sports Net New York, MSG Radio, MSG ITV and MSGNetwork.com. He managed budgets of $386 million in revenue and $235 million in expenses, while overseeing over 200 staff and another 300 freelance employees.</p>\n\n<p>Mr. McCarthy was responsible for the day-to-day operations of Production, Programming, Ad Sales, Marketing, New Media, Technical Operations and Public Relations. He oversaw and directly negotiated talent contracts, along with IBEW, IATSE, DGA and AFTRA union contracts.</p>\n\n<p>Besides being recognized for excellence in sports production, Mr. McCarthy was also an innovative leader of the most technically advanced regional networks, including the introduction of High Definition Television (HDTV) in 1998 when his network aired the first regularly scheduled sports events covered in HD.</p>\n\n<p>Mr. McCarthy also managed and created highly popular, Emmy award winning New Media initiatives of sports content for the Cablevision digital set top box (DSTB).</p>\n\n<p>Mr. McCarthy resides in Fairfield, Ct with his wife and two children, Jeremy and Maggie.</p>","image":{"available_sizes":[[[117,150],"assets/images/resized/0002/9954/29954v1-max-150x150.jpg"],[[150,192],"assets/images/resized/0002/9954/29954v1-max-250x250.jpg"],[[150,192],"assets/images/resized/0002/9954/29954v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Partner, SCP Worldwide","firm":{"name":"SCP Worldwide","permalink":"scp-worldwide","type_of_entity":"financial_org","image":{"available_sizes":[[[150,47],"assets/images/resized/0002/9946/29946v1-max-150x150.jpg"],[[250,79],"assets/images/resized/0002/9946/29946v1-max-250x250.jpg"],[[271,86],"assets/images/resized/0002/9946/29946v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}