{"first_name":"Michael","last_name":"Kohlsdorf","permalink":"michael-kohlsdorf","crunchbase_url":"http://www.crunchbase.com/person/michael-kohlsdorf","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Aug 13 13:50:25 UTC 2009","updated_at":"Thu Aug 13 13:52:13 UTC 2009","overview":"<p>Kohlsdorf brings more than 25 years of executive management experience to ADERANT. Additionally, he has an extensive background in leading rapidly growing software firms and delivering innovative solutions to law firms and other professional services organizations.</p>\n\n<p>Prior to joining ADERANT, Kohlsdorf was Senior Vice President, Enterprise Services and Information Technology for IKON Office Solutions, Inc., (NYSE:IKN) a $4.4 billion Fortune 500 provider of document management software solutions. He was responsible for the company&#8217;s global professional software and services division which generated $2.3 billion in revenues and employed 16,000 professionals.</p>\n\n<p>Prior to IKON, Kohlsdorf was President and Chief Executive Officer for T/R Systems, Inc. (NASDAQ:TRSI), now Electronics for Imaging, a leading provider of document management software solutions. During his eight year tenure, Kohlsdorf grew the company&#8217;s revenues from $1 million to $32 million, distinguishing it as one of the fastest growing technology companies in the United States. T/R was recognized as an Inc. 500 Company as well as a Deloitte and Touche Fast 500 Company.</p>\n\n<p>Prior to T/R Systems, Inc., Kohlsdorf was President and Chief Operating Officer for Brock Control Systems, Inc., now Firstwave Technologies, a global provider of Customer Relationship Management (CRM) software and services. Earlier in his career, Kohlsdorf held various executive positions at Gerber Alley Corporation, now First Data Corporation, American Software, Inc., and IBM.</p>\n\n<p>Kohlsdorf holds an MBA from the University of Notre Dame where he majored in International Business and participated in an exchange program with the London Business School. He is a 2001 Ernst &amp; Young Entrepreneur of the Year finalist and on the Board of Directors for Standard Register (NYSE: SR), where he also serves as chairman of the Audit Committee.</p>","image":{"available_sizes":[[[116,135],"assets/images/resized/0005/6336/56336v1-max-150x150.jpg"],[[116,135],"assets/images/resized/0005/6336/56336v1-max-250x250.jpg"],[[116,135],"assets/images/resized/0005/6336/56336v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"ADERANT","permalink":"aderant","type_of_entity":"company","image":{"available_sizes":[[[150,67],"assets/images/resized/0005/6334/56334v1-max-150x150.png"],[[170,76],"assets/images/resized/0005/6334/56334v1-max-250x250.png"],[[170,76],"assets/images/resized/0005/6334/56334v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}