{"first_name":"Michael","last_name":"Hawkins","permalink":"michael-hawkins","crunchbase_url":"http://www.crunchbase.com/person/michael-hawkins","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"MLH Software","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Mar 21 01:00:04 UTC 2011","updated_at":"Sun Oct 30 22:42:58 UTC 2011","overview":"<p>Michael Hawkins, Vice President of Software Development, EDIS Solutions: Michael has been with MEDHOST since February 2000. He joined the team just as they began the design of their Charting architecture. Michael’s contributions as architect lead to the creation of MEDHOST’s successful Nurse and Physician Documentation modules. He played a significant role in refining software development process and providing faster, higher quality deliveries. Michael is also responsible for innovations such as the flexible Style Sheet Builder application and Charge Capture capabilities that allows MEDHOST to stay current with new standards without significant source code changes. Michael’s leadership of product development ensured MEDHOST certification under CCHIT in 2008, and ONC-ATCB (ARRA) certification in 2011.</p>\n\n<p>Michael received MEDHOST Outstanding Technical Achievement Award in 2004 and MEDHOST Above and Beyond Award in 2008. In 2009 Michael had the opportunity to conducted a product demonstration as part of, New York Times writer, David Pogue’s keynote address at Interop New York. In 2010 Michael was featured on Untether.tv with Rob Woodbridge.</p>\n\n<p>In March 2009 Michael started MLH Software. MLH Software strives to create high quality and intuitive applications for the BlackBerry smartphone. Whether it is an application to enhance the productivity of your BlackBerry or an application to entertain, MLH Software aims to create a positive experience with their software. Our mission is to develop innovative and user friendly applications and to provide excellent customer service. </p>\n\n<p>Prior to MEDHOST, Michael was an Advisory I/T Specialist with IBM Global eBusiness Integration where he performed architecture design work for Internet applications to ensure performance and scalability as well as integration to legacy systems. As a Software Research Engineer with Iomega Corporation, Michael designed and developed applications to download and secure digital content to Iomega media. Parts of his works were submitted for patent protection. </p>\n\n<p>Michael received a Bachelor of Science in Computer Science from Stephen F. Austin State University.</p>","image":{"available_sizes":[[[98,150],"assets/images/resized/0012/7022/127022v2-max-150x150.jpg"],[[164,250],"assets/images/resized/0012/7022/127022v2-max-250x250.jpg"],[[283,430],"assets/images/resized/0012/7022/127022v2-max-450x450.jpg"]],"attribution":"<p>Michael Hawkins</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"MLH Software","permalink":"mlh-software","type_of_entity":"company","image":{"available_sizes":[[[150,39],"assets/images/resized/0012/7922/127922v2-max-150x150.png"],[[190,50],"assets/images/resized/0012/7922/127922v2-max-250x250.png"],[[190,50],"assets/images/resized/0012/7922/127922v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"VP of Software Development","firm":{"name":"MEDHOST","permalink":"medhost","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0007/5783/75783v1-max-150x150.jpg"],[[180,72],"assets/images/resized/0007/5783/75783v1-max-250x250.jpg"],[[180,72],"assets/images/resized/0007/5783/75783v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/hawkinsm","title":""}]}