{"first_name":"Michael","last_name":"Leung","permalink":"michael-leung","crunchbase_url":"http://www.crunchbase.com/person/michael-leung","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"http://www.bloggingmyassoff.com","blog_feed_url":"http://www.bloggingmyassoff.com/articles.rss","affiliation_name":"VBS Holdings LLC","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Aug 26 02:35:32 UTC 2008","updated_at":"Sun Dec 28 20:59:15 UTC 2008","overview":"<p>Michael Leung is the Chief Technical Officer for VBS Holdings LLC.  He is a passionate, driven developer, who strives to create simple, yet powerful web applications. </p>\n\n<p>Michael has been a professional software developer since 1999, when he began his career creating a web based Enterprise Resource Planning system for Phoenix Electronic Enterprises Inc., a large cable manufacturing company, using ASP and Visual Basic 5. Shortly thereafter, he co-founded his first company, Alpha POS Restaurant Systems Inc., a restaurant Point-of Sale VAR based on touch screen technology. As lead developer, he designed numerous Windows and web applications, including help desk support software, menu creation tools, print spooling applications and multi-location data aggregation software. He was also responsible for training new clients on the POS system. </p>\n\n<p>Michael redirected his efforts towards the social sector when he founded his second company, Alpha Touch Solutions Inc. In this venture, his previous technologies were used to teach mentally disabled children via touch screen, special education software. As the industry shifted focus in 2006, he began creating web applications using Ruby on Rails and other open source technologies. His most recent company, Bold Code, LLC, specializes in web development. At present, Michael has worked on\nover 10 web applications and created two facebook apps: Cribfinder and Let&#8217;s Drink (which has close to 200,000 users). His work on Cribfinder has earned him a partnership in the parent company, Jenius Industries Inc.</p>\n\n<p>Michael studied Computer Science at Ulster County Community College and Suny New Paltz, completing coursework in: JavaScript and HTML, Introduction to C, and Visual Basic. He has also obtained his MCP (Microsoft Certified Professional) in Windows NT Workstation, and Windows NT Server.</p>\n\n<p>Originally from Carmel, New York, Michael Leung now resides in Saugeries, New York.</p>","image":{"available_sizes":[[[67,150],"assets/images/resized/0002/4341/24341v2-max-150x150.jpg"],[[113,250],"assets/images/resized/0002/4341/24341v2-max-250x250.jpg"],[[152,336],"assets/images/resized/0002/4341/24341v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CTO","firm":{"name":"VBS Holdings LLC","permalink":"vbs-holdings-llc","type_of_entity":"company","image":{"available_sizes":[[[150,41],"assets/images/resized/0002/4340/24340v2-max-150x150.png"],[[250,68],"assets/images/resized/0002/4340/24340v2-max-250x250.png"],[[320,88],"assets/images/resized/0002/4340/24340v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"","firm":{"name":"Jenius Industries Inc.","permalink":"jenius-industries-inc","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}