{"first_name":"Michael","last_name":"Kauffman","permalink":"michael-kauffman","crunchbase_url":"http://www.crunchbase.com/person/michael-kauffman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"RightsFlow","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Sep 07 03:11:08 UTC 2010","updated_at":"Sat Apr 07 18:40:06 UTC 2012","overview":"<p>Michael Kauffman is a visionary content marketing executive who creates and launches game-changing ideas that drive revenue and impact customer engagement. He brings over two decades of sales and marketing expertise to his current position as Head of Corporate Communications for the RightsFlow team, at YouTube where he spearheads corporate and community communication efforts as well as drives key content strategies and marketing initiatives.</p>\n\n<p>Kauffman was hired as SVP of Sales and Marketing, then moved to SVP of Corporate Communications and Content at RightsFlow (selected #8 Best Places to Work 2011 by Crain’s NY), which was acquired by Google in 2011 to be part of the YouTube team.  The company provides music copyright identification, licensing, reporting &amp; payment services to YouTube, Google Music and thousands of other enterprise, distribution, label, and musician clients.  Additionally, Kauffman led efforts to launch the Limelight utility, an online mechanical licensing resource that grew into a multi-million dollar revenue channel generating hundreds of thousands in royalties for songwriters and publishers globally, and used by musicians, choir, indie labels, American Idol winners and artists in over 150 countries around the world.  He was responsible for securing high-impact partnerships with ASCAP, CD Baby, NAfME, MENC, MEIEA, Chorus America, Tunecore, and others, as well as delivering high-profile press features in Billboard, the NY Times, Reuters, Daily Variety, AOL, Digital Music News, Digital Media Wire, Hypebot, and many other cross-platform outlets.</p>\n\n<p>Kauffman joined RightsFlow after founding and managing The HiFive Group, a consultancy providing sales, marketing, social media, brand partnership, and content distribution services to the entertainment industry. Clients included global corporations (Disney, Universal) and initiatives like “Record Store Day”, as well as for retailers (Patsy’s, Hoodlums), labels, and artists.\nPrior to that, he was SVP of Sales at the Verve Music Group (Universal Music Group) responsible for account management, field sales and marketing, and catalog development for the label’s roster of artists including Diana Krall, Natalie Cole, Gladys Night, Herbie Hancock, Wayne Shorter, and the rich legacy of the Verve, Impulse, and GRP jazz / adult pop imprints under Universal Music Group. He led an acclaimed award-winning sales team branded “The Jazz Pack” to back-to-back NARM 2005 and 2006 Label of the Year honors.  Under his leadership, the team delivered a half billion dollars in gross revenue and $100 million in EBITDA along with Gold and platinum sellers from Diana Krall and John Coltrane as well as artist development success stories from Jamie Cullum, Brazilian Girls, Lizz Wright, Ledesi, Verve Remixed projects, and many others.</p>\n\n<p>Early career experience included senior positions at Windham Hill, Bertelsmann, and Sound Warehouse, along with stints as a DJ, record store clerk, concert promoter, copywriter, and media buyer.</p>\n\n<p>He graduated with honors from Temple University in Philadelphia with a Bachelor of Arts in Communications where he was active in music, radio and concert promotion. He currently serves on the University’s Alumni Board for Metropolitan New York and also as a volunteer Project Manager for The Taproot Foundation.</p>\n\n<p>Kauffman has been a speaker and featured presenter at CMJ, New Music Seminar, ASCAP, Toyota Scion Music(less) Festival, Berklee College of Music, NARM, and A2IM events.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"SVP of Corporate Communications And Content","firm":{"name":"RightsFlow","permalink":"rightsflow","type_of_entity":"company","image":{"available_sizes":[[[150,16],"assets/images/resized/0003/9912/39912v2-max-150x150.jpg"],[[250,28],"assets/images/resized/0003/9912/39912v2-max-250x250.jpg"],[[450,50],"assets/images/resized/0003/9912/39912v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}