{"first_name":"Michael","last_name":"Schmitz","permalink":"michael-schmitz-2","crunchbase_url":"http://www.crunchbase.com/person/michael-schmitz-2","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"quosap.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 03 16:41:13 UTC 2012","updated_at":"Tue Jul 03 17:23:47 UTC 2012","overview":"<p>Michael Schmitz is the CTO of Quosap. He serves as the chief architect and designer of the technology and product for Quosap and is responsible for the technology thought leadership of the company. Michael has a strong background in Ruby on Rails and database programming. He worked for the Digital Equipment Corporation (DEC) on Computer Security and DEC’s Advanced File System (ADVFS). He was a File Systems engineer at Veritas for six years, working on the internals of the VxFS file system and was the architect of the Veritas Storage Appliance. He has been a Consulting Engineer at Oracle for five years contributing to data management for the Enterprise Manager product. Most recently, he has worked at EngineYard with the title Data Store Guru. Michael holds a Ph.D. in Mathematics from University of Wisconsin at Milwaukee and has nearly a second Ph.D. (all but dissertation) in Computer Science from University of Illinois at Urbana-Champaign. He also is a co-holder of two patents in the area of Storage Virtualization in a Fibre Channel Switch.</p>","image":null,"degrees":[{"degree_type":"Ph.D. in Mathematics, Ph.D. (all but dissertation) in Computer Science","subject":"Mathematics, Computer Science","institution":"University of Wisconsin, University of Illinois Urbana-Champaign","graduated_year":1982,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CTO","firm":{"name":"quosap.com","permalink":"quosap-com","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/michael-schmitz/23/361/188","title":""}]}