{"first_name":"Michael","last_name":"Montgomery","permalink":"michael-montgomery","crunchbase_url":"http://www.crunchbase.com/person/michael-montgomery","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Montgomery & Co","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Feb 26 22:08:51 UTC 2008","updated_at":"Tue May 22 04:06:44 UTC 2012","overview":"<p>Michael Montgomery serves as President of Montgomery &amp; Co.   Mr. Montgomery has an extensive background in the entertainment industry and has worked at some of the world’s largest media companies, including the Walt Disney Company and Dreamworks SKG.  Mr. Montgomery advises client companies on merger and acquisition opportunities and financings.</p>\n\n<p>Prior to joining Montgomery &amp; Co. in 1999, Mr. Montgomery was the chief executive officer of Sega GameWorks, a joint venture between Sega, Universal Studios and DreamWorks. At its peak, SegaGameworks employed 1,000 people in over 30 sites worldwide.</p>\n\n<p>Prior to that, Mr. Montgomery was a senior executive for DreamWorks SKG, where he structured and led its successful efforts to raise $1 billion in private equity financing. Mr. Montgomery joined DreamWorks in 1995, after serving as the executive vice president and chief financial officer of EuroDisney, where he played a key role in the fiscal and operational restructuring of the company. He moved to Paris to assume that role in 1993.</p>\n\n<p>Prior to that, he was the vice president and treasurer at the Walt Disney Company, where he was responsible for the numerous innovative financing arrangements conceived and executed for Disney, including their film financings, overseas royalty financings and the initial public offering of EuroDisney in 1989.</p>\n\n<p>Before joining Disney, Mr. Montgomery worked at ARCO in its treasury organization, and later served as president of ARCO Solar in Europe. Mr. Montgomery was the point person for the sale of the Arco Plaza and the financings associated with its $4 billion restructuring in 1985.</p>\n\n<p>Mr. Montgomery currently serves on the Board of Directors of DreamWorks Animation. He also served on the Board of Directors of Corus Pharma and Pathogenesis, a public pharmaceutical company that was acquired by Chiron for $700 million in 2000.</p>\n\n<p>Mr. Montgomery received an MBA from the Amos Tuck School at Dartmouth College, where he also holds a Bachelor of Arts as a Rufus Choate Scholar with magna cum laude honors.</p>","image":{"available_sizes":[[[119,132],"assets/images/resized/0001/3835/13835v1-max-150x150.jpg"],[[119,132],"assets/images/resized/0001/3835/13835v1-max-250x250.jpg"],[[119,132],"assets/images/resized/0001/3835/13835v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":null,"title":"President and Head of Media Banking","firm":{"name":"Montgomery & Co","permalink":"montgomery-co","type_of_entity":"financial_org","image":{"available_sizes":[[[150,89],"assets/images/resized/0001/3838/13838v1-max-150x150.png"],[[200,119],"assets/images/resized/0001/3838/13838v1-max-250x250.png"],[[200,119],"assets/images/resized/0001/3838/13838v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}