{"first_name":"Michael R","last_name":"Carithers Jr","permalink":"michael-r-carithers-jr","crunchbase_url":"http://www.crunchbase.com/person/michael-r-carithers-jr","homepage_url":"http://www.michaelrcarithersjr.com","birthplace":"Wilmington, Delaware","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Carithers Consulting Services, LLC","born_year":1966,"born_month":null,"born_day":null,"tag_list":"consulting-services, michael-r-carithers-jr, legal-advice","alias_list":null,"created_at":"Sun Sep 09 10:05:16 UTC 2012","updated_at":"Sun Sep 09 20:08:47 UTC 2012","overview":"<p>Carithers Consulting Services provides their clientele with a certain high quality service at inexpensive rates that does not break their clients&#8217; pockets.  Located in Detroit and offering their services to Detroit, Michigan and Southfield, Michigan. Carithers&#8217; clients are assured particularly lower charges than other advisors in the same field.  Carithers Consulting Services is owned and founded by Michael Carithers who has over two decades of experience under his belt and who is confident in the results he delivers.  This confidence is acknowledged by the 100% satisfaction guarantee Carithers Consulting Services offers their clientele.  </p>\n\n<p>Within the structure of Carithers Consulting Services, legal advice is given by Michael Carithers to many families through a service called Legal Shield, which is an association that supplies legal aid to over millions of American families today at a nominal price.  </p>\n\n<p>Michael Carithers is a legally trained consultant and his extensive legal background has been acquired from the many legal corporations he has worked in over the last 20 years.  The experience he has attained along the way, including considerable understanding in the management of different size teams in complicated criminal and civil litigation cases, with the aid of litigation-based technology and software has helped put Carithers where he is today.  He has an excellent record of participation in cases where the Grand Jury has been involved and Carithers has been a key player in many criminal investigations in the healthcare system.  His representation of entrepreneurs and new businesses in tort disputes in common law jurisdictions and representation of street crime has given him the edge on many others in his field.  </p>\n\n<p>Working at Ross, Dixon and Masback, in 1993, Carithers worked in this rapidly growing law firm as an associate in the litigation field related to insurance coverage.  As an associate in general commercial litigation, Carithers began working in Galland, Kharash, Morse and Garfinkle, until the summer of 1994 which was then followed by working as an assistant attorney in the United States Attorney&#8217;s office.  Carithers then moved on to an internal counsel position in the discovery department at Ford Motors where he gained substantial in-house legal experience for 1 year.  As an associate at the leading company, Collier Shannon Scott, he specialized in general litigation and white collar defense matters for the next 3 years.  Carithers held Of counsel positions between 2005 and 2008 firstly at Greenberg Traurig, an international law firm with around 2000 lawyers and governmental affairs experts across the US and secondly at Brown and Sheehan LLP, who often represent a large number of national corporations in litigation matters, including leading Fortune 500 corporations.  Working at Liles Parker until 2011, was another opportunity for Michael Carithers to gain more expertise in criminal defense in this firm that focuses on business transactions, health law and regulatory compliance.</p>\n\n<p>Michael Carithers holds memberships in various legal associations such as the ABA (American Bar Association) which works to improve the administration of justice and the NACDL (National Association of Criminal Defense Lawyers), the largest U.S. organization of defense attorneys that advocates for legislation and court rules in the protection of defendants.</p>","image":null,"degrees":[{"degree_type":"BA","subject":"Government","institution":"Harvard College","graduated_year":1988,"graduated_month":null,"graduated_day":null},{"degree_type":"JD","subject":"Law","institution":"University of Michigan Law School","graduated_year":1991,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Carithers Consulting Services, LLC","firm":{"name":"Carithers Consulting Services, LLC","permalink":"carithers-consulting-services-llc","type_of_entity":"company","image":null}},{"is_past":false,"title":"Carithers Consulting Services, LLC","firm":{"name":"Carithers Consulting Services, LLC","permalink":"carithers-consulting-services-llc","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.michaelrcarithersjr.com","title":"Michael R Carithers Jr-Wiki Page"},{"external_url":"http://www.michaelrcarithers.com/","title":"Who Is Michael R Carithers"},{"external_url":"http://michaelrcarithersjr.tumblr.com/","title":"Michael R Carithers Jr on Tumblr"}]}