{"first_name":"Michael","last_name":"Burcham","permalink":"michael-burcham","crunchbase_url":"http://www.crunchbase.com/person/michael-burcham","homepage_url":"http://www.michaelburcham.com","birthplace":"Mississippi","twitter_username":"michaelrburcham","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1961,"born_month":8,"born_day":16,"tag_list":"entrepreneur, healthcare, startups, angel-investor, professor, strategist, investor, galen-partners, startup-tennessee, startup-america","alias_list":null,"created_at":"Fri Aug 19 19:44:21 UTC 2011","updated_at":"Fri Aug 26 21:12:14 UTC 2011","overview":"<p>Michael is the President &amp; CEO of the Nashville Entrepreneur Center.  A serial entrepreneur who began his career at Hospital Corporation of America, Michael has a passion for helping individuals organize and grow their businesses.  He is a member of the Nashville Capital Network, on the Board of the Nashville Technology Council, the Board of the International Business Council, and serves on Nashville’s Small Business Advisory Council.  Burcham is also on the Advisory Board for Credence Healthcare, CMC Services, IMI Healthcare, Onlife Health and PharmMD.</p>\n\n<p>Michael served as President of ParadigmHealth, a Specialty Care &amp; Disease Management Firm from 2000-2007.  ParadigmHealth was sold to Inverness Medical Innovations in December, 2007. Prior to ParadigmHealth, Michael was President of Theraphysics, a venture-backed, specialty rehabilitation firm he founded in 1992. Theraphysics was acquired by Beverly Enterprises in 1998. Prior to Theraphysics, Burcham worked for HCA as Vice President of Managed Care for Centennial Medical Center.</p>\n\n<p>In addition to his work in the healthcare industry, Burcham teaches Healthcare Innovation and Entrepreneurship in the Owen Graduate School of Management at Vanderbilt University.  He is also the Faculty Director and creative leader behind Vanderbilt’s Summer Business Institute, an intensive immersion in business designed exclusively for undergraduates and recent graduates in all majors. He is also a strategic advisor to a variety of healthcare firms and venture funds involved in healthcare start-ups.</p>\n\n<p>Michael received his undergraduate degree in Physical Therapy from the University of Mississippi Medical Center and his Masters Degree in Business Administration from Belmont University, Nashville, Tennessee. He completed his Doctoral Degree in Health Administration from the Medical University of South Carolina.</p>\n\n<p>Michael has over 25 years experience in healthcare and is a frequent National speaker on strategy and entrepreneurial thinking.  He resides in Brentwood, TN.</p>","image":null,"degrees":[{"degree_type":"Doctorate in Health Administration","subject":"Healthcare","institution":"Medical University of South Carolina","graduated_year":2003,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}