{"first_name":"Michael","last_name":"Shariff","permalink":"michael-shariff","crunchbase_url":"http://www.crunchbase.com/person/michael-shariff","homepage_url":"http://www.inventacapital.com","birthplace":"Moscow, Russia","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1969,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jul 28 22:59:16 UTC 2011","updated_at":"Mon Aug 01 18:27:42 UTC 2011","overview":"<p>Michael Shariff is a founder of Inventa Capital Group.  Michael Shariff is US and Canadian Patent attorney with unique experience in all spheres of patent prosecution and M&amp;A work. Mr. Shariff specializes in helping clients to bring their innovative products to market. As a Patent Attorney in Michigan, his work included filing and prosecuting patent applications, conducting prior art searches and investigations, assisting clients with design-around efforts, patent reexamination, and patent litigation support.</p>\n\n<p>Mr. Shariff was first Chief Patent Counsel of Ener1, Inc., a publicly traded (NASDAQ:HEV) energy technology company that develops compact, lithium-ion powered battery solutions for the transportation, grid energy storage and consumer markets and develops commercial fuel cell products through its EnerFuel subsidiary and nanotechnology-based materials and manufacturing processes through its NanoEner subsidiary. </p>\n\n<p>Inventa Capital is a unique tool created by Mr. Shariff after practicing with one of the major Midwest law firms and working in-house. Mr. Shariff discovered what services typical law firms don’t provide to their client and what prevents corporate researchers and engineers from thinking more creatively to come up with breakthrough technologies/inventions to control the market. Inventa Capital is a solution to these problems with unique combination of professional skills provided for businesses ready to turn innovations into capital and became leaders in the market.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}