{"first_name":"Michael","last_name":"Jackson","permalink":"michael-jackson-3","crunchbase_url":"http://www.crunchbase.com/person/michael-jackson-3","homepage_url":"http://www.theothermichaeljackson.com","birthplace":"UK","twitter_username":"the_other_mj","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1961,"born_month":12,"born_day":28,"tag_list":"","alias_list":null,"created_at":"Thu Aug 13 06:29:27 UTC 2009","updated_at":"Thu Aug 13 18:46:37 UTC 2009","overview":"<p>Michael Jackson is a professional speaker specializing in the subject of Change with a technology bias.  Speaking at over 120 conferences a year around the planet, Michael is highly sought after.</p>\n\n<p>Michael Jackson - Biography</p>\n\n<p>Michael Jackson has over 25 years of strategic business, marketing and communications experience. Born in Britain, then London educated and trained in business strategy development and communication he has worked personally with Richard Branson at Virgin Atlantic, as well as with the directors of many other global businesses such as Microsoft, Nike and HP.<br/>\nMichael later moved to South Africa to work with an international advertising agency, as that country became a democracy, where he specialised in developing strategies for companies wishing to establish a presence or expansion into Africa. \nHe still occasionally consults in this arena, yet today he is widely regarded as a full time professional speaker and writer and has become globally renowned and sought-after as a specialist on the subject of business change. \nMichael has carved out an enviable reputation as one of the best business-to-business speakers on the global professional circuit by speaking at around 120 conferences and seminars a year across Africa, Asia, Europe, the USA and the Middle East; to audiences ranging from factory workers to Heads of State.\nMichael is consistently rated by his clients, conference organisers and audiences alike as ‘simply outstanding’ for the way he creates and delivers powerful change messages – and he creates and weaves personalised individual company and industry business messages into all of his materials to suit every individual audience. \nMichael consistently and successfully predicts and details market performances, trends and consumer behaviour with unerring accuracy for companies, industries and markets around the world – while motivating his business audiences to perform to a better personal standard.</p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0005/6263/56263v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0005/6263/56263v2-max-250x250.jpg"],[[450,298],"assets/images/resized/0005/6263/56263v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}