{"first_name":"Michael A.","last_name":"Greeley","permalink":"michael-a-greenley","crunchbase_url":"http://www.crunchbase.com/person/michael-a-greenley","homepage_url":"","birthplace":"","twitter_username":"greels1","blog_url":"http://www.ontheflyingbridge.com","blog_feed_url":"http://ontheflyingbridge.wordpress.com/feed/","affiliation_name":"BlueTarp","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Mar 19 00:40:16 UTC 2008","updated_at":"Tue Jan 31 08:54:15 UTC 2012","overview":"<p>Michael Greenley is a General Partner at <a href=\"http://www.crunchbase.com/financial-organization/flybridge-capital-partners\" title=\"Flybridge Capital Partners\">Flybridge Capital Partners</a> whose principle investment focus area is the application of &#8220;Big Data&#8221; platforms across a number of industry verticals.  Addtionally, Michael is excited about the convergence of healthcare and information technologies, as well as robotics and human-machine interface technologies. </p>\n\n<p>Michael currently represents the firm on the boards of BlueTarp Financial, MicroCHIPs, PolyRemedy, Predictive Biosciences, SpringLeaf Therapeutics, T2 Biosystems, TARIS Biomedical, and VidSys and led the firm’s investment in lighterliving, Magen BioSciences and Protein Forest.</p>\n\n<p>Michael&#8217;s blog, On the Flying Bridge, can be found at www.ontheflyingbridge.com.  You can follow him on Twitter at www.twitter.com/greels1.</p>\n\n<p>Michael founded IDG Ventures Atlantic in 2001 before it transitioned to Flybridge Capital Partners in 2008.  Michael served on the board of International Data Group, the flagship Limited Partner for the IDG Ventures global network of funds.</p>\n\n<p>Previously, Michael was with Polaris Venture Partners, where he focused on both early-stage and later-stage financings for emerging growth companies. Before Polaris, Michael served as Senior Vice President and Founding Partner of GCC Investments, a $200 million private equity fund.  Prior to GCC Investments, Michael was a Vice President and one of the early professionals at Wasserstein Perella &amp; Co., an international merchant bank with a $1.0 billion private equity fund.  Additionally, Michael was a member of the Mergers and Acquisitions Department of Morgan Stanley &amp; Co. and worked in the Leveraged Buyout Group of Credit Suisse First Boston.</p>\n\n<p>In previous positions, Michael has served on the Boards of a number of public and private companies including FleetCor Technologies (NYSE: FLT), Global TeleSystems Group (NASDAQ: GTSG), El Sitio International (NASDAQ: LCTO), MotherNature.com (NASDAQ: MTHR), Crescent Communications (acquired by Clear Channel), and American Capital Access.</p>\n\n<p>Michael received a BA with honors in Chemistry from Williams College and an MBA from Harvard Business School.</p>\n\n<p>Source: <a href=\"http://www.flybridge.com\" title=\"Flybridge Capital Partners\" rel=\"nofollow\">Flybridge Capital Partners</a></p>","image":{"available_sizes":[[[132,150],"assets/images/resized/0001/6383/16383v1-max-150x150.jpg"],[[220,250],"assets/images/resized/0001/6383/16383v1-max-250x250.jpg"],[[257,291],"assets/images/resized/0001/6383/16383v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Board","firm":{"name":"BlueTarp","permalink":"bluetarp-2","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}