{"first_name":"Michael","last_name":"Bradley","permalink":"michael-bradley","crunchbase_url":"http://www.crunchbase.com/person/michael-bradley","homepage_url":"http://www.NeuLion.com","birthplace":"Ottawa, Ontario","twitter_username":"themikebradley","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Oct 11 17:15:06 UTC 2011","updated_at":"Tue Jan 03 18:32:34 UTC 2012","overview":"<p>Michael Bradley is a digital media executive with TV Everywhere / IPTV industry leader, NeuLion Inc. (TSE:NLN). </p>\n\n<p>Michael has been the Senior Vice President of Marketing at NeuLion since December 2008. NeuLion is a global leader in delivering and monetizing live and on demand video via the Internet through multi-platform services, from mobile and PC to set top box technology. Michael oversees the P&amp;L of various global IPTV networks and leads some corporate marketing activities for the entire organization supporting both B2B sales and B2C partner efforts.</p>\n\n<p>Prior to his current role, Michael served as the Head of Marketing of JumpTV (which later merged with NeuLion) where he developed and managed a wide range of marketing campaigns and technologies in growing subscription and pay-per-view offerings across 200 international TV channels. Further, he also led the company’s efforts in building the subscription business around FIFA soccer properties.</p>\n\n<p>Earlier, Michael was at eBay Canada where he helped launch the eBay site for French Canada along with an eBay community video portal. Michael also operated Cadre Collective, a creative consulting and marketing agency in that built web applications and online marketing and communication plans for federal government departments, national non-profit organizations, professional athlete networks, and corporate brands.</p>\n\n<p>Michael studied at the University of Waterloo (Faculty of Science), attended the Shad Valley program at the University of Calgary. He speaks English, understandable French and very broken Spanish.</p>\n\n<p>In terms of professional interests and odd factoids, Michael is fascinated by the continually evolving impact digital media consumption has on both the mainstreams of society and niche communities around the world. He has broken 8 bones in his body, has worked in rural communities in the Dominican Republic setting up IT networks, and is addicted to tech/business news, especially as it pertains to internet marketing, digital philanthropy, micro-donating/lending, crowd funding, OTT/IPTV/digital video and generally anything that makes the world a sunnier place.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://investing.businessweek.com/research/stocks/people/person.asp?personId=58091940&ticker=NEUL:US&previousCapId=20724368&previousTitle=NEULION%20INC","title":"Michael Bradley: Executive Profile & Biography"}],"web_presences":[{"external_url":"http://twitter.com/themikebradley","title":""},{"external_url":"http://ca.linkedin.com/in/themikebradley","title":""}]}