{"first_name":"Michael A.","last_name":"Henos","permalink":"michael-a-henos","crunchbase_url":"http://www.crunchbase.com/person/michael-a-henos","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Alliance Technology Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Jun 20 05:56:22 UTC 2009","updated_at":"Wed Feb 09 00:14:02 UTC 2011","overview":"<p>Mike Henos is the founder and Managing General Partner of Alliance Technology Ventures. He focuses on investments in biotechnology and personalized medicine. Mike has successfully invested in several private companies which have gone on to become public corporations. Among these investments are Adeza Biomedical, Amylin Pharmaceuticals, AtheroGenics, Inhibitex, Keravision, Ligand Pharmaceuticals, and RF Micro Devices. Mr. Henos is presently Chairman of the Board of AtheroGenics and Inhibitex, both based in Alpharetta, Georgia. He currently serves as a director of ATV portfolio companies Genoptix, GlycoMimetics, Neuronyx, Sensys Medical and ValuBond. He also is responsible for ATV&#8217;s investment in Aderis Pharmaceuticals.\nMike brings nearly nineteen years of accomplished venture capital experience. Prior to ATV, he was a General Partner with Aspen Venture Partners, where he was based in Menlo Park, CA. Prior to Aspen he was Vice President of 3i Ventures in Newport Beach, CA. From 1984 to 1986, he was a health care consultant with Ernst &amp; Young, specializing in venture financing of start-up medical technology companies. Prior to 1984, Mike served in a variety of management positions with Science Applications, the Revlon Healthcare Group and co-founded Pro Med Technologies, where he also served as its Chief Executive Officer.</p>\n\n<p>Mike earned a BS in economics and an MBA from the University of California at Los Angeles (UCLA).</p>","image":{"available_sizes":[[[117,150],"assets/images/resized/0004/9818/49818v1-max-150x150.jpg"],[[195,250],"assets/images/resized/0004/9818/49818v1-max-250x250.jpg"],[[224,286],"assets/images/resized/0004/9818/49818v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder and Principal","firm":{"name":"Alliance Technology Ventures","permalink":"alliance-technology-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,45],"assets/images/resized/0004/9817/49817v2-max-150x150.jpg"],[[250,75],"assets/images/resized/0004/9817/49817v2-max-250x250.jpg"],[[450,136],"assets/images/resized/0004/9817/49817v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}