{"first_name":"Michael","last_name":"Sherman","permalink":"michael-sherman","crunchbase_url":"http://www.crunchbase.com/person/michael-sherman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jun 21 06:04:52 UTC 2009","updated_at":"Sun Jun 21 06:05:09 UTC 2009","overview":"<p>Mike is an experienced scientist, manager, and company founder.  Dr. Sherman carried out and/or supervised basic and applied research for almost twenty years at Hoffmann-La Roche, and managed drug discovery in three therapeutic areas.  Since 1990, he has co-founded and served as the initial President of seven biotechnology companies, including five based at least in part on research conducted at Yale.  In addition to extensive experience in fundraising for his companies, Dr. Sherman has established numerous corporate and academic relationships and helped to structure and negotiate a number of mergers.  Mike has also served as consultant, advisor or director for a number of therapeutic, diagnostic, reagent, device, software, and investment companies, for academic institutions and for government agencies.  Dr. Sherman is currently President and co-founder of Affomix Corporation, an Elm Street Ventures start-up.  He is also Chairman of Iconic Therapeutics, Inc. and serves on the Board of Directors of OncoMEDx, Inc.  Following his undergraduate work at McGill University, Dr. Sherman received his PhD in molecular biology from the State University of New York and did postdoctoral studies at the University of Oxford.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"dsskjfmt","permalink":"elm-street-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,22],"assets/images/resized/0004/9931/49931v1-max-150x150.jpg"],[[250,38],"assets/images/resized/0004/9931/49931v1-max-250x250.jpg"],[[256,39],"assets/images/resized/0004/9931/49931v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}