{"first_name":"Michael","last_name":"I. Sherman, Ph.D.","permalink":"michael-i-sherman-ph-d","crunchbase_url":"http://www.crunchbase.com/person/michael-i-sherman-ph-d","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jun 21 05:51:09 UTC 2009","updated_at":"Sun Jun 21 05:51:28 UTC 2009","overview":"<p>Dr. Sherman served as President of Iconic Therapeutics since its inception in 2002 until April 2007, at which time he became Chairman of the Board.  Since 1999 he has also served as the Principal for Biotechnology and Pharmaceutical Consulting, LLC, a consulting service to pharmaceutical, biotechnology, device and medical software companies and universities. In 2006, Dr. Sherman became a Venture Partner at Elm Street Ventures of New Haven, CT. In addition to Iconic Therapeutics, Dr. Sherman has co-founded and served as President and/or CEO of six biotechnology companies formed to commercialize inventions by scientists at Yale University, The Johns Hopkins University and Memorial Sloan-Kettering Cancer Center: Pharmagenics, Inc., Prostagen, Inc., Molecular Staging, Inc., VaxInnate Corp., Protometrix Inc. and Affomix Corp. Prior to that he served as Director and Senior Director at the Roche Research Center, where he managed drug discovery efforts in Oncology, Virology, and Immunology. From 1971 to 1986, Dr. Sherman served as a member of the Department of Cell Biology of the Roche Institute of Molecular Biology, where he carried out and supervised research involving the molecular and cell biology of cancer and mammalian embryogenesis</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder, and Chairman","firm":{"name":"Iconic Therapeutics","permalink":"iconic-therapeutics","type_of_entity":"company","image":{"available_sizes":[[[150,66],"assets/images/resized/0004/9929/49929v2-max-150x150.jpg"],[[250,111],"assets/images/resized/0004/9929/49929v2-max-250x250.jpg"],[[253,113],"assets/images/resized/0004/9929/49929v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}