{"first_name":"Michael","last_name":"Polsky","permalink":"michael-polsky","crunchbase_url":"http://www.crunchbase.com/person/michael-polsky","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jun 17 12:57:00 UTC 2009","updated_at":"Wed Jun 17 12:59:25 UTC 2009","overview":"<p>Mr. Polsky has nearly 30 years of experience in the energy industry and is widely recognized as a pioneer and industry leader in cogeneration and independent power project development. He possesses a unique combination of engineering and business education, experience and expertise and has written and lectured regularly on industry topics. Mr. Polsky founded Invenergy LLC in 2001 and has led Invenergy’s rapid growth as a major player in the development, acquisition and ownership of wind and thermal generating facilities.</p>\n\n<p>Prior to forming Invenergy, Mr. Polsky founded SkyGen Energy LLC in 1991, where he built one of the most successful teams in the independent energy industry. He was responsible for establishing the strategic direction of the company and was personally involved in each of the company’s transactions. In less than 10 years, Mr. Polsky guided SkyGen’s efforts to develop a 12,000 MW portfolio of power generating projects. The value of this portfolio was realized in 2000 with the sale of SkyGen to Calpine Corporation. Prior to SkyGen, Mr. Polsky cofounded one of the first independent power producers, Indeck Energy Services, in 1985.</p>","image":null,"degrees":[{"degree_type":"MBA","subject":"","institution":"University of Chicago","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":" President and CEO","firm":{"name":"Invenergy","permalink":"invenergy","type_of_entity":"company","image":{"available_sizes":[[[150,37],"assets/images/resized/0004/3261/43261v1-max-150x150.png"],[[250,62],"assets/images/resized/0004/3261/43261v1-max-250x250.png"],[[282,71],"assets/images/resized/0004/3261/43261v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}