{"first_name":"Michael","last_name":"Clauss","permalink":"michael-clauss","crunchbase_url":"http://www.crunchbase.com/person/michael-clauss","homepage_url":"http://www.mindfusionmarketing.com/main.php","birthplace":"Illinois","twitter_username":"mjc1","blog_url":"http://nontourage.posterous.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1966,"born_month":null,"born_day":null,"tag_list":"mjc","alias_list":null,"created_at":"Sat Apr 24 17:13:05 UTC 2010","updated_at":"Mon Apr 26 05:46:06 UTC 2010","overview":"<p>michael clauss is Ex-MSFT, Ex- AMZN, Serial entrepreneur, product developer</p>\n\n<p>Michael has been building marketing and business development groups for companies for 20 years. He specializes in strategy and highly focused consumer oriented programs. Michael started his career in real estate and investment banking acquisitions consulting. At MCI Michael managed major account teams for new business services and marketing programs like Proof Positive and MCI Marketplace; one of the first online shopping venues. Michael then started Ostream which was a Remedy reseller, where he served as COO in the Seattle area. Ostream also had a division focused on software for remote ticketing and sales force automation. Ostream developed some of the earliest and most sophisticated remote wireless applications and the division and technologies were sold to Remedy.</p>\n\n<p>After the acquisition he spent several years at Microsoft working on the early marketing strategy for wireless and mobile devices within Windows CE. Michael also managed Microsoft&#8217;s three largest retail accounts (Comp USA, Circuit City and Best Buy) as well as large manufacturer relationships in this capacity. Combined with the windows negotiations these are some of the largest contracts in the software business.\nLater he was recruited away by Amazon.com where he managed All Product Search - which is responsible for 70% of Amazon.com&#8217;s revenue. Michael also helped acquire, build and run Amazon Anywhere for wireless shopping.</p>\n\n<p>Afterward, Michael served as VP of Marketing for Xiptel. Xiptel is a business oriented VOIP company. Since then he co-founded Splashlife and has also advised many Fortune 500 companies as well as startups (as well as starting his own) on strategy, social media, product development and marketing initiatives. Michael also serves on many corporate and non-profit boards as well as being a Partner at The Blink Tank and Mindfusion Marketing at www.mindfusionmarketing.com.</p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0008/4830/84830v2-max-150x150.jpg"],[[80,80],"assets/images/resized/0008/4830/84830v2-max-250x250.jpg"],[[80,80],"assets/images/resized/0008/4830/84830v2-max-450x450.jpg"]],"attribution":"<p>Michael Clauss</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://flavors.me/mjc","title":"MJC"}]}