{"first_name":"Michael A.","last_name":"DiPiano","permalink":"michael-a-dipiano","crunchbase_url":"http://www.crunchbase.com/person/michael-a-dipiano","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"NewSpring Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 26 14:01:05 UTC 2008","updated_at":"Wed Feb 09 00:06:01 UTC 2011","overview":"<p>Mr. DiPiano is a General Partner of NewSpring Ventures and the Managing Partner of NewSpring Capital.  Prior to joining NewSpring Capital, Mr. DiPiano was a serial entrepreneur and investor.  He led or co-led the investment into six companies in the business services, healthcare and information technology industries.   During that time, he was affiliated with Safeguard Scientifics (NYSE:SFG) and their related Funds.   Prior to 1996, he spent six years as a division CEO and director of Chemical Leaman Corporation.   Mr. DiPiano started his career in 1980 with Baxter Healthcare Corporation (NYSE: BAX) where he held numerous positions culminating as Vice President responsible for Operations and Sales of the Industrial Scientific Products Division.   He currently serves on the boards of Femme Pharma; the Mid-Atlantic Capital Alliance, formerly known as the Greater Philadelphia Venture Group, which is a trade association representing over 80 Mid-Atlantic based private equity funds with approximately $12 billion under management, where he served as the 2005 program year Chairman; NutriSystem (NASDAQ: NTRI); Prescient Applied Intelligences (OTC BB: PPID); Bluenog; and the University City Science Center, where he sits on the investment committee.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0002/9662/29662v1-max-150x150.jpg"],[[120,180],"assets/images/resized/0002/9662/29662v1-max-250x250.jpg"],[[120,180],"assets/images/resized/0002/9662/29662v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"NewSpring Ventures","permalink":"newspring-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[106,59],"assets/images/resized/0002/9660/29660v1-max-150x150.jpg"],[[106,59],"assets/images/resized/0002/9660/29660v1-max-250x250.jpg"],[[106,59],"assets/images/resized/0002/9660/29660v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}