{"first_name":"Michael","last_name":"Shultz","permalink":"michael-shultz","crunchbase_url":"http://www.crunchbase.com/person/michael-shultz","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Infoglide Software Corporation","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 15 20:16:59 UTC 2008","updated_at":"Wed Aug 06 20:53:07 UTC 2008","overview":"<p>As president and CEO, Michael Shultz brings to Infoglide Software a wealth of experience in growing and leading successful technology companies. Mr. Shultz provides strategic and operational leadership for Infoglide Software&#8217;s corporate growth and development and is responsible for all aspects of the business, including future acquisition and financing opportunities.</p>\n\n<p>Since joining Infoglide Software in 2001, Mr. Shultz has made critical changes to the company&#8217;s product and market direction, organization, and financials. Under Mr. Shultz&#8217;s direction, Infoglide Software&#8217;s revenues grew by over 800% from 2001 to 2006, leading Infoglide Software to be named to the Inc. 500 in 2004 and 2006 and to Deloitte&#8217;s Technology Fast 500 and Software Magazine&#8217;s Software 500 in 2004, 2005, and 2006.</p>\n\n<p>A seasoned technology executive with over 30 years of multinational experience, Mr. Shultz&#8217;s background includes sales management, marketing, software development, finance, research and development, general management, and mergers and acquisitions. He is a veteran of change management and has extensive experience with financing through traditional and non-traditional methods.</p>\n\n<p>Prior to Infoglide Software, Mr. Shultz was founder, president, and CEO of QuestLink Technology, a leader in business-to-business e-commerce for electronics professionals. While with QuestLink, Mr. Shultz structured and negotiated $26.5 million in equity financing from individuals, venture capital firms, and strategic partners with increasing valuations for existing shareholders. In 1999, he negotiated the acquisition of a major competitor and led a successful integration of employees, systems, customers, and revenue stream within 180 days from close of the acquisition. Mr. Shultz negotiated the merger of QuestLink Technology into eChips, Inc. in December 2000 providing a successful financial event for the shareholders of QuestLink.</p>\n\n<p>Before QuestLink, Mr. Shultz was president and CEO of CMG Computer Products, a manufacturer of notebook peripherals and software. Previously, Mr. Shultz was president and CEO of Specialty Development Corporation, a developer and marketer of technology products including high performance integrated circuits, hardware, and software applications. He has also held executive sales and marketing management positions at Philips Semiconductor and Wyle Electronics and was part of the founding management team at both Cirrus Logic and Integrated Device Technology, setting the sales strategy that contributed to successful IPOs for both companies.</p>\n\n<p>Mr. Shultz currently serves on the University of Texas at Austin Science, Technology, and Society advisory board. He was also an AeA Texas board member and chair. Mr. Shultz served as a member of the Texas Leadership Council of the World Congress on Information Technology (WCIT) 2006 and as a judge for the University of Texas at Austin Global Moot Corp® 2006 Competition. His previous board positions include eeParts.com, the AeA national board, BancFirst of Texas, and Wired for Kids.</p>\n\n<p>In June 2004, Mr. Shultz was awarded the Ernst &amp; Young 2004™ Entrepreneur Of The Year Award in the Realizing Business Potential category. Mr. Shultz accepted the Greater Austin Chamber of Commerce&#8217;s 2002 Business Award for Innovative Business. He is also a frequent guest speaker at the University of Texas at Austin.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President & Chief Executive Officer","firm":{"name":"Infoglide Software Corporation","permalink":"infoglide-software-corporation","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0002/2138/22138v2-max-150x150.png"],[[187,43],"assets/images/resized/0002/2138/22138v2-max-250x250.png"],[[187,43],"assets/images/resized/0002/2138/22138v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}