{"first_name":"Michael","last_name":"Fertik","permalink":"michael-fertik","crunchbase_url":"http://www.crunchbase.com/person/michael-fertik","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Reputation.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Nov 07 23:18:38 UTC 2008","updated_at":"Wed Oct 10 14:59:07 UTC 2012","overview":"<p>Digital privacy pioneer Michael Fertik dedicates his career to developing products and services that keep company and individual identities safe on the Internet. As Chief Executive Officer of the online reputation management company, Reputation.com, Michael Fertik offers an array of products geared toward protecting people’s privacy and promoting safe Internet activity. Michael Fertik founded Reputation.com in 2006 with Chief Operating Officer Owen Tripp.</p>\n\n<p>Reputation.com offers multiple free and paid products aimed at helping individuals protect their privacy and reputations online. Reputation.com&#8217;s core products include MyPrivacy, MyReputation, MyReputationDiscovery, and ReputationDefender. Reputation.com&#8217;s free products include the Facebook applications, uProtect.it and PrivacyDefender.</p>\n\n<p>Beyond running his company, Michael Fertik remains concerned about Internet privacy and serves on the Advisory Board for the Internet Keep Safe Coalition (iKeepSafe). He also holds a position on the World Economic Forum Global Agenda Council on Internet Security. Michael Fertik is also the author of the book, Wild West 2.0, which he co-authored with attorney and privacy expert David Thompson. In Wild West 2.0, Michael Fertik explains the changing landscape of Internet privacy and suggests ways to maintain an Internet presence while avoiding common pitfalls.</p>\n\n<p>Prior to establishing Reputation.com, Michael Fertik pioneered TruExchange, which he launched while still studying at Harvard College. Michael Fertik earned his Bachelor’s degree in Literature and History from Harvard College and his Juris Doctor from Harvard Law School. When he is not working, Michael Fertik enjoys reading, running, and sailing.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0014/1511/141511v1-max-150x150.jpg"],[[170,170],"assets/images/resized/0014/1511/141511v1-max-250x250.jpg"],[[170,170],"assets/images/resized/0014/1511/141511v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"CEO, Founder","firm":{"name":"Reputation.com","permalink":"reputation-com","type_of_entity":"company","image":{"available_sizes":[[[150,85],"assets/images/resized/0002/4607/24607v6-max-150x150.jpg"],[[250,141],"assets/images/resized/0002/4607/24607v6-max-250x250.jpg"],[[450,255],"assets/images/resized/0002/4607/24607v6-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.honestly.com/profile?id=463486","title":"Honestly.com Reviews"}]}