{"first_name":"Michael","last_name":"Bebel","permalink":"michael-bebel","crunchbase_url":"http://www.crunchbase.com/person/michael-bebel","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Ruckus","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Aug 22 09:19:55 UTC 2007","updated_at":"Wed Jan 14 03:43:53 UTC 2009","overview":"<p>Michael J. Bebel, Entrepreneur and Media Executive joined Ruckus Network, Inc. in July of 2006 as president and CEO. Ruckus is a college oriented online media service that has experienced significant growth over the last year. Prior to that Michael was president and CEO of Mashboxx, LLC. Under his leadership, Mashboxx was endeavoring to launch a legitimate, 3rd generation peer-to-peer network that was attempting to revolutionize the model for content distribution on the internet. Prior to that, Bebel was President and Chief Operating Officer of Roxio’s Napster Division, a position that he held from May 2003 until early 2004. As COO, Bebel was responsible for overseeing the operations of the company&#8217;s on-line music division including the launch of the new, legitimate Napster 2.0 service in October of 2003. Bebel took on this position after serving as president and CEO of pressplay where he led the effort to establish one of the first successful legitimate online music services. Before joining pressplay, Bebel was executive vice president of the eLabs division of Universal Music Group (UMG), where he played a leading role in the formation of the pressplay joint venture between UMG and Sony Music Enterprises. During the late 1990s, Bebel was senior vice president for strategic planning and business development of Universal Music Group’s eCAT division, where he helped shape the landscape of various online initiatives and negotiated key joint ventures and strategic alliances. Bebel was brought to Universal Studios, Inc. from its then-parent company, Seagram, in January 1996 and served in as a corporate senior vice president focused on improving operations across the studio, theme park and music divisions. From 1991 to 1995, he held several financial management and business development positions at the Seagram Beverage Company in New York. Bebel holds an MBA in management and economics from the State University of New York at Binghamton and a Bachelor of Science degree in accounting. He currently splits his time between New York City and Herndon, Virginia.</p>","image":{"available_sizes":[[[110,50],"assets/images/resized/0003/3767/33767v1-max-150x150.jpg"],[[110,50],"assets/images/resized/0003/3767/33767v1-max-250x250.jpg"],[[110,50],"assets/images/resized/0003/3767/33767v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":null,"title":"Board","firm":{"name":"Ruckus","permalink":"ruckus","type_of_entity":"company","image":{"available_sizes":[[[150,29],"assets/images/resized/0003/3765/33765v2-max-150x150.png"],[[186,37],"assets/images/resized/0003/3765/33765v2-max-250x250.png"],[[186,37],"assets/images/resized/0003/3765/33765v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}