{"first_name":"Mickie","last_name":"Rosen","permalink":"mickie-rosen-2","crunchbase_url":"http://www.crunchbase.com/person/mickie-rosen-2","homepage_url":"http://fusecapital.com/investment-team/mickie-rosen","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Fuse Capital","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Sep 14 03:35:39 UTC 2009","updated_at":"Mon Sep 14 12:39:17 UTC 2009","overview":"<p>Mickie Rosen is a partner at Fuse Capital. </p>\n\n<p>Mickie has over 20 years of operating, strategy and investing experience. For the past dozen years, she has been at the intersection of media and technology, in both large companies such as News Corporation and The Walt Disney Company and in small, early stage start-ups.</p>\n\n<p>Prior to joining the firm, she was the head of entertainment for Fox Interactive Media where she was responsible for properties such as AmericanIdol.com, Rotten Tomatoes and the entertainment channels of MySpace. Mickie also led content acquisition across the Company, and was a lead in envisioning, structuring and negotiating Hulu, the premier video joint venture between News Corp and NBC Universal.</p>\n\n<p>Prior to Fox Interactive Media, Mickie was the head of product development, marketing and public relations for Fandango, where she helped lead the company from an early-stage start-up to profitability as it became a leader in its space (acquired by Comcast). Mickie was also a senior executive with an e-learning start-up, an Idealab! consumer robotics company and Disney&#8217;s Corporate Alliances group, where she negotiated deals and managed Disney&#8217;s top global partners such as Coca-Cola, American Express and AT&amp;T.</p>\n\n<p>Mickie built the foundation of her career with McKinsey &amp; Company, where she spent seven years consulting with senior management on strategy, operational and organizational issues across a number of industries, including media and technology.</p>\n\n<p>Mickie has an MBA from Harvard Business School, and a B.A. in Economics from UC San Diego, and is based in Los Angeles.</p>","image":null,"degrees":[{"degree_type":"M.B.A.","subject":"Business","institution":"Harvard Business School","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"B.A.","subject":"Economics","institution":"UC San Diego","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.linkedin.com/ppl/webprofile?action=vmi&id=16578054&pvs=pp&authToken=G71p&authType=name&trk=ppro_viewmore&lnk=vw_pprofile","title":"LinkedIn Profile"}],"web_presences":[]}