{"first_name":"Mick","last_name":"Say","permalink":"mick-say","crunchbase_url":"http://www.crunchbase.com/person/mick-say","homepage_url":"http://www.onlinemarketingacademy.uk.com/","birthplace":"Brotton","twitter_username":"micksay","blog_url":"http://www.onlinemarketingacademy.uk.com/","blog_feed_url":"http://www.onlinemarketingacademy.uk.com/","affiliation_name":"Unaffiliated","born_year":1961,"born_month":4,"born_day":10,"tag_list":"mick-say, digital-marketing, online-business-development","alias_list":null,"created_at":"Mon Jan 02 17:58:10 UTC 2012","updated_at":"Tue Jan 03 13:34:58 UTC 2012","overview":"<p>Mick Say is an Online Business Development Consultant at the Online Marketing Academy. The Online Marketing Academy provides online business development consultative services, resources and training for businesses in the UK, including website and ecommerce development.</p>\n\n<p>Online Business Development Strategist</p>\n\n<p>Mick Say takes all the mystery out of online marketing. As a trainer, speaker and consultant, he cuts through the smoke and mirrors to bring the most advanced web strategies out into the open.</p>\n\n<p>In practice, that means transforming your company’s fortunes online: using SEO, Social Media and advanced web development to attract and engage with highly qualified, motivated prospects – a vital part of any acquisition or retention strategy.</p>\n\n<p>Mick’s love of business and technology goes back a long way. Since the day he left school and started selling vacuum cleaners door to door, he’s been fascinated by people and their relationships with gadgets.</p>\n\n<p>As he moved into senior sales roles in the world of building supplies, he kept a close eye on technology and the emergence of the web. It became a hobby, a way of business, then a way of life, as he finally launched his consultancy, The Online Marketing Academy.</p>\n\n<p>Today, with a pedigree of 30+ years, Mick never dreams of retirement! When he’s not consulting with CEOs, start-ups and inbetweeners,  he’s running training events or speaking on the UK business circuit – exposing the latest advances in online marketing, inbound marketing and the social web.</p>\n\n<p>Offline, Mick enjoys food, books, travel and family time with his two children Mark and Victoria.</p>\n\n<p>You can find out more about Mick by visiting The Online Marketing Academy</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0016/8474/168474v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0016/8474/168474v2-max-250x250.jpg"],[[450,450],"assets/images/resized/0016/8474/168474v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://twitter.com/#!/micksay","title":"@Micksay"},{"external_url":"http://www.facebook.com/thedigitalcoach","title":"Facebook "},{"external_url":"http://www.facebook.com/onlinemarketingacademy","title":"Facebook Page"},{"external_url":"http://www.linkedin.com/in/micksay","title":"LinkedIn"}]}