{"first_name":"Mihir","last_name":"Shah","permalink":"mihir-shah-4","crunchbase_url":"http://www.crunchbase.com/person/mihir-shah-4","homepage_url":"http://perfectvips.com","birthplace":"","twitter_username":"","blog_url":"http://verificationip.wordpress.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"sales, marketing, business-development, verification-ip, design-ip, soc, asic, fpga, semiconductor, vlsi","alias_list":null,"created_at":"Tue Nov 22 06:06:14 UTC 2011","updated_at":"Tue Nov 22 20:19:45 UTC 2011","overview":"<p>Mihir Shah is  Results driven techno-commercial professional with over 5.9 years of extensive experience in Pre &amp; Post Sales, Business Development and Technical Operations  in the semiconductor(EDA Software and Hardware and Verification IP) industry.He is an excellent performer with consultative sales style, negotiation skills, exceptional solving abilities and keen client assessment aptitude. Deft at tapping prospects, analyzing their requirements, rendering technical guidance to the clients and negotiate (commercially) for the orders.</p>\n\n<p>He has capability to Identify and develop diverse client base using advanced sales techniques and extensive knowledge of Soc industry in India, USA, Israel, UK, Japan, China,Taiwan,korea.He has wide Understanding of Storage application,peripheral interconnects and on chip bus interface Verification IP solutions and VIP components</p>\n\n<p>He  Possess an in-depth understanding of several cutting-edge EDA tools for modeling and Simulation, EM and Antenna Design, IC design; XILINX and ALTERA FPGA and CPLD based protoboards and embedded kits and their commercial applications.He has exposure to international market while working on-site in collaboration with channel partners in Thailand and malaysia</p>\n\n<p>He is resourceful in serving as key player for sustaining efforts for sales/ lead generation, as well as for resolving operational issues and clients’ concerns satisfactorily.An impressive communicator with honed interpersonal, team building, negotiation, presentation, convincing and analytical skills.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0016/3434/163434v2-max-150x150.jpg"],[[171,171],"assets/images/resized/0016/3434/163434v2-max-250x250.jpg"],[[171,171],"assets/images/resized/0016/3434/163434v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}