{"first_name":"Mikah","last_name":"Sellers","permalink":"mikah-sellers","crunchbase_url":"http://www.crunchbase.com/person/mikah-sellers","homepage_url":"http://vendorcentric.com","birthplace":"","twitter_username":"VendorCentric","blog_url":"http://vendorcentric.com/our-insights/blog","blog_feed_url":"http://vendorcentric.com/blog-atom","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"vendor-management, vendor-relationship-management, vendor-risk-management","alias_list":null,"created_at":"Mon Oct 03 21:04:48 UTC 2011","updated_at":"Sat Nov 19 05:41:12 UTC 2011","overview":"<p>Vendor Centric is where businesses turn when they want more from their vendors. We help clients across all sectors produce extraordinary results by transforming the way in which they design, leverage and manage their vendor relationships.</p>\n\n<p>About Vendor Centric</p>\n\n<p>What We Believe\nOrganizations of all types and sizes can significantly increase their ability to drive growth, control costs, and mitigate risk by being more strategic about their vendor relationships and by taking a more process-driven approach to how they manage those relationships.</p>\n\n<p>What We Do\nWe work with private and public-sector organizations to implement strategies, processes, and systems that manage and improve every aspect of the vendor relationship. </p>\n\n<p>Where We Are\nWe launched the company in July of 2011 and have successfully signed services agreements with three new clients (as of Oct 1, 2011). We have joined the Microsoft BizSpark Partner Program and are in the process of developing our first Microsoft plug-in that will enable mid-market organizations to more efficiently manage their vendor relationships. </p>\n\n<p>You can learn more about our company, services and to-be released software products at www.vendorcentric.com.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/company/vendor-centric","title":"LinkedIn"},{"external_url":"http://twitter.com/vendorcentric","title":"Twitter"}]}