{"first_name":"MIKE","last_name":"FOSTER","permalink":"mike-foster","crunchbase_url":"http://www.crunchbase.com/person/mike-foster","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 28 13:22:37 UTC 2008","updated_at":"Fri Nov 28 13:23:48 UTC 2008","overview":"<p>Mike Foster has held key senior financial management and planning roles over the past thirty years in four successful Silicon Valley companies. Mike is particularly good at modeling financial business issues quickly and in depth so that decisions can be made with confidence. He has proven to be highly effective as a key advisor and partner to entrepreneurial leaders, especially technologist founders.</p>\n\n<p>In 2001 and 2002, Mike was Vice President, Finance at JDS Uniphase, leading the finance and planning for JDS Uniphase&#8217;s restructuring program and helping to guide JDS Uniphase&#8217;s investments in its industry consolidation.</p>\n\n<p>From 1998 to 2001, Mike was Chief Financial Officer of SDL, Inc. During his tenure, SDL&#8217;s executive team was extraordinarily successful in managing rapid growth; revenue grew by a factor of eight, operating margins tripled, operating cash flow increased by 18X and the stock price soared by 80X. Mike also led the integration program of SDL, Inc. into JDS Uniphase.</p>\n\n<p>From 1979 to 1998, Mike led the treasury, planning and corporate development functions at California Microwave, which grew by a factor of over ten. During his nineteen years at CMI, Mike completed just about every type of financial transaction needed by a small or medium size company. He structured CMI&#8217;s start-up investments in several ventures and served as the principal advisor to the founders, including two subsidiaries which grew to represent the majority of CMI&#8217;s market value in the 1990s.</p>\n\n<p>Mike holds two degrees from Stanford, an AB in Economics (1968) and an MBA (1973).</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Vice President","firm":{"name":"SDL Ventures","permalink":"sdl-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[144,128],"assets/images/resized/0002/9959/29959v1-max-150x150.jpg"],[[144,128],"assets/images/resized/0002/9959/29959v1-max-250x250.jpg"],[[144,128],"assets/images/resized/0002/9959/29959v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}