{"first_name":"Mike","last_name":"Frain","permalink":"mike-frain","crunchbase_url":"http://www.crunchbase.com/person/mike-frain","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"CENTRA","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jul 24 15:12:06 UTC 2009","updated_at":"Fri Sep 17 21:26:18 UTC 2010","overview":"<p>Mike was appointed as Chief Executive of CENTRA in 2005</p>\n\n<p>He started his career as a teacher of English as a Foreign Language and at the age of 27 was appointed Principal of a private Vocational Training College for international students. </p>\n\n<p>He then spent three years in Singapore, supporjkfjkfkting and training new lecturers in language, communication and teaching skills, at a newly-opened Polytechnic. On his return to England, he was offered the post of Director of Lansdowne College in London - a unique Anglo-American higher education institution offering British and American university business qualifications. </p>\n\n<p>In 1989, Mike took up the post of Marketing Manager at Edge Hill University (then College of HE) and subsequently became Managing Director of Edge Hill Enterprises, which looked after all Edge Hill&#8217;s funded projects, international projects / partnerships and all income generating activities - including establishing an American MBA supported by Merseyside European funding, a media and arts training centre in Liverpool and a Cyber Centre in West Lancashire and delivering projects in several overseas countries. </p>\n\n<p>His most recent post was as Business Development Manager for Nord Anglia plc, where he had responsibility for bid-management and developing and managing post-16 projects - including e-learning, vocational training, child care training, all military contracts and LSC / European funding - most notably managing the bid and establishing the highly successful Army Foundation College at Harrogate. </p>","image":{"available_sizes":[[[100,108],"assets/images/resized/0005/4185/54185v3-max-150x150.jpg"],[[100,108],"assets/images/resized/0005/4185/54185v3-max-250x250.jpg"],[[100,108],"assets/images/resized/0005/4185/54185v3-max-450x450.jpg"]],"attribution":"<p>Scott Beale / <a href=\"http://www.laughingsquid.com\" title=\"Laughing Squid\" rel=\"nofollow\">Laughing Squid</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"CENTRA","permalink":"centra","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0005/3161/53161v1-max-150x150.jpg"],[[250,250],"assets/images/resized/0005/3161/53161v1-max-250x250.jpg"],[[450,450],"assets/images/resized/0005/3161/53161v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}