{"first_name":"Mike","last_name":"Farmwald","permalink":"mike-farmwald-2","crunchbase_url":"http://www.crunchbase.com/person/mike-farmwald-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Dec 01 07:02:54 UTC 2008","updated_at":"Mon Dec 01 07:05:24 UTC 2008","overview":"<p>Mike Farmwald is a serial entrepreneur with one of the most successful track records in Silicon Valley. Known for his unique combination of computer engineering skill and market vision, Mike has founded six companies to date, five of which were financed in part by Benchmark Capital, where he is a Venture Partner.</p>\n\n<p>Mike is probably best known for cofounding Rambus Inc., a developer of high-bandwidth interfaces for memories and other chips. After founding the company in 1990, Mike served as Vice President and Chief Scientist, overseeing the development of several key innovations, including the 1992 introduction of the world&#8217;s first 4 Mbit RDRAM.</p>\n\n<p>In 1993, Mike cofounded Chromatic Research, a privately held developer of media processors for the PC industry. Mike served on the board of Chromatic Research until the company was acquired by ATI Technologies in November 1998. In 1996, Mike cofounded Epigram, creator of advanced semiconductor home networking technology, which helped revolutionize high-speed networking connectivity within the home. Epigram was acquired by Broadcom in April 1999. In late 1997, Mike cofounded Matrix Semiconductor, a pre-IPO start-up backed by Skymoon, Benchmark and Microsoft, among others.</p>\n\n<p>Prior to his success at Rambus, Mike founded FTL in 1986. FTL, an ECL supercomputing company, merged with MIPS in the same year. At MIPS, Mike served as Chief Scientist for High End Systems. Following his experience at MIPS, Mike was an Associate Professor of Electrical and Computer Engineering at the University of Illinois.</p>\n\n<p>Mike holds a BS degree in Mathematics from Purdue University and a Ph.D. in Computer Science from Stanford University. He currently sits on the boards of Rambus (Nasdaq: RMBS), Matrix Semiconductor, and Circumnav Networks.</p>","image":{"available_sizes":[[[93,150],"assets/images/resized/0003/0374/30374v1-max-150x150.jpg"],[[156,250],"assets/images/resized/0003/0374/30374v1-max-250x250.jpg"],[[281,450],"assets/images/resized/0003/0374/30374v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"SkyMoon Ventures","permalink":"skymoon-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[127,150],"assets/images/resized/0003/0373/30373v1-max-150x150.jpg"],[[129,152],"assets/images/resized/0003/0373/30373v1-max-250x250.jpg"],[[129,152],"assets/images/resized/0003/0373/30373v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}