{"first_name":"Mike","last_name":"Guthrie","permalink":"mike-guthrie","crunchbase_url":"http://www.crunchbase.com/person/mike-guthrie","homepage_url":"http://www.sharespost.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"mike-guthrie, sharespost, private-companies, secondary-liquidity, wall-street","alias_list":null,"created_at":"Thu May 12 00:44:05 UTC 2011","updated_at":"Fri Aug 24 19:50:34 UTC 2012","overview":"<p>Mike Guthrie used to work for SharesPost as senior vice president in 2011 to help build out a liquid capital market for private companies seeking to raise primary capital and provide secondary liquidity for existing shareholders. He has been advising and investing in private and public technology companies for over twenty years. Mike started his career on Wall Street at Montgomery Securities and Credit Suisse First Boston where he helped companies such as JDS Uniphase, Broadcom, RF Micro Devices, OpenWave and SGI raise billions of dollars in private and public capital.  After leaving banking, Mike ran a private investment fund for mutual fund giant J&amp;W Seligman and in 2000 was a co-founding partner of TPG Ventures, the venture capital arm of TPG Capital. Mike holds a BA in Economics from the University of Virginia and an MBA from the Stanford Graduate School of Business.</p>\n\n<p>Mike has been a commentator on technology investing for publications such as the Wall Street Journal, the Financial Times and Bloomberg.  He has also been a speaker at industry events such as the Dow Jones Private Equity Analyst and the Southeast Venture Conference.</p>","image":null,"degrees":[{"degree_type":"B.A.","subject":"Economics","institution":"University of Virginia","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"Stanford Graduate School of Business","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/michael-guthrie/13/b41/15","title":"Michael Guthrie,  SVP, Business Development at SharesPost "}]}