{"first_name":"Mike","last_name":"Sorabella","permalink":"mike-sorabella","crunchbase_url":"http://www.crunchbase.com/person/mike-sorabella","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 28 23:17:28 UTC 2011","updated_at":"Tue Jun 28 23:20:01 UTC 2011","overview":"<p>As CEO of Shoebuy.com, Mike Sorabella is responsible for the strategic and operational oversight of all of the Shoebuy brands, including Bagsbuy.com and Outletbuy.com. Mr. Sorabella served as the Chief Financial Officer for Shoebuy for six years.</p>\n\n<p>Shoebuy.com is one of the largest retailers on the Internet focused on all categories of footwear and related apparel, offering consumers over 1 million products and reaching over 8 million unique users each month. Founded in 1999, the company was acquired by IAC in 2006.</p>\n\n<p>Mr. Sorabella served for six years as the Chief Financial Officer of Shoebuy.com and successfully led the due diligence, sale process and integration of the transaction with IAC in 2006.  Mr. Sorabella was responsible for financial planning and reporting, accounting, human resources, benefits administration, warehouse operations, facilities and vendor selection\\relationships and had management responsibility for greater than 40% of total company headcount.  He also held the positions of Chief Financial Officer of Shoebuy.com Europe Ltd., the company&#8217;s United Kingdom subsidiary, and Chief Financial Officer of Floraflora.com, an e-commerce retailer of flowers and gifts that was co-founded and majority owned by Shoebuy.com.</p>\n\n<p>Prior to joining Shoebuy.com, Mr. Sorabella was Group Manager within FleetBoston Financial&#8217;s derivatives business.  Mr. Sorabella also previously served as Chief Financial Officer and Chief Operating Officer at Bonaire Software Solutions, LLC.  Preceding his work at Bonaire Software, Mr. Sorabella was Director of European Treasury for BankBoston. </p>\n\n<p>Mr. Sorabella received a B.A. in Economics from Boston College.</p>","image":null,"degrees":[{"degree_type":"B.A.","subject":"Economics","institution":"Boston College","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Shoebuy","permalink":"shoebuy","type_of_entity":"company","image":{"available_sizes":[[[150,43],"assets/images/resized/0006/7624/67624v1-max-150x150.png"],[[156,45],"assets/images/resized/0006/7624/67624v1-max-250x250.png"],[[156,45],"assets/images/resized/0006/7624/67624v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}