{"first_name":"Mike","last_name":"Lazaridis","permalink":"mike-lazaridis","crunchbase_url":"http://www.crunchbase.com/person/mike-lazaridis","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon May 12 03:24:51 UTC 2008","updated_at":"Tue Nov 16 20:45:02 UTC 2010","overview":"<p>Mr. Lazaridis is known in the global wireless community as a visionary, innovator, and engineer of extraordinary talent. He traces his passion for his work to his hometown of Windsor, Ontario where his love of science and fascination with electronics were nurtured in supportive family and school environments.</p>\n\n<p>As President and Co-CEO of Research In Motion (RIM), a company Mr. Lazaridis founded while a student at UW, he is responsible for product strategy, research and development, product development, and manufacturing. Mr. Lazaridis is also a leader in his community and a passionate advocate for education and scientific research. Mr. Lazaridis supports his community and country through generous philanthropic gifts made possible by his success in business.</p>\n\n<p>He has donated $100 million to UW to help establish an Institute for Quantum Computing. Mr. Lazaridis also personally invested $150 million in the Perimeter Institute for Theoretical Physics (PI) and, through his leadership and tireless effort, has generated more than $100 million in additional private and public sector funding for this world leading centre of scientific excellence. PI is home to a growing cluster of international scientists who are pushing the limits of our fundamental understanding of space, time, matter and information. Since opening in 2001, the institute has attracted the attention of the world’s scientific research and educational outreach community. The independent centre is now associated with over 30 Canadian universities and a growing number of institutes world-wide.</p>\n\n<p>Mr. Lazaridis holds honorary doctoral degrees from the University of Waterloo (Engineering), McMaster University, University of Windsor and Université Laval. He has been awarded Canada&#8217;s most prestigious innovation prize - The Ernest C. Manning Principal Award and was listed on the TIME 100 List of Most Influential People. Mr. Lazaridis is a Fellow of the Royal Society of Canada, was named to the Order of Ontario and is an Officer of the Order of Canada.</p>","image":{"available_sizes":[[[107,109],"assets/images/resized/0011/0501/110501v1-max-150x150.png"],[[107,109],"assets/images/resized/0011/0501/110501v1-max-250x250.png"],[[107,109],"assets/images/resized/0011/0501/110501v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder & Co-CEO","firm":{"name":"Research In Motion","permalink":"research-in-motion","type_of_entity":"company","image":{"available_sizes":[[[150,59],"assets/images/resized/0001/8346/18346v1-max-150x150.png"],[[199,79],"assets/images/resized/0001/8346/18346v1-max-250x250.png"],[[199,79],"assets/images/resized/0001/8346/18346v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}