{"first_name":"Mike","last_name":"Sommer","permalink":"mike-sommer","crunchbase_url":"http://www.crunchbase.com/person/mike-sommer","homepage_url":"http://www.DigitalBackpack.co","birthplace":"Vancouver","twitter_username":"DigiBackpack","blog_url":"http://www.DigitalBackpack.co/blog","blog_feed_url":"","affiliation_name":"Digital Backpack","born_year":null,"born_month":null,"born_day":null,"tag_list":"mike-sommer, digital-backpack, mobile-application-management, vancouver, cio, international-relations","alias_list":null,"created_at":"Wed Jun 13 16:06:39 UTC 2012","updated_at":"Sun Jun 17 13:59:32 UTC 2012","overview":"<p>Mike is CEO of Digital Backpack and co-founder of Pacific Online Learning. </p>\n\n<p>Digital Backpack is a private content distribution and syncing platform for tablets and smartphones. It allows companies and schools to deliver and retrieve content (apps, video, pdf, audio, ebooks, online courses) to end users without having to go through a 3rd party app store.</p>\n\n<p>Pacific Online Learning is a Software as a Service company that provides the technology backbone for eLearning. </p>\n\n<p>Pacific Online Learning offer a web based, interactive training platform that makes training and education accessible to anyone at anytime in a secure environment. Educators are able to share their content and elearning courses through a secure, reliable and monetizable platform while offering the end user choice, flexibility and value. Companies using this platform include Facebook, AT&amp;T, The American Red Cross and Home Depot. </p>\n\n<p>With a Masters degree in International Relations from the University of Copenhagen, Mike returned to Canada and co-founded ALTEN Energy Solutions, where he established and managed a North American sales network. Mike also built and established industry specific relationships with executive levels of management at North American Utilities including BC Hydro, Pacific Gas and Electric (PG&amp;E), Southern California Edison to discuss distributed energy platforms and mobile storage technology. </p>\n\n<p>In addition, Mike is the architect and contributing author of the Sustainable Enterprise (Turning Awareness into Action) and has led education projects with corporate leaders in global sustainability including Wal-Mart, Unilever, AON Risk Management, Cisco, the U.S. Green Buildings Council (LEED), the American Institute of Architects, Google.org, Clayco, and Nortel.</p>","image":null,"degrees":[{"degree_type":"Masters","subject":"International Relations","institution":"University of Copenhagen, Denmark","graduated_year":2004,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"Digital Backpack","permalink":"digital-backpack","type_of_entity":"company","image":{"available_sizes":[[[150,26],"assets/images/resized/0020/7974/207974v1-max-150x150.jpg"],[[250,44],"assets/images/resized/0020/7974/207974v1-max-250x250.jpg"],[[447,79],"assets/images/resized/0020/7974/207974v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://ca.linkedin.com/in/mikesommer","title":"Mike Sommer"}]}