{"first_name":"Mike","last_name":"Berlin","permalink":"mike-berlin","crunchbase_url":"http://www.crunchbase.com/person/mike-berlin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"AVST","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 02 15:09:00 UTC 2009","updated_at":"Fri Feb 26 18:49:21 UTC 2010","overview":"<p>Mike Berlin joined AVST in February 2005. Mr. Berlin brings over twenty years of sales, marketing, and management experience to AVST. From 2002 to early 2005, Mr. Berlin worked for Interactive Intelligence Inc. (I3) (NASDAQ: ININ), a global developer of software for IP telephony, contact center automation, unified communications, and customer self-service. In his position as Director of the Communications Solutions Group at Interactive Intelligence, Mr. Berlin was responsible for building and managing the organization and securing nationwide distribution for I3&#8217;s unified communications solution, Communité. From 1992 to 2001, Mr. Berlin assumed positions of increasing responsibility with Mitel Networks Corporation, a leading global provider of enterprise and small business communications solutions and services. During his tenure at Mitel Networks, Mr. Berlin served as Vice President Messaging &amp; Applications and General Manager of the Advanced Messaging Division (Baypoint Innovations) where he managed all aspects of Mitel&#8217;s messaging and applications product portfolio. Prior to joining Mitel Networks, Mr. Berlin served in various managerial positions at Intecom Inc., Fujitsu Business Communications, and Interwest Communications. Mr. Berlin also served five years in the United States Marine Corps.</p>","image":{"available_sizes":[[[96,110],"assets/images/resized/0007/8383/78383v2-max-150x150.jpg"],[[96,110],"assets/images/resized/0007/8383/78383v2-max-250x250.jpg"],[[96,110],"assets/images/resized/0007/8383/78383v2-max-450x450.jpg"]],"attribution":"<p>AVST Website</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Vice President of Sales & Business Development","firm":{"name":"AVST","permalink":"avst","type_of_entity":"company","image":{"available_sizes":[[[94,57],"assets/images/resized/0004/6351/46351v2-max-150x150.png"],[[94,57],"assets/images/resized/0004/6351/46351v2-max-250x250.png"],[[94,57],"assets/images/resized/0004/6351/46351v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}