{"first_name":"Mike","last_name":"Mullen","permalink":"mike-mullen-2","crunchbase_url":"http://www.crunchbase.com/person/mike-mullen-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Feb 01 07:40:37 UTC 2011","updated_at":"Tue Feb 01 07:41:32 UTC 2011","overview":"<p>Mike Mullen joined PPC as Senior Vice President and Chief Business Development Officer in January 2011. His responsibilities include the oversight and management of PPC’s strategic direction, business development, marketing, and proposals. He brings a strong track record with 20 years of experience enabling federal decision-makers to achieve their goals through the acquisition of strategic IT and professional services.\nPrior to joining PPC, Mike led INgage Networks’ executive team as VP of the Federal Sector. There, he spearheaded the federal strategy across the federal civilian and defense markets and grew the firm’s federal reach by more than 600%. He created a unique approach that focused on educating and training federal customers about how to derive enterprise value from social networking technologies based on tangible business objectives.</p>\n\n<p>Mike established himself as a successful leader and business grower in the federal market at INDUS Corporation. During his 16-year tenure at INDUS, he led the company’s growth from a start-up venture to a $100 million enterprise —earning the company recognition among the Inc. 500 Fastest Growing Private Companies in America, and four consecutive years on the Washington Technology Fast 50 list. Mike was responsible for leading and overseeing the company’s entire business development life cycle during this record-setting growth and won significant game-changing contracts such as: GSA’s $50 billion Alliant program; Commerce’s $8 billion COMMITS program; Transportation’s $275 million FITSS program; FBI’s $125 million IT Support Procurement; and NASA’s $75 million Business Applications and Sustaining Engineering program.</p>\n\n<p>Mike currently serves as the Vice Chair at-large for the Industry Advisory Council (IAC) Executive Committee, representing 550+ member companies working to bring industry and government executives together to enhance government’s overall ability to serve the public. Mike has held numerous leadership positions within IAC, including: Partners Program Vice-Chair, Partners Program Chair, and Chair of the Professional Development Advisory Committee (PDAC). In his current Executive Committee role, Mike supports the development of ACT-IAC’s Education &amp; Training initiatives that will offer greater value to both Government and industry members. Mike’s efforts earned him recognition as IAC’s Individual Contributor of the Year (2008) and ACT-IAC’s Fellow of the Year (2009).</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0011/9842/119842v1-max-150x150.jpg"],[[168,210],"assets/images/resized/0011/9842/119842v1-max-250x250.jpg"],[[168,210],"assets/images/resized/0011/9842/119842v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Senior Vice President and Chief Business Development Officer","firm":{"name":"Project Performance","permalink":"project-performance","type_of_entity":"company","image":{"available_sizes":[[[150,40],"assets/images/resized/0010/4346/104346v1-max-150x150.png"],[[239,64],"assets/images/resized/0010/4346/104346v1-max-250x250.png"],[[239,64],"assets/images/resized/0010/4346/104346v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}