{"first_name":"Mike","last_name":"Sommers","permalink":"mike-sommers","crunchbase_url":"http://www.crunchbase.com/person/mike-sommers","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"KickApps","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Mar 14 07:36:34 UTC 2008","updated_at":"Thu Dec 22 08:43:03 UTC 2011","overview":"<p>Mike Sommers has been creating consumer internet products since 1995, when he developed a series of very successful community-based products on AOL as a contract employee of ABC Online (before &#8220;social&#8221; was cool). Since then Mike has held various executive-level design, development and product management roles for companies large and small, and has been singularly focused on the business of connecting people with the things they care about.</p>\n\n<p>Mike is currently the Head of Product at Function(x) Inc.. Function(x) Inc. In this capacity, Mike is responsible for the product strategy and roadmap as well as day-to-day management of all product, design and editorial activities within the company.</p>\n\n<p>Function(x), Inc. was created by well-known media entrepreneur Robert F.X. Sillerman in February, 2011. The company is leveraging the scale and richness of digital/mobile technology to develop next-generation consumer, media and entertainment businesses. The company will launch its first consumer business before the beginning of 2012. (OTC: FNCX.PK)</p>\n\n<p>Prior to joining Function(x) Inc., Mike was Senior Vice President of Product Management for KIT Digital, after their January 2011 acquisition of KickApps, Corp., where Mike had been the EVP of Product for almost four years. KIT Digital is a leading provider of internet delivered media solutions for the world&#8217;s largest publishers, enterprises and network operators. Mike managed a 12 person staff that oversaw all social media product initiatives in support of the 1,000+ person organization, which is headquartered in Prague and has offices around the world. (NasdaqGS: KITD)\nKickApps was a leading NYC-based software company that offered a white-label social media platform that powered community experiences for thousands of web publishers including Food Network, National Geographic, U2, Budget Travel, HBO, Rachael Ray, Martha Stewart, The NHL, Harley-Davidson and hundreds of smaller publishers from around the world.</p>\n\n<p>Before joining KickApps, Mike spent seven years at AOL where he held various product management positions. His most recent position at AOL was Vice President of Product Development for AOL Search. In that role Mike managed a global staff of 65 employees in 3 countries (US, Ireland and India) responsible for the full product lifecycle, including product strategy, product requirements, user interface design, visual design, editorial programming, and project management for all AOL Search products (web search, video search, shopping search, local search, AOL channel searches, etc). In 2007 his products were estimated to generate half a billion dollars in profit for the company.</p>\n\n<p>While at AOL, Mike also worked extensively in the fields of Video Search, Social Networking, Personalization and Local, and is named as inventor or co-inventor on 3 related patents.</p>\n\n<p>Culturally relevant search results (Describes a method for identifying documents in a set of search results that are related to a current event. For instance if a user searches for &#8220;Philipines,&#8221; results related to the recent typhoon are distinguished from the other &#8220;evergreen&#8221; results related to tourism, industry, etc.)</p>\n\n<p>Identifying events of interest within video content (Describes a method for identifying events of interest in a video stream by annotating the video content with words that viewers use during chat or instant messenger conversations about the video.)</p>\n\n<p>Indicating recent content publication activity by a user (Mike&#8217;s contributions to this wide-ranging patent appear in sections 1300 - 1600, which describe a &#8220;buddy powered search engine&#8221; that is capable of searching the web for content that was put on the web by a given user&#8217;s online friends. For instance a search on &#8220;Athens, Greece&#8221; might return a set of results containing photos on Flicker, blog posts on WordPress, shared links on Facebook, videos on YouTube, status updates on Twitter, saved links on Delicious, etc., all related to the query &#8220;Athens, Greece,&#8221; and all contributed to those sites by my friends).</p>\n\n<p>Before joining AOL, Mike built and managed a twelve person production studio at Blue Marble, a New York based professional services firm that built web sites for clients like Proctor &amp; Gamble, Nabisco, General Motors, Cadillac, Capitol One, Continental Airlines and Ernst &amp; Young.</p>\n\n<p>Going back to 1995, he has held various design, technical, production and content roles on internet projects for ABC, AOL, Prodigy, Hearst New Media (www.homearts.com), Merrill Lynch, Cantor Fitzgerald, Chase Manahattan Bank, Qwest, P&amp;G, GM, Nabisco and a host of others.</p>\n\n<p>Mike has a BA Degree in Political Science from Columbia University, where he was an Academic All-Ivy League linebacker and member of the Columbia College Dean&#8217;s List for several semesters.</p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0001/5753/15753v1-max-150x150.jpg"],[[125,167],"assets/images/resized/0001/5753/15753v1-max-250x250.jpg"],[[125,167],"assets/images/resized/0001/5753/15753v1-max-450x450.jpg"]],"attribution":"<p>http://www.kickapps.com/about-us/people.html</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"EVP, Products","firm":{"name":"KickApps","permalink":"kickapps","type_of_entity":"company","image":null}},{"is_past":false,"title":"Head of Product","firm":{"name":"WeWork","permalink":"wework","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0021/3245/213245v2-max-150x150.png"],[[250,57],"assets/images/resized/0021/3245/213245v2-max-250x250.png"],[[437,101],"assets/images/resized/0021/3245/213245v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}