{"first_name":"Mike","last_name":"Mazur","permalink":"mike-mazur","crunchbase_url":"http://www.crunchbase.com/person/mike-mazur","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"3 Phases Renewables","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Oct 02 05:45:01 UTC 2008","updated_at":"Tue Nov 25 22:50:47 UTC 2008","overview":"<p>With over 25 years experience in the power systems and renewable energy markets, Mike Mazur has provided his expertise, consulting and services to a wide range of clients representing utilities, telecommunications, government and industrial arenas. In his native Russia, Mike gained hands-on technical knowledge of power systems as an energy analyst and utility grid dispatcher. During his 10-year tenure at Raytheon, Mike helped modernize and provided project management for power systems at FAA Air Traffic Control facilities. Prior to joining Raytheon, Mike provided utility substation and automation design as a contractor for Southern California Edison. While at Capstone Turbines, Mike honed his experience in new technology applications.  </p>\n\n<p>This in-the-field experience served Mike well as he founded 3 Phases Energy Services, one of the earliest providers of renewable energy in a deregulated market. There, he served as the Chief Technical Officer until 2007. Mike spearheaded the next progression of the company, launching 3 Phases Renewables specializing in providing customers direct access to clean energy as well as connecting green generators to the power grid. Mike is also responsible for evaluating renewable energy technologies, assessing them for commercial readiness in prime-time applications.</p>\n\n<p>Holding an engineering degree from Ivanovo Power State University in Russia and an MBA from CSU, Mike is registered as a Professional Engineer in California and Oregon and is a member of IEEE and CIGRE.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder and Principal ","firm":{"name":"3 Phases Renewables","permalink":"3-phases-renewables","type_of_entity":"company","image":{"available_sizes":[[[150,136],"assets/images/resized/0002/6011/26011v2-max-150x150.jpg"],[[190,173],"assets/images/resized/0002/6011/26011v2-max-250x250.jpg"],[[190,173],"assets/images/resized/0002/6011/26011v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}