{"first_name":"Mike","last_name":"Glezos","permalink":"mike-glezos","crunchbase_url":"http://www.crunchbase.com/person/mike-glezos","homepage_url":"http://www.MikeGlezos.com","birthplace":"Southern California","twitter_username":"MikeGlezos","blog_url":"http://WebpageByNumbers.com","blog_feed_url":"http://webpagebynumbers.com/rss","affiliation_name":"topLingo Development","born_year":1974,"born_month":4,"born_day":30,"tag_list":"mike-glezos, glezos, toplingo, toplingo-development, michael-glezos, biz-name-wiz, biznamewiz","alias_list":null,"created_at":"Mon Oct 27 22:05:38 UTC 2008","updated_at":"Wed Oct 10 01:39:18 UTC 2012","overview":"<p>Owner/CEO of business naming agency Biz Name Wiz, Director of Online Development at the social eCommerce platform Spoiled Online, owner of Mike Glezos Orange County Web Design a Southern California based online consulting firm and an original founder and former CEO of the web application development firm topLingo.</p>\n\n<p>The most successful people you know likely abide by a simple, not-so-secret philosophy: Work hard, play hard.</p>\n\n<p>Meet Mike Glezos, a 15-year web development veteran, successful entrepreneur, accomplished public speaker and limitless adventurer who has channeled his work-hard, play-hard zeal for both professional and personal accomplishment into a trusted and innovative pillar of solutions for the global web marketplace.</p>\n\n<p>Currently at the helm of several web ventures, operating BizNameWiz.com, MikeGlezos.com and SpoiledOnline.com,  Glezos co-founded topLingo Development, Inc., a premier web application development firm, where he also served as the company’s director of online development, director of business development, and e-marketing manager.</p>\n\n<p>At topLingo, this self-described solutions architect led customized web solutions campaigns for such notable clients as Chase, Monster.com, Carlos Santana and Air New Zealand. By 2010, he was consistently achieving gross annual sales approaching or at the $1 million mark, had acquired more than 100 clients for the firm, and had personally supervised and launched over 400 well-received client web projects.</p>\n\n<p>Prior to establishing his lasting legacy and impressive portfolio at topLingo, Glezos co-founded Net-Scope, Inc., in 1997. As the web design company’s creative director, he produced over 100 successful web-based projects.</p>\n\n<p>Previous experience included serving as the webmaster and photography assistant for a small but well-regarded digital photography studio. It was at this studio that Glezos first married his love of web-based projects and solutions with his bachelor’s degree in digital photography from the Brooks Institute of Photography in Santa Barbara, California. During his studies, Glezos, ever the innovator, co-created the school’s first web design classes and installation of a satellite on the school’s boat so underwater photographers could upload their work to a Glezos built website from the aquatic field.</p>\n\n<p>Throughout his academic and professional careers, Glezos has subscribed to the idea of giving 110 percent to every project he tackles. That philosophy also carries over to his leisure activities during time off, including hobby photography and videography. A competitive surfer, snowboarder, world traveler and scuba diver, Glezos embraces each new adventure with the same thirst for superior achievement that has led his web solutions clients to trust him as if their businesses depend on it. And often, they actually do.</p>","image":{"available_sizes":[[[150,136],"assets/images/resized/0002/9069/29069v5-max-150x150.png"],[[250,228],"assets/images/resized/0002/9069/29069v5-max-250x250.png"],[[250,228],"assets/images/resized/0002/9069/29069v5-max-450x450.png"]],"attribution":"<p>Mike Glezos from topLingo</p>"},"degrees":[{"degree_type":"BA","subject":"Digital Photography","institution":"Brooks Institue of Photography","graduated_year":1997,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President","firm":{"name":"Biz Name Wiz","permalink":"biz-name-wiz","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0021/1372/211372v2-max-150x150.png"],[[250,76],"assets/images/resized/0021/1372/211372v2-max-250x250.png"],[[450,137],"assets/images/resized/0021/1372/211372v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"President","firm":{"name":"New Mammal","permalink":"new-mammal","type_of_entity":"company","image":null}},{"is_past":true,"title":"President","firm":{"name":"topLingo Development","permalink":"toplingo","type_of_entity":"company","image":{"available_sizes":[[[135,35],"assets/images/resized/0002/1773/21773v1-max-150x150.png"],[[135,35],"assets/images/resized/0002/1773/21773v1-max-250x250.png"],[[135,35],"assets/images/resized/0002/1773/21773v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/mglezos","title":"LinkedIn"},{"external_url":"http://twitter.com/MikeGlezos","title":"Twitter"},{"external_url":"http://MikeGlezos.com","title":"MikeGlezos.com"},{"external_url":"http://WebpageByNumbers.com","title":"Mike Glezos Blog"}]}