{"first_name":"Mike","last_name":"Powell","permalink":"mike-powell","crunchbase_url":"http://www.crunchbase.com/person/mike-powell","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Dec 01 10:52:18 UTC 2008","updated_at":"Mon Dec 01 11:02:51 UTC 2008","overview":"<p>Mike Powell, Ph.D., has more than 25 years of pharmaceutical development experience, and he has focused interest in clinical-stage product companies, particularly in the oncology, endocrine, and neurology areas. He joined Sofinnova Ventures as a General Partner in 1997 as a member of the Life Science investment team. Prior to becoming a venture capitalist, Mike worked on 20 clinical products and authored almost 100 papers and books, including an 1,100–page treatise on vaccine design. Mike was an early investor in Actelion (SWX: ATLN), InterMune (Nasdaq: ITMN), Anesiva (Nasdaq: ANSV), Orexigen Therapeutics (Nasdaq: OREX), Seattle Genetics (Nasdaq: SGEN), and Threshold Pharmaceuticals (Nasdaq: THLD), as well as several private companies such as Ascenta and Trius Therapeutics. Mike is currently Board President of AVAC (AIDS Vaccine Advocacy Coalition), a past Advisor to the Bill and Melinda Gates Foundation, a Strategic Advisor to One World Health, and a Founding Venture Advisory Board member of the IAVI Innovation Fund. He flies too much, but he loves it.</p>\n\n<p>Mike was Group Leader of Drug Delivery at Genentech (1990–97) where his focus was developing new therapeutics. In 1987 he was part of the founding team of Cytel; as Director of Product Development, he was responsible for the company&#8217;s early growth, which culminated in a successful IPO. Before this he was Scientist and Project Team Leader at Syntex Research. Mike had the honor of being the first scientist from the biotechnology industry to be elected a Fellow of the American Association of Pharmaceutical Scientists. He was also an Adjunct Professor at the University of Kansas, an Editorial Board member of J. Pharm. Sci., and a Scientific Advisor to the Controlled Release Society.</p>\n\n<p>He received his Ph.D. in Physical Chemistry from the University of Toronto in 1981, and completed his post-doctorate work in Bioorganic Chemistry at the University of California, where he was subsequently a faculty member (1981–84).</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0003/0438/30438v1-max-150x150.jpg"],[[250,153],"assets/images/resized/0003/0438/30438v1-max-250x250.jpg"],[[260,160],"assets/images/resized/0003/0438/30438v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Sofinnova Ventures","permalink":"sofinnova-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,26],"assets/images/resized/0003/0428/30428v1-max-150x150.jpg"],[[194,34],"assets/images/resized/0003/0428/30428v1-max-250x250.jpg"],[[194,34],"assets/images/resized/0003/0428/30428v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}