{"first_name":"Mike","last_name":"Correra","permalink":"mike-correra-2","crunchbase_url":"http://www.crunchbase.com/person/mike-correra-2","homepage_url":"http://mikethecarguy.weebly.com","birthplace":"","twitter_username":"mikethecarguy1","blog_url":"http://mikethecarguy.weebly.com","blog_feed_url":"http://mikethecarguy.weebly.com/2/feed","affiliation_name":"Unaffiliated","born_year":1969,"born_month":5,"born_day":28,"tag_list":"mike-correra, automotive-sales-manager, marketing, management, mike-thecarguy, car-dealer, auto-sales","alias_list":null,"created_at":"Wed Feb 15 19:08:54 UTC 2012","updated_at":"Sat Feb 18 22:04:13 UTC 2012","overview":"<p>“Using positive energy and pure ambition, I lead growth seeking automotive professionals toward daily victories – all while providing an unexpectedly pleasant and memorable experience for our customers.” Mike Correra Automotive Sales Manager</p>\n\n<p>People who know Michael Correra describe him as ambitious, energetic and inspiring.  His life is driven by passion for his wife and four children – the look and feel of muscle cars – the smell of the drag strip – pretty much anything 80’s – and being a student and a teacher in the car business.\nMike is a motivator and has the natural talent to energize those around him.  His passion and enthusiasm is intrinsic and he delivers it with the sole purpose to inspire others.  Often times, people view Mike as the “go to guy” and is seen as the expert in many areas.  He&#8217;s highly respected for his well-rounded knowledge of the auto industry, but best known for being the guy who leads, empowers and develops his people.\nInstinctively, he often raises the spirits of other people by putting aside what he’s doing and giving his team member undivided attention.  With an eye for raw talent, Mike uses this natural born gift to differentiate people by focusing on their strengths.\nWith a desire to learn and understand the ever-changing automotive industry, Mike keeps the book of knowledge open.  He gathers all kinds of innovative and cutting edge data, then keeps it at his fingertips in order to ensure his organization stays competitive in the market place.\nAlthough bold and direct when he speaks, those around him know they can trust what he is saying.  You can count on Mike’s sincerity while engaging with others.  He believes it&#8217;s important to make time to meet and connect with the team, and build a platform to cultivate mutual trust and respect – two values, of which, he will not compromise.  During his daily mode of operation, Mike leverages these values by walking the talk and delivering quantifiable results.\nKeeping it real, you can expect Mike Correra to entertain you with his quick wit and great sense of humor.  He believes laughter is the best therapy and in business he provides a car buying that is extraordinarily pleasant and positively memorable.</p>","image":{"available_sizes":[[[146,150],"assets/images/resized/0017/4411/174411v2-max-150x150.jpg"],[[244,250],"assets/images/resized/0017/4411/174411v2-max-250x250.jpg"],[[339,347],"assets/images/resized/0017/4411/174411v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/no1fleetguy","title":"LinkedIn"},{"external_url":"http://www.twitter.com/mikethecarguy1","title":"Twitter"},{"external_url":"https://plus.google.com/u/0/?tab=wX#112916283684004103157/posts","title":"Google +"}]}