{"first_name":"Mike","last_name":"Kelley","permalink":"mike-kelley","crunchbase_url":"http://www.crunchbase.com/person/mike-kelley","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 28 20:42:28 UTC 2008","updated_at":"Wed May 28 20:46:07 UTC 2008","overview":"<p>Mike brings over 20 years of engineering experience to mywaves, holding executive management positions for both start-ups and public companies.  His impressive career highlights a wide range of product experience including mobile software, platforms and developer ecosystems, consumer and professional media, as well as Internet/web hosted solutions. </p>\n\n<p>Prior to joining mywaves, Mike was senior vice president of product development and engineering, responsible for worldwide software development of the ACCESS Linux platform.  He began his career in 1983 developing hardware and software products for high-end 3D graphics production at some of the early leaders in the industry, including Vertigo, Inc. In 1989, he joined Apple’s Advanced Technology Group, and was subsequently promoted to director of the Interactive Media Group, shipping numerous award-winning products, including QuickTime VR, QuickDraw 3D, and the first 3D hardware accelerator for Mac. In 1996, Mike joined SGI as senior director for Cosmo Software, shipping interactive Web content tools such as CosmoWorlds and advancing the VRML Internet standard. He then became senior director for the Advanced Graphics Division, developing SGI’s high-end graphics supercomputers and strategic technologies such as OpenGL. From 1999 to 2003, Mike was vice president of engineering at ePeople, developing award-winning Web based enterprise software for collaboration, CRM and knowledge management.</p>\n\n<p>Mike’s individual achievements include more than a dozen patents and numerous technical publications. He studied Mathematical Physics and Philosophy at Simon Fraser University, in British Columbia, Canada.</p>\n\n<p>Though he aspires to write a novel, Mike now spends his free time dabbling in photography, digital imagery and video production. </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0001/9575/19575v1-max-150x150.jpg"],[[100,150],"assets/images/resized/0001/9575/19575v1-max-250x250.jpg"],[[100,150],"assets/images/resized/0001/9575/19575v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://corp.mywaves.com/Company/_topic/executive_bios/\" title=\"mywaves\" rel=\"nofollow\">mywaves</a></p>"},"degrees":[],"relationships":[{"is_past":true,"title":"Vice President, Engineering","firm":{"name":"mywaves","permalink":"mywaves","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0001/9572/19572v1-max-150x150.png"],[[183,56],"assets/images/resized/0001/9572/19572v1-max-250x250.png"],[[183,56],"assets/images/resized/0001/9572/19572v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}