{"first_name":"Mike","last_name":"Lada","permalink":"mike-lada","crunchbase_url":"http://www.crunchbase.com/person/mike-lada","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"My Internet Corporation ('mi')","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue May 10 18:55:01 UTC 2011","updated_at":"Wed Dec 07 23:13:29 UTC 2011","overview":"<p>Mike Lada is the CFO of My Internet Corporation.</p>\n\n<p>Mike started his career in Toronto, Canada working in the consumer markets group of an international accounting firm where he provided assurance services to a variety of private and public organizations.  After public accounting, Mike joined the finance group of a prominent publicly-listed company whose assets included a cross section of successful North American service organizations in the advertising, marketing, and media relations industry. While there, Mike participated in the transition of the entity’s financial reporting to US GAAP and ultimately played a significant role in the issuance of the company’s first 10-K and 10-Q filings with the SEC. </p>\n\n<p>From there Mike, along with several senior officers of the publicly-listed company, went out to start a private equity firm focused on the aggregation of assets in the service industry. Mike participated in all aspects of the firm’s creation inclusive of the raising of capital, investment lead generation, due diligence, and transaction execution. Having gained a keen interest in problem solving and transaction work, Mike went on to start his own consulting service business focused on assisting organizations with projects ranging from transactions, technical accounting matters to regulatory reporting issues.  </p>\n\n<p>In 2009, My Internet Corporation’s (‘mi’) Founder and CEO approached Mike to participate in the creation of a company that focuses on bringing the power of the Internet back to the people. My Internet Corporation is currently launching the company’s first product offering, mi Lifemap, a dynamic and interactive web application.</p>\n\n<p>Mike is a graduate of the University of Western Ontario in London, Canada, and also holds a Chartered Accountant designation. In addition, Mike has volunteered with several organizations in the past and currently sits on the finance committee of Trinity College School, an Ontario, Canada-based boarding school.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Financial Officer","firm":{"name":"My Internet Corporation ('mi')","permalink":"my-internet-corporation-mi","type_of_entity":"company","image":{"available_sizes":[[[150,115],"assets/images/resized/0013/4038/134038v2-max-150x150.jpg"],[[250,193],"assets/images/resized/0013/4038/134038v2-max-250x250.jpg"],[[450,347],"assets/images/resized/0013/4038/134038v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}