{"first_name":"Mike","last_name":"Janover","permalink":"mike-janover","crunchbase_url":"http://www.crunchbase.com/person/mike-janover","homepage_url":"http://www.linkedin.com/in/mikejanover","birthplace":"New York","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"CNET Networks","born_year":null,"born_month":null,"born_day":null,"tag_list":"marketing, advertising, promotions, seo, sem, affiliate-marketing, customer-care, industry-marketing, creative, band-management, public-relations-and-media-relations, product-placement, contect-syndication, business-development, social-media","alias_list":null,"created_at":"Tue Apr 22 17:11:47 UTC 2008","updated_at":"Fri Feb 04 00:16:44 UTC 2011","overview":"<p>Marketing professional with experience working with large Fortune 500 companies as well as early-stage companines.</p>\n\n<p>Mike Janover\nE-mail: mjanover@yahoo.com</p>\n\n<p>EXPERIENCE</p>\n\n<p>2011 - Present\nThe Janover Group LLC\nSan Francisco, CA\nPresident</p>\n\n<p>A marketing and communications consultancy practice that helps companies tell compelling stories.  In some cases, I focus on consumer marketing and advertising programs (acquisition, conversion and retention), and for other clients, I concentrate on industry or B2B marketing and research programs to help identify, convert and retain customers and partners.  In either case, I help clients identify consumer/customer insights that crystallize marketing and communication strategies and tactics.</p>\n\n<p>2006 – 2010<br/>\nCBS Interactive \nSan Francisco, CA<br/>\nVice President Marketing - CNET</p>\n\n<p>• Responsible for all acquisition, conversion and retention marketing efforts for both consumer and trade targets in the United States, web site user experience, design, research, customer care, creative development and product strategy for the CNET business unit</p>\n\n<ul>\n<li>Manage research team that support web site experience teams, sales programs, and marketing strategy</li>\n<li>Manage creative team responsible for internal and external advertising efforts, sales support and web site experience</li>\n<li>Manage marketing teams responsible for trade shows, industry marketing, barter marketing, online and offline media, search engine optimization, search engine marketing, CNET Editor Choice Awards, permissions, internal communications brand management and guidelines</li>\n<li>Manage customer care team responsible for all registration, subscription and user experience</li>\n<li>Manage team of six direct reports 32 indirect reports</li>\n</ul>\n\n<p>2003 – 2006<br/>\nYAHOO! INC.<br/>\nSunnyvale, CA<br/>\nGlobal Marketing Director – Corporate Marketing</p>\n\n<p>• Responsible for all TV, print, radio, outdoor, and online marketing programs for Yahoo in the US, as well as management of all corporate sponsorships, barter relationships, product placement and Yahoo Buzz content syndication</p>\n\n<ul>\n<li>Scope includes coordinating all media efforts across 10+ business units to develop cross-platform, 360 degree marketing campaigns that deliver brand and business performance metrics</li>\n<li>Manage agencies, as well as internal stake holders for media efficiencies, product placements and network integration opportunities</li>\n<li>Lead Yahoo Buzz content syndication strategy and implementation across television, radio, outdoor and online channels</li>\n</ul>\n\n<p>Marketing Director - Global Direct Marketing\n• Responsible for all online media programs for Yahoo properties outside of the internal house ads</p>\n\n<ul>\n<li>Scope includes all Paid Placement, Paid Inclusion, SEO, Affiliate Programs and Online Media programs across 20+ business units and corporate marketing initiatives</li>\n<li>Manage a group of 15 direct and indirect media managers across the organization responsible for strategy, budgeting, planning, buying, trafficking, forecasting, and optimization of digital media campaigns</li>\n</ul>\n\n<p>Senior Marketing Manager - Yahoo Personals\n• Responsible for all media efforts for Y! Personals</p>\n\n<ul>\n<li>Transitioned agency relationship to in-house team and capabilities which included business development programs, affiliate channel, paid placement, paid inclusion, SEO and $10+ MM annual media budget</li>\n<li>Hired, trained and manage team of five full-time employees</li>\n<li>Responsible for 43% growth in new subscribers and 63% reduction in acquisition costs YOY</li>\n</ul>\n\n<p>1998 – 2002<br/>\nORGANIC, INC.<br/>\nSan Francisco, CA</p>\n\n<p>Director Business Development &amp; Strategic Partnerships\nDirector of Client Services\nMedia Director</p>\n\n<p>• Launched and built the interactive marketing practice for the west coast office </p>\n\n<ul>\n<li>Co-development of the marketing solutions work flow process and methodology</li>\n<li>Hired and trained ten new staff members within both the media and client services teams</li>\n</ul>\n\n<p>• Drove global partnership strategy and client services team managing all interactive client relationships and account planning teams\n• Sales Director for Organic’s western region, responsible for over $20 M in revenue over a three year period</p>\n\n<p>Partial client list: Gap Inc., Guild.com, Home Depot, Law.com, Midway, Mutual of Omaha, Nortel, Physicians Mutual, Special Olympics, Sprint PCS, Textbooks.com Union Pacific, and Washington Mutual </p>\n\n<p>1996 – 1998<br/>\nTHUNDER HOUSE – McCANN-ERICKSON \nCambridge, MA</p>\n\n<p>Associate Media Director\nSenior Media Buyer/Planner\nMedia Buyer/Planner</p>\n\n<p>• Developed and managed the Media group for the Thunder House Boston office</p>\n\n<ul>\n<li>Built media group to seven employees and generated over $5M in revenue </li>\n<li>Managed all print, direct mail and interactive media campaigns</li>\n<li>Responsibilities included account planning, media planning, media buying, performance reporting, developing third party vendor relationships, revenue forecasts, employee recruitment and new business development</li>\n<li>Successfully launched Softbank’s online advertising network called the ADSmart Network </li>\n</ul>\n\n<p>Partial client list: ADSmart, Continental CableVision (now MediaOne), FarSight Financial Services, Invesco, Pandesic, Schwab International, Salomon Smith Barney, Silicon Graphics</p>\n\n<p>1995-1996<br/>\nTHE WEBER GROUP, INC.<br/>\nCambridge, MA</p>\n\n<p>Assistant Account Executive\nAccount Coordinator</p>\n\n<p>• Full service public relations firm (now part of McCann-Erickson) with over $30 MM in revenue and 300 employees</p>\n\n<ul>\n<li>Responsibilities included developing media lists, researching speaking opportunities, writing speaking proposals, researching and maintaining editorial calendars, pitching editorial opportunities and monitoring industry trends </li>\n<li>Major accomplishments included successfully launching Open Market through an IPO and solidifying significant press coverage and speaking opportunities for MIT that resulted in 5% additional lab funding </li>\n</ul>\n\n<p>Client list: Digital Storage Works, MIT’s Laboratory of Computer Science, NCR and Open Market</p>\n\n<p>EDUCATION</p>\n\n<p>ITHACA COLLEGE\nROY H. PARK SCHOOL OF COMMUNICATIONS<br/>\nIthaca, NY</p>\n\n<p>B.S. Television and Radio with a concentration in Advertising and Public Relations, Minor in Sociology</p>\n\n<p>• One semester at The University of New South Wales, Sydney Australia</p>","image":{"available_sizes":[[[150,139],"assets/images/resized/0001/7572/17572v1-max-150x150.jpg"],[[250,232],"assets/images/resized/0001/7572/17572v1-max-250x250.jpg"],[[450,419],"assets/images/resized/0001/7572/17572v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.S.","subject":"TV & Radio","institution":"Ithaca College","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"VP of Marketing","firm":{"name":"CNET Networks","permalink":"cnetnetworks","type_of_entity":"company","image":{"available_sizes":[[[150,37],"assets/images/resized/0000/2281/2281v1-max-150x150.png"],[[165,41],"assets/images/resized/0000/2281/2281v1-max-250x250.png"],[[165,41],"assets/images/resized/0000/2281/2281v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Director of Marketing","firm":{"name":"Yahoo!","permalink":"yahoo","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0001/0836/10836v9-max-150x150.png"],[[226,81],"assets/images/resized/0001/0836/10836v9-max-250x250.png"],[[226,81],"assets/images/resized/0001/0836/10836v9-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.linkedin.com/in/mikejanover","title":"LinkedIn Profile"}],"web_presences":[]}