{"first_name":"Mike","last_name":"Eynon","permalink":"mike-eynon","crunchbase_url":"http://www.crunchbase.com/person/mike-eynon","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Silver Tail Systems","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Dec 09 00:21:29 UTC 2008","updated_at":"Tue Jul 14 00:57:40 UTC 2009","overview":"<p>Mike is the Co-Founder and President of Silver Tail, bringing substantial experience in building fraud detection and prevention tools for some of the highest traffic and fraud targeted websites on the internet.  Before co-founding Silver Tail Systems, Mike managed payment risk at PayPal, as well as fraud policy at eBay.  Prior to these roles, Mike worked as an engineer for Trust and Safety at eBay where he built some of the industries very first real-time fraud fighting tools for websites.  Mike&#8217;s roles at PayPal and eBay put him in the technology center of fighting electronic crimes of phishing, pharming and spoofing.  Mike also spent time in the business units making decisions about how fraud negatively affects the business and where simple adjustments in the page flow can prevent bad behavior without impacting user experience.  Prior to eBay, Mike worked in engineering roles for Brio, SAS, and IBM and ran his own consulting company.  Mike has a B.S. in Computer Science from California Polytechnic State University in San Luis Obispo (CalPoly).  Mike is a licensed pilot and enjoys anything that involves adrenaline.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder, VP of Engineering and CTO","firm":{"name":"Silver Tail Systems","permalink":"silver-tail-systems","type_of_entity":"company","image":{"available_sizes":[[[150,80],"assets/images/resized/0003/1303/31303v3-max-150x150.png"],[[215,115],"assets/images/resized/0003/1303/31303v3-max-250x250.png"],[[215,115],"assets/images/resized/0003/1303/31303v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}