{"first_name":"Mike","last_name":"Emerson","permalink":"mike-emerson","crunchbase_url":"http://www.crunchbase.com/person/mike-emerson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"T3Media","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jan 12 18:04:26 UTC 2010","updated_at":"Wed Jul 11 19:29:41 UTC 2012","overview":"<p>As EVP of Operations, Mike Emerson is responsible for commercializing T3Media content and services. This includes creating new revenue opportunities with existing media partners, launching additional content collections with new media partners, increasing distribution of content through global channel partnerships, and optimizing processes with internal teams to accelerate customer adoption of products and services. Previously, Mike was VP Sales Operations for Cenveo (NYSE: CVO), a diversified visual communications company, where he led marketing, national customer service, and sales development and training for a $1.4 billion division. Before joining Cenveo, Mike co-founded a venture-backed incubator dedicated to helping entrepreneurs rapidly scale technology companies. This was the second company Mike had successfully co-founded and operated. Prior experiences include brand marketing and strategic planning roles with the Guinness brewing division of Diageo (NYSE: DEO) and management consulting with ZS Associates, where he advised companies in marketing and sales strategy. Mike has an MBA from Wharton and a BBA from the University of Wisconsin.</p>","image":null,"degrees":[{"degree_type":"BBA","subject":"","institution":"University of Wisconsin","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"EVP of Operations","firm":{"name":"T3Media","permalink":"thought-equity-motion","type_of_entity":"company","image":{"available_sizes":[[[150,35],"assets/images/resized/0007/3413/73413v5-max-150x150.jpg"],[[250,59],"assets/images/resized/0007/3413/73413v5-max-250x250.jpg"],[[250,59],"assets/images/resized/0007/3413/73413v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}