{"first_name":"Mike","last_name":"Kavis","permalink":"mike-kavis","crunchbase_url":"http://www.crunchbase.com/person/mike-kavis","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"MDot Network","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Aug 14 23:12:00 UTC 2009","updated_at":"Mon Aug 17 19:52:47 UTC 2009","overview":"<p>Mike’s expertise includes Enterprise Architecture, IT Strategy &amp; Planning, Organizational Change Management, Cloud Computing, BPM, SOA, Web 2.0 and Business Intelligence. He is on the Board of Directors of Center for the Advancement of the Enterprise Architecture Profession (CAEAP) serving the role of Director of Social Technologies. Mike is also working with thought leaders from the Cloud Security Alliance (CSA) to help establish standards and raise awareness of risks and issues for cloud computing and mitigation strategies for resolving them. </p>\n\n<p>Mike has more than 23 years of IT experience including 12 years in leadership positions and over 16 years in retail marketing services at Catalina Marketing and Eckerd Drug Corporation. Mike is a free lance technology writer and is currently writing quarterly articles for SOAInstitute.org. He has written several articles for CIO.com and has presented at numerous technology conferences. Mike received his BS in Computer Science from Rochester Institute of Technology and his MBA and MSIT from Colorado Tech. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CTO","firm":{"name":"M-Dot Network","permalink":"mdot-network","type_of_entity":"company","image":{"available_sizes":[[[148,129],"assets/images/resized/0005/6769/56769v2-max-150x150.png"],[[148,129],"assets/images/resized/0005/6769/56769v2-max-250x250.png"],[[148,129],"assets/images/resized/0005/6769/56769v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}