{"first_name":"Mike","last_name":"Prince","permalink":"mike-prince","crunchbase_url":"http://www.crunchbase.com/person/mike-prince","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"BuzzBox","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Nov 27 05:33:11 UTC 2008","updated_at":"Tue May 31 22:07:19 UTC 2011","overview":"<p>Mike Prince is the CEO and Co-founder of Yum-Yum Labs which develops and manages digital properties.   Yum-Yum Labs is focused on mobile phone applications and services and has produced the #1 cooking application for Android.</p>\n\n<p>Mike Prince was the CTO of BuzzBox, a service that used to do life-streaming information to power discovery search.</p>\n\n<p>Prior to Buzzbox he traveled to Italy to help Buongiorno adopt open source technologies. He became Director of Web and WAP engineering for their global content catalog, built up a team in Milan, and re-wrote their application to run on open source.</p>\n\n<p>Prior to Buongiorno Prince was the founder of Mobido, and early mobile social networking site. Beside providing the bread and butter of SNS such as social graphs and pictures, Mobido pioneered some cool features such as RSS feeds of changes in your network of friends, comprehensive permissions, intelligent routing of messages by social relationship and device, and instant community creation with your mobile phone.</p>\n\n<p>Prior to Mobido, Mike Prince lead the development of the Voyager product at Nuance Communications. Voyager was a key element of their IPO story: the combination of using a mobile phone to access the Internet using natural language speech. After developing the product he transitioned into a strategic sales group to help carriers implement Internet based voice recognition systems.  He then moved into strategic account management of companies such as HP, Compaq, Intel, Sun, and Dialogic.</p>","image":{"available_sizes":[[[118,150],"assets/images/resized/0002/9730/29730v1-max-150x150.jpg"],[[196,250],"assets/images/resized/0002/9730/29730v1-max-250x250.jpg"],[[354,450],"assets/images/resized/0002/9730/29730v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder and CEO","firm":{"name":"YumYum Labs","permalink":"yumyum-labs","type_of_entity":"company","image":null}},{"is_past":true,"title":"CTO","firm":{"name":"BuzzBox","permalink":"buzzbox","type_of_entity":"company","image":{"available_sizes":[[[150,47],"assets/images/resized/0002/9723/29723v9-max-150x150.png"],[[180,57],"assets/images/resized/0002/9723/29723v9-max-250x250.png"],[[180,57],"assets/images/resized/0002/9723/29723v9-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}