{"first_name":"Mikhail","last_name":"LaPushner","permalink":"mikhail-lapushner","crunchbase_url":"http://www.crunchbase.com/person/mikhail-lapushner","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"OneBeat ","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Nov 27 21:32:11 UTC 2012","updated_at":"Fri Dec 07 17:46:02 UTC 2012","overview":"<p>Mikhail Lapushner is the CEO and founder of OneBeat, which is dedicated to empowering the development and authenticity of the rapidly growing electronic dance music (EDM) space through compelling original content exclusive to its networks. </p>\n\n<p>It’s Lapushner’s belief that music lets all people more fully engage in reality and live the human experience. </p>\n\n<p>“EDM is a participatory experience,” Lapushner says. “The beats show us that we’re just one piece of the larger world. Music, by its very nature, is the ultimate form of human self-expression. It allows us to connect to the worlds around us in a way that nothing else does.”</p>\n\n<p>Although EDM is just starting to get mainstream recognition, Lapushner long ago foretold that it would be instrumental in driving this generation.</p>\n\n<p>“Music lets us connect to who we are,” Lapushner says. “We’re just casting a light on it through content.”</p>\n\n<p>A cultural visionary who strives to understand how people consume media — and the technology that drives changes in media consumption habits — Lapushner believes that understanding media-driven data will fuel our ability to reach others around the world.</p>\n\n<p>A proven leader, Lapushner has been successful throughout his career by focusing on emerging brands and markets. Before leaping into the startup space, Lapushner was one of the youngest senior vice presidents at Paine Webber. Before that, he was one of the youngest vice presidents at Oppenheimer &amp; Co. </p>\n\n<p>He still attacks each day with the same energy that he brought to Wall Street, which has been instrumental in each of his startup ventures like Spongecell, which changed online advertising. </p>\n\n<p>“At the end of the day, what it comes down to is that all human beings need to feel like they’ve been ‘gotten’ or understood,” Lapushner says. “Someone who is expressing themselves whether through music or other means, is being ‘gotten’. That’s humanity — that moment.”</p>","image":{"available_sizes":[[[133,150],"assets/images/resized/0022/3585/223585v2-max-150x150.jpg"],[[142,159],"assets/images/resized/0022/3585/223585v2-max-250x250.jpg"],[[142,159],"assets/images/resized/0022/3585/223585v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BS in Economics","subject":"","institution":"State University of New York at Stony Brook","graduated_year":1991,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"OneBeat ","permalink":"onebeat","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0022/3579/223579v2-max-150x150.png"],[[250,100],"assets/images/resized/0022/3579/223579v2-max-250x250.png"],[[450,181],"assets/images/resized/0022/3579/223579v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/mikhaillapushner","title":"LinkedIn"},{"external_url":"https://plus.google.com/104056210838781715617/about","title":"Google+"},{"external_url":"https://www.facebook.com/pages/Mikhail-Lapushner/509031272457553","title":"Facebook"},{"external_url":"https://twitter.com/MLaPushner","title":"Twitter"}]}