{"first_name":"Mikolaj","last_name":"Rutkowski","permalink":"mikolaj-rutkowski","crunchbase_url":"http://www.crunchbase.com/person/mikolaj-rutkowski","homepage_url":"http://www.fraudit.pl","birthplace":"","twitter_username":"fraudit_pl","blog_url":"http://www.fraudiq.eu","blog_feed_url":"","affiliation_name":"fraudit","born_year":null,"born_month":null,"born_day":null,"tag_list":"fraud-corruption-misuse-crime-aml-anti-money-laundering-anti-corruption-computer-forensics","alias_list":null,"created_at":"Sun Nov 25 11:00:56 UTC 2012","updated_at":"Mon Nov 26 00:02:29 UTC 2012","overview":"<p>Mikolaj is the anti-fraud professional with almost 15 years of proven experience track. He has always been closely associated with internal controls, auditing and operational risk areas. His professional career evaluated from external financial audit positions, through internal auditing to final exclusive focus on forensic audit and related areas.</p>\n\n<p>His professional profile uniquely combines experience and know-how derived from both core business and advisory positions. He used to work for top commercial and advisory companies which allowed him to get a wide business context of corporate exposition to fraud, malpractice, corruption, money laundering and non-compliance instances. His extensive experience includes direct providing as well as overseeing of full range of services necessary to assess, prevent, detect and investigate instances of fraud, corruption, money laundering and similar cases.</p>\n\n<p>His professional knowledge has been proven by several internationally recognized certifications from areas of fraud and money laundering risk management (CFE, CFCI), anti-money laundering (CAMS), internal auditing (CIA, CFSA, CCSA, CRMA), information systems auditing (CISA) and compliance (GRCP).</p>\n\n<p>He is the frequent speaker and trainer on conferences and seminars devoted to internal auditing, risk management, anti-money laundering and compliance. He is the author of Fraud IQ (www.fraudiq.eu) – a webpage aimed to spread fraud awareness and share useful information among business professionals.</p>\n\n<p>He is the founder and chief consultant at fraudit – the specialized advisory practice offering its customers support in fraud risk management area. fraudit’s philosophy is not to deliver single services, but complete solutions in fraud prevention, detection and investigation. For more information, please visit the English section on www.fraudit.pl.</p>","image":{"available_sizes":[[[150,48],"assets/images/resized/0022/2058/222058v2-max-150x150.png"],[[150,48],"assets/images/resized/0022/2058/222058v2-max-250x250.png"],[[150,48],"assets/images/resized/0022/2058/222058v2-max-450x450.png"]],"attribution":"<p>fraudit | zero tolerance for raud</p>"},"degrees":[{"degree_type":"Master","subject":"Finance & Banking","institution":"University of Lodz","graduated_year":2000,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"owner","firm":{"name":"fraudit","permalink":"fraudit","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.acfe.pl","title":"ACFE Polish Chapter"}],"web_presences":[{"external_url":"http://www.linkedin.com/companies/fraudit","title":"fraudit @ LinkedIn"},{"external_url":"http://www.goldenline.pl/firma/fraudit","title":"fraudit @ GoldenLine"},{"external_url":"http://www.facebook.com/fraudit","title":"fraudit @ Facebook"}]}