{"first_name":"Miles","last_name":"Arnone","permalink":"miles-arnone-2","crunchbase_url":"http://www.crunchbase.com/person/miles-arnone-2","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 24 12:47:39 UTC 2012","updated_at":"Thu Jul 26 06:42:02 UTC 2012","overview":"<p>Miles Arnone was born and bred in South Carolina, and he’s proud of that fact. Miles was born in the Palmetto State’s capital, Columbia, and he went to school at the University of South Carolina. South Carolina shaped Miles into the smart and versatile individual he is today. Although Miles now lives in North Carolina, much of his heart remains in the state where he grew up.</p>\n\n<p>Facts About South Carolina</p>\n\n<p>South Carolina was the very first colony to declare its independence from Great Britain at the start of the Revolutionary War. A little less than one hundred years later, South Carolina became the first state to secede from the Union in the War Between the States.</p>\n\n<p>South Carolina is the site of the Eastern Atlantic Coast’s premiere beach resort, Myrtle Beach. Every summer, 14 million people visit Myrtle Beach on that seemingly endless stretch of sand known as the Grand Strand. In actuality, the Grand Strand extends for about 60 miles, from Little River to Georgetown. </p>\n\n<p>Myrtle Beach is one of America’s most popular family destinations, for domestic and international tourists alike. The quaint beach town and its immediate environs offer golden sand beaches, many golf course, great shopping and first-rate live entertainment. Miles Arnone has gone to music festivals there many times.</p>\n\n<p>The Mystery of Lake Murray</p>\n\n<p>On of the most mysterious parts of South Carolina is the reservoir called Lake Murray. Lake Murray is a manmade reservoir, formed when the Saluda River was dammed in the 1920s. The lake is over 40 miles wide and over 380 feet deep at its deepest point. </p>\n\n<p>Lake Murray may be most famous though for having its very own aquatic monster! This monster is described by those who’ve sighted him as a close relative of the Loch Ness Monster. Nessie, as he’s been nicknamed, was first seen in 1931. He’s been known to attack fishing boats on the lake very aggressively.</p>\n\n<p>South Carolina’s Economy</p>\n\n<p>Throughout most of its history, South Carolina has primarily been an agricultural region where tobacco was king. These days, agricultural output is waning, but South Carolina still produces much of the nation’s peaches and peanuts. Recently, the Palmetto State has become the site of many large textile mills. The state also produces asbestos, wood, pulp, steel products, chemicals and heavy machinery.</p>\n\n<p>The Palmetto State remains one of Miles&#8217;s favorite places in the world. Miles Arnone visits it as often as he can.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}