{"first_name":"Milton","last_name":"McColl","permalink":"milton-mccoll","crunchbase_url":"http://www.crunchbase.com/person/milton-mccoll","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Gauss Surgical","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Dec 31 06:47:27 UTC 2011","updated_at":"Tue Jan 03 01:22:28 UTC 2012","overview":"<p>Milton B. McColl, M.D. has a combined 25 years of healthcare operating and investment experience. He is the CEO of Gauss Surgical, Inc. an early-stage medical device company developing a mobile platform for real-time monitoring of surgical blood loss. </p>\n\n<p>Prior to joining Gauss Surgical, Milt was a Venture Partner at New Leaf Venture Partners, where he focused on venture and early-stage medical device investments.  NLV invests primarily in companies focused on clinical-stage biopharmaceutical products, early-stage medical devices, and molecular diagnostics, and currently manages more than $1.5 Billion in assets. At NLV, Milt served on the boards of Interlace Medical (acquired by Hologic), IlluminOss, and Glumetrics.  </p>\n\n<p>Prior to joining New Leaf, Milt was President of the Neurovascular Division of Boston Scientific Corporation (BSC). Milt initially joined BSC in 2001 following the acquisition of Embolic Protection, Inc (EPI) where he served as Vice President and General Manager for the Embolic Protection Franchise, part of the Interventional Cardiology division of BSC. Milt joined EPI in 2000 as one of the first employees assuming the position of Vice President of Clinical, Regulatory and Quality Affairs and Medical Director. During his time there he managed the design, implementation and successful completion of the FIRE Clinical trial, an 800 patient pivotal study which led to the FDA clearance of the FilterWire EX™ Device. Previously, Milt was the President and Chief Executive Officer of Genitope, Inc. an early stage biotechnology company focusing on patient-specific therapies for lymphoma which eventually became publically traded. Before joining Genitope, Milt was President and Chief Executive Officer of CSFluids, Inc. (later renamed Eunio), a development-stage company offering a surgical treatment for Alzheimer&#8217;s Disease. Prior to that he was Vice President of Regulatory Affairs, Quality Affairs, Clinical Affairs and Chief Medical Officer for Gynecare, Inc. (eventually acquired by Johnson and Johnson) and Director of Marketing for Origin Medsystems (acquired by Guidant Corporation). </p>\n\n<p>Milt began his career as a professional football player with the San Francisco Forty-Niners and Los Angeles Raiders from 1981 to 1989. He was a member of two Super Bowl Championship teams for the Forty-Niners and was a special team’s captain.  Since 1997, he has also served first as president and later as an executive board member for the Stanford University DAPER Investment Fund, a VC and investment vehicle fund benefiting Stanford University&#8217;s athletic department.</p>\n\n<p>Milt earned a B.S. in Biology from Stanford University and his M.D. from Stanford University School of Medicine.</p>","image":{"available_sizes":[[[103,150],"assets/images/resized/0016/8396/168396v2-max-150x150.jpg"],[[160,233],"assets/images/resized/0016/8396/168396v2-max-250x250.jpg"],[[160,233],"assets/images/resized/0016/8396/168396v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.S.","subject":"Biology","institution":"Stanford University","graduated_year":1981,"graduated_month":null,"graduated_day":null},{"degree_type":"M.D.","subject":"","institution":"Stanford University School of Medicine","graduated_year":1988,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Gauss Surgical","permalink":"gauss-surgical","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0016/8296/168296v2-max-150x150.png"],[[250,75],"assets/images/resized/0016/8296/168296v2-max-250x250.png"],[[450,135],"assets/images/resized/0016/8296/168296v2-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Venture Partner","firm":{"name":"New Leaf Venture Partners","permalink":"new-leaf-venture-partners","type_of_entity":"company","image":null}},{"is_past":true,"title":"President, Neurovascular Division","firm":{"name":"Boston Scientific","permalink":"boston-scientific","type_of_entity":"company","image":{"available_sizes":[[[150,66],"assets/images/resized/0006/0732/60732v2-max-150x150.png"],[[151,67],"assets/images/resized/0006/0732/60732v2-max-250x250.png"],[[151,67],"assets/images/resized/0006/0732/60732v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}