{"first_name":"Mindy","last_name":"Hull","permalink":"mindy-hull","crunchbase_url":"http://www.crunchbase.com/person/mindy-hull","homepage_url":"http://www.mercuryglobalpartners.com","birthplace":"San Francisco, CA","twitter_username":"mmhull","blog_url":"","blog_feed_url":"","affiliation_name":"Mercury Global Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"mercury-global-partners, marketing, pr, press-relations, public-relations, disruption, digital-media, mobile, san-francisco, silicon-valley, amsterdam, paris, london, technology, media, cloud-computing, ecommerce, innovation, venture-capital, ebuddy, dist","alias_list":null,"created_at":"Tue Aug 10 11:29:23 UTC 2010","updated_at":"Wed Aug 11 18:10:38 UTC 2010","overview":"<p>Mindy M. Hull is the Founder and Managing Director of Mercury Global Partners, a multi-discipline, international marketing and PR firm with offices in San Francisco, Amsterdam and Paris. MGP offers strategic guidance combined with tactical execution to companies who seek a blend of traditional and highly creative ways to reach their target audiences. The company is uniquely geared toward providing an unmatched range of 360-degree marketing and PR services in both the online and offline world. Mercury Global Partners is a results-driven independent firm with international experience, expertise and a deep business and media network in the US and pan-European countries, that specializes in working with B2B and B2C companies within the technology, mobile, media, Web 2.0, e-commerce, education, publishing, real estate, and venture capital sectors. </p>\n\n<p>Mindy brings significant executive-level B2B and B2C marketing and business development management experience to her role at Mercury Global Partners, coupled with additional expertise in corporate communications/PR, new product development, and operations within the tech, mobile, Internet, publishing, education, real estate, media and venture capital sectors. For more than 15 years, she has refined an expertise in developing and executing innovative B2B and B2C marketing, PR and business development strategies that consistently generate revenue while promoting goodwill and understanding between companies, their partners, their investors and their publics. Mindy consistently wins media coverage for clients in some of the most respected media outlets in the world including the Financial Times, Wall Street Journal, PC World, Wired, Fast Company, TechCrunch, Mashable, ReadWriteWeb, GigaOm, Business Insider, BBC, and a wealth of trade publications. </p>\n\n<p>Prior to founding Mercury Global Partners, Mindy spent over 10 years working in the publishing and digital media industries including time spent as VP, Business Development for Red Herring, a media and events company appealing to entrepreneurs and VCs, and VP of Marketing and Business Development for Inman News, a leading independent real estate media and technology company focused on online news, events, online communities and research. Mindy also spent six years at the Financial Times (a Pearson PLC company) where she led and developed new products for the education channel as Director of Education – Americas region, and also directed the FT’s daily operations, logistics, printing, production and distribution for the Western U.S. and Canada. Mindy began her career with the E.W. Scripps Co. where she served as Interim Circulation Director and Consumer Sales and Marketing Director for the Daily Camera in Boulder, Colorado, and also as Advertising Account Executive, and Circulation Marketing Manager at Scripps’ flagship newspaper, Rocky Mountain News in Denver, Colorado. </p>\n\n<p>Mindy is frequently called to speak and present at key industry events, and serves as  a Board Advisor to Biz-LX, the online ethics learning simulation company. She attended the University of Colorado at Boulder where she studied Business Administration and Marketing.</p>","image":{"available_sizes":[[[124,150],"assets/images/resized/0009/6860/96860v2-max-150x150.jpg"],[[207,250],"assets/images/resized/0009/6860/96860v2-max-250x250.jpg"],[[356,429],"assets/images/resized/0009/6860/96860v2-max-450x450.jpg"]],"attribution":"<p>Mindy M. Hull</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Founder and Managing Director","firm":{"name":"Mercury Global Partners","permalink":"mercury-global-partners","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0009/7191/97191v4-max-150x150.png"],[[250,100],"assets/images/resized/0009/7191/97191v4-max-250x250.png"],[[375,150],"assets/images/resized/0009/7191/97191v4-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Board Advisor","firm":{"name":"Biz-LX","permalink":"biz-lx","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0010/9209/109209v1-max-150x150.jpg"],[[245,80],"assets/images/resized/0010/9209/109209v1-max-250x250.jpg"],[[245,80],"assets/images/resized/0010/9209/109209v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/mindymhull","title":"LinkedIn"},{"external_url":"http://www.twitter.com/mmhull","title":"Twitter"},{"external_url":"http://www.facebook.com/mindyhull","title":"Facebook"}]}