{"first_name":"Ming","last_name":"Chan","permalink":"ming-chan","crunchbase_url":"http://www.crunchbase.com/person/ming-chan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"The1stMovement","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon May 03 17:44:40 UTC 2010","updated_at":"Tue May 04 22:22:05 UTC 2010","overview":"<p>An Emmy® Award-winning Digital Strategist, Ming founded The1stMovement in 2006 and is currently serving as the CEO/CTO. With offices in California and Colorado, Ming is responsible for growing the agency into a nationally recognized, full-service digital agency boasting many long-standing partnerships with some of the World’s most recognizable brands.</p>\n\n<p>Ming started his career as a software engineer in the Silicon Valley and moved into web design/development and served as the Director of Flash Platform development for Design Reactor, a leading digital marketing agency. His work for clients such as 20th Century Fox, AMD, Apple, HP, Intel, PayPal, Universal Pictures, and many more has been recognized by numerous awards and publications including the Emmy® Technical Excellence Award, Webby Award, FWA awards, KeyArts Awards, ADDY, Omni awards and Horizon Interactive awards. He is also very active in both the local and national Interactive community, and currently serves as a mentor in the American Film Institute&#8217;s Digital Content Lab, and an Interactive member for the National Academy of Television Arts &amp; Science. A proven thought-leader in the digital media industry, Ming speaks regularly at both local and international conferences in North America and Asia.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder & CEO","firm":{"name":"The1stMovement","permalink":"the1stmovement","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0008/5779/85779v2-max-150x150.jpg"],[[250,80],"assets/images/resized/0008/5779/85779v2-max-250x250.jpg"],[[286,92],"assets/images/resized/0008/5779/85779v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}