{"first_name":"Mitch","last_name":"Feinman","permalink":"mitch-feinman","crunchbase_url":"http://www.crunchbase.com/person/mitch-feinman","homepage_url":"","birthplace":"United States","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Google/YouTube","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Nov 01 16:04:29 UTC 2012","updated_at":"Sun Nov 04 00:39:38 UTC 2012","overview":"<p>A leading voice in digital entertainment with over 20 years experience in online, mobile and other new forms of media, Mitch Feinman’s accomplishments have ranged from running the American Idol text-messaging program to launching the first websites for The Oprah Winfrey Show and The Academy Awards. </p>\n\n<p>Currently, Mitch oversees global partnerships for Google specifically for distribution of YouTube’s mobile and TV products/versions on Apple, Sony, France Telecom, Verizon, Virgin Media and SK (Korea), among others. </p>\n\n<p>Previously, Mitch was a Senior Vice President at News Corp., including founding and running Fox Mobile Entertainment, which grew to over $15 million in revenue in 2 ½ years.  During a five year tenure Mitch also managed the hugely successful American Idol program (for which he won a Guinness Book of World Records award for nearly 100 million votes in the show’s seventh season) - and developed new content and distribution channels worldwide, including the FOX InFlight Channel on JetBlue.  In addition, Mitch accomplished numerous industry firsts such as the development of a made-for-mobile original series and coining the term to describe it - Mobisode®.  Based on the television show 24, the first Mobisode Series launched in 25 countries and seven languages in a partnership with Vodafone – the world’s largest wireless provider - and was followed by seven other Mobisode Series.  His work earned him an Emmy nomination for best original entertainment programming created for non-traditional viewing platforms. </p>\n\n<p>In addition to his pioneering efforts in mobile video, Mitch also spearheaded – in partnership with Sprint - the industry’s first ad-supported Mobisode Series, “Prison Break: Proof of Innocence,” sponsored by Toyota Yaris.    Mitch also negotiated licensing and distribution deals for FOX properties that are still best-selling mobile content and games globally, including The Simpsons, Family Guy and Ice Age.</p>\n\n<p>Prior to FOX, Mitch headed ABC’s online business development and marketing at The Walt Disney Company, where during his five-year tenure helped to launch ABCNEWS.com as well as OSCARS.com and Oprah.com in conjunction with The Academy of Motion Pictures Arts and Sciences and Harpo Productions, respectively.  He has also held positions at Regis McKenna, a marketing strategy consulting firm based in Silicon Valley for over 35 years, and Prodigy, the country’s first consumer online service founded by IBM and Sears.</p>\n\n<p>Mitch frequently guest lectures at both UCLA’s prestigious Anderson School of Business as well as USC’s Communications &amp; Technology Management Institute.  He is also a regular speaker/moderator at industry events and conferences, including CTIA WIRELESS, Digital Hollywood and the Mobile Marketing Association (MMA) where he was a member of the Executive Board for 3 years. Mitch graduated magna cum laude with a BA from the University of Pennsylvania and also earned an MBA from the Kellogg School of Management at Northwestern University.</p>","image":null,"degrees":[{"degree_type":"BA","subject":"","institution":"University of Pennyslvania","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"Kellogg Graduate School of Management","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"SVP, FOX Mobile Entertainment","firm":{"name":"News Corp","permalink":"news-corp","type_of_entity":"company","image":null}},{"is_past":false,"title":"Mobile and TV Distribution","firm":{"name":"Google/YouTube","permalink":"google-youtube","type_of_entity":"company","image":null}},{"is_past":false,"title":"VP, Business Development and Marketing, ABC Online","firm":{"name":"Disney Interactive Media Group","permalink":"walt-disney-internet-group","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0001/9000/19000v1-max-150x150.png"],[[162,54],"assets/images/resized/0001/9000/19000v1-max-250x250.png"],[[162,54],"assets/images/resized/0001/9000/19000v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}