{"first_name":"Mitch","last_name":"Muroff","permalink":"mitch-muroff","crunchbase_url":"http://www.crunchbase.com/person/mitch-muroff","homepage_url":"http://www.curaxian.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Mar 05 03:52:54 UTC 2012","updated_at":"Tue Mar 06 20:13:44 UTC 2012","overview":"<p>Mitch Muroff is the CEO and founder of Curaxian Inc. Mitch has over 24 years’ experience in the payments industry and is passionate about improving risk management through better analytics and effective policies and processes. As Director of Electronic Payments and Risk Management for Yahoo! he kept fraud rates low at 30 businesses in 14 countries. Prior to Yahoo!, Mitch was Director of Risk Management for a division of AT&amp;T and developed a transaction screening system from the ground up that was used across 4 global business lines and 10 million customers. Before AT&amp;T he was Lead Program Manager for Microsoft, where he defined and launched the payments infrastructure for shop.microsoft.com and xbox.com. Mitch has consulted for more than 50 leading enterprises in 34 countries representing more than $110B in transaction volume. A recognized thought leader in the payments industry, he is also a founding member of the Merchant Risk Council’s Benchmarking committee. Mitch holds an MBA from the University of Washington and a BA in Finance and Economics from The University of Western Ontario. When he’s not at work, Mitch travels the globe in search of exquisite cuisine and breathtaking kitesurfing adventures.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0017/6960/176960v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0017/6960/176960v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0017/6960/176960v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}