{"first_name":"Mitesh","last_name":"Soni","permalink":"mitesh-soni","crunchbase_url":"http://www.crunchbase.com/person/mitesh-soni","homepage_url":"http://www.infocuswebdesigning.com","birthplace":"ahmedabad","twitter_username":"infocuswebsolu","blog_url":"http://infocuswebdesigning.posterous.com","blog_feed_url":"","affiliation_name":"infocus Web Solutions","born_year":1985,"born_month":1,"born_day":1,"tag_list":"infocus-web-solutions, infocus-web-solutions-pvt-ltd, affordable-seo-services, affordable-web-development, affordable-website-development, customise-web-development, hire-dedicated-developers, hire-dedicated-php-developer, hire-dedicated-php-developers, h","alias_list":null,"created_at":"Tue Sep 07 07:08:08 UTC 2010","updated_at":"Tue Sep 07 23:10:37 UTC 2010","overview":"<p>We are Offshore Web Development Outsourcing Company based on Ahmedabad, India. Since 2009 we provide Web Solution services in E-Commerce, Web Application Development, Internet Marketing and SEO. We are having team of high skilled professional experts who will be taking care of our client’s valuable business services with online reputation. </p>\n\n<p>Hire PHP Developers at Infocus Web Solutions, one of the leading and emerging global IT Solutions providing company with tons of experience. We have a professional team with high skilled experts in custom Website Designing, dedicated Web Development, Dedicated PHP Development, Offshore outsource website application development, PSD Layout Creation, XHTML, CSS Sites, PSD2CSS, Flash Animations, Flash Banners, Logo Creation, Business Branding and a Complete Turnkey Business Solution.</p>\n\n<p>Apart from this, we’ve hire dedicated development teams who are well versed in creating portals sites to start online business. Utilizing the latest technologies such as Joomla, Magento, Oscommerce, Drupal, Wordpress and Flash-Flex, Frameworks like – CakePHP, Zend, Symfony, Codeignitor etc, Templating Engines like - SMARTY to build attractive and strongly functional websites.</p>\n\n<p>We help our clients to harness the wide reach of the Internet by website designing and website developing solutions that helps them market their products to a wider audience. Infocus Web Solutions Pvt. Ltd. has a vision to empower clients with marketing tools that helps their business grow.</p>\n\n<p>Infocus Web Solutions Pvt. Ltd. is a corporation that provides specialized bespoke solutions in web designing and software development. We convey quality solutions for an extensive range of business around the globe. We work with a wide range of customers in our enterprise to offer them cost effective and profitable solutions.</p>\n\n<p>We also use high performance server with high bandwidth and reliable back end support. The company is backed by an experienced team of Graphic designers, Information architects, Copy writers, Creative writers, Marketing specialists, SEO Specialists, Industry-specific specialists and Advisors, who will work with you towards creating the most effective solutions for your target audience.</p>","image":null,"degrees":[{"degree_type":"","subject":"","institution":"infocus Web Solutions Pvt. Ltd.","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Infocus Web Solutions Pvt. Ltd.","firm":{"name":"infocus Web Solutions","permalink":"infocus-web-solutions","type_of_entity":"company","image":{"available_sizes":[[[150,147],"assets/images/resized/0010/0940/100940v2-max-150x150.jpg"],[[250,245],"assets/images/resized/0010/0940/100940v2-max-250x250.jpg"],[[450,442],"assets/images/resized/0010/0940/100940v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"","firm":{"name":"infocus Web Solutions","permalink":"infocus-web-solutions","type_of_entity":"financial_org","image":null}},{"is_past":false,"title":"infocus web solutions","firm":{"name":"infocus Web Solution Pvt. Ltd.","permalink":"infocus-web-solution-pvt-ltd","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.flickr.com/photos/amazingwebdesigner/4933943177/","title":"Infocus Web Solutions Pvt. Ltd."},{"external_url":"http://www.infocuswebdesigning.com/about_us.php","title":"Infocus Web Solutions Pvt. Ltd."}]}