{"first_name":"ML","last_name":"Hayes","permalink":"ml-hayes","crunchbase_url":"http://www.crunchbase.com/person/ml-hayes","homepage_url":"http://metrolocalhost.com","birthplace":"USA","twitter_username":"MLHCo12","blog_url":"http://mlhayes1.wordpres.com","blog_feed_url":"http://feeds.feedburner.com/wordpress/FZdb","affiliation_name":"Unaffiliated","born_year":1955,"born_month":7,"born_day":null,"tag_list":"cloud-computing, metrolocal, metrolocalhost, local-hosting, seo, ghost-writer","alias_list":null,"created_at":"Tue May 31 15:20:55 UTC 2011","updated_at":"Fri Jun 03 17:55:16 UTC 2011","overview":"<p>M. L. &#8220;Mickey&#8221; Hayes is a ghost writer extraordinaire. He doesn&#8217;t write fiction, but instead crafts messages for the cloud of machines which interconnect people to interpret who is trying to convey what message to whom. He constructs SEO content that people read because the machines index his work highly.</p>\n\n<p>Mr. Hayes is a former (retired) certified LAN/WAN networking engineer with over twenty-five years experience in information technology. He founded MetroLocal Hosting Company which offers individuals, businesses and organizations access to his talent. In addition to the years of tech work with Fortune 500 corporations, Mickey obtained valuable experience as a paralegal doing patent research for oil exploration litigants, a peace officer for the State of Texas, and an entrepreneurer.</p>\n\n<p>As an avid blogger, Mr. Hayes applies his investigative skills to a wide range of topics ranging from politics to product / service comparisons. He participates in various charitable causes and supports a number of efforts to make this world a better planet. Many find his original articles insightful and revealing from a practical perspective with an often humorous twist.</p>\n\n<p>The Internet is full of writers who push an agenda or propound on concepts, theories and postulates that appeal to their own egos and senses of righteousness. Mr. Hayes writes messages for those whose prose is less articulate, but none the less worthy to be read.</p>","image":{"available_sizes":[[[48,74],"assets/images/resized/0013/7135/137135v2-max-150x150.jpg"],[[48,74],"assets/images/resized/0013/7135/137135v2-max-250x250.jpg"],[[48,74],"assets/images/resized/0013/7135/137135v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}