{"first_name":"Mónica","last_name":"Edwards-Schachter","permalink":"mnica-edwards-schachter","crunchbase_url":"http://www.crunchbase.com/person/mnica-edwards-schachter","homepage_url":"","birthplace":"Córdoba (Argentina)","twitter_username":"mnicaEdwards","blog_url":"http://www.tendencias21.net/innovacion/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1958,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 22 07:48:19 UTC 2012","updated_at":"Thu Aug 23 18:18:28 UTC 2012","overview":"<p>Mónica Edwards-Schachter is researcher, writer and trainer.    </p>\n\n<p>Mónica Edwards-Schachter is full researcher at INGENIO (JAE-doc programme). She received her Ph.D from the University of Valencia in 2003 with a dissertation on Science-Technology-Society-Environment issues and science education for sustainability (http://lsg.ucy.ac.cy/esera/phd/abstract107.html). Mónica is trained in both natural and social sciences; she holds Degrees in Mathematics and Physics and Electronic Engineering, a Diploma in Knowledge Management for the Latin American Faculty of Social Sciences in 2004 (FLACSO, Mexico) and a Specialization in Engineering and Innovation Projects (Polytechnic University of Valencia, 2006). \nShe participated in several national and international research projects and contracts in areas related to innovation, technology transfer, inter-firm cooperation, knowledge management and competences development. Also got engaged in ten projects on curricular design and planning of engineering degrees within the reform to the European Higher Education Area (EEES).\nDuring 2011 she was Full Researcher at the Torres Quevedo Program (Ministry of Innovation, Spain) developing her activities in the Instituto de Tecnología Cerámica. Previously, from 1991 to 1997 she was Engineer in charge of the Laboratory of Nuclear Magnetic Resonance and Infrared Spectroscopy and Lecturer at the Faculty of Chemistry (University of Cordoba, Argentina). She supervised a doctoral thesis on evaluation of cooperative work and currently is co-supervising thesis on social innovation and development of entrepreneurship and innovation competences. \nMónica has over 20 years of experience in teaching and training and 7 years as consultant in planning and educational innovation in middle and higher education institutions. She taught numerous courses and seminars as visiting professor at the National University of San Martín (UNSAM, Argentina), National University of Córdoba (Argentina), the Technological Institute of Costa Rica, UNITEC (Honduras), Polytechnic University of Madrid, University of Valencia and University of Castilla La Mancha (Spain), among others. Currently she teaches Creativity and Corporate Social Responsibility in the Master of Science and Innovation Management, sponsored by the Organization of Ibero-American States (OEI). Also participates in a training program (5th edition) on motivation and creativity in science education that constitutes an example of good practice in a recent UNESCO report. \nMonica has written over one hundred publications, including books, book chapters, articles and presentations at conferences and seminars. She is blogger of Tendencias21 (http://www.tendencias21.net/innovacion), a science diffusion magazine, and also she received six awards in literature, including a prize for her book Redes para la Paz (Networks for peace), an essay on the interrelationships between peace, environment and sustainable development published in 2007. \nHer main research interests are social innovation, creativity, technological development and sustainability, social innovation, Science-Technology-Society-Environment issues, science and engineering education, competences and skills development, especially in creativity, innovation and entrepreneurship. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/m%C3%B3nica-edwards-schachter/4/37/264","title":"Linkedin profile"},{"external_url":"https://twitter.com/mnicaEdwards","title":"Twitter"},{"external_url":"https://twitter.com/m1ony","title":"Twitter"},{"external_url":"http://www.tendencias21.net/innovacion/","title":"Blogger in Tendencias21"}]}