{"first_name":"Mo","last_name":"Bjornestad","permalink":"mo-bjornestad-3","crunchbase_url":"http://www.crunchbase.com/person/mo-bjornestad-3","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"SensorWave","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jun 23 17:38:23 UTC 2008","updated_at":"Wed Jul 09 20:16:40 UTC 2008","overview":"<p>Mo Bjornestad is the Founder of SensorWave Technology, Inc. (SWT).</p>\n\n<p>In addition to founding SensorWave, Mr. Bjornestad has also co-founded the start up Astral Remote which is also in the surveillance technology market. </p>\n\n<p>Mr. Bjornestad&#8217;s career started with low level hardware and software experience with early machines that includes micro-code and machine code applications, upgrading OSs and compilers, and teaching software design and languages. Next came a decade of great fun, enjoying software development and IT management roles with Fortune 500 companies. </p>\n\n<p>After a successful career in the ranks of the Fortune 500, Mr. Bjornestad discovered, well, actually rediscovered, start ups. He did his first start up in the early 70s. He experienced the negative, painful lesson of being wiped out by the energy crisis in 73-74 and worked for a living for a few more years. </p>\n\n<p>Then in 1980 he got back into start ups and has never looked back. Start ups are hard work but offer a wide range of issues and responsibilities that make every day an exciting opportunity. It is a thrill for Mr. Bjornestad to help start ups to solve problems and advance new ideas.</p>\n\n<p>His start up experience includes starting his own, and running companies for others. He has also been consulting and mentoring new CEOs, jump-starting sales and marketing management, and training executive management for planning and fund raising. He has mentored, consulted, and worked directly with a long list of start up companies including Accellengent (technology marketing), Advance Planning Solutions (business planning and decision support solutions), Astral Remote LLC (surveillance technology integration), ANAtech Corporation (document management software), Apollo Computer (workstations), BARTA (pro bono consulting and mentoring for hundreds of early stage start ups), Cadre Technologies (graphical modeling tools), International Business Accelerator (start up incubator and business accelerator), Mark V Systems (software engineering modeling environments), PortalAuthority (consumer internet appliances), Staffschedule.com (ASP for staff scheduling), and Stanford Management Group (meta data management warehouse and integration mapping toolset). </p>\n\n<p>Mr. Bjornestad holds a Bachelor of Science degree from the University of Wisconsin and he also attended the University of Utah’s International MBA program.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CTO","firm":{"name":"SensorWave","permalink":"sensorwave","type_of_entity":"company","image":{"available_sizes":[[[150,26],"assets/images/resized/0002/0930/20930v1-max-150x150.png"],[[250,43],"assets/images/resized/0002/0930/20930v1-max-250x250.png"],[[292,51],"assets/images/resized/0002/0930/20930v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}