{"first_name":"Mo","last_name":"Hossain","permalink":"mo-hossain","crunchbase_url":"http://www.crunchbase.com/person/mo-hossain","homepage_url":"http://www.ennovance.com","birthplace":"","twitter_username":"MoHossain","blog_url":"http://ennovance.blogspot.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"httpennovance-comindex-fileshossain-htm","alias_list":null,"created_at":"Fri Oct 14 19:13:55 UTC 2011","updated_at":"Sun Oct 30 03:20:54 UTC 2011","overview":"<p>Ennovance Capital was founded by a veteran of chemical industry who learned first hand about the benefits of practical experience and mastering functional expertise while working in engineering, finance, marketing, sales, strategy, M&amp;A, business development and business P&amp;L management while living and travelling around the world on behalf of premium global companies.  Mr. Hossain possesses broad global business experience covering start-up ventures such as Apex Products to Fortune 500 companies Nalco Chemical (formerly Nalco/Exxon Energy Chemicals) and the Rohm and Haas Company (now Dow Chemical).  He began his tenure as an engineer and in the following years held positions of increasing responsibility in leadership roles ultimately rising to the level of General Manager and Vice President. Mr. Hossain was instrumental in launching several emerging technologies and multiple new product lines while creating important strategic partnerships and alliances to deliver profitable business growth. He gained extensive experience improving the performance of complex enterprises. He has also distinguished himself as a pragmatic strategist who can execute by bringing people together and as an experienced advisor/counselor to senior executive teams and entrepreneurs, with a track record of helping such individuals improve their respective companies’ operations.  Mr. Hossain has served on both corporate advisory boards and not-for-profit organizations, including the Self-Freedom Foundation. </p>\n\n<p>Mr. Hossain holds a B.S. in Chemical Engineering from Mississippi State University and earned his M.B.A. from the University of Houston.  He also completed the Executive Management Program at The Wharton School at the University of Pennsylvania.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}