{"first_name":"MobGold","last_name":"Ad Network","permalink":"mobgold-ad-network","crunchbase_url":"http://www.crunchbase.com/person/mobgold-ad-network","homepage_url":"http://www.mobgold.com","birthplace":"Hong Kong","twitter_username":"mobgold","blog_url":"http://www.mobgold.com/updates/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1980,"born_month":9,"born_day":26,"tag_list":"mobile, advertising, network, sdk, advertiser, publisher, agencies, application, developer, technology","alias_list":null,"created_at":"Wed Jan 26 10:00:19 UTC 2011","updated_at":"Thu Feb 03 07:42:58 UTC 2011","overview":"<p>MobGold is Mobile Advertising Network</p>\n\n<p>One Stop Solution for Mobile Advertising Needs</p>\n\n<p>MobGold is one of the fastest growing mobile advertising network in the world. MobGold develops and operates MobGold Network, the mobile advertising network and mobile transaction solutions for advertisers, brand owners,\npublishers, network operators, web portals and mobile phone retailers to monetize their user traffic around the world.</p>\n\n<p>With expertise in architecture design of high traffic high speed transaction platform, web development and mobile content provisioning, MobGold is uniquely positioned to offer complete end-to-end solutions for both advertisers and publishers from advertisement format conversion, campaign management, statistic, to final delivery and billing. MobGold believes that mobile is the future of digital marketing.</p>\n\n<p>About MobGold\nFounded in 2008, MobGold allows advertisers to reach their customers on the\nmobile sites and publishers to monetize their traffics from mobile sites.\nMobGold offers both advertisers and publishers the ability to target and\npersonalize advertising to their customers in over 100 countries.</p>\n\n<p>Vision\nTo be the leader in mobile advertising industry in the world.</p>\n\n<p>Mission\nâ— By using state of the art inventory system to serve the most relevant ad to\ntarget audience\nâ— To build strategic business relationships with our advertisers and publishers\nâ— To provide outstanding opportunities and the best working environment for\nour employees</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0011/9062/119062v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0011/9062/119062v2-max-250x250.jpg"],[[450,450],"assets/images/resized/0011/9062/119062v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}