{"first_name":"Mobi","last_name":"Stealth","permalink":"mobi-stealth","crunchbase_url":"http://www.crunchbase.com/person/mobi-stealth","homepage_url":"http://www.mobistealth.com","birthplace":"","twitter_username":"blackberry_spy","blog_url":"http://www.mobilespysoft.com/","blog_feed_url":"http://www.mobilespysoft.com/feed/","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"mobistealth, cellphone, cell-spy-software, mobile-spying-software, blackberry-spy-apps, android-spy-software, sombian-os-spy, nokia-cell-phone-spy-software","alias_list":null,"created_at":"Sun Aug 15 08:11:15 UTC 2010","updated_at":"Mon Aug 16 18:50:48 UTC 2010","overview":"<p>MobiStealth is a Ultimate cell phone spy software for Blackberry, Android &amp; Symbian OS Smart Phones.</p>\n\n<p>Cell Spy Software is the next generation of spy software which allows you to secretly record all activities of your iPhone, iPad, BlackBerry, Android, Windows Mobile or Symbian OS phone. Cell Spy Software allows you to secretly record all phone activities. Silently record every SMS message. View information about every call (including phone numbers with durations). See GPS positions every thirty minutes. View all photos and videos taken by the phone. See all the log results in your SSL Secured online account. You can login anytime from any location to view the results without needing access to the phone. Cell Spy Software starts at every boot of your phone, in stealth mode.</p>\n\n<p>Cell Spy Software helps you to enforce employee wireless policies, monitor your cheating spouse, monitor your teens, backup your own cell phone activities. Cell Spy Software can help you secretly spy on a cell phone user, know who they&#8217;ve been talking to, they&#8217;ve been messaging, and even locate their GPS location. Now, go to &lt;a href=&quot;http://www.mobistealth.com&quot;&gt;www.mobistealh.com&lt;/a&gt; and buy this amazing mobile phone spy apps.</p>","image":{"available_sizes":[[[150,63],"assets/images/resized/0009/7746/97746v2-max-150x150.png"],[[213,90],"assets/images/resized/0009/7746/97746v2-max-250x250.png"],[[213,90],"assets/images/resized/0009/7746/97746v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.mobistealth.com","title":"Mobile Spy Software"}]}