{"first_name":"mohamed","last_name":"adel","permalink":"mohamedd-adel","crunchbase_url":"http://www.crunchbase.com/person/mohamedd-adel","homepage_url":"http://www.gulfsip.com","birthplace":"Egypt","twitter_username":"mohamed_A_","blog_url":"https://blog.gulfsip.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1985,"born_month":10,"born_day":24,"tag_list":"","alias_list":null,"created_at":"Tue Oct 11 01:28:55 UTC 2011","updated_at":"Fri Oct 28 23:18:58 UTC 2011","overview":"<p>The Best VOIP Technology Provided by : </p>\n\n<p>GULFSIP Voip Provider</p>\n\n<p>What is GULFSIP Telecom ???</p>\n\n<p>1- GULFSIP is the first Arabian Network for the most advanced communication users over the Internet.</p>\n\n<p>2- GULFSIP network is designed in Kuwait-Egypt-Bahrain by the hand of </p>\n\n<p>more than 60 Arabian communication engineers and developers with expertise and global companies.</p>\n\n<p>3- There are a lot of communication networks worldwide (such as Skype and Vonage) but what </p>\n\n<p>distinguishes GULFSIP network is that it has the most advanced technologies which surpassed the rest of the companies mentioned&#8230;</p>\n\n<p>4- GULFSIP has many production lines in internationally classified communication factories that manufacture all GULFSIP communication products such as GULFSIP ATAs.</p>\n\n<p>5- All GULFSIP products are certified to the International American and European quality. (FCC + CE License)</p>\n\n<p>6- GULFSIP is the first communication network that provides Radio Channel service through the VOIP Service. You can listen to all Arabian Channels free of charge wherever you are.</p>\n\n<p>7- GULFSIP works with I-Phone, I-Pad, Android, Nokia and PC Software.</p>\n\n<p>8- GULFSIP gives you the ability to send SMS to any Mobile Network in the world free of charge.</p>\n\n<p>9- GULFSIP is delighted to co-operate with you to provide solutions and communication systems which </p>\n\n<p>owns at least 70% of your saving in foreign calls through our international network.</p>\n\n<p>10- As any communication network, we have a lot of nice and useful features that might be very helpful for you and for your business.</p>\n\n<p>Please Visit our website to check all these Features www.gulfsip.com</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}