{"first_name":"Mohit","last_name":"Budhraja","permalink":"mohit-budhraja","crunchbase_url":"http://www.crunchbase.com/person/mohit-budhraja","homepage_url":"http://www.ozonefortis.net/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"fingerprint-access-control-systems, door-phone-systems, fire-detection-systems, intruder-alarm-systems, keypad-access-control-systems, ozone-fortis-technologies-pvt","alias_list":null,"created_at":"Tue Apr 17 11:01:01 UTC 2012","updated_at":"Sun Apr 22 07:24:36 UTC 2012","overview":"<p>Ozone Fortis Technologies Pvt. Ltd</p>\n\n<p>We Ozone Fortis, are reputed suppliers offering a wide range of security control systems, digital access control systems and industrial access control systems. These include access controller, finger print access, door phone system, door buttons, intruder alarm systems, CCTV systems, automation and fire control systems. Established in New Delhi, in the year 1999, we are led under the able guidance of Mr. Mohit Budhraja. His able handling of the operations, extensive industry experience and dedicated support of our team assist us in procuring &amp; delivering latest technology based systems as per clients specific demands. Today, our capability of supplying accurate and high quality electronic security and manning systems has helped us in emerging as leading suppliers in our industry sector. Further, their competitive market prices has also helped us to make many quality concious clients in the domestic and overseas regions.</p>\n\n<p>We lay supreme importance on the quality &amp; performance aspects of our access control systems, finger print access systems and CCTV systems to ensure that the range of products offered by us successfully meet the diverse needs according to the prevailing market norms. Our quality personnel are also engaged in conducting the frequently checks right from the procurement stage till the dispatch of the consignment to our esteemed clients. </p>\n\n<p>Our organization was founded by Mr. Mohit Budhraja, who is a well qualified and experienced person. Holding degree in aeronautical engineering, he worked on the idea of offering clients valuable solutions regarding their varied security systems demands.</p>\n\n<p>Under his valuable guidance, we have been able to successfully meet the market demands and assure 100% reliability and accuracy in our range of security based solutions.</p>\n\n<p>Telephone:  +(91)-(11)-29220157 </p>","image":{"available_sizes":[[[150,82],"assets/images/resized/0018/4623/184623v2-max-150x150.jpg"],[[200,110],"assets/images/resized/0018/4623/184623v2-max-250x250.jpg"],[[200,110],"assets/images/resized/0018/4623/184623v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}