{"first_name":"Mohsin","last_name":"Hussain","permalink":"mohsin-hussain","crunchbase_url":"http://www.crunchbase.com/person/mohsin-hussain","homepage_url":"","birthplace":"","twitter_username":"mohsinh","blog_url":"","blog_feed_url":"","affiliation_name":"EcoFactor","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Jun 03 07:32:04 UTC 2012","updated_at":"Sat Jun 09 15:53:02 UTC 2012","overview":"<p>Mohsin is CTO and VPE at EcoFactor. Prior to joining EcoFactor, Mohsin was  Director of Software Engineering at SunPower Corporation (SPWR) where he led the development of embedded software products and data analytics for its SaaS platform to simulate, measure, validate and optimize the power generation of the company&#8217;s solar power plants. Prior to his time at SunPower, Mohsin was Vice President, R&amp;D at NextAxiom Technology, a technology firm specializing in real-time system integration solutions for the Energy &amp; Utility industry. While there, he oversaw the product roadmap, architecture and development of the NextAxiom platform integrating components of grid management software, asset management and business workflows using open communication industry standards.</p>\n\n<p>Mohsin also spent seven years building agile software teams delivering large-scale high-availability consumer services while at Netscape and through its acquisition by AOL. His work in real-time alerting, data communications, and web 2.0 applications is being used by tens of millions of users around the world. Mohsin is an inventor of five issued patents and six patent-pending technologies, and holds a BA in Computer Science from University of California at Berkeley.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CTO and VP Engineering","firm":{"name":"EcoFactor","permalink":"ecofactor","type_of_entity":"company","image":{"available_sizes":[[[150,43],"assets/images/resized/0007/1738/71738v2-max-150x150.png"],[[249,72],"assets/images/resized/0007/1738/71738v2-max-250x250.png"],[[249,72],"assets/images/resized/0007/1738/71738v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}