{"first_name":"Molly","last_name":"Cain","permalink":"molly-cain","crunchbase_url":"http://www.crunchbase.com/person/molly-cain","homepage_url":"http://www.glassheel.com","birthplace":"Dallas","twitter_username":"mollycain","blog_url":"http://www.blogs.forbes.com/glassheel","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1981,"born_month":3,"born_day":10,"tag_list":"glassheel-com, women-in-the-workplace, career, professional","alias_list":null,"created_at":"Tue Feb 28 22:08:11 UTC 2012","updated_at":"Sun Mar 04 23:02:22 UTC 2012","overview":"<p>Molly Cain is the Founder and Editor-In-Chief of Glass Heel, a leading women&#8217;s career, lifestyle and networking site which launched in 2011. She is an award-winning communicator, humor columnist and Forbes contributor, specializing in topics ranging from career development, women&#8217;s issues and leadership to banking and information security. Molly&#8217;s career began in public relations and has evolved into the management of internal communications strategy for Fortune 1000 to Fortune 20 organizations in a variety of industries, including her current role as a banking executive. </p>\n\n<p>Molly lives in Dallas, Texas, with her retired racing greyhounds and a never-ending desire to create. She loves to push the envelope when it needs a good shove in the right direction. Molly is a champion plate spinner (of the figurative kind), lover of good wine, golf enthusiast, destination racer, animal rescue foster mom, southpaw and expert in procrastination. It&#8217;s also been proven that she can flip a monster truck tire approximately 31 times in a row.</p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0017/6242/176242v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0017/6242/176242v2-max-250x250.jpg"],[[450,300],"assets/images/resized/0017/6242/176242v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}