{"first_name":"Mort","last_name":"Collins","permalink":"mort-collins","crunchbase_url":"http://www.crunchbase.com/person/mort-collins","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 12 08:27:57 UTC 2009","updated_at":"Fri Jun 12 08:29:34 UTC 2009","overview":"<p>Mort is a General Partner of Battelle Ventures and Innovation Valley Partners. For four decades he has demonstrated major successes in the fields of life sciences, electronic materials, communications and software.  He serves as chairman of the Boards of Directors of portfolio companies Hepregen Corp., Sypherlink, Inc., and CDI Bioscience, Inc., and is a member of portfolio company ImageTree Corp.’s Board of Directors.</p>\n\n<p>In addition, Mort sits on the Boards of publicly traded Kopin Corp., Strategic Diagnostics, Inc., as well as on the Boards of privately held Pharos LLC and Viral Genomics, Inc. He also is chairman of PD-LD, Inc.’s Board.</p>\n\n<p>Mort is chairman of the Advisory Council to the Chemical Engineering Department at the University of Delaware; a member of the Leadership Council of the School of Engineering and Applied Sciences at Princeton University; and is a member of the Systems Biology Advisory Council at the Institute for Advanced Study, Princeton, N.J.</p>\n\n<p>Mort chaired President Ronald Reagan’s Task Force on Innovation and Entrepreneurship and served as technology policy advisor to President George H.W. Bush. He has served on the New Jersey Governor’s Commission on Science and Technology, the New Jersey Governor’s Superconductivity Roundtable, and is a member of the Research Roundtable of the National Academy of Sciences. </p>\n\n<p>A former president, director and chairman of the National Venture Capital Association, Mort was the recipient of the 1989 University of Delaware Medal of Distinction, the  1990 New York Venture Forum Award and the 1992 Delaware Valley Venture Group Award.</p>\n\n<p>In 1968 Mort founded Data Science Ventures (DSV), a pioneering venture-capital firm that had offices in Princeton, N.J., and Newport Beach, Calif.  For 30 years Collins was a managing partner in four DSV partnerships that specialized in early-stage financing of such high-technology companies as Datapoint, General Automation, Tandem Computers, Datacom Systems, The Liposome Company, Apollon and Alkermes. In 1997 Mort became a special limited partner of Cardinal Partners, the successor to the DSV series of partnerships.</p>","image":{"available_sizes":[[[125,150],"assets/images/resized/0004/8150/48150v1-max-150x150.jpg"],[[125,150],"assets/images/resized/0004/8150/48150v1-max-250x250.jpg"],[[125,150],"assets/images/resized/0004/8150/48150v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Battelle Ventures","permalink":"battelle-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,19],"assets/images/resized/0004/8148/48148v1-max-150x150.png"],[[250,33],"assets/images/resized/0004/8148/48148v1-max-250x250.png"],[[450,59],"assets/images/resized/0004/8148/48148v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}