{"first_name":"motion","last_name":"trip","permalink":"motion-trip","crunchbase_url":"http://www.crunchbase.com/person/motion-trip","homepage_url":"http://www.motiontrip.com","birthplace":"new delhi","twitter_username":"","blog_url":"http://www.motiontriptravel.blogspot.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1980,"born_month":1,"born_day":1,"tag_list":"indian-travel-company, indian-travel-tour-packages, tours-and-travels-package-in-india, indian-tours-and-travels, tours-operators-in-india","alias_list":null,"created_at":"Tue Jan 04 06:40:10 UTC 2011","updated_at":"Mon Jan 31 03:01:41 UTC 2011","overview":"<p>The organization is headed &amp; professionally managed by people having vast experience in hospitality business. With our central location in Delhi, we are equipped with requisite infrastructure &amp; an excellent network of ground handling agents covering all of Indian Sub Continent. We have been successfully handling repeat business from our principals located worldwide for their individual &amp; group traffic. Catering to different markets namely The US, UK ,Russian &amp; some ad-hock markets. With an unprecedented growth rate along with the support of our Team have marked a name in the respective markets.</p>\n\n<p>Offering all types of Premier, Standard &amp; Budget class packages with personalized services within India &amp; neighboring counties with wide range of combination&#8217;s with varying requirements. With our Expertise in Cultural, Spritual, religious, Tribal ,Battlefields of India &amp; Wildlife along with basic Package for Rajasthan, Kerala &amp; other major Tourist destination in India. We not only allow the sensitive handling of protocol but also cater to the exceptional travel needs of our distinguished guests. With a team of experienced &amp; dedicated travel professional, we ensure every holiday that you take with us is a memorable affair.</p>\n\n<p>We offer a comprehensive range of tourism services, which is sure to match all your specific requirements:</p>\n\n<p>Specialise in handling Incoming Tours including individuals and Group travelers, delegations and charters.\nTransfers, Sightseeing and excursions.\nAssistance on arrival and departure.\nAir and Train reservations.\nServices of multilingual Guides &amp; Escorts\nHotel bookings &amp; Confirmations\nTransport hire.(Having our own brand new fleet of vehicles)\nBooking in Hotels, Heritage castles, studios apartments, bungalows, &amp; villas\nGroup Excursions\nWedding packages\nConferences &amp; Meetings\nGroup and private guided excursions.\nGroup Incentives\nSpecial interest tourism\nBusiness travel\nÀ la Carte tailored arrangements for independent travelers\nCustom-designed tours for groups\nWe would very much appreciate if you could forward us your queries through email, Phone or fax, so that we may send you our best deals and more info about our services, whereby we can help you to look after your clients more professionally.\nmore info visit: http://www.motiontriptravel.blogspot.com/</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}