{"first_name":"Mr. Ataul","last_name":"U.","permalink":"mr-ataul-u","crunchbase_url":"http://www.crunchbase.com/person/mr-ataul-u","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"medical-gas-cylinders, propane-gas-cylinders, luxfer-gas-cylinders, oxygen-gas-cylinders, nitrogen-gas-cylinders, high-pressure-gas-cylinders, argon-gas-cylinders","alias_list":null,"created_at":"Wed Apr 18 12:39:59 UTC 2012","updated_at":"Tue Apr 24 09:32:29 UTC 2012","overview":"<p>A. A. Traders</p>\n\n<p>Incepted in 1999, we - “A. A. Traders”, are proud to introduce ourselves as one of the leading names engaged in the exporting of gas cylinders, industrial liquid gases and calibration gases. Manufactured as per international quality standards by leading manufacturers, we make sure each of our supplied liquid gases has the proper composition of various ingredients. In addition to this we also ensure that our supplied gas cylinders have low maintenance cost. Requisite efficacy, safety packaging &amp; adherence to industrial standards are some of the exclusive features that have made our products widely popular. We are one of the few names to implement proper market plans that further enable us to establish our product in any market with a good response from the buyers.</p>\n\n<p>Made from premium quality materials our products are defect free. At our premise, we provide high quality products with competitive prices to assure buyer&#8217;s profit. Our wide line that includes Gas Cylenders, Cryocan/Dewars of liquid nitrogen, Pressurised Cryotank for Liquid Nitrogen, Liquid Oxygen and Liquid Argon, Gas Regulators, Medical Gases, Liquid Nitrogen, Ultra High Purity Gases(UHP) like Argon, Helium, Nitrogen, Oxygen, Nitrous-oxide, Zero-air, Co2, Hydrogen, So2, Acetylene(D.A.) for Gas Chromatography, Spectrometers and Laser Cutting Machines are widely used in Pharmaceutical, Medical, Engineering and FMCG sectors. It is also to be noted that each of our gas cylinders is very simple to operate and can be installed easily. In addition to trading of the above-mentioned products we also execute shrink-fitting jobs, as per client’s requirement.</p>\n\n<p>Quality has always been an important aspect for the products we promote. Being a customer-centric firm, we ensure top-notch quality standards, and adopt quality management program. We conduct various tests on each product and ensure to deliver defect-free product with best quality finish. We have appointed a team of quality professionals, who have complete knowledge about the products and accordingly plan out and work in a coordinated manner. Equipped with all the latest testing equipment and tools to enhance and improvise on the quality of the products, our quality inspectors, perform various tests on the procured items. We ensure that our product meets the requirements in accordance with applicable laws, in an ethical manner. In addition to this our qualified quality control inspectors are also engaged in real time tracking of all import and export cargo.</p>\n\n<p>Telephone:  +(91)-(22)-25778611/ 25778610/ (22)67031239 </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}