{"first_name":"Mr.","last_name":"Ashish","permalink":"mr-ashish","crunchbase_url":"http://www.crunchbase.com/person/mr-ashish","homepage_url":"http://www.digitexindia.net/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"printing-solutions, fabric-printing-solutions, industrial-printing-solutions, industrial-fabric-printing-solutions","alias_list":null,"created_at":"Tue May 29 06:54:09 UTC 2012","updated_at":"Sat Jun 02 03:47:09 UTC 2012","overview":"<p>Digitex India Inc</p>\n\n<p>Digitex India Inc. India Inc. is a renowned name in the field of digital textile printing solution. The company offers a wide range of textiles printing solutions to meet the various requirements of the textile industry.</p>\n\n<p>We use production methods that influence both the design aesthetics as well as styles. With the use of latest digital fabric printing technology we have redefined the printed textile design. Our professionals provide quality digital textile printing solution, where there is no limit on the use of colors and designs. Scanned images from the pieces of art, photos and designs with multiple color and grading are printed with utmost precision. There is also no limitations on minimum production quantity.</p>\n\n<p>At Digitex India Inc., quality is our speciality. To achieve excellence in our services and solutions we have adopted stringent quality control procedures to ensure that our clients receive only the best. Our quality control professionals are highly experienced and they supervise the various stages of printing and other activities to ensure high quality standards thereby providing maximum satisfaction to our clients.</p>\n\n<p>By providing high quality digital printing solutions, we have established ourselves as one of the leading players in our sphere of activity across the globe. We take pride in our excellent track record for serving our clients with consistently superior &amp; creative digital printing solutions. </p>\n\n<p>Phone : +(91)-(120)-4779600/4333311</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}