{"first_name":"Amitoz","last_name":"Singh","permalink":"mr-amitoz-singh","crunchbase_url":"http://www.crunchbase.com/person/mr-amitoz-singh","homepage_url":"http://www.supportmart.net/supportmart-management-team/amitoz-singh","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"SupportMart Technical Services","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Dec 23 14:55:09 UTC 2011","updated_at":"Fri Nov 02 04:28:29 UTC 2012","overview":"<p>Amitoz is the CEO and Co-Founder of SupportMart Technical Services, and the visionary leader behind the firm’s competitive business strategy. With his flair for technology and business acumen, spanning over 20 years, Amitoz managed and established big ticket IT &amp; Mortgage Ventures/startups, taking them from a fledgling state all the way to prime contender spots. Quick grasp on seamlessly changing technologies made him to use “Information Technology” work for the business objectives, offering IT strategic guidance to the organizations, IT infrastructures, and enabling major business processes through IT enhancements. A Management post graduate in Finance from the University of Western Sydney, Amitoz played challenging and powerful  roles in different acquittances. He is also an active member of the Finance Brokers Association of Australia (FBAA) as well as the New Zealand Mortgage Brokers Association (NZMBA).</p>\n\n<p>Under his leadership, SupportMart achieved a Customer Satisfaction Rating of over 93% delivered by 500+ tech experts. Being an industry leader in tech support while serving individual customers and Small to Medium Businesses across top tier countries, the company handles an average of over 4000 computer problems every day. SupportMart’s skyrocketing growth and success have been made possible owing to a meticulous, no-holds-barred approach to Customer Service, as envisioned by Amitoz. This is evident in the conceptualization and wide-scale deployment of SMART, a state-of-the-art CRM, and the brainchild of Amitoz himself. Developed in-house, SMART employs a cutting-edge behavioral technology for recording, organizing, and retrieving detailed accounts of every single interaction with customers, ensuring transparency and efficiency of services. This Global Delivery Platform supplies complete customer details to the SupportMart experts with a single click. SMART act as a one-stop solution for Sales Management and Customer Service.</p>\n\n<p>Amitoz began his successful career as the General Manager of New Era Consultants inclined towards IT Consulting. In this position, he led the operations across several business and technology segments within the organization. Drawing on his intensive exposure to the rapidly changing IT industry, Amitoz pioneered the creation of an IT Consulting framework that helped clients streamline process technology and deliver unique solutions with strategic agility.</p>\n\n<p>Amitoz is also the Founder-Director of Go4Loans, a Mortgage Originator established in 2006 to cater directly to the mortgage retail markets in Sydney and Melbourne. He steered the company along a focused and fast track growth curve, managing over $450 million in residential loans, before its eventual acquisition in 2010.</p>\n\n<p>With his in-depth understanding of the tech support industry and immense experience in delivering turnkey solutions across business verticals, Amitoz has shaped a work culture at SupportMart that’s inspiring, innovative, and truly Powered by Solution.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0021/7902/217902v2-max-150x150.jpg"],[[150,150],"assets/images/resized/0021/7902/217902v2-max-250x250.jpg"],[[150,150],"assets/images/resized/0021/7902/217902v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder & CEO","firm":{"name":"SupportMart Technical Services","permalink":"supportmart-technical-services","type_of_entity":"company","image":{"available_sizes":[[[150,51],"assets/images/resized/0016/7895/167895v2-max-150x150.jpg"],[[217,75],"assets/images/resized/0016/7895/167895v2-max-250x250.jpg"],[[217,75],"assets/images/resized/0016/7895/167895v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.supportmart.net/supportmart-management-team/amitoz-singh/","title":"Amitoz is the visionary leader behind the company's competitive business strategy"}],"web_presences":[]}