{"first_name":"Ashish","last_name":"Khanna","permalink":"mr-ashish-khanna","crunchbase_url":"http://www.crunchbase.com/person/mr-ashish-khanna","homepage_url":"http://www.supportmart.net/supportmart-management-team/ashish-khanna","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"SupportMart Technical Services","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Dec 23 14:55:09 UTC 2011","updated_at":"Fri Nov 02 04:28:29 UTC 2012","overview":"<p>Ashish is the President of SupportMart Technical Services, the man in charge to lead the company’s overall strategic direction in Online Marketing and Business Development verticals. A Postgraduate in Marketing from the Australian Catholic University, Ashish has a rich experience of over 12 years identifying and spearheading business development initiatives with focus on scaling up business and customer base. As the head of Online Marketing units across organizations, he also specializes in promulgating brand awareness and developing benchmark criteria for targeted advertising.</p>\n\n<p>Ashish has been with SupportMart since its inception, and has played a key role in shaping the company’s marketing and communications strategy through targeted online advertising campaigns. He is credited with envisioning and implementing a tactical roadmap to put forth the online face of SupportMart consistent with the company’s service offerings and unique selling proposition. With his up-to-date knowledge of the latest trends in online brand building &amp; advertising best practices, and a perceptive mind, Ashish has pioneered major marketing process improvements with immediate yields in customer engagement and brand recognition.</p>\n\n<p>Prior to joining SupportMart, Ashish was leading the Online Marketing Team at New Era Consultants, a premier IT Consulting enterprise. With its forte in sales and online marketing, the group is currently handling more than $1 billion worth of customer base. Here, Ashish brought his unique expertise in technology driven acquisition of online creative assets and optimal allocation of marketing resources for brand promotion, in line with the corporate direction.</p>\n\n<p>Given his deep domain expertise in call-to-action oriented advertising and a focused approach to tackling the competitive IT landscape, Ashish is an invaluable asset to SupportMart. Off the President’s seat at SupportMart, Ashish Khanna is an active sportsman and is a staunch believer that ‘the best is yet to come!!’</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0021/7903/217903v2-max-150x150.jpg"],[[150,150],"assets/images/resized/0021/7903/217903v2-max-250x250.jpg"],[[150,150],"assets/images/resized/0021/7903/217903v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President","firm":{"name":"SupportMart Technical Services","permalink":"supportmart-technical-services","type_of_entity":"company","image":{"available_sizes":[[[150,51],"assets/images/resized/0016/7895/167895v2-max-150x150.jpg"],[[217,75],"assets/images/resized/0016/7895/167895v2-max-250x250.jpg"],[[217,75],"assets/images/resized/0016/7895/167895v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.supportmart.net/supportmart-management-team/ashish-khanna/","title":"Ashish plays a key role in shaping the company's marketing and communications"}],"web_presences":[]}