{"first_name":"Mr.","last_name":"Privasia","permalink":"mr-privasia","crunchbase_url":"http://www.crunchbase.com/person/mr-privasia","homepage_url":"http://www.privasiatrading.com/","birthplace":"Gurgaon","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1985,"born_month":1,"born_day":15,"tag_list":"processed-agro-products, food-products-and-spices","alias_list":null,"created_at":"Wed Oct 13 07:04:59 UTC 2010","updated_at":"Wed Oct 13 19:15:36 UTC 2010","overview":"<p>We, Privasia Trading, are one of the leading organizations engaged in trading, distributing and supplying of Processed Agro Products, Food Products and Spices. The entire range of our products is carefully sourced from consistent and trusted vendors so as to ensure that only quality enriched range is delivered to our valued clients. Also, our team of quality controllers thoroughly checks the entire assortment at each and every stage. Further, the range is safely packed and dispatched to our huge base of clients around the country.</p>\n\n<p>Our organization capitalizes on its healthy sales &amp; service relationship with a number of renowned players in the Indian food service industry. We endlessly endeavor to satisfactorily meet the appetites of our wide client base with our range of hygienic and deliciously processed food. Branded food products, which are rated highly in terms of consistency and exceptional quality, are offered by our organization and all of these brands are in line with the most stringent standards of food safety and sanitation.</p>\n\n<p>Our organization is one of the reputed firms that has established under the dynamic leadership of Mr. Anil Aswani. His rich industry experience and in-depth knowledge has enabled us to achieve the complete client satisfaction spread all across the country.</p>\n\n<p>We are counted amongst one of the recognized traders, distributors and suppliers of Processed Agri Products, Food Products and Spices. To ensure the high quality and purity, our range of products is procured from reliable and consistent vendors chosen across the country. Also, we check our range on various quality parameters to meet the quality demands of our esteemed clients and food &amp; beverages industry.</p>\n\n<p>Features:</p>\n\n<pre><code>* Rich in taste\n* Premium quality\n* Pure and safe to use\n* Rich aroma\n* Fresh\n* Highly nutritious\n* Hygienically processed\n* Superior shelf life\n</code></pre>\n\n<p>Privasia Trading\nMr. Privasia\nPhone: +(91)-(124)-4053388\n601, Galleria, D. L. F. Phase IV\nGurgaon, Haryana - 122 009, India  - http://www.privasiatrading.com/</p>","image":{"available_sizes":[[[150,51],"assets/images/resized/0010/5353/105353v2-max-150x150.jpg"],[[250,85],"assets/images/resized/0010/5353/105353v2-max-250x250.jpg"],[[350,120],"assets/images/resized/0010/5353/105353v2-max-450x450.jpg"]],"attribution":"<p>Privasia Trading</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.privasiatrading.com/","title":"Privasia Trading"}]}