{"first_name":"Mr.","last_name":"Robert Paull","permalink":"mr-robert-paull","crunchbase_url":"http://www.crunchbase.com/person/mr-robert-paull","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon May 10 12:52:17 UTC 2010","updated_at":"Wed Mar 14 13:49:40 UTC 2012","overview":"<p>Mr. Robert Paull is a Co-Founder and Managing Partner of Lux Capital, focusing on ventures in life sciences. Robert graduated from the University of Virginia and is a member of the Regional Selection Committee for UVA&#8217;s Jefferson Scholars Foundation. Robert is also a member of Motorola&#8217;s Research Visionary Board and an invited lecturer at the Memorial Sloan-Kettering Cancer Center, the National Cancer Institute, Yale University, Georgetown, and the University of Virginia. He has been published in Journal of Biomedical Materials Research(Applied Biomaterials) and Nature Biotechnology. Robert manages Lux Capital&#8217;s investments in Cerulean Pharmaceuticals (pharmaceutical nanoencapsulation), Magen Biosciences (dermatology) [Acquired by PPD], Molecular Imprints (semiconductor imprint lithography), Kereos (targeted nanoparticle diagnostics), and Visterra, Inc. (infectious diseases). Robert was founding CEO and is currently on the board of directors at Harvard Medical School spinout Genocea Biosciences (vaccine discovery). In 2009, Robert was nominated as Biotech CEO of the Year at the World Vaccine Congress. In 2010, Robert was selected as one of the &#8220;100 of the Most Inspiring People&#8221; by PharmaVoice Magazine. Robert is Co-Founder of Lux Research (emerging technology research), and has served as an advisor to the Bill &amp; Melinda Gates Foundation.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO and Director","firm":{"name":"Kala Pharmaceuticals","permalink":"kala-pharmaceuticals","type_of_entity":"company","image":{"available_sizes":[[[150,66],"assets/images/resized/0017/8187/178187v1-max-150x150.jpg"],[[250,110],"assets/images/resized/0017/8187/178187v1-max-250x250.jpg"],[[253,112],"assets/images/resized/0017/8187/178187v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}