{"first_name":"Ms","last_name":"Ritu","permalink":"ms-ritu-2","crunchbase_url":"http://www.crunchbase.com/person/ms-ritu-2","homepage_url":"http://www.dnacenterindia.com","birthplace":"India","twitter_username":"dnatestindia","blog_url":"http://www.dnatestindia.wordpress.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1979,"born_month":2,"born_day":18,"tag_list":"dna, paternity, dna-testing, paternity-testing, relationship-dna, sibling-dna, immigration-dna, legal-dna, parental-test, dna-test-india, paternity-test, dna-test-center, dna-banking, immigration-dna-testing, dna-testing-lab, identity-testing, grandparent","alias_list":null,"created_at":"Thu Feb 17 14:59:51 UTC 2011","updated_at":"Fri Feb 18 00:34:00 UTC 2011","overview":"<p>One Touch Solution and Services is specialist provider of DNA Paternity testing which is most accurate and affordable. For peace of mind, you can be 100% assured that your DNA test is processed through their internationally accredited DNA testing laboratory.\nFor the accuracy of DNA test result, all are analyzed with the most advanced genetic identification systems on the basis of 16 Loci ( Genetic Markers).</p>\n\n<p>OTS &amp; Services help individuals and families in India to prove relationships for many different reasons viz. Peace of Mind, Immigration Purpose, Legal Relationship Test etc. Explore website http://www.dnacenterindia.com, and you will find information about our DNA testing services, or give a call to know more. </p>\n\n<p>OTS &amp; Services have made DNA testing services more affordable and easily accessible to everyone who needs to resolve paternity concerns in the privacy of their own home (Home Paternity Test). They can help you answer your paternity questions by sending you a confidential home paternity testing kit to your home. \nYou will then simply acquire the DNA for us by swabbing your cheek, thus allowing them to perform the DNA Paternity test, Sibling DNA, DNA Profiling, Preantal Paternity Test &amp; other DNA Testing Services.</p>","image":{"available_sizes":[[[150,62],"assets/images/resized/0012/2588/122588v2-max-150x150.jpg"],[[250,104],"assets/images/resized/0012/2588/122588v2-max-250x250.jpg"],[[450,188],"assets/images/resized/0012/2588/122588v2-max-450x450.jpg"]],"attribution":"<p>DNA Test in India</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.dnacenterindia.com","title":"DNA Test in India"}]}