{"first_name":"Murray","last_name":"Wilson","permalink":"murray-wilson","crunchbase_url":"http://www.crunchbase.com/person/murray-wilson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 08 11:34:51 UTC 2009","updated_at":"Mon Jun 08 11:48:49 UTC 2009","overview":"<p>Murray joined River Cities in 1995 following the launch of Fund I in 1994. Prior to River Cities, he was the first associate hired at another regional venture firm for their debut fund in 1992. Murray has been in the industry for nearly fifteen years and has gained experience and perspective from managing growth company investments through several business cycles.</p>\n\n<p>Murray is active in both information technology and healthcare investments. During the late 1990&#8217;s, he was the lead manager in several software, healthcare IT and healthcare services deals. As the technology market shifted from traditional software to SaaS and BPO plays, Murray transitioned to doing deals that emphasized recurring revenue from hosted software and outsourced technology-enabled services. In addition he was very active in devising and applying analytical and reporting tools as the firm standardized its operations.</p>\n\n<p>Previous to being an early hire at both of Cincinnati&#8217;s institutional venture funds, Murray was an entrepreneur-student. In 1990, he was awarded a full scholarship to Xavier University where he served as the Graduate Assistant to the Chairman of the Finance Department. In addition to his studies and regular duties at the University, Murray provided consulting services such as writing business plans and creating complex financial models to local growth companies that were seeking to raise outside capital.</p>\n\n<p>His first professional position was Investment Officer for a Boston-based publicly held financial institution during the latter half of the 1980s. Murray holds a BA in Economics from Cornell University and an MBA from Xavier University.</p>","image":{"available_sizes":[[[137,139],"assets/images/resized/0004/7352/47352v1-max-150x150.jpg"],[[137,139],"assets/images/resized/0004/7352/47352v1-max-250x250.jpg"],[[137,139],"assets/images/resized/0004/7352/47352v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"","institution":"Xavier University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Managing Director","firm":{"name":"River Cities Capital Funds","permalink":"river-cities-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,44],"assets/images/resized/0004/7346/47346v1-max-150x150.png"],[[250,73],"assets/images/resized/0004/7346/47346v1-max-250x250.png"],[[255,75],"assets/images/resized/0004/7346/47346v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}