{"first_name":"Murray","last_name":"Galbraith","permalink":"murray-galbraith-2","crunchbase_url":"http://www.crunchbase.com/person/murray-galbraith-2","homepage_url":"http://www.youneeq.ca","birthplace":"Vancouver BC","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1960,"born_month":12,"born_day":30,"tag_list":"","alias_list":null,"created_at":"Tue Aug 09 18:33:47 UTC 2011","updated_at":"Tue Aug 09 19:08:47 UTC 2011","overview":"<p>An internet pioneer, Murray is a succesful businessman with over 30 years sales and marketing experience marked by taking his first internet property public in 1999. With half his experience in traditional bricks and mortar, and half in tech and the internet, Murray founded one of the oldest digital media sites on the internet, Game-boyz.com (est 1996 as Dagameboyz).</p>\n\n<p>Murray has offered strategic (video game) business and internet marketing consultation for companies such as Microsoft Games, Sony, Nintendo, EA, Disney, Acer, Activision, Sierra, Vivendi, Encyclopaedia Britannica and many others. Murray has an expert knowledge of the retail value chain (traditional and electronic), internet sales &amp; marketing and strategic business strategies. Murray is also responsible for new business strategies, business development and consulting services for Digital Cavalier.</p>\n\n<p>Murray is asked regularily &#8220;You&#8217;ve seen business change over the years, what&#8217;s the difference between then and now?&#8221;. His answer is &#8220;Besides the amount of grey hairs I have, business has never changed. It&#8217;s all about hard work, listening to you customers, delivering on your customers needs, and building a relationship with your customers. If you do the basics well you will succeed no matter if you&#8217;re internet based or a more traditional bricks and mortar based business&#8221;.</p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0014/8583/148583v2-max-150x150.jpg"],[[187,250],"assets/images/resized/0014/8583/148583v2-max-250x250.jpg"],[[337,450],"assets/images/resized/0014/8583/148583v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}