{"first_name":"Myles","last_name":"Grote","permalink":"myles-grote","crunchbase_url":"http://www.crunchbase.com/person/myles-grote","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Bookacoach.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Jan 22 14:35:15 UTC 2012","updated_at":"Thu Mar 01 09:51:52 UTC 2012","overview":"<p>Coach Grote was introduced to the competitive world of sports at an early age as he was a 3 sport athlete in both middle and high school. He attended Culver Summer Camps for 5 summers during his youth years where he competed in a multitude of sports, ranging from sailing to international soccer. His passion for sports eventually led him to a post-college hobby in competitive distance running. Since then, he has completed three marathons, ten half marathons, and four 200 mile relays, with several top 25 finishes.</p>\n\n<p>During college, Myles leveraged his passion for sports and business to help build from ground-up, the Circle of Life Indiana University Mini Marathon, the first ever collegiate-hosted half marathon in the country. In its first year of operations, the 501(c)3 not-for-profit corporation generated revenue and gross profit of $192,000 and $60,000, respectively. Myles served as Chief Operating Officer for the corporation, managing day to day operations and a team of approximately 40 people. </p>\n\n<p>Myles has had a history of quickly moving up within an organization as he has worked his way up to a management position at both Circle of Life and FactSet Research Systems, Inc., a leading provider of financial analytics software (NYSE: FDS). He currently manages a team of 17 consultants responsible for supporting over 563 clients from 64 financial institutions.  He now serves as Co-Founder and Director of Finance for Bookacoach.com.</p>\n\n<p>In addition to his management experience, he has been an avid investor since the early age of 16. Myles holds a B.S. degree in Business Finance from Indiana’s Kelley School of Business – Bloomington, IN.</p>","image":{"available_sizes":[[[81,150],"assets/images/resized/0017/5468/175468v2-max-150x150.jpg"],[[135,250],"assets/images/resized/0017/5468/175468v2-max-250x250.jpg"],[[154,285],"assets/images/resized/0017/5468/175468v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor in Science","subject":"Finance","institution":"Indiana University","graduated_year":2007,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Co-Founder, CFO","firm":{"name":"bookacoach","permalink":"bookacoach-com","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0017/1243/171243v4-max-150x150.jpg"],[[200,200],"assets/images/resized/0017/1243/171243v4-max-250x250.jpg"],[[200,200],"assets/images/resized/0017/1243/171243v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}