{"first_name":"N.R.Narayana","last_name":"Murthy","permalink":"n-r-narayana-murthy","crunchbase_url":"http://www.crunchbase.com/person/n-r-narayana-murthy","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Oct 23 15:13:59 UTC 2009","updated_at":"Tue Feb 16 15:56:40 UTC 2010","overview":"<p>Mr. N. R. Narayana Murthy is the Chairman of the Board and Chief Mentor of Infosys Technologies Limited. He founded Infosys in 1981 along with six other software professionals and served as the CEO of Infosys for 21 years till March 2002. Under his leadership, Infosys was listed on NASDAQ in 1999. He served as the Executive Chairman of the Board and Chief Mentor from 2002 to 2006.</p>\n\n<p>Mr. Murthy articulated, designed and implemented the Global Delivery Model which has become the foundation for the huge success in IT services outsourcing from India. He has led key corporate governance initiatives in India. He is an IT advisor to several Asian countries. Mr. Murthy serves as an independent director on the boards of several global companies including Unilever, NV, Unilever, plc and HSBC Holdings plc. He is the Chairman of the Asia Business Council. He is also a member of the advisory boards and councils of several educational institutions including Wharton, Cornell, INSEAD, Stanford, Tokyo University, SMU - Singapore, IIIT Bangalore and ESSEC, Paris.</p>\n\n<p>Mr. Murthy is the recipient of numerous awards and honors. The Economist ranked him 8th in the list of the 15 most-admired global leaders in 2005. He was ranked 28th among the world&#8217;s most-respected business leaders by the Financial Times in 2005. In 2004, TIME magazine identified him as one of the 10 global leaders who are helping shape the future of technology. In 2006, TIME magazine voted him as one of the Asian heroes who have brought about revolutionary changes in Asia in the last 60 years. He was featured in BusinessWeek&#8217;s &#8220;The Stars of Asia&#8221; for three consecutive years - 1998, 1999 and 2000.</p>\n\n<p>Mr. Murthy was voted the &#8220;World Entrepreneur of the Year&#8221; by Ernst &amp; Young in 2003. He was voted India&#8217;s most powerful CEO for three consecutive years - 2004, 2005 and 2006 - by The Economic Times. He was chosen as the &#8220;Business Process Innovator&#8221; by The Economist in 2007. He received the Ernst Weber Engineering Leadership medal from The Institute of Electrical and Electronics Engineers in 2007 for his pioneering role in the globalization of IT services. He was awarded the &#8220;Padma Vibhushan&#8221;, the second highest civilian award by the Government of India in 2008. The Government of France conferred the Officer of the Legion of Honor in 2008.</p>\n\n<p>Mr. Murthy holds an Electrical Engineering degree from the Mysore University and an M.Tech (Electrical) from the Indian Institute of Technology Kanpur. He has been conferred honorary doctorate degrees by several well-known universities in India and abroad.</p>","image":{"available_sizes":[[[123,150],"assets/images/resized/0007/1200/71200v2-max-150x150.jpg"],[[206,250],"assets/images/resized/0007/1200/71200v2-max-250x250.jpg"],[[371,450],"assets/images/resized/0007/1200/71200v2-max-450x450.jpg"]],"attribution":"<p>infosys.com</p>"},"degrees":[{"degree_type":"BE","subject":"Electrical Engineering","institution":" National Institute of Engineering, University of Mysore ","graduated_year":1967,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chairman of the Board and Chief Mentor","firm":{"name":"Infosys Technologies","permalink":"infosys-technologies","type_of_entity":"company","image":{"available_sizes":[[[150,61],"assets/images/resized/0003/1476/31476v1-max-150x150.png"],[[150,61],"assets/images/resized/0003/1476/31476v1-max-250x250.png"],[[150,61],"assets/images/resized/0003/1476/31476v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}