{"first_name":"N.","last_name":"Rudy Garza","permalink":"n-rudy-garza-2","crunchbase_url":"http://www.crunchbase.com/person/n-rudy-garza-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Nov 02 16:44:50 UTC 2008","updated_at":"Mon Jun 15 13:02:53 UTC 2009","overview":"<p>As founder and managing general partner of G-51, Rudy focuses on the development of all portfolio companies, syndication partnerships and deal flow. Through mentoring as well as serving on portfolio boards, he is instrumental in driving success through defining and then guiding the implementation of well-grounded business and marketing strategies. Rudy applies his expertise which includes an extensive knowledge of successful hardware and software business models, market shaping services, business growth strategies and talent sourcing. Rudy knows start-ups and what it takes to build market value.</p>\n\n<p>Rudy is a native of Austin and a recognized Texas leader in the technology start-up industry. He started G-51 Capital in 1996 a few blocks from the University of Texas campus and now has served as an investor and board member for over 20 companies, selling numerous to publicly traded strategic acquirers including SAP, ADP, Prudential, and Cisco Systems among others. </p>\n\n<p>Rudy has demonstrated success in seed-stage business identification and development not only in Texas but across the country, leading to the firm’s nationally ranked return performance. He is an active leader in the venture community, including longstanding participation in NVCA and the Texas Venture Capital Association. He has led syndicated investment deals with numerous angel investors, institutional and corporate venture capital firms nationwide. </p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0004/8570/48570v1-max-150x150.jpg"],[[125,156],"assets/images/resized/0004/8570/48570v1-max-250x250.jpg"],[[125,156],"assets/images/resized/0004/8570/48570v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"","institution":"University of Texas","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder, Managing General Partner","firm":{"name":"G-51 Capital","permalink":"g-51-capital","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}