{"first_name":"Nadav","last_name":"Goshen","permalink":"nadav-goshen","crunchbase_url":"http://www.crunchbase.com/person/nadav-goshen","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"SweetPacks","born_year":null,"born_month":null,"born_day":null,"tag_list":"nadav-goshen, sweetpacks, icq, empire-online, pelephone, babylon, technology","alias_list":null,"created_at":"Wed May 23 23:42:03 UTC 2012","updated_at":"Tue Jun 12 16:00:32 UTC 2012","overview":"<p>Nadav Goshen is the Chief Executive Officer of SweetPacks, a hi-tech company that cultivates new and groundbreaking products for a user wanting enhance his Internet experience.  The company is best recognized for creating the SweetIM, an app that has become the leading tool for emoticons on Internet chat. This app became public in 2005.  SweetPacks currently has over 100 million users from around the world.  </p>\n\n<p><a href=\"http://nadavgoshen.wordpress.com/\" title=\"Goshen became the CEO of SweetPacks\" rel=\"nofollow\">Goshen became the CEO of SweetPacks</a> because of his online skills and experience in various tech and telecommunications companies. He also graduated from Tel Aviv University, now the largest university in Israel with 106 departments.  </p>\n\n<p>Online Experience  </p>\n\n<p>Since 1996, Nadav Goshen has worked at tech and telecom companies that range from ICQ to gaming group Empire Online.  His managerial positions have only grown with each new company, though they vary within a wide range of skills. For example, he was the head of the Internet products department at 013 Barak but worked in marketing at Empire Online.  </p>\n\n<p>Online Career </p>\n\n<p>Goshen was responsible for leading content creation at Pelephone, one of Israel&#8217;s largest mobile agents and currently Israel&#8217;s leading telecom operator, thanks to Goshen&#8217;s cutting-edge content and online expertise as the man who established the company&#8217;s Value and Content Added Services group, which grew its revenue to $40 million.  </p>\n\n<p>He went on to become Deputy CEO at Babylon, the popular and well-recognized software translation company, which gives free definitions from over 1000 online dictionaries and encyclopedias and offers free translation through computer software that can be added to one&#8217;s desktop. With Goshen at its helm, the company grew at a 500% rate.  </p>\n\n<p>Investment Opportunities </p>\n\n<p><a href=\"http://www.4networking.biz/Members/Details/79252\" title=\"Nadav Goshen\" rel=\"nofollow\">Nadav Goshen</a> has invested in several Internet and mobile companies that he believes in and continues to act as an advisor or board member for some of them.  </p>\n\n<p>Hobbies </p>\n\n<p>In his spare time, Nadav likes to swim, ride bikes, and work on music gadgets.  </p>","image":{"available_sizes":[[[124,150],"assets/images/resized/0019/2371/192371v2-max-150x150.jpg"],[[159,191],"assets/images/resized/0019/2371/192371v2-max-250x250.jpg"],[[159,191],"assets/images/resized/0019/2371/192371v2-max-450x450.jpg"]],"attribution":"<p>Nadav Goshen</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"SweetPacks","permalink":"sweetpacks","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://nadavgoshen.wordpress.com/","title":"Nadav Goshen on WordPress"},{"external_url":"http://www.4networking.biz/Members/Details/79252","title":"Nadav Goshen's 4networking Profile"}]}