{"first_name":"Nancy","last_name":"Lewis","permalink":"nancy-lewis","crunchbase_url":"http://www.crunchbase.com/person/nancy-lewis","homepage_url":"http://rapidprotect.net/","birthplace":"New York","twitter_username":"RapidProtect","blog_url":"http://rapidprotect.wordpress.com/","blog_feed_url":"http://rapidprotect.wordpress.com/","affiliation_name":"Unaffiliated","born_year":1981,"born_month":8,"born_day":17,"tag_list":"rapidprotect, mobile-app, gps-tracking, family-tracking, location-tracking","alias_list":null,"created_at":"Tue Jun 05 13:10:50 UTC 2012","updated_at":"Tue Jun 12 14:25:15 UTC 2012","overview":"<p>Rapid Protect delivers a set of mobile enabled services and applications for individuals and businesses. It combine location information with many innovative services to enable individual safety, security and collaboration. A similar set of services are offered for the business customers. RapidProtect delivers these innovative services using a custom developed Rapid Service Delivery Platform (RSDP) that delivers multi-point security, mapping/tracking, alerting, messaging and many other collboration services. The company has integrated several patent pending technologies in the platform. This has enabled RapidProtect to offer many unique services to our customers by combining advance technologies such as communications, media, security, voice and on-demand collaboration. </p>\n\n<p>RapidProtect is most feature rich app designed to address the growing need of security, safety and collaboration for individuals and businesses.</p>\n\n<p>Besides tracking the location of your family/business members and message checkins, the app include many innovative collaboration features such as photo check-ins, photo sharing, geo-fencing, geo-tagging, in-app secure chat, location tagging etc. These features, which took about a year to develop, put the Rapid Protect Apps way ahead of its nearest competition in the location based mobile apps area.</p>\n\n<p>Mobile apps on iPhone will work with our apps on other Mobile platforms like Android, Blackberry and Symbian. It means regardless of the phone type, mobile users will have an app ready to be installed.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}