{"first_name":"Nancy","last_name":"Kramer","permalink":"nancy-kramer","crunchbase_url":"http://www.crunchbase.com/person/nancy-kramer","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Hatch Partners, LLC","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Aug 19 16:16:22 UTC 2012","updated_at":"Thu Sep 06 21:20:28 UTC 2012","overview":"<p>As Founder and Chairman, Nancy Kramer has built Resource Interactive into an award-winning, nationally recognized agency—both for its creative work and its unique culture. Kramer’s marketing experience and impact coincide with great moments in technology marketing history, from Apple as the agency’s first client to the first live streaming of the Victoria’s Secret Fashion Show to the launch of Off The Wall—the first-ever fully integrated social commerce experience. She has guided Resource through 30 years of trends, shifts and splits in the interactive arena—all while remaining driven by the core values that are the cornerstone of the agency and influence every decision.</p>\n\n<p>Under Kramer’s leadership, Resource Interactive has not only achieved renown in the industry, but also as one of the best places to work in the country. A nationally respected leader on workplace issues, Kramer considers an open, collaborative culture where employees feel valued one of her highest priorities. In 2006, Kramer announced the creation of REEF, the Resource Employee Equity Fund, where every employee is a shareholder in each of Resource’s publicly traded clients. Featured in BusinessWeek and Inc., the fund is yet another example of her philosophy: The investment made in company associates comes back tenfold. As Chief Culture Officer, Kramer continues to focus on workplace culture, solidifying Resource as a company that has not only raving clients, but fulfilled associates as well.</p>\n\n<p>In addition to her role at Resource, Kramer has been appointed to the Advancement Committee of The Ohio State University Board of Trustees, is a co-organizer for TEDx Columbus, board member of The National Center for the Middle Market at Fisher College of Business, is on the Wexner Center for the Arts Board of Directors, is Chair of the Board of Trustees at The Wellington School, is on the Limited Brands Foundation Board of Directors and holds a position on the marketing committees for both The Columbus Foundation and The Ohio State University Foundation.</p>","image":{"available_sizes":[[[111,111],"assets/images/resized/0020/9677/209677v2-max-150x150.jpg"],[[111,111],"assets/images/resized/0020/9677/209677v2-max-250x250.jpg"],[[111,111],"assets/images/resized/0020/9677/209677v2-max-450x450.jpg"]],"attribution":"<p>http://www.resource.com/about-us/leadership/</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Chairman and Chief Culture Officer","firm":{"name":"Resource Interactive","permalink":"resource-interactive","type_of_entity":"company","image":null}},{"is_past":false,"title":"Principal","firm":{"name":"Hatch Partners, LLC","permalink":"hatch-partners-llc","type_of_entity":"financial_org","image":{"available_sizes":[[[108,29],"assets/images/resized/0020/7334/207334v2-max-150x150.png"],[[108,29],"assets/images/resized/0020/7334/207334v2-max-250x250.png"],[[108,29],"assets/images/resized/0020/7334/207334v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}