{"first_name":"Naneinee","last_name":"Ross","permalink":"naneinee-ross","crunchbase_url":"http://www.crunchbase.com/person/naneinee-ross","homepage_url":"http://www.corporatecosmo.com","birthplace":"Elmont","twitter_username":"nanross","blog_url":"http://www.corporatecosmo.com/blog","blog_feed_url":"http://www.corporatecosmo.com/feed","affiliation_name":"Corporate Cosmo, LLC","born_year":null,"born_month":null,"born_day":null,"tag_list":"florida-social-media, florida-website-design, florida-internet-marketing","alias_list":null,"created_at":"Tue Dec 06 22:32:19 UTC 2011","updated_at":"Thu Dec 08 21:04:04 UTC 2011","overview":"<p>Naneinee (Nan) Ross is the Social Media Strategist and President of Corporate Cosmo, LLC; an internet marketing company specializing in social media marketing, web development, organic search engine optimization, and graphic design. </p>\n\n<p>Corporate Cosmo provides web design and social media marketing for the South Florida areas; including Hollywood, Fort Lauderdale and Miami.</p>\n\n<p>Nan realized with the speed of web technology and the consumption of information overload, many become overwhelmed and intimidated. As a Social Media Strategist and web designer in Hollywood, Florida, Nan helps small businesses how to utilize and optimize their online presence to generate leads and sales, create word-of-mouth referrals, increase traffic, and build a reputable brand around a community.</p>\n\n<p>Nan Ross takes her 14 years of knowledge of graphic design and typography in print advertisement and turned it into professional and functional websites.  Nan Ross, a natural born social butterfly, teaches and gravitates well to her visual and auditory audience. She also has 10 years experience in private software coaching, including Microsoft Office and email management. Nan Ross uses video tutorials to demonstrate how to embrace the usability of Facebook, Twitter, LinkedIn, YouTube and WordPress; how to create and distribute content; and how to automate and manage social media activities.</p>\n\n<p>Nan’s career really began to take off in 2009 after starting Blog Talk Radio Show “Social Media with Nan Ross” (formerly known as The Nan Ross Show). The show went to become “Blog Talk Radio’s most popular marketing show” shortly after 17 months and features some of the top marketing experts in the industry. Nan Ross is a teacher with eyes that see innovation and creativity. Nan will challenge, engage, and inspire her audience to achieving their marketing goals.</p>\n\n<p>Nan Ross blogs regularly on various topics including: social media, internet marketing, search engine optimization, brand development, blogging, audio/video podcast and book reviews . Please click here to subscribe to her weekly blog!</p>\n\n<p>Nan has been in the print industry long often to realized how businesses are still solely marketing their business using direct mail, flyers, business cards, yellow pages or brochures. Unfortunately, these print advertising pieces results may have failed their expectation. Trust Nan; as a print graphic designer for over 14 years; she have observed the sales of print communication decline. So, what can be done when her potential customers revolts against traditional media?</p>","image":{"available_sizes":[[[131,150],"assets/images/resized/0016/5464/165464v2-max-150x150.jpg"],[[218,250],"assets/images/resized/0016/5464/165464v2-max-250x250.jpg"],[[393,450],"assets/images/resized/0016/5464/165464v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President","firm":{"name":"Corporate Cosmo, LLC","permalink":"corporate-cosmo-llc","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/nanross","title":"Nan Ross on Twitter"},{"external_url":"http://www.linkedin.com/in/nanross","title":"Nan Ross on LinkedIn"}]}