{"first_name":"Nani","last_name":"Beccalli-Falco","permalink":"nani-beccalli-falco","crunchbase_url":"http://www.crunchbase.com/person/nani-beccalli-falco","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"GE International","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jan 29 23:19:38 UTC 2009","updated_at":"Thu Jan 29 23:19:38 UTC 2009","overview":"<p>Ferdinando &#8220;Nani&#8221; Beccalli-Falco was named President and Chief Executive Officer (CEO) of GE International in January 2005. Prior to his current position Nani served as President and CEO, EMEA. He is responsible for directing GE&#8217;s strategies for growth outside the U.S. by working on behalf of all GE businesses to expand customer and government relationships and to develop new business markets. He is based in Brussels, Belgium.</p>\n\n<p>Nani Beccalli-Falco formerly served as Executive Vice President, GE Capital Services, where he had oversight responsibilities for GE Capital&#8217;s Equipment Management Businesses, including Americom, Fleet Services, Rail Services, TIP/Modular Space and Penske Truck Leasing. He also oversaw GE Capital India, GE Capital Global Sourcing, GE Capital Container Finance and the GE SeaCo JV.</p>\n\n<p>Mr. Beccalli-Falco has enjoyed a long career at GE, starting in 1975 in the United States. In 1977 when he joined GE Plastics Europe, in the Strategic Planning group at the company&#8217;s headquarters, in Bergen op Zoom, The Netherlands. In 1981, Nani moved to GE Plastics global headquarters in Pittsfield, MA, where he held management positions in various divisions. In 1987, he returned to Bergen op Zoom as the Director of Marketing, and in 1990, he became the Managing Director of the Structured Products Business. From 1993 to 1996 he served as the President of GE Plastics Japan Ltd. Nani Beccalli-Falco was Vice President and General Manager, GE Plastics Americas from January 1997 until May 2001, when he joined GE Capital Services.</p>\n\n<p>A native of Italy, Nani Beccalli-Falco earned a master&#8217;s degree in chemical engineering from the Polytechnic of Torino in Italy, and he has completed graduate work in business administration at Xavier University in Cincinnati, Ohio.</p>\n\n<p>Nani Beccalli-Falco is a member of the following organizations:\n• Emmanuel Center Stiftung, Germany (Board member)\n• GE Foundation (Board member)\n• Junior Achievement Young Enterprise (Vice Chair EMEA)\n• Nissan Motor Company Ltd. (Suppliers Advisory Council)\n• Singapore Economic Development Board - International Advisory Council\n• Trilateral Commission\n• Genpact Limited Board of Directors\n• Centre for European Policy Studies (CEPS) Board of Directors</p>\n\n<p>In 2007, the President of Italy, Giorgio Napolitano, appointed Nani Beccalli-Falco &#8220;Cavaliere del Lavoro&#8221;. </p>","image":{"available_sizes":[[[96,150],"assets/images/resized/0003/5265/35265v1-max-150x150.jpg"],[[160,250],"assets/images/resized/0003/5265/35265v1-max-250x250.jpg"],[[240,373],"assets/images/resized/0003/5265/35265v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"GE International","permalink":"ge-international","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}