{"first_name":"Nate","last_name":"Hanafy","permalink":"nate-hanafy","crunchbase_url":"http://www.crunchbase.com/person/nate-hanafy","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Vernalis Systems","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 10 20:58:13 UTC 2008","updated_at":"Tue Sep 23 21:58:22 UTC 2008","overview":"<p>Nate leads business development and marketing efforts for Vernalis Systems. Nate uses his extensive expertise in software and business process consulting to assist clients throughout the Americas and Europe. He works with executives from global corporations to understand their business vision. He identifies the technology tools that can help make the vision a reality, and teams with clients to ensure successful implementation.</p>\n\n<p>Nate&#8217;s experience extends to finance, professional services, emergency preparedness, media and professional sports sectors. Prior to joining Vernalis Systems he served as Product Manager and Software Solution Consultant at Ernst &amp; Young and as Senior Information System Analyst at Johnson &amp; Johnson.</p>\n\n<p>Nate holds a BA (Honors) in Computer Science and a BA (Honors) in Economics from Rutgers College. He has earned Project Management Professional certification (PMP) from the Project Management Institute (PMI).</p>\n\n<p>Within Vernalis Systems, Nate is a member of our Global Executive Committee. He leads global client and product development initiatives, concentrating on corporate social networking and knowledge management processes.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Vernalis Systems","permalink":"vernalis-systems","type_of_entity":"company","image":{"available_sizes":[[[150,29],"assets/images/resized/0003/3178/33178v2-max-150x150.png"],[[250,48],"assets/images/resized/0003/3178/33178v2-max-250x250.png"],[[279,54],"assets/images/resized/0003/3178/33178v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}