{"first_name":"Nate","last_name":"Williams","permalink":"nate-williams","crunchbase_url":"http://www.crunchbase.com/person/nate-williams","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"4Home","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jan 08 10:37:37 UTC 2008","updated_at":"Fri Aug 31 14:31:18 UTC 2012","overview":"<p>Nate Williams is a Communications Executive, Entrepreneur, and Advisor based in the Bay Area. Nate&#8217;s 15 years of advisory experience spans leadership roles across Hollywood, Wall Street, and Silicon Valley. Nate&#8217;s expertise includes evaluating new media technologies, connected home business strategy, cross industry negotiations, and investment analysis.</p>\n\n<p>Following the acquisition of 4Home Media by Motorola, Inc. in December 2010, Nate joined Motorola Mobility&#8217;s Converged Media Group to lead the strategy and business development teams focused on developing differentiated applications and device solutions for delivery of 4Home based multi-screen experiences.  At 4Home Media, Nate was Chief Marketing Officer where he facilitated the planning and development of 4Home&#8217;s go-to-market strategy and managed sales, product marketing, and corporate development.  Nate helped launch 4Home as &#8220;Best of CES&#8221; in 2007, refined 4Home&#8217;s strategy to position 4Home as a market leader in Connected Home Services, closed a strategic investment from Verizon Communications and served as a functional deal team lead to facilitate their acquisition by Motorola. </p>\n\n<p>Nate joined 4Home from the Digital Home Group of Intel Corporation, where he provided strategic finance and business development direction for their multi-billion dollar Consumer PC business and facilitated investments in Media and partnerships with NBC-Universal, Disney and ClickStar. Nate&#8217;s financial analysis of the risk to Intel&#8217;s CPU business due to the emergence of discrete graphics processing earned him Intel&#8217;s DRA award in 2006. Earlier, Nate served as an Associate at JPMorgan &amp; Co. in New York City. Nate began his career as a Marketing Intern at The Walt Disney Company.  Through his professional affiliations, Nate has spoken at many industry conferences including Consumer Electronics Show (CES), Telecom Council, Digital Hollywood, CableLabs, and Parks Associates Smart Energy Summit. </p>\n\n<p>Nate holds a Masters degree in Marketing and Technology Management from The Anderson School at UCLA and a Bachelors degree in Communications Technology from The University of Connecticut. Furthermore, Nate received Behavioral Research certification from UCLA, completed an Asia-Pacific MBA immersion at The Australian Graduate School of Management (AGSM), and attended The Carlson Leadership Academy.</p>","image":{"available_sizes":[[[93,150],"assets/images/resized/0014/6471/146471v2-max-150x150.jpg"],[[104,167],"assets/images/resized/0014/6471/146471v2-max-250x250.jpg"],[[104,167],"assets/images/resized/0014/6471/146471v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Masters","subject":"Marketing, Technology Management","institution":"UCLA","graduated_year":2005,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"VP,Business Development & Strategic Marketing","firm":{"name":"4Home","permalink":"4home","type_of_entity":"company","image":{"available_sizes":[[[120,66],"assets/images/resized/0000/3034/3034v3-max-150x150.jpg"],[[120,66],"assets/images/resized/0000/3034/3034v3-max-250x250.jpg"],[[120,66],"assets/images/resized/0000/3034/3034v3-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Board of Advisors","firm":{"name":"Scripped","permalink":"scripped","type_of_entity":"company","image":{"available_sizes":[[[150,57],"assets/images/resized/0002/4848/24848v2-max-150x150.png"],[[250,96],"assets/images/resized/0002/4848/24848v2-max-250x250.png"],[[450,173],"assets/images/resized/0002/4848/24848v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/nathandwilliams","title":"LinkedIn"}]}