{"first_name":"nathan","last_name":"herald","permalink":"nathan-herald","crunchbase_url":"http://www.crunchbase.com/person/nathan-herald","homepage_url":"http://www.coolfanpages.com","birthplace":"new york","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"CoolFanPages","born_year":null,"born_month":null,"born_day":null,"tag_list":"facebook-page-listing, facebook-fan-pages-listing, facebook-fan-pages-promotion, facebook-fan-pages-directory, facebook-fan-page-directory, social-media-promotion, promote-your-brand-on-facebook","alias_list":null,"created_at":"Sun Oct 14 17:22:06 UTC 2012","updated_at":"Wed Oct 31 00:08:31 UTC 2012","overview":"<p>Social Media Marketing with Facebook Fan Pages</p>\n\n<p>Today facebook is most popular social networking website on internet. It have 800 billion users and growing everyday. Facebook does not only allows to users to join it, but allows brands, corporate, companies, food chains, movies to join it via fan pages. People visit these fan pages and get information posted on them by administrator of fan pages. These fan pages have features of likes and talking about count. People who likes the page can click on like button , it adds to total number of likes of facebook page. Fan pages also have pictures tab and video tab where pictures and videos are uploaded by page administrators.  Page have wall where updates are posted. Some pages allows users to post on their wall and some does not allows. The pages can be of any categories like music, athlete, movie, brand, person, company etc. \nwww.coolfanpages.com  is unique website which allows you to add your pages on this website. \nThis website has listing of facebook pages and people can also submit their facebook page. It also shows related videos for some pages. </p>\n\n<p>Fan pages also allow users to add custom tabs to facebook pages. These tabs normally have promotional campaigns and products store.</p>\n\n<p>Over 845 million users log into Facebook every month, and 483 million users log in daily. Mobile users now make up half of Facebook’s user base, with 425 million monthly actives. Facebook also announced that by the end of 2011 there had been 100 billion friend connections, and in recent months users had been registering 2.7 billion Likes and Comments per day. Facebook is one of the popular in the US, and its international growth has been impressive. Additionally, Facebook is the top photo sharing site with 250 million photos uploaded per day.</p>\n\n<p>CoolFanPages , Facebook Page Listing , Facebook Fan pages Listing , Facebook Fan pages Promotion  , Facebook Fan pages Directory , Facebook Fan page Directory , Social Media Promotion , Promote Your Brand on facebook</p>","image":{"available_sizes":[[[130,80],"assets/images/resized/0021/5482/215482v2-max-150x150.jpg"],[[130,80],"assets/images/resized/0021/5482/215482v2-max-250x250.jpg"],[[130,80],"assets/images/resized/0021/5482/215482v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CoolFanPages","firm":{"name":"CoolFanPages","permalink":"coolfanpages","type_of_entity":"company","image":{"available_sizes":[[[130,80],"assets/images/resized/0021/8402/218402v2-max-150x150.jpg"],[[130,80],"assets/images/resized/0021/8402/218402v2-max-250x250.jpg"],[[130,80],"assets/images/resized/0021/8402/218402v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.coolfanpages.com","title":""}],"web_presences":[{"external_url":"http://www.coolfanpages.com","title":""}]}