{"first_name":"Naveed","last_name":"Lalani","permalink":"naveed-lalani","crunchbase_url":"http://www.crunchbase.com/person/naveed-lalani","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Piryx","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Sep 25 15:59:40 UTC 2008","updated_at":"Sat Jun 26 22:20:09 UTC 2010","overview":"<p>Naveed Lalani is a seasoned new media professional with almost a decade of experience creating digital experiences for businesses of all sizes. He has expertise in web design, print design, creative direction, brand messaging, web architecture, and cross-platform promotions.</p>\n\n<p>Naveed’s work spans various industries including non-profits, politics, gaming, private schools, construction, music, entertainment, restaurants, and real estate. He has worked as an advertising consultant to creative director as well. Naveed has contributed to several of the world’s most prominent brands including Kodak, Barclays Bank, DuPont, Six Flags, Vera Wang, Mutual Boiler Re, Bank of America, AMD, Blu-ray Disc Association, Palm, Sybase and Dell.</p>\n\n<p>Naveed currently serves as Chairperson for Central Texas for the International Professionals Network (IPN) where his role is to lead the organization efforts overlooking over 6,000 Ismaili Muslims in the region. He also serves on IPN&#8217;s National Marketing Committee, determining the strategy of its digital marketing and online presence. Naveed is a co-founder and Board Member of Texas Ventures, where he mentors the leadership in creating the best entrepreneurship program in Texas.</p>\n\n<p>In May 2008, Naveed left his graduate studies at Portfolio Center to start Piryx, a political and social entrepreneurship management platform. His responsibilities include product strategy, user experience, and growing the company. When Naveed&#8217;s not at the office, he&#8217;s learning about the newest technology and design trends, running, volunteering or enjoying the sun.</p>\n\n<p>For his work, Naveed has received recognition from the American Advertising Federation, Austin Advertising Federation, Houston Advertising Federation, the Association of American Advertising Agencies, LBJ School of Public Affairs, and the University of Texas. Naveed received a B.S. in Advertising with High Honors from University of Texas.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0002/5789/25789v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0002/5789/25789v2-max-250x250.jpg"],[[258,387],"assets/images/resized/0002/5789/25789v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"","firm":{"name":"Rally.org","permalink":"rally-org","type_of_entity":"company","image":{"available_sizes":[[[150,57],"assets/images/resized/0002/5548/25548v8-max-150x150.png"],[[250,96],"assets/images/resized/0002/5548/25548v8-max-250x250.png"],[[286,110],"assets/images/resized/0002/5548/25548v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}