{"first_name":"Neal","last_name":"Prescott","permalink":"neal-prescott","crunchbase_url":"http://www.crunchbase.com/person/neal-prescott","homepage_url":"","birthplace":"","twitter_username":"nprescott","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Mar 20 12:48:39 UTC 2010","updated_at":"Sun Mar 21 04:11:02 UTC 2010","overview":"<p>Currently, Neal is the CEO of Deliver, WPP’s global digital production offering.   The DELIVER network brings together over 1000 existing digital production resources within WPP to create a global network that offers quality, low-cost digital production to WPP companies and their clients. </p>\n\n<p>Neal is a accomplished technology and marketing executive with top-tier background in professional services, technology implementation, and digital marketing.   He has led client engagements in the consumer products, automotive, financial services, consumer electronics, and agricultural industries.  These client relationships span B2B and B2C businesses, with an emphasis on digital production, electronic commerce, emerging technology, data warehousing, content management, portals and technology implementation.\nPrior to joined WPP, Neal was the Executive Vice President, Global Head of Technology Enablement at Digitas.  He was the agency’s senior-most technology executive with P&amp;L responsibility for all technology capabilities.  He created the first of its kind offshore digital production capability, consisting of 250 resources in three offshore locations.\nNeal previously held practice management and technology leadership positions in a number of multi-national consulting organizations, including Answerthink, Price-Waterhouse, KPMG and SHL Systemhouse.  Just prior to joining Digitas, Neal was the Co-Founder and Managing Director of the Commerce Applications practice at Answerthink from 1997 to 2003.  While at Answerthink, Neal built and led a team of over 350 professionals, with responsibility for the development of methodology for web-based systems that enabled successful and profitable delivery of very challenging client engagements in an emerging technology space.\nNeal and has completed the Boston Marathon 4 times and the Pan-Mass Challenge 7 times.\nNeal holds a Master of Science in Theoretical Statistics from Carnegie-Mellon University.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}