{"first_name":"Neal","last_name":"East","permalink":"neal-east","crunchbase_url":"http://www.crunchbase.com/person/neal-east","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 17 02:07:20 UTC 2011","updated_at":"Mon Nov 19 13:10:12 UTC 2012","overview":"<p>Neal East is a twenty-five year veteran of high technology sales, product development, and executive management and has worked on the successful development and eventual sale of three high-tech startups prior to joining Xtime. As CEO of Xtime, Neal has been instrumental in the company&#8217;s rapid growth and success in the automotive service sector. During his tenure, the company has grown at a sustained rate of over one hundred percent per year and is now the recognized leader of online service scheduling and CRM solutions for the automotive service market, with over fifteen percent of all US dealerships under contract. Prior to Xtime, Neal was a founding executive at Dorado Network Systems Corporation, the leading provider of web-based solutions for the trillion dollar U.S. mortgage industry, which was acquired by CoreLogic. Neal also was President of Enterprise Engines, Inc., a pioneer in Web ERP, which was purchased by QAD in 1999, as well as Senior Vice President of Sales for GemStone Systems, a pioneer in Java Application Servers, which was purchased by Brokat in 1997. Neal began his career at IBM, where he held a variety of sales and management positions. Neal has lived and worked in both Asia and Europe and holds a BA degree in Political Science and Business Administration from the University of California at Berkeley.</p>","image":null,"degrees":[{"degree_type":"BA","subject":"","institution":"University of California ","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Xtime","permalink":"xtime","type_of_entity":"company","image":{"available_sizes":[[[150,35],"assets/images/resized/0013/9630/139630v1-max-150x150.png"],[[192,45],"assets/images/resized/0013/9630/139630v1-max-250x250.png"],[[192,45],"assets/images/resized/0013/9630/139630v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}