{"first_name":"nebosh","last_name":"gujarat","permalink":"nebosh-gujarat","crunchbase_url":"http://www.crunchbase.com/person/nebosh-gujarat","homepage_url":"http://www.fireandsafetyforum.com","birthplace":"ernakulam","twitter_username":"neboshbhopal","blog_url":"http://www.fireandsafetyforum.orgs","blog_feed_url":"http://www.safetyinstitutehsetrainingsinternationalcoursescenterindia.com/","affiliation_name":"Unaffiliated","born_year":1986,"born_month":6,"born_day":18,"tag_list":"nebosh-gujarat, no-1-engineering-college-in-india, ahmedabad, nebosh-igc, nebosh-igc-certificate, nebosh-diploma-courses, nebosh-diploma-distance-learning, nebosh-diploma-training, nebosh-international-diploma, contact-and-comment-on-fire-and-safety-forum","alias_list":null,"created_at":"Sat Nov 20 05:47:12 UTC 2010","updated_at":"Tue Nov 23 15:49:02 UTC 2010","overview":"<p>NEBOSH Gujarat,No-1 engineering college in india,  Ahmedabad,Nebosh igc, nebosh igc certificate, nebosh diploma courses, nebosh diploma distance learning, nebosh diploma training, nebosh international diploma, contact and comment on  fire and safety forum, contact +919895621248.\nInternational health and safety trainings on NEBOSH NVQ qualifications, (NEBOSH Gujarat, Ahmedabad,nebosh Anand nebosh igc, nebosh international general certificate courses,nebosh igc,nebosh igc certificate, nebosh diploma courses, nebosh diploma distance learning, nebosh diploma training, nebosh international diploma, nebosh in india ,nebosh training in india,nebosh training providers, nebosh international diploma in india, nebosh training courses, nebosh training uk,nebosh international diploma, ,nebosh courses in india, nebosh e-learning,nebosh certificate india nebosh certificate distance learning ) contact +919895621248 for NEBOSH batches.\nNEBOSH (The National Examination Board in Occupational Safety and Health) was formed in 1979 as an independent examining board and awarding body with charitable status. NEBOSH offer a comprehensive range of globally-recognized, vocationally-related qualifications designed to meet the health, safety, environmental and risk management needs of all places of work in both the private and public sectors. We at Fire and Safety Forum co-ordinates the courses put forward by NEBOSH like NEBOSH IGC as well as NEBOSH international Diplomas NEBOSH Construction safety, NEBOSH health and safety managers. NEBOSH qualifications are recognised by the relevant professional membership bodies including the Institution of Occupational Safety and Health (IOSH), the International Institute of Risk and Safety Management (IIRSM) and the Institute of Environmental Management and Assessment (IEMA). Certification: On successful passing the exams you will receive a NEBOSH IGC Certificate as well as NEBOSH International Diploma Award after diploma trainings.We conduct IGC Gujarat, Ahmedabad, Anand, Banaskantha, Bharuch, Bhavnagar, Dahod, The Dangs, Gandhinagar, Jamnagar, Junagadh, Kutch, Kheda, Mehsana, Narmada, Navsari, Patan, Panchmahal, Porbandar, Rajkot, Sabarkantha, Surendranagar, Surat, Tapi, Vadodara, Valsad.\nF&amp;S F provides internationally approved trainings and corporate safety solutions to all shapes, sizes and styles of business and individuals alike FSF provides professionally qualified and experienced trainers from Trainers Forum to deliver high quality training in the health and safety field. FIRE AND SAFETY FORUM is an International Association of qualified safety professionals, acting on safety memberships and safety training to the public as well as safety professionals. Fire and safety forum, is the first association in the world acting upon memberships to make certified safety engineers internationally. Fire and Safety Forum&#8217;s corporate office is located at Cochin and having operations in all sectors like industries, public health and environment protection.  FSF also promotes qualifications from other autonomous bodies in the worldlike NEBOSH, IOSH, HSE etc.\nregards\nFSF\nhttp://www.fireandsafetyforum.com</p>","image":{"available_sizes":[[[150,137],"assets/images/resized/0011/0998/110998v2-max-150x150.jpg"],[[250,228],"assets/images/resized/0011/0998/110998v2-max-250x250.jpg"],[[450,411],"assets/images/resized/0011/0998/110998v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}