{"first_name":"nebosh","last_name":"uttarakhand","permalink":"nebosh-uttarakhand","crunchbase_url":"http://www.crunchbase.com/person/nebosh-uttarakhand","homepage_url":"http://www.fireandsafetyforum.com","birthplace":"uttarakhand","twitter_username":"neboshharidwar","blog_url":"http://www.fireandsafetyforum.org","blog_feed_url":"http://www.safetyinstitutehsetrainingsinternationalcoursescenterindia.com/","affiliation_name":"Unaffiliated","born_year":1986,"born_month":6,"born_day":18,"tag_list":"nebosh-uttarakhand, nebosh-almora, nebosh-igc, nebosh-igc-certificate, nebosh-diploma-courses, nebosh-diploma-distance-learning, nebosh-diploma-training, nebosh-international-diploma, health-and-safety-qualifications-from-nebosh-new-batches-with-special-o","alias_list":null,"created_at":"Wed Dec 01 05:54:57 UTC 2010","updated_at":"Wed Dec 01 20:01:16 UTC 2010","overview":"<p>NEBOSH uttarakhand, nebosh Almora, Nebosh igc, nebosh igc certificate, nebosh diploma courses, nebosh diploma distance learning, nebosh diploma training, nebosh international diploma, Health and Safety Qualifications from NEBOSH New batches with special offers beginning from 2011 on all international trainings for details call +919895621248. \nFire and Safety Forum the safety international association offers trainings from its R&amp;D wing as well as promote training through authorized training providers of other organizations like NEBOSH, IOSH and OSHA. Born out with a unique vision FSF is doing research and development in Safety Systems and delivering it through trainings, its registered as an NGO in India and operating for the welfare of safety professionals by giving affiliate memberships to them. We conduct NEBOSH IGC and NEBOSH Diploma at uttarakhand, Almora, Bageshwar, Chamoli, Champawat, Dehradun, Haridwar, Nainital, Pauri Garhwal, Pithoragarh, Rudraprayag, Tehri Garhwal, Udham Singh Nagar, Uttarkashi through authorized NEBOSH training provider in uttarakhand. NEBOSH (The National Examination Board in Occupational Safety and Health) was formed in 1979 as an independent examining board and awarding body with charitable status. NEBOSH offer a comprehensive range of globally-recognized, vocationally-related qualifications designed to meet the health, safety, environmental and risk management needs of all places of work in both the private and public sectors. We at Fire and Safety Forum co-ordinates the courses put forward by NEBOSH through authorized training providers like NEBOSH IGC as well as Occupational Health and Safety trainings NEBOSH international Diplomas NEBOSH Construction safety, NEBOSH health and safety managers for our safety members in Fire and Safety Forum.\nInternational health and safety trainings on NEBOSH NVQ qualifications, through authorized training providers of NEBOSH in India (NEBOSH uttarakhand,  nebosh Almora, nebosh Bageshwar,nebosh igc, nebosh international general certificate courses,nebosh igc,nebosh igc certificate, nebosh diploma courses, nebosh diploma distance learning, nebosh diploma training, nebosh international diploma, nebosh in india ,nebosh training in india,nebosh training providers, nebosh international diploma in india, nebosh training courses, nebosh training uk, nebosh international diploma,nebosh courses in india, nebosh e-learning,nebosh certificate india nebosh certificate distance learning ) for batches at uttarakhand, Almora, Bageshwar, Chamoli, Champawat, Dehradun, Haridwar, Nainital, Pauri Garhwal, Pithoragarh, Rudraprayag, Tehri Garhwal, Udham Singh Nagar, Uttarkashi.\nregards\nFSF\nhttp://www.fireandsafetyforum.com</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}