{"first_name":"Nechemia","last_name":"J. Peres","permalink":"nechemia-j-peres","crunchbase_url":"http://www.crunchbase.com/person/nechemia-j-peres","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Pitango Venture Capital","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jun 26 06:56:17 UTC 2009","updated_at":"Fri Sep 16 03:26:38 UTC 2011","overview":"<p>Mr. Chemi Peres is a Managing General Partner and Co-Founder of the Pitango Venture Capital partnership. In 1992, he founded the Mofet Israel Technology Fund, an Israeli venture capital fund publicly traded on the TASE (Tel Aviv Stock Exchange), which he managed until 1996, when he co-founded Pitango. </p>\n\n<p>Prior to Mofet, he was VP Marketing and Business Development at Decision Systems Israel (DSI), and a Senior Consultant to Israel Aircraft Industries (IAI). Mr. Peres served as a pilot in the Israeli Air Force for 10 years. </p>\n\n<p>He holds an MBA degree and a Bachelor of Science degree in Industrial Engineering &amp; Management from Tel Aviv University. He continues to be involved in the University and education in general, by serving on the Board of Directors of Ramot, the commercial arm of the Tel Aviv University that focuses on Technology Transfer, and he is Chairman of the Advisory Board of the Faculty of Management. He also serves on the Board of the Weizmann Institute of Science as well as on the Board of the IDC- Interdisciplinary Center, Herzliya. </p>\n\n<p>Mr. Peres gained extensive board experience having previously served on the boards of several publicly traded companies, such as AudioCodes (NASDAQ: AUDC), BackWeb (NASDAQ: BWEB), Magic Software Enterprises (NASDAQ: MGIC), Aladdin (NASDAQ: ALDN), VocalTec (NASDAQ: VOCL), Orckit Communications (NASDAQ: ORCT), Precise (NASDAQ: PRSE), Breezecom - now part of Alvarion (NASDAQ: ALVR), Netro Corporation (NASDAQ:NTRO), Koor Industries, one of Israel&#8217;s leading conglomerates (NYSE: KOR) and others. </p>\n\n<p>He currently serves on the boards of numerous Pitango portfolio companies, among them RADWIN,  SpeedBit, Precede Technologies, Olive Software, Focal Energy and  Pythagoras Solar.</p>\n\n<p>Mr. Peres is one of the founders of the Israel Venture Association, IVA (Now known as the High Tech Industry Association, HTIA) and during 2003/4 served as Chairman of the Board 2003-2004. </p>\n\n<p>He was Chairman of the Board of Israel America Chamber of Commerce (2008-2011). He also serves as a board member in several non-for-profit organizations among them are Matan (Investing in the community), and the Caesarea Foundation.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0005/0841/50841v4-max-150x150.jpg"],[[166,250],"assets/images/resized/0005/0841/50841v4-max-250x250.jpg"],[[300,450],"assets/images/resized/0005/0841/50841v4-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing General Partner, Co-Founder","firm":{"name":"Pitango Venture Capital","permalink":"pitango-venture-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,53],"assets/images/resized/0001/8978/18978v1-max-150x150.png"],[[206,73],"assets/images/resized/0001/8978/18978v1-max-250x250.png"],[[206,73],"assets/images/resized/0001/8978/18978v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}