{"first_name":"Ned","last_name":"Meyer","permalink":"ned-meyer","crunchbase_url":"http://www.crunchbase.com/person/ned-meyer","homepage_url":"http://www.xtivity.com","birthplace":"London, ON","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"mro, inventory, lean, six-sigma, optimization","alias_list":null,"created_at":"Wed Jun 01 20:04:56 UTC 2011","updated_at":"Fri Jun 03 18:26:19 UTC 2011","overview":"<p>Ned has over 25 years experience in the Supply Chain and Distribution sectors. Originally from the University of Detroit, Ned moved quickly into industrial supply in Southern Ontario. Always an entrepreneur at heart, he created the first of a number of businesses in the 1980’s. ARM Group Inc. was one of the first outsourced storeroom service companies, resulting in the management of 33 storerooms and handling $250 million in yearly purchases. Maintenet Corporation evolved through ARM Group to create the first internet based MRO e-commerce network. The platform met with success and the company was acquired by MRO Software of Bedford Ma. Ned remained active with MRO Software in international sales, implementing the Maximo EAM around the world. MRO Software was purchased by IBM in 2006. Xtivity remains an important partner with IBM. </p>\n\n<p>Ned was the driving force in the creation of Xtivity and is responsible for the Sales and Business Development functions for the company. He constantly brings his many contacts and vast supply chain knowledgebase to the benefit of Xtivity clients.</p>","image":null,"degrees":[{"degree_type":"","subject":"","institution":"University Of Detroit Mercy","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"","subject":"","institution":"Wayne State Universtiy","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}