{"first_name":"Neelan","last_name":"Choksi","permalink":"neelan-choksi-2","crunchbase_url":"http://www.crunchbase.com/person/neelan-choksi-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Tasktop","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jan 28 05:23:15 UTC 2010","updated_at":"Thu Jan 28 22:37:05 UTC 2010","overview":"<p>Neelan Choksi is a member of the board of directors for Tasktop Technologies. He also is the Chief Operating Officer of Lexcycle, the company behind Stanza, the most popular ebook reader for the Apple iPhone and iPod Touch. Neelan has extensive technology management experience, most recently having served as the COO of SpringSource (formerly Interface21), the venture backed open source infrastructure software company behind the Spring Framework. Prior to SpringSource, Neelan served as co-founder and President of SolarMetric, a leading object relational mapping provider, which was acquired by BEA Systems (NASDAQ: BEAS) in 2005. At BEA, Neelan was instrumental in the open sourcing of the acclaimed object/relational mapping tool Kodo as OpenJPA. Prior to SolarMetric, Neelan worked for Andersen Consulting Strategic Services (NYSE: ACN) and Exxon Research &amp; Engineering (NYSE: XOM). Neelan is a graduate of MIT (and was part of the often-publicized MIT Blackjack team) and holds graduate degrees from Stevens Institute of Technology and the University of Chicago Graduate School of Business. Choksi currently serves on the board of directors of SpringSource and Tasktop Technologies. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President & COO","firm":{"name":"Tasktop Technologies","permalink":"tasktop","type_of_entity":"company","image":{"available_sizes":[[[141,150],"assets/images/resized/0007/5199/75199v2-max-150x150.png"],[[235,250],"assets/images/resized/0007/5199/75199v2-max-250x250.png"],[[357,379],"assets/images/resized/0007/5199/75199v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}