{"first_name":"Neil","last_name":"Farrow","permalink":"neil-farrow","crunchbase_url":"http://www.crunchbase.com/person/neil-farrow","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 27 06:48:12 UTC 2009","updated_at":"Wed May 27 06:49:22 UTC 2009","overview":"<p>Received his PhD in Chemical Engineering from the California Institute of Technology and has worked in both industry and academia. He is currently a Post Doctoral Researcher at Keele University where he is applying his broad knowledge and experience in biology, biophysics and chemistry to a project entitled, ‘Use of magnetic nanoparticles and macrophages to target two novel therapies to hypoxic areas of tumours: a combined biological and mathematical study’. On this project Neil has been responsible for developing the electronic hyperthermia instrumentation, nanoparticles for hyperthermia, magnets for targeting and contributions to the cell biology. Neil received a B.Sc. from the Department of Biology at the University of Portsmouth and then worked in the U.S.A developing clinical applications for  in vivo magnetic resonance spectroscopy at the Huntington Medical Research Institute. After completing his Ph.D in the Department of Chemistry at the California Institute of Technology (1997) he returned to the UK to work for Cobra Therapeutics to research the biophysical and biological problems of human gene therapy. Neil has published a number of journal articles in the area of medical biophysics and in 2007 was nominated for Regional Citizen of the Year for his work on nanoTherics!</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Director/COO","firm":{"name":"nanoTherics","permalink":"nanotherics","type_of_entity":"company","image":{"available_sizes":[[[150,37],"assets/images/resized/0004/5625/45625v1-max-150x150.png"],[[250,63],"assets/images/resized/0004/5625/45625v1-max-250x250.png"],[[250,63],"assets/images/resized/0004/5625/45625v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}