{"first_name":"Neil","last_name":"Feldman","permalink":"neil-feldman-2","crunchbase_url":"http://www.crunchbase.com/person/neil-feldman-2","homepage_url":"http://in-three.com","birthplace":"","twitter_username":"InThree","blog_url":"http://thedimensionalists.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"in-three, 3d, films, movies, dimensionalization, images, stereoscopic, digital","alias_list":null,"created_at":"Wed Jul 29 17:22:45 UTC 2009","updated_at":"Thu Jul 30 18:40:43 UTC 2009","overview":"<p>Neil Feldman is CEO and a long time supporter of In-Three. He is the owner of Dallas based Video Post and Transfer, the leading film and video post production firm in the Southwest U.S. For over twenty-five years Video Post and Transfer has provided its customers with the highest quality film-to-tape transfer, film processing, broadcast design, digital effects design, post-production and audio services.</p>\n\n<p>At Video Post, Neil Feldman built a reputation for pioneering technical innovation in the post-production industry. For example, his was the first independent post-production facility to offer 1&#8221; Type C editing, to build all digital on-line editing bays, and the first in the country to provide unified digital audio and video editing suites. Video Post invented the Meta-Speed Digital Servo System for telecines. More recently Video Post has been a leader in providing its customers with high-definition post-production and broadcast design services.</p>\n\n<p>Beginning in the early 2000s, Mr. Feldman saw the potential for digital image based 3D that would eliminate the limitations of previous 3D display technologies. He saw that this could be accomplished by taking advantage of the impending conversion of analog (35mm print-based) movie theaters to digital cinema (D-Cinema) projection. With this in mind he underwrote In-Three&#8217;s research and development program. This effort resulted in a slate of patents for In-Three&#8217;s Dimensionalization® process and IN3D (In-Three Depth builder). This unique software suite expedites and makes practical the conversion of any 2D motion images into realistic 3D images. Neil has helped In-Three evolve from a technology development organization into a new kind of post-production facility that is uniquely qualified to address the burgeoning market for compelling 3D content.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0005/4652/54652v2-max-150x150.jpg"],[[200,250],"assets/images/resized/0005/4652/54652v2-max-250x250.jpg"],[[200,250],"assets/images/resized/0005/4652/54652v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}