{"first_name":"Neil","last_name":"Advani","permalink":"neil-advani","crunchbase_url":"http://www.crunchbase.com/person/neil-advani","homepage_url":"http://www.neiladvani.com/","birthplace":"US, California","twitter_username":"NeilAdvani1","blog_url":"http://neiladvani.wordpress.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1975,"born_month":7,"born_day":15,"tag_list":"neil-advani, business-consultant, finance-consultant","alias_list":null,"created_at":"Tue Sep 04 06:35:42 UTC 2012","updated_at":"Sat Sep 08 02:28:36 UTC 2012","overview":"<p>Neil Advani is an ingenious and adept Business and Finance Consultant and quite an apposite licensed Business Broker. With high qualifications i.e. masters from Texas A&amp;M Univ. in Management and a Bachelor’s degree in Engg, Neil Advani has over 21 years of compound experience as a Consultant incl. Pac Bell, PGE, Kaiser, Bectel et al and as a Business Broker (to shed more light on Neil Advani in this direction, you may look down at the recent transactions under Past Deals).</p>\n\n<p>Neil Advani is adequate in achieving loans as he inhabits a great financial background and has arranged financing on almost every business he has sold till date and various other deals as well.</p>\n\n<p>Neil Advani is excellently meticulous and effectual in all aspects of Business Brokerage including Evaluations, Contracts, Lien Issues, Escrows, Inventory, and Permits etc and it is not just limited to these only. A differentiating quality about Neil Advani is that he personally monitors the deal right from commencement to close out and has certainly references in abundance that can be provided if requested.</p>\n\n<p>With over 1800 buyers for Businesses in total, Neil Advani is highly decisive regarding all your business needs.</p>\n\n<p>Contact Neil Advani now if you have interest in selling your Business or obtaining a loan (Business Acquisition, Expansion or Seller Note Refinance) to enjoy free, no obligation consultation.</p>","image":{"available_sizes":[[[86,150],"assets/images/resized/0020/9543/209543v2-max-150x150.jpg"],[[112,195],"assets/images/resized/0020/9543/209543v2-max-250x250.jpg"],[[112,195],"assets/images/resized/0020/9543/209543v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.facebook.com/Neil.Advani.1","title":"FaceBook Page"},{"external_url":"https://twitter.com/neiladvani1","title":"Twitter Page"},{"external_url":"http://www.myspace.com/neil.advani","title":"Myspace"}],"web_presences":[{"external_url":"http://www.neiladvani.com/","title":""}]}