{"first_name":"NG","last_name":"Cher Yew (Dr)","permalink":"ng-cher-yew-dr","crunchbase_url":"http://www.crunchbase.com/person/ng-cher-yew-dr","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Dec 03 21:04:37 UTC 2008","updated_at":"Wed Dec 03 21:05:24 UTC 2008","overview":"<p>Co-Founder and director of Springboard Worldwide Pte Ltd which partnered WI Harper Group, based in San Franscisco, USA in Year 2000 to manage a US$ 70 million fund under the joint venture, Springboard Harper Investment Pte Ltd. Dr Ng took over the Chairman &amp; CEO of the joint-venture Fund Manager in Year 2004.</p>\n\n<p>Unlike many Asian VC, Dr Ng is a successful self-made Entrepreneur with more than 14 years experience in China in the areas of specialty fluorochemistry, animal health, electrical appliances and precision engineering/plastic mould injections. Dr Ng has factories in Guangzhou and Shanghai as well as a strong network of sales offices in the major cities of China. His Group exclusively represented some large multinational companies in these sectors such as Solvay &amp; Cie of Belgium, IDEXX of USA and Lohmann of Germany.</p>\n\n<p>Dr Ng is also an active investor and his private portfolio investments include Fashionow, a leading P2P provider listed in Taipei; Nuchannel, a leading digital media company based in Beijing; and Wallstraits, a leading financial portal based in Singapore.</p>\n\n<p>From 1985 to 1991, Dr Ng served part of his bond as a returned scholar in the AgriFood and Veterinary Authority under the Ministry of National Development as a senior officer in various key appointments. His last appointment was Deputy Director, Corporate Services.</p>\n\n<p>Dr Ng graduated from Murdoch University, Australia in 1985 with Bachelor of Veterinary Medicine and Surgery under the Colombo Plan Scholarship, administered by the Government of Singapore.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chairman & CEO","firm":{"name":"Springboard-Harper","permalink":"springboard-harper","type_of_entity":"financial_org","image":{"available_sizes":[[[150,32],"assets/images/resized/0003/0930/30930v1-max-150x150.jpg"],[[238,51],"assets/images/resized/0003/0930/30930v1-max-250x250.jpg"],[[238,51],"assets/images/resized/0003/0930/30930v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}