{"first_name":"Niall","last_name":"Carroll","permalink":"niall-carroll","crunchbase_url":"http://www.crunchbase.com/person/niall-carroll","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon May 18 13:49:23 UTC 2009","updated_at":"Mon May 18 13:50:02 UTC 2009","overview":"<p>Niall has been the Managing Director of ACT Venture Capital since its formation in 1994 and has played a major role in the development of ACT as a leading Irish and European venture capital firm. John Flynn succeeded Niall as Managing Director of ACT in 2009, and Niall is now Chairman.  Niall was a founder and director of the European Venture Capital Association (EVCA) and has been Chairman of the Irish Venture Capital Association on a number of occasions.</p>\n\n<p>Background\nPrior to joining the world of venture capital, Niall worked for five years as an electrical engineer in the Consumer Electronics Division of General Electric in the United States and later in Ireland. He then worked for six years in the general management and financial divisions of PA Management Consultants. In 1975, Niall became Managing Director of AIB Venture Capital and of Allied Combined Trust, AIB&#8217;s institutionally-financed private equity subsidiary. He subsequently became a director of Allied Irish Investment Bank, AIB Corporate Finance, AIB Capital Markets and of many private and publicly-listed companies.</p>\n\n<p>Professional Education\nNiall is a graduate in Electrical Engineering from University College Dublin (UCD), a Fellow of the Chartered Institute of Management Accountants, a Fellow of the Institute of Management Consultants and a Fellow of the Institute of Bankers in Ireland. Niall is a graduate of Stanford University&#8217;s Senior Executive Programme.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Managing Partner","firm":{"name":"ACT Venture Capital","permalink":"act-venture-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,48],"assets/images/resized/0004/4439/44439v1-max-150x150.jpg"],[[181,58],"assets/images/resized/0004/4439/44439v1-max-250x250.jpg"],[[181,58],"assets/images/resized/0004/4439/44439v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}