{"first_name":"Nicholas","last_name":"Sparks","permalink":"nicholas-sparks","crunchbase_url":"http://www.crunchbase.com/person/nicholas-sparks","homepage_url":"http://www.nicholassparks.com/","birthplace":"Omaha, Nebraska","twitter_username":"sparksnicholas","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1965,"born_month":12,"born_day":31,"tag_list":"author, novel, novels, writer, screenwriter, novelist, the-notebook, a-walk-to-remember, books, writing, literature","alias_list":"","created_at":"Fri Apr 13 02:10:25 UTC 2012","updated_at":"Fri Apr 13 02:10:25 UTC 2012","overview":"<p>Nicholas Charles Sparks was born in Omaha, Nebraska, on December 31, 1965, the second son of Patrick Michael (1942-1996) and Jill Emma Marie (Thoene) Sparks (1942-1989). His siblings are Michael Earl Sparks (b. Dec. 1964), and Danielle Sparks (b. Dec. 1966, d. June, 2000). As a child, he lived in Minnesota, Los Angeles, and Grand Island, Nebraska, finally settling in Fair Oaks, California, at the age of eight. His father was a professor, his mother a homemaker, then an optometrist’s assistant. He lived in Fair Oaks through high school, graduated valedictorian in 1984, and received a full track scholarship to the University of Notre Dame.</p>\n\n<p>After breaking the Notre Dame school record as part of a relay team in 1985 as a freshman (a record which still stands), he was injured and spent the summer recovering. During that summer, he wrote his first novel, though it was never published. He majored in Business Finance and graduated with high honors in 1988.</p>\n\n<p>He and his wife Catherine, who met on spring break in 1988, were married in July 1989. While living in Sacramento, he wrote his second novel that same year, though again, it wasn’t published. He worked a variety of jobs over the next three years, including real estate appraisal, waiting tables, selling dental products by phone, and started his own small manufacturing business which struggled from the beginning. In 1990, he collaborated on a book with Billy Mills, the Olympic Gold Medalist, and it was published by Feather Publishing before later being picked up by Random House. (It was later re-issued by Hay House Books.) Though it received scant publicity, sales topped 50,000 copies in the first year of release.</p>\n\n<p>He began selling pharmaceuticals and moved from Sacramento, California to North Carolina in 1992. In 1994, at the age of 28, he wrote The Notebook over a period of six months. In October 1995, rights to The Notebook were sold to Warner Books. It was published in October 1996, and he followed that with Message in a Bottle (1998), A Walk to Remember (1999), The Rescue (2000), A Bend in the Road (2001), Nights in Rodanthe (2002), The Guardian (2003), The Wedding (2003), True Believer (2005), At First Sight (a sequel to True Believer) (2005), Dear John (2006), The Choice (2007), The Lucky One (2008), The Last Song (2009), Safe Haven (2010), The Best of Me (2011),  and a non-fiction memoir, Three Weeks With My Brother (2004), written with his brother, Micah, all with Warner Books / Grand Central Publishing. All were domestic and international best sellers, with almost $80 million in worldwide sales, and were translated into more than 45 languages.</p>\n\n<p>The film version of Message in a Bottle, starring Kevin Costner and Robin Wright, was released in 1999, A Walk to Remember, starring Mandy Moore, was released in January 2002, and The Notebook, starring Ryan Gosling and Rachel McAdams, was released in June, 2004. Nights in Rodanthe, starring Richard Gere and Diane Lane, was released in September 2008. Dear John, starring Channing Tatum and Amanda Seyfried, and The Last Song, starring Miley Cyrus and Greg Kinnear, were released in 2010 to great box office success. The Lucky One, starring Zac Efron, will be released on April 20, 2012.</p>\n\n<p>His ancestry is German, Czech, English and Irish; he’s 5’10” and weighs 185lbs. He is an avid athlete who exercises daily. He attends church regularly and reads approximately 125 books a year. He contributes to a variety of local and national charities, and is a major contributor to the Creative Writing Program (MFA) at the University of Notre Dame, where he provides scholarships, internships, and a fellowship annually. Along with his wife, he founded The Epiphany School in New Bern, North Carolina, and he spent five years coaching track and field athletes at the local public high school.</p>\n\n<p>Nicholas lives in North Carolina with his wife and family.</p>","image":{"available_sizes":[[[117,150],"assets/images/resized/0018/4017/184017v1-max-150x150.jpg"],[[195,250],"assets/images/resized/0018/4017/184017v1-max-250x250.jpg"],[[250,320],"assets/images/resized/0018/4017/184017v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.nicholassparks.com\" title=\"NicholasSparks.com\" rel=\"nofollow\">NicholasSparks.com</a></p>"},"degrees":[{"degree_type":"B.S.","subject":"Business Finance","institution":"University of Notre Dame","graduated_year":1988,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.facebook.com/Nicholas.Sparks.Fan","title":"Official Facebook Page"},{"external_url":"http://whosay.com/nicholassparks","title":"Nicholas on WhoSay"},{"external_url":"http://twitter.com/NotebookThe","title":"The Notebook on Twitter"},{"external_url":"http://twitter.com/nsparksFDN","title":"Nicholas Sparks Foundation on Twitter"},{"external_url":"https://plus.google.com/117797373575476817494/posts","title":"Google+"},{"external_url":"http://youtube.com/NicholasSparksNovels","title":"YouTube"}]}