{"first_name":"Nick","last_name":"Abramovich","permalink":"nick-abramovich-2","crunchbase_url":"http://www.crunchbase.com/person/nick-abramovich-2","homepage_url":"http://www.synapticdigital.com","birthplace":"Ukraine","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1972,"born_month":5,"born_day":23,"tag_list":"","alias_list":null,"created_at":"Tue Apr 10 15:55:08 UTC 2012","updated_at":"Fri Apr 13 22:20:01 UTC 2012","overview":"<p>Nick is the As CEO and President of Synaptic Digital where he oversees the executive management team and leads the company’s strategy and business development initiatives.</p>\n\n<p>Prior to Synaptic Digital, Nick was the CFO and Chief Operating Officer of MoveOnIn.com, a New York-based tech start-up leading that company through two major acquisitions and restructuring efforts.  Moveonin was acquired by Fala Internation Inc.  Nick was also the COO/CFO at Formsfusion, Inc., (ApartmentRenting.com) where he oversaw the turnaround for a venture-backed company providing tech and  marketing services for real estate industry and led the corporate development process resulting in the sale of the Company and a 31% return for senior investors.</p>\n\n<p>Nick started his career at Coopers &amp; Lybrand’s International Strategy and Planning Group and then went on to become a principal at The Bosworth Group, a boutique consultancy providing quantitative and strategy support to senior level management in the financial services industry. He was later recruited by MetLife through its acquisition of The Bosworth Group to build an internal consulting capability responsible for database marketing, quantitative analysis, and strategic planning. At Metlife, Nick was also responsible for overseeing MetLife’s customer relationship management (CRM) and e-Business activities.  </p>","image":{"available_sizes":[[[150,149],"assets/images/resized/0018/3506/183506v2-max-150x150.jpg"],[[183,182],"assets/images/resized/0018/3506/183506v2-max-250x250.jpg"],[[183,182],"assets/images/resized/0018/3506/183506v2-max-450x450.jpg"]],"attribution":"<p>Nick Abramovich</p>"},"degrees":[{"degree_type":"MBA","subject":"","institution":"Columbia Business School","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.synapticdigital.com/about/management/","title":""}]}