{"first_name":"Nick","last_name":"Gillespie","permalink":"nick-gillespie","crunchbase_url":"http://www.crunchbase.com/person/nick-gillespie","homepage_url":"http://reason.tv","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Sat Dec 11 17:41:04 UTC 2010","updated_at":"Sat Dec 11 17:41:04 UTC 2010","overview":"<p>Nick Gillespie is editor in chief of Reason.tv and Reason.com, which draws 2.5 million visits per month and features the staff weblog Hit &amp; Run, named by Playboy, Washingtonian, and others as one of the best political blogs.</p>\n\n<p>Gillespie served as Reason magazine&#8217;s editor in chief from 2000 to 2008. Under his direction, Reason won the 2005 Western Publications Association &#8220;Maggie&#8221; Award for Best Political Magazine. Gillespie originally joined Reason&#8217;s staff in 1993 as an assistant editor and ascended to the top slot in 2000. In 2004, Gillespie edited the book Choice: The Best of Reason, an anthology of the magazine&#8217;s best articles.</p>\n\n<p>The Washington Post featured Gillespie&#8217;s tenure at Reason magazine, asking, &#8220;Which monthly magazine editor argues that the spread of pornography is a victory for free expression? And that drugs from marijuana to heroin should not only be legalized, but using them occasionally is just fine? And is also quite comfortable with gay marriage? The answer is Nick Gillespie, libertarian and doctor of literature, who&#8230;is injecting [Reason magazine] with a pop-culture sensibility.&#8221;</p>\n\n<p>Gillespie&#8217;s work has appeared in The New York Times, The Washington Post, The Wall Street Journal, The Los Angeles Times, The New York Post, Slate, Salon, Time.com, Marketplace, and numerous other publications. He was a regular contributor to the late, lamented satire site, Suck, where he wrote under the name Mr. Mxyzptlk.</p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0011/3801/113801v1-max-150x150.jpg"],[[250,165],"assets/images/resized/0011/3801/113801v1-max-250x250.jpg"],[[400,265],"assets/images/resized/0011/3801/113801v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}