{"first_name":"Nick","last_name":"Bouton","permalink":"nick-bouton","crunchbase_url":"http://www.crunchbase.com/person/nick-bouton","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Feb 11 23:29:10 UTC 2008","updated_at":"Wed Feb 13 00:30:47 UTC 2008","overview":"<p>Nick has worked in web application development in Vancouver for over ten years, specifically with the Microsoft .NET Framework, Java/J2EE, PHP, Perl and a variety of open source development frameworks and content management systems. A dynamic developer, Nick works primarily in developing content management systems, but has extensive experience in custom software architecture and development, business intelligence applications, wireless technology, and knowledge management solutions. </p>\n\n<p>Since 2005, Nick has gained a host of experience in product development, specifically having spent 3 years working on OpenRoad Communications&#8217; ThoughtFarmer intranet product, a wiki-inspired knowledge sharing tool for the enterprise. </p>\n\n<p>In addition to a significant amount of consulting work, including the recent development and launch of Protagonize.com, Nick has spent over five years with OpenRoad Communications as a software developer. His previous positions included Technical Director for Tribal DDB Canada in Vancouver, developing web-based advertising and marketing systems for a variety of large agency clients. After that, Nick spent a year and a half as a software engineer at Versatile Mobile Systems, building intranet systems as well as internet-based monitoring tools for the agricultural sector in south-east Asia. </p>\n\n<p>Over the course of the last two years, Nick has focused principally on user experience development. This includes Web 2.0 / AJAX application development, enterprise / intranet application development, and a variety of community-driven web projects. Nick consults regularly in these areas. </p>\n\n<p>Nick majored in Computer Science at the University of British Columbia and spent time completing an Associate&#8217;s Certificate in Java from the BCIT Java development program. He also holds certifications in several technologies ranging from ColdFusion to XML development. </p>","image":null,"degrees":[],"relationships":[{"is_past":null,"title":"Founder & Principal","firm":{"name":"Taunt Media","permalink":"taunt-media","type_of_entity":"company","image":{"available_sizes":[[[150,100],"assets/images/resized/0001/1535/11535v1-max-150x150.png"],[[150,100],"assets/images/resized/0001/1535/11535v1-max-250x250.png"],[[150,100],"assets/images/resized/0001/1535/11535v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}