{"first_name":"Nick","last_name":"Gable","permalink":"nick-gable","crunchbase_url":"http://www.crunchbase.com/person/nick-gable","homepage_url":"http://nickgable.com/","birthplace":"","twitter_username":"nickjamesgable","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1989,"born_month":6,"born_day":21,"tag_list":"nick-gable, nicholas-gable, nick-james-gable, nickjames","alias_list":null,"created_at":"Mon Mar 05 21:31:00 UTC 2012","updated_at":"Wed Apr 04 07:27:46 UTC 2012","overview":"<p>Nick Gable is currently a social media and special projects consultant at Reputation.com.  Knowledgeable in social media, blogging platforms, social psychology, and web design Nick uses his variety of skills to help achieve client&#8217;s SEO and online reputation management goals.  </p>\n\n<p>Nick Gable graduated from Santa Clara University in June 2010 with a degree in psychobiology with an emphasis in social psychology.  He has always been fascinated by the interplay between psychology and interpersonal behavior, along with the innovations and social sharing brought about by social media and web2.0.  In addition to his SEO work for Reputation.com, Nick is an avid blogger and social media manager, and maintains several websites based upon his interests.</p>\n\n<p>Modern Bachelor Lifestyle is one of Nick&#8217;s sites, dedicated to personal fitness, motivation, and personal development.  Nick Gable founded modernbachelorlifestyle.com as a way of giving back the information he has accumulated over the years on what it means to be a man in this modern world.  Nick blogs about staying fit, healthy eating habits, and how to live the life you&#8217;ve always dreamed of.</p>\n\n<p>In addition to blogging about fitness, Nick Gable is also an avid follower of Brazilian Jiujitsu and combat fitness.  As such, Nick works out 5-6 days a week on a variety of capacities, from raw strength to endurance &amp; flexibility.  Nick hopes to start competing in BJJ soon and to continue to improve his fitness for this goal.</p>","image":null,"degrees":[{"degree_type":"Bachelors of Science","subject":"Psychobiology","institution":"Santa Clara University","graduated_year":2010,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.visualcv.com/nickjgable","title":"Nick's virtual resume"},{"external_url":"http://plus.google.com/100617567952715950719/","title":"Mr. Gable on Google+"},{"external_url":"http://nickgable.hubpages.com/","title":"Nick James Gable | Hubpages"}]}