{"first_name":"Nick","last_name":"Ashton-Hart","permalink":"nick-ashton-hart","crunchbase_url":"http://www.crunchbase.com/person/nick-ashton-hart","homepage_url":"http://ch.linkedin.com/in/ashtonhart","birthplace":"Arizona, USA","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Computer & Communcations Industry Association","born_year":1967,"born_month":4,"born_day":22,"tag_list":"","alias_list":null,"created_at":"Fri Feb 24 12:52:49 UTC 2012","updated_at":"Sat Mar 03 12:19:38 UTC 2012","overview":"<p>Nick Ashton-Hart is the Geneva Representative of the Computer and Communications Industry Association (CCIA) where he is responsible for representing the interests of major ICT sector multinationals in world trade, intellectual property, and Internet governance policy to the UN, its agencies and the world’s government negotiators based in what is the world’s multilateral policy capital. He is also a strategic advisor to Google, Inc., with respect to strategic relationship development and licensing arrangements for its music properties as well as strategic advice with respect to international licensing platform development.</p>\n\n<p>He is the founding coordinator of a broad coalition of civil society NGOs, intellectual property rightsholders, libraries, consumer organisations and industrial stakeholders known as Copyright for Creativity (C4C) and was a key part of the founding Secretariat and organising committee of the International Music Registry project at the World Intellectual Property Organisation (WIPO). </p>\n\n<p>Previously he was Director for At-Large and Senior Director for Participation and Engagement with the Internet Corporation for Assigned Names and Numbers, Inc. (ICANN), where he was responsible for dramatic increases in the engagement of the individual Internet user community worldwide in ICANN and the strategic development of cross-stakeholder relations, facilitating increasing participation across all stakeholder groups worldwide in Internet policy development. </p>\n\n<p>Ashton-Hart’s professional career began in the music industry where he managed some of the worlds most famous and successful performers such as James Brown and Heaven 17. This involved the practical application of intellectual property law and the management of people of diverse skill sets and backgrounds, projects with multi-million-dollar budgets and revenues, and complex negotiations of long-term recording, publishing, sponsorship, and other contractual arrangements. </p>\n\n<p>He has served as a Director and Managing Director of companies in various market sectors during his professional career, including as the Executive Director of the International Music Managers Forum (IMMF), the international non-governmental organisation representing the interests of music managers and their clients, the featured artist community, worldwide.  </p>\n\n<p>In the private sector he has led a successful IT consultancy, providing consulting services for companies in transition, or during reorganisations or periods of rapid growth. His work there ranged from advising companies on how to achieve greater ROI on their IT systems to designing and redesigning enterprise-wide IP based networks. He has been engaged at various times as a full-time and temporary IT Director and CTO/CIO.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Geneva Representative","firm":{"name":"Computer & Communcations Industry Association","permalink":"computer-communcations-industry-association","type_of_entity":"company","image":null}},{"is_past":false,"title":"Consultant-Advisor","firm":{"name":"Google, Inc","permalink":"google-inc-2","type_of_entity":"company","image":null}},{"is_past":true,"title":"Senior Director for Participation and Engagement","firm":{"name":"Internet Corporation for Assigned Names and Numbers, Inc.","permalink":"internet-corporation-for-assigned-names-and-numbers-inc","type_of_entity":"company","image":null}},{"is_past":true,"title":"Executive Director","firm":{"name":"International Music Managers Forum (IMMF)","permalink":"international-music-managers-forum-immf","type_of_entity":"company","image":null}},{"is_past":true,"title":"Director for At-Large","firm":{"name":"Internet Corporation for Assigned Names and Numbers, Inc. (ICANN)","permalink":"internet-corporation-for-assigned-names-and-numbers-inc-icann","type_of_entity":"company","image":null}},{"is_past":true,"title":"Managing Director","firm":{"name":"Subversive Music Management / Intrigue Music Management (Europe)","permalink":"subversive-music-management-intrigue-music-management-europe","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://en.wikipedia.org/wiki/Nick_Ashton-Hart","title":"Wikipedia"}],"web_presences":[]}