{"first_name":"Nico","last_name":"Nierenberg","permalink":"nico-nierenberg","crunchbase_url":"http://www.crunchbase.com/person/nico-nierenberg","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Feb 08 03:39:00 UTC 2008","updated_at":"Fri Jun 27 17:44:18 UTC 2008","overview":"<p>Nico Nierenberg, early in his career as a systems programmer and applications developer at SAIC, developed a strong interest in inventing and bringing new products to market. When Nico left SAIC to join Rogers Kirkmann, another systems integration firm, a project to build a bloodbank management system required an open database platform. This became the seed idea for Unify, which Nico founded in 1980, helping to create the market for UNIX relational database systems. Nico served as CEO for several years and then subsequently as CTO.</p>\n\n<p>In February, 1993, Nico joined Accel as Entrepreneur-in-Residence. According to Nico, he became fully integrated and participated in all the activities of the firm. In his tenure as EIR, Nico studied the importance of creating a full blueprint for a business, not simply a product concept. Nico observed that many entrepreneurs lose focus of the needs of potential investors. Working as a VC made me realize how important it is for the entrepreneur to clearly communicate every aspect of the business. Venture firms become concerned if the founders can&#8217;t clearly articulate all the factors that may affect success or failure.</p>\n\n<p>In December, 1993 Nico founded and became CEO of Actuate Software Corporation, a company that would create a new model for enterprise reporting. Leveraging the Internet and new distributed computing principles, Actuate enables enterprise-wide information distribution based on virtually all corporate data sources. Looking back, Nico describes his experience as an Accel EIR as &#8220;profoundly changing the way I thought about software companies. The EIR program had a major educational effect on me and helped enormously in my efforts to define the business model for Actuate&#8221;.</p>","image":{"available_sizes":[[[119,150],"assets/images/resized/0001/0670/10670v1-max-150x150.jpg"],[[199,250],"assets/images/resized/0001/0670/10670v1-max-250x250.jpg"],[[207,260],"assets/images/resized/0001/0670/10670v1-max-450x450.jpg"]],"attribution":null},"degrees":[],"relationships":[{"is_past":false,"title":"Chairman of the Board and Chief Architect","firm":{"name":"Actuate","permalink":"actuate","type_of_entity":"company","image":{"available_sizes":[[[150,41],"assets/images/resized/0006/8943/68943v4-max-150x150.jpg"],[[250,69],"assets/images/resized/0006/8943/68943v4-max-250x250.jpg"],[[300,83],"assets/images/resized/0006/8943/68943v4-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Partner","firm":{"name":"Accel Partners","permalink":"accel-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,54],"assets/images/resized/0001/0604/10604v3-max-150x150.jpg"],[[250,90],"assets/images/resized/0001/0604/10604v3-max-250x250.jpg"],[[450,162],"assets/images/resized/0001/0604/10604v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}