{"first_name":"Nidhi","last_name":"Maheshwari","permalink":"nidhi-maheshwari","crunchbase_url":"http://www.crunchbase.com/person/nidhi-maheshwari","homepage_url":"http://www.elitify.com","birthplace":"New Delhi","twitter_username":"elitify","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1984,"born_month":2,"born_day":10,"tag_list":"shirt, t-shirt, watches, shoes, luxury-brands-for-men, cufflinks, wallets, ties, accessories-for-men, latest-shoes, clothing, belts, sunglasses, coats, casual-shirts, formal-shirt, fashion-style, socks, inner-wear, shirt-shopping","alias_list":null,"created_at":"Fri Oct 26 18:00:32 UTC 2012","updated_at":"Fri Nov 02 06:57:11 UTC 2012","overview":"<p>ELTIFY is India’s premier style lounge, where the distinctive men of India can visualize and realize their style fantasies. They have hand-picked highly sought-after products from all over the world, and presented them in their creative story-telling format. And if you yearn to be pampered, then you are offered a personal stylist and shopping service that will help you elevate your style to the next level. ELITIFY invites you to explore, indulge, and evangelize what aspires to be your &#8220;go to&#8221; destination for anything that defines a man’s style.</p>\n\n<p>The team comprises of dedicated fashion enthusiasts, who infuse their passions for online shopping into Elitify. They take inspiration from all aspects of life with an aim to encourage and enable customers in assembling a look that best represents their personal style. Everything including the aesthetics of the site, their premium packaging, and the “customer first” service, set them apart from the rest.</p>","image":{"available_sizes":[[[150,21],"assets/images/resized/0021/7423/217423v2-max-150x150.png"],[[250,35],"assets/images/resized/0021/7423/217423v2-max-250x250.png"],[[450,64],"assets/images/resized/0021/7423/217423v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}