{"first_name":"Nigel","last_name":"Grierson","permalink":"nigel-grierson","crunchbase_url":"http://www.crunchbase.com/person/nigel-grierson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu May 21 08:18:45 UTC 2009","updated_at":"Thu May 21 08:20:32 UTC 2009","overview":"<p>Nigel Grierson is a co-Managing Director and Founder of the Doughty Hanson Technology Fund.  Specific areas of expertise include financial venture investment, high technology marketing and organisation development. Nigel delivers a number of career development courses for the European Venture Capital Association.</p>\n\n<p>Previously Nigel was the Group Director for Intel Capital Europe, managing a team responsible for making strategic equity investments and developing new business opportunities throughout Europe.  He and the team together originated and invested in over 35 technology start-up companies, many of which became substantial public companies. Also at Intel he was Divisional Director for Networking and Communications Products, Systems Engineering Manager delivering major turnkey projects for Intel customers and set up a 24x7 worldwide customer support.</p>\n\n<p>Prior to joining Intel Nigel worked at AT&amp;T in the Communications Product Division leading a team developing high performance silicon processors, and also at Schneider Electric developing industrial process control systems.</p>\n\n<p>In his spare time Nigel plays music, spends quality time with his family and studies personal and organisational behavior.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"co-Managing Director and Founder","firm":{"name":"Doughty Hanson Technology Ventures","permalink":"doughty-hanson-technology-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[109,61],"assets/images/resized/0002/3552/23552v1-max-150x150.png"],[[109,61],"assets/images/resized/0002/3552/23552v1-max-250x250.png"],[[109,61],"assets/images/resized/0002/3552/23552v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}