{"first_name":"Nigel","last_name":"Camp","permalink":"nigel-camp","crunchbase_url":"http://www.crunchbase.com/person/nigel-camp","homepage_url":"http://www.devilboyproductions.com","birthplace":"","twitter_username":"nigelcamp","blog_url":"http://www.nigelcamp.wordpress.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"video-production, nigel-camp, motion-graphics, animation","alias_list":null,"created_at":"Tue Mar 27 09:41:35 UTC 2012","updated_at":"Tue Mar 27 23:39:03 UTC 2012","overview":"<p>Nigel Camp founded DevilBoy Productions, a video production company which specialises in producing promotional videos for small businesses who want a big company experience on a small company budget.</p>\n\n<p>Nigel has worked with video for more than 7 years acquiring both creative and technical expertise and its what he enjoys doing most. Also, he has over 10 years experience in the software industry managing projects globally so understand the complexities of delivering large projects. </p>\n\n<p>Online video has now become the fastest form of internet marketing. However, one of the biggest problems is that businesses risk wasting time and money if they create the wrong types of videos. The wrong type of video will do little to attract any new sales if doesn’t appeal to the right target market.</p>\n\n<p>Nigel&#8217;s production company will work out the right videos for your business and he will start this by looking closely at your target market as well as the video strengths and weaknesses of your key competitors. He will create videos that use effective filmmaking and communication techniques as well a touch of motion graphics and animation typically reserved for television and film. </p>\n\n<p>When Nigel is not managing his company, he active travelling and always planning out his next adventure holiday. He&#8217;s an avid snowboarder and beach bum. </p>\n\n<p>You can find out more about Nigel by following him on twitter and his website www.devilboyproductions.com</p>","image":{"available_sizes":[[[149,150],"assets/images/resized/0018/1293/181293v2-max-150x150.jpg"],[[249,250],"assets/images/resized/0018/1293/181293v2-max-250x250.jpg"],[[319,320],"assets/images/resized/0018/1293/181293v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}