{"first_name":"Niko","last_name":"Klansek","permalink":"niko-klansek","crunchbase_url":"http://www.crunchbase.com/person/niko-klansek","homepage_url":"http://niko.klansek.com","birthplace":"Slovenia","twitter_username":"nklansek","blog_url":"","blog_feed_url":"","affiliation_name":"BizMe","born_year":1984,"born_month":2,"born_day":20,"tag_list":"","alias_list":null,"created_at":"Tue Oct 13 13:36:31 UTC 2009","updated_at":"Tue Jul 10 17:25:04 UTC 2012","overview":"<p>Born in Slovenia, Niko Klansek developed his entrepreneurial talents at a young age.  With the desire to imitate, and even surpass his mother’s business accomplishments, he was always in search of great ideas.  At the age of 11, Niko discovered a technologically superior pouch in Italy, and realized that the container would be ideal for packaging the beverages produced by Nektar, his mother’s company.</p>\n\n<p>In 1991, Niko was a member of the first class to attend the first-ever private school in Slovenia, and eventually entered the finest high school in the country: Gimnazija Bezigrad. It was there that he began to passionately pursue his loves of education and basketball.  During his basketball career, Niko won an impressive 19 gold medals, one of which was for the World High School Basketball Championship in Turkey.</p>\n\n<p>On account of his athletic skill, Niko moved to the United States, where he played high school basketball in California and also played for Chemeketa College where his team won the division championship in the 2002/2003 season. While living on his own, Niko craved the smoothies his mother used to make, and as a result, realized the need to package natural fruit purees conveniently for busy, health-conscious American consumers. It was then that Niko realized his true passion was to help people adopt healthy lifestyles through innovation – and encouraged his mother to partner with him to make his dreams a reality.   </p>\n\n<p>In October 2004, Niko and his mother Lucia established E4B, EASY 4 BUSY, LLC.  In 2006, E4B, an all natural line of blended fruit purees was launched in the United States and a year later in Japan. E4B was featured in Forbes Magazine, ABC TV, On The Menu Radio Show, Springwise.com and many more.</p>\n\n<p>In May 2008, Niko graduated from Fordham University. Soon after, Niko became a member of SLO 4 YOU Foundation, an organization that connects Slovenian people around the world.</p>\n\n<p>In October 2008, Niko established BizMe, LLC, an Angel Investment firm focusing on start-up internet companies. </p>","image":{"available_sizes":[[[129,150],"assets/images/resized/0019/9855/199855v2-max-150x150.jpg"],[[215,250],"assets/images/resized/0019/9855/199855v2-max-250x250.jpg"],[[387,450],"assets/images/resized/0019/9855/199855v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"bachelor degree","subject":"Info System","institution":"Fordham University","graduated_year":2008,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"FlyKly","permalink":"flykly","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0019/9867/199867v2-max-150x150.jpg"],[[250,89],"assets/images/resized/0019/9867/199867v2-max-250x250.jpg"],[[450,160],"assets/images/resized/0019/9867/199867v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"President","firm":{"name":"BizMe","permalink":"bizme","type_of_entity":"financial_org","image":{"available_sizes":[[[150,45],"assets/images/resized/0006/2623/62623v2-max-150x150.jpg"],[[250,76],"assets/images/resized/0006/2623/62623v2-max-250x250.jpg"],[[450,137],"assets/images/resized/0006/2623/62623v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"President","firm":{"name":"SportBoard","permalink":"sportboard","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}