{"first_name":"Nils","last_name":"Puhlmann","permalink":"nils-puhlmann","crunchbase_url":"http://www.crunchbase.com/person/nils-puhlmann","homepage_url":"http://cloudsecurityalliance.org","birthplace":"","twitter_username":"npuhlmann","blog_url":"","blog_feed_url":"","affiliation_name":"Zynga","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jan 01 19:57:28 UTC 2010","updated_at":"Mon Jun 11 18:31:05 UTC 2012","overview":"<p>Nils Puhlmann leads Zynga’s converged security department, managing all security risks for the company and chairing the Security Risk Committee. He oversees the company’s security domains of product &amp; application security, security engineering &amp; architecture, investigations &amp; incident response, security intelligence &amp; threat assessments, physical security, security compliance &amp; audit.</p>\n\n<p>Nils is also a Co-Founder and member of the Board of the Cloud Security Alliance, a community of over 33,000 security professionals in over 50 chapters worldwide with the goal to promote the use of best practices for providing security assurance within Cloud Computing. The Alliance also educates on the uses of Cloud Computing to help secure all other forms of computing.</p>\n\n<p>Before joining Zynga, he served as Chief Security Officer of Qualys, where he was responsible for security, risk management and business continuity planning. His responsibilities included the security of the cloud-based QualysGuard SaaS platform. He also led the Qualys CSO Advisory Board and evangelized at various international industry events in areas of security management and cloud security.</p>\n\n<p>Prior to Qualys, Puhlmann was the Chief Information Security Officer for Electronic Arts, with global responsibility for information security, intellectual property protection, risk management, compliance, physical security, forensics &amp; investigations and business continuity management/disaster recovery.</p>\n\n<p>He was also previously the Chief Information Security Officer at Robert Half International, where he had global responsibility for managing information security, risk management, privacy, forensics &amp; investigations, CERT and Business Continuity Management enterprise wide. </p>\n\n<p>Prior to that, he was Director Global IT &amp; Security and Chief Privacy Officer at Mindjet Corp, where he managed Mindjet&#8217;s global information security, physical security and privacy programs. He was also a Senior Manager of Product Security at Adobe Systems, responsible for creating and managing Adobe&#8217;s product vulnerability program, overseeing security assessments of Adobe applications, driving product security certifications, and promoting secure development practices. He created Adobe&#8217;s product security incident response team, chaired Adobe&#8217;s Security Task Force and managed Adobe&#8217;s first Common Criteria Certification.</p>\n\n<p>Puhlmann also held senior positions at Nortel Networks and START Amadeus, and was an independent security consultant with clients such as the State of California. He maintains numerous security certifications, including CISSP-ISSMP and CISM. He has held Board of Directors positions in the past (ISACA Silicon Valley, OVAL) and is currently a Director on the Board of the Cloud Security Alliance, a Director on the International Board of Directors of ISSA, an Advisory Board member for several Security Companies, is a member of the CSO Interchange, the CISO Executive Council and a subject matter expert for ISACA and ISC2. He was also a member of the Advisory Council for the CISO Forum of ISSA.</p>\n\n<p>Puhlmann was invited in 2009 by the Dept. of Defense and the Executive Office of the President to speak at the National Cyber Leap Year Summit in Washington, DC. and is\na frequent speaker and keynote presenter at global security and technology conferences. He is considered a visionary in the field of information security and his advice is frequently sought after by corporations and government entities.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0007/1796/71796v2-max-150x150.jpg"],[[167,250],"assets/images/resized/0007/1796/71796v2-max-250x250.jpg"],[[301,450],"assets/images/resized/0007/1796/71796v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CSO","firm":{"name":"Zynga","permalink":"zynga","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0000/3187/3187v10-max-150x150.jpg"],[[250,83],"assets/images/resized/0000/3187/3187v10-max-250x250.jpg"],[[275,92],"assets/images/resized/0000/3187/3187v10-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}