{"first_name":"Nina","last_name":"Milos","permalink":"nina-milos","crunchbase_url":"http://www.crunchbase.com/person/nina-milos","homepage_url":"http://www.studentu.me/","birthplace":"Canada","twitter_username":"studentuapps","blog_url":"http://www.studentu.me/","blog_feed_url":"http://www.studentu.me/","affiliation_name":"Unaffiliated","born_year":1988,"born_month":11,"born_day":4,"tag_list":"social-discovery-fun-flert-chat-students","alias_list":null,"created_at":"Mon Nov 05 13:22:17 UTC 2012","updated_at":"Thu Nov 08 07:48:35 UTC 2012","overview":"<pre><code>                                       For Immediate Release\n</code></pre>\n\n<p>Discover Student Life Around U with Student’U</p>\n\n<p>An app for students to help them make new friends, chat, share pictures, flirt and have fun</p>\n\n<p>The essence of Student Life is about discovering new people, creating original ideas, being in different places, and of course parties. However, making new friendships to share this experience with is never straightforward, as students are nose into the books or too focused on their next classes, their next assignments. Discovering new students at Uni is not always easy. </p>\n\n<p>Enter Student’U, a social discovery app exclusively for students at University, who are ready to participate in On-Campus and Off-Campus Life on different levels, allowing them to begin a chat, share appealing pics, locate interesting students, stay informed about academic life and even flirt.</p>\n\n<p>“Where Facebook is great for keeping in touch with old friends, Student’U lets U discover other students around and to make new friendships, by enriching Ur Student experience”, says Marc Bisnaire, president of SmaartMobile, “it’s a special Student Mobile App that’s ideal for creating a community of students”.</p>\n\n<p>Student’U is a Student Community Building Tool that help students get to know other colleagues in a fun and even flirty way. And where is the best place for flirting? Parties!!! Student’U is a great app to help U find where students are partying right now. Moreover, the mapping function can help U find Ur friends, in order to surprise them and join them. U can even see when they are nearby and join them for a coffee or just to say “Hi” in person.</p>\n\n<p>‘’Student life is not so easy especially when Universities are spread out, and classes can be far apart…’’ says, Milenko Radic, Marketing Manager of SmaartMobile Company. “…If U are studying all day, Ur chances of outside contact are slim, and the reality is U’ll never know what is actually going on. Student’U let’s U expand Ur social circles, and start discovering with student hotpots.”</p>\n\n<p>The uniqueness of Student’U is that it comes with 5 Pre-Set Profiles, which define who and how U interact with. The Two Student Profiles keep you connected only with other Students and focused on Student life. The two public Discovery Profiles allow U to connect with non-students and go beyond the campus.  In each set of profiles, whether student or discovery, students have the option to focus on making friends or flirting as this App provides a separate profile for each.   </p>\n\n<ol>\n<li><p>Student Profile, this profile is for discovering and making new friends with other students on Campus, for reaching out into that student community and engaging in Student life;</p></li>\n<li><p>Facebook Flirt Profile, (a student profile) where U can coquette with other Facebook students without leaving any trace of the flirting activity on Ur Facebook;</p></li>\n<li><p>Discovery Profile (a public profile), for sneaking out of academic life and meeting non-students who can show U the best places, parties and events outside the Uni.</p></li>\n<li><p>Facebook Global Profile (a public profile), for discovering other non-Uni Facebook users;</p></li>\n<li><p>Friends Profile (a private profile), where the mapping feature will help U to locate Ur friends that might be nearby and make it easier to hang out with them. </p></li>\n</ol>\n\n<p>“The biggest issue with all Social Discovery Apps is that all too often it degenerates into men-seeking-women and more to the point, men-hitting-on-women.” says president Marc Bisnaire, “so as a result ladies are less inclined to participate as they have a hard time making friends.” He added: “Student’U empowers females with both choices of either making friends or flirting”. </p>\n\n<p>For females when they make the “student profile” active it projects the intention that this is ‘friends time’, whether girls or guys. On the other hand, they can show their coquette side by making their Facebook Flirt Profile active and show more obvious intentions.  </p>\n\n<p>Student’U, getting U involved in Student Life.</p>\n\n<p>Student’U is available for Android (v.2.2 +…), iOS and WP7 (also WP8 ready). </p>\n\n<p>The price is perfect for Students - it’s FREE! \nAvailable in: English, Serbian, Russian, (and coming soon in German, French, Spanish, Italian, Bulgarian, Swedish).</p>\n\n<p>Visit www.StudentU.me and download now!   </p>","image":{"available_sizes":[[[150,40],"assets/images/resized/0021/8812/218812v2-max-150x150.jpg"],[[250,67],"assets/images/resized/0021/8812/218812v2-max-250x250.jpg"],[[450,121],"assets/images/resized/0021/8812/218812v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MA","subject":"Global Meria and Communication","institution":"Warwick University","graduated_year":2012,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}