{"first_name":"Nir","last_name":"Belzer","permalink":"nir-belzer","crunchbase_url":"http://www.crunchbase.com/person/nir-belzer","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jun 20 04:54:38 UTC 2009","updated_at":"Sat Jun 20 04:55:29 UTC 2009","overview":"<p>Mr. Nir Belzer is one of the founders and the promoter of the Millennium Funds. From 1995-1997, Mr. Belzer served as the Business Development Manager at IDBH, representing IDBH on the board of directors of six venture capital funds in which IDBH has invested. In addition, Mr. Belzer was responsible for promoting investments in start-up companies and monitoring their progress. IDBH is one of the largest Holdings companies in Israel, investing in high-tech, industry, constructive marketing, banking and financials.</p>\n\n<p>Before joining IDBH, Mr. Belzer was a consultant to start ups mainly in building the business model and go to market strategy. Mr. Belzer also served as Director of Marketing and Business Development at Globes (Israel&#8217;s leading business newspaper) Between 1989-1991. Before that, Mr. Belzer served at the Israeli Aircraft Industry as a system engineer on the Lavi aircraft project and subsequently in international marketing of the Lavi aircraft avionics systems.</p>\n\n<p>Mr. Belzer holds an MBA from the School of Business Administration at Tel-Aviv University (specializing in marketing), a Bachelor&#8217;s degree in Mathematics and Computers from Tel-Aviv University and a certificate of the Israel Engineers Association in Aviation Electronics (AVIONICS) Systems Engineering.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Senior Partner","firm":{"name":"Millennium II Materials Technology Fund","permalink":"millennium-ii-materials-technology-fund","type_of_entity":"financial_org","image":{"available_sizes":[[[150,32],"assets/images/resized/0004/9799/49799v1-max-150x150.png"],[[250,54],"assets/images/resized/0004/9799/49799v1-max-250x250.png"],[[270,59],"assets/images/resized/0004/9799/49799v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}