{"first_name":"Nishad","last_name":"Khan","permalink":"nishad-khan","crunchbase_url":"http://www.crunchbase.com/person/nishad-khan","homepage_url":"http://www.nishadkhanlaw.com","birthplace":"Orlando","twitter_username":"nishadkhanlaw","blog_url":"","blog_feed_url":"","affiliation_name":"Nishad Khan","born_year":1975,"born_month":1,"born_day":1,"tag_list":"nishad-khan, nishad-khan-law, nishad-khan-plc, nishad-khan-p-l-","alias_list":null,"created_at":"Wed Jun 16 06:29:20 UTC 2010","updated_at":"Wed Jun 16 23:17:34 UTC 2010","overview":"<p>Nishad Khan, a long time resident of Orlando,  is principal of Nishad Khan   P.L. Hispractice is concentrated in transactional, property and real estate law including the structuring of debt and equity investments, sale and acquisition of commercial and residential real estate, formation of business entities corporate governance and operation, and the negotiation and preparation of real estate and corporate agreements. Nishad also devotes a significant portion of his time to estate and business planning, wills &amp; trusts, probate, wealth preservation, and all aspects real estate title work. </p>\n\n<p>Attorney Profile : </p>\n\n<p>Before forming Nishad Khan P.L., Nishad practiced at several commercial law firms in the Orlando area. His legal experience includes a judicial externship with The Honorable A. Thomas Mihok in the Civil Division of the Ninth Judicial Circuit of Orange County, in which he gained valuable experience researching substantive and procedural issues on everything from post-conviction motions to complex litigation, and assisted the Judge with drafting memoranda of law, judicial opinions, and proposed orders. </p>\n\n<p>A University of Central Florida Graduate, Nishad received his law degree from Seton Hall University School of Law in 2003. During law school, Nishad provided indigent clients with legal representation in the areas of human rights abuse and political asylum, representing them before an immigration judge. After law school, Nishad spent a year with a New York based non-profit organization providing legal aid to victims of hate crimes and ethnic discrimination. Nishad is licensed to practice in the State of Florida, and is a member of the Florida Bar Association, The American Bar Association, and The Orange County Bar. He is fluent in Urdu and Hindi. He routinely provides pro bono representation to nonprofit organizations and low income homebuyers that are otherwise unable to afford legal services. Nishad also volunteers his time to a variety of charitable and community organizations in the Orlando area. Nishad is currently serving as President for the governing board of the Florida Literacy Coalition and secretary for the board of the Conductive Education Center of Orlando. </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0009/0793/90793v2-max-150x150.jpg"],[[167,250],"assets/images/resized/0009/0793/90793v2-max-250x250.jpg"],[[301,448],"assets/images/resized/0009/0793/90793v2-max-450x450.jpg"]],"attribution":"<p>Nishad Khan</p>"},"degrees":[{"degree_type":"B.A., Political Science","subject":"Law","institution":"University of Central Florida","graduated_year":2003,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Nishad Khan","permalink":"nishad-khan","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/nishad-khan/8/402/998","title":"Nishad Khan"},{"external_url":"http://twitter.com/nishadkhanlaw","title":"Nishad Khan"}]}