{"first_name":"Nitin","last_name":"Jaiswal","permalink":"nitin-jaiswal","crunchbase_url":"http://www.crunchbase.com/person/nitin-jaiswal","homepage_url":"http://www.getpaidstuff.com","birthplace":"Jaipur","twitter_username":"kanishkanehru","blog_url":"http://my.opera.com/greatprint/blog/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1986,"born_month":12,"born_day":8,"tag_list":"folded-business-card, color-business-cards, free-business-card-templates, business-card-design, business-cards-online, coolest-business-card","alias_list":null,"created_at":"Sat Sep 08 04:57:29 UTC 2012","updated_at":"Sun Sep 09 19:59:43 UTC 2012","overview":"<p>Business Card Printing India gives you the highest quality printed folded business cards. Superb full colour folded business card printing india is guaranteed, and comes with free design assistance if you need it. We offer the best value printed folded business cards on the internet. Our folded business card printing materials are all FSC Certified - so it is environmentally friendly folded business card printing too. We print printed folded business cards for thousands of companies, so please read our customer reviews to see what customers are saying about our printing services. Pick the Business Card that is perfect for you. Choose from a wide variety of styles, papers, and awesome options that will make your business card stand out. Don’t skimp on quality – you deserve professional business cards that you’ll be proud to hand out when you meet new people. You can count on 48HourPrint.com’s award-winning business card printing services to make your cards look great.</p>\n\n<p>All of these high-quality business cards come with free Gloss or Matte coating. Or upgrade to the ultimate glossy look with UV coating (you can almost see your reflection). Another extra you can add for a small fee: Apply classy Rounded Corners to any of the cards below and get “ahead of the curve.” Which one is perfect for you?</p>\n\n<p>Classic. This is the most popular style, available in 6 sizes, printed in vibrant color on thick, beautiful 14 point cover stock.\nEven Folded. Also called Tent or Folded, this style gives you extra space to share more information with your customers. They are scored and folded in half, and shipped flat to you.\nOffset Folded. Same as Even Folded cards but with a cool twist – the top panel is cut a bit shorter so a portion of your inside design shows. Some call this a “reveal” fold. It’s a unique touch.\nUncoated. Popular with busy doctor’s offices, hair salons and independent contractors who want a great writable surface to jot down appointment dates, reminders or other important information to help them do more business.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://my.opera.com/greatprint/blog/","title":"Business Card Printing Services India"}],"web_presences":[{"external_url":"http://www.getpaidstuff.com/","title":"Folded Business Cards"}]}