{"first_name":"Nitin","last_name":"Naresh","permalink":"nitin-naresh","crunchbase_url":"http://www.crunchbase.com/person/nitin-naresh","homepage_url":"http://www.nitinnaresh.com","birthplace":"New Delhi","twitter_username":"nitinnaresh","blog_url":"http://www.nitinnaresh.com","blog_feed_url":"","affiliation_name":"CentiPlex","born_year":1985,"born_month":4,"born_day":13,"tag_list":"","alias_list":null,"created_at":"Tue Nov 27 20:18:51 UTC 2012","updated_at":"Wed Dec 05 07:55:25 UTC 2012","overview":"<p>Corporate Sales &amp; Marketing Star turned Daring Entrepreneur, Nitin Naresh, is an inspiring and driving force for tech entrepreneurs, business owners, professionals and executives worldwide. He is a Revenue Acceleration and Digital Marketing Strategist, the Co-Founder of Creativa a Digital Marketing Company empowering entrepreneurs, startups and online business &amp; ventures globally to live and monetize their dreams, passions and expertise to soar to new heights of joy and success in marketing and business.</p>\n\n<p>Nitin guides his community members and clients towards new dimension towards online sales and marketing which they absolutely love by helping them reconnect with their dreams, passions and purpose, by embracing their gifts and talents, and by aligning their core essence with business or career activities that truly reflect their business dreams, what they love and what they do best. As a result, they not only create profitable businesses or thriving careers, they become happier and more successful as they begin to perceive their life, business or career from a highis and richis point of view. By following his programs or by implementing his strategies, many of his clients, individuals and companies, have doubled, sometimes even tripled their overall income or revenue.</p>\n\n<p>He is a sought after Speaker, Sales, Social Media, Marketing and Partnership Strategist for startups &amp; online business and a Daring Businessman. He uses all of these talents and his passion to support online business to lead hugely fulfilling lives and build successful businesses or careers doing what they love.</p>\n\n<p>Nitin is no stranger to the art and science of marketing, selling, and building effective and mutually beneficial relationships online and offline. For over 6+ years, as an award-winning sales, marketing and strategic alliance executive, working for multi-billion global industry leaders in the high-tech and consulting industries. He has been building and coaching sales and alliance teams, developing long term client relationships, forming profitable partnerships and providing solutions and successful outcomes to corporations, entrepreneurs and professionals.</p>\n\n<p>Well known for his expertise, He has personally negotiated high worth of business solutions and strategic partnerships with companies and individuals worldwide.</p>\n\n<p>He draws upon his knowledge and expertise to assist organizations and entrepreneurs exponentially grow their revenue, expand their influence and gain competitive advantage by harnessing the power of social media, education-based marketing, collaboration and strategic alliances as effective business building tools and leverage strategies to highlight their best assets and unique value, and turn prospects, connections and conversations into clients and/or partners.</p>\n\n<p>Nitin’s personal philosophy is that it is your attitude and mindset and not your aptitude that will determine your altitude and fulfillment in life. He DARES you to Turn Your Mess into Your Message, Your Fears into Fuel, Your Frustrations into Actions, Your Obstacles into Opportunities and Your Setbacks into Comebacks in order to live a limitless, daring life.</p>\n\n<p>PS. Nitin is committed to live-long learning and to sharing what He has learned with his community members, clients and partners. He has devoted years of his life, thousands of hours, and over $150,000.00 to being mentored by some of the best, most inspirational business builders and internet entrepreneurs of our times.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"CentiPlex","permalink":"centiplex","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.centiplex.com","title":"CentiPlex Global"},{"external_url":"http://www.centiplex.in","title":"CentiPlex India"},{"external_url":"http://www.centiplex.us","title":"CentiPlex United States"},{"external_url":"http://www.centiplex.co.uk","title":"CentiPlex United Kingdom"},{"external_url":"http://www.centiplex.eu","title":"CentiPlex Europe"}]}