{"first_name":"Noelle","last_name":"Heslam","permalink":"noelle-heslam","crunchbase_url":"http://www.crunchbase.com/person/noelle-heslam","homepage_url":"http://www.ukgrandsales.co.uk/","birthplace":"","twitter_username":"noellvfm","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1954,"born_month":12,"born_day":26,"tag_list":"","alias_list":null,"created_at":"Wed Apr 25 14:11:07 UTC 2012","updated_at":"Sat May 05 03:49:57 UTC 2012","overview":"<p>I run a company which owns and organises nine shopping events a year at historic venues countrywide. About 1,000 small businesses trust our expertise sufficiently to exhibit with us each year, one of the main reasons being that we are consistently  successful at attracting more than 75,000 high-quality, high-spending customers each year to our events.  Our exhibitors trust us, so much so that 90% of our new client base comes from referrals. </p>\n\n<p>We are a small company which punches above its weight because we care about detail, always try to find solutions and go the extra mile – always. You can find us at www.ukgrandsales.co.uk.</p>\n\n<p>Our customers, the majority of whom are women, come to our shows to have a great day out. They enjoy shopping for items that are not on the high street – which I take great pleasure in hunting out for them. We like our customers – they remind us of our friends. </p>\n\n<p>Communicating with people is in my blood – I was Editor of Good Housekeeping magazine in the late Eighties, after six years at Cosmopolitan and a year at The Daily Telegraph. I also created a newsletter about bargain shopping, The Good Deal Directory, which became  an annually-published book and then a website. </p>\n\n<p>I don’t believe being successful in business mean you have to be ruthless. That doesn’t  mean to say I can’t make difficult decisions. I’m famously patient and a natural lateral-thinker. I see solutions rather than problems, my glass is always half-full, I love my job and I’m very loyal. </p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0018/5983/185983v2-max-150x150.jpg"],[[165,250],"assets/images/resized/0018/5983/185983v2-max-250x250.jpg"],[[297,450],"assets/images/resized/0018/5983/185983v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}