{"first_name":"norm","last_name":"merritt","permalink":"norm-merritt","crunchbase_url":"http://www.crunchbase.com/person/norm-merritt","homepage_url":"http://iqor.com","birthplace":"Colorado","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1960,"born_month":8,"born_day":13,"tag_list":"","alias_list":null,"created_at":"Thu Oct 27 20:07:47 UTC 2011","updated_at":"Fri Jan 20 11:48:58 UTC 2012","overview":"<p>Norm is Chief Financial Officer of iQor, a 14,000 employee company, and has spent 16 years as a President/COO/General Manager/CFO of public companies, private companies, and company divisions in the media/entertainment, financial services, and technology businesses.  He has overseen, completed, and integrated several business acquisitions and turnarounds of varying sizes during his general management career.   </p>\n\n<p>As Chief Financial Officer and Chief Operating Officer of iQor, a $500M leader in the BPO space, he has helped oversee the turnaround of the firm. Performance has grown from a business losing money in 2003 to earning over $56M in EBITDA in 2010. He drove a restructuring of the cost side of the business. He was instrumental in the sale of the business to Huntsman Gay and the acquisition of RMS, the world’s largest B2B ARM company, during 2010. Most recently, Norm has overseen a capital raise process resulting in a war chest of $1B in equity and $1.1B in debt commitments. </p>\n\n<p>Prior to iQor,  Norm was President of a division of  the largest privately held mortgage bank in the US with over $12 Billion in annual loans funded, based in New York City where he tripled monthly funding volumes in less than a year to over $90M a month.  Previously, Norm served as President and Founder of an internet company, where he raised $50M in first round capital to launch a Walker Digital / Disney-sponsored website designed to monetize games of skill on the web. Prior to that, he was President of the travel company and EVP of Sales and Travel Operations for Universal Studios Florida where he grew gross revenue from $60M to $275M over a two year period.  </p>\n\n<p>Norm spent 8 years with the Walt Disney Company, including three years as head of Attractions strategic planning, where he oversaw the launch of Disney’s Animal Kingdom and various other hotels and attractions.  His stint at Disney also included the launch of Disney attractions to the travel industry where he headed the Travel Industry Marketing group and developed travel products and ticketing products that created more than $50M in annual profits. He was selected as one of the top 25 most influential executives in the travel industry by Leisure Travel News.</p>\n\n<p>Norm also served as Chief Financial Officer of publically-traded Quality Systems, Inc., a turnkey systems provider focused on the medical and dental markets. He also served as Chief Financial Officer of D.A. Porter Advertising and Marketing where he helped turn the struggling company around. </p>\n\n<p>After graduating cum laude from Brigham Young University, he worked as a Senior Accountant in the Emerging Business group at Arthur Andersen &amp; Co. in Orange County, CA where he received his CPA certificate, and later received his MBA from Harvard University.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0015/9820/159820v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0015/9820/159820v2-max-250x250.jpg"],[[299,450],"assets/images/resized/0015/9820/159820v2-max-450x450.jpg"]],"attribution":"<p>None</p>"},"degrees":[{"degree_type":"Masters","subject":"MBA","institution":"Harvard","graduated_year":1988,"graduated_month":null,"graduated_day":null},{"degree_type":"BS","subject":"Accounting","institution":"Brigham Young University","graduated_year":1984,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}