{"first_name":"Noubar","last_name":"Afeyan","permalink":"noubar-afeyan","crunchbase_url":"http://www.crunchbase.com/person/noubar-afeyan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Nov 10 16:16:13 UTC 2008","updated_at":"Tue May 26 08:40:40 UTC 2009","overview":"<p>Noubar Afeyan is Managing Partner and CEO of Flagship Ventures, a firm he co-founded in 2000. He is also a Senior Lecturer at MIT in both the Sloan School of Management and the Biological Engineering Department. Dr. Afeyan has authored numerous scientific publications and patents since earning his Ph.D. in Biochemical Engineering from MIT in 1987.</p>\n\n<p>A technologist, entrepreneur and venture capitalist, Dr. Afeyan has co-founded and helped build over 20 successful life science and technology startups during the past two decades. He was founder and CEO of PerSeptive Biosystems (Nasdaq: PBIO), a leader in the bio-instrumentation field. After PerSeptive&#8217;s acquisition by Applera Corporation (NYSE: ABI), he was Senior Vice President and Chief Business Officer of Applera, where he initiated and oversaw the creation of Celera Genomics (Nasdaq: CRA).</p>\n\n<p>Currently Dr. Afeyan serves on a number of public and private company boards. He is a director and co-founder of Flagship portfolio companies Affinnova, BG Medicine, Ensemble Discovery, Genstruct, Helicos BioSciences (NASDAQ:HLCS), Joule Biotechnologies and LS9. Previously he was a member of the founding team, director and investor in several successful ventures including Chemgenics Pharmaceuticals, Color Kinetics, Antigenics, EXACT Sciences and Adnexus Therapeutics.</p>\n\n<p>Dr. Afeyan is a member of the Board of Overseers of Boston University, the Board of Visitors of Boston University School of Medicine, and the Board of Overseers of the Boston Symphony Orchestra. In addition, he is a member of several advisory boards including the Whitehead Institute at MIT, the Harvard-MIT Division of Health Sciences and Technology (HST) and the SKOLKOVO School of Management in Moscow. Dr. Afeyan is also co-founder and board member of Armenia 2020 and the National Competitiveness Foundation of Armenia, two international economic development projects focusing on the former Soviet Republic of Armenia. In 2008 he received an Ellis Island Medal of Honor, an award granted to outstanding Americans who have distinguished themselves as U.S. citizens and who have enabled their ancestry groups to maintain their identities while becoming integral parts of American life. </p>","image":{"available_sizes":[[[103,150],"assets/images/resized/0004/5472/45472v1-max-150x150.jpg"],[[160,232],"assets/images/resized/0004/5472/45472v1-max-250x250.jpg"],[[160,232],"assets/images/resized/0004/5472/45472v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Partner and CEO","firm":{"name":"Flagship Ventures","permalink":"flagship-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,79],"assets/images/resized/0002/8188/28188v1-max-150x150.jpg"],[[250,131],"assets/images/resized/0002/8188/28188v1-max-250x250.jpg"],[[450,237],"assets/images/resized/0002/8188/28188v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Member, Board of Directors","firm":{"name":"Affinnova","permalink":"affinnova","type_of_entity":"company","image":{"available_sizes":[[[150,54],"assets/images/resized/0017/5404/175404v2-max-150x150.jpg"],[[250,90],"assets/images/resized/0017/5404/175404v2-max-250x250.jpg"],[[396,144],"assets/images/resized/0017/5404/175404v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}