{"first_name":"Noushin","last_name":"Dunkelman","permalink":"noushin-dunkelman","crunchbase_url":"http://www.crunchbase.com/person/noushin-dunkelman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 08 09:49:08 UTC 2009","updated_at":"Mon Jun 08 09:50:47 UTC 2009","overview":"<p>Ms. Dunkelman joined EyeCyte with over 18 years experience in research, bio-process engineering and product development of cell-based therapies. She has held several management positions including Senior Director, Cell Process Development at MicroIslet Inc., where she led a team of scientists and engineers in the development of porcine islet isolation and encapsulation for treatment of type I diabetes. As the Senior Director, Process Development at Telos Pharmaceuticals her group was responsible for developing culture processes to manufacture fusion proteins using stable expression systems. At ValeocyTe Therapies as the Senior Director, Process Development she led a multidisciplinary team in the development of activated Th1 cells for treatment of renal cell carcinoma. At MorphoGen Pharmaceuticals, she was the Director of Product and Process Development where she managed the development for pluripotent stem cells for treatment of diabetes, skeletal, neurodegenerative diseases. She was a Research Scientist at Advanced Tissue Sciences, where she was the project leader responsible for bioreactor design from R&amp;D concept to pre-clinical stage for cartilage product. She led the design and development of a bioreactor system for vascular graft production.</p>","image":{"available_sizes":[[[150,137],"assets/images/resized/0004/7330/47330v1-max-150x150.jpg"],[[218,200],"assets/images/resized/0004/7330/47330v1-max-250x250.jpg"],[[218,200],"assets/images/resized/0004/7330/47330v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Vice President, Process Development ","firm":{"name":"EyeCyte","permalink":"eyecyte","type_of_entity":"company","image":{"available_sizes":[[[150,80],"assets/images/resized/0004/7328/47328v1-max-150x150.jpg"],[[250,133],"assets/images/resized/0004/7328/47328v1-max-250x250.jpg"],[[254,136],"assets/images/resized/0004/7328/47328v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}