{"first_name":"Noyda","last_name":"Matos","permalink":"noyda-matos","crunchbase_url":"http://www.crunchbase.com/person/noyda-matos","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"MyStrands","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jun 17 08:20:43 UTC 2007","updated_at":"Mon May 26 19:57:56 UTC 2008","overview":"<p>Noyda Matos has an M.S. in Computer Science from Havana University, Cuba. Former Chief Information Officer for iSOCO, Noyda has a proven and extensive professional experience managing the design, development, and deployment of mission-critical applications and intelligent systems.</p>\n\n<p>Noyda holds a five-year degree in Computer Science from Havana University , Cuba . In 1995 she received a fellowship from the Iberoamerican Institute - the Spanish International Agency for Cooperation - and initiated her Ph.D. thesis at the Technical University of Barcelona. She was a Ph.D student at the Artificial Intelligence Research Institute (IIIA) of the Spanish Council for Scientific Research until 1998. Her research focused on automated agent negotiation and she published a number of articles in top artificial intelligence conferences.</p>\n\n<p>In 1998 and 1999 Noyda was a research scientist at the Carlos III University in Madrid where she developed intelligent techniques for the SHAMASH project: Standards and Hierarchical Activities Modeling, Automatic Simulation and Heuristic Optimization.</p>\n\n<p>In 1999, Noyda co-founded iSOCO (Intelligent Sotfware Components, SA) a Spanish company that applies Internet efficiencies to mission-critical applications. In iSOCO Noyda worked on the development of a real-time personalization tool for a large blue-chip company, on the development of e-stores for major retailers (e.g., Fnac, Lavinia), and in iSOCO&#8217;s Innovation Lab. In 2001 she became Chief Information Officer (CIO) and was responsible for effectively managing the development and deployment of iSOCO&#8217;s data warehouse. She left iSOCO in 2004 to lead the development of StrandsTM in Spain .</p>\n\n<p>In 2003, Noyda co-founded Sequel R&amp;D, SL a company that specializes in bringing artificial intelligence technologies to digital markets. Sequel R&amp;D, SL has led the seed investment round of Strands.</p>","image":{"available_sizes":[[[49,66],"assets/images/resized/0001/9396/19396v1-max-150x150.png"],[[49,66],"assets/images/resized/0001/9396/19396v1-max-250x250.png"],[[49,66],"assets/images/resized/0001/9396/19396v1-max-450x450.png"]],"attribution":"<p><a href=\"http://www.strands.com/corp/team.vm\" title=\"Strands\" rel=\"nofollow\">Strands</a></p>"},"degrees":[],"relationships":[{"is_past":true,"title":"VP, Software Development","firm":{"name":"Strands Labs","permalink":"strands","type_of_entity":"company","image":{"available_sizes":[[[150,22],"assets/images/resized/0000/4489/4489v2-max-150x150.png"],[[217,33],"assets/images/resized/0000/4489/4489v2-max-250x250.png"],[[217,33],"assets/images/resized/0000/4489/4489v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}