{"first_name":"Oded","last_name":"Berkowitz","permalink":"oded-berkowitz","crunchbase_url":"http://www.crunchbase.com/person/oded-berkowitz","homepage_url":"http://www.clipix.com","birthplace":"","twitter_username":"OdedBerkowitz","blog_url":"","blog_feed_url":"","affiliation_name":"Clipix","born_year":null,"born_month":null,"born_day":null,"tag_list":"ceo, founder, startup, clipix, myregistry-com","alias_list":"","created_at":"Thu Jun 28 13:23:24 UTC 2012","updated_at":"Tue Aug 21 17:25:07 UTC 2012","overview":"<p>Oded Berkowitz is the Founder and CEO of Clipix.com, an online organizational tool launched in February 2012.  Oded created Clipix out of a personal need for a tool that would allow him and others to save and share links, documents, photos and video with one click, and provide a visual and organized environment for all of the things we all see online, and want to come back to.  He is responsible for the conceptualization and direction of Clipix, specifically in indentifying the company’s positioning in the marketplace, both domestically and internationally. Oded believes that the platform’s user experience and unique features will provide users with the tools needed to easily manage and organize their busy online lives, and thus make Clipix a dominant player in this space.</p>\n\n<p>In December 2005, Oded launched MyRegistry.com, a leading Universal Gift Registry, of which he is currently CEO.  He has since been responsible for the company’s growth, business direction and corporate partnerships.  In the past several years, Oded successfully identified and executed key long term, exclusive and strategic partnership agreements with a multitude of major corporate and media conglomerates, such as NBC Universal, Network Solutions, Condé Nast and others.  Such partnerships anchored MyRegistry.com’s credibility and leadership position in the Universal Gift Registry Industry, and created new revenue models for the company’s short and long term growth strategies. </p>\n\n<p>Prior to founding MyRegistry.com, Oded spent over twelve years on Wall Street, including six years as a co-Founder and a Senior Partner at Trade.com Global Markets, Inc./BlueStone Capital Partners, LP, a 500 employee full service investment and merchant banking and on-line brokerage firm.  At Trade.com, together with his partners, he pioneered the online trading industry.  In addition, Oded has extensive experience in guiding and assisting CEOs of private and public companies in developing their businesses, increase market share and revenue for their companies. While at Trade.com, Oded was President of Global Partnerships and was responsible for the firm’s efforts in creating international strategic partnerships and joint ventures. He was responsible for initiating, structuring and negotiating the firm’s worldwide licensing agreement with ABN Amro Bank and their investment of $62.5 million in Trade.com.  Oded was also responsible for the creation and growth of the firm’s international sales division, which resulted in relationships with over 240 institutional accounts in 15 countries. He has planned, coordinated and executed over 200 public and private offerings for emerging growth companies.</p>\n\n<p>Oded spent three years in active combat duty in the military and graduated with a Third Officer degree from Acco Nautical College.</p>","image":{"available_sizes":[[[150,149],"assets/images/resized/0020/4940/204940v2-max-150x150.jpg"],[[250,249],"assets/images/resized/0020/4940/204940v2-max-250x250.jpg"],[[450,449],"assets/images/resized/0020/4940/204940v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}