{"first_name":"Odysseas","last_name":"Papadimitriou","permalink":"odysseas-papadimitriou","crunchbase_url":"http://www.crunchbase.com/person/odysseas-papadimitriou","homepage_url":"","birthplace":"Athens, Greece","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"odysseas, odysseas-papadimitriou, card-hub, cardhub, evolution-finance, ceo, papadimitriou","alias_list":null,"created_at":"Thu Mar 25 21:53:33 UTC 2010","updated_at":"Fri Mar 26 03:54:45 UTC 2010","overview":"<p>Odysseas Papadimitriou has more than ten years of experience in consumer lending and direct marketing. Prior to becoming the CEO of Evolution Finance (parent company of CardHub.com), he worked at Capital One for nearly eight years. During this time, Mr. Papadimitriou held various positions of increasing responsibility in areas including marketing strategy, new business development, new product development, credit risk management, and customer retention.</p>\n\n<p>As senior marketing director for Capital One, Mr. Papadimitriou headed all indirect marketing for the corporation&#8217;s credit-card division. His many accomplishments include building from the ground up a large indirect credit-card business, managing a $550 million P&amp;L, and spearheading the largest customer giveback in the history of Capital One.</p>\n\n<p>Mr. Papadimitriou believes that consumers are entitled to the constant assurance that they are using the correct financial products to fit their ever-changing needs; he also believes this assurance is not currently delivered within the industry. In response to these beliefs, Mr. Papadimitriou founded Evolution Finance in 2008. Evolution Finance combines the power of the marketplace, consumer education, data, and technology to constantly bring the right financial services to consumers.</p>\n\n<p>Odysseas Papadimitriou is widely recognized as an industry expert in personal finance and his views are regularly mentioned in leading publications, including The New York Times, The Wall Street Journal, the Associated Press, and TheStreet.com.</p>\n\n<p>Mr. Papadimitriou graduated Magna Cum Laude and received Honors for his Senior Thesis while obtaining a double major - a B.A. in Economics and a B.Sc. in Civil Engineering - from Brown University in Rhode Island. He holds an MBA from the Fuqua School of Business at Duke University. Mr. Papadimitriou is also a member of Phi Beta Kappa and Sigma Xi.</p>","image":{"available_sizes":[[[114,150],"assets/images/resized/0008/1831/81831v2-max-150x150.jpg"],[[126,165],"assets/images/resized/0008/1831/81831v2-max-250x250.jpg"],[[126,165],"assets/images/resized/0008/1831/81831v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.S.","subject":"Civil Engineering","institution":"Brown University","graduated_year":2000,"graduated_month":null,"graduated_day":null},{"degree_type":"B.A.","subject":"Economics","institution":"Brown University","graduated_year":2000,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"Business","institution":"Duke University","graduated_year":2005,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Card Hub","permalink":"card-hub","type_of_entity":"company","image":{"available_sizes":[[[150,33],"assets/images/resized/0008/1814/81814v2-max-150x150.png"],[[250,55],"assets/images/resized/0008/1814/81814v2-max-250x250.png"],[[284,63],"assets/images/resized/0008/1814/81814v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/odysseas","title":"Odysseas LinkedIn Profile"}]}