{"first_name":"Ofer","last_name":"Gneezy","permalink":"ofer-gneezy-2","crunchbase_url":"http://www.crunchbase.com/person/ofer-gneezy-2","homepage_url":"","birthplace":"Israel","twitter_username":"ogneezy","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Mar 26 20:16:35 UTC 2010","updated_at":"Wed Aug 11 18:28:20 UTC 2010","overview":"<p>Entrepreneur and executive.  Technology veteran.  Co-founder and CEO Rgog Games.  Co-founder of iBasis (Nasdaq:IBAS) sold to Royal KPN in December 2009.</p>\n\n<p>Ofer Gneezy co-founder and CEO Rgog Games.</p>\n\n<p>Ofer Gneezy former Chairman, President and Chief Executive Officer of iBasis (Nasdaq:IBAS), a leader in international long distance, VoIP, and prepaid calling cards. As co-founder of iBasis in 1996, Ofer is one of the true visionaries of the IP telephony industry and a recipient of Pulver.com&#8217;s Industry Pioneer Award. He was named Best Business Leader for 2007 in the annual Capacity Magazine Awards. Ofer was an early believer in the power of the Internet to change global telecommunications and quickly established iBasis as the first provider of toll-quality Voice-over-IP (VoIP) service. In 2009 Ofer sold iBasis, which by then achieved annual revenue of $1 billion and was one of the largest carriers of international voice traffic worldwide, to Royal KPN, the incumbent carrier of The Netherlands.  </p>\n\n<p>Prior to founding iBasis, Ofer was president of Acuity Imaging, Inc., (Nasdaq:ACUT) a successor to Automatix, Inc. (Nasdaq:AITX) where he was President and CEO, a multinational leader in robotics and imaging.  Ofer was a director of NMS Communications (Nasdaq: NMSS) and Vice Chair of The Massachusetts Network Communications Council.  He is a member of the Board of Trustees of the Massachusetts Technology Leadership Council.  </p>\n\n<p>Ofer is a graduate of the Advanced Management Program at Harvard University&#8217;s Graduate School of Business Administration and has an M.S. in engineering from M.I.T and a BSc in Engineering from Tel Aviv University.</p>","image":{"available_sizes":[[[123,150],"assets/images/resized/0009/7104/97104v2-max-150x150.jpg"],[[205,250],"assets/images/resized/0009/7104/97104v2-max-250x250.jpg"],[[370,450],"assets/images/resized/0009/7104/97104v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"SM","subject":"Engineering","institution":"MIT","graduated_year":1979,"graduated_month":null,"graduated_day":null},{"degree_type":"AMP","subject":"","institution":"Harvard Business School","graduated_year":1996,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}