{"first_name":"Oleg","last_name":"Jelezko","permalink":"oleg-jelezko","crunchbase_url":"http://www.crunchbase.com/person/oleg-jelezko","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 13 03:41:00 UTC 2009","updated_at":"Thu May 21 07:29:43 UTC 2009","overview":"<p>Responsible for the investment strategy and all aspects of operations of the Da Vinci Capital Group Ltd companies. Oleg has 16 years of investment management, banking and management consulting experience in the UK, Russia and other emerging markets. Prior to Da Vinci Capital, Oleg was a Managing Director at Renaissance Capital, Moscow, Head of Equity Structured Products Group, where he built a leading alternative investment franchise in CIS markets with 40 people in several teams, significant AUM, above-market returns and 30 funds and investment products. Prior to Renaissance, Oleg was a Director in Emerging Markets Equities Sales and Trading in Credit Suisse First Boston in London. From 1992 to 1998, Oleg worked as a consultant in Andersen Consulting and McKinsey &amp; Co in the UK, the Czech Republic and Russia. Oleg’s experience includes investment management, structuring, principal investment and M&amp;A deals in Russia, Europe and South Africa, private equity activities, development of equity-linked products, corporate strategy and operational management.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing Partner, Chief Executive Officer","firm":{"name":"Da Vinci Capital Management","permalink":"da-vinci-capital-management-ltd","type_of_entity":"financial_org","image":{"available_sizes":[[[150,57],"assets/images/resized/0004/3876/43876v1-max-150x150.jpg"],[[216,83],"assets/images/resized/0004/3876/43876v1-max-250x250.jpg"],[[216,83],"assets/images/resized/0004/3876/43876v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}