{"first_name":"Olivia","last_name":"Dillan","permalink":"olivia-dillan","crunchbase_url":"http://www.crunchbase.com/person/olivia-dillan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"AtHoc","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jun 09 22:42:46 UTC 2008","updated_at":"Fri Jul 11 22:43:13 UTC 2008","overview":"<p>Olivia Dillan is responsible for all aspects of AtHoc’s engineering and product development. Olivia has been responsible for many successful, award-winning products in the areas of security, e-commerce, application servers, database management systems, application development tools, and new media tools and applications. Prior to AtHoc, she served as group vice president of technology and services of PGP Corporation, where she was responsible for delivering PGP&#8217;s award winning products, as well as technical support. Olivia remains an active member of PGP’s technical advisory board. </p>\n\n<p>Prior to PGP, she held senior executive positions, including: vice president of engineering at ServGate, co-founder and COO at Model N, vice president of engineering at the NetDynamics business unit of Sun Microsystems, vice president of the new media tools &amp; applications division at Oracle, vice president of product development at PGP Inc., and vice president of core product development at ASK/Ingres (now Computer Associates). Olivia graduated summa cum laude with a Bachelor of Arts in Computer Science from Hunter College in New York.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP, Engineering","firm":{"name":"AtHoc","permalink":"athoc","type_of_entity":"company","image":{"available_sizes":[[[127,55],"assets/images/resized/0001/9103/19103v2-max-150x150.png"],[[127,55],"assets/images/resized/0001/9103/19103v2-max-250x250.png"],[[127,55],"assets/images/resized/0001/9103/19103v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}