{"first_name":"Olivier","last_name":"Carron de la Carriere","permalink":"olivier-carron-de-la-carriere","crunchbase_url":"http://www.crunchbase.com/person/olivier-carron-de-la-carriere","homepage_url":"","birthplace":"","twitter_username":"oliviercarron","blog_url":"","blog_feed_url":"","affiliation_name":"Imagiin.","born_year":null,"born_month":null,"born_day":null,"tag_list":"social-media-advertising-online-mobile-saas-cloud-computing","alias_list":null,"created_at":"Mon Dec 01 15:13:58 UTC 2008","updated_at":"Mon Jul 16 09:59:25 UTC 2012","overview":"<p>Olivier Carron de la Carriere started his career with Digital (DEC) in 1978 as a Sales representative. At the age of 28, he was promoted Regional director for the western part of Dec in France then Regional director for Africa where he was responsible for Dec’s expansion in all sub-Saharan Africa. In 1989, he joined Oracle to pioneer Oracle presence in the financial institutions firstly in France then to the European level. In 1991 he joined Gupta Technologies to make the start-up from scratch of this leading Client Server software Company in Southern Europe. (France, Spain and Portugal, North Africa). Early 1994 he moved to California to become the President and COO of Alcatel TITN, a software Company responsible for the development of the X25 stack sold to the biggest names of the Software industry. Back in France midst of 1995, he took over the responsibility of the development of the X400 MTA mail server for Alcatel and kept the X25 and Network Testing tools business lines. In 1997 he joined Bull as VP in charge of all Storage and Data warehouse effort. In 1999 he moved to London to start all International operations for Keynote Systems, The Internet Performance Authority. More recently, he was appointed, by the Supervisory Board of Hermes SoftLab, led by Nomura Securities and EBRD (European Bank for Reconstruction and Development), President and CEO, based in Ljubljana, Slovenia. He had to implement a massive change management effort in order to turn-around the Company facing a massive monthly burn-rate back to a profit and growth. Back in France in July 2004, he founded Imagiin.com, a new Social Media Advertising Company offering the first Advertising on-demand platform on Mobile and Internet; Market acceptance was great but funding was a major issue. \nToday he runs a Consulting boutique where he advised some start-up and Internet Companies (including Yahoo!, Lohika&#8230;). The first goal for these companies is to expand in the EMEA region through indirect channels or establishing an ODC in central or Eastern Europe. (Off-shore development center).</p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0008/2983/82983v6-max-150x150.jpg"],[[250,166],"assets/images/resized/0008/2983/82983v6-max-250x250.jpg"],[[450,298],"assets/images/resized/0008/2983/82983v6-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"","subject":"YMP","institution":"INSEAD ","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"","firm":{"name":"Imagiin.","permalink":"imagiin","type_of_entity":"company","image":{"available_sizes":[[[150,71],"assets/images/resized/0003/0495/30495v5-max-150x150.png"],[[221,106],"assets/images/resized/0003/0495/30495v5-max-250x250.png"],[[221,106],"assets/images/resized/0003/0495/30495v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/dir/?first=olivier&last=carron","title":""}]}