{"first_name":"Oliver","last_name":"Bigler","permalink":"oliver-bigler","crunchbase_url":"http://www.crunchbase.com/person/oliver-bigler","homepage_url":"http://www.marketecture.com","birthplace":"Powell, WY, USA","twitter_username":"oliverbigler","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1973,"born_month":2,"born_day":22,"tag_list":"oliver-bigler, marketecture, small-business-software, utah-startup, entrepreneur","alias_list":null,"created_at":"Thu Sep 06 03:06:04 UTC 2012","updated_at":"Sun Sep 09 19:22:38 UTC 2012","overview":"<p>Oliver Bigler is a serial entrepreneur and the founder and CEO of Marketecture, Inc., a Orem, UT based internet software technology startup launched in 2010.  He graduated from Brigham Young University in International Trade and Finance, magna cum laude, in 1998 and launched his first startup while a student at BYU, the first nationwide home security sales company that leveraged the door-to-door sales model prevalent at the university.  Oliver then went on to work in industry before continuing his entrepreneurial career, cutting his teeth at American Express WorldWide Marketing and Monitor Group strategy management consulting firm in Cambridge, MA. before returning to entrepreunership back in Utah.</p>\n\n<p>MARKETECTURE\nOliver Bigler is the founder of Marketecture, Inc., whose stated goal is to build a single-point software solution that provides all of the tech a small business owners needs to run a successful online business campaign.   The spark for this idea comes from Oliver&#8217;s 12 years of experience dealing with small business owners who regularly expressed their frustration over not knowing which different softwares to buy and then how to cobble those different pieces together to make them work.  This would lead to the failure, online, of most small business who quickly became frustrated with the lack of results from their attempts.</p>\n\n<p>Oliver saw that as a software problem, this could be easily solved if a company was willing to put in the work to build an complete system, pre-integrate all the pieces and then provide a high-tech solution that fit a low-tech customer base.</p>","image":{"available_sizes":[[[131,150],"assets/images/resized/0020/9974/209974v2-max-150x150.jpg"],[[219,250],"assets/images/resized/0020/9974/209974v2-max-250x250.jpg"],[[288,328],"assets/images/resized/0020/9974/209974v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}