{"first_name":"Oliver","last_name":"Muoto","permalink":"oliver-muoto","crunchbase_url":"http://www.crunchbase.com/person/oliver-muoto","homepage_url":"http://www.muoto.com","birthplace":"Poznan, Poland","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"vFlyer","born_year":1969,"born_month":6,"born_day":29,"tag_list":"","alias_list":null,"created_at":"Tue May 13 22:48:58 UTC 2008","updated_at":"Mon Jun 02 23:34:57 UTC 2008","overview":"<p>Oliver Muoto was most recently co-founder and VP of Market Development at Epicentric, the leading provider of Business Portal solutions for Global 2000 companies to deliver integrated Web services to their customers, partners and employees. As the original VP of Marketing, Mr. Muoto was responsible for the successful launch of the company. Founded in 1998, Epicentric had over 300 employees and 350 Global 2000 customers before it was acquired by Vignette (VIGN), the industry leader in enterprise content management, in December 2002.  </p>\n\n<p>Prior to founding Epicentric, Mr. Muoto held various senior marketing and product management positions and played a critical role in the successes of five startups. At TouchWave, Mr. Muoto was responsible for the launch of the first Web-based Voice Over IP phone appliance, the WebSwitch. TouchWave was later acquired by Ericsson (ERICY). As co-founder of RandomNoise, Mr. Muoto launched Coda, the industry’s first all-Java Web Site builder, which went on to win several industry awards before it too was acquired by Vignette (VIGN).</p>\n\n<p>Mr. Muoto has been featured or quoted in numerous industry trade journals and national newspapers including the Wall Street Journal, Fortune, CNN, Fast Company, Wired Magazine and the San Jose Mercury. He is a frequent speaker at industry-wide conferences on enterprise software and Web Services. He is also an inventor of one of the first U.S. Patents (6,327,628) awarded to an enterprise portal software company, covering the administration of user privileges in portal frameworks, and has other patents pending in the areas of location-based services and RFID. Mr. Muoto serves on the advisory boards and board of directors of several early stage startups primarily focused on Internet, enterprise and infrastructure software. Mr. Muoto was also a venture partner with Outlook Ventures, and is a limited partner at Pulse Ventures.</p>\n\n<p>Mr. Muoto is also a member of the City of San Carlos&#8217; Economic Development Advisory Commission (EDAC) and is actively involved in a number of non-profit organizations.</p>\n\n<p>Mr. Muoto earned a Bachelor of Science degree Cum Laude in Industrial and System Engineering as well as a Minor in Marketing from the University of Southern California in Los Angeles, CA.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder","firm":{"name":"vFlyer","permalink":"vflyer","type_of_entity":"company","image":{"available_sizes":[[[150,54],"assets/images/resized/0001/8511/18511v3-max-150x150.jpg"],[[250,90],"assets/images/resized/0001/8511/18511v3-max-250x250.jpg"],[[450,163],"assets/images/resized/0001/8511/18511v3-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Co-Founder","firm":{"name":"Epicentric","permalink":"epicentric","type_of_entity":"company","image":null}},{"is_past":true,"title":"VP Products","firm":{"name":"Social Project","permalink":"social-project","type_of_entity":"company","image":{"available_sizes":[[[150,56],"assets/images/resized/0000/0838/838v1-max-150x150.png"],[[200,75],"assets/images/resized/0000/0838/838v1-max-250x250.png"],[[200,75],"assets/images/resized/0000/0838/838v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}