{"first_name":"Oliver","last_name":"Shaw","permalink":"oliver-shaw","crunchbase_url":"http://www.crunchbase.com/person/oliver-shaw","homepage_url":"http://uk.linkedin.com/in/olivershaw","birthplace":"Sheffield","twitter_username":"shaw286","blog_url":"","blog_feed_url":"","affiliation_name":"STN Ltd","born_year":1981,"born_month":12,"born_day":30,"tag_list":"cloud, software, it, business-development, entrepreneur, erp, crm, mobile","alias_list":null,"created_at":"Wed Aug 10 18:22:06 UTC 2011","updated_at":"Sun Oct 30 16:13:53 UTC 2011","overview":"<p>I specialise in Mobile, Cloud and Business Software application strategy and development. My focus is on creating commercially led ground-breaking software products that provide a fantastic end-user experience on a range of platforms and devices. </p>\n\n<p>I am a highly motivated and analytical perfectionist who relishes new challenges and possess the ability to overcome them on time and within budget. I pride myself on being able to motivate and guide others to create great software solutions. I always take full responsibility for my actions and lead from the front utilising hard work, integrity, trust, realism, commitment, communication and innovation to achieve great results.</p>\n\n<p>I have worked on every aspect of a software project from build to market, managed a software development team, a commercial team and sold both direct and to VAR&#8217;s. The knowledge and experience gained from these experiences enables me to design, create and market innovative and customer led software with strong commercials.</p>\n\n<p>I believe my greatest assets to be my drive, enthusiasm and determination. I am a natural completer finisher and this has been shown time and time again through the mature software solutions I have been responsible for.</p>\n\n<p>&#8220;The commercial end user benefits that can be derived from exposing business applications to a mobile cloud environment are staggering and we pride ourselves on creating solutions that achieve this.&#8221;</p>\n\n<p>Managing Director\nSTN Ltd</p>\n\n<p>STN’s primary function is to extend business and accounting applications into the mobile space, more specifically in the areas of Service Management, EPOS, POD and Health and Safety.</p>\n\n<p>The company’s responsible for one of the world’s first high capacity mobile data solutions. Utilising this it puts Sage in the hands of mobile users for the first time.</p>\n\n<p>Our solutions link directly into number of world class ERP and CRM packages, sold through a network of VAR&#8217;s across the UK and received a number of prestigious industry awards.</p>\n\n<p>Development Director\nSTN Ltd</p>\n\n<p>Building a development team and software that would be the foundation for STN&#8217;s product range. This invloved running a unique team of highly qualified software developers to create a pioneering mobile business application platform.</p>\n\n<p>Developer\nNTP/ Carter and Carter PLC</p>\n\n<p>My working life began as a developer at Carter and Carter PLC in 2003. I was responsible for the UK modern apprenticeship directory, a SCORM compliant LMS for the likes of American Express and ‘at the time’ a cutting edge mobile assessment application for the health sector.\nEducation</p>\n\n<p>The University of Huddersfield\nBSc (1:1), Computer Science\n2000 – 2004</p>\n\n<p>see http://www2.hud.ac.uk/alumni/documents/magazine/encore_13_magazine.pdf</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0014/8825/148825v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0014/8825/148825v2-max-250x250.jpg"],[[450,450],"assets/images/resized/0014/8825/148825v2-max-450x450.jpg"]],"attribution":"<p>Oliver Shaw / <a href=\"http://uk.linkedin.com/in/olivershaw\" title=\"Oliver Shaw\" rel=\"nofollow\">Oliver Shaw</a></p>"},"degrees":[{"degree_type":"1st BSc","subject":"Computer Science","institution":"University of Huddersfield","graduated_year":2004,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Technical Director","firm":{"name":"STN Ltd","permalink":"stn-ltd","type_of_entity":"company","image":null}},{"is_past":true,"title":"Business Development","firm":{"name":"MindYourService.com","permalink":"mindyourservice-com","type_of_entity":"company","image":null}},{"is_past":true,"title":"Managing Director","firm":{"name":"STN","permalink":"stn","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www2.hud.ac.uk/alumni/documents/magazine/encore_13_magazine.pdf","title":"Alumni"}],"web_presences":[{"external_url":"http://uk.linkedin.com/in/olivershaw","title":"LinkedIn"}]}