{"first_name":"Olli-Pekka","last_name":"Kallasvuo","permalink":"olli-pekka-kallasvuo","crunchbase_url":"http://www.crunchbase.com/person/olli-pekka-kallasvuo","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon May 26 23:32:31 UTC 2008","updated_at":"Sat Jun 27 19:12:24 UTC 2009","overview":"<p>Olli-Pekka Kallasvuo is the President and Chief Executive Officer of Nokia as of June 1, 2006.</p>\n\n<p>Olli-Pekka joined Nokia in 1980 as Corporate Counsel, and has held roles of increasing responsibility since that time. In 1987 he was appointed Assistant Vice President, Legal Department, and in 1988 he was named Assistant Vice President, Finance. In 1990 he was promoted to Senior Vice President, Finance.</p>\n\n<p>In 1992, Olli-Pekka was named Executive Vice President and Chief Financial Officer. In 1997-1998 he served as Corporate Executive Vice President, Nokia Americas, being responsible for all Nokia’s business operations in the Americas. He returned to the position of Chief Financial Officer at the beginning of 1999, the position he had held prior to moving to the United States. From 2004-2005 Kallasvuo was Executive Vice President and General Manager of Mobile Phones. On October 1, 2005 he was named President and COO before his appointment to the current position.</p>\n\n<p>Olli-Pekka has been a member of the Group Executive Board of Nokia since 1990. On April 1, 2007, Olli-Pekka was appointed Chairman of the Board of Nokia Siemens Networks. In May 2007, Mr. Kallasvuo was nominated as member of the Board of Directors at Nokia. Starting January 2009, he will also serve as a Member of the Board of the Confederation of Finnish Industries EK.</p>\n\n<p>He holds a master’s degree in law from the University of Helsinki. Prior to joining Nokia, Olli-Pekka held a variety of positions with the Union Bank of Finland.</p>\n\n<p>Olli-Pekka was born on July 13, 1953, in Lavia, Finland. In his spare time, he enjoys golf, tennis and reading about political history.</p>\n\n<p><a href=\"http://www.nokia.com\" title=\"Source: Nokia\" rel=\"nofollow\">Source: Nokia</a></p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"President and CEO","firm":{"name":"Nokia","permalink":"nokia","type_of_entity":"company","image":{"available_sizes":[[[120,50],"assets/images/resized/0001/7958/17958v3-max-150x150.png"],[[120,50],"assets/images/resized/0001/7958/17958v3-max-250x250.png"],[[120,50],"assets/images/resized/0001/7958/17958v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}