{"first_name":"Omari","last_name":"Bowers","permalink":"omari-bowers-2","crunchbase_url":"http://www.crunchbase.com/person/omari-bowers-2","homepage_url":"http://www.omaribowers.co.uk","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Global Forestry Investments","born_year":null,"born_month":null,"born_day":null,"tag_list":"omari-bowers, businessman, global-forestry-investments, gfi, co-founder, founding-partner, forestry-management, brazil","alias_list":null,"created_at":"Mon Jul 23 07:53:37 UTC 2012","updated_at":"Wed Jul 25 06:20:25 UTC 2012","overview":"<p>Omari Bowers is one of the founding partners of Global Forestry Investments, a company which lets individuals diversify their investment portfolios with the addition of plots of teak wood trees grown in Brazil.  Investors receive dividends every three years when the tress are thinned, and then reap a profit of approximately ten percent once the trees mature.</p>\n\n<p>Bowers along with business partner Andrew Skeene, established the company in 2008, after several months of thorough research. Even now, he continues to keep in touch with global forestry trends and developments in agricultural product markets. He is personally involved in many aspects of the business, including determining   the firm’s strategic direction and investment strategies. Bowers also manages business development and research and client services. He is also involved in identifying new investment prospects and providing technical and analytical support in the assessment of reporting processes and due diligence.</p>\n\n<p>In 2009, Bowers also took on the position of Director of Mãos Seguras, an agriculture and forestry management company in Brazil. In this position, Bowers may be called on to attend meetings of professional bodies or he may find himself liaising with architects, archeologists, biologists, engineers and others. He reports directly to clients, updating them with regard to their timber portfolios and meets with community leaders and charitable organizations regarding the company’s philanthropic efforts. In short, Bowers has a hand in practically every aspect of the company’s activities, which include forest management, planning and controlling budgets and financial forecasts, expansion of woodland coverage, restoration of ancient woodland in Brazil and much more. Bowers heads a professional team of forestry engineers and, when necessary, negotiates with and supervises forest workers, contractors and subcontractors.</p>\n\n<p>Keeping busy and making money for himself and his clients was not enough for Bowers. He was struck by the overwhelming poverty found in Brazil, and decided to do something about it by pledging ten percent of Global Forestry Investment profits to developing community projects. The company has already begun donating money towards sports, education and cultural projects.\nOmari Bowers grew up in England and attended Northbrook Church of England School in Lee Haberdasher’s Ake’s in New Cross, and then the University of North London. Upon completion of his studies, he worked in several financial institutions, including JP Morgan. Concurrently, Bowers purchased his first investment property, which he promptly renovated and then sold for a profit. The success of this first experiment in real estate led to further real estate investments. Eventually, Bowers broke away from the world of 9 to 5 and opened his own property management company.</p>\n\n<p>Bowers met future business partner Andrew Skeene around the same time that he went out on his own. Skeene also has his own real estate investment firm. When the real estate market began to crumble, the two decided to examine alternative investment opportunities. They spent about six months researching emerging markets around the globe before deciding on trying their hand in South America.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder","firm":{"name":"Global Forestry Investments","permalink":"global-forestry-investments","type_of_entity":"company","image":{"available_sizes":[[[150,108],"assets/images/resized/0019/7083/197083v2-max-150x150.jpg"],[[250,180],"assets/images/resized/0019/7083/197083v2-max-250x250.jpg"],[[450,324],"assets/images/resized/0019/7083/197083v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.omaribowers.co.uk","title":"Omari Bowers - LookupPage"},{"external_url":"http://www.globalforestryinvestments.com","title":"Global Forestry Investments"}]}