{"first_name":"OptiSol","last_name":"Business","permalink":"optisol-business","crunchbase_url":"http://www.crunchbase.com/person/optisol-business","homepage_url":"http://www.optisolbusiness.com","birthplace":"Chennai","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Optisol Business Solutions Pvt Ltd","born_year":1975,"born_month":2,"born_day":5,"tag_list":"open-source-content-management, ebusiness-solutions, sugarcrm-customization, api-integrations-and-development, website-optimization, bpo-outsourcing-services, java-web-development, open-source-solutions, drupal-components-customization, joomla-components-","alias_list":null,"created_at":"Thu Jun 23 10:41:32 UTC 2011","updated_at":"Thu Jun 23 18:58:03 UTC 2011","overview":"<p>About OBS: OptiSol Business Solutions (OBS) is a business and technology solutions provider specializing in services to Small and Medium Businesses (SMB’s) and Independent Software Vendors (ISV’s).</p>\n\n<p>Solutions: We deliver reliable and high quality end-to-end solutions that significantly enhance the competitiveness of our clients in addition to contributing to productivity and profitability.</p>\n\n<p>Work Flow: We engage with our clients on Solutions based Strategic Partner Model (SSPM) enabling them to achieve &#8216;Business Excellence&#8217; through effective use of Information Technology and Off-shoring.</p>\n\n<p>Services: Combining cost-effectiveness and measurable business value of the outsourcing engagement, the model allows our clients to choose our service offerings, Delivery Methodology, Service Levels and Deliverable in line with their business goals to achieve greater benefits.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Optisol Business Solutions Pvt Ltd","permalink":"optisol-business-solutions-pvt-ltd","type_of_entity":"company","image":null}},{"is_past":false,"title":"","firm":{"name":"optibiz","permalink":"optibiz","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.optisolbusiness.com/","title":"Ebusiness Solutions"}]}