{"first_name":"Orlando","last_name":"Ayala","permalink":"orlando-ayala","crunchbase_url":"http://www.crunchbase.com/person/orlando-ayala","homepage_url":"","birthplace":"Bogota, Colombia","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"microsoft, colombia","alias_list":null,"created_at":"Mon Mar 30 19:32:09 UTC 2009","updated_at":"Tue Mar 31 16:16:04 UTC 2009","overview":"<p>Orlando Ayala is the Senior Vice President in Emerging Markets at Microsoft. He is leading an initiative to align cross-company resources to help create long-term opportunities for Microsoft, its partners, and customers.</p>\n\n<p>Born in Colombia, Latin America, Ayala earned a bachelor&#8217;s degree in Management Information Systems at the Universidad Jorge Tadeo Lozano in 1981 and in 1998 he recived a PhD honoris in System Administration. </p>\n\n<p>Ayala joined Microsoft in 1991 as the senior director of the Latin America region, growing the region from four to nine subsidiaries with a 90 percent increase in revenue over four years. Intercontinental revenue similarly doubled to more than $1 billion when he took on the role of senior vice president of that region. During this period, Ayala opened 33 Microsoft subsidiaries around the world, working with each to establish local needs, goals, and presence. Subsequent roles included senior vice president for the South Pacific and Americas region and group vice president of the worldwide Sales, Marketing and Services Group. In the latter position, he led the worldwide strategies, policies and programs that integrate the activities of Microsoft&#8217;s diverse sales and service partners with the needs of Microsoft customers.</p>\n\n<p>Before joining Microsoft, Ayala spent 10 years with NCR Corp. He held various international assignments, including sales director for NCR Mexico.</p>","image":{"available_sizes":[[[126,150],"assets/images/resized/0003/9786/39786v2-max-150x150.png"],[[160,190],"assets/images/resized/0003/9786/39786v2-max-250x250.png"],[[160,190],"assets/images/resized/0003/9786/39786v2-max-450x450.png"]],"attribution":"<p>Microsoft</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}