{"first_name":"Oscar","last_name":"Marquis","permalink":"oscar-marquis","crunchbase_url":"http://www.crunchbase.com/person/oscar-marquis","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Credit Coach","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu May 20 02:44:05 UTC 2010","updated_at":"Mon Oct 04 17:27:13 UTC 2010","overview":"<p>Oscar Marquis is an expert on privacy and fair information practices including the development of company policies governing the use and distribution of public and non-public data and the use of customer information.</p>\n\n<p>Mr. Marquis served as General Counsel of Trans Union LLC, one of the three national consumer reporting agencies, for over 15 years, and was affiliated with Trans Union for over 24 years. At Trans Union, Mr. Marquis was responsible for all of the company&#8217;s legal, government and public affairs. He served on the company&#8217;s executive council and participated in all major strategic decisions and business initiatives. He has participated on behalf of clients with self regulatory organizations, the representation of information services companies and users of consumer information before various regulatory agencies, in state and federal hearings on privacy topics and consumer reporting issues, and the development and implementation of procedures for compliance with laws such as the Gramm-Leach-Bliley financial privacy regulations, the EU Data Protection Directive, and the Fair Credit Reporting Act. He has also worked with financial institutions in relation to their compliance with state and federal credit and collection laws.</p>\n\n<p>Mr. Marquis also worked with international organizations on consumer reporting issues and has been involved with credit bureaus in Egypt, Nigeria, Kenya, Canada, Mexico, Israel, Trinidad and Tobago, and a number of other countries. Mr. Marquis was appointed to three-year terms on the Federal Reserve Board&#8217;s Consumer Advisory Council in 2001. The Council advised the Federal Reserve Board on the exercise of its responsibilities under the Consumer Credit Protection Act and on other matters in the area of consumer financial services. He also serves on the Board of a number of corporate and charitable organizations. Mr. Marquis is a frequent speaker on privacy, credit reporting and other information management topics. He has testified before Congress and the legislatures of many states on privacy and credit reporting issues, and he has appeared on CNN and Nightline. Mr. Marquis is based in Chicago, Illinois.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Board Member","firm":{"name":"Credit Coach","permalink":"credit-coach-electronic-services","type_of_entity":"company","image":{"available_sizes":[[[150,38],"assets/images/resized/0006/5993/65993v8-max-150x150.jpg"],[[250,63],"assets/images/resized/0006/5993/65993v8-max-250x250.jpg"],[[450,115],"assets/images/resized/0006/5993/65993v8-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}