{"first_name":"Oscar","last_name":"Rodriguez","permalink":"oscar-rodriguez","crunchbase_url":"http://www.crunchbase.com/person/oscar-rodriguez","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 21 05:00:51 UTC 2011","updated_at":"Tue Jun 21 05:03:13 UTC 2011","overview":"<p>Oscar Rodriguez serves as President and CEO of Extreme Networks® since August 2010, providing strategic leadership for the company as it delivers high performance Ethernet network solutions and services to enterprises, data center hosting companies and carriers. Rodriguez is an industry veteran with more than 20 years of executive leadership experience spanning sales, marketing and operations. Prior to Extreme Networks, Rodriguez served as the CEO of Movius Interactive Corporation, a messaging, collaboration and mobile media solutions company. Prior to Movius, Rodriguez served as Chief Marketing Officer for Alcatel-Lucent&#8217;s Enterprise Business Group. Prior to that, Rodriguez served as CEO and President of Riverstone Networks, a network company focused on Metro Ethernet switching. Rodriguez also served as President of both the Enterprise Solutions division and the Intelligent Internet division at Nortel Networks. Rodriguez serves on the Board of Directors for EXAR Corporation, a Silicon Valley semiconductor company. Rodriguez is also on the Dean&#8217;s Board of Advisors for the College of Engineering at the University of Central Florida. Rodriguez holds a B.S. in computer engineering from the University of Central Florida, and an MBA from the University of North Carolina at Chapel Hill.</p>","image":null,"degrees":[{"degree_type":"MBA","subject":"","institution":"University of North Carolina","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President and CEO","firm":{"name":"Extreme Networks","permalink":"extreme-networks","type_of_entity":"company","image":{"available_sizes":[[[150,43],"assets/images/resized/0014/0159/140159v1-max-150x150.jpg"],[[250,72],"assets/images/resized/0014/0159/140159v1-max-250x250.jpg"],[[255,74],"assets/images/resized/0014/0159/140159v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}