{"first_name":"Ossama","last_name":"Hassanein","permalink":"ossama-hassanein","crunchbase_url":"http://www.crunchbase.com/person/ossama-hassanein","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Newbury Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Nov 23 16:05:00 UTC 2008","updated_at":"Mon Jun 06 13:57:50 UTC 2011","overview":"<p>Ossama is an entrepreneur, mentor, and venture capitalist. Over the last 35 years, he has managed over $1 billion of international technology funds in diverse leadership roles including EVP of Berkeley International in San Francisco, Chairman of Technocom Ventures in Paris, President of Newbridge Networks Holding in Canada, and Chairman of the Rising Tide Fund in Silicon Valley. In the eighties, he led the mezzanine financing of 80+ Silicon Valley based IT companies that became spectacular successes including: Adaptec; Cirrus Logic; Atmel; PMC-Sierra; LSI Logic; Linear Technologies; and Oracle. Combined market value today exceeds $140 billion.</p>\n\n<p>In the last 15 years, he was chairman or co-founder of six leading-edge digital communication startups in the US, UK and France including ACC in Santa Barbara (routers, acquired by Ericsson), Algety in Lannion (soliton transmission, acquired by Corvis), HighDeal in Caen (rating engines, acquired by SAP), Highwave in Bretagne (fiber optic amplifiers, Listed on Euronext), NetCentrex in Paris (VoIP, acquired by Comverse), and nCipher in Cambridge UK (encryption, listed on LSE). Combined market value at exits: $2.2 billion. Currently, he is chairman of BDNA Corp in Mountain View, of Echovox in Geneva, and Zong in Menlo Park, California.</p>\n\n<p>He has served on the Board of Advisors of Harvard University Center for Middle Eastern Studies and of UCSF Department of Ophthalmology, School of Medicine in San Francisco. He also served on the Board of Directors of Relief International, a non-profit, focusing his efforts on social entrepreneurship and women development in the Middle-East. He is currently chairman of the board of the Egyptian American Society and of TechWadi, the largest network of Arab American high technology executives in Silicon Valley. He is a charter member of the C-100, a Silicon- Valley based association dedicated to mentoring and angel financing Canadian entrepreneurs. He is also a member of the Board of PSD, an NGO focused on providing one Netbook per child for up to 280,000 Palestinian children in need of education.</p>\n\n<p>Dr. Hassanein is the Willard Brown Distinguished Visiting Professor at AUC (American University in Cairo) School of Business, where he is also member of the Board of Advisors. He lectured on Management Science and Engineering at Stanford University and the University of San Diego, and on international business at UC Berkeley and Santa Clara University. Ossama received his B.Sc. (first class honors) in electrical engineering from the University of Alexandria Egypt, his MBA, M.Sc. and PhD requirements in Electrical Engineering at the University of British Columbia, and Ph.D. in Business Administration from California Coast University.</p>\n\n<p>Born and raised in Alexandria, Dr. Hassanein is married, has two children, and resides in Silicon Valley.</p>","image":{"available_sizes":[[[110,150],"assets/images/resized/0002/9268/29268v1-max-150x150.jpg"],[[110,150],"assets/images/resized/0002/9268/29268v1-max-250x250.jpg"],[[110,150],"assets/images/resized/0002/9268/29268v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chairman of the Board","firm":{"name":"Zong","permalink":"zong","type_of_entity":"company","image":{"available_sizes":[[[150,72],"assets/images/resized/0002/4680/24680v4-max-150x150.jpg"],[[250,120],"assets/images/resized/0002/4680/24680v4-max-250x250.jpg"],[[450,217],"assets/images/resized/0002/4680/24680v4-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Senior Managing Director ","firm":{"name":"Newbury Ventures","permalink":"newbury-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,47],"assets/images/resized/0002/9265/29265v1-max-150x150.jpg"],[[250,78],"assets/images/resized/0002/9265/29265v1-max-250x250.jpg"],[[254,80],"assets/images/resized/0002/9265/29265v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Chairman of the Board","firm":{"name":"TechWadi","permalink":"techwadi","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0014/8384/148384v2-max-150x150.png"],[[250,250],"assets/images/resized/0014/8384/148384v2-max-250x250.png"],[[450,450],"assets/images/resized/0014/8384/148384v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}