{"first_name":"Ott","last_name":"Pärna","permalink":"ott-prna","crunchbase_url":"http://www.crunchbase.com/person/ott-prna","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Estonian Development Fund","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":"","created_at":"Mon Jun 15 16:32:38 UTC 2009","updated_at":"Thu Aug 09 14:29:02 UTC 2012","overview":"<p>Ott Pärna is the founding CEO and Head of the Investment Division at the Estonian Development Fund, a public sector venture capital fund and strategic foresight unit of the state created by the Estonian Parliament in 2006. Under his leadership, the ambitious &#8220;business idea&#8221; of the Parliament has been realised into a motivated, focused and action-oriented organisation.</p>\n\n<p>Born in 1976, Ott is currently finishing his doctoral research at SPRU, the Science and Technology Policy Research Centre, University of Sussex, in the UK. His research focus is the management of technological innovation in public sector services. Ott is an economist, holding also a Masters degree in Public Administration from the Tallinn Technical University and a Postgraduate Diploma in Economics from the University of Southern Denmark. Ott has also been a visiting research fellow at the Centre of Knowledge and Innovation Research, Helsinki School of Economics and Business Administration.</p>\n\n<p>Prior to joining the Development Fund in early 2007 and SPRU in October 2003, Ott worked from 2000 as an innovation and technology policy expert for the Estonian Ministry of Economic Affairs and Communications, where among other things, he was a project manager for launching the Tallinn Technology Park, currently home for about 140 technology companies, including the launch-pad and R&amp;D unit of Skype, in the campus area of Tallinn Technical University and the Estonian IT College.</p>","image":{"available_sizes":[[[86,150],"assets/images/resized/0004/8606/48606v1-max-150x150.jpg"],[[143,250],"assets/images/resized/0004/8606/48606v1-max-250x250.jpg"],[[259,450],"assets/images/resized/0004/8606/48606v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Estonian Development Fund","permalink":"estonian-development-fund","type_of_entity":"financial_org","image":{"available_sizes":[[[150,28],"assets/images/resized/0004/8605/48605v1-max-150x150.jpg"],[[250,46],"assets/images/resized/0004/8605/48605v1-max-250x250.jpg"],[[300,56],"assets/images/resized/0004/8605/48605v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}