{"first_name":"P.","last_name":"Morgan McCague","permalink":"p-morgan-mccague","crunchbase_url":"http://www.crunchbase.com/person/p-morgan-mccague","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat May 16 03:18:23 UTC 2009","updated_at":"Sat May 16 03:21:01 UTC 2009","overview":"<p>Morgan is a director with First Coverage Inc. as well as numerous other companies in the financial services industry, including Canadian Investors Holdings Corporation, Morguard Investment Corporation, CCB Mortgage Investment Corporation, Pensionfund Energy Resources Ltd., Pengrowth Oil and Gas Ltd., Ventures West Technologies, GCAN Insurance Company and Workers Safety and Insurance Board.</p>\n\n<p>An experienced member of the Canadian financial services community, Morgan was the founding president of the Buy-side Investment Management Association (B.I.M.A.) and currently acts as a director of the Pension Investment Association of Canada (PIAC). He has also served on numerous committees of the Toronto Stock Exchange including acting as the Public Governor of The Toronto Futures Exchange and serving on the &#8220;Blue Ribbon Panel&#8221; regarding the introduction of the S&amp;P/TSE 60 Index.</p>\n\n<p>A popular speaker and published author, Morgan has held senior positions with many leading companies in the financial services and institutional investment industries and recently retired from the Ontario Teachers&#8217; Pension Plan Board where he most recently held the position of Senior Vice-President of Quantitative Investments.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Director","firm":{"name":"First Coverage","permalink":"first-coverage","type_of_entity":"company","image":{"available_sizes":[[[142,34],"assets/images/resized/0004/4316/44316v1-max-150x150.png"],[[142,34],"assets/images/resized/0004/4316/44316v1-max-250x250.png"],[[142,34],"assets/images/resized/0004/4316/44316v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}