{"first_name":"Pablo","last_name":"A. Arenas","permalink":"pablo-a-arenas","crunchbase_url":"http://www.crunchbase.com/person/pablo-a-arenas","homepage_url":"","birthplace":"Chile","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Fusion Creative Studios","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Tue Oct 07 20:20:16 UTC 2008","updated_at":"Wed Oct 10 22:27:23 UTC 2012","overview":"<p>Pablo A. Arenas is a futurist CEO whose leadership has amplified mobile advertising technology, and mobile game development through Fusion Studios, Inc., formerly known as Fusion Creative Studios.</p>\n\n<p>Mr. Arenas began to expose his innovative and captivating talents in 2001 when he launched Systematic Software Development (SSD), a MS/PC based company that quickly expanded from building custom platforms for land development companies in NYC, into SSD Business Solutions LLC. Providing web hosting, development, design and marketing solutions, with 24 hour IT support, land developers soon came to rely on the company to provide the necessary tools for reliable and effective daily management. </p>\n\n<p>A self made entrepreneur, Arenas insightfully incorporated animation and 3D technology into SSD to develop Fusion (www.fusionstudios.co). Intended to target the real-estate market, Fusion quickly evolved into a leading authorized Apple, Blackberry, Android and Palm creator in the social gaming and business application industry.</p>\n\n<p>Through the launch of Square Jams, a simple yet complex puzzle game, Fusion gained recognition as a leading iPhone developer expanding to reinvent classic games such as Deadman, Chess and TicTacToe.  Arenas, inspired by his young daughter, launched Foxie Hunny Arctic Adventure, gifting the legacy to his daughter on Christmas 2008.  Currently, with over 1 million downloads, and was listed as one of the top 100 action adventure games world wide, the adorable yet sassy Red Artic Fox continues to captivate players in Foxie Hunny Jump, a vertical slice lucid dream experience, currently with thousands of users on facebook.</p>\n\n<p>Native to Santiago Chile, Fusions’ mastermind CEO Pablo A, Arenas, attributes his success modestly to trial and error based upon concrete family values instilled while growing up in the Bronx, NY. As a naturally born artist and entrepreneur, Arenas demonstrates an explosive imagination as he individually creates graphics and voiceovers in his visionary games.  Fusion continues to revolutionize and ignite mobile platforms specializing in over 42 applications in education, entertainment, medical, and mobile gaming applications. </p>\n\n<p>With unlimited imaginative spirit, Pablo A. Arenas will continue to expand and impress the mobile game development market. With a mastermind fueling the fire, Fusion erupts with never before seen state of the art mobile technology throughout 2011 and beyond.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0002/7801/27801v2-max-150x150.jpg"],[[179,250],"assets/images/resized/0002/7801/27801v2-max-250x250.jpg"],[[323,450],"assets/images/resized/0002/7801/27801v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder and CEO","firm":{"name":"Fusion Creative Studios","permalink":"fusion-creative-studios","type_of_entity":"company","image":{"available_sizes":[[[150,71],"assets/images/resized/0002/6348/26348v4-max-150x150.jpg"],[[250,118],"assets/images/resized/0002/6348/26348v4-max-250x250.jpg"],[[450,213],"assets/images/resized/0002/6348/26348v4-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Founder & CEO","firm":{"name":"Rhino Mobile","permalink":"rhino-mobile","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0005/4269/54269v2-max-150x150.jpg"],[[250,84],"assets/images/resized/0005/4269/54269v2-max-250x250.jpg"],[[450,152],"assets/images/resized/0005/4269/54269v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.forbes.com/feeds/prnewswire/2009/11/23/prnewswire200911230803PR_NEWS_USPR_____NY15777.html","title":"Fusion Creative Studios Explodes with Dynamite Apps and App Revenue Streams"}]}