{"first_name":"Pace","last_name":"Lattin","permalink":"pace-lattin","crunchbase_url":"http://www.crunchbase.com/person/pace-lattin","homepage_url":"http://www.pacelattin.com","birthplace":"","twitter_username":"pacelattin","blog_url":"http://www.clickz.com/author/profile/1384/pace-lattin","blog_feed_url":"","affiliation_name":"Cybereps Inc","born_year":null,"born_month":null,"born_day":null,"tag_list":"pace-lattin, pace, lattin, about-com, cybereps, clickz, offervault, industrypace","alias_list":null,"created_at":"Wed Jul 06 19:01:17 UTC 2011","updated_at":"Wed Dec 14 19:07:33 UTC 2011","overview":"<p>Pace Lattin often consider one of the most influential executives in online advertising and media.  As an industry pioneer he created several technologies that are now considered standard.  As a successful &#8220;intrapreneur&#8221; he has developed important products and business solutions.  During almost fifteen years of experience in the industry, he has earned the reputation of having a high standard of ethics and being an expert in both brand and direct response.\nKey Career Highlights</p>\n\n<p>In 1997 Pace founded one of the first interactive advertising networks, Future Games Network, focused on computer and video games.  Soon after creating Future Games Network, he sold it to another new company, Cybereps, Inc., and became co-owner and one of the first executives in the company.  At Cybereps he was involved in securing, representing and working with Teknosurf, which eventually became Advertising.com.  During his tenure with Cybereps he created two other major vertical networks, TotalWomen and TotalHealth.  In 2002 Cybereps was sold to a public company, Interep.</p>\n\n<p>After leaving Cybereps in 2001, Pace worked for ABOUT.com as an executive consultant, assisting the company in growing a user base.  After he had successfully made ABOUT.com one of the top properties in the world, the company retained him to create vertical advertising networks based on their content sections.  This was dubbed the &#8220;Luna Network&#8221;and eventually Sprinks. In 2003 Sprinks was sold to Google and became the foundation of the Google Adsense network.</p>\n\n<p>In 2001 Pace also created Adspyre Ltd., a marketing firm that focused mainly on email marketing campaigns and affiliate marketing.  He created one of the first CPA Networks, The Revenue Tracking System (THERTS), and working with Jason Wolfe, owner of a major coupon site, to create DirectTrack, one of the first CPA and Affiliate Tracking Systems.  An unnamed competitor bought Adspyre Ltd email business, and DigitalRiver bought DirectTrack in 2006.</p>\n\n<p>Also in 2001 Pace created ADBUMb, a major interactive advertising newsletter that covered affiliate and direct response interactive advertising.  MarketingSherpa named Pace the &#8220;most influential&#8221; journalist in the industry.  Distributed by email to executives in the industry, ADBUMb was widely read and quoted by its readership.  As the owner and publisher of ADBUMb, Pace often published editorials challenging the industry to make changes, and he became known as a champion of ethics and industry standards.  In 2006 ADBUMb became ADOTAS.com, one of the world’s top advertising websites.  In 2006 ADOTAS was sold to New York Publishing Group and is still published in its original format.</p>\n\n<p>In 2005 Pace developed Vizi Media (fka Icon Advertising Solutions), an advertising representation company representing numerous top websites like Marvel.com, Zagats.com, and Tagged.com.  At Vizi he created Vizi Direct, a display advertising network that in 2008 reached 25% of the U.S. Internet audience and became one of the top comscore-rated websites.  At Vizi he was also involved in creating DoubleClick Exchange; Vizi was the first network on the exchange as part of their alpha and beta testing.  Vizi was sold in parts and shut down profitably in 2009.</p>\n\n<p>For six months in 2009, Pace served as an executive consultant to Burst Direct, helping to bring the company onto the RightMedia exchange and train its team in the technology.  In 2009 he was hired by MediaBreakAway as the Chief Rainmaker (mix of Chief Sales Officer and Chief Marketing Officer) to revamp the company and change its reputation.  During this tenure he created IndustryPace, a recognized compliance blog that is currently being transformed into a legal resource with a well-known attorney in the field.</p>\n\n<p>Soon after leaving MediaBreakway, Pace became the creator and owner of Inside OfferVault, which, with over 150,000 readers a week, has quickly outstripped competitors and become the largest publication in Performance Based Marketing.  Inside OfferVault was renamed in August 2011 to Performance Marketing Insider.</p>\n\n<p>He is also a regular columnist at ClickZ.com, and a writer for Technorati.com focusing on marketing, advertising and social media.</p>\n\n<p>Recently, Impact Radius also named him one of the top 10 most influential people in Performance Marketing, and FastCompany Magazine dubbed him one of the top 10 most influential people on the internet in 2011.</p>\n\n<p>Currently Pace is the Executive Director of the Executive Council of Performance Marketing, an influential professional group that represents over a hundred C-Level executives in the industry and focuses on bringing positive change to the industry through discussion and cooperation.  </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Executive Director","firm":{"name":"Executive Council of Performance Marketing","permalink":"executive-council-of-performance-marketing","type_of_entity":"company","image":null}},{"is_past":true,"title":"Founder","firm":{"name":"ADOTAS","permalink":"adotas","type_of_entity":"company","image":null}},{"is_past":true,"title":"CEO","firm":{"name":"Vizi Inc","permalink":"vizi-inc","type_of_entity":"company","image":null}},{"is_past":true,"title":"Co-Founder","firm":{"name":"Cybereps Inc","permalink":"cybereps-inc","type_of_entity":"company","image":null}},{"is_past":true,"title":"Chief Rainmaker ","firm":{"name":"MediaBreakAway LLC","permalink":"mediabreakaway-llc","type_of_entity":"company","image":null}},{"is_past":true,"title":"Editor in Chief","firm":{"name":"OfferVault","permalink":"offervault","type_of_entity":"company","image":null}},{"is_past":true,"title":"Executive Consultant","firm":{"name":"About.com","permalink":"about-com","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0001/9001/19001v2-max-150x150.png"],[[182,54],"assets/images/resized/0001/9001/19001v2-max-250x250.png"],[[182,54],"assets/images/resized/0001/9001/19001v2-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Executive Consultant","firm":{"name":"Burst Media","permalink":"burstmedia","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0002/2672/22672v3-max-150x150.jpg"],[[250,250],"assets/images/resized/0002/2672/22672v3-max-250x250.jpg"],[[450,450],"assets/images/resized/0002/2672/22672v3-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"President, Email","firm":{"name":"Adspyre Inc.","permalink":"adspyre-inc","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.growmap.com/pace-lattin/","title":"Pace Lattin Affilaite Tax Nexus"},{"external_url":"http://www.scribd.com/collections/2612103/Letters-of-Reference","title":"Pace Lattin Letters of Reference"},{"external_url":"http://mthink.com/blog/chris-trayhorn/revenue-performance-qa-pace-lattin","title":"Pace Lattin Interview at Revenue Performance"},{"external_url":"http://www.clickz.com/author/profile/1384/pace-lattin","title":"Pace Lattin @ ClickZ"},{"external_url":"http://www.articlesnatch.com/Article/Interview-With-Leading-Affiliate-Marketing-Voice-Pace-Lattin/1959726","title":"Pace Lattin Interview"},{"external_url":"http://performinsider.com/","title":"Pace Lattin PMi"}],"web_presences":[{"external_url":"http://www.linkedin.com/in/mediabreakaway","title":"Pace Lattin"},{"external_url":"http://twitter.com/#!/pacelattin","title":"Pace Lattin"},{"external_url":"http://klout.com/#/pacelattin","title":"Pace Lattin"},{"external_url":"http://www.peerindex.net/pacelattin","title":"Pace Lattin"},{"external_url":"http://about.me/pacelattin","title":"Pace Lattin"},{"external_url":"https://plus.google.com/108061065454579782550/posts","title":"Pace Lattin"}]}