{"first_name":"Paige","last_name":"Saez","permalink":"paige-saez","crunchbase_url":"http://www.crunchbase.com/person/paige-saez","homepage_url":"http://paigesaez.org","birthplace":"miami, florida","twitter_username":"paigesaez","blog_url":"http://blending.tumblr.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"user-experience, experience-design, art, visual-arts, design, anthropology, cyborg-anthropology, social-sciences","alias_list":null,"created_at":"Thu Jun 10 21:17:25 UTC 2010","updated_at":"Fri May 20 02:49:53 UTC 2011","overview":"<p>Paige Sàez is a user experience researcher and designer and a practicing artist. Currently, she is a consulting strategic planner and user-centered experience designer for interactive mobile products and services including web and mobile applications.\nSàez’s personal artistic practice explores the creation and consumption of the object and imaginary devices to aid (or disrupt) communication. Sàez is fascinated by structures of participation in the production of knowledge and information. Her research on hacktivism, participatory economics and cyborg anthropology all influence this visual arts practice.\nSàez focuses her research on the intersections between visual studies, cyborg anthropology and art, and believes strongly that these are the center-points of social activism. As a social activist, Sàez has worked on many projects in the past few years that incorporate her skills and knowledge in this field.\nIn 2007, Sàez and collaborator Anselm Hook founded the Makerlab, an arts and technology incubator focused on civic and environmental interactive projects. For example, the collaborative has produced two mobile applications focused on evidencing and facilitating local communities. The Makerlab also hosts weekly Sunday Skill-Shares, bringing artists and programmers together for potlucks and social activist endeavors.\nLittle Cities (2004-2006), was a project conceived and created by Sàez, who worked with groups of people around the country to build ad-hoc dream houses. Little Cities was a process designed to create new homes, new communities, and new ways to think about the meaning of home and place.\nFrom 2005-2006, Sàez worked with Platial, a neogeographical map-sharing social network where she created over 100 Situationist maps.\nSàez has exhibited her art work for the last 11 years. She has shown work individually and with groups at internationally recongnized exhibitions which include Art Basil, in Miami, and the 2007 Istanbul Biennale. She frequently collaborates on projects with Red76, a Portland, Oregon based collective she has been working with for the last 10 years.</p>","image":null,"degrees":[{"degree_type":"M.F.A.","subject":"Visual Studies + Participatory Culture","institution":"Pacific Northwest College of Art","graduated_year":2008,"graduated_month":null,"graduated_day":null},{"degree_type":"B.S.","subject":"Architecture","institution":"Portland State University","graduated_year":2005,"graduated_month":null,"graduated_day":null},{"degree_type":"B.F.A.","subject":"Photography","institution":"Alfred University","graduated_year":1998,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/paigesaez","title":"Twitter"}]}