{"first_name":"Palak","last_name":"Sharma","permalink":"palak-sharma","crunchbase_url":"http://www.crunchbase.com/person/palak-sharma","homepage_url":"http://www.surfindia.com/","birthplace":"New Delhi","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"india-web-directory, online-indian-websites, largest-web-directory-of-india, free-online-directory","alias_list":null,"created_at":"Tue Oct 12 06:44:13 UTC 2010","updated_at":"Sun Nov 25 23:40:35 UTC 2012","overview":"<p>Surfindia.com is the largest Indian Directory  is a most reliable online India search engine providing information on  India. Surfindia is an online India  info guide also the largest India web directory listing top quality websites and urls of various companies, sectors, zones, destinations in India. </p>\n\n<p>Surfindia also provides info on various popular channels and searches related to India like Bollywood Celebrities, latest and upcoming automobile models in India with the detailed description on Car Reviews and Buyers Guide. Get to know about the India finance market, live information on Bse Indices, Nse Indices, Top gainers, top losers, derivatives, income tax calculator and vast info on Indian Budget. Get updated with latest and upcoming festivals of India and mouth watering Indian cuisine and the method to cook food with detailed list of popular Indian recipes. Also surfindia is a major provider of information on Indian marriages, facts about India, Astrology,  Explore India with the help of travel sections of India providing info on various top attractions of India like Taj Mahal, Rajasthan, Kerala Backwaters, Goa etc.  Surfindia online search guide on India provides all the required search information related to India. </p>","image":{"available_sizes":[[[150,27],"assets/images/resized/0010/5190/105190v2-max-150x150.png"],[[250,45],"assets/images/resized/0010/5190/105190v2-max-250x250.png"],[[259,47],"assets/images/resized/0010/5190/105190v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://top100engineeringcollegesinindia.webs.com","title":"Top 100 engineering college in India"}],"web_presences":[]}