{"first_name":"Pamela","last_name":"Mahoney","permalink":"pamela-mahoney","crunchbase_url":"http://www.crunchbase.com/person/pamela-mahoney","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Nov 06 15:27:35 UTC 2008","updated_at":"Thu Nov 06 16:04:58 UTC 2008","overview":"<p>Pamela Mahoney joined MDV in 2000 with more than 15 years experience in corporate communications, marketing and media relations. She works closely with MDV&#8217;s early stage companies and helps the management teams develop effective communication plans and market positioning. She&#8217;s currently collaborating with Gordon Murray Design, Genomatica, Tethys Bioscience and ZeaChem.</p>\n\n<p>Pamela also fosters awareness of MDV&#8217;s investment strategy and helps build partnerships with leading industry and entrepreneur organizations. She represents MDV on the NVCA Strategic Communications Group, the Society for New Communications Research, and the Stanford Racing Team. In 2005 the team developed a robot car that successfully navigated 132 miles of unknown terrain fully autonomously in the fastest time, winning the DARPA Grand Challenge.</p>\n\n<p>Prior to joining MDV, Pamela served as director of market relations at Novell. She previously held senior communications positions at Sun Microsystems, including work in Sun&#8217;s international operations. Before arriving in Silicon Valley, Pamela spent ten years in corporate communications and marketing positions in the auto industry, including seven years as a member of Chrysler Corporation&#8217;s award-winning team responsible for a significant corporate repositioning and the launch of a record number of new products. Prior to Chrysler, Pamela held agency positions that supported General Motors and Ford Motor Company. She also worked in the communications group at Dow Chemical Company.</p>\n\n<p>Pamela holds a BA in English and Communication from the University of Michigan and an MA in Organizational Communication and Public Relations from Wayne State University.</p>","image":{"available_sizes":[[[102,150],"assets/images/resized/0002/7935/27935v2-max-150x150.jpg"],[[166,242],"assets/images/resized/0002/7935/27935v2-max-250x250.jpg"],[[166,242],"assets/images/resized/0002/7935/27935v2-max-450x450.jpg"]],"attribution":"<p>Pamela Mahoney / <a href=\"http://www.,mdv.com\" title=\"MDV\" rel=\"nofollow\">MDV</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Mohr Davidow Ventures","permalink":"mohr-davidow-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,58],"assets/images/resized/0001/9292/19292v3-max-150x150.jpg"],[[250,97],"assets/images/resized/0001/9292/19292v3-max-250x250.jpg"],[[450,176],"assets/images/resized/0001/9292/19292v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/0/a01/43","title":"LinkedIn"}]}