{"first_name":"Panchal","last_name":"Production","permalink":"panchal-production","crunchbase_url":"http://www.crunchbase.com/person/panchal-production","homepage_url":"http://www.expansionbellow.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Oct 07 10:01:58 UTC 2010","updated_at":"Thu Oct 07 19:49:52 UTC 2010","overview":"<p>Our organization is fully backed by our well equipped production facility which is well handled by qualified and the dedicated team of the engineers, technicians and skilled professionals. Basically, our prime concern is to offer flawless range of industrial bellows therefore; these are fabricated in compliance with the international norms. We also provide customized solutions in accordance to the exact specifications and requirements mentioned by our clients including VFC Limited, Vadodara, L &amp; T, Vadodara and Solitior Machine Tools Ltd., USA/Vadodara. Under the able and efficient guidance of our chairman, Mr. M.V.Panchal, our organization has achieved a commendable level in the industry. His in-depth knowledge and industry experience have enabled us to make continuous improvement in our products that keep pace with the changing demands of the market. </p>\n\n<p>We are the leading producer of expansion joint, compensators, steel expansion joints, bellows expansion joint and steel expansion joint.</p>\n\n<p>We offer to sell industrial bellows, industrial bellows, double axial bellow, pressure balanced bellows, square bellows, single axial bellows, bending belt, steel lined choker belts, pipe dollies, pipe lifting hooks etc.</p>\n\n<p>Contact us at:</p>\n\n<p>Panchal Production\nMr. Panchal\nA/4, Saraswati Industrial Estate, Opposite Chhani, Jakatnaka\nVadodara, Gujarat - 390002, India\nTelephone   :   +91-265-2776268\nMobile  :   +91-9898107532/ 9426335228</p>\n\n<p>Visit us at: http://www.expansionbellow.com/</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}