{"first_name":"Pankaj","last_name":"Rustagi","permalink":"pankaj-rustagi","crunchbase_url":"http://www.crunchbase.com/person/pankaj-rustagi","homepage_url":"http://www.materialtestinginstrument.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"soil-testing-instruments, cement-testing-equipment, concrete-testing-instruments-manufacturer, asphalt-testing-instruments-exporter","alias_list":null,"created_at":"Tue Apr 17 11:06:09 UTC 2012","updated_at":"Sun Apr 22 07:25:22 UTC 2012","overview":"<p>Central Scientific Instruments Co</p>\n\n<p>Established in the year 1971, Central Scientific Instruments Co. is one of the promising manufacturers and suppliers of a wide range of material testing instruments. Manufactured using quality material and components, our range is used by engineers, geologists, agronomists, contractors &amp; others for analyzing and testing various properties and quality of soil, asphalt, concrete, cement and others. Through constant innovation, refinement &amp; unwavering commitment to quality, we have gained trust and confidence of our clients. Backed by a team of expert engineers and other professionals, we have been able to deliver superior quality products that are fabricated as per ISS and BSS norms. Making use of advanced machines and sophisticated technology installed in our sound manufacturing unit, our professionals also facilitate the clients with customized instruments. Prior to delivery, they also conduct various tests on the entire range so that our clients receive defect free and highly efficient products. Moreover, our wide distribution network and association with industry&#8217;s best logistics providers ensures time lined delivery of each and every consignment. Capitalizing on the ample knowledge of our mentor, Mr. Pankaj Rustagi, we have created a remarkable position for ourselves in the industry. His business acumen and sharp insight has helped us in garnering huge client base across the country.</p>\n\n<p>We are a prominent manufacturer and supplier of a high performing range ofMaterial Testing Instruments. Our range is stringently manufactured using quality assured material and components, which are sourced from established vendors of the industry. Further, our range can also be customized based on the specifications put forth by clients. These are used by engineers, geologists, agronomists and others for analyzing &amp; testing quality of soil, asphalt, concrete, cement and many more. </p>\n\n<p>Quality is the forte of our organization. Since our establishment, we have been constantly striving to improvise our products to ensure superior quality. Employed after crucial selection procedure, the team of skilled and experienced quality controllers stringently monitors each stage to ensure that the instruments are fabricated as per ISS and BSS norms. Moreover, our professionals understand the criticality of scientific testing equipment and thus, make use of quality assured material and components procured from established vendors. Our professionals also conduct various tests based on several parameters so that our clients receive defect free range. Following are some of the defined parameters on which we check our products:</p>\n\n<pre><code>Accuracy in results\nEase of operations\nEfficiency\nPerformance\n</code></pre>\n\n<p>Telephone:+(91)-(11)-47072402/ 22305008 </p>","image":{"available_sizes":[[[125,125],"assets/images/resized/0018/4625/184625v2-max-150x150.jpg"],[[125,125],"assets/images/resized/0018/4625/184625v2-max-250x250.jpg"],[[125,125],"assets/images/resized/0018/4625/184625v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}