{"first_name":"Pankaj","last_name":"Mittal","permalink":"pankaj-mittal","crunchbase_url":"http://www.crunchbase.com/person/pankaj-mittal","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Impetus Technologies, Inc.","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Oct 24 08:36:50 UTC 2008","updated_at":"Fri Nov 27 16:59:47 UTC 2009","overview":"<p>Pankaj has to his credit a long successful track record in managing, architecting, designing, implementing, and delivering cutting edge software products and application frameworks. He has worked on a variety of technology initiatives for product development, and has been a part of hundreds of releases of more than 40 product launches in his 15-year long career. </p>\n\n<p>Having joined Impetus in the year 1992, Pankaj has since been responsible for handling the offshore operations while also defining and implementing company’s technology strategy. He has been instrumental in the growth of the company to over 750 employees, managing multiple projects, and mentoring the R&amp;D effort for building innovative software tools and components. He has played a key role in developing the company’s intellectual property and applying the same to add more value to the client deliverables. Pankaj’s offshore team enables and supports business growth by managing client expectations from the technology and delivery perspectives. </p>\n\n<p>Pankaj has the astute ability to figure out the product definition with respect to the technology, and at the same time, map the product to the evolving requirements of the market. He can be credited to having the vision, confidence and foresight in identifying emerging product technology and research areas for Impetus. His determination and persistence in incubating new technology ideas has been a major factor in the success of Impetus’s offshore services, and its own product divisions. </p>\n\n<p>Pankaj holds a graduate degree in Computer Science &amp; Engineering and an MBA degree in Marketing from the University of Indore, India.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Senior VP- Engineering & Chief Technology Officer","firm":{"name":"Impetus Technologies","permalink":"impetus-technologies-inc","type_of_entity":"company","image":{"available_sizes":[[[150,56],"assets/images/resized/0002/7274/27274v2-max-150x150.jpg"],[[250,93],"assets/images/resized/0002/7274/27274v2-max-250x250.jpg"],[[450,168],"assets/images/resized/0002/7274/27274v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"CTO","firm":{"name":"Intellicus","permalink":"intellicus","type_of_entity":"company","image":{"available_sizes":[[[150,58],"assets/images/resized/0016/9916/169916v2-max-150x150.jpg"],[[170,66],"assets/images/resized/0016/9916/169916v2-max-250x250.jpg"],[[170,66],"assets/images/resized/0016/9916/169916v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}