{"first_name":"Paolo","last_name":"Privitera","permalink":"paolo-privitera","crunchbase_url":"http://www.crunchbase.com/person/paolo-privitera","homepage_url":"","birthplace":"Venice, Italy","twitter_username":"pppaolo","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1977,"born_month":11,"born_day":6,"tag_list":"","alias_list":null,"created_at":"Fri Jan 29 02:35:38 UTC 2010","updated_at":"Thu Aug 04 17:47:13 UTC 2011","overview":"<p>Paolo is a young technology entrepreneur and visionary, specializing in structuring progressive business models that capture the moment and stay on top of the future. He holds a Master Degree in Computer Science from the University Ca’Foscari of Venice, were he completed a thesis on a real case study “Business Intelligence: Analysis for Resource Optimization of an Information System&#8221;, while holding the position of Director of Technology at Apindustria Vicenza (the largest SMB Industrial Association in Italy).\nHis entrepreneurial experience began during graduate school, when he founded Digitix, his first company offering web development services to small and medium businesses in North East of Italy.</p>\n\n<p>Since when he moved to the United States in 2002, he has worked offering strategic consultancy in Information Technology to many Italian and American companies, Italian Trade Commission and Italian Chamber of Commerce of Los Angeles, New York’s Big Apple Radio, Sendia (now SalesForce) and many more. \nWhile attending an International Marketing program at UCLA, in year 2004 he founded and became CEO of Digitix Corp, California based C-corporation, offering web development, technology and growth strategy services also to several start-ups (SpeakCorp, 360ID, CTpermits, KeyPLe, &#8230;) and world renowned companies (La Murrina, Illy, MDM/VEGA Venice Science Park, Micucci, Farnese, Luxottica, Ferrari, RAI, &#8230;) with excellent results.\nHe is also involved as data harvester and disseminator in MACE Project -Metadata for Architectural Contents in Europe-, and has been called by Los Angeles Court as Forensic IT Specialist on a civil case.</p>\n\n<p>With his 15 years of experience in web technologies at the service of more than 100 businesses, he joined eBonza (safe Internet payments) in 2008 as stockholder and CTO, and GreenPrefab (Life Cycle Management platform for the sustainable building industry) in 2009, offering support for both the business strategy and technical strategy.</p>\n\n<p>His role as CTO is to work as part of the team to understand related technologies and technical opportunities, understand and help drive alignment around a vision of where the business should go, and mesh those together to help make disciplined, proactive technical decisions.</p>\n\n<p>Paolo believes that information is the most important resource of any business. Thanks to his strong passion and interest in all aspects of information, he keeps himself up-to-date on the ever-changing IT world, always having at his fingertips the most high-end cutting-edge technology available.</p>\n\n<p>He is also very active in the Silicon Valley, attending and cooperating at networking events, connecting together experienced entrepreneurs, investors, computer scientists and engineers, and start-up rookies, and working to create an &#8220;International Accelerator and Technology Transfer Center&#8221; in the Silicon Valley, for Italian and world companies.</p>\n\n<p>Paolo speaks fluent Italian, English, Spanish, French, and is currently studying Japanese and Mandarin Chinese, restless traveler, power rollerskater, pianist for passion, and addicted photographer.</p>","image":{"available_sizes":[[[132,150],"assets/images/resized/0007/5325/75325v4-max-150x150.jpg"],[[221,250],"assets/images/resized/0007/5325/75325v4-max-250x250.jpg"],[[295,333],"assets/images/resized/0007/5325/75325v4-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder and President","firm":{"name":"Digitix Corp","permalink":"digitix-corp","type_of_entity":"company","image":null}},{"is_past":false,"title":"Co-founder and CEO","firm":{"name":"Doochoo","permalink":"doochoo","type_of_entity":"company","image":{"available_sizes":[[[150,91],"assets/images/resized/0009/1940/91940v4-max-150x150.jpg"],[[250,153],"assets/images/resized/0009/1940/91940v4-max-250x250.jpg"],[[450,275],"assets/images/resized/0009/1940/91940v4-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Founder and President","firm":{"name":"Digitix","permalink":"digitix","type_of_entity":"company","image":null}},{"is_past":false,"title":"Head of Innovation and Emerging Media","firm":{"name":"H-art (WPP)","permalink":"h-art-wpp","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}