{"first_name":"Parrish","last_name":"M. Galliher","permalink":"parrish-m-galliher","crunchbase_url":"http://www.crunchbase.com/person/parrish-m-galliher","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Mar 10 03:41:25 UTC 2012","updated_at":"Sat Mar 10 03:43:18 UTC 2012","overview":"<p>Mr.  Parrish M. Galliher earned his BA in Biology at Boston University (1975). After 3 years as an EIT at Dynatech R/D Corp., he began graduate studies at MIT and earned his MS in Biochemical Engineering. Mr. Galliher joined Biogen, Inc. in 1981 where he was responsible for design, commissioning and management of Biogen’s first biomanufacturing facility. He held various management positions in Process Development, Engineering and Clinical Manufacturing of biopharmaceuticals using bacteria, yeast and mammalian cells. As Director of Process Engineering, he led the team responsible for startup, initial validation and commissioning of Biogen’s Avonex® manufacturing facility licensed by the FDA in 1996. Mr. Galliher joined Alpha-Beta Technology (ABT) in January of 1994 as Director of Manufacturing Development and was promoted to Vice President in 1995. He led the team responsible for technology transfer, startup, validation, and commissioning of ABT’s biopharmaceutical manufacturing plant in Smithfield , RI . and was appointed Vice President of Operations and General Manager in 1997. Mr. Galliher joined LeukoSite, Inc. in 1999 as Vice President of Biologics Manufacturing. After Millennium Pharmaceuticals acquired LeukoSite later that year, Mr. Galliher managed Millennium’s worldwide biologics manufacturing operations, including leadership of the CMC Team that contributed to FDA licensure of CAMPATH® monoclonal antibody in 2001. He also led the Manufacturing Productivity Improvement program which enabled high speed development of Millennium’s anti-CCR-2 Mab for clinical trials. Mr. Galliher founded Xcellerex in December 2002.</p>","image":null,"degrees":[{"degree_type":"BA","subject":"Biology","institution":"Boston University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder & Chief Technology Officer","firm":{"name":"Xcellerex","permalink":"xcellerex","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0017/7525/177525v1-max-150x150.jpg"],[[250,80],"assets/images/resized/0017/7525/177525v1-max-250x250.jpg"],[[252,81],"assets/images/resized/0017/7525/177525v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}