{"first_name":"Partha","last_name":"Sarathy","permalink":"partha-sarathy","crunchbase_url":"http://www.crunchbase.com/person/partha-sarathy","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jul 05 21:03:54 UTC 2008","updated_at":"Sat Jul 05 21:06:54 UTC 2008","overview":"<p>Partha R.R.Sarathy has over 20 years of experience in financial operations for high growth technology companies, including McDonnell Douglas Corporation, NewsTakes Inc and Duet Technologies Inc. He most recently served as a Consultant, assisting bay area public companies to comply with Regulations of Sarbanes-Oxley (SOX). As CFO of NewsTakes, a wireless software company, Sarathy was involved in fund-raising and strategic planning. As Vice President of Finance for Duet, a worldwide provider of semiconductor design services and software, Sarathy helped redirect the company strategy and successfully grew international operations throughout India, Europe and Japan. Sarathy played a key role in the development of Duet by completing a major merger and raised equity and debt financing. Prior to Duet, Sarathy spent a five-year tenure as a CFO at Solitec, Inc a publicly held, semiconductor equipment manufacturing company, where he managed investor relations, Corporate Finance, Operations and MIS.</p>\n\n<p>At Solitec, Sarathy played a key role in assisting the CEO and Board Of Directors in evaluating and executing all merger and acquisition activities. Sarathy started his career as Internal Auditor at Kothari Industrial Corporation, a highly diversified, 100 million dollar company in India, in the field of Electronics, Chemicals and Textiles, where he conducted both financial and operations audit. Sarathy is a member of The Institute Of Chartered Accountants Of India and has passed the US CPA examination.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Vice President, Finance","firm":{"name":"Webaroo","permalink":"webaroo","type_of_entity":"company","image":{"available_sizes":[[[140,76],"assets/images/resized/0002/1498/21498v1-max-150x150.jpg"],[[140,76],"assets/images/resized/0002/1498/21498v1-max-250x250.jpg"],[[140,76],"assets/images/resized/0002/1498/21498v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}