{"first_name":"Pat","last_name":"Christen","permalink":"pat-christen","crunchbase_url":"http://www.crunchbase.com/person/pat-christen","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"HopeLab","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jul 28 08:18:13 UTC 2010","updated_at":"Thu Jul 29 22:31:55 UTC 2010","overview":"<p>Pat Christen is President and CEO of HopeLab, where she engages a multidisciplinary team developing products and practices that improve the lives of young people with chronic illness. </p>\n\n<p>HopeLab&#8217;s nonprofit work combines research, iterative product development and values-based management to create products that motivate positive health behaviors in kids. Under Christen&#8217;s leadership, HopeLab launched the Re-Mission video game for cancer in 2006; research demonstrating the efficacy of Re-Mission in improving treatment adherence was published in the medical journal Pediatrics in 2008. HopeLab is now developing a new product called Zamzee, designed to measure and reward movement as a way to increase physical activity in tweens and prevent the long-term health consequences of sedentary behavior and childhood obesity. </p>\n\n<p>HopeLab was named one of Fast Company magazine&#8217;s 2009 Social Enterprises of the Year and has been recognized by President Barack Obama and the White House Office of Social Innovation and Civic Participation for its evidence-based, customer focused work to improve the health of young people. </p>\n\n<p>Christen previously held the position of President and Executive Director of the San Francisco AIDS Foundation for 15 years, where she worked with counterparts nationally to craft the federal Ryan White C.A.R.E. Act. Christen also served as President of the Pangaea Global AIDS Foundation, establishing AIDS clinics and playing an active role in AIDS-treatment efforts globally, including the construction of the Infectious Diseases Institute at Makarere University in Kampala, Uganda. </p>\n\n<p>Christen has written, studied and lectured on social and health issues both in the U.S. and abroad. She is a member of the Young Presidents&#8217; Organization and is a graduate of Stanford University, where she studied biology and earned a BA in political science, with Honors in Values, Technology and Society.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0009/5369/95369v2-max-150x150.jpg"],[[178,250],"assets/images/resized/0009/5369/95369v2-max-250x250.jpg"],[[321,450],"assets/images/resized/0009/5369/95369v2-max-450x450.jpg"]],"attribution":"<p>Liz Song / <a href=\"http://www.hopelab.org\" title=\"HopeLab\" rel=\"nofollow\">HopeLab</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"President & CEO","firm":{"name":"HopeLab","permalink":"hopelab","type_of_entity":"company","image":{"available_sizes":[[[150,72],"assets/images/resized/0009/5192/95192v2-max-150x150.jpg"],[[250,120],"assets/images/resized/0009/5192/95192v2-max-250x250.jpg"],[[360,173],"assets/images/resized/0009/5192/95192v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}