{"first_name":"Pat","last_name":"Hall","permalink":"pat-hall","crunchbase_url":"http://www.crunchbase.com/person/pat-hall","homepage_url":"http://pathalltranslations.com","birthplace":"Canada","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"spanish-translation, spanish-translator, french-translation","alias_list":null,"created_at":"Tue Aug 28 19:49:04 UTC 2012","updated_at":"Tue Sep 04 12:53:55 UTC 2012","overview":"<p>Pat Hall is a freelance Spanish/French to English translator based in Edmonton, Alberta, Canada, and she would like to offer her services to you.  Many people from Spanish- and French-speaking countries need to have their legal birth certificates, death certificates, marriage certificates, divorce certificates, police clearance statements, academic diplomas and certificates, college and university transcripts, legal &amp; medical documents, drivers licenses, etc. translated into English and notarized as a true and accurate translation.  </p>\n\n<p>She has many years of experience as a volunteer translator for the Edmonton Immigrant Services Association.  After translating for the Association for some time, she was promoted to proofreader and is now proofreading other translators’ work.</p>\n\n<p>After many successful years of teaching Spanish and French, Pat started her freelance translation business and is now an associate member of the Association of Translators and Interpreters of Alberta (affiliated with the Canadian Translators, Terminologists and Interpreters Council and with the International Federation of Translators).  </p>\n\n<p>Pat has translated documents from Spain, France, Quebec, Cuba, Mexico, Colombia, Peru, Chile, Ecuador, and many other countries.</p>\n\n<p>She has a B.A. in Spanish from a Mexican university and an M.A. in French, as well as a B.A. in modern languages from a Canadian university.  She has studied and worked in Mexico and Ecuador.  She has spent the last fourteen winters in Mexico and has been able to keep her Spanish fluent and current.  She also studied French in Paris, France.</p>\n\n<p>She has a Master’s degree in library and information science and, in light of her research skills, is able to easily adapt to research legal systems and formats in other countries.</p>\n\n<p>Pat Also offers private classes in Spanish.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://pathalltranslations.com","title":""}]}