{"first_name":"Patrick","last_name":"Osiegbu","permalink":"patrick-osiegbu","crunchbase_url":"http://www.crunchbase.com/person/patrick-osiegbu","homepage_url":"http://www.patrickosiegbu.com","birthplace":"Atlanta, Georgia","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Hangar Road International","born_year":null,"born_month":null,"born_day":null,"tag_list":"patrick-osiegbu, century-triple-7, hangar-road-international","alias_list":null,"created_at":"Wed Sep 05 07:29:50 UTC 2012","updated_at":"Tue Sep 18 20:54:35 UTC 2012","overview":"<p>Born in Atlanta Georgia, ambitious Patrick Osiegbu worked three different jobs to pay his way through college and graduated in the field of Accounting from Clark Atlanta University in 2005.  Shortly after that he moved to the UK where he worked at a prestigious investment bank in a premier managerial position.  Here he stayed for two years and gained vast experience in savings and investments, credit cards, loans and property insurance.  In 2007, equipped with this knowledge, Patrick went off on his own, to start a business with some partners.  This was the beginning of Century Triple 7 Investments Ltd.<br/>\nCentury Triple 7 Investments is an internationally focused property company with a strong commitment to customer service and gratification.  They can offer their clients a vast portfolio of properties tailored to suit any needs.  Consisting of a dedicated work force with experienced directors, Century Triple 7 Investments go the extra mile by providing property consultation, sales and brokerage and management for either investment or residential purposes.  They can also offer financing through their various partners and besides for sourcing the property deals, are able to get the best mortgage available through their brokers.  For investors from overseas, Century Triple 7 also has a large portfolio of properties outside the UK.  They can offer various deals ranging from cash back to 25% instant equity deals, allowing you to grow you portfolio while watching your investments flourish.  Century Triple 7 also has a devoted team that is committed to managing the property portfolios of their clients, alleviating the stress of maintenance.\nIn 2009 Patrick Osiegbu established Hangar Road International Ltd, a construction equipment leasing company, which he moved to Nigeria in 2010 due to acquired partnerships and successful expansion.\nAs well as managing a very busy career, Patrick also devotes time and resources to the many charity organisations that he supports.  He is passionate about educating the public about cause and prevention of heart disease and is a staunch supporter of the British Heart Foundation.  He also supports the NSPCC and cancer research institutes.</p>","image":null,"degrees":[{"degree_type":"BA","subject":"Accounting","institution":"Clark Atlanta University","graduated_year":2005,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Company Director","firm":{"name":"Century Triple 7","permalink":"century-triple-7","type_of_entity":"company","image":null}},{"is_past":true,"title":"Company Director","firm":{"name":"Hangar Road International","permalink":"hangar-road-international","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.visualcv.com/patrickosiegbu","title":"Patrick Osiegbu Visual CV profile"},{"external_url":"http://www.patrickosiegbu.co.uk","title":"Patrick Osiegbu - Wiki Page"},{"external_url":"http://patrickosiegbu.gather.com","title":"Patrick Osiegbu on Gather"},{"external_url":"http://bigsight.org/patrick_osiegbu","title":"Patrick Osiegbu on Bigsight"}],"web_presences":[]}