{"first_name":"Patrick","last_name":"Porter","permalink":"patrick-porter","crunchbase_url":"http://www.crunchbase.com/person/patrick-porter","homepage_url":"http://www.portervision.com","birthplace":"Battle Creek","twitter_username":"PorterVision","blog_url":"http://www.portervision.com/blog","blog_feed_url":"feed://www.portervision.com/blog/feed/","affiliation_name":"Unaffiliated","born_year":1961,"born_month":8,"born_day":10,"tag_list":"porter-vision, zen-frames, creative-visualization-relaxation, dr-patrick-k-porter","alias_list":null,"created_at":"Thu Nov 18 20:35:39 UTC 2010","updated_at":"Mon Nov 22 18:51:11 UTC 2010","overview":"<p>Patrick Kelly Porter, Ph.D., is an entrepreneur, award-winning author, and motivational speaker. </p>\n\n<p>He is the founder of the Positive Changes franchise network, which is headquartered in Virginia Beach, Virginia.</p>\n\n<p>Dr. Porter&#8217;s electrifying keynote speeches and seminars deliver the real life, nuts &#8216;n bolts concepts he used to take his business venture to astounding heights. He teaches entrepreneurs to think like business leaders. Corporate executives and sales professionals learn how to think like entrepreneurs.</p>\n\n<p>Dr. Porter has devoted his professional career to developing successful motivational and coaching methods to empower people and create lasting positive change in their lives. He has personally instructed more than 35,000 people in self-help, Neuro-Linguistic Programming and Psycho-Linguistics.</p>\n\n<p>He earned his doctorate degree in Psychology and Christian Counseling from Louisiana Baptist University in 1992. Dr. Porter performed forensic hypnosis for the Kentucky State Police from 1992 to 1996.</p>\n\n<p>He is author of the bestselling book, Awaken the Genius: Mind Technology for the Twenty-First Century, which was awarded &#8220;Best How-To Book of 1994&#8221; by the North American Bookdealers Exchange and has sold over 100,000 copies. Awaken the Genius is sold internationally and is translated into four languages. He is also the author of Discover the Lanaguage of the Mind. He co-authored Six Secrets of G.E.N.I.U.S., with his wife, Cynthia.</p>\n\n<p>Dr. Porter has produced an arsenal of over 200 audio-recorded motivational messages and creative visualization processes, and has sold over a million products worldwide.</p>\n\n<p>Dr. Porter is the host of the Positive Changes radio show on WNIS radio in Norfolk, Virginia, which has aired for ten consecutive years. Previously, Dr. Porter had his own television show called &#8220;Positive Changes&#8221; in Phoenix, Arizona. He wrote Hidden Solutions and Awaken the Genius programs for the Arizona Health Council.</p>\n\n<p>Dr. Porter and/or the Positive Changes franchise network have been featured in Entrepreneur, INC., The Wall Street Journal and Businessweek, as well as on ABC, NBC, CBS, the Discovery Channel and the Sally Jesse Raphael show.</p>","image":{"available_sizes":[[[150,147],"assets/images/resized/0011/0806/110806v4-max-150x150.png"],[[248,244],"assets/images/resized/0011/0806/110806v4-max-250x250.png"],[[248,244],"assets/images/resized/0011/0806/110806v4-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"PhD Doctorate","subject":"Psychology & Counseling","institution":"Louisiana Baptist University","graduated_year":1992,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/portervision","title":"PorterVision Twitter Page"},{"external_url":"http://www.portervision.com","title":"PorterVision Official Site"},{"external_url":"http://www.youtube.com/portervision","title":"PorterVision YouTube Channel"}]}