{"first_name":"Patrick","last_name":"Adams","permalink":"patrick-adams","crunchbase_url":"http://www.crunchbase.com/person/patrick-adams","homepage_url":"http://www.victoriassecret.com","birthplace":"United States","twitter_username":"PAdamsNY","blog_url":"","blog_feed_url":"","affiliation_name":"Victoria's Secret","born_year":null,"born_month":null,"born_day":null,"tag_list":"cmo-chiefmarketingofficer-mcommerce-mobilemarketing-strategy-branddevelopment-commerce-ecommerce-socialengagement","alias_list":null,"created_at":"Sun Nov 18 16:28:07 UTC 2012","updated_at":"Sun Nov 25 20:49:54 UTC 2012","overview":"<p>Over the past 20 years Patrick has led world-class marketing teams with such well-known brands as CHASE, CITIGROUP, BMG Music, CDNOW, COLUMBIA HOUSE, BERTELSMANN MEDIA WORLDWIDE and VICTORIA’S SECRET.</p>\n\n<p>Widely recognized in his field and by his colleagues as one of the top digital marketing executives in the business, Patrick is known for creating high performance marketing organizations.  Under his leadership, these teams deliver outstanding digital marketing strategies that drive profitability via the creation of multi-layered customer engagement and acquisition initiatives.</p>\n\n<p>Patrick is a customer advocate who continuously seeks out new and improved ways in which to exceed customer needs while at the same time creating an immersive and always-relevant customer shopping experience.  He is a traditionally trained marketing professional who has a deep understanding of direct response, digital marketing, brand management and talent development.</p>\n\n<p>Currently, Patrick is Head of Direct Marketing at Victoria’s Secret. In this role, he leads all omni-channel (web, catalog, email, mobile, social) acquisition and customer marketing initiatives for the world’s leading specialty retailer of lingerie, apparel, shoes, accessories and beauty products.</p>\n\n<p>In addition to his role at Victoria’s Secret, Patrick is the Founder / CEO / Chief Marketing Officer at NEW MEDIA DIRECT (NMD), LLC. NMD is a boutique Digital Marketing Agency that is fueled by traditional Direct Response, Usability, Web Analytics, eCRM, mobile engagement and the latest techniques / technologies available to deliver enhanced customer experience and immersive customer engagement layers.</p>\n\n<p>Patrick holds an M.B.A. in Marketing and has attended Harvard University’s Executive Education program. He is also a member of several Advisory Boards including DMA’s Multi-Channel Marketing Council, DMA’s Social Media Council as well as The CMO Council. He is also a member of The CMO Club, Internet Strategy Forum, and M.E.N.G. (Marketing Executive Networking Group)</p>\n\n<p>Find Patrick on LinkedIn, Google+, FourSquare, Twitter, Facebook, Instagram, Pinterest, Flickr @PAdamsNY</p>\n\n<p>Specialties: Customer Engagement, Customer Experience, Immersive Shopping Experiences, Brand Development &amp; Management, Interactive Direct Response, Direct Response, eCommerce, CRM, eCRM, Customer Care / Advocate, Strategic Development, Strategic Planning, Cross-Channel and Multi-Channel Marketing, Migration of Business to Online, Executive and Staff Development, New Business Development, New Media, Digital, mCommerce, Mobile, Social Media, Texting, Peer-to Peer, Research, Retail, Music, Movies, Books, eBooks, Entertainment, Retail, Continuity, Membership, Club, Mentor, P&amp;L Management.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0022/0907/220907v2-max-150x150.jpg"],[[161,240],"assets/images/resized/0022/0907/220907v2-max-250x250.jpg"],[[161,240],"assets/images/resized/0022/0907/220907v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Executive Education","subject":"Business","institution":"Harvard Business School","graduated_year":2005,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"Business","institution":"Adelphi University","graduated_year":1986,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"SVP, Head Of Direct Marketing","firm":{"name":"Victoria's Secret","permalink":"victoria-secret","type_of_entity":"company","image":{"available_sizes":[[[150,22],"assets/images/resized/0006/4894/64894v1-max-150x150.jpg"],[[250,37],"assets/images/resized/0006/4894/64894v1-max-250x250.jpg"],[[292,44],"assets/images/resized/0006/4894/64894v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"SVP, Head Of Marketing","firm":{"name":"Bertelsmann Direct","permalink":"bertelsmann-direct","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.victoriassecret.com","title":"Victoria's secret"}],"web_presences":[{"external_url":"http://www.linkedin.com/in/patrickadams","title":"LinkedIn"},{"external_url":"http://www.twitter.com/padamsny","title":"Twitter"}]}