{"first_name":"Patrick","last_name":"Lefler","permalink":"patrick-lefler","crunchbase_url":"http://www.crunchbase.com/person/patrick-lefler","homepage_url":"http://www.spruancegroup.com","birthplace":"Los Angeles, CA","twitter_username":"PatLefler","blog_url":"http://www.spruancegroup.com/blog","blog_feed_url":"","affiliation_name":"The Spruance Group","born_year":1957,"born_month":8,"born_day":20,"tag_list":"","alias_list":null,"created_at":"Sat Aug 28 00:57:31 UTC 2010","updated_at":"Fri Sep 03 22:19:15 UTC 2010","overview":"<p>I am the founder of The Spruance Group - a management consultancy that helps growing companies grow faster by offering unbiased advice and providing unique solutions to our clients most pressing product strategy needs. We leverage our extensive industry expertise to advance your product positioning, marketing, pricing, and innovation initiatives and drive them to market. Our mission is to accelerate bottom line growth for our clients. </p>\n\n<p>Most everything I’ve learned in business has come out of the three major experiences in my life. My leadership expertise comes from working side-by-side and leading some really outstanding men and women while serving as a officer and pilot in the United States Marine Corps. My critical thinking and analytic reasoning skills come from my experience as a bond trader for Goldman, Sachs &amp; Co. And my sales and marketing knowledge comes from my near decade-long experience with the software firm, Wall Street Systems - a Warburg Pincus portfolio company.  </p>\n\n<p>I&#8217;m very fortunate to have had exceptional education opportunities. I studied engineering at the United States Naval Academy and graduated in 1980. I also attended The Wharton School of the University of Pennsylvania and graduated with an M.B.A. in 1988.</p>\n\n<p>  In between these experiences, I’ve run a number of different marathons including four Boston Marathon finishes and have climbed a number of high peaks in both North and South America. </p>\n\n<p>  I support three important causes. Locally, I support the Somerset Hills Education Foundation which provides education support to our local schools. I also support the Appalachian Mountain Club which helps protect the mountains, forests, waters, and trails of the Appalachian region.   </p>\n\n<p>Most important, I support the Injured Marine Semper Fi Fund which provides immediate financial support to our wounded Marines during their hospitalization, recovery and rehabilitation.</p>","image":null,"degrees":[{"degree_type":"B.S.","subject":"Engineering","institution":"U.S. Naval Academy","graduated_year":1980,"graduated_month":null,"graduated_day":null},{"degree_type":"M.B.A.","subject":"FInnce","institution":"The Wharton School of the University of Pennsylvania","graduated_year":1988,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Principal","firm":{"name":"The Spruance Group","permalink":"the-spruance-group","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}