{"first_name":"Patrick","last_name":"Tucker","permalink":"patrick-tucker","crunchbase_url":"http://www.crunchbase.com/person/patrick-tucker","homepage_url":"http://www.wfs.org","birthplace":"United States","twitter_username":"theyear2030","blog_url":"http://www.wfs.org/blog/91","blog_feed_url":"http://www.wfs.org/blog/91/feed","affiliation_name":"Futurists: BetaLaunch","born_year":null,"born_month":null,"born_day":null,"tag_list":"futurist, future, tech, journalism, science, prediction","alias_list":null,"created_at":"Fri Aug 17 19:17:40 UTC 2012","updated_at":"Mon Aug 20 00:40:26 UTC 2012","overview":"<p>Patrick Tucker is the deputy editor of THE FUTURIST magazine and content director for wfs.org. He has written prodigiously on the topics of AI and AGI, information technology, cybernetics, nanotechnology, genetics and genetic ethics, invention, climate change and climate change mitigation, demography, and neuroscience and his writing has appeared in various publications and on many sites, including THE FUTURIST magazine, The Wilson Quarterly, Encyclopedia Britannica online, the Utne Reader, and the Discovery Channel.</p>\n\n<p>As a science journalist and editor, he&#8217;s interviewed such technologists, policy experts, and visionaries as MIT roboticist Rodney Brooks, Google research director Peter Norvig, military strategist Edward N. Luttwak, former U.S. House Speaker Newt Gingrich, Rep. Dennis Kucinich, former CIA director Robert James Woolsey, tech guru Tim O&#8217;Reilly, environmentalist Lester Brown, flying-car-creator Paul Moller, and inventor Ray Kurzweil on various topics related to technology and innovation.</p>\n\n<p>He also serves as the director of communications for the World Future Society and have been quoted as a futurist in The Washington Post, The Chicago Tribune, The Globe and Mail, The Christian Science Monitor, Elle Canada, Wired.com, Smart Money.com, Voice of America, and has been a guest on such networks and programs as WTOP in Washington, the Dave Rutherford Show (770 CHQR Canada) The World Today and the Christy Clark show (980 CKNW Canada), the Joan Hamburg show (710 WOR New York), Russia Today, CBS Sunday Morning with Charles Osgood, and Science Fantastic with Michio Kaku.</p>\n\n<p>Patrick is also the founder of Futurists: BetaLaunch, an invention and idea showcase that focuses on start ups with the potential for massive social good and / or high impact within ten years.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0020/6774/206774v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0020/6774/206774v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0020/6774/206774v2-max-450x450.jpg"]],"attribution":"<p>Patrick Tucker</p>"},"degrees":[{"degree_type":"Master's","subject":"Writing","institution":"Johns Hopkins University","graduated_year":2005,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Futurists: BetaLaunch","permalink":"futurists-betalaunch","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}