{"first_name":"Patrick","last_name":"F. Sullivan","permalink":"patrick-f-sullivan","crunchbase_url":"http://www.crunchbase.com/person/patrick-f-sullivan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"RightsFlow","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Mar 16 00:37:33 UTC 2009","updated_at":"Sat Apr 07 18:40:11 UTC 2012","overview":"<p>Patrick Sullivan is a leading expert in the field of intellectual property and copyright management for both physical and digital media and is the cofounder, President and CEO of RightsFlow. He has been at the forefront of many pivotal industry issues that have helped define and shape the current market for music in a digital era. Patrick’s extensive experience in industry negotiations,  licensing and royalty payments, digital content management and distribution as well as legislative and legal affairs makes him a frequent lecturer at corporations,  universities, and conferences around the world about intellectual property and copyright.  He has been a past presenter at the 2009 World Copyright Summit, NARM, AIMP, Leadership Music Digital Summit, Popkomm, and Digital Music Forum East and West. </p>\n\n<p>Patrick’s firm belief that creators should be paid for the use of their work and his understanding  of the complexities surrounding U.S. copyright compliance lead him to cofound RightsFlow in 2007. Together with his cofounder, he helped pioneer a service that offers a single, cost-­‐effective channel through which rights-­‐holders and companies that sell or distribute music can connect, ensuring proper licensing, accurate accounting and timely payment of royalties. Today, RightsFlow is one of the leading companies helping businesses, artists, distributors and labels solve the complex issues of copyright compliance and royalty payment as new methods of consuming music emerge. The company’s proprietary licensing, accounting and royalty payment technology makes it easy for businesses selling or distributing music in a digitally enabled market to be compliant with U.S. copyright laws. RightsFlow also ensures that artists, songwriters and publishers are paid for the use of their music and provides them with an unprecedented  level of data transparency.  </p>\n\n<p>Before founding RightsFlow, Patrick served as a dual Vice-­‐President of Licensing, Royalties and Music Services for both The Orchard Enterprises, Inc. (NasdaqGM: ORCD) &amp; eMusic.  Prior to The Orchard, he was a Strategic Licensing Consultant for Selverne, Mandelbaum,  &amp; Mintz, a New York-­‐based  Entertainment  Law Firm. From 1999-­‐2004  he served as the Director of Research and Development  at the National Music Publisher’s Association/Harry Fox Agency (HFA), where he managed industry negotiations,  internal corporate policy matters, new media, and public relations for the member organization.  </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder & CEO","firm":{"name":"RightsFlow","permalink":"rightsflow","type_of_entity":"company","image":{"available_sizes":[[[150,16],"assets/images/resized/0003/9912/39912v2-max-150x150.jpg"],[[250,28],"assets/images/resized/0003/9912/39912v2-max-250x250.jpg"],[[450,50],"assets/images/resized/0003/9912/39912v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"<iframe width=\"450\" height=\"259\" src=\"http://www.youtube.com/embed/-fOghJb6AbM\" frameborder=\"0\" allowfullscreen></iframe>","description":"<p>Patrick Sullivan, Reuters interview</p>"}],"external_links":[],"web_presences":[]}