{"first_name":"Patrick","last_name":"Pun","permalink":"patrick-pun","crunchbase_url":"http://www.crunchbase.com/person/patrick-pun","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Aug 04 21:02:51 UTC 2008","updated_at":"Mon Aug 04 21:08:10 UTC 2008","overview":"<p>Headquartered in Shanghai, P.R. China, Patrick is responsible for managing business development, strategy formulation and execution, and organization /strategic alliance building for portfolio companies of <a href=\"http://www.crunchbase.com/financial-organization/monster-venture-partners\" title=\"Monster Venture Partners\">Monster Venture Partners</a> in Asia Pacific region. Prior MVP, Patrick was the General Manager, Greater China of Global Market Insite Inc. (GMI). During his time with GMI, he has successfully brought GMI into Greater China region, built up the organization and business network, developed/localized company products &amp; services, and gained the market leadership position in the online research sector in Greater China region (Mainland China, Hong Kong, and Taiwan). Patrick brings to MVP fifteen years of experience with several multi-national FMCG companies, where he successfully turned around their Chinese business units. He worked with Asia Brewery, Heineken, Jardine Caldbecks (a joint venture of LVMH and Bacardi Martini), and TW Group, in organization establishment/management, business development, market research, and brand building. Before he entered the FMCG arena, he worked with Shanghai Film Studios, Hong Kong Trade Development Council, and Daily Chance Advertising Ltd.</p>\n\n<p>Originally from Shanghai, China, Patrick has lived and worked in Mainland China, Hong Kong, and Canada. Patrick received a Bachelor of Arts degree from the Shanghai Theater Academy, China, and a Master of Business Management degree from University of Calgary, Canada.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder and CEO","firm":{"name":"NCG","permalink":"ncg","type_of_entity":"company","image":null}},{"is_past":false,"title":"Venture Partner & Executive Vice President, Asia Pacific","firm":{"name":"Monster Venture Partners","permalink":"monster-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,39],"assets/images/resized/0002/3304/23304v1-max-150x150.png"],[[250,65],"assets/images/resized/0002/3304/23304v1-max-250x250.png"],[[353,92],"assets/images/resized/0002/3304/23304v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}