{"first_name":"Patrick","last_name":"Lortie","permalink":"patrick-lortie","crunchbase_url":"http://www.crunchbase.com/person/patrick-lortie","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"The Radio Station","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Oct 22 12:54:24 UTC 2012","updated_at":"Fri Nov 30 23:46:02 UTC 2012","overview":"<p>The one referred to with affection as “The Boss”, Patrick Lortie is the founding father of The Radio Station and is often been related to terms such as “ambitious”, “visionary”, and “charismatic”.</p>\n\n<p>The Montreal, Quebec native comes from the Québecois culture yet was granted an English education. The Chomedey, Laval, Quebec neighborhood got him surrounded by Italians and Greeks, thus molding his rather boisterous personality.</p>\n\n<p>Lortie relies heavily on the TRS community, often calling them “the backbone and main reason why The Radio Station thrives”. In an interview with Spreaker, he states “I consider myself extremely lucky to be surrounded by such amazing and professional individuals who put out fantastic shows every day of the week.” and now with an ever growing administrative team, he now has the ability to tackle different fields enabling The Radio Station to grow to even larger proportions.</p>\n\n<p>Not one to shy away from the spotlight, he also embraces his weekly appearance on The Boss Show. Oftentimes revolving around rock and it’s subsequent sub-genres, “The Boss” also travels the Montreal region in search for up and coming indie artists from all lights and shades. The result is exclusive interviews and insights from the artists and often leads to concert coverages and exclusive video and photography work done by an extremely talented and dedicated production team.</p>\n\n<p>Obsessed with the work of Jimmy Page and a mind open enough to discover all the variations that music can offer, Patrick Lortie is to be filed under “Music-a-holic”. Whether he crafts the guitar or analyses baseball with a scientific eye, the man behind the organization is always planning his next move. He “lives life like a game of chess. Except in this game, I don’t play to win. Winning signifies the end of a cycle and personal achievement. I break the rules in order to pave the way so everyone around me succeeds every day. Because in chess, one piece cannot win on its own.”</p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0022/2703/222703v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0022/2703/222703v2-max-250x250.jpg"],[[450,300],"assets/images/resized/0022/2703/222703v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder & CEO","firm":{"name":"The Radio Station","permalink":"the-radio-station","type_of_entity":"company","image":{"available_sizes":[[[150,112],"assets/images/resized/0021/6605/216605v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0021/6605/216605v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0021/6605/216605v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[{"description":"Launched The Radio Station","stoned_year":2012,"stoned_month":4,"stoned_day":25,"source_url":"http://www.theradiostation.blog.com","source_text":null,"source_description":"Offical Website","stoneable_type":"Person","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"first_name":"Patrick","last_name":"Lortie","permalink":"patrick-lortie"}}],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/patlortie","title":"Twitter Page"},{"external_url":"http://www.linkedin.com/profile/view?id=180354532&trk=tab_pro","title":"LinkedIn Public Profile"}]}