{"first_name":"Patrick","last_name":"Teng","permalink":"patrick-teng","crunchbase_url":"http://www.crunchbase.com/person/patrick-teng","homepage_url":"http://startsenden.com","birthplace":"","twitter_username":"patrickteng","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1983,"born_month":9,"born_day":2,"tag_list":"","alias_list":null,"created_at":"Fri Jul 29 00:04:32 UTC 2011","updated_at":"Wed Aug 03 22:13:25 UTC 2011","overview":"<p>Patrick is President and co-founder of Senden, an online deals marketplace, that he started in May 2011 with Kenji Kaneko. Patrick leads Senden’s product development activities and is active in business decisions.</p>\n\n<p>Prior to Senden, Patrick has worked at numerous startups. He started with Waterfall Mobile in 2005. While at Waterfall Mobile, he was responsible for the design, documentation, and development of the public API for their flagship product, Msgme. Furthermore, he created an SMS framework for their client services team, which as allowed the company to respond to custom client requests. The APIs and framework are used by clients such as Ubisoft, Anheuser Busch, PETA, and others. </p>\n\n<p>Second, Patrick integrated East Bay Municipal Utility District&#8217;s real time water meters into a web platform for their customers. It allowed their customers to monitor their water usage in real time, get alerts when the customer is over his/her usage limits, and he developed algorithms to intelligently alert the home owner of any water leaks. The system has been presented at numerous national water utilities conferences as the model for water conservation platforms.</p>\n\n<p>Lastly, Patrick worked at Driverside Inc., where he created their ETL framework to import inventory from two major American automotive manufacturers and their parts distributors, and list them in online marketplaces.</p>\n\n<p>Patrick graduated with a B.A. in History from the University of California, Davis.</p>","image":{"available_sizes":[[[100,135],"assets/images/resized/0014/7505/147505v2-max-150x150.jpg"],[[100,135],"assets/images/resized/0014/7505/147505v2-max-250x250.jpg"],[[100,135],"assets/images/resized/0014/7505/147505v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.A.","subject":"History","institution":"University Of California, Davis","graduated_year":2006,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}