{"first_name":"Patrick","last_name":"Smith","permalink":"patrick-smith-3","crunchbase_url":"http://www.crunchbase.com/person/patrick-smith-3","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Feb 19 20:36:53 UTC 2012","updated_at":"Sun Feb 19 20:39:34 UTC 2012","overview":"<p>Patrick has spent the last 15 years driving profitability in software and high tech sectors with most recent effort running a business unit as a Group Vice President for Digital River, the world leader in outsourced e-commerce (NASDAQ: DRIV).</p>\n\n<p>Prior to Digital River, Patrick was a member of the Executive Team of MindVision Software and eSellerate focused on revenue growth, client satisfaction, and operations. By applying a proven ability to install sales and revenue growth discipline into technology cultures while maintaining balance between leading edge technology and profitable revenue growth, Patrick was able to grow sales in excess of $80M and ultimately lead the post-acquisition team after the sale of these companies.</p>\n\n<p>Since graduating from the University of Nebraska – Lincoln with a BS B.A. in 1993, Patrick has participated at the executive levels of start-up technology companies and divisions within existing companies like First National Nebraska Inc and First Commerce Technologies, as well VC backed start-ups like eScout, LLC, a provider of B2B marketplace and hosted procurement services.</p>\n\n<p>He is an engaging leader who truly enjoys working to inspire people and growing high quality teams in all areas of a company. He and his wife, Brenna, have lived in Lincoln for 20 years and have three great kids. He enjoys spending time with his family, coaches various youth sports, and tries to save some time for college football and golf as time permits.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0017/4943/174943v1-max-150x150.jpg"],[[250,250],"assets/images/resized/0017/4943/174943v1-max-250x250.jpg"],[[400,400],"assets/images/resized/0017/4943/174943v1-max-450x450.jpg"]],"attribution":"<p>Nebraska Global Management Team</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Principal & COO","firm":{"name":"Nebraska Global","permalink":"nebraska-global","type_of_entity":"financial_org","image":{"available_sizes":[[[150,51],"assets/images/resized/0017/4941/174941v1-max-150x150.jpg"],[[250,86],"assets/images/resized/0017/4941/174941v1-max-250x250.jpg"],[[252,87],"assets/images/resized/0017/4941/174941v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}