{"first_name":"Patrick","last_name":"Coulson","permalink":"patrick-coulsen","crunchbase_url":"http://www.crunchbase.com/person/patrick-coulsen","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Sportgenic","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Mar 04 18:39:12 UTC 2008","updated_at":"Fri Jun 12 20:59:04 UTC 2009","overview":"<p>Patrick is the CTO and oversees all technology development at Sportgenic. He leads the direction, strategy and development of the platform and all other technology that the company builds for our publishers and advertisers. Prior to Sportgenic, Pat was founder, CEO and president of GolfBuzz, Inc., developers of innovative publishing tools and technologies dedicated to the golf community. The company was acquired by Sportgenic in late 2007 to extend the GolfBuzz technology across all of its sports channels, enabling publishers and brands to more easily connect their audience with other like-minded people, desirable information on their passion, and associated products and services.</p>\n\n<p>In addition to GolfBuzz, Patrick worked as a software consultant for Home Depot. His past career experience includes time at Silicon Graphics, Cisco Systems and Apple Computer. He was also the CTO of PureCarbon, his first start-up which he founded in June 1999. Before being sold in 2002, PureCarbon focused on providing Human Resources solutions to Corporate 1000 clients and was the winner of the 2001 HR Executive Magazine&#8217;s Product of the Year for its JobPlanet software. Patrick graduated from California Polytechnic State University, San Luis Obispo with a degree in Computer Engineering. Patrick recently moved back to the West Coast from Atlanta and is currently living in the Bay Area. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CTO","firm":{"name":"Sportgenic","permalink":"sportgenic","type_of_entity":"company","image":{"available_sizes":[[[150,37],"assets/images/resized/0001/4428/14428v5-max-150x150.jpg"],[[250,62],"assets/images/resized/0001/4428/14428v5-max-250x250.jpg"],[[285,71],"assets/images/resized/0001/4428/14428v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}