{"first_name":"Patrick","last_name":"Grady","permalink":"patrick-grady-2","crunchbase_url":"http://www.crunchbase.com/person/patrick-grady-2","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Apr 22 06:35:50 UTC 2008","updated_at":"Thu May 17 17:20:06 UTC 2012","overview":"<p>Patrick Grady is the founder, CEO and chairman of Rearden Commerce. Since the company&#8217;s inception, Grady has led Rearden Commerce with a singular vision: to provide the world with a Personal Internet Assistant for work and life that makes people wonder how they ever lived without it. To do this, he created the Rearden Commerce Platform, which connects an ecosystem of partners, more than 160,000 suppliers, and millions of users via the company&#8217;s flagship product, the Rearden Personal Assistant.</p>\n\n<p>Grady&#8217;s tireless efforts to broaden the Rearden Commerce Platform led to the acquisition of ExpenseWire, the leading on-demand expense management solution, and Global Ground Automation (GGA), the leader in ground transportation reservation automation. Additionally, Grady has spearheaded large-scale strategic agreements with industry leaders such as American Express, JP Morgan Chase, Paychex and others.</p>\n\n<p>Under Grady&#8217;s leadership, the Rearden Personal Assistant has received high recognition. It was named a &#8220;Cool Vendor&#8221; by Gartner Research in 2008; included on Business 2.0 Magazine&#8217;s 2007 Next Net 25; considered a 2008 MobileBeat top 30 product; and was selected as a 2009 Firestarter by Strategic News Service. Today, thanks to Grady&#8217;s drive, more than 2.5 million customers at more than 5,000 companies rely on the Rearden Personal Assistant.</p>\n\n<p>Grady guides the company&#8217;s product and technology vision. An evangelist for the next generation Web, Grady is a sought after speaker with engagements at many events, including ACTE Executive Forum, AjaxWorld, AlwaysOn, Burton Catalyst, CSFB Disruptive Technology Conference, Future In Review (FiRe), InfoWorld Symposium, Internet World, PC Forum, the PhoCusWright Executive Conference, Red Herring, and Supernova.</p>\n\n<p>In 2006 and 2008, Business Travel News recognized Grady as one of the top 25 most influential people in the travel industry. In addition, Fast Company magazine named Grady to its &#8220;Fast 50&#8221; in 2006, Infoworld considered him a &#8220;Top 100 Technology Innovator&#8221; in 2002, and Supply &amp; Demand Chain Magazine dubbed Grady one of the 2007, 2008 and 2009&#8217;s &#8220;Pros to Know&#8221;.</p>\n\n<p>Prior to founding Rearden Commerce, Grady spent 10 years in various venture capital and leadership roles in the technology sector.</p>","image":{"available_sizes":[[[97,150],"assets/images/resized/0008/1951/81951v2-max-150x150.jpg"],[[163,250],"assets/images/resized/0008/1951/81951v2-max-250x250.jpg"],[[177,271],"assets/images/resized/0008/1951/81951v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Rearden Commerce","permalink":"reardencommerce","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0000/2779/2779v5-max-150x150.jpg"],[[250,80],"assets/images/resized/0000/2779/2779v5-max-250x250.jpg"],[[450,144],"assets/images/resized/0000/2779/2779v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}