{"first_name":"Patrick","last_name":"Burns","permalink":"patrick-burns","crunchbase_url":"http://www.crunchbase.com/person/patrick-burns","homepage_url":"http://arc3communications.com/","birthplace":"Atlanta ","twitter_username":"PatrickLBurns","blog_url":"http://arc3communications.com/blog/","blog_feed_url":"http://arc3communications.com/feed/","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"politics, technology, media-relations, interactive-marketing, public-affairs, government-relations, crisis-communications, grassroots-mobilization, social-media","alias_list":null,"created_at":"Tue May 15 01:31:47 UTC 2012","updated_at":"Sat Jun 02 00:42:47 UTC 2012","overview":"<p>Patrick Burns is founder and President of Arc 3 Communications, a full service agency specializing in public relations, interactive media and public affairs.  </p>\n\n<p>With over 20 years’ experience in the world of media and public affairs, Patrick  provides the strategic counsel and organizational expertise that has led numerous businesses, associations, elected officials and candidates across the Southeast to utilize him as a trusted resource on complex public policy issues, the evolving media and integrated public relations campaigns. Patrick&#8217;s strong relationships and experience have resulted in legislative, regulatory, and electoral successes at local, state, and federal levels as well as hundreds of millions of earned media impressions for clients.  An expert in crisis communications, he has protected the reputation of hundreds of companies and organizations in today’s dynamic news cycle. </p>\n\n<p>An Atlanta native, Patrick began his career as a volunteer for state and national campaigns in Georgia before securing his first paid position with the campaign of Congressman Newt Gingrich. After a bruising election cycle with Gingrich, Patrick joined his Congressional Staff, serving as a key advisor through Gingrich&#8217;s rise from House Minority Whip to Speaker of the House.  </p>\n\n<p>Upon completion of his service to Speaker Gingrich, Patrick served as a Research Associate at the A.L. Burruss Institute of Public Service at Kennesaw State University where he managed integrated public policy and education projects for public agencies and non-profits such as the U.S. Army Corps of Engineers, the U.S. Environmental Protection Agency and the Pew Charitable Trusts. He also conducted training programs for hundreds of elected officials and political candidates in ethics at the local and State level.  While at the Burruss Institute he served as resource for local and state media appearing on local television and radio programs and editorial pages across the Southeast.  </p>\n\n<p>Patrick completed his Bachelor of Arts degree in History and Political Science, Cum Laude, at Clemson University and earned a Master of Arts degree in Political Science from Georgia State University.  He is a lifelong learner and a frequent participant in continuing education on future media technologies. </p>\n\n<p>Patrick is immediate past Chairman of the U.S. Chamber of Commerce Southeast Public Affairs Working Group and a member of the Cobb Chamber of Commerce and Georgia Chamber of Commerce. He is also a member of the Knights of Columbus, the Public Relations Society of America, Georgia Chapter and the Social Media Club of Atlanta.</p>\n\n<p>He is an award winning public relations professional, having received numerous PRSA Georgia Chapter Awards for Issues Management, Media Relations, Radio PSA’s; and Marketing.  </p>\n\n<p>He currently resides in Marietta, Ga. with his wife and three children. </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0019/3008/193008v2-max-150x150.png"],[[129,192],"assets/images/resized/0019/3008/193008v2-max-250x250.png"],[[129,192],"assets/images/resized/0019/3008/193008v2-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"Bachelor of Arts ","subject":"History and Political Science ","institution":"Clemson University ","graduated_year":1992,"graduated_month":null,"graduated_day":null},{"degree_type":"Master of Arts ","subject":"Political Science ","institution":"Georgia State University ","graduated_year":2006,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder and President ","firm":{"name":"Arc 3 Communications ","permalink":"arc-3-communications","type_of_entity":"company","image":{"available_sizes":[[[150,26],"assets/images/resized/0019/3009/193009v3-max-150x150.png"],[[250,44],"assets/images/resized/0019/3009/193009v3-max-250x250.png"],[[450,80],"assets/images/resized/0019/3009/193009v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://twitter.com/#!/PatrickLBurns","title":""},{"external_url":"http://www.facebook.com/patrick.l.burns","title":""},{"external_url":"http://www.linkedin.com/in/patricklburns","title":""},{"external_url":"http://about.me/patricklburns.","title":""},{"external_url":"https://plus.google.com/u/0/103796031267794421847#103796031267794421847/posts","title":""},{"external_url":"http://www.quora.com/Patrick-L-Burns","title":""}]}