{"first_name":"Patricia","last_name":"Dao","permalink":"patricia-dao-2","crunchbase_url":"http://www.crunchbase.com/person/patricia-dao-2","homepage_url":"","birthplace":"Los Angeles","twitter_username":"pattydao","blog_url":"","blog_feed_url":"","affiliation_name":"VoxBloc","born_year":1980,"born_month":12,"born_day":30,"tag_list":"entrepreneur, business-development, mobile-crm, online-platforms, operations","alias_list":null,"created_at":"Tue Dec 20 19:28:31 UTC 2011","updated_at":"Wed Dec 21 10:51:59 UTC 2011","overview":"<p>Patricia Dao has an extensive background within the technology start-up industry, specifically within social networks, customer relationship management systems (CRM), and social software as a service (SAAS) platforms. Patricia has held pivotal businesses, operational and product development roles at 3 successful start-ups, including Flux.com (purchased by Viacom), Mozes Mobile Marketing and CRM, and VoxBloc.com (co-founder/acquired by Dominion Enterprises). She has lead these technology companies to deals with major accounts such as Red Bull North America, Nike, Ford, Universal, Warner, Sony and many more. Patricia is an industry leader and well respected by colleagues and clients. She also currently serves and volunteers as the Los Angeles, Managing Director for the non-profit global organization Girls in Tech. </p>\n\n<p>Over the last 9 years, Patricia has successfully demonstrated her ability to uncover and deliver solutions for social and mobile technology needs within the brand and entertainment markets. She has utilized mobile technologies such as QR Codes, Mobile optimized websites, iPhone/Andriod applications and SMS to drive location based offline mobile solutions for her clients. Patricia has spearheaded client relationships with major companies such as Red Bull North America to understand and present technology powered solutions for their mobile marketing and CRM needs. As Director of Business Development and Client services for Mozes, she designed and launched Red Bull&#8217;s first mobile marketing solution across all major U.S Red Bull Business Units. Within 2 years, Patricia launched hundreds of mobile marketing programs at offsite events and retail stores such as 7eleven, Circle K, Safeway and more. These initiatives resulted in exponentially increasing their consumer mobile database by 60x, driving engagement between Red Bull and consumer offline and impacting overall sales. </p>\n\n<p>Additionally, she worked closely with the Mozes product team to build quarterly product roadmaps to ensure all customer needs are prioritized and implemented into a unified scalable platform. Patricia has also lead CRM integrations between Mozes and client ECRM vendors (such as Exact Target and Silverpop) to ensure all data collected via mobile was aggregated into the client&#8217;s overall customer database, resulting in increased efficiency in targeting consumers and driving repeat sales. </p>\n\n<p>As Co-Founder of VoxBloc.com Patricia oversees operations, customer acquisition and the product roadmap. Her past experience within social networks and mobile marketing/CRM, has provided her with a deep understanding for consumer social behavior via online and mobile. Specifically, how technology can exponentially increase sales by generating viral awareness and overall meaningful conversations between a brand and consumers. Based on this knowledge, she has seen that incentivizing consumers through rewards and gamification increases social loyalty and repeat impressions. As a result, VoxBloc encompasses the next evolution of social SAAS solution for businesses striving for long-term social engagement with their consumers. VoxBloc was acquired by Dominion Enterprises in Dec. 2011. As part of the acquisition Patricia has joined Dominion Enterprises, launching a new division, Dominion Social Ventures which VoxBloc will be apart.  </p>\n\n<p>Patricia is actively involved in the technology start-up community in Los Angeles. As Managing Director of Girls in Tech, she is currently developing a K-12 grade mentorship programs for GIT members to help educate girls about the power of technology and expose them to entrepreneurial opportunities they may not have been otherwise exposed to in school. Patricia also develops networking events in Los Angeles, focused on empowering women in technology. </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0016/7122/167122v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0016/7122/167122v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0016/7122/167122v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.A.","subject":"Economics","institution":"University of California, San Diego","graduated_year":2003,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Co-Founder","firm":{"name":"VoxBloc","permalink":"voxbloc","type_of_entity":"company","image":{"available_sizes":[[[150,81],"assets/images/resized/0016/0300/160300v2-max-150x150.jpg"],[[176,96],"assets/images/resized/0016/0300/160300v2-max-250x250.jpg"],[[176,96],"assets/images/resized/0016/0300/160300v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"VoxBloc Co-Founder/Dominion Social Stategist","firm":{"name":"Dominion Enterprises","permalink":"dominion-enterprises","type_of_entity":"company","image":{"available_sizes":[[[150,33],"assets/images/resized/0015/7649/157649v1-max-150x150.jpg"],[[250,55],"assets/images/resized/0015/7649/157649v1-max-250x250.jpg"],[[279,62],"assets/images/resized/0015/7649/157649v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.prweb.com/releases/2011/12/prweb9038874.htm","title":"VoxBloc Acquisition "},{"external_url":"http://www.women2.org/2011-female-startup-founder-successes/","title":"2011 Success Female Founders"},{"external_url":"http://www.women2.org/building-the-voxbloc-platform-for-brands-across-social-networks/","title":"Women 2.0 VoxBloc Article"}],"web_presences":[{"external_url":"http://www.twitter.com/pattydao","title":"Patty's Twitter"},{"external_url":"http://www.linkedin.com/in/patriciadao","title":"Patty's Linkedin"}]}