{"first_name":"Patrick","last_name":"Page","permalink":"patrick-page","crunchbase_url":"http://www.crunchbase.com/person/patrick-page","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 09 09:51:56 UTC 2009","updated_at":"Tue Jun 09 09:59:48 UTC 2009","overview":"<p>Patrick Page holds a MSc in Biochemistry and a Ph.D. in Chemistry from the University Paul Sabatier (Toulouse, 1995). He then did a post-doctoral research fellowship with Prof. Ari Koskinen (University of Oulu, Finland) on MMP inhibitors based on peptide-mimetic backbones. He subsequently completed his education in the laboratory of Prof. Mark Bradley (University of Southampton, UK) in the emerging field of combinatorial chemistry working on various methodologies including libraries generation of polyamine conjugates and oligo-peptide inhibitors of serine-proteases. In 1998, he was recruited by AstraZeneca in Gothenburg (Sweden) where he worked in hit generation developing concepts and methodologies of smart large size libraries; then in lead optimization group designing focused libraries of PPAR agonist analogues of Tesaglitazar. In 2000, he was hired by Serono Pharma in Geneva (Switzerland). He played a key role in the implementation of modern discovery process, communication with contract research organizations for medicinal chemistry projects, and was responsible for compound progression of several research projects from hit to PCD candidate, developing GPCR and kinase inhibitors for various therapeutic indications. Patrick provided critical contributions to several research projects leading to the identification and development of preclinical and clinical candidates for the treatment of CNS, inflammatory and metabolic disorders as well as preterm labor. These molecules are currently in phase I or II. In late 2006, Patrick accepted a position of general manager with responsibility for all operational activities at GenKyoTex. He is co-author of 28 research publications and co-inventor of 11 patents.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"General Manager, CSO","firm":{"name":"GenKyoTex","permalink":"genkyotex","type_of_entity":"company","image":{"available_sizes":[[[150,62],"assets/images/resized/0004/7604/47604v1-max-150x150.jpg"],[[189,79],"assets/images/resized/0004/7604/47604v1-max-250x250.jpg"],[[189,79],"assets/images/resized/0004/7604/47604v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}