{"first_name":"Patrick","last_name":"Alphonso","permalink":"patrick-alphonso-2","crunchbase_url":"http://www.crunchbase.com/person/patrick-alphonso-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jul 18 05:46:25 UTC 2009","updated_at":"Wed Aug 25 21:27:43 UTC 2010","overview":"<p>Patrick Alphonso, CEO of Swamiwarem, is the game programmer and designer who created Dragon BallZ: Taiketsu, published by Atari and Bandai for the Nintendo Game Boy Advance. He started his career with the legendary Sculptured Software, where he was the Lead Programmer and designer of  NHL Breakaway &#8216;98  for Sony PlayStation and Nintendo 64, the winner of the 1998 Video Game Spot&#8217;s Sports Game of the Year. He was the number two programmer on Mortal Kombat 3, published by Midway for the SEGA Genesis, and did additional software engineering for SeaQuest DSV for Amblin Entertainment. He contributed with game engine, and tool development for WWF Warzone for PlayStation, and numerous other titles. Patrick joined start-up Real Sports where he lead the development of  CENTIPEDE  for PlayStation, and contributed to Jeff Gordon Racing for PC/PlayStation, and aided in the creation of Gorka Morka for SEGA DreamCast. Patrick consulted for numerous dotcoms, and launched market leader Limostation.com. He served as Chief Architect and Chief Technology Officer for Software Designs Inc.</p>\n\n<p>Patrick holds a BSE degree in Computer Engineering from the University of Michigan. He earned a MSE degree in Software Engineering from the University of Michigan Rackham Graduate School, and was the recipient of the Honor Scholar Award, given to the top graduate student in Computer Science. Patrick is the author of The Game Fanatic&#8217;s Guide to PC Cheats published by Avon Books New York. He is on the board of directors of the University of Michigan Electrical Engineering &amp; Computer Science (EECS) Society, and a member of the recruitment committee. And is a member of IEEE and Upsilon Pi Epsilon, the international honor society of computing sciences. Patrick also holds several United States patents. </p>\n\n<p>Source: <a href=\"http://www.swamiware.com/about.asp\" title=\"Swamiware\" rel=\"nofollow\">Swamiware</a></p>","image":{"available_sizes":[[[89,150],"assets/images/resized/0006/2665/62665v2-max-150x150.jpg"],[[149,250],"assets/images/resized/0006/2665/62665v2-max-250x250.jpg"],[[268,450],"assets/images/resized/0006/2665/62665v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BSE","subject":"Computer Engineering","institution":"University of Michigan","graduated_year":1994,"graduated_month":null,"graduated_day":null},{"degree_type":"MSSE","subject":"Computer Science","institution":"University of Michigan","graduated_year":2006,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President & CEO","firm":{"name":"Swamiware","permalink":"swamiware","type_of_entity":"company","image":{"available_sizes":[[[150,21],"assets/images/resized/0005/3243/53243v2-max-150x150.png"],[[206,30],"assets/images/resized/0005/3243/53243v2-max-250x250.png"],[[206,30],"assets/images/resized/0005/3243/53243v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}