{"first_name":"Paul-Noël","last_name":"Guély","permalink":"paul-nol-guly","crunchbase_url":"http://www.crunchbase.com/person/paul-nol-guly","homepage_url":"http://www.armapartners.com","birthplace":"Nancy, France","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1965,"born_month":12,"born_day":29,"tag_list":"","alias_list":null,"created_at":"Sat Nov 10 13:04:11 UTC 2012","updated_at":"Sun Nov 11 23:08:00 UTC 2012","overview":"<p>Paul is Managing Partner of Arma Partners, which he founded in 2003. Under Paul’s leadership, Arma Partners has grown from 4 employees at inception to over 60 today, operating from offices in London and Silicon Valley and affiliates in Tel Aviv, Tokyo, São Paulo and Sydney, and has become the leading independent M&amp;A advisor to the global Technology, Media &amp; Telecoms sector. Previously Paul was a Corporate Financier with Morgan Grenfell &amp; Co., Lehman Brothers and, most recently, Goldman Sachs, culminating in positions as Head of Software &amp; Services and European Technology Investment Banking. Paul has for over 20 years advised established companies such as SAP, Software AG and STMicroelectronics, as well as emerging leaders, many of which he has taken public (LSE listing of Autonomy, NASDAQ listing of Baltimore Technologies, Frankfurt IPO of Software AG, etc.). Since setting up Arma Partners, Paul has led 25+ of his firm’s 70+ announced transactions, including Software AG’s $546m acquisition of webMethods and $680m acquisition of IDS Scheer, Micro Focus’s acquisitions of NetManage, Relativity Technologies, Compuware’s ASQ business and Borland Software Corporation; as well as many high value private equity and venture capital-backed exits (sales of Gigle Networks to Broadcom, The Foundry to Carlyle, Zeus Technology to Riverbed, WDS to Xerox, UC4 to EQT, Butterfly Software to IBM, etc.).</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}