{"first_name":"Paul","last_name":"Bleiweis","permalink":"paul-bleiweis","crunchbase_url":"http://www.crunchbase.com/person/paul-bleiweis","homepage_url":"http://biznik.com/members/paul-bleiweis-paul-bleiweis","birthplace":"Hendersonville","twitter_username":"Paul_Bleiweis","blog_url":"http://presentationsolutions.org/2009/09/19/paul-bleiweis-easi-inc-goes-global/","blog_feed_url":"","affiliation_name":"Energy Automation Systems","born_year":1958,"born_month":3,"born_day":14,"tag_list":"paul-bleiweis, paulbleiweis","alias_list":null,"created_at":"Fri Jan 15 13:36:30 UTC 2010","updated_at":"Fri Jan 15 22:33:30 UTC 2010","overview":"<p>Paul Bleiweis, Ph.D., is president of Energy Automation Systems Inc. (EASI). Paul Bleiweis brings to the company more than 30 years of experience in energy conservation; energy production, management and distribution; energy technology development and applications. Dr. Paul Bleiweis manages day-to-day company operations, including product manufacturing; technology development; Affiliate network development; marketing; sales and general business administration.</p>\n\n<p>Dr. Paul Bleiweis earned his doctorate in nuclear science and engineering from the University of California at Los Angeles. Paul Bleiweis has held numerous positions of executive leadership in federally funded and private organizations. Dr. Paul Bleiweis served early in his career as a staff member and group leader at the Los Alamos National Laboratory and went on to do extensive work with several high-technology, multi-location consulting firms.</p>\n\n<p>&#8220;Nearly all electrical systems - especially those in large industrial and commercial facilities - have a lot of hidden waste. For example, induction motors often demand more power than they consume, and the excess manifests itself as wasteful and sometimes harmful heat. Energy Automation Systems Inc (EASI) designs and installs custom systems that leverage the basic principles of electrical energy to virtually eliminate the waste. In addition, EASI systems improve the power quality in the electrical energy system. This reduces the likelihood of component malfunction and the resulting down time. Our systems can benefit any facility, large or small, that consumes electricity. The effects of an EASI system installation are immediate and dramatic.&#8221;</p>\n\n<ul>\n<li>Dr. Paul Bleiweis, president of Energy Automation Systems Inc. (EASI)</li>\n</ul>","image":{"available_sizes":[[[135,150],"assets/images/resized/0007/3557/73557v2-max-150x150.jpg"],[[150,166],"assets/images/resized/0007/3557/73557v2-max-250x250.jpg"],[[150,166],"assets/images/resized/0007/3557/73557v2-max-450x450.jpg"]],"attribution":"<p>Paul Bleiweis</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/paulbleiweis","title":"Paul Bleiweis"},{"external_url":"http://paulbbleiweis.info/","title":"Paul Bleiweis"},{"external_url":"http://paulbbleiweis.com/","title":"Paul Bleiweis"},{"external_url":"http://www.easibusiness.com/paul-bleiweis.php","title":"Paul Bleiweis"},{"external_url":"http://www.energyautomation.com/paul-bleiweis-energy-automation-systems-EASI.php","title":"Paul Bleiweis"},{"external_url":"http://www.energysavingbusiness.com/paul-bleiweis.php","title":"Paul Bleiweis"}]}