{"first_name":"Paul","last_name":"Smith","permalink":"paul-smith-7","crunchbase_url":"http://www.crunchbase.com/person/paul-smith-7","homepage_url":"http://www.buysafegenerics.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Buysafegenerics.com","born_year":1988,"born_month":5,"born_day":31,"tag_list":"online-pharmacy, mens-health-drug, womens-health","alias_list":null,"created_at":"Wed Sep 05 07:26:19 UTC 2012","updated_at":"Sun Sep 09 19:03:14 UTC 2012","overview":"<p>Buysafegenerics.com is an online drugstore. Its peculiarity lies in its quality service and client centric approach that makes this website totally different and distinctive from other online pharmacy store. Creating each client happy is what we have a tendency to perpetually attempt for. As an easy website we offer medications at only one click to individuals all across the globe at cheaper costs. Our website provides branded furthermore as generic medications at cheap prices.</p>\n\n<p>Our pharmacy endeavor is that the start to succeed in to customers everywhere the globe. It’s our goal to achieve every customer’s trust by providing reliable and safe medications. We have a tendency to be perpetually on our toes to supply customers with over the counter medications that they need.</p>\n\n<p>As a proud distributor of medicines we have a tendency to follow tight standards and completely scrutinize the medications before delivering the medicines. Quality and performance isn&#8217;t compromised whereas selling medications to customers online. The medications are approved for the ingredient by FDA (Food and Drug Administration) and WHO (World Health Organization). You’ll be able to simply purchase medications online on health issues like impotence, smoking halt, hair loss, sexual disability etc.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Online Drug Store","firm":{"name":"Buysafegenerics.com","permalink":"buysafegenerics-com","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}