{"first_name":"Paulette","last_name":"Bleam","permalink":"paulette-bleam","crunchbase_url":"http://www.crunchbase.com/person/paulette-bleam","homepage_url":"","birthplace":"","twitter_username":"paulettebleam","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1982,"born_month":5,"born_day":20,"tag_list":"","alias_list":null,"created_at":"Mon Feb 28 20:00:25 UTC 2011","updated_at":"Sun Dec 09 06:22:15 UTC 2012","overview":"<p>Paulette is the Director of Community &amp; Operations at Sumazi, where she is responsible for its client services, social media, communications strategy, and serving as a direct liaison to the greater Sumazi community. </p>\n\n<p>Sumazi is the intelligent social navigation system for your personal and professional networks. </p>\n\n<p>Sumazi&#8217;s technology delivers personalized routing and recommendations to the people you should know based on your social media behavior. Sumazi&#8217;s recommendation engine analyzes your network behavior to discover and prioritize your needs, while our intelligent routing system automatically recommends and introduces you to the experts in your extended network. </p>\n\n<p>Sumazi is also developing enterprise social navigation technology that makes it easy for anyone within the company — new hires, sales reps, HR executives, connectors and experts — to get routed to the right person, saving the company valuable time and improving productvity. Sumazi is layered on top of existing enterprise social solutions such as Jive, Sharepoint and Salesforce and is designed to seamlessly fit into an employee’s current workflow. </p>\n\n<p>Sumazi was a finalist at the prestigious TechCrunch Disrupt Startup Battlefield (selected from more than 1,200 applicants to compete on stage), where it won the Omidyar Network award for &#8220;Startup Most Likely to Change the World.&#8221; Sumazi has been featured in the New York Times, TechCrunch, Wall Street Journal and VentureBeat and was most recently recognized by the American Express OPEN Forum as &#8220;Startup of the Week.&#8221;</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0012/5069/125069v2-max-150x150.jpg"],[[240,240],"assets/images/resized/0012/5069/125069v2-max-250x250.jpg"],[[240,240],"assets/images/resized/0012/5069/125069v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor's","subject":"Journalism","institution":"San Francisco State University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.sumazi.com","title":"Sumazi"},{"external_url":"https://www.facebook.com/paulette.bleam","title":"Facebook"},{"external_url":"http://twitter.com/ paulettebleam","title":"Twitter"}]}