{"first_name":"Paul","last_name":"Shapiro","permalink":"paul-shapiro-2","crunchbase_url":"http://www.crunchbase.com/person/paul-shapiro-2","homepage_url":"http://www.shapirocpa.blogspot.com","birthplace":"","twitter_username":"paulgshap","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Dec 18 23:02:01 UTC 2009","updated_at":"Sun Dec 20 01:21:12 UTC 2009","overview":"<p>Over 30 years of experience in financial and accounting services. A specialist in providing financial and business consulting services to the tech industry, although not exclusively. Acting CFO and Controller capabilities for small, growing companies, as well as work-for-hire on a project basis for established organizations. Enjoys solving short-term needs for organizations not requiring a full-time solution.</p>\n\n<p>Paul has helped an ecommerce company merge into a publicly held competitor, while also working with a venture-backed start-up enterprise software company as Interim Controller, and on a variety of projects for a business process outsourcing company. He has been acting CFO or interim controller for many start-ups, including a content delivery network provider, a consumer price comparison site, a logistics software developer, an Internet resume database company, an enterprise workforce software company, a boutique M&amp;A firm and an Internet music company. He has been involved in the technology industry since 1982. </p>\n\n<p>A graduate of the University of Delaware with a Bachelor of Science degree in accounting, and a California CPA, Mr. Shapiro is an active member of the California Society of CPAs, former board member of the LA Chapter, State Business and Industry Committee, and past chairman of the LA Members in Industry Committee for the Society. He volunteers each week with KCRW-FM’s Morning Becomes Eclectic, and has raised almost $300,000 for Juvenile Diabetes Research Foundation (JDRF) in just 6 years with his family walk team - Jessica&#8217;s J-Walkers (his daughter was diagnosed with Type 1 diabetes in 2002). He is on the Board of the Los Angeles Chapter of the JDRF and is currently Treasurer. He also sits on the Advisory Board for Santa Monica College’s Business department.</p>\n\n<p>Specialties:\nInterim controller and CFO services for venture backed technology start-ups, other early stage and small companies, as well as various projects for larger companies, providing assistance during a corporate or personnel transition.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}