{"first_name":"Paula","last_name":"Fradiani","permalink":"paula-fradiani","crunchbase_url":"http://www.crunchbase.com/person/paula-fradiani","homepage_url":"","birthplace":"New Haven, CT","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Mar 12 23:24:55 UTC 2011","updated_at":"Mon Mar 21 18:21:31 UTC 2011","overview":"<p>Paula Fradiani has spent her adult life pursing education and working in various areas in the helping profession.  Through her extensive educational achievements and the ability to acquire employment is various settings and working with many professionals who are nationally recognized and others who are world renowned experts in the field of autism and child traumatology.  Technology has developed to be an important asset in notification, organization and instruction in the education and helping professions.</p>\n\n<p>Ms. Fradiani clearly expresses how fortunate she is to have been able to study under and work with people who are regarded as the best in the field.</p>\n\n<p>Technology has been integral in her profession.  Early in her career, she worked for the Institute of Professional Practice (IPP) in CT.  This private nonprofit agency provided residential services for individuals with disabilities, who exhibited significantly challenging behaviors.  This company was a leader in their use of computers to track and graph behavior for clinicians to use in decisions to change teaching strategies, medications and other support services, all in an effort to improve the residents quality of life and inclusion in the community.</p>\n\n<p>Years later, while working in a public school district teaching children with autism spectrum disorders (ASD), she introduced similar computerized data analysis for the classroom setting.  While the public education system utilized technology earlier than nonprofit setting, the use was clearly different.  Achievement Testing that is nationally required in specific grades to produce a snapshot of how our nation&#8217;s children are achieving academically and thus providing indicators of whether our teachers instructional strategies are actually effective.  Today, all teachers have a computer in their classroom for their use.  In addition, each classroom is outfitted with one and often more, computers for the student to use to become familiar with in an effort to achieve profiency in the use of computers for education and other areas of daily living.  </p>\n\n<p>Today all students, both general education students and student who recieve special education services, using a computer on some level.  Yet the use of the computer to accurately track behavioral data for students receiving special education was minimal, at best.   Paula Fradiani introduced the use of specific software that made data entry less arduious.  The result was the production of professionally graphed data that was able to be understood by both professional and laymen (parents) on the student&#8217;s team.  This began a slow but carefully orchestrated modelling that it is possible to collect behavior data while teaching a class of children with special needs in a public school setting.  These children should be afforded the opportunity to attend school with their nondisabled peers and receive services which are determined by and modified from actual empirical data rather than opinion.</p>\n\n<p>Currently, Paula has completed all her doctoral coursework requirements successfully and is in the dissertation process.  Her topic:  &#8220;The development of social competence in young adults with Asperger&#8217;s Disorder&#8221; has included her to research computer software programs that are geared to assist individuals with Asperger&#8217;s Disorder to identify emotions or communicative intent that results from body language.  This socially based skill is a significant deficit for individuals with Asperger&#8217;s Disorder.  The inability to identify or understand social cues, socially based syntax and body language which communicates meaning.  This deficit can have a debilitating effect on an individual as all social meanings, actions and intent are involved in every aspect of life, given humans are social animals.  Failure to develop these social skills and understanding give a false impression of an individual with Asperger&#8217;s Disorder.  The resulting effect is isolation and rejection.  Thus her research regarding the various computer based programs focused on social instruction will make an important contribution to individuals on the wide spectrum of autism.</p>","image":null,"degrees":[{"degree_type":"BS","subject":"Special Education","institution":"Southern CT State University","graduated_year":1987,"graduated_month":null,"graduated_day":null},{"degree_type":"MSEd","subject":"Special Education","institution":"Southern CT State University","graduated_year":1988,"graduated_month":null,"graduated_day":null},{"degree_type":"MS","subject":"Clinical Psychology","institution":"Southern CT State University","graduated_year":1989,"graduated_month":null,"graduated_day":null},{"degree_type":"6th Year Professional","subject":"Autism Spectrum Disorders Consultant","institution":"Southern CT State University","graduated_year":1995,"graduated_month":null,"graduated_day":null},{"degree_type":"Doctorate","subject":"Special Education","institution":"Nova Southeastern University","graduated_year":2011,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}