{"first_name":"Paul","last_name":"Stahura","permalink":"paul-stahura-3","crunchbase_url":"http://www.crunchbase.com/person/paul-stahura-3","homepage_url":"http://www.donuts.co","birthplace":"","twitter_username":"stahura","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1962,"born_month":null,"born_day":null,"tag_list":"stahura, donuts, internet, domain-names, icann, tlds","alias_list":null,"created_at":"Tue Jun 05 21:56:15 UTC 2012","updated_at":"Sat Jun 09 17:25:13 UTC 2012","overview":"<p>Paul Stahura has been a technology entrepreneur for decades.  He founded domain name registrar eNom in his garage in 1997 with little capital and during a time when the industry was dominated by a single combined registrar and registry.  He took the company from $0 in sales to more than $80 million in total revenue in less than 10 years, and from no domain names under management to the second largest domain name registrar in the world.  The company now generates more than $100 million in highly profitable revenue.</p>\n\n<p>Paul sold eNom to Demand Media in 2006, on the day the now publicly-traded company was formally organized and closed on its first round of $150 million in financing.  After the transaction he became Demand Media&#8217;s President and Chief Operating Officer, then its Chief Strategy Officer.  Paul served as a Demand Media board member until his departure in 2009.</p>\n\n<p>While bringing thousands of domain name resellers and numerous ICANN-accredited registrars to the eNom platform, Paul also successfully negotiated and obtained for eNom exclusive rights to Verisign&#8217;s .TV premium domain name portfolio.  His fellow registrars twice elected Paul as the Registrar Stakeholder Group representative to ICANN&#8217;s nominating committee.  Paul has participated in more than 30 ICANN meetings, and being intimately familiar with registrar and registry operations and the domain name lifecycle, he has been invited to present on various panels during these conferences.\nA renowned and respected technology innovator, Paul holds four United States patents (three in the domain name system space) and twice has been called to testify before the U.S. Congress on issues related to domain names and Internet policy.  Paul is a founder of NameJet, a leading domain name auction platform (initially called “Club Drop” and a wholly-owned subsidiary of eNom), has been a member of the board of directors of AboutUs.org since that company&#8217;s founding, and is an investor in and board member for several Seattle-area technology startups.</p>\n\n<p>Paul earned undergraduate and master’s degrees in Electrical Engineering from Purdue University. </p>","image":{"available_sizes":[[[80,110],"assets/images/resized/0019/4088/194088v2-max-150x150.jpg"],[[80,110],"assets/images/resized/0019/4088/194088v2-max-250x250.jpg"],[[80,110],"assets/images/resized/0019/4088/194088v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}