{"first_name":"Paul","last_name":"Thind","permalink":"paul-thind","crunchbase_url":"http://www.crunchbase.com/person/paul-thind","homepage_url":"http://www.triggerspot.com","birthplace":"Perivale, Middx, United Kingdom","twitter_username":"paulthind","blog_url":"","blog_feed_url":"","affiliation_name":"Triggerspot Inc.","born_year":null,"born_month":null,"born_day":null,"tag_list":"triggerspot, habbo, sulake, outspark, peanut-labs","alias_list":null,"created_at":"Fri Oct 01 05:40:52 UTC 2010","updated_at":"Tue Aug 09 23:32:41 UTC 2011","overview":"<p>Paul Thind is an entrepreneur and the CEO and co-Founder of TRIGGERSPOT INC., a digital entertainment consultancy and online games distributor.  Through TRIGGERSPOT INC., Thind advises and works with a number of well-known companies in the Social Gaming, F2P/MMOG/Online Games, and virtual world space.  </p>\n\n<p>Previously, Thind was the COO of Outspark, an entertainment services company that published engaging online multiplayer games.  During his tenure at Outspark, Thind doubled Outspark&#8217;s run rate in less than 6 months and added many best practices around company Key Performance Indicators, the Registration Funnel, and operational processes. </p>\n\n<p>Prior to Outspark, Thind was the US CEO and General Manager, North America of Sulake Corporation (HABBO.Com), a global teen virtual world community with offices and communities in 32 countries. Thind was responsible for launching the service and later the daily operations of Habbo&#8217;s US and Canadian websites as well as identified, negotiated and secured payment partnerships globally.  During his time at Sulake, Thind grew Habbo’s North American user base from five (5) to twenty-five (25) Million.  With his music industry background, he was able to secure promotion partnerships with all 4 major labels and a host of independent record labels and artist management companies.  Thind was also a pioneer in the prepaid space launching the first prepaid card for a virtual world through CVS in 2005.  He went on to forge successful retail relationships in Sulake&#8217;s merchandising and licensing division with Target Corporation, 7-Eleven, Rite-Aid, Circle K, Best Buy, and more. </p>\n\n<p>Prior to this, Thind consulted at Veritasiti Corporation (CurrentAttractions.com) as the VP of Business Development where he formulated partnerships with all the major movie studios in an attempt to launch a competing ratings system parallel to the MPAA.  Thind also held the role of Interim CEO at PBAMusic.com, a record label and online publishing business, as part of his personal consulting practice.</p>\n\n<p>Prior to this, he was the founder and CEO of two full service Record Label, Publishing and Merchandising entities in the music industry.  At NecropolisRecords.com, Thind established the brand and website as a leader in the metal/rock music space launching artists from all over the world.  In 1999, Necropolis Records was recognized as the &#8220;Number One Extreme Metal Label in the US&#8221; by Billboard Magazine.  He also executive produced over 110 recordings and broke side projects by many successful artists in the Heavy Metal genre such as Phil Anselmo&#8217;s (PANTERA) Viking Crown, and Patrik Jensen&#8217;s (THE HAUNTED) Witchery project the former receiving a grammy nomination in Sweden.  Thind also worked to license rock music into commercials with Nike (Skateboarding) and Polygram Records for inclusion into the Fine Line Features movie &#8220;Gummo&#8221;.  Thind was also an early pioneer in MP3 and led acquisition efforts to take music online legally, with eMusic, being responsible for many independent labels signing to the company as part of their online strategy.</p>\n\n<p>Thind has 17 years of experience in the entertainment, internet, virtual world and digital media space.  He has a track record of senior posts at several successful organizations and is a brand builder and thought leader in his industry.  He is routinely a keynote speaker at various conferences in the online/virtual goods space such as VGSummit, GDC, Gamer&#8217;s Law, and has been interviewed in several publications due to his knowledge of the online gaming industry.</p>\n\n<p>Thind holds an MBA from The Graziadio School of Business &amp; Management at Pepperdine University and a Bachelor of Science in Business Administration &amp; Marketing from The School of Business &amp; Economics at California State University, Hayward.  He lives in the Potrero Hill area of San Francisco.</p>","image":{"available_sizes":[[[97,150],"assets/images/resized/0010/3793/103793v2-max-150x150.png"],[[162,250],"assets/images/resized/0010/3793/103793v2-max-250x250.png"],[[197,303],"assets/images/resized/0010/3793/103793v2-max-450x450.png"]],"attribution":"<p>R. Brooks</p>"},"degrees":[{"degree_type":"MBA","subject":"Business","institution":"Pepperdine University","graduated_year":2008,"graduated_month":null,"graduated_day":null},{"degree_type":"BSc","subject":"Business Administration","institution":"CSU Hayward","graduated_year":2000,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO and co-founder","firm":{"name":"Triggerspot","permalink":"triggerspot","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0010/3794/103794v2-max-150x150.jpg"],[[250,73],"assets/images/resized/0010/3794/103794v2-max-250x250.jpg"],[[450,132],"assets/images/resized/0010/3794/103794v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"US CEO","firm":{"name":"Sulake","permalink":"sulake","type_of_entity":"financial_org","image":null}},{"is_past":true,"title":"COO","firm":{"name":"Outspark","permalink":"outspark","type_of_entity":"company","image":{"available_sizes":[[[150,28],"assets/images/resized/0000/3073/3073v3-max-150x150.png"],[[171,32],"assets/images/resized/0000/3073/3073v3-max-250x250.png"],[[171,32],"assets/images/resized/0000/3073/3073v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/paulthind","title":"Twitter"},{"external_url":"http://www.triggerspot.com","title":"Triggerspot Inc."},{"external_url":"http://www.linkedin.com/in/paulthind","title":"LinkedIn"}]}