{"first_name":"Paul","last_name":"Allen","permalink":"paul-allen-3","crunchbase_url":"http://www.crunchbase.com/person/paul-allen-3","homepage_url":"http://tribeofangels.com","birthplace":"","twitter_username":"tribeofangels","blog_url":"","blog_feed_url":"","affiliation_name":"Tribe of Angels","born_year":null,"born_month":null,"born_day":null,"tag_list":"jewish, israel, angel, startup","alias_list":null,"created_at":"Sat Nov 27 21:57:43 UTC 2010","updated_at":"Wed Dec 01 21:31:20 UTC 2010","overview":"<p>Paul Allen is a creative tech strategist, designer, writer, and marketing exec. w/over 20 yrs. exp. in education, business and consumer products, health, electronic games, and non-profit sectors. </p>\n\n<p>He is Principal with Bitemark, a tech design, marketing and development firm. Projects include: game design for large gaming company; creative and writing for Fortune 50 software business; social strategy for ATM vendor; creative and writing for green manufacturer; product design, development, and mktg. for educational software startup; corporate marketing for enterprise SaaS startup; management consulting for pre-seed venture fund and accelerator; and tech planning for several startups. </p>\n\n<p>He is Founder of Tribe of Angels, an intl. business network of over 5000 angel investors, researchers, VC&#8217;s, journalists, executives, and entrepreneurs in 25 countries.</p>\n\n<p>Paul was recently Partner at Wonderlab, a tech greenhouse helping startups design, develop, and sell Rich Internet Apps.</p>\n\n<p>Previously, he was Director of the CT Software Association and VP of the CT Tech Council, a statewide econ. devpt. org; Dir. of Corp. Marketing for Qbiquity, a pioneer in word-of-mouth marketing tech where he helped lead the team to secure in excess of $12 million in funding from investors whose portfolios included Overture, DoubleClick, CommerceOne, Wit Capital, and Epicentric; Director of Marketing for BetaSphere, where he led new pdct. devpt. initiatives for Intel, Adobe, Motorola, and Palm and was instrumental in positioning the company for investment by J.P. Morgan Partners, and GE Equity. </p>\n\n<p>Paul has also held positions w/healthcare and non-profit organizations.</p>\n\n<p>He has authored articles and white papers that have changed the way people think about product marketing and teamwork. He has been featured twice on NPR, and often speaks on topics related to technology and marketing.</p>\n\n<p>Paul holds a BA and an MA from UCLA and is married and lives in Shaker Heights Ohio.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Tribe of Angels","permalink":"tribe-of-angels","type_of_entity":"company","image":null}},{"is_past":false,"title":"Advisor","firm":{"name":"Data Agents","permalink":"data-agents","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}