{"first_name":"Paul","last_name":"Wilcock","permalink":"paul-wilcock","crunchbase_url":"http://www.crunchbase.com/person/paul-wilcock","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Cenoplex","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Oct 31 22:10:20 UTC 2012","updated_at":"Sun Nov 04 00:37:37 UTC 2012","overview":"<p>A telecommunications executive with more than 35 years of experience, Paul Wilcock currently serves as CEO and director of GuardianLion Wireless, the developer of unique personal locator devices that bring GPS, cell phone, Internet and 911 together into a seamless service that helps consumers protect those they love most. In addition to being named to Cenoplex’s advisory board, Paul also serves as president and CEO of HTBA, an investment management firm.</p>\n\n<p>Paul recently retired from the position of chief technology officer for Syniverse Technologies (NYSE:SVR), a leading provider of mission critical business, technical and network solutions for mobile operators worldwide. At Syniverse, he led a team of professionals responsible for the overall management and direction of software development, support, testing, implementation, configuration management, data processing, architecture and network for all Syniverse products and services. Syniverse, originally named Telecommunication Services Inc (TSI), was a standalone business unit within GTE and subsequently Verizon, prior to being sold to private equity investors in 2002. Additionally, Paul was the technology lead in developing the national wireless AMBER Alert System, which notifies cellular phone users about missing children as reported by the National Center for Missing and Exploited Children (NCMEC).</p>\n\n<p>Paul joined GTE in 1975 where he served in numerous technology-related management positions including vice president of business development and strategy, assistant vice president of marketing, director of product development and support services and director of enterprise technology. He has represented GTE, Verizon and Syniverse on a number of information technology business ventures and industry committees related to engineering, operations and strategy development. Prior to joining GTE, his telecommunications career began with British Telecom in the United Kingdom where he was responsible for electronic switching systems, engineering and technical support.</p>\n\n<p>Paul was recently elected to the board of directors for the Wells Fargo Center for the Arts in Santa Rosa. He also serves on the CIO/CTO steering committee of the Tampa Bay Technology Forum (TBTF) and is a board member of the TBTF Foundation, which has numerous local programs targeted at eliminating the digital divide. He also was recently recognized for serving on the Commercial Mobile Service Alert Advisory Committee which, under the federally mandated WARN act, defined the next generation wireless presidential alert and public warning system.</p>","image":null,"degrees":[{"degree_type":"MBA","subject":"Business","institution":"Wake Forest University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chairman & Board Member","firm":{"name":"GuardianLion Wireless","permalink":"guardianlion-wireless","type_of_entity":"company","image":null}},{"is_past":false,"title":"Vice Chairman","firm":{"name":"Wells Fargo Center for the Arts","permalink":"wells-fargo-center-for-the-arts","type_of_entity":"company","image":null}},{"is_past":false,"title":"President & CEO","firm":{"name":"HTBA","permalink":"htba","type_of_entity":"company","image":null}},{"is_past":false,"title":"Board of Advisors","firm":{"name":"Cenoplex","permalink":"cenoplex","type_of_entity":"company","image":{"available_sizes":[[[150,40],"assets/images/resized/0021/5603/215603v2-max-150x150.jpg"],[[206,55],"assets/images/resized/0021/5603/215603v2-max-250x250.jpg"],[[206,55],"assets/images/resized/0021/5603/215603v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Chief Technology Officer","firm":{"name":"Syniverse","permalink":"syniverse-technologies","type_of_entity":"company","image":{"available_sizes":[[[150,54],"assets/images/resized/0010/7806/107806v1-max-150x150.png"],[[168,61],"assets/images/resized/0010/7806/107806v1-max-250x250.png"],[[168,61],"assets/images/resized/0010/7806/107806v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.cenoplex.com/press/cenoplex-taps-paul-wilcock-for-seat-on-board-of-advisors/","title":"Cenoplex Taps Paul Wilcock for Seat on Board of Advisors"}],"web_presences":[{"external_url":"http://www.linkedin.com/profile/view?id=467508&locale=en_US&trk=tyah2","title":"LinkedIn - Paul Wilcock"}]}