{"first_name":"Paul","last_name":"Twomey","permalink":"paul-twomey","crunchbase_url":"http://www.crunchbase.com/person/paul-twomey","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 20 17:40:06 UTC 2008","updated_at":"Fri Jun 20 17:41:54 UTC 2008","overview":"<p>Dr. Paul Twomey became President/CEO of ICANN on 27 March 2003. Paul&#8217;s background lends a balance of public/private experience to leading ICANN, including numerous leadership positions in commercial enterprises, government, and in chairing ICANN&#8217;s Government Advisory Committee.</p>\n\n<p>Most recently, before joining ICANN, he was the founder of Argo P@cific, a high-level international advisory and investment firm that assists both Fortune 500 companies and start-up companies to build global Internet and technology businesses and strategic alliances.</p>\n\n<p>Prior to that, Dr. Twomey was founding Chief Executive Officer of the National Office for the Information Economy (NOIE), and the Australian federal government&#8217;s Special Adviser for the Information Economy and Technology. Established in 1997, NOIE is Australia&#8217;s lead Commonwealth agency for information economy issues. In his position as Special Adviser, Dr. Twomey was charged with providing strategic advice to the government on developing its information economy and technology priorities and strategies, including a National Strategy for the Information Economy. He was also Australia&#8217;s representative at international fora, such as the World Trade Organization, the OECD and APEC, to ensure that Australia&#8217;s interests were promoted during the current formation of the rules and regulations of the international information economy.</p>\n\n<p>During this time, Dr. Twomey was closely involved with ICANN, serving as Chair of the Governmental Advisory Committee (GAC) for three years ending November 2002. In recognition of his significant role in ICANN and his international influence on Internet and e-commerce issues with foreign governments, the Australian government appointed him its Special Representative for the Internet and ICANN.</p>\n\n<p>Prior to his appointment as CEO of NOIE, Dr. Twomey was Executive General Manager, Europe, of Austrade – the Australian Trade Commission. As the leader of Austrade&#8217;s Global Information Technology and Telecommunications Network, he assisted Australia&#8217;s IT&amp;T firms to market their products and services to key European, American and Asian markets.</p>\n\n<p>From 1994 to 1997, Dr. Twomey was the Executive General Manager of Strategic Development for Austrade and was responsible for the development of corporate strategy, business process and operational management within Austrade. Dr. Twomey was the author of the influential study: Austrade scenarios for the Australian trading environment. This study, released early in 1997 outlined inter alia, implications for Australian exports of an East Asian economic collapse. The study was influential to Australian government policy reactions to the Asian financial crisis in late 1997-98.</p>\n\n<p>Prior to this, Dr. Twomey was a consultant with global management consultancy McKinsey &amp; Company. In this role he advised major corporations primarily from the telecommunications financial service and tourism sectors in Australia, the United States, Japan and Hong Kong.</p>\n\n<p>Widely published in academic and popular journals, Dr. Twomey has contributed to books on industry policy, foreign and defense policy, and development issues. He holds a Bachelor of Arts (First Class Honors) from the University of Queensland, a Master of Arts (Political Science and International Relations) from Pennsylvania State University and a PhD in International Relations from the University of Cambridge.</p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0002/0749/20749v1-max-150x150.jpg"],[[150,200],"assets/images/resized/0002/0749/20749v1-max-250x250.jpg"],[[150,200],"assets/images/resized/0002/0749/20749v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.icann.org/general/staff.html\" title=\"ICANN\" rel=\"nofollow\">ICANN</a></p>"},"degrees":[],"relationships":[{"is_past":true,"title":"President and CEO","firm":{"name":"ICANN","permalink":"icann","type_of_entity":"company","image":{"available_sizes":[[[150,121],"assets/images/resized/0002/0748/20748v1-max-150x150.png"],[[171,139],"assets/images/resized/0002/0748/20748v1-max-250x250.png"],[[171,139],"assets/images/resized/0002/0748/20748v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}