{"first_name":"Paul","last_name":"Melcher","permalink":"paul-melcher","crunchbase_url":"http://www.crunchbase.com/person/paul-melcher","homepage_url":"http://flavors.me/pmelcher","birthplace":"Neuilly Sur Seine","twitter_username":"","blog_url":"http://blog.melchersystem.com/","blog_feed_url":"","affiliation_name":"Zymmetrical","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Mar 01 22:30:20 UTC 2009","updated_at":"Wed Aug 22 09:48:35 UTC 2012","overview":"<p>Mr. Melcher is Vice President of Image Licensing at Stipple.(http://www.stipple.com), a venture backed startup reinventing the image ecosystem  by permitting publishers to monetize the content inside the pictures on their sites. He is also a full time contributor to daily newsletter le Journal de la Photographie (http://www.lejournaldelaphotographie.com).  </p>\n\n<p>Most recently, he has successfully co-launched PictureGroup, a high end celebrity and entertainment photography service company for which he acted as it Senior Vice President.</p>\n\n<p>Mr. Melcher was C.K.O. of Flyerstarter Services Ltd. / Zymmetrical.com (www.zymmetrical.com), the first midstock visual art marketplace, and strategist for Adbuynet (www.adbynet.com), an on-line, self service, video advertising agency. He also consults for a variety of high tech, high-end visual software solution providers.</p>\n\n<p>Previously, he was V.P of sales at DigitalRailroad, Inc, (www.digitalrailroad.net), a photo technology company building the first and most powerful professional photo community. Prior to that he was Director of North American Operations and Sales for Hachette Filipacchi Photo Group (www.hachettephotos.com). In this role, he doubled revenues for the U.S. market in less than a year and led integration initiatives for numerous prestigious agencies, such as Gamma, Rapho and TOP. As president of Abaca US he led the company&#8217;s sales and production teams, built a new distribution platform (http://www.abacausa.com) and cemented key corporate relationships with Knight Ridder Tribune, The Los Angeles Times and PA Photos, among others.</p>\n\n<p>As Executive Vice President and Partner at ImageDirect, Melcher guided the development of the company&#8217;s online real-time distribution platform, streamlined workflow to enable better distribution of more images to key buyers, and managed relationships with corporate clients such as ABC, MTV, FOX, NBC, Atlantic Records, USA Today and the NFL. He helped secure a multi million dollar acquisition of his company by Getty Images, Inc.(GYI).</p>\n\n<p>Mr. Melcher served as Director of sales at LGI Photo Agency where he built the first, high resolution, real time digital photo delivery platform. LGI was later bought by CORBIS (www.corbis.com), a Bill Gates owned company, where he held various high level executive positions.</p>\n\n<p>Mr. Melcher is also co-founder and web designer of Unique Boutique NYC.</p>\n\n<p>Mr. Melcher holds a B.A. in Economics from Universitee de Paris IX, France, and a French Baccalaureat with honors from Lycee International, France </p>","image":{"available_sizes":[[[131,150],"assets/images/resized/0014/2963/142963v2-max-150x150.jpg"],[[218,250],"assets/images/resized/0014/2963/142963v2-max-250x250.jpg"],[[393,450],"assets/images/resized/0014/2963/142963v2-max-450x450.jpg"]],"attribution":"<p>Paul Melcher</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"CKO","firm":{"name":"Zymmetrical","permalink":"zymmetrical","type_of_entity":"company","image":{"available_sizes":[[[150,46],"assets/images/resized/0003/7277/37277v2-max-150x150.png"],[[192,59],"assets/images/resized/0003/7277/37277v2-max-250x250.png"],[[192,59],"assets/images/resized/0003/7277/37277v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"VP, Business Development","firm":{"name":"Stipple","permalink":"stipple","type_of_entity":"company","image":{"available_sizes":[[[75,75],"assets/images/resized/0009/6219/96219v2-max-150x150.png"],[[75,75],"assets/images/resized/0009/6219/96219v2-max-250x250.png"],[[75,75],"assets/images/resized/0009/6219/96219v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}