{"first_name":"Paulo","last_name":"Cunha","permalink":"paulo-cunha","crunchbase_url":"http://www.crunchbase.com/person/paulo-cunha","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"ShiftForward","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 04 17:26:12 UTC 2012","updated_at":"Sat Jan 07 12:28:20 UTC 2012","overview":"<p>Paulo is an online advertising technology expert with a 14 year mixed background of Computing, Web Marketing and Advertising technologies.</p>\n\n<p>Paulo’s interest in the online media space goes as far back as 1997 when he first started web development, web marketing and SEO activities for local SME’s. This was followed by heading the web development department of a design agency before he moved to London to achieve a first class BSc in Computing and Information Systems from London Metropolitan University. After working for the data-centric direct marketing company Acxiom, Paulo joined German start-up wunderloop, the online ‘Behavioural Targeting’ company launched in Europe in 2006. Here he lead it’s UK technology deployment and from 2008 focused in researching and designing for the company’s online advertising exchange platform.</p>\n\n<p>Finding a need in the growing European online advertising market for highly qualified expertise in advertising technology, Paulo has been a strategic technology consultant from the begining of 2010. He has since collaborated with companies such as Glam Media, Semasio GmbH, Klaustech, xplosion amongst others in designing and rolling-out large-scale advertising platforms, behavioural targeting products and yield management systems.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder, CEO","firm":{"name":"ShiftForward","permalink":"shiftforward","type_of_entity":"company","image":{"available_sizes":[[[150,32],"assets/images/resized/0016/8812/168812v2-max-150x150.png"],[[250,53],"assets/images/resized/0016/8812/168812v2-max-250x250.png"],[[450,96],"assets/images/resized/0016/8812/168812v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.shiftforward.eu/who-is-shiftforward/","title":""}],"web_presences":[]}