{"first_name":"Paul","last_name":"Levins","permalink":"paul-levins","crunchbase_url":"http://www.crunchbase.com/person/paul-levins","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 20 17:40:11 UTC 2008","updated_at":"Fri Jun 20 18:11:17 UTC 2008","overview":"<p>Paul has over 25 years experience at the most senior levels of the government, business and non-government sectors. At ICANN he is responsible for communications (which encompasses media relations and public participation), meetings, and website development.</p>\n\n<p>Prior to joining ICANN, Paul was General Manager, Operations and Corporate Affairs at Bilfinger Berger Australia, a German-owned holding company in the infrastructure, building and services sector with a turnover of almost $2.5 billion and over 5000 staff. In this role he directed the company&#8217;s government affairs and communications effort and was its main spokesperson. He has also worked as a corporate affairs manager for Telstra Corporation, a leading telecommunications and information technology provider in the Asia Pacific region.</p>\n\n<p>Paul has substantial public sector policy experience having been a Chief of Staff to Government Ministers in portfolios as diverse as Health; Urban Affairs and Planning; Housing; Social Security; Higher Education; Employment Services; Water; Infrastructure and Natural Resources. He has worked at the Australian Human Rights Commission on the introduction of Tax File Number and Privacy legislation, and has worked in the education and youth policy sectors.</p>\n\n<p>Paul holds a Bachelor of Arts from Macquarie University and is an Honorary Associate at the Graduate School of Government at the University of Sydney.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0002/0753/20753v1-max-150x150.jpg"],[[132,197],"assets/images/resized/0002/0753/20753v1-max-250x250.jpg"],[[132,197],"assets/images/resized/0002/0753/20753v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.icann.org/general/staff.html\" title=\"ICANN\" rel=\"nofollow\">ICANN</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Executive Officer and Vice President - Corporate Affairs","firm":{"name":"ICANN","permalink":"icann","type_of_entity":"company","image":{"available_sizes":[[[150,121],"assets/images/resized/0002/0748/20748v1-max-150x150.png"],[[171,139],"assets/images/resized/0002/0748/20748v1-max-250x250.png"],[[171,139],"assets/images/resized/0002/0748/20748v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}