{"first_name":"Paul","last_name":"Negus","permalink":"paul-negus","crunchbase_url":"http://www.crunchbase.com/person/paul-negus","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"aiHit","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed May 30 10:01:15 UTC 2012","updated_at":"Fri Oct 19 21:27:41 UTC 2012","overview":"<p>Paul&#8217;s expertise is working with technology entrepreneur&#8217;s who have a great idea and want maximise the products/services full potential through revenue and profit generation. Paul has over 20 years of experience in successfully building technology companies in new and emerging markets. His leadership skills have enabled these businesses to become number one in their chosen markets. He has clearly demonstrated significant increases in shareholder value through the successful development and global exploitation of innovative products and services.  In 1997 he became Director and General Manager for Pearpoint Ltd. The company was sold in 2000 for $40million to SPX Inc (NYSE:SPW). Following the sale he became Sales Director for Radiodetection an SPX owned Telecommunications company. In January 2004 he became Managing Director of PIPS Technology and in 2007 played a key role in negotiating the sale of PIPS company to Federal Signal Corporation (NYSE:FSS) for $100million. Currently he is CEO of Aihit which has intelligent data generation technology that crawls company websites and turns the unstructured data on these websites into structured data using artificial intelligence and machine learning algorithms. aiHit is well positioned to take advantage of Big Data to provide transactional information within the predictive analytics market. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"aiHit","permalink":"aihit","type_of_entity":"company","image":{"available_sizes":[[[150,78],"assets/images/resized/0015/7435/157435v5-max-150x150.png"],[[250,131],"assets/images/resized/0015/7435/157435v5-max-250x250.png"],[[450,236],"assets/images/resized/0015/7435/157435v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}