{"first_name":"Paul","last_name":"McGowan","permalink":"paul-mcgowan","crunchbase_url":"http://www.crunchbase.com/person/paul-mcgowan","homepage_url":"http://www.arcadiaseo.com","birthplace":"Torrance, Ca","twitter_username":"arcadiaseo","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1962,"born_month":10,"born_day":24,"tag_list":"seo, search-engine-optimization, adwords, pay-per-click, ppc, social-media, internet-marketing, online-marketing, smo, sem","alias_list":null,"created_at":"Sat Nov 20 06:12:09 UTC 2010","updated_at":"Tue Nov 23 15:49:09 UTC 2010","overview":"<p>Search Engine Optimization\nSearch Engine Optimization (and even more relevant local Search Engine Optimization) has become one of the most important marketing endeavors of every online business. Understanding the influence that SEO has on your business is critical, SEO can help you win-over new customers and persuade existing customers. If your company’s website is not fully optimized then your website is absolutely having a negative impact on your bottom line. Think of SEO this way; when a visitor comes to your website they will take one of two actions. That visitor to your website will either buy a product or fill out a form (i.e. take action), or they will leave (i.e. bounce). They may view some of the pages in your site, but if your site is not search engine optimized then the amount of visitors ‘bouncing’ off your website will greatly outnumber those who are ‘taking action’.</p>\n\n<p>Google Adwords - Pay Per Click\nGoogle Adwords, commonly known as pay per click or PPC advertising is the fastest method for driving instant traffic to your website or blog. Although a fast and effective Internet marketing tool that will increase your website or blogs traffic, Google Adwords pay per click advertising is not a task you should give to an inexperienced employee. It takes years of experience to properly setup, manage, budget and track a Google Adwords pay per click ad campaign in order to ensure the maximum amount of traffic and of course; make sure that it doesn’t shatter your budget.</p>\n\n<p>Arcadia SEO has the experience your company needs to efficiently run your Google Adwords campaign, we have many accounts that meet or exceed their budgets every month. Getting started with your Google Adwords campaign is easy; we will help you with every aspect of the start-up process (including adding the most valuable keywords and building the most effective landing pages) and even manage your campaign (setting a budget and reporting your campaigns progress).</p>","image":{"available_sizes":[[[75,83],"assets/images/resized/0011/0999/110999v2-max-150x150.png"],[[75,83],"assets/images/resized/0011/0999/110999v2-max-250x250.png"],[[75,83],"assets/images/resized/0011/0999/110999v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}