{"first_name":"Paul","last_name":"Cheslaw","permalink":"paul-cheslaw","crunchbase_url":"http://www.crunchbase.com/person/paul-cheslaw","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"AVST","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 02 15:09:00 UTC 2009","updated_at":"Fri Feb 26 18:49:32 UTC 2010","overview":"<p>Paul Cheslaw joined AVST in January 2006. Mr. Cheslaw brings over 20 years of experience in selling and supporting enterprise communications to customers worldwide. For the past 15 years, Mr. Cheslaw has been primarily focused on developing, building and managing the European, Middle Eastern and African (EMEA) operations of various firms in the enterprise communications market segment. From early 2003 until joining AVST, Mr. Cheslaw served as the Managing Partner, EMEA for Executive Conversation International, a consulting firm that focuses on strategic sales training for senior management and sales personnel of various high technology companies including Microsoft, Cisco Systems, Intel, Hewlett-Packard and British Telecom. From 2002 to early 2003, Mr. Cheslaw was a partner for BWT Associates, London, the European operations of BWT, a private equity firm headquartered in South Africa, where his primary responsibilities included the evaluation and placement of various investments for the firm&#8217;s investment portfolio. In 2001, Mr. Cheslaw served as Vice President &amp; Managing Director, Europe for Annuncio Software, an e-CRM solution provider that was acquired by PeopleSoft Corporation in early 2002. From 1997 to 2000, Mr. Cheslaw served as the Managing Director, Europe for Latitude Communications, Inc., the developer of the world&#8217;s first voice and data collaboration server. Latitude went public in 1999 and was subsequently acquired by Cisco Systems, Inc. in 2003. From 1987 to 1997, Mr. Cheslaw served in various positions of increasing responsibility for Octel Communications Corporation and prior to their merger, VMX, Inc., including Vice President, Unified Messaging Division, Vice President, Client Server Software Division and Managing Director, Europe during which time VMX achieved the leading position in the European voice processing market through the establishment of long-term distribution agreements with British Telecom, Mercury Communications, Ericsson, Siemens and other major distributors throughout EMEA. Mr. Cheslaw has resided in London since 1987.</p>","image":{"available_sizes":[[[96,110],"assets/images/resized/0007/8385/78385v2-max-150x150.jpg"],[[96,110],"assets/images/resized/0007/8385/78385v2-max-250x250.jpg"],[[96,110],"assets/images/resized/0007/8385/78385v2-max-450x450.jpg"]],"attribution":"<p>AVST Website</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Vice President & General Manager, EMEA","firm":{"name":"AVST","permalink":"avst","type_of_entity":"company","image":{"available_sizes":[[[94,57],"assets/images/resized/0004/6351/46351v2-max-150x150.png"],[[94,57],"assets/images/resized/0004/6351/46351v2-max-250x250.png"],[[94,57],"assets/images/resized/0004/6351/46351v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.iwr.co.uk/crn/news/2185141/avst-widens-distribution-net","title":"AVST widens its distribution net"}],"web_presences":[{"external_url":"http://www.avst.com","title":"AVST"},{"external_url":"http://www.linkedin.com/pub/dir/paul/cheslaw/gb-0-United-Kingdom/","title":"LinkedIn"},{"external_url":"http://www.avst.com/company/mgmt.asp#pcheslaw","title":"AVST Profile"}]}