{"first_name":"Paul","last_name":"Hooper","permalink":"paul-hooper","crunchbase_url":"http://www.crunchbase.com/person/paul-hooper","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 21 05:00:51 UTC 2011","updated_at":"Tue Jun 21 05:04:09 UTC 2011","overview":"<p>Paul A. Hooper leads as the company&#8217;s Chief Marketing Officer. Hooper, a 15 year veteran of the High Tech industry, oversees Extreme Networks worldwide marketing efforts, where he leads global corporate and field marketing, analyst and investor relations, and corporate communications. Prior to that, he served as Vice President and General Manager for the Volume Products Group, responsible for the strategy, product development and business management for Extreme Networks fixed configuration and modular switches and wireless LAN and security solutions. Hooper also serves as Extreme Networks executive sponsor for data center and enterprise LAN initiatives. Prior to that, as Extreme Networks Chief Information Officer, Hooper oversaw the strategic use of IT systems and adherence to corporate compliance for data throughout a globally distributed business. Specifically, Hooper led the planning, procurement and ongoing support of business applications, network infrastructure and related services supporting more than 800 employees across 50 countries. Prior to joining Extreme Networks, Hooper served as vice president of information technology at myCFO, Inc., where he was responsible for the Enterprise Applications and Infrastructure for the fast-growing Financial Services and Advisory company. Hooper has also held senior-level IT positions with JDS Uniphase, Netscape Communications and Sun Microsystems.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Chief Marketing Officer","firm":{"name":"Extreme Networks","permalink":"extreme-networks","type_of_entity":"company","image":{"available_sizes":[[[150,43],"assets/images/resized/0014/0159/140159v1-max-150x150.jpg"],[[250,72],"assets/images/resized/0014/0159/140159v1-max-250x250.jpg"],[[255,74],"assets/images/resized/0014/0159/140159v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}