{"first_name":"Paul","last_name":"Fisher","permalink":"paul-fisher-3","crunchbase_url":"http://www.crunchbase.com/person/paul-fisher-3","homepage_url":"http://www.sonar.me","birthplace":"USA","twitter_username":"paultfisher","blog_url":"http://www.paultepperfisher.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1974,"born_month":9,"born_day":2,"tag_list":"","alias_list":null,"created_at":"Mon Mar 26 16:39:34 UTC 2012","updated_at":"Wed Mar 28 00:17:34 UTC 2012","overview":"<p>Paul Tepper Fisher is currently the CTO at Sonar.me. Before joining Sonar, Paul was the CTO at K2 Media Labs, and also served as the CTO at MarketSharing, one of the profile companies at K2.</p>\n\n<p>Prior to K2, Paul was the Director of Engineering at Lime Wire, leading seven engineering teams for the development of a new cloud-based Streaming Music Service. During his tenure, Paul lead a major restructuring of the technology group, integrating an agile development process that helped to accelerate engineering initiatives.</p>\n\n<p>Previously, Paul managed the technology division for Wired Digital (owned by Condé Nast Publications), growing and overseeing the co-located development teams in both New York and San Francisco for Wired.com, Webmonkey.com, howto.wired.com, and Wired.com Product Reviews.</p>\n\n<p>In 2004, Paul founded DialMercury.com, a real-time communications web-service, allowing end-users to send voice and text message “blasts” to thousands of contacts simultaneously. </p>\n\n<p>In 1998, Paul co-founded SmartPants Media, Inc., a software development company focused on distance learning, video streaming, and interactive marketing. In less than six years, the company earned more than 50 reputable clients — including the International Monetary Fund, the Smithsonian Institution, and TrafficLand.</p>\n\n<p>Paul has co-written two technology books, both published by Apress: Spring Persistence — A Running Start, and Spring Persistence with Hibernate. A new book on the history and future of Cloud Computing, entitled Revolution: Cloud, is in the works.</p>\n\n<p>Paul received a B.A. from Johns Hopkins University in Writing, and a Masters degree from Johns Hopkins University in Digital Media. </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0018/1163/181163v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0018/1163/181163v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0018/1163/181163v2-max-450x450.jpg"]],"attribution":"<p>Paul Tepper Fisher</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}