{"first_name":"Paul","last_name":"Daugherty","permalink":"paul-daugherty","crunchbase_url":"http://www.crunchbase.com/person/paul-daugherty","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Accenture","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Wed Jun 29 19:39:33 UTC 2011","updated_at":"Wed Jun 29 19:39:33 UTC 2011","overview":"<p>Daugherty is Accenture&#8217;s chief technology architect, in which he is responsible for developing and building Accenture’s pool of deeply skilled, certified technology architects. His current focus areas include open source, cloud computing, software-as-a-service, custom solutions, mobility, Web, service-oriented architecture and business process management.</p>\n\n<p>Prior to this role, Daugherty led Accenture’s Technology business in the Resources operating group, which serves clients in the utilities, energy, natural resources, and chemicals sectors.</p>\n\n<p>Daugherty has also been instrumental in leading Accenture initiatives in areas such as eCommerce, and more recently, CIO Agenda, which is focused on rapidly growing the architecture and innovation areas of Accenture’s business.</p>\n\n<p>Daugherty has worked with clients in many industries in areas such as complex systems delivery, infrastructure services, architecture, and IT strategy. Daugherty has also been involved in selling and delivering large business process outsourcing and IT outsourcing engagements.</p>\n\n<p>Daugherty has a degree in computer engineering from the University of Michigan. He frequently speaks at conferences on industry and technology issues, and has published articles in a variety of publications. He is chairman of the advisory board of the New York-based Academy of Information Technology, a nonprofit organization that works with high schools to increase IT career opportunities for urban youth. Daugherty is based in New York City and lives in New Jersey with his wife and four children.</p>","image":{"available_sizes":[[[116,150],"assets/images/resized/0014/1813/141813v1-max-150x150.jpg"],[[130,168],"assets/images/resized/0014/1813/141813v1-max-250x250.jpg"],[[130,168],"assets/images/resized/0014/1813/141813v1-max-450x450.jpg"]],"attribution":"<p>Accenture Biography Page</p>"},"degrees":[{"degree_type":"","subject":"Computer Engineering","institution":"University of Michigan","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chief Technology Architect","firm":{"name":"Accenture","permalink":"accenture","type_of_entity":"company","image":{"available_sizes":[[[150,52],"assets/images/resized/0001/9509/19509v2-max-150x150.png"],[[162,57],"assets/images/resized/0001/9509/19509v2-max-250x250.png"],[[162,57],"assets/images/resized/0001/9509/19509v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}