{"first_name":"Paul","last_name":"Anastasopoulos","permalink":"paul-anastasopoulos","crunchbase_url":"http://www.crunchbase.com/person/paul-anastasopoulos","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Skepsu","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Fri Feb 19 00:46:17 UTC 2010","updated_at":"Fri Feb 19 18:13:33 UTC 2010","overview":"<p>As Chief Product Officer, Paul Anastasopoulos determines Skepsu’s overall product vision and coordinates all operational areas within the company to meet that vision, ultimately working to make Skepsu’s products the industry leaders in quality and innovation.</p>\n\n<p>Before founding Skepsu, Anastasopoulos focused on next-generation conceptual product design for for Adobe Systems Incorporated’s emerging SaaS technologies and new business initiatives. While at Adobe, Paul’s design impact was felt across the entire product portfolio and he was issued several patents for this work. Anastasopoulos also contributed to top-tier, emerging rich internet applications while at Intuit, the world’s largest personal and small business finance software publisher. Over the past decade, Anastasopoulos also led the design vision for numerous desktop, web, rich internet, and mobile applications, serving as principal or senior designer for clients such as LucasFilm, Chevron, Daimler-Chrysler, and LinkedIn.</p>\n\n<p>Anastasopoulos earned his Bachelor of Arts degree from the University of California at Santa Cruz and is an active member of professional design groups such as BayCHI the Bay Area chapter of ACM SIGGRAPH. Paul’s design background has its roots in fine arts, as Paul is also an accomplished artist whose sculptures can regularly be seen at regional art shows. Paul resides in Santa Cruz, CA with his wife and daughter, where they all enjoy mountain biking and surfing on the beautiful Monterey Bay.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0007/7525/77525v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0007/7525/77525v2-max-250x250.jpg"],[[348,348],"assets/images/resized/0007/7525/77525v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"CPO / Co-Founder","firm":{"name":"Skepsu","permalink":"skepsu","type_of_entity":"company","image":{"available_sizes":[[[94,65],"assets/images/resized/0007/7506/77506v4-max-150x150.png"],[[94,65],"assets/images/resized/0007/7506/77506v4-max-250x250.png"],[[94,65],"assets/images/resized/0007/7506/77506v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}