{"first_name":"Paulo","last_name":"Taylor","permalink":"paulo-taylor","crunchbase_url":"http://www.crunchbase.com/person/paulo-taylor","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"eBuddy","born_year":null,"born_month":null,"born_day":null,"tag_list":"ebuddy, mobile, messenger, instant-messaging, mobile-messenger","alias_list":null,"created_at":"Wed Jul 25 12:05:06 UTC 2007","updated_at":"Fri Dec 04 20:43:53 UTC 2009","overview":"<p>Paulo Taylor conceived and created the technology behind eBuddy (formerly e-Messenger), and co-founded the company in 2003. Taylor brings extensive systems architecture and software development experience to eBuddy, the world’s leading independent third-party instant messaging (IM) service.</p>\n\n<p>Prior to co-founding eBuddy, Taylor served as Systems Engineer for telecommunications company, Tiscali BV where he was responsible for developing in-house CRM applications for JAVA and J2EE technologies. Prior to Tiscali, Taylor spent time working as an Application Developer and Team Leader for Interland where he oversaw ASP development of websites for webhosting clients. Taylor also spent time working as a Web Developer for Hiperbit developing news and financial websites using ASP and Visual Basic and developing News/Stock ticker Applets in JAVA. Prior to Hiperbit, Taylor worked as a Software Developer for Terabyte, where he performed C/C++ development programming of Dialogic boards capable of implementing customized PBX solutions for small to medium sized companies. </p>\n\n<p>Taylor’s IT qualifications include experience in C/C++, JAVA, VisualBasic, ASP and SQL languages on Win32 platforms and UNIX/Linux environments. He possesses additional experience in ATL, COM, DCOM, COM+, MTS, MSMQ, XML, SOAP, Web Services, VB Script, JavaScript, HTML, DHTML and .NET framework. </p>\n\n<p>Taylor attended the Instituto Superior de Engenharia de Lisboa (ISEL) in Portugal where he studied Telecommunications and Computer Science from 1994 to 1999. He is fluent in Portuguese, English and Spanish. </p>","image":{"available_sizes":[[[150,101],"assets/images/resized/0006/8554/68554v2-max-150x150.jpg"],[[150,101],"assets/images/resized/0006/8554/68554v2-max-250x250.jpg"],[[150,101],"assets/images/resized/0006/8554/68554v2-max-450x450.jpg"]],"attribution":"<p>eBuddy</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Co-founder","firm":{"name":"eBuddy","permalink":"ebuddy","type_of_entity":"company","image":{"available_sizes":[[[150,58],"assets/images/resized/0000/3781/3781v2-max-150x150.jpg"],[[250,98],"assets/images/resized/0000/3781/3781v2-max-250x250.jpg"],[[450,176],"assets/images/resized/0000/3781/3781v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}