{"first_name":"Paul","last_name":"Zuber","permalink":"paul-zuber","crunchbase_url":"http://www.crunchbase.com/person/paul-zuber","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon May 12 18:20:12 UTC 2008","updated_at":"Mon May 12 18:52:53 UTC 2008","overview":"<p>&#8220;Paul Zuber is the founding Chief Executive Officer of Dilithium. Paul brings nearly twenty years of experience in founding and growing successful global technology companies. Prior to joining Dilithium, Mr. Zuber was President of Solectron Australia, the Australian subsidiary of the world’s leading electronics manufacturing services company. Solectron acquired the company Mr. Zuber co-founded and led as CEO, the Bluegum Group, and Mr. Zuber was asked to remain as President of the new Solectron subsidiary. As Chief Executive Officer and co-founder of Bluegum Group, a full-service, electronic manufacturing services provider serving the Asia Pacific region, Mr. Zuber was responsible for raising $20M in equity and growing the company to revenues of approximately US$250 million with customers including Agilent, Alcatel, Cisco, Hewlett-Packard, IBM, Lucent, and NEC. The 800-employee company grew to be among the 20 largest in the world in its industry before the acquisition by Solectron.</p>\n\n<p>Prior to founding Bluegum, Mr. Zuber held a variety of senior management positions at Ready Systems including Vice President of Operations, Chief Financial Officer, and Vice President of Worldwide Customer Service Operations. Ready Systems was a global leader in software development environments for microprocessor-based embedded systems. The company was acquired by Mentor Graphics, a world leader in electronic design automation software.    </p>\n\n<p>Before joining Ready Systems, Mr. Zuber co-founded John Galt Computer Corporation (San Francisco, California), a leading regional system integrator of microcomputer-based CAD systems and micro-mainframe communications products. As President, Mr. Zuber grew the business profitably and developed a diverse client base of semiconductor and aerospace customers before a private investment group acquired it.     </p>\n\n<p>Mr. Zuber began his career as a management consultant with Bain &amp; Company (Menlo Park, California/Mexico City, Mexico), where he was a founding member of their venture capital group (Bain Capital) and also performed strategy consulting for Fortune 500 technology companies. He holds BA degrees in both International Relations and Economics from Stanford and a MBA from the Stanford Graduate School of Business.&#8221; (Source: <a href=\"http://www.dilithiumnetworks.com/company_info/management_team.asp\" title=\"Dilithium Networks\" rel=\"nofollow\">Dilithium Networks</a>)</p>","image":{"available_sizes":[[[118,140],"assets/images/resized/0001/8384/18384v1-max-150x150.jpg"],[[118,140],"assets/images/resized/0001/8384/18384v1-max-250x250.jpg"],[[118,140],"assets/images/resized/0001/8384/18384v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.dilithiumnetworks.com/company_info/management_team.asp\" title=\"Dilithium Networks\" rel=\"nofollow\">Dilithium Networks</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Co-founder & CEO","firm":{"name":"Dilithium Networks","permalink":"dilithium-networks","type_of_entity":"company","image":{"available_sizes":[[[150,40],"assets/images/resized/0001/8380/18380v1-max-150x150.png"],[[178,48],"assets/images/resized/0001/8380/18380v1-max-250x250.png"],[[178,48],"assets/images/resized/0001/8380/18380v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}