{"first_name":"Paul","last_name":"Trotter","permalink":"paul-trotter","crunchbase_url":"http://www.crunchbase.com/person/paul-trotter","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Author-it Software Corporation","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Dec 02 04:01:04 UTC 2010","updated_at":"Fri Dec 10 19:07:15 UTC 2010","overview":"<p>Paul is the Founder/CEO of Author-it Software Corporation and the architect of the Author-it product. Author-it was born out of the frustrations that Paul experienced producing documentation in the Telecommunications industry. His vision was to solve the problems that content writers face - not provide a cure for the symptoms. The result was Author-it; a product built from the ground up around principles such as topic based writing, single sourcing and separating content from format. Over a decade and five major releases later, these principles remain true of Author-it today and are the basis of the success of the company.</p>\n\n<p>Regarded as a visionary within the industry, Paul is a popular speaker at events all over the world on topics ranging from technical writing and help authoring to content management and localization. Today, Paul continues to drive the product vision for Author-it. In this he applies his problem solving talents to the day to day issues that people face in creating, managing and delivering content. This vision has seen the development of world leading technologies such as Author-it Xtend and Author-it Live.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder and CEO","firm":{"name":"Author-it Software Corporation","permalink":"author-it-software-corporation","type_of_entity":"company","image":{"available_sizes":[[[150,40],"assets/images/resized/0011/2539/112539v2-max-150x150.jpg"],[[250,66],"assets/images/resized/0011/2539/112539v2-max-250x250.jpg"],[[450,120],"assets/images/resized/0011/2539/112539v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}