{"first_name":"Paul","last_name":"Ferris","permalink":"paul-ferris","crunchbase_url":"http://www.crunchbase.com/person/paul-ferris","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 05 18:32:34 UTC 2008","updated_at":"Tue Jan 05 00:20:07 UTC 2010","overview":"<p>Paul Ferris is a founding General Partner with Azure Capital Partners where he specializes in communications and systems technologies. His current active board memberships include Calix Networks, Cyan Optics, Personeta and Phanfare, and he is a board observer at Medsphere. Other representative investments include Innovance Networks and World Wide Packets. Prior successful investments include Com21 (IPO in 1998) and Phone.com (IPO in 1999).</p>\n\n<p>Prior to Azure, Paul worked at several investment banks, including Credit Suisse First Boston, where he was the Global Head of the Communications Investment Banking Group, and at Deutsche Bank Securities and Morgan Stanley, where he focused on communications infrastructure and hardware companies.</p>\n\n<p>Over the course of his career, Paul has provided strategic and investment advice to numerous leading communications infrastructure companies. Notable firms include ADC Telecommunications, Broadcom, Cerent (acquired by Cisco Systems), Com21, Efficient Networks (acquired by Siemens), Lucent Technologies, Next Level Communications, New Focus, Nortel Networks, Packet Engines (acquired by Alcatel), Phone.com, Siara Systems (acquired by Redback Networks), Siemens and Xros (acquired by Nortel Networks).</p>\n\n<p>Paul received his B.A. degrees in Computer Science and English from Amherst College, where he graduated summa cum laude.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Azure Capital Partners","permalink":"azure-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,69],"assets/images/resized/0001/9293/19293v1-max-150x150.png"],[[204,94],"assets/images/resized/0001/9293/19293v1-max-250x250.png"],[[204,94],"assets/images/resized/0001/9293/19293v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}