{"first_name":"Paul","last_name":"Santinelli","permalink":"paul-santinelli","crunchbase_url":"http://www.crunchbase.com/person/paul-santinelli","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"North Bridge Venture Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jul 09 19:24:21 UTC 2012","updated_at":"Fri Jul 27 21:00:16 UTC 2012","overview":"<p>Paul Santinelli focuses on investments in open source, software, security, Internet applications and infrastructure &amp; communications. Previously, he served as director of Red Hat Network and was responsible for product definition, strategy, engineering, product management, marketing and lifecycle management for the company&#8217;s flagship software services offering. Paul also served as the director of global information systems and technology during his tenure at Red Hat.</p>\n\n<p>Prior to Red Hat, Paul was founder and CEO of NOCpulse, a Silicon Valley software start-up focused on delivering the next generation enterprise systems management platform. NOCpulse was acquired by Red Hat in October 2002. While at NOCpulse, Paul was nominated for the Ernst &amp; Young Entrepreneur of the Year Award of 2002. Previously, Paul was chief technology officer of Global Center and Vice President of technology for Global Crossing, a telecommunications company that built and operated the world&#8217;s first independent global fiber optic network. During the past twelve years, Paul has held various engineering, product management and marketing positions in companies including Red Hat, IBM, Lotus Development and Compuware.</p>\n\n<p>Before joining North Bridge, Paul served on the advisory boards of Arrowpoint Communications (acquired by Cisco), Inflow, Kiva Software (acquired by Netscape), Mobility.net (acquired by Software.com) and One Secure (acquired by Netscreen).</p>\n\n<p>Paul has a BS from Emerson College in Boston.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"North Bridge Venture Partners","permalink":"north-bridge-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,42],"assets/images/resized/0001/0794/10794v1-max-150x150.png"],[[250,70],"assets/images/resized/0001/0794/10794v1-max-250x250.png"],[[257,72],"assets/images/resized/0001/0794/10794v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}