{"first_name":"Paul","last_name":"Calello","permalink":"paul-calello","crunchbase_url":"http://www.crunchbase.com/person/paul-calello","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 21 18:48:39 UTC 2008","updated_at":"Fri Nov 21 18:52:22 UTC 2008","overview":"<p>Paul Calello is the Chief Executive Officer Investment Banking, Credit Suisse. He is a member of the Executive Boards of Credit Suisse and Credit Suisse Group.</p>\n\n<p>Mr. Calello has held senior management positions at Credit Suisse in New York, Tokyo, London and Hong Kong. Before assuming his current role in May 2007, he was CEO of Credit Suisse Asia Pacific with responsibility for Investment Banking, Private Banking and Asset Management.</p>\n\n<p>Mr. Calello joined the Bank in 1990 as a founding member of Credit Suisse Financial Products, the former financial derivatives subsidiary of Credit Suisse First Boston. He was named to the Investment Bank’s Executive Board in 1997. From 1997 to 2002, he served as Global Head of Equity Derivatives and Convertible Bonds and Global Head of Commodities and Fixed Income Derivatives from 1992 to 2000.</p>\n\n<p>In 2002, Mr. Calello was appointed Chairman and CEO of Credit Suisse’s Investment Bank in Asia Pacific, and, in 2006, assumed responsibility for all of the Bank’s operations in the region. During that time, Mr. Calello was personally involved in many transactions that have been pivotal to the development of the region’s capital markets, and instrumental to positioning Credit Suisse as a leading bank in Asia Pacific.</p>\n\n<p>Prior to joining Credit Suisse, Mr. Calello worked in the Global Markets Group of Bankers Trust Company in New York and Tokyo. Before that, he worked at the Federal Reserve System in the Monetary and Economic Policy Research Group in Boston and Washington, D.C.</p>\n\n<p>Mr. Calello is a member of the Council on Foreign Relations and the Foreign Policy Association. He also serves on the International Board of Advisors to Philippines President Gloria Macapagal-Arroyo.</p>\n\n<p>Mr. Calello earned his undergraduate degree from Villanova University. He received an M.B.A. from Columbia Business School, where he has served as a guest lecturer in Finance. He is a member of the Columbia Business School Board of Overseers. Mr. Calello is also a Trustee of the Credit Suisse Foundation.</p>","image":{"available_sizes":[[[135,100],"assets/images/resized/0002/9147/29147v1-max-150x150.jpg"],[[135,100],"assets/images/resized/0002/9147/29147v1-max-250x250.jpg"],[[135,100],"assets/images/resized/0002/9147/29147v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Chief Executive Officer, Investment Banking","firm":{"name":"Credit Suisse","permalink":"credit-suisse","type_of_entity":"financial_org","image":{"available_sizes":[[[150,27],"assets/images/resized/0002/9146/29146v1-max-150x150.jpg"],[[175,32],"assets/images/resized/0002/9146/29146v1-max-250x250.jpg"],[[175,32],"assets/images/resized/0002/9146/29146v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}