{"first_name":"Pedro","last_name":"Moneo","permalink":"pedro-moneo-2","crunchbase_url":"http://www.crunchbase.com/person/pedro-moneo-2","homepage_url":"http://www.opinno.com/pedro-moneo-en/","birthplace":"Madrid","twitter_username":"pedromoneo","blog_url":"http://www.opinno.com","blog_feed_url":"http://www.opinno.com/news/rss.xml","affiliation_name":"Unaffiliated","born_year":1977,"born_month":5,"born_day":29,"tag_list":"","alias_list":null,"created_at":"Wed Sep 02 02:42:54 UTC 2009","updated_at":"Mon Aug 08 19:03:42 UTC 2011","overview":"<p>Pedro Moneo is the CEO and Founder of Opinno. He also runs the headquarters of Opinno in San Francisco. Pedro is a mechanical engineer from the Polytechnic University in Madrid and a nuclear engineer from the French Nuclear Commission.</p>\n\n<p>Pedro began his career as a researcher at the Argonne National Laboratory of Illinois in the division of advanced reactors.  Following his return to Spain, he spent a number of years in the Division of Strategy and Corporate Finance at Accenture, where he participated in the development of many strategic plans and corporate transactions for technology companies and industries, including several Fortune 500 companies, in the sectors of telecommunications, equipment, air transport, railroads and highways, automotives, construction and shipyards.</p>\n\n<p>Pedro has been the deputy director of the FEDIT Technology Centers of Spain, the largest network of private applied research and development in Spain, which accounts for 70 agencies and employs more than 7,000 researchers and specialists in all branches of the Spanish industry and a total turnover of more than 600 million Euros (USD 850 million). Pedro joined FEDIT to build and run its latest strategic plan. This plan allowed the company to develop an important growth strategy for private R&amp;D (18% annual growth rate maintained for three years) while establishing and strengthening alliances and international units, technological intelligence, communication, public policy analysis and network development.  </p>\n\n<p>Pedro is founding partner and shareholder of renewable power companies like Prosolar (Solar Power), Magallón 27 (Wind Power) and Allwatt S.L.</p>","image":{"available_sizes":[[[69,150],"assets/images/resized/0005/8507/58507v6-max-150x150.jpg"],[[116,250],"assets/images/resized/0005/8507/58507v6-max-250x250.jpg"],[[208,450],"assets/images/resized/0005/8507/58507v6-max-450x450.jpg"]],"attribution":"<p>Pedro Moneo (Opinno)</p>"},"degrees":[{"degree_type":"Nuclear Engineering","subject":"Nuclear Engineering","institution":"French Atomic Energy Commission","graduated_year":2002,"graduated_month":null,"graduated_day":null},{"degree_type":"Mechanical Engineer","subject":"Mechanical Engineer","institution":"Universidad Politécnica de Madrid","graduated_year":2002,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/pedromoneo","title":"Twitter"},{"external_url":"http://www.linkedin.com/profile?viewProfile=&key=1904892&trk=tab_pro","title":"LinkedIn"}]}