{"first_name":"Pekka","last_name":"Himanen","permalink":"pekka-himanen","crunchbase_url":"http://www.crunchbase.com/person/pekka-himanen","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jan 29 23:22:23 UTC 2009","updated_at":"Thu Jan 29 23:22:23 UTC 2009","overview":"<p>Prof. Himanen is a leading researcher of the information age, whose works on the subject have been published in 20 languages from Asia to America. He is author of the highly influential books, The Hacker Ethic (2001), and The Information Society and the Welfare State (co-author, 2002).</p>\n\n<p>Prof. Himanen has produced new information society strategy for the Finnish Parliament&#8217;s Committee for the Future and a national innovation strategy for the Finnish Technology Industry. He has written numerous articles for Time Magazine to The Financial Times, and hosted his own TV series, The Net Academy. Himanen&#8217;s cultural figure has even inspired a provocative theater play, Cherished Disappointments in Love, performed in Finland and London (Soho Theatre).</p>\n\n<p>Himanen is a professor at the University of Art and Design Helsinki, visiting professor at Oxford, and a principal scientist at the Helsinki Institute for Information Technology. He obtained his PhD in Philosophy as the youngest doctor ever in Finland at the age of 20 (University of Helsinki 1994). He received the WEF Forum respected Global Leader for Tomorrow Award in 2003 and in 2005 was selected as a Young Global Leader.</p>","image":{"available_sizes":[[[96,150],"assets/images/resized/0003/5267/35267v1-max-150x150.jpg"],[[160,250],"assets/images/resized/0003/5267/35267v1-max-250x250.jpg"],[[240,373],"assets/images/resized/0003/5267/35267v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}