{"first_name":"Per","last_name":"Feldthaus","permalink":"per-feldthaus","crunchbase_url":"http://www.crunchbase.com/person/per-feldthaus","homepage_url":"http://www.fourmation.com","birthplace":"Denmark","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"design, co-creation, innovation, business-design, strategy, entrepreneurship","alias_list":null,"created_at":"Fri Sep 24 08:49:15 UTC 2010","updated_at":"Thu Oct 07 18:45:00 UTC 2010","overview":"<p>Per is a passionate entrepreneur and design thinker, merging a rational analytical approach with an intuitive co-creative approach to innovation. Originally an architect, he holds an MBA, has been - and still is - a member of several boards of directors. As a Adjunced Professor at the Aarhus School of Architecture, Denmark and Steering Committee member of the Beijing Tsinghua University, China MEGA-Master Programme he links innovation and business design to the latest international academic research. </p>\n\n<p>At the age of only 36, Per became a Partner in Arkitema Architects and was shortly after appointed CEO. Through the next 10 years, the Architectural Studio experienced massive growth: from being a minor Danish Studio, Arkitema expanded into Denmark’s largest Architectural Design Company with 300 employees and a significant international turnover.</p>\n\n<p>In 2008, Per relocated to China with his family and shortly hereafter established Eco:Laborate. The company bridges core competences between sustainability and energy efficient buildingdesign in Denmark and the rapidly growing Chinese market.</p>\n\n<p>Relocated to Copenhagen in 2010 as a co-founder of Fourmation - an Idea Lab focusing on the invention and development of innovative services and products - based on web services and web 2.0 technologies. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner, Co-founder","firm":{"name":"Fourmation","permalink":"fourmation","type_of_entity":"company","image":{"available_sizes":[[[150,149],"assets/images/resized/0009/1777/91777v2-max-150x150.png"],[[250,249],"assets/images/resized/0009/1777/91777v2-max-250x250.png"],[[273,272],"assets/images/resized/0009/1777/91777v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}