{"first_name":"Per","last_name":"von Zelowitz","permalink":"per-von-zelowitz-2","crunchbase_url":"http://www.crunchbase.com/person/per-von-zelowitz-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Nov 24 12:15:11 UTC 2008","updated_at":"Mon Nov 24 12:20:39 UTC 2008","overview":"<p>Per joined Nordic Venture Partners in 2004 and has been sourcing, executing and managing investments in the communications, digital media, enterprise and consumer software and services sectors. Per’s international career includes experience in venture capital, strategic consulting and financial services.</p>\n\n<p>Prior to joining Nordic Venture Partners he was an investment manager with Argnor Wireless Ventures and a strategic advisor with Northstream (acquired by VeriSign). At Argnor, Per executed investments in early-stage communications companies. During his tenure at Northstream he served startup and Fortune 500 clients in the communications sector. Earlier, Per was an underwriting officer with the Chubb Group, the leading global provider of specialty business insurance, in the United States.</p>\n\n<p>Per represents Nordic Venture Partners on the boards of NYX Interactive, Jalbum, blinkBox and Player X and serves as a member of the Board of Trustees of Macalester College.</p>\n\n<p>Per received an MBA with a focus on Entrepreneurship and Strategy from the University of Cambridge in the United Kingdom and a double BA from Macalester College in the United States. He is completing a BSc Hons. in Information and Communication Technologies with the Open University.</p>\n\n<p>email: pvz@nordic.com</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Nordic Venture Partners","permalink":"nordic-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,61],"assets/images/resized/0002/9418/29418v1-max-150x150.jpg"],[[194,80],"assets/images/resized/0002/9418/29418v1-max-250x250.jpg"],[[194,80],"assets/images/resized/0002/9418/29418v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}