{"first_name":"Per","last_name":"Sondergaard","permalink":"per-sondergaard","crunchbase_url":"http://www.crunchbase.com/person/per-sondergaard","homepage_url":"http://www.chanti.de","birthplace":"","twitter_username":"","blog_url":"http://silberschmuck.onsugar.com/Jewels-you-love-own-12649671","blog_feed_url":"","affiliation_name":"CHANTI","born_year":1980,"born_month":null,"born_day":null,"tag_list":"gold-schmuck, silber-schmuck, halsketten, perlenketten","alias_list":null,"created_at":"Fri Dec 17 11:49:22 UTC 2010","updated_at":"Sat Dec 18 21:16:51 UTC 2010","overview":"<p>The year is about to end and there was fight in December between several fast growing companies to set their popularity index in Denmark and Europe,  Several companies contested the race from social media start-up companies to Jewellery companies,  Chanti one of the top company manufactures and sells fine Silver and Diamond,  and &lt;a href=&quot;http://www.chanti.de&gt;Gold Schmuck&lt;/a&gt; (Gold Jewellery) online has won the award in 2010, it’s one of the best company to buy jewellery online due to its wonder new designs introduced each seasons and excellent track record of good customer support, which is must in any online business, Chanti had all this things which was voted by customers in Denmark &amp; other parts of Europe including Germany, Holland, UK, Norway, Sweden and Finland.</p>\n\n<p>Per Sondergaard founder and owner of CHANTI was interviewed, were he discussed his business plans to tap other fast moving European market, specially Germany, Austria, UK where buying online over internet is very well accepted and has great internet user density among any European Countries. </p>\n\n<p>It’s not easy to sell over internet you have to give very unique products and designs from time to time as online world is full of choices as customers visits several sites before settles to buy from one, so the customer is more educated on what to buy, again you have to also offer highly competitive pricing as well as fast delivery and customer support allows companies to establish online, the recent award has recognized CHANTI as best company in Denmark and Europe for outstanding customer satisfaction.</p>","image":{"available_sizes":[[[150,83],"assets/images/resized/0011/4443/114443v2-max-150x150.jpg"],[[250,138],"assets/images/resized/0011/4443/114443v2-max-250x250.jpg"],[[450,249],"assets/images/resized/0011/4443/114443v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"CHANTI","permalink":"chanti","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}