{"first_name":"Perianne","last_name":"Grignon","permalink":"perianne-grignon","crunchbase_url":"http://www.crunchbase.com/person/perianne-grignon","homepage_url":"http://www.xplusone.com","birthplace":"Jersey City, NJ","twitter_username":"perianne","blog_url":"http://www.xplusblog.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 15 20:58:32 UTC 2012","updated_at":"Fri Aug 17 11:05:20 UTC 2012","overview":"<p>A leading media and marketing strategist, Perianne Grignon serves as CMO of [x+1] charting the company’s thought leadership and brand activities.  </p>\n\n<p>• Grignon was the Vice President of Media Strategy &amp; Digital Innovation at Sears Holdings Corporation before joining [x+1] in 2010 where she developed the widely successful partnership with ABC’s Extreme Makeover: Home Edition and led the company into the use of digital and social media while controlling an annual media budget of $1 Billion.</p>\n\n<p>• Grignon was the Senior VP of Marketing at the Online Publishers Association, the industry trade association that represents the interests of high quality online content sites.  And before joining Sears in 1998, her previous roles included Director of Media Strategy at AT&amp;T and Executive Vice President and Director of Media and New Technologies at Bates Worldwide.</p>\n\n<p>• Grignon is former co-chairperson of the ANA Television Committee and a member of the Executive Committee of the Family Friendly Programming Forum.  She was named a 2008 Media Maven by Advertising Age, a Working Mother of the Year by AWNY, is a frequent speaker at media industry events and volunteers her time and expertise to the Taproot Foundation in New York City.  </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://twitter.com/perianne","title":"@perianne"}]}