{"first_name":"Peter","last_name":"Barrett","permalink":"peter-barrett","crunchbase_url":"http://www.crunchbase.com/person/peter-barrett","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Mar 30 15:15:57 UTC 2008","updated_at":"Mon Dec 22 22:08:57 UTC 2008","overview":"<p>Peter Barrett is a Partner in the life sciences group and joined Atlas Venture in 2002.</p>\n\n<p>Previously, he was a co-founder, Executive Vice President and Chief Business Officer of Celera Genomics. Within two years of the founding of the company (1998), Celera announced the first successful sequencing of the human genome. Peter helped launch Celera as a publicly traded entity in 1999, and it became a leading force within the biotechnology industry. Peter led Celera’s expansion into drug discovery and development, forging strategic alliances with technology companies and leading the acquisition of Axys Pharmaceuticals.</p>\n\n<p>Prior to Celera, Peter held senior management positions at The Perkin-Elmer Corporation, most recently serving as Vice President, Corporate Planning and Business Development. During his tenture, he expanded the life science business units through a series of licensing agreements, partnerships and acquisitions including: Applied Biosystems, Tropix, Molecular Informatics, PerSeptive Biosystems, and Genscope. Also during this time, Peter co-founded Celera Genomics with Dr. J. Craig Venter and the Applera Corporation management team. Additional managerial roles included Executive Vice President of the Applied Biosystems Division of Perkin-Elmer.</p>\n\n<p>Peter currently serves on the boards of Atlas portfolio companies Akela Pharma (TSX: AKL), Archemix, Aureon Laboratories, Helicos Biosciences (NASDAQ: HLCS), InfaCare Pharmaceuticals, IVREA Pharmaceuticals, Momenta Pharmaceuticals (NASDAQ: MNTA), Stromedix, Vitae Pharmaceuticals and Zafgen. He is chairman of the board at IVREA, Momenta and Zafgen. In addition to his current board seats, Peter is also a board member of former Atlas Venture portfolio company Alnylam (NASDAQ: ALNY).</p>\n\n<p>Peter is currently Vice Chairman of the Advisory Council of the Barnett Institute of Chemical and Biological Analysis at Northeastern University, as well as Adjunct Professor at the Barnett Institute. He also serves as President of the Autism Consortium, a non-profit institution.</p>\n\n<p>Peter received his Bachelor of Science in Chemistry from Lowell Technological Institute (now known as the University of Massachusetts, Lowell) and his Ph.D. in Analytical Chemistry from Northeastern University. He also completed Harvard Business School&#8217;s Management Development Program.</p>","image":{"available_sizes":[[[122,150],"assets/images/resized/0003/2302/32302v1-max-150x150.jpg"],[[180,220],"assets/images/resized/0003/2302/32302v1-max-250x250.jpg"],[[180,220],"assets/images/resized/0003/2302/32302v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.atlasventure.com/ourteam/bio.cfm?id=45\" title=\"Atlas Ventures\" rel=\"nofollow\">Atlas Ventures</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Atlas Venture","permalink":"atlas-venture","type_of_entity":"financial_org","image":{"available_sizes":[[[150,27],"assets/images/resized/0000/3403/3403v1-max-150x150.jpg"],[[250,45],"assets/images/resized/0000/3403/3403v1-max-250x250.jpg"],[[267,49],"assets/images/resized/0000/3403/3403v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[{"funding_round":{"round_code":"angel","source_url":"http://www.thealarmclock.com/mt/archives/2008/12/group_blogging.html","source_description":"Group Blogging Via Email's Posterous Raises $725K","raised_amount":725000,"raised_currency_code":"USD","funded_year":2008,"funded_month":12,"funded_day":1,"company":{"name":"Posterous","permalink":"posterous","image":{"available_sizes":[[[150,49],"assets/images/resized/0002/1222/21222v7-max-150x150.png"],[[250,82],"assets/images/resized/0002/1222/21222v7-max-250x250.png"],[[288,95],"assets/images/resized/0002/1222/21222v7-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}