{"first_name":"Peter","last_name":"Harris","permalink":"peter-harris","crunchbase_url":"http://www.crunchbase.com/person/peter-harris","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"University Venture Fund","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jun 30 21:17:20 UTC 2010","updated_at":"Tue Nov 02 15:43:15 UTC 2010","overview":"<p>Since joining UVF May 2007, Peter Harris has worked on a wide variety of deals, ranging from medical device firms to customer relationship management software companies. As a student Senior Associate, Mr. Harris recruited and trained over 30 other students and led more than 20 different deals and projects, including the recent Transpond investment. In September of 2009, Mr. Harris began working full-time at the University Venture Fund as a Principal. In that role, he is responsible for building deal flow, recruiting and training new students, and managing multiple diligence processes and projects. He maintains board observer seats with Transpond, and Alianza, and keeps track of the majority of the portfolio.</p>\n\n<p>Mr. Harris is very interested in sustainable poverty alleviation through business solutions. As a microfranchise consultant, he has worked with notable NGOs and businesses including the International Rescue Committee and a Fortune 500 company as they worked to open and expand business operations in the West African countries of Ghana and Sierra Leone. He is currently writing a peer-reviewed journal article analyzing the effectiveness of the microfranchising business model in developing countries using statistical modeling. Mr. Harris graduated from Brigham Young University as an Honors double major in Economics and International Business.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Principal","firm":{"name":"University Venture Fund","permalink":"university-venture-fund","type_of_entity":"financial_org","image":{"available_sizes":[[[125,125],"assets/images/resized/0004/6980/46980v3-max-150x150.png"],[[125,125],"assets/images/resized/0004/6980/46980v3-max-250x250.png"],[[125,125],"assets/images/resized/0004/6980/46980v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}