{"first_name":"Peter","last_name":"Charbonneau","permalink":"peter-charbonneau","crunchbase_url":"http://www.crunchbase.com/person/peter-charbonneau","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Dec 01 07:47:06 UTC 2008","updated_at":"Mon Dec 01 07:52:08 UTC 2008","overview":"<p>Peter joined Skypoint in 2001 and is a principal of Fund II. Prior to Skypoint, Peter was a senior executive with Newbridge, where he played a key role during the company’s period of extraordinary growth and success. He joined Newbridge in its early days as chief financial officer and over the next 13 years was promoted to the positions of Executive Vice-President, President and Chief Operating Officer, and Vice-Chairman. He was also a member of the company’s board of directors from 1996 until 2000. As the CFO of Newbridge, he led the company’s successful cross-border IPO in 1989 and its second cross-border offering three years later. As Vice-Chairman, he focused on enhancing the company&#8217;s relations with key external stakeholders. He also worked closely with the chairman and management team to chart the company&#8217;s strategic direction. While at Newbridge, Peter was instrumental in establishing the company’s Affiliates Program and was involved in the funding of more than 40 affiliate companies. He represented Newbridge as a board member for many of these affiliates.</p>\n\n<p>Peter is a member of the Institute of Chartered Accountants of Ontario. In June 2003, he was elected a Fellow of the Institute in recognition of his outstanding career achievements and leadership contributions to the community and his profession. Peter holds a Bachelor of Science from the University of Ottawa and an MBA from the University of Western Ontario.</p>","image":{"available_sizes":[[[59,150],"assets/images/resized/0003/0382/30382v1-max-150x150.jpg"],[[98,250],"assets/images/resized/0003/0382/30382v1-max-250x250.jpg"],[[142,361],"assets/images/resized/0003/0382/30382v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Principal Fund-II","firm":{"name":"Skypoint Capital","permalink":"skypoint-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[149,90],"assets/images/resized/0003/0378/30378v1-max-150x150.jpg"],[[149,90],"assets/images/resized/0003/0378/30378v1-max-250x250.jpg"],[[149,90],"assets/images/resized/0003/0378/30378v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}