{"first_name":"Peter","last_name":"Sims","permalink":"peter-sims","crunchbase_url":"http://www.crunchbase.com/person/peter-sims","homepage_url":"http://petersims.com/","birthplace":"","twitter_username":"petersims","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Tue Apr 19 17:46:55 UTC 2011","updated_at":"Mon Jul 25 18:39:17 UTC 2011","overview":"<p>Peter Sims is a best-selling author and entrepreneur.  His latest book is Little Bets: How Breakthrough Ideas Emerge from Small Discoveries, from Simon &amp; Schuster: Free Press, and he was the coauthor with Bill George of True North, the Wall Street Journal and BusinessWeek best-seller.</p>\n\n<p>He has had a long collaboration with faculty at Stanford’s Institute of Design (the d.school), and received an M.B.A. from Stanford Business School where he established a popular class.  Previously, he worked in venture capital with Summit Partners, including as part of the team that established Summit’s European Office in London.</p>\n\n<p>His articles have appeared in The Financial Times, Harvard Business Review, Tech Crunch, and as an Expert blogger for Fast Company.  He frequently speaks or advises at corporations, associations, and universities, including Google, Eli Lilly, Pixar, ConAgra, Cisco Systems, Current TV, Amazon, and Stanford University.</p>\n\n<p>A graduate of Bowdoin College, he lives in San Francisco and his great-great-great grandfather, Jacob Gundlach, founded Gundlach Bundschu (GunBun) in Sonoma, California’s oldest family-owned winery, which is run today by his cousins who, unlike Peter, know a lot about wine.</p>","image":{"available_sizes":[[[150,147],"assets/images/resized/0013/1224/131224v1-max-150x150.jpg"],[[250,246],"assets/images/resized/0013/1224/131224v1-max-250x250.jpg"],[[290,286],"assets/images/resized/0013/1224/131224v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}