{"first_name":"Peter","last_name":"Maloney","permalink":"peter-maloney","crunchbase_url":"http://www.crunchbase.com/person/peter-maloney","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Snocap","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 15 07:48:40 UTC 2007","updated_at":"Mon Jun 23 18:27:40 UTC 2008","overview":"<p>Chief Financial Officer at SNOCAP, Inc. responsible for all of the company&#8217;s financial operations, including financial planning, strategic development and office of the controller as well as the customer care function. Maloney also co-led the successful acquisition of SNOCAP by imeem, Inc.</p>\n\n<p>From 2001 to 2006 Maloney served as Vice President of Finance and Chief Financial Officer for Keynote Systems, Inc. (NASDAQ: KEYN), where he directed the financial performance for the company, including managing all finance, accounting, legal, and administrative functions, and during his tenure with the company completed eleven acquisitions and two tender offers. Prior to Keynote Systems he served at Adaptive Broadband Corporation, where he held senior management positions including Senior Vice President of Finance and Senior Vice President of Corporate Development. Maloney was also Vice President of Investor Relations at Republic Industries, Inc., and served in senior financial management positions at Dole Food Company and Arthur Andersen LLP.</p>\n\n<p>Maloney holds an M.B.A. degree in Corporate Finance from the University of Southern California’s Marshall School of Business, a B.B.A. degree in Economics from Temple University’s Fox School of Business, and he is a Certified Public Accountant.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CFO","firm":{"name":"Snocap","permalink":"snocap","type_of_entity":"company","image":{"available_sizes":[[[150,43],"assets/images/resized/0000/4297/4297v1-max-150x150.png"],[[171,50],"assets/images/resized/0000/4297/4297v1-max-250x250.png"],[[171,50],"assets/images/resized/0000/4297/4297v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}