{"first_name":"Peter","last_name":"Boni","permalink":"peter-boni","crunchbase_url":"http://www.crunchbase.com/person/peter-boni","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Sep 22 04:26:33 UTC 2008","updated_at":"Wed May 05 01:05:14 UTC 2010","overview":"<p>As President and Chief Executive Officer of Safeguard, Peter J. Boni draws on more than 25 years of experience as the CEO of technology companies in all stages of growth, and as an operating partner with a large global private equity firm. With both the deal savvy and operating expertise that a successful career affords, Peter is responsible for developing and executing Safeguard’s corporate strategy. His goal is to build on the company’s legacy of identifying businesses in the Technology and Life Sciences sectors with superior growth potential, and applying Safeguard’s capital and strategic, operational and management resources to enhance long-term value for shareholders, partner companies and employees.</p>\n\n<p>Peter is recognized as a leader in both building businesses and restoring troubled companies to growth and profitability. In addition to acting as CEO for several publicly-traded and privately-held companies, he has served as a chairman, a Fortune 500 corporate executive, a NYSE Fortune 1000 president, a management consultant, board member, investor and advisor to institutional investors in both early- and later-stage hardware, software and technology-enabled services firms. After his CEO experience, Peter served as an Operating Partner at Advent International, a leading global private equity firm managing $10 billion.</p>\n\n<p>Under Peter’s stewardship, several noteworthy firms were funded, grown and positioned for liquidity at premiums. Others were recognized among the Inc. 500 as fastest growing private companies. Several were brought to IPO. Some acquired and integrated with the acquired businesses, and/or were themselves acquired by industry leaders such as Computer Associates and Cisco Systems. As a result, Peter was recognized by Ernst &amp; Young as an Entrepreneur of the Year finalist in New England.</p>\n\n<p>A decorated combat veteran, Peter served as an Army infantry officer in Special Operations in Vietnam. Through this life-altering experience, he developed a personal philosophy about the importance of surrounding himself with highly competent, well-trained and motivated individuals. It’s a philosophy he continues to lead his life by and one that he applies to his work every day at Safeguard.</p>\n\n<p>The opportunity to lead Safeguard appealed to Peter’s desire to apply both his strategic and deal-making experience to a forward-thinking company. His insights and lessons learned enable him to add value to Safeguard’s partner companies in areas where Safeguard can best apply its expertise, such as strategic planning, business development, sales, marketing, operations, mergers, acquisitions and finance.</p>\n\n<p>EXPERIENCE</p>\n\n<pre><code>* Advent International – Operating Partner\n* Surebridge, Inc. – Chairman and CEO\n* Prime Response – CEO\n* Cayenne Software – CEO\n* Summa Four – CEO\n* On-Line Software International – President\n* Paramount Communications, Inc. (Software and Information Services Group) – President\n* Data General Corporation – Vice President &amp;amp; General Manager\n</code></pre>\n\n<p>BOARD MEMBER\nSafeguard and Partner Companies</p>\n\n<pre><code>* Advantage Healthcare Solutions, Inc.\n* Clarient, Inc. (Nasdaq: CLRT)\n* Rubicor Medical, Inc.\n* Safeguard Scientifics, Inc.\n</code></pre>\n\n<p>Independent Organizations</p>\n\n<pre><code>* AeA - Vice Chairman\n* National Foundation for Teaching Entrepreneurship (NFTE) – Advisory Board co-Chair\n</code></pre>\n\n<p>EDUCATION</p>\n\n<pre><code>* BA, University of Massachusetts at Amherst\n</code></pre>","image":{"available_sizes":[[[108,150],"assets/images/resized/0002/5410/25410v1-max-150x150.jpg"],[[159,220],"assets/images/resized/0002/5410/25410v1-max-250x250.jpg"],[[159,220],"assets/images/resized/0002/5410/25410v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President and CEO","firm":{"name":"Safeguard Scientifics","permalink":"safeguard-scientifics","type_of_entity":"company","image":{"available_sizes":[[[150,31],"assets/images/resized/0006/7104/67104v3-max-150x150.jpg"],[[250,51],"assets/images/resized/0006/7104/67104v3-max-250x250.jpg"],[[450,93],"assets/images/resized/0006/7104/67104v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}