{"first_name":"Peter","last_name":"Merholz","permalink":"peter-merholz-2","crunchbase_url":"http://www.crunchbase.com/person/peter-merholz-2","homepage_url":"http://www.adaptivepath.com/aboutus/peterme.php","birthplace":"","twitter_username":"","blog_url":"http://www.peterme.com/","blog_feed_url":"","affiliation_name":"Foodspotting","born_year":null,"born_month":null,"born_day":null,"tag_list":"consulting, advisor, training, mentor","alias_list":null,"created_at":"Wed Feb 03 05:07:02 UTC 2010","updated_at":"Thu Feb 04 00:41:12 UTC 2010","overview":"<p>Peter Merholz is a founding partner, board member, and president of Adaptive Path. For more than seven years, Peter has been instrumental in developing Adaptive Path&#8217;s ability to provide world-class consulting, training, and public events.</p>\n\n<p>At Adaptive Path, Peter began with a focus on information architecture, and over time expanded his knowledge to include product strategy, user research, and practice development. He has worked with a wide variety of clients from large multi-national companies to smaller, avant-garde firms and start-ups. Past clients include Hallmark, Intel, Wells Fargo, United Airlines, Vanguard Financial.</p>\n\n<p>Additionally, Peter has overseen the evolution of Adaptive Path&#8217;s events line of business, and remains active in programming. UX Week has become the premier user experience conference, attracting attendees from all over the globe. MX filled an unmet need by establishing a community for managers and directors of user experience.</p>\n\n<p>Peter is an internationally recognized thought leader on user experience. His blogs and his essays for Adaptive Path demonstrate his foresight on issues of information architecture, organizational change, and product strategy. Peter&#8217;s thought leadership is perhaps most dubiously demonstrated in his coining of the term &#8220;blog&#8221; in 1999 when it was a nascent genre.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Advisor","firm":{"name":"Foodspotting","permalink":"foodspotting","type_of_entity":"company","image":{"available_sizes":[[[150,30],"assets/images/resized/0007/4271/74271v2-max-150x150.png"],[[250,50],"assets/images/resized/0007/4271/74271v2-max-250x250.png"],[[450,90],"assets/images/resized/0007/4271/74271v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}