{"first_name":"Pete","last_name":"Peters","permalink":"pete-peters","crunchbase_url":"http://www.crunchbase.com/person/pete-peters","homepage_url":"http://www.pride-in-maintenance.com","birthplace":"","twitter_username":"","blog_url":"http://www.pride-in-maintenance.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1972,"born_month":2,"born_day":2,"tag_list":"management-consulting","alias_list":null,"created_at":"Tue Mar 27 07:24:37 UTC 2012","updated_at":"Fri Mar 30 15:27:57 UTC 2012","overview":"<p>The Maintenance Excellence Institute is a maintenance management consulting firm founded by Ralph W. Pete Peters.  The Maintenance Excellence Institute believes in the basics, simplicity and innovation toward profit-centered and customer-centered maintenance.  We will view your operation and maintenance business as if it was our own. We never recommend solutions that are not cost-justified and without measurable results. The goal is to help you achieve and implement your overall business goals for profit and optimization while gaining maximum value from your current maintenance operations.</p>\n\n<p>The Maintenance Excellence Institute views the initial client interaction as the formation of a long-term alliance. Our success is contingent upon the success of each of our clients. Our Alliance Team members form the skills base for serving you with today&#8217;s most comprehensive and cost effective support for total manufacturing and MRO materials management improvement. Our breadth of experience allows us to understand your overall operation, your total maintenance and storeroom operation. We are combining this into an overall solution for total operations success. Our geographical distance apart is not a limitation in today&#8217;s electronic world for long-term cost effective implementation support.</p>\n\n<p>We work for your results, not deliverables or a report. Our work with you is not successful until the solutions are implemented and validated. Three important deliverables validate results for every client; a Scoreboard for Maintenance Excellence, a CMMS Benchmarking System plus The Maintenance Excellence Index specific to your needs. We will be successful because we work as a team with each client, collaborating and sharing expertise, and working side-by-side with mutual cooperation and commitment. Each client&#8217;s team will bring an in-depth understanding of its unique operation, and we will bring our proven methodology, valuable lessons learned and years of expertise and experience in providing Maintenance Excellence Services, Operational Services and Training for Maintenance Excellence.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0018/1262/181262v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0018/1262/181262v2-max-250x250.jpg"],[[300,300],"assets/images/resized/0018/1262/181262v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.pride-in-maintenance.com","title":"The Maintenance Excellence Institute "}],"web_presences":[]}