{"first_name":"Peter","last_name":"Schloss","permalink":"peter-schloss","crunchbase_url":"http://www.crunchbase.com/person/peter-schloss","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Allied Pacific Sports Network","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jun 10 05:29:49 UTC 2011","updated_at":"Tue Oct 16 05:51:12 UTC 2012","overview":"<p>Peter Schloss is one of the pioneers of satellite television in Asia and award winning corporate lawyer and interactive media executive in China. A founding member of the senior management team of Star TV, he specializes in cross-border media and internet financing and legal/regulatory issues. In 2006 and 2007 he was named by Asia Law and Business as one of the top in-house lawyers in China and one of the top in-house lawyers in Asia. He was also named one of the ALB Hot 100 Lawyers in Asia in 2006.</p>\n\n<p>Mr. Schloss was an executive director of TOM Online Inc. from December 17, 2003 and the chief legal officer of TOM Online from September 1, 2005. He was previously chief financial officer and an executive director of TOM Online from December 17, 2003. Mr. Schloss is also a non-executive independent director of Giant Interactive Group. Giant Interactive is one of China&#8217;s largest online game companies. Giant Interactive is listed on the New York Stock Exchange and trades under the ticker symbol GA. Mr. Schloss was general counsel of IBM China/Hong Kong from 1989 to 1991.</p>\n\n<p>Mr. Schloss was a founding member of the senior management team and served as general counsel of Satellite Television Asian Region Limited, or STAR TV from 1991 to 1996. Star TV was established by Hong Kong media and internet tycoon Richard Li and was later sold to Rupert Murdoch. Mr. Schloss was a director of Star TV from 1993 to 1996 as well as director of Asia Satellite Telecommunications Company Limited (&#8220;Asiasat&#8221;) from November 1991 to June 1993. While at STAR TV Mr. Schloss was involved in the creation of MTV Asia, Channel V, Star Sports and STAR World in addition to other satellite television channels in Asia. Mr. Schloss also played a prominent role in Star TV&#8217;s efforts to assemble the largest Chinese language film library in the world, leading the negotiations, contract drafting and due diligence for the acquisition of Raymond Chow&#8217;s Golden Harvest film library, the Golden Princess film library, the Mandarin Films film library and Dickson Poon&#8217;s D&amp;B Films library. The Chinese language film library assembled by Star TV includes films by Bruce Lee, Jacky Chan, Chow Yun-fat, Michelle Yeoh and director John Wu.</p>\n\n<p>Following Star TV, Mr. Schloss was managing director of ING Barings and head of its Asia Media, Internet and Technology Group from 1999 to 2001. </p>\n\n<p>Mr. Schloss holds a B.A. in Political Science from Tulane University and a Juris Doctorate Degree from the Tulane University Law School. He has served as a director of various companies listed on the Nasdaq, New York Stock Exchange and  the Stock Exchange of Hong Kong.</p>\n\n<p>He was a founder of the Cable and Satellite Broadcasting Association of Asia (CASBAA) in 1992 and has written extensively on the development of China&#8217;s Copyright Law, especially as it pertains to software.</p>\n\n<p>Since 2006 Mr. Schloss has been a member of the Board of Trustees of the International School of Beijing.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"CEO, Co-Founder","firm":{"name":"Allied Pacific Sports Network","permalink":"allied-pacific-sports-network","type_of_entity":"company","image":{"available_sizes":[[[150,38],"assets/images/resized/0013/8575/138575v2-max-150x150.png"],[[248,64],"assets/images/resized/0013/8575/138575v2-max-250x250.png"],[[248,64],"assets/images/resized/0013/8575/138575v2-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Chief Financial Officer, General Counsel & Executive Director","firm":{"name":"Tom Online, Inc.","permalink":"tom-online-inc","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}