{"first_name":"Peter","last_name":"Rokkos","permalink":"peter-rokkos","crunchbase_url":"http://www.crunchbase.com/person/peter-rokkos","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Mar 10 08:46:51 UTC 2008","updated_at":"Mon Mar 10 08:52:30 UTC 2008","overview":"<p>Peter oversees all legal aspects of CIC from investment formation and execution through portfolio management and realization.  In addition, Peter is involved in identifying and evaluating investment opportunities, diligence review of potential targets, structuring and negotiating deal terms and advising portfolio companies.  Prior to joining CIC, Peter was Vice President and Counsel of Lucent Venture Partners, the venture capital investment arm of Lucent Technologies, managing $300 million in equity investments in early-stage technology companies in high-growth communications areas such as optical, data and wireless networking, semiconductors, communications software, professional services and e-commerce, and serving as a director or board observer on a number of portfolio companies.  Previously, as Corporate Counsel - Mergers and Acquisitions at Lucent, Peter led a number of strategic transactions including its acquisitions of Nexabit Networks, Herrmann Technology, Xedia, Enable Semiconductor, VTC and Sybarus Systems; the separation and initial public offering of Agere Systems; numerous spin-outs and divestiture including Lucent’s Optical Fiber Solutions business and a number of strategic minority equity investments.  Peter had previously been an associate in the New York office of Skadden Arps in their Mergers and Acquisitions group.  Peter graduated with honors from the University of Pennsylvania with a Bachelor of Science in Economics from the Wharton School and a Bachelor of Arts in Political Science, and also graduated with honors from the Boston University School of Law with a Juris Doctor.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"General Counsel","firm":{"name":"Comcast Ventures","permalink":"comcast-interactive-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,62],"assets/images/resized/0001/4999/14999v4-max-150x150.jpg"],[[250,104],"assets/images/resized/0001/4999/14999v4-max-250x250.jpg"],[[450,187],"assets/images/resized/0001/4999/14999v4-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Board","firm":{"name":"Giant Realm","permalink":"giant-realm","type_of_entity":"company","image":{"available_sizes":[[[150,96],"assets/images/resized/0001/4993/14993v1-max-150x150.png"],[[160,103],"assets/images/resized/0001/4993/14993v1-max-250x250.png"],[[160,103],"assets/images/resized/0001/4993/14993v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}