{"first_name":"Peter","last_name":"Nickolov","permalink":"peter-nickolov","crunchbase_url":"http://www.crunchbase.com/person/peter-nickolov","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"3Tera","born_year":null,"born_month":null,"born_day":null,"tag_list":"cloud-computing, utility-computing, 3tera","alias_list":null,"created_at":"Sun Mar 30 00:39:34 UTC 2008","updated_at":"Mon Aug 04 20:48:53 UTC 2008","overview":"<p>Peter Nickolov is an experienced entrepreneur who has founded four companies. With 13 years of executive experience in startups developing highly innovative products and over 20 years of software development experience, Mr. Nickolov is a recognized expert in the areas of operating systems, real-time software, networking and storage. He has authored 35 patents and has over 50 innovations in the areas of operating systems, multithreading, kernel mode and real-time software, network protocols, file systems and computing resource aggregation.</p>\n\n<p>As the President and COO of 3TERA, Peter is in charge of day to day business and operations of the company. He is one of the principal inventors of 3TERA&#8217;s core technology.</p>\n\n<p>Prior to 3Tera, Peter founded Z-force, a storage networking company that pioneered file switching and NAS aggregation, where he served as vice president of software. He led ZForce&#8217;s engineering team to the successful delivery of a product that set records for file system performance, scalability and cost efficiency. Prior to Z-force, Peter founded Object Dynamics, a software company providing network infrastructure software, where he served as VP of Engineering. He also founded System Research, an infrastructure software company, where he developed the ProLink network operating system.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President, COO and CTO","firm":{"name":"3Tera","permalink":"3tera","type_of_entity":"company","image":{"available_sizes":[[[150,51],"assets/images/resized/0001/6543/16543v3-max-150x150.png"],[[150,51],"assets/images/resized/0001/6543/16543v3-max-250x250.png"],[[150,51],"assets/images/resized/0001/6543/16543v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}