{"first_name":"Peter","last_name":"D. Meldrum","permalink":"peter-d-meldrum","crunchbase_url":"http://www.crunchbase.com/person/peter-d-meldrum","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jun 21 08:41:33 UTC 2009","updated_at":"Sun Jun 21 08:42:07 UTC 2009","overview":"<p>Mr. Meldrum is currently the President, Chief Executive Officer and a Director of Myriad Genetics, a publicly-traded biopharmaceutical company.  He has been a Director of the Company since its inception in May 1991 and has been President and Chief Executive Officer since November 1991. </p>\n\n<p>Prior to his time at Myriad he was President and Chief Executive Officer of Founder’s Fund, LLC, a venture capital group specializing in the biotechnology industry.  While at Founder’s Fund he was involved in the establishment of nine portfolio companies that raised over $1 billion dollars, three of which successfully completed public offerings.</p>\n\n<p>In 2002, Mr. Meldrum was selected by Scientific American as one of the Top 50 Scientific Visionaries in the World.  He also received the Mountain West Venture’s Entrepreneur of the Year Award in 2001, and was awarded the Governor’s Medal for Science and Technology in 1998.  Mr. Meldrum currently serves as a member of the Engineering National Advisory Council, University of Utah College of Science Advisory Board, Executive Board of the Utah Life Sciences Association and Chairman of the Science Advisory Board at Westminster College. </p>\n\n<p>Mr. Meldrum received an MBA degree from the University of Utah in 1974 and a B.S. degree in Chemical Engineering from the University of Utah in 1970.  In 2004 he received an honorary doctorate degree from Westminster College.</p>","image":{"available_sizes":[[[85,100],"assets/images/resized/0004/9959/49959v1-max-150x150.jpg"],[[85,100],"assets/images/resized/0004/9959/49959v1-max-250x250.jpg"],[[85,100],"assets/images/resized/0004/9959/49959v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chairman, Board of Directors","firm":{"name":"Golden Pine Ventures","permalink":"golden-pine-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,38],"assets/images/resized/0004/9957/49957v2-max-150x150.png"],[[250,64],"assets/images/resized/0004/9957/49957v2-max-250x250.png"],[[450,116],"assets/images/resized/0004/9957/49957v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}