{"first_name":"Peter","last_name":"Carzasty","permalink":"peter-carzasty","crunchbase_url":"http://www.crunchbase.com/person/peter-carzasty","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"ActiveCause","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jul 30 16:40:27 UTC 2008","updated_at":"Wed Jul 06 23:17:56 UTC 2011","overview":"<p>Peter B. Carzasty has more than 25 years experience as a cultural advocate and specialist in institutional brand identity for clients in the profit and nonprofit sectors. His work has included the development of strategic alliances between business and cultural institutions for the creation of greater global visibility, brand loyalty and expansion of mutual core competency.  Prior to founding VirtualTable LLC,  Carzasty planned and implemented comprehensive communications plans for the launch of more than 18 major cultural and retail facilities and/or new programs, including the restoration and revitalization of Grand Central Terminal and the launch of Lincoln Center’s annual summer festival.  </p>\n\n<p>His corporate work has included developing programs for Rolex, Warner Bros, Mattel, and in particular, Sara Lee Corporation’s Millennium Gift to America – a philanthropic initiative consisting of the corporation’s divestiture of its $130 million art collection and donation to museums nationally and internationally.  Its national success was instrumental in Sara Lee’s awarding of the National Medal of Arts Award from President Bill Clinton.  </p>\n\n<p>Mr. Carzasty’s tenure includes Director of Publicity and Public Relations for the Brooklyn Academy of Music. He was the co-creator of &#8220;Arts Day U.S.A.&#8221; involving 45 arts organizations nationwide, campaigning for Senate approval of the reauthorization of the National Endowment for the Arts.  He also designed and implemented all media coverage for the appearance of the late Princess of Wales for her first official solo visit to the United States as the Royal Patroness of the Welsh National Opera for its American debut – a national live broadcast event.</p>\n\n<p>Mr. Carzasty is a member of the board of directors of the Philharmonic Orchestra of the Americas and served on the board of directors of Danspace Project in Manhattan for eight years.  </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0005/3774/53774v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0005/3774/53774v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0005/3774/53774v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MFA","subject":"Peforming Arts Administration ","institution":"Brooklyn College of City University of New York ","graduated_year":1983,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Peter did not work here, he worked for Virtual Table LLC","firm":{"name":"ActiveCause","permalink":"activecause","type_of_entity":"company","image":{"available_sizes":[[[150,33],"assets/images/resized/0002/3050/23050v3-max-150x150.jpg"],[[250,56],"assets/images/resized/0002/3050/23050v3-max-250x250.jpg"],[[431,97],"assets/images/resized/0002/3050/23050v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}