{"first_name":"Peter","last_name":"Brooke","permalink":"peter-brooke-2","crunchbase_url":"http://www.crunchbase.com/person/peter-brooke-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Advent International","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri May 29 19:52:08 UTC 2009","updated_at":"Mon Aug 06 18:07:23 UTC 2012","overview":"<p>Peter Brooke has over 40 years of banking and venture capital experience in the U.S., Europe, Asia and other international markets.</p>\n\n<p>He founded Advent International in 1984 as the successor to TA Associates in the management of international private equity investment programs. In addition to serving as CEO of Advent for 11 years, he helped establish numerous affiliated venture capital and private equity firms in Europe, Asia, Latin America and Israel.</p>\n\n<p>Prior to forming Advent, Peter was the managing partner of TA Associates, a Boston-based private equity firm he founded in 1968. From 1963 to 1968, Peter worked for the investment banking firm of Tucker, Anthony &amp; RL Day, where he was in charge of its corporate finance and venture capital activities. Earlier, he was head of the venture capital department of Bessemer Securities. He began his career as a lending officer at the First National Bank of Boston, where he founded the High Technology Lending Group.</p>\n\n<p>Peter is a member of the Private Equity Hall of Fame and recipient of the National Venture Capital Association&#8217;s Lifetime Achievement in Venture Capital Award and Harvard Business School&#8217;s Alumni Achievement Award. He is also a Fellow of the American Academy of Arts and Science. The Boston Business Journal named him one of Greater Boston&#8217;s 100 most influential business people of the 20th century.</p>\n\n<p>Qualifications\nPeter is a graduate of Harvard University and Harvard Business School.</p>","image":{"available_sizes":[[[150,137],"assets/images/resized/0004/5979/45979v1-max-150x150.jpg"],[[250,228],"assets/images/resized/0004/5979/45979v1-max-250x250.jpg"],[[273,250],"assets/images/resized/0004/5979/45979v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chairman","firm":{"name":"Advent International","permalink":"advent-international","type_of_entity":"financial_org","image":{"available_sizes":[[[150,50],"assets/images/resized/0004/5977/45977v1-max-150x150.png"],[[233,79],"assets/images/resized/0004/5977/45977v1-max-250x250.png"],[[233,79],"assets/images/resized/0004/5977/45977v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}