{"first_name":"Peter","last_name":"F. Armstrong","permalink":"peter-f-armstrong","crunchbase_url":"http://www.crunchbase.com/person/peter-f-armstrong","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Aug 09 11:23:04 UTC 2009","updated_at":"Sun Aug 09 11:23:50 UTC 2009","overview":"<p>Peter Armstrong, principal owner, president, and CEO, founded Triple Point Technology with his long-time friend and colleague, Allie Rogers, in 1993 with a single mission: to provide the most sophisticated and technologically-advanced software solutions to the increasingly complex and competitive global commodity markets. </p>\n\n<p>Under Mr. Armstrong&#8217;s leadership, Triple Point has launched a full suite of industry-leading and award-winning products and has evolved into a global organization capable of supporting the demanding needs of today&#8217;s commodity market participants. From start-up in 1993, the company has grown to more than 200 professionals strategically located in five development and support centers around the globe, has deployed solutions for more than 85 customers on five continents, and has consistently earned strong financial results. Independent validation of Mr. Armstrong&#8217;s leadership success includes identification of Triple Point by Inc. magazine as one of the nation&#8217;s fastest growing companies and Triple Point&#8217;s flagship product, Commodity XL, winning Energy Risk&#8217;s &#8220;Top Software Package&#8221; award and Commodity Now&#8217;s &#8220;Gold Award for Excellence in Technology - Risk Management and Compliance&#8221;. </p>\n\n<p>Mr. Armstrong started his career as an engineer at the prestigious Bell Laboratories, but was soon bitten by the commodities trading bug and took positions at J.Aron and then Phibro, the energy and commodities trading divisions of Goldman Sachs and Salomon Inc., respectively. At both firms, Mr. Armstrong was instrumental in architecting, developing, and deploying market-leading software systems for the transaction and risk management of physical and derivative commodity trading activity. </p>\n\n<p>Mr. Armstrong earned a Master of Science degree in computer science from Columbia University and a Bachelor of Science degree in computer engineering from the University of Pennsylvania. </p>\n\n<p>He leads the company from the Westport, Connecticut, headquarters. </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0005/5720/55720v1-max-150x150.jpg"],[[100,150],"assets/images/resized/0005/5720/55720v1-max-250x250.jpg"],[[100,150],"assets/images/resized/0005/5720/55720v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Triple Point Technology","permalink":"triple-point-technology","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0005/5141/55141v2-max-150x150.jpg"],[[250,57],"assets/images/resized/0005/5141/55141v2-max-250x250.jpg"],[[289,67],"assets/images/resized/0005/5141/55141v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}