{"first_name":"Peter","last_name":"Meekin","permalink":"peter-meekin","crunchbase_url":"http://www.crunchbase.com/person/peter-meekin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Dec 15 23:43:39 UTC 2009","updated_at":"Mon Oct 25 17:35:08 UTC 2010","overview":"<p>Peter Meekin has been associated with Trident Capital since 1995. He has served as a Managing Director of Trident Capital from 1999 when he joined the firm. With the commencement of Fund VII, Peter will step down as Managing Director and assume a less active role as a Venture Partner, in anticipation of his retirement in 2010. Peter will continue to serve on the Board of Directors of select Trident Capital portfolio companies, provide advisory assistance to management of select companies, serve as an advisor to the firm and from time to time be involved in new investments.</p>\n\n<p>Prior to joining Trident Capital, Peter had more than 20 years of experience as an entrepreneur, executive and investor in the software, information services and information technology consulting sectors. Immediately prior to Trident, Peter was Vice President of Venture Development at Enterprise Associates, LLC, the venture capital division of IMS Health Incorporated, where he represented Enterprise Associates in respect of its partnership interest in Information Associates and Information Associates-II (Trident’s Fund II and Fund III). Previously, Peter held senior technology and management positions with Dun &amp; Bradstreet Corporation, Lotus Development Corporation and IBM. In addition, Peter has hands-on entrepreneurial experience having launched three start-up companies in the software and consulting industries.</p>\n\n<p>Peter’s current board memberships include Aethon, Arxan Technologies, HyTrust, iRobot (Nasdaq: IRBT), Spire, TriCipher, Vidient, Voltage Security, Inc. and Zeo, Inc. He formerly served as a director of Berkeley Enterprise Partners, Inc. (acquired by Extraprise, Inc.), Circles (acquired by Sodexho Alliance), Customer Analytics, Inc. (acquired by Exchange Applications (EXAP)), Cymfony (acquired by TNS Media Intelligence), ELetter, Inc., ESS Software, Inc., Sygate Technologies (acquired by Symantec), Tablus, Inc (acquired by RSA, The Security Division of EMC (NYSE: EMC) and Thor Technologies (acquired by Oracle).</p>","image":{"available_sizes":[[[80,105],"assets/images/resized/0007/1045/71045v1-max-150x150.jpg"],[[80,105],"assets/images/resized/0007/1045/71045v1-max-250x250.jpg"],[[80,105],"assets/images/resized/0007/1045/71045v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Trident Capital","permalink":"trident-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[121,100],"assets/images/resized/0000/1891/1891v1-max-150x150.png"],[[121,100],"assets/images/resized/0000/1891/1891v1-max-250x250.png"],[[121,100],"assets/images/resized/0000/1891/1891v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Director","firm":{"name":"TriCipher","permalink":"tricipher","type_of_entity":"company","image":{"available_sizes":[[[150,31],"assets/images/resized/0003/2943/32943v1-max-150x150.png"],[[233,49],"assets/images/resized/0003/2943/32943v1-max-250x250.png"],[[233,49],"assets/images/resized/0003/2943/32943v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Director","firm":{"name":"Zeo","permalink":"zeo","type_of_entity":"company","image":{"available_sizes":[[[108,87],"assets/images/resized/0006/9802/69802v2-max-150x150.png"],[[108,87],"assets/images/resized/0006/9802/69802v2-max-250x250.png"],[[108,87],"assets/images/resized/0006/9802/69802v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}