{"first_name":"Peter","last_name":"Borchers","permalink":"peter-borchers","crunchbase_url":"http://www.crunchbase.com/person/peter-borchers","homepage_url":"http://hubraum.com","birthplace":"Munich","twitter_username":"pbo","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"hubraum, telekom, incubation, entrepreneurship, berlin","alias_list":null,"created_at":"Mon May 21 16:39:23 UTC 2012","updated_at":"Tue Jul 24 08:35:06 UTC 2012","overview":"<p>Peter Borchers is a senior executive in the internet and digital media sector with over 15 years of professional experience. </p>\n\n<p>Peter has built up and is currently heading Deutsche Telekom‘s global incubator „hub:raum“ as well as its predecessor, Telekom‘s first incubator, the Berlin-based „Entrepreneurs Program“. In this role he has discovered and helped building and growing companies such as wahwah.fm. Before that he co-founded and managed an internal innovation accelerator for Deutsche Telekom (T-Innovations) as well as his own internet startup (Everseven). Since the mid 90s he also works as a consultant to both startups and global corporations. </p>\n\n<p>Peter is a frequent speaker, panelist and startup jury member in conferences and industry events some of which include MLOVE, NEXT, European Pirate Summit, Trendforum München, popkomm (Germany), The Lovie Awards (UK), WU Competence Day (Austria), EMEA Innovation Consortium (Switzerland e.a.)</p>\n\n<p>As he loves helping companies to flourish, Peter serves as lecturer and mentor for startups at Berlin Startup Academy, the Founder Institute and the Entrepreneurship Center at Technical University Berlin, among others.</p>\n\n<p>Peter studied in Vienna, Augsburg and Paris. He holds a degree in business administration from the University of Augsburg.</p>\n\n<p>Peter is married and has two children. In his spare time, Peter can be found hanging out with his family or racing vintage cars.</p>\n\n<p>Peter‘s Twitter handle is @pbo.</p>","image":{"available_sizes":[[[150,116],"assets/images/resized/0019/0809/190809v2-max-150x150.jpg"],[[250,194],"assets/images/resized/0019/0809/190809v2-max-250x250.jpg"],[[450,350],"assets/images/resized/0019/0809/190809v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://de.linkedin.com/in/borchers","title":"LinkedIn"}]}