{"first_name":"Peter","last_name":"Tippett","permalink":"peter-tippett-3","crunchbase_url":"http://www.crunchbase.com/person/peter-tippett-3","homepage_url":"","birthplace":"New Zealand","twitter_username":"peteripowow","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1960,"born_month":null,"born_day":null,"tag_list":"social, interactive-tv, live-tv, mobile, web-app","alias_list":null,"created_at":"Sun Mar 20 04:53:50 UTC 2011","updated_at":"Thu Mar 24 02:17:06 UTC 2011","overview":"<p>Working as the CTO and the architect of the iPowow system from the back-end through to the operational functions of the business systems, constantly working on ways to make the systems more efficient and meeting customer needs in corporate, social and media markets and looking at strategic directions of development for the business as a whole.</p>\n\n<p>iPowow is:\nUntil recently, there has been a large gap in the interactions between broadcasters and audiences. For a long time, it has been a one-way conversation. The broadcaster puts out their message and the viewer takes it in. The closest that this relationship has come has been through text messaging, focused on getting a result from the audience, and that is where it has stopped. But not for much longer, things are changing…</p>\n\n<p>iPowow is now bridging this gap using smartphones and the Mobile Web. Its technology platform not only allows the viewer to gauge a response, but it allows the broadcaster to receive it and then display the viewers opinion, ‘in the moment’, back to their audience. </p>\n\n<p>iPowow has gained recognition and has been employed by internationally recognized brands such as global sporting phenomenon, UFC (Ultimate Fighting Championship) Top Rank boxing, Cirque Du Soleil, the American Music Awards and American sporting icon Shaquille O’Neill.</p>\n\n<p>iPowow has two platforms, called Live and Social. The Live platform engages audiences of live television shows, while the Social platform connects global celebrities and fans in the social networking landscape.</p>\n\n<p>iPowow’s interactive media technology has enormous potential for media companies, broadcasters, celebrities and television producers. There is now an exciting solution to engage the audience, giving ‘in the moment’ interaction to live television and social networking. </p>\n\n<p>iPowow is a leading Australian interactive media company that is changing the global interactive landscape</p>","image":{"available_sizes":[[[119,150],"assets/images/resized/0012/6973/126973v2-max-150x150.jpg"],[[151,190],"assets/images/resized/0012/6973/126973v2-max-250x250.jpg"],[[151,190],"assets/images/resized/0012/6973/126973v2-max-450x450.jpg"]],"attribution":"<p>Peter Tippett</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://au.linkedin.com/in/petertippett","title":"Linkedin"}]}