{"first_name":"Peter","last_name":"Yip","permalink":"peter-yip","crunchbase_url":"http://www.crunchbase.com/person/peter-yip","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jul 24 09:35:35 UTC 2009","updated_at":"Fri Jul 24 09:36:21 UTC 2009","overview":"<p>Chief Executive Officer of CDC Corporation and CDC Software</p>\n\n<p>Mr. Yip is Executive Chairman and CEO of CDC Software, a leading enterprise software company ranked #12 of the global Top 100 enterprise software providers and number 8 in the Top 20 Supply Chain Management Software Suppliers by leading industry publications. Mr. Yip is the architect of the acquisitions of Pivotal Corporation and Ross Systems that together form the core foundation for CDC Software. Mr. Yip is also Vice Chairman of the Board of Directors of CDC Corporation, a company he helped found. Under his leadership, CDC Corporation was one of the first successful initial public offerings of an Internet company from Greater China to be listed on NASDAQ, opening the door for other Chinese entrepreneurs to list their ventures in the U.S. capital markets.</p>\n\n<p>Mr. Yip co-founded Yipkon Business Systems in 1978 with his Indian partner from Bangalore, Kumar Konanur. Yipkon, as one of the first Indian outsourcing companies based in New York, pioneered outsourcing for U.S. companies using Indian resources from Bangalore and successfully grew to U.S.$100 million revenue, securing major federal government contracts with the U.S. Army, U.S. Treasury, DOD Logistics Agency, and financial institutions including Equitable Life, Morgan Guarantee Trust, Bankers Trust, New York Life, and Citibank. Mr. Yip sold Yipkon to MCI Worldcom in 1987, just before the market crash, and returned to Hong Kong to make investments in software and IT companies. From 1989-1992, Mr. Yip served as Chairman of Gartner Group Asia.</p>\n\n<p>Mr. Yip has made a number of successful co-investments with institutional investors, corporate investors and high net worth individuals. These include investments in Temasek Holdings company, Xinhua News Agency, Bechtel Enterprises Inc., Mitsui &amp; Co. Ltd., America Online, Inc., Merrill Lynch-Fred Adler Technology Fund II, and the New World Group. Mr. Yip previously held management positions at KPMG Consulting, Wharton Applied Research, and worked at Gartner Group.</p>\n\n<p>Mr. Yip is a frequent speaker at various international conferences and institutions, including the Harvard Business School, Fortune CEO Global Forum, World Economics Forum, Forbes CEO Forum, Businessweek CIO Forum, M.I.T. Enterprise Forum, U.S./Japan Symposium on Corporate Partnership, United Nations Conference on Science &amp; Technology, Harvard University&#8217;s Conference on Internet &amp; Society, and the Nikkei International Conference. CDC Corporation&#8217;s business model was a case study at Harvard Business School in 1996. He has authored research papers published by Harvard Asia Pacific Review, Nanjing University Press, and the National Science Foundation. He recently co-authored a book titled The China&#8217;s Century with former Chinese Premier Zhu Yongji, amongst others.</p>\n\n<p>Mr. Yip received his MBA from the Wharton School at the University of Pennsylvania and his MSEE and BSEE from the University of Pennsylvania. In 2000, the Wharton Business School presented Mr. Yip with the Asian Alumni Entrepreneur Award.</p>\n\n<p>Mr. Yip also received an Associate degree in Engineering and an honorary Doctorate degree in business from Vincennes University, Indiana.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"CDC Software","permalink":"cdc-software-corporation","type_of_entity":"company","image":{"available_sizes":[[[101,55],"assets/images/resized/0005/3112/53112v1-max-150x150.jpg"],[[101,55],"assets/images/resized/0005/3112/53112v1-max-250x250.jpg"],[[101,55],"assets/images/resized/0005/3112/53112v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}