{"first_name":"Peter","last_name":"Micciche","permalink":"peter-micciche","crunchbase_url":"http://www.crunchbase.com/person/peter-micciche","homepage_url":"http://www.certain.com/","birthplace":"","twitter_username":"petermicc","blog_url":"http://blog.certain.com/blog/peter-micciche-blog","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"ceo","alias_list":null,"created_at":"Tue May 15 00:17:17 UTC 2012","updated_at":"Wed May 23 14:23:39 UTC 2012","overview":"<p>Peter is CEO of Certain, Inc. a San Francisco based SaaS provider of event management solutions for corporations, event producers, associations and event planning companies. </p>\n\n<p>He has more than 25 years of public and private business software company experience including roles as CEO, president, general manager, sales executive and board member. </p>\n\n<p>His experience includes successful roles as president of Cognos Corp. the leading business intelligence vendor (acquired by IBM); CEO of NativeMinds, Inc. (acquired by Verity/Autonomy now HP); CEO of Kinecta Corp. (acquired by Stellent now Oracle). In addition, Peter served as a director of Centura, Inc. a NASDAQ traded company.</p>\n\n<p>Peter brings a wealth of experience from other operational roles. He served as senior vice president sales, Americas for Nuance Communications Inc., a $1B provider of voice recognition solutions, senior vice-president of sales for ChannelPoint Inc., a leading provider of solutions for the financial services and insurance industry and vice president and general manager of ASK/INGRES, a $500M business software company where he was responsible for the North American applications and data base business. </p>\n\n<p>Peter earned a Bachelor of Science degree in accounting and finance from Boston College and an MBA degree from Suffolk University in Boston, MA.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/petermicciche","title":""},{"external_url":"https://twitter.com/#!/petermicc","title":""}]}