{"first_name":"Peter","last_name":"D. Henig","permalink":"peter-d-henig","crunchbase_url":"http://www.crunchbase.com/person/peter-d-henig","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 22 10:01:12 UTC 2009","updated_at":"Mon Jun 22 10:19:00 UTC 2009","overview":"<p>Peter D. Henig is Managing Partner for Greenhouse Capital Partners. He is an active and experienced seed stage investor and a veteran business journalist whose work has appeared in the Red Herring, The Economist, Venture Capital Journal, and other noted publications. As a writer, editor and reporter, Mr. Henig specialized in covering public and private equity markets, technology startups, and emerging trends in business, finance and venture capital. He has effectively transferred that knowledge into a portfolio of successful private equity investments. Mr. Henig holds a B.A. in Economics from Georgetown University and an M.A. in Economics and Public Policy from Stanford University.</p>\n\n<p>Peter D. Henig, founder and Managing Partner with Greenhouse, has 8 years experience helping start and fund companies from pre-business plan and formative technology development levels through company expansion and successful liquidation events. A former veteran business journalist whose work has appeared in Red Herring, The Economist, and Venture Capital Journal, Mr. Henig currently sits on the Board of Directors of Renewable Fuel Products, Milo Media, and Linkage BioSciences, is a Board observer with InsideView, and was a founding angel investor in Solaicx, MobiTV, Aravo and Greenplum. Mr. Henig’s expertise covers emerging innovations in photovoltaic technologies, biofuels, and the application of ‘software as a service’ to the clean technology enterprise. Mr. Henig holds a BA in Economics from Georgetown University and an MA in Economics and Public Policy Analysis from Stanford University and is currently an advisor to several environmental non-profits including Forest Ethics, Pacific Environment, and the Emergency Response Studio.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Member of the Board","firm":{"name":"Linkage Biosciences","permalink":"linkage-biosciences","type_of_entity":"company","image":{"available_sizes":[[[150,54],"assets/images/resized/0005/0073/50073v1-max-150x150.jpg"],[[191,70],"assets/images/resized/0005/0073/50073v1-max-250x250.jpg"],[[191,70],"assets/images/resized/0005/0073/50073v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Managing Partner","firm":{"name":"Greenhouse Capital Partners","permalink":"greenhouse-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,53],"assets/images/resized/0005/0079/50079v1-max-150x150.jpg"],[[250,88],"assets/images/resized/0005/0079/50079v1-max-250x250.jpg"],[[280,99],"assets/images/resized/0005/0079/50079v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}