{"first_name":"Peter","last_name":"Mills","permalink":"peter-mills-2","crunchbase_url":"http://www.crunchbase.com/person/peter-mills-2","homepage_url":"http://peteysoft.org","birthplace":"Montreal","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1973,"born_month":12,"born_day":22,"tag_list":"scientist, scientific-programmer, researcher","alias_list":null,"created_at":"Sat Apr 07 04:27:38 UTC 2012","updated_at":"Wed Apr 11 21:38:11 UTC 2012","overview":"<p>Peter &#8220;Petey&#8221; Mills is a physicist who specialized in atmospheric science.  He is active in the free software community and has published a number of scientific libraries, including libAFG, a library for variable kernel density estimation and statistical classification.  He has a passion for all forms of rational inquiry and has diverse interests in many areas of science, philosophy and the humanities.</p>\n\n<p>Petey was born in Montreal on December 22, 1973.  He grew up just outside of Ottawa, attending Riverview Public School and Cairine Wilson Secondary School.  He received his BSc. in Physics from the University of Waterloo in 2000 and a Master&#8217;s degree in Environmental Physics from the University of Bremen in 2004.  He has worked in many active areas in the fields of climate science and remote sensing.  He ran long-range climate models based on the El Nino/Southern Oscillation (ENSO) phenomenon at Environment Canada in Downsview and was in charge of operational retrieval of Ozone data from the Polar Ozone and Aerosol Measurement (POAM) III instrument at the Naval Research Laboratory in Washington D.C.  He has also studied sea ice remote sensing and satellite retrieval of water vapour and has published several papers on his findings.  His current interest is to start a non-profit research foundation specializing in &#8220;blue sky&#8221; science.</p>\n\n<p>Petey&#8217;s hobbies include playing guitar and writing music, travel and adventure, writing short stories, and reading.  He is an active contributor to Wikipedia.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0018/3074/183074v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0018/3074/183074v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0018/3074/183074v2-max-450x450.jpg"]],"attribution":"<p>Peter Mills</p>"},"degrees":[{"degree_type":"MSc.","subject":"Environmental Physics","institution":"University of Bremen","graduated_year":2004,"graduated_month":null,"graduated_day":null},{"degree_type":"BSc.","subject":"Physics","institution":"University of Waterloo","graduated_year":2000,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://peteysoft.org","title":"Peteysoft Foundation"}]}