{"first_name":"Peter","last_name":"Relan","permalink":"peter-relan","crunchbase_url":"http://www.crunchbase.com/person/peter-relan","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Crowdstar","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Wed Apr 21 01:10:13 UTC 2010","updated_at":"Wed Apr 21 01:10:13 UTC 2010","overview":"<p>Founder and CEO of Business Signatures: In 2002, Peter embarked on building a behavior based fraud detection technology based on &#8220;real time stream processing&#8221; databases, used to prevent online consumer fraud. Financiers were angels including Ram Shriram, angel investor in Google, and Dave Roux, co-CEO of Silver Lake Partners, and subsequently Texas Pacific Group Venture and Walden International. Business Signatures was sold to Entrust in 2006, a public company in the security software space. Peter served as the President of Entrust Business Signatures and subsequently as the Chief Strategy Officer of Entrust Founding CTO of Webvan: In 1998, Peter joined Louis Borders, founder of Borders Books and Music, to build and launch Webvan&#8217;s automated distribution and delivery service for online grocery shopping in a 15 month sprint with the help of over 100 engineers recruited from Oracle, Sun, Microsoft, Intel and dozens of high talent technology companies in Silicon Valley. Early Advisor to X.Com which was merged by Sequoia Ventures into PayPal: Peter developed the concept ZipPay, or payments via email with an ex-Citibank executive and merged ZipPay with X.com which in turn became PayPal. Founding VP of Oracle&#8217;s Internet Division: In 1994, Peter led Oracle into the Internet market with the creation of Oracle&#8217;s Application Server in 1995. The Application Server is now a multi-billion product line at Oracle. Peter was principal Architect of OpenView at Hewlett Packard from 1988 - 1994, also a multi-billion dollar business for HP. Peter lives with his wife and two children in Atherton, CA. He is an avid tennis player, children&#8217;s basketball coach and percussionist in Indian Classical Music. He holds a BS from UCLA and a MS from Stanford University.</p>","image":{"available_sizes":[[[100,100],"assets/images/resized/0008/4383/84383v1-max-150x150.jpg"],[[100,100],"assets/images/resized/0008/4383/84383v1-max-250x250.jpg"],[[100,100],"assets/images/resized/0008/4383/84383v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Executive Chairman","firm":{"name":"CrowdStar","permalink":"crowdstar","type_of_entity":"company","image":{"available_sizes":[[[150,40],"assets/images/resized/0008/7858/87858v5-max-150x150.png"],[[250,67],"assets/images/resized/0008/7858/87858v5-max-250x250.png"],[[317,85],"assets/images/resized/0008/7858/87858v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}