{"first_name":"Peter","last_name":"Haasz","permalink":"peter-haasz","crunchbase_url":"http://www.crunchbase.com/person/peter-haasz","homepage_url":"http://www.trueemrtechnologies.com","birthplace":"","twitter_username":"trueemrtech","blog_url":"http://www.trueemrtechnologies.com/Forum.aspx","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Oct 04 23:58:51 UTC 2011","updated_at":"Sat Nov 19 05:50:08 UTC 2011","overview":"<p>. True EMR Technologies Inc is a 100% online Pet Medical Record storage company with its special cloud computing system where pet owners are instantly connected to their veterinarian. Why spend the tens of thousands of dollars on software just to view your records, we only require that you have internet service.  Our website is totally secured through the toughest and most up-to-date technologies to prevent hackers and thieves, and protect what is most important- our clients’ personal medical records. \nBelow are just a few of our highlights:\n-Scan and store your medical records, X-rays, EKG, sonograms, or any record for online retrieval </p>\n\n<ul>\n<li>Retrieve your medical records ANYWHERE in the world at any time with our service and internet access.\n-We offer electronic medical records, electronic prescriptions and virtual filling cabinets </li>\n<li>We have implemented state of the art security features to protect your data\n-Around the clock security monitoring and unmatched protection\n-On-site maintenance and support\n-Be visible to thousand of pet owners who searches for vets every day\n-State of art search engine and searches on our date base</li>\n</ul>\n\n<p>Beyond all of these we have unmatched prices! We are cheaper and more reliable than any meager software companies on the market!\nPlease visit our web site to find out how we can serve you.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}