{"first_name":"Philip","last_name":"W. Tomlinson","permalink":"philip-w-tomlinson","crunchbase_url":"http://www.crunchbase.com/person/philip-w-tomlinson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Aug 12 14:45:47 UTC 2009","updated_at":"Wed Aug 12 14:47:53 UTC 2009","overview":"<p>Chairman of the Board and CEO\nTSYS\nPhil Tomlinson, chief executive officer of TSYS, has been the driving champion for excellence in client service for the company&#8217;s entire history. In his former role as president, Tomlinson directed the company&#8217;s strategy of technological growth and advancement. But among clients, colleagues and team members, he is better known for his tireless efforts to exceed clients&#8217; expectations every day, most recently through the implementation of Six Sigma improvement strategies throughout the company.</p>\n\n<p>Tomlinson joined Columbus Bank and Trust Company (Columbus, Ga.) in 1974, after a successful management career with General Electric Corporation. Since TSYS was established as a spin-off in 1983, Tomlinson has played a key role in almost every major relationship that has shaped the company&#8217;s development. Tomlinson is a graduate of Louisiana State University&#8217;s School of Banking of the South. In addition to his role as Chairman of the Board and CEO of TSYS, Tomlinson is a member of the TSYS Board of Directors, and also serves on the Board&#8217;s Executive Committee. He serves on the boards of directors for TSYS de Mexico, TSYS Acquiring Solutions and GP Network Corporation, a gateway for more than 120,000 merchants in Japan, in which TSYS owns a controlling interest. Tomlinson is also a member of the Georgia Tech Advisory Board, American Cancer Society Board, the Muscogee Educational Excellence Foundation Board (MEEF), the Columbus State University Board of Trustees, the Columbus State Cunningham Center for Leadership Development Advisory Board, the United Way Board, and the Financial Services Roundtable. He is also serving as the 2006 Chairman of the Greater Columbus Chamber of Commerce.</p>","image":{"available_sizes":[[[104,150],"assets/images/resized/0005/6155/56155v1-max-150x150.jpg"],[[125,180],"assets/images/resized/0005/6155/56155v1-max-250x250.jpg"],[[125,180],"assets/images/resized/0005/6155/56155v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Total System Services","permalink":"total-system-services","type_of_entity":"company","image":{"available_sizes":[[[105,35],"assets/images/resized/0005/6152/56152v1-max-150x150.png"],[[105,35],"assets/images/resized/0005/6152/56152v1-max-250x250.png"],[[105,35],"assets/images/resized/0005/6152/56152v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}