{"first_name":"Phil","last_name":"Thompson","permalink":"phil-thompson","crunchbase_url":"http://www.crunchbase.com/person/phil-thompson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Cart45","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Jul 19 06:07:41 UTC 2008","updated_at":"Fri Nov 14 06:04:00 UTC 2008","overview":"<p>As one of the top Chief Architects in the country, Philip has worked with some of the biggest names in the industry while assisting 100s of medium and large companies in diverse industries to maintain a competitive position through application of information technology. He continues to stay fresh by working as a senior systems engineer and developer- while he is most known as a Chief Architect with many mid-tier and Fortune companies including: Costco, Birkenstock, Pacific Life, Ceridian, Northwest Airlines, Panasonic, Sonangol, Siemens, Intel, Commerce Bank, PFF Bank and Trust, Shazam, Lawson Software, The Sports Authority, Charlotte Russe, Hot Topic, Metaldyne, Schlumberger, McKinsey and Company, Clarian Health Partners, The Whitney Museum, Luby&#8217;s, NHL, Outback Steakhouse, Rent-a-Center, Swift Transportation and many others. Philip leverages a deep-rooted understanding of marketing solutions through technology, extensive experience with both commercial and open source software applications, and complex engineering and programming concepts. He executes effective solutions utilizing common industry standard methodologies.</p>\n\n<p>Philip&#8217;s daily hands-on involvement using leading edge technologies (such as mobile) in business growth strategies has provided businesses a strong ROI extension and integration of common business systems. Systems such as ERP, Supply Chain and Point of Sale on a multitude of enterprise class technology platforms including .NET and J2EE while at times leveraging Open Source Solutions. This has offered Philip the facility to successfully lead technical marketing solutions with both small projects and large 30+ man teams spanning across continents for all businesses including Fortune 100 companies. Experienced with enterprise release management, product development life cycles, and project life cycle management with a multiplicity of systems architecture environments involving operating systems such as Unix, Linux, AS400, OS390 and Windows – Philip also understands the need to apply the best technology to the optimal business strategy.</p>\n\n<p>This unique ability to work with executive management on business system acumen and implementing technology solutions together with our Strategic and Creative solutions has allowed Automatic to become a premier force in innovation and growth. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CTO","firm":{"name":"Cart45","permalink":"cart45","type_of_entity":"company","image":{"available_sizes":[[[150,106],"assets/images/resized/0002/2383/22383v2-max-150x150.jpg"],[[212,150],"assets/images/resized/0002/2383/22383v2-max-250x250.jpg"],[[212,150],"assets/images/resized/0002/2383/22383v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"CTO","firm":{"name":"Philip Thompson","permalink":"philip-thompson","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}