{"first_name":"Phillip","last_name":"Rather","permalink":"phillip-rather","crunchbase_url":"http://www.crunchbase.com/person/phillip-rather","homepage_url":"http://www.homepros.com","birthplace":"Oxford, MS","twitter_username":"PhillipRather","blog_url":"http://users.homepros.com/blogs/Phillip","blog_feed_url":"http://users.homepros.com/blogs/phillip/feed","affiliation_name":"HomePros","born_year":1976,"born_month":8,"born_day":12,"tag_list":"","alias_list":null,"created_at":"Wed Jun 17 00:17:56 UTC 2009","updated_at":"Mon Feb 15 22:03:40 UTC 2010","overview":"<p>Internet Marketing Executive with diverse experience in web marketing and eBusiness process development. Strong background in start up companies including sales, marketing and channel/partnership strategy. Emphasis on helping companies take goods and services to market using the web with a focus on analyzing and developing online advertising products, search engine optimization and social media.</p>\n\n<p>Phillip currently serves as the CEO of HomePros, an online community uniting the home improvement world through communication and productivity applications. </p>\n\n<p>Prior Phillip founded BridgeOne Market Solutions, Inc in 2002 with the launch of BroadbandLocators.com, a nationwide lead generation portal for telecom and hosting services. Phillip and his team developed a website generating high quality, low cost telecom leads for companies like AT&amp;T, Qwest and Verizon. To date, Broadband Locators has serviced over 25,000 businesses and generated more than $25 million in provider contract value. </p>\n\n<p>BridgeOne services clients in a consulting capacity to help them realize traction in the organic and paid search space. He has helped clients ranging from start-ups to publicly traded companies, from ecommerce to B2B lead generation sites, grow their search engine campaign from inception to a competitive position in their space. In the past five years, clients have seen an average annual growth rate of 80% resulting in almost $40 million in previously untapped revenue. Phillip leads the staff at BridgeOne while managing projects involving multiple departments across multiple client companies and vendors.</p>\n\n<p>Prior Rather was the Sales Manager for Mall.com, an Austin, TX based shopping portal, where he managed a team of 70. He attended the University of Texas at Austin with a Major in Philosophy and Minor in Business. </p>","image":{"available_sizes":[[[77,105],"assets/images/resized/0004/9118/49118v2-max-150x150.jpg"],[[77,105],"assets/images/resized/0004/9118/49118v2-max-250x250.jpg"],[[77,105],"assets/images/resized/0004/9118/49118v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"HomePros","permalink":"homepros","type_of_entity":"company","image":{"available_sizes":[[[150,54],"assets/images/resized/0004/8940/48940v2-max-150x150.png"],[[250,90],"assets/images/resized/0004/8940/48940v2-max-250x250.png"],[[450,162],"assets/images/resized/0004/8940/48940v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.homepros.con","title":"HomePros"}],"web_presences":[]}