{"first_name":"Phil","last_name":"Steitz","permalink":"phil-steitz","crunchbase_url":"http://www.crunchbase.com/person/phil-steitz","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Rearden Commerce","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Sep 19 17:24:59 UTC 2012","updated_at":"Sat Oct 13 03:07:07 UTC 2012","overview":"<p>As Chief Technology Officer, Phil Steitz is focused on building a next-generation offers platform for Deem. With 20+ years of experience in business management and technology — including solutions development, operations, information security, architecture, strategy and technology finance, Mr. Steitz is driving his team to build the world’s preeminent relevance engine.\nPhil joined Rearden Commerce in early 2012, after becoming part of the company&#8217;s Technical Advisory Board in May 2011. Prior to Rearden, he served as Chief Information Officer for Barclaycard US, the credit card business of Barclays PLC in the United States, where he was responsible for all technology and information processing systems development and operations. He has also served as Senior Vice President and Chief Technology Officer for American Express, where he oversaw global technology standards and strategy, enterprise utilities, technology innovation and strategic technology partnerships.\nPhil previously held various technical and management positions at Intelligroup, Entersoft Systems (now BEA systems), Financial Dynamics and Target Systems Development. He holds a doctorate in mathematics from the University of Maryland and a bachelor&#8217;s degree in Philosophy from Beloit College. He has served on several boards, including Sun Microsystems Executive Advisory Council, the Microsoft Interoperability Executive Advisory Council, the Intel Board of Advisors and the EMC Executive Council.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Technology Officer","firm":{"name":"Rearden Commerce","permalink":"reardencommerce","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0000/2779/2779v5-max-150x150.jpg"],[[250,80],"assets/images/resized/0000/2779/2779v5-max-250x250.jpg"],[[450,144],"assets/images/resized/0000/2779/2779v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}