{"first_name":"Phillip","last_name":"Mattu","permalink":"phillip-mattu","crunchbase_url":"http://www.crunchbase.com/person/phillip-mattu","homepage_url":"http://www.comcero.com","birthplace":"Coventry","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1976,"born_month":10,"born_day":22,"tag_list":"","alias_list":null,"created_at":"Mon Nov 29 16:22:06 UTC 2010","updated_at":"Wed Dec 01 01:20:59 UTC 2010","overview":"<p>Comcero (www.comcero.com) is a completely free online marketplace where you buy and sell services. Expanding far beyond basic tradesman sectors, Comcero covers all type of services such as tuition, advertising, hospitality, solicitors and more .In fact; there are 47 different categories to choose from.</p>\n\n<p>Comcero removes the need for customers to hunt around for the best tradesman and protects their identity. Once they post a job they need doing, they just need to sit back whilst professionals tender for the work. Much more than a directory however, the site features key relationship management tools where users are able to view comprehensive information about the provider’s profile, certifications or memberships and communicate directly to set meetings and agree work schedules. At a quick glance they’re able to view how well jobs have been completed in the past – and more importantly, how trustworthy they are. </p>\n\n<p>In addition, once work has been completed members have the reassurance of knowing an audit trail exists which documents the entire relationship between users and professionals, including every piece of information exchanged – bringing a whole new level of accountability and transparency to the process.</p>\n\n<p>For tradespeople and professionals there are absolutely no costs involved for winning new business with Comcero. This means it’s free to register, free to receive leads, free to win work and free to manage your jobs.</p>\n\n<p>All services including; Accountancy/Legal, Appliance Repair, Carpentry/Joiners, Cleaning, Conservatories, Conversions/Extensions, Disposal, Drainage, Driveways/Patios, ECO, Electrical, Floor, Garden, Glaziers, Groundwork, Handy Work, Health &amp; Fitness, Heating/Plumbing, Home Care, Hospitality, Insulation, Life Style, Metal Work, Moving/Relocation, Pest Control, Pet Sitting, Protection, Refurbishment, Roof, Security, Surface Work, TV/Aerial/Satellite, Tuition, Walls, Weddings, Windows </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}