{"first_name":"Philippe","last_name":"Buhannic","permalink":"philippe-buhannic","crunchbase_url":"http://www.crunchbase.com/person/philippe-buhannic","homepage_url":"http://www.tradingscreen.com","birthplace":"France","twitter_username":"tradingscreen","blog_url":"http://tradingsmarter.tradingscreen.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"philippe-buhannic","alias_list":null,"created_at":"Sun Apr 03 13:26:00 UTC 2011","updated_at":"Mon Apr 23 21:15:30 UTC 2012","overview":"<p>Philippe Buhannic is the industry pioneer who has brought TradingScreen to the forefront of global markets. He has over 20 years of management, marketing and technical experience and is a widely recognized authority on electronic trading and customer information systems.</p>\n\n<p>Prior to TradingScreen, Buhannic served as a Managing Director at Credit Suisse First Boston (CSFB) in New York. While at CSFB, he worked in Fixed Income where he handled listed derivatives, prime brokerage and e-commerce. Buhannic was also responsible for creating and implementing CFSB&#8217;s e-commerce products including the &#8220;Prime Family&#8221; that includes PrimeTrade, PrimeClear, Prime Brokerage and PrimeFund; all of which received industry acclaim as the first successful attempt at global distribution of electronic, multi-asset asset class transaction processing via the Internet.</p>\n\n<p>Prior to joining CSFB, from 1993 to 1995 Philippe was Chairman and CEO of Fimat Futures USA Inc. a subsidiary of Societe Generale of France and a member of the board of the Fimat Group. Philippe redeveloped the firm through an approach combining innovative marketing and leading edge technology products, establishing Fimat as a major, profitable player in the US market. From 1987 to 1993, he was the deputy Chief Financial Officer of Credit Commercial de France, where he oversaw the global marketing of short-term FX and interest rate products.</p>\n\n<p>Buhannic holds a Masters of Business Administration (MBA) from New York University&#8217;s Stern School of Business, a Masters degree in Finance and Taxation from The Institut d&#8217;études politiques de Paris. He is a longtime board member of the Futures Industry Association and Guest Professor in business and finance courses.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0012/8987/128987v2-max-150x150.jpg"],[[178,250],"assets/images/resized/0012/8987/128987v2-max-250x250.jpg"],[[321,450],"assets/images/resized/0012/8987/128987v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"Masters of Business Administration (MBA) ","institution":"New York University's Stern School of Business","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"Masters degree in Finance and Taxation ","subject":"Finance and Taxation ","institution":"The Institut d'études politiques de Paris","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}