{"first_name":"Phil","last_name":"Maher","permalink":"phil-maher","crunchbase_url":"http://www.crunchbase.com/person/phil-maher","homepage_url":"http://bloodbanker.com","birthplace":"McHenry, IL, USA.","twitter_username":"BloodDonation","blog_url":"http://bloodbanker.com/plasma/","blog_feed_url":"http://bloodbanker.com/plasma/feed/rss2/","affiliation_name":"H5 Technologies","born_year":1977,"born_month":1,"born_day":31,"tag_list":"blood-donation, startup, sortware-development, craig-newmark","alias_list":null,"created_at":"Tue Jun 19 06:17:47 UTC 2012","updated_at":"Mon Jul 02 16:28:36 UTC 2012","overview":"<p>Phil Maher is a software developer that is passionate about stopping worldwide blood shortages.  </p>\n\n<p>Throughout Phil&#8217;s career he&#8217;s been interested in the altruistic side of technology. Fresh out of Illinois State University in 2000 he moved to San Francisco and began working with Ejemoni (now H5 Technologies) as a software developer.  Phil was drawn to H5 because of the advanced proprietary search algorithms developed by Dr. Jefferies.  The algorithm was particularly exciting because it excelled at matching full page text queries, as opposed to Google’s technology of matching just a few keywords.</p>\n\n<p>After some funding problems that H5 had, Phil moved on to better understand how money flowed on the internet and joined Adteractive as a Business Analyst.  Here he worked with a world class affiliate network to help optimize performance.  After about a year he decided it was time to leave and start his own company.</p>\n\n<p>Sanfrancisco Nite Lite or (sfnitelife.com) was a play into the fact that digital cameras on phones was non-existent, and that digital cameras themselves were still clunky and at best producing about a one mega-pixel image.  He grew the company to a team of about 10 photographers taking hundred of pictures every night covering San Francisco events.  Here he was able to hone his networking skills by getting to know every club promoter and owner.  The business went through many revenue models like, selling the pictures online, providing advertising via a large homegrown email list sfnitelife.com started, and eventually selling ads as a very early adsense publisher.</p>\n\n<p>Phil recalls getting into the Google Adsense Publisher program very early in 2004 and playing pool with Craig Newmark in the Moscone center.  As the game of billards progressed Phil told Craig that he had a killer idea for him.  His idea was that Craig should put Adsense Ads discreetly at the bottom of each page of Craigslist.org. Craig laughed and said, ‘Phil you don’t understand our audience, ads would kill the site’.  Craig was probably right, but who knows what would have happened if Phil would have talked Mr. Newmark into it.</p>\n\n<p>Also during this time Phil got into the technology conference scene started with membership with Webmasterworld.com.  Phil (known as maherphil on the boards) was active in the community and was the guy that was at every session and always in the front row.  Phil was a sponge soaking up as much information as he could about SEO and being a webmaster.</p>\n\n<p>After sfnitelife.com, Phil moved back to Chicago and started working with a friend of his from the SEO conference circles, Justin Sanger.  Justin had just sold LocalLaunch to RH Donnelly and needed some seasoned professionals to help him grow the company.  Phil signed on as Director of SEO and worked with them until he was transferred to Denver, Colorado to head up the SEO efforts of then a major yellow page player, DexOnline.com</p>\n\n<p>Phil grew the DexOnline.com site’s traffic significantly and helped other business units of RH Donnelly including Business.com, and other regional yellow page sites and projects.  RHD declared bankruptcy in 2009 and Phil left to pursue his current venture, BloodBanker.</p>\n\n<p>BloodBanker.com actually went live as a way for Phil to give back in 2003 as a simple informational site about blood donation.  The site was started because Phil wasn’t able to find any good information on blood online and so he created the site himself to satisfy the void. The BloodBanker team built 2 blogs and a custom directory of blood donation centers where anyone can leave a comment about their experience at a local center.  Phil has built the team to consist of 8 full time employees consisting of developers, designers, writers, marketers, and even had a management layer.  </p>\n\n<p>The future of BloodBanker is bright as Phil’s focus and direction has centered him on completing his objective&#8230;eliminating deadly blood shortages that threaten the world’s economic stability.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0019/6093/196093v2-max-150x150.jpg"],[[167,250],"assets/images/resized/0019/6093/196093v2-max-250x250.jpg"],[[301,450],"assets/images/resized/0019/6093/196093v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelors of Science","subject":"Telecommunications Management","institution":"Illinois State University","graduated_year":2000,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"BloodBanker","permalink":"bloodbanker","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0019/1189/191189v2-max-150x150.png"],[[250,250],"assets/images/resized/0019/1189/191189v2-max-250x250.png"],[[300,300],"assets/images/resized/0019/1189/191189v2-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Software Developer","firm":{"name":"H5 Technologies","permalink":"h5-technologies","type_of_entity":"company","image":null}},{"is_past":true,"title":"Director of SEO/Interactive Strategy","firm":{"name":"LocalLaunch/RHD","permalink":"locallaunch-rhd","type_of_entity":"company","image":null}},{"is_past":true,"title":"Business Analyst","firm":{"name":"Adteractive","permalink":"adteractive","type_of_entity":"company","image":{"available_sizes":[[[150,27],"assets/images/resized/0000/1987/1987v1-max-150x150.png"],[[221,40],"assets/images/resized/0000/1987/1987v1-max-250x250.png"],[[221,40],"assets/images/resized/0000/1987/1987v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://bloodbanker.com","title":"Bloodbanker"}],"web_presences":[{"external_url":"http://www.linkedin.com/in/philmaher","title":"Linkedin Profile"},{"external_url":"https://twitter.com/#!/BloodDonation","title":"Twitter @BloodDonation"}]}