{"first_name":"Philip","last_name":"Braden","permalink":"philip-braden","crunchbase_url":"http://www.crunchbase.com/person/philip-braden","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat May 10 01:21:19 UTC 2008","updated_at":"Sat May 10 01:26:42 UTC 2008","overview":"<p>&#8220;The Company&#8217;s co-founder, Mr. Philip Braden, 47, was formerly CEO of Mindport USA, Vice President of Asian satellite television company STAR TV, and Executive Vice President of Orbit Communications, based in Rome. Mr. Braden is currently Chairman &amp; CEO of the Orbital Recovery Group, an aerospace technology company that uses proprietary in-orbit automated systems and techniques to significantly extend the in-service lifetimes of geostationary orbit telecommunications satellites.</p>\n\n<p>Mr. Braden was previously CEO of Mindport USA, based in San Diego, USA. Prior to working at Mindport, Mr. Braden was EVP Engineering at the Orbit Group, the worlds first digital satellite television broadcaster. Prior to his tenure at Orbit, Mr. Braden was Vice President of Broadcast Operations and Engineering at STAR TV - Asia&#8217;s largest and first satellite TV broadcaster – where he was responsible for ground up design, procurement, installation and recruitment of all infrastructure required to bring the station to air. In addition, Mr. Braden led the technical due diligence efforts that led to the successful acquisition of STAR TV by News Corporation in 1992.</p>\n\n<p>Mr. Braden is a recognized expert in orbital infrastructure innovation and digital distribution strategies. In 1995 he won the top award for digital system design innovation and system architecture at the International Broadcasting Convention. Mr. Braden has been a Director of Authentium since its founding in 2000.&#8221; (Source: <a href=\"http://www.authentium.com/mainv2/about.htm\" title=\"Authentium\" rel=\"nofollow\">Authentium</a>)</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder & Director","firm":{"name":"Authentium","permalink":"authentium","type_of_entity":"company","image":{"available_sizes":[[[150,59],"assets/images/resized/0001/8284/18284v1-max-150x150.png"],[[159,63],"assets/images/resized/0001/8284/18284v1-max-250x250.png"],[[159,63],"assets/images/resized/0001/8284/18284v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}