{"first_name":"Philip","last_name":"Yeo","permalink":"philip-yeo","crunchbase_url":"http://www.crunchbase.com/person/philip-yeo","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jul 20 23:38:41 UTC 2011","updated_at":"Wed Jul 20 23:42:17 UTC 2011","overview":"<p>Philip Yeo is currently the Special Advisor for Economic Development (Prime Minister&#8217;s Office) and Chairman of SPRING Singapore (a government development agency with the mission of nurturing Local Enterprises especially Small and Medium Enterprises.) As Special Advisor for Economic Development in the Prime Minister&#8217;s Office, Mr. Yeo assists the Prime Minister&#8217;s Office in establishing new economic links with foreign governments who value Singapore&#8217;s development experience, and provide strategic inputs to establish strategic partnerships and open up opportunities with other fast growing economies.</p>\n\n<p>Mr. Yeo is recognized for his contributions to Singapore&#8217;s economic development and his pioneering role in the promotion and development of the country&#8217;s information technology, semiconductor, chemical industries and biomedical sciences.</p>\n\n<p>Mr. Yeo served in the Singapore Administrative Service from June 1970 to 31 March 1999. From June 1970 to Dec 1985, he served in various appointments in the Ministry of Defence (MINDEF), including Permanent Secretary for logistics, defence research &amp; development and defence industries.</p>\n\n<p>Mr. Yeo was the founding Chairman of the National Computer Board (now Infocomm Development Authority) of Singapore from 1980 to 1987. He played a leading role in formulating and championing Singapore&#8217;s first national computerisation plan to evolve the nation into the information age. He assumed the appointment of Executive Chairman, Economic Development Board (EDB) in January 1986 and served till January 2001 and then assumed the Executive Co-Chairman, EDB from February 2001 to January 2006 when he took on the Chairmanship of the Agency for Science, Technology and Research (A*STAR).</p>\n\n<p>During his EDB chairmanship, Mr. Yeo redirected EDB&#8217;s focus from the traditional fields to new areas of business. These included: Internationally exportable services; developing high-tech industries like biomedical sciences, semiconductors, aerospace and chemicals; and encouraging Singapore companies to make direct investments abroad.</p>\n\n<p>In the private sector, He served as a Board Member (from 1980) and Chairman of the Executive Committee of Singapore Technologies Holdings from 1987 to 1993. He also served as Chairman of Sembawang Corporation (1994 - 1998) and the successor SembCorp Industries (1998 - 1999), Pidemco Land (1999 - 2000) and CapitaLand formed from Pidemco after a merger (2000 - 2004). Currently, Mr. Yeo is a member of the Board of Directors of the United Overseas Bank (a leading Singapore bank with operations in Malaysia, Thailand and Indonesia).</p>\n\n<p>He is also Chairman of Accuron Technologies Pte Ltd (an aerospace and precision engineering company based in Singapore), Medical Technologies Investment Company (MTIC) Holdings Pte Ltd, Singapore Aerospace Manufacturing Pte Ltd and Ascendas Property Fund Trustee Pte Ltd that funds IT Parks in India.</p>\n\n<p>Philip Yeo was awarded the Public Administration Medal (Silver) in 1974, the Public Administration Medal (Gold) in 1982 and the Meritorious Service Medal in 1991[1]. In 1987, he was awarded the Eisenhower Exchange Fellowship, USA for the period March to May 1987. He has received numerous honours from governments and organisations worldwide.</p>\n\n<p>He graduated in 1970 in Applied Science (Industrial Engineering) from the University of Toronto under a Colombo Plan scholarship. He obtained a Master of Science (System Engineering) from the University of Singapore in 1974. in 1976, he obtained a Master in Business Administration from Harvard University under a Fullbright scholarship.</p>\n\n<p>Philip Yeo has been conferred honorary PhDs from University of Toronto, Karolinska Institutet in Sweden and Imperial College London.</p>","image":{"available_sizes":[[[80,82],"assets/images/resized/0014/5385/145385v1-max-150x150.png"],[[80,82],"assets/images/resized/0014/5385/145385v1-max-250x250.png"],[[80,82],"assets/images/resized/0014/5385/145385v1-max-450x450.png"]],"attribution":"<p>iglobe partners team page</p>"},"degrees":[{"degree_type":"","subject":"Industrial Engineering","institution":"University of Toronto","graduated_year":1970,"graduated_month":null,"graduated_day":null},{"degree_type":"Master of Science","subject":"System Engineering","institution":"University of Singapore","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"Harvard University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chairman","firm":{"name":"iGlobe Partners","permalink":"iglobe-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,30],"assets/images/resized/0002/9210/29210v2-max-150x150.jpg"],[[250,51],"assets/images/resized/0002/9210/29210v2-max-250x250.jpg"],[[282,58],"assets/images/resized/0002/9210/29210v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}