{"first_name":"Philip","last_name":"Sen","permalink":"philip-sen","crunchbase_url":"http://www.crunchbase.com/person/philip-sen","homepage_url":"http://www.weldmeshfence.com","birthplace":"China","twitter_username":"","blog_url":"http://weldmeshfence.bloggum.com/","blog_feed_url":"","affiliation_name":"Werson Group","born_year":1983,"born_month":8,"born_day":19,"tag_list":"weldmesh-fencing, chain-link-fencing, temporary-fencing, double-wire-fence","alias_list":null,"created_at":"Sat Jan 08 11:53:11 UTC 2011","updated_at":"Fri Jan 14 07:26:53 UTC 2011","overview":"<p>Werson Fencing System is a reliable manufacturer and exporter for welded wire mesh, welded mesh panel, chain link fencing, weld mesh fencing, paladin fencing, palisade fencing, temporary fencing, reinforcing mesh, chain link fence parts, gabion, chicken wire, double wire fence, barbed wire, concertina barbed tape,358 security fencing,3510weldmesh,twin wire fence panel and roll top fencing.\nFounded in 1992, our company covers an area of 18,000 square meters and registers 1.3million USD. After several years of unremitting efforts, the annual output has reached 3.3 million USD and the company enlists 200 employees including 45 professional and technical staff.\nOur company always adheres to using the high-quality raw material, being responsible to the control of quality and establishing the principle&#8211; &#8220;with quality to survival, with credibility to development&#8221;. Our products are trusted by foreign customers and then popularly sold in more than 40 countries and regions, such as Europe, America, Japan, the Middle East, Africa, South Korea, and Australia.\nWerson Industrial Group Co,. Limited is willing to provide the highest quality products and the first-class service for both domestic and international customers. Our company sincerely welcomes friends from all over the world to our company to discuss business and work together with each client to create a bright future.</p>","image":{"available_sizes":[[[150,49],"assets/images/resized/0011/6556/116556v2-max-150x150.jpg"],[[250,82],"assets/images/resized/0011/6556/116556v2-max-250x250.jpg"],[[326,108],"assets/images/resized/0011/6556/116556v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Stock Market","firm":{"name":"Werson Group","permalink":"werson-group","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.weldmeshfence.com","title":"Werson Industrial Group Co.,Limited"}],"web_presences":[]}