{"first_name":"Philip","last_name":"R. Parr","permalink":"philip-r-parr","crunchbase_url":"http://www.crunchbase.com/person/philip-r-parr","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Feb 11 15:03:52 UTC 2011","updated_at":"Fri Feb 11 15:07:03 UTC 2011","overview":"<p>Philip Parr is president and chief executive officer of Hitachi Consulting, responsible for overall global operations and profitability.</p>\n\n<p>Since joining Hitachi Consulting in 2002, Parr served in a variety of leadership positions, consistently delivering profitable results. Most recently he served as chief operating officer for the company&#8217;s U.S. consulting operations. Under his guidance, Hitachi Consulting&#8217;s U.S. business delivered double digit revenue growth.</p>\n\n<p>Parr has been in the professional services industry for 25 years, serving consumer products and industrial manufacturing clients. His areas of expertise include business and systems integration, enterprise application implementation, and customer relationship management solutions.</p>\n\n<p>Parr began his career in 1982 at Andersen Consulting and spent 10 years in the Denver office serving clients in various industries. He then shifted to industry and served four years as chief information officer of a $1B national food distributor where he successfully led a large business and technology transformation initiative. Parr returned to consulting in 1996, joining Arthur Andersen&#8217;s Business Consulting practice as managing partner of the Denver organization. He served in a variety of regional and national executive leadership roles and became part of Hitachi Consulting in 2002 as part of the acquisition of Andersen&#8217;s Business Consulting practice.</p>\n\n<p>Parr holds a bachelor degree in finance and information science from the University of Colorado in Boulder, where he currently resides with his family.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0012/1659/121659v1-max-150x150.jpg"],[[100,150],"assets/images/resized/0012/1659/121659v1-max-250x250.jpg"],[[100,150],"assets/images/resized/0012/1659/121659v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President and Chief Executive Officer\t","firm":{"name":"Hitachi Consulting","permalink":"hitachi-consulting","type_of_entity":"company","image":{"available_sizes":[[[150,25],"assets/images/resized/0011/6832/116832v1-max-150x150.png"],[[250,43],"assets/images/resized/0011/6832/116832v1-max-250x250.png"],[[255,44],"assets/images/resized/0011/6832/116832v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}