{"first_name":"Pieter","last_name":"De Leenheer","permalink":"pieter-de-leenheer","crunchbase_url":"http://www.crunchbase.com/person/pieter-de-leenheer","homepage_url":"http://www.pieterdeleenheer.be","birthplace":"","twitter_username":"pieterdl","blog_url":"http://www.pieterdeleenheer.be","blog_feed_url":"","affiliation_name":"Collibra","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jul 20 09:32:28 UTC 2009","updated_at":"Thu Jun 10 19:11:18 UTC 2010","overview":"<p>Pieter is assistant professor in Information and Service Sciences at VU University Amsterdam, where he gives courses on Online Information Systems, E-business Planning and Innovation, and Business Semantics. He is also co-founder and research director of &#8220;ESTC 2009 Innovation award&#8221; winning Collibra nv/sa, a Brussels-based semantic software company that spun off from the Vrije Universiteit Brussel (VUB). From 2002-2009, he was a senior scientist at VUB STARLab, and lecturer at the same university. He holds a PhD, BSc and MSc in principle computer science, all three from VUB.</p>\n\n<p>Pieter is the key co-designer of the principles and methods of business semantics management (based on STARLab&#8217;s DOGMA approach; see his PhD), that are underpinning Collibra&#8217;s innovative software solutions, which are deployed in various public administrations and companies in Belgium.</p>\n\n<p>Pieter&#8217;s current research lies in the study, design and predication of self-organising business information and service ecosystems – complex systems on the Web in which specific arrangements of people and technologies take actions that provide added value (like information, services or products) for others. He is driven by following research questions:\n1) how can networked SMEs jointly offer electronic services via the Web ? How to model a sustainable and profitable strategy for this ?\n2) how can we make Internet technology more intelligent so that services can self-organise into bundles that better suit the needs of individuals or very large communities ?</p>\n\n<p>This involves linking elements from multiple disciplines including semantic technology, ontology, complexity theory and service and Web Science.</p>\n\n<p>Pieter authored more than 30 publications in various books, international journals and conferences, among which he co-edited the Springer book &#8220;Ontology Management for the Semantic Web&#8221;. Being active in EU initiatives for many years, he has extensive experience in acquiring of and participation in projects. In addition he is engaged by the European Commission as an FPx Expert for evaluating proposals and reviewing projects. He is member of The Network Institute, ACM and IEEE, and referent/peer reviewer in several international conferences and journals.</p>","image":null,"degrees":[{"degree_type":"PhD","subject":"Computer Science","institution":"VUB","graduated_year":2009,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Research Director","firm":{"name":"Collibra","permalink":"collibra","type_of_entity":"company","image":{"available_sizes":[[[150,38],"assets/images/resized/0005/3514/53514v2-max-150x150.png"],[[250,64],"assets/images/resized/0005/3514/53514v2-max-250x250.png"],[[450,116],"assets/images/resized/0005/3514/53514v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}