{"first_name":"Pinaki","last_name":"Ghosh","permalink":"pinaki-ghosh","crunchbase_url":"http://www.crunchbase.com/person/pinaki-ghosh","homepage_url":"http://pinakighosh.com","birthplace":"Kolkata","twitter_username":"","blog_url":"http://powerideaz.com","blog_feed_url":"http://powerideaz.com/feed/","affiliation_name":"Unaffiliated","born_year":1974,"born_month":10,"born_day":25,"tag_list":"pinaki, ghosh, writer, ghostwriter, ghostwriting, ghost-writer, author, bestseller, ebook, book","alias_list":null,"created_at":"Fri Dec 12 07:52:34 UTC 2008","updated_at":"Fri Jul 16 19:25:59 UTC 2010","overview":"<p>My Films</p>\n\n<p>Names of the films I am writing; have written, co-written (with other writers) or rewritten:</p>\n\n<ol>\n<li>The Willow</li>\n<li>Captain India (animated)</li>\n<li>Terminal Call</li>\n<li>Untitled superhero movie</li>\n<li>Fatal Illusion</li>\n<li>Locksmith</li>\n<li>Pacman, The People&#8217;s Champ</li>\n<li>The End Game</li>\n<li>Yamraj - 26 episode series for the Indian television</li>\n<li>Chacha Chaudhary The Movie (animated) - proposed</li>\n</ol>\n\n<p>My Books</p>\n\n<p>English language books authored by me</p>\n\n<ol>\n<li>How To Launch Your Product - And Make It Really Successful</li>\n<li>Why Men And Women Are North And South Poles</li>\n<li>How to Start A Huge E-Business From Home</li>\n<li>Save Yourself from Cyber Theft - Your Ultimate Survival Guide</li>\n</ol>\n\n<p>Bengali language books authored by me</p>\n\n<ol>\n<li>Aloukik Noy Loukik (Nothing Supernatural) Volume 3 (jointly authored with my  father, author Prabir Ghosh), Dey&#8217;s Publishing 1991</li>\n<li>Aloukik Rohoshyer Mukhomukhi, Dey&#8217;s Publishing collection of short stories, 1996</li>\n<li>Rohoshyer Chaar Adhyay, Dey&#8217;s Publishing collection of 3 short stories and 1 novel, 1998</li>\n<li>Rohoshyo Ebar Kolkatatei, Dey&#8217;s Publishing novel, 2000</li>\n<li>16 Theke 24, Dey&#8217;s Publishing collection of short stories for teenagers and young adults, 2005</li>\n<li>First Flight, Dey&#8217;s Publishing novel, 2007</li>\n</ol>\n\n<p>My Works</p>\n\n<p>My Early Days &amp; My First Bestseller at 17</p>\n\n<p>As a kid my favorite hobby was to sneak peek into my writer father, rationalist Prabir Ghosh&#8217;s study. I loved the smell of ink and paint (he is an artist as well) that hung in the room and started my own adventure-comics-series ‘Birdman’ at 10. Birdman became popular among my classmates and by 13 I was writing fiction regularly that would get published in magazines here and there. The teenagers’ magazine that I was editing since I was in grade 8, had reached a circulation of 4,000 by the time I was in grade 10, with some of the best writers contributing occasionally. I was given an offer by the biggest publisher of Eastern India; Dey&#8217;s Publishing, to write a 400 page book for them. The first turning point came in my life with the publication of my first big book, ‘Nothing Supernatural - III&#8217; (the first 2 volumes of the same book were authored by my father) at the age of 17. The book was a commercial success, while I was still in school.\nI started my career early. I became a regular contributor of almost all of the best magazines of the market after this; contributing fiction as well as nonfiction writings. Between 1995 and 2000 I wrote three more books (thrillers); two of which became bestsellers. I ventured as a movie director and in 1998 when I directed my first mini series for Doordarshan, the no 1 Asian television channel by popularity at that time.</p>\n\n<p>1st Indian language greeting cards</p>\n\n<p>In 1999 I was studying the greeting card market of the 100 billion population India. I found out that the market was huge and was controlled by few players and largely dominated by English language greeting cards. I came to a decision that I will try out Indian language greeting cards for this enormous market. In 2000 I launched the world’s first Bengali language greeting cards that were out of stock in 7 days. We had to reprint on the 8th day.</p>\n\n<p>BBC, National Geographic Channel, Wikipedia</p>\n\n<p>After working with National Geographic Channel in 2005, for (Is It Real? Superhuman Powers), I focused fully into writing. I had become somewhat busy by the end of 2005, writing simultaneously for several blogs every month. I became a Wikipedia editor in 2005 and came in contact with several prolific editors like Paulami Sengupta Sarkar (Editor of Unish Kuri and Anandamela).\nI Worked with BBC television for the film Desi DNA in May 2007, directed by Snageeta Sahdev. It was telecast on 6, 11 &amp; 12 August, on BBC.\n[edit]Bringing Hollywood and Bollywood screenwriters together\nIn July 2009 I launched TheScreenplayWriters.com, with my screenwriter friend Nick Blake. It is the first platform in history to bring Hollywood and Bollywood screenplay writers together.</p>\n\n<p>Works within India</p>\n\n<p>Besides launching the world&#8217;s 1st Bengali greeting cards, I have regularly written for magazines like Sananda (number 1 women&#8217;s magazine in Bengali), Unish Kuri (number 1 teen magazine in Eastern India). Recently started contributing in Anandamela, one of the oldest and most popular magazines for children.</p>\n\n<p>As a ghostwriter of celebrities</p>\n\n<p>I have have often worked as a ghostwriter for American, British and Indian celebrities, which include legendary Hollywood Salsa king, politicians and leaders. I have helped them write their biography or books on various subjects.</p>","image":{"available_sizes":[[[131,136],"assets/images/resized/0003/1631/31631v2-max-150x150.jpg"],[[131,136],"assets/images/resized/0003/1631/31631v2-max-250x250.jpg"],[[131,136],"assets/images/resized/0003/1631/31631v2-max-450x450.jpg"]],"attribution":"<p>Pinaki Ghosh</p>"},"degrees":[],"relationships":[{"is_past":true,"title":"Director","firm":{"name":"Power Publishers","permalink":"power-publishers","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"<object width=\"480\" height=\"385\"><param name=\"movie\" value=\"http://www.youtube.com/v/TgdRUe1IHpg&hl=en_US&fs=1&\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://www.youtube.com/v/TgdRUe1IHpg&hl=en_US&fs=1&\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"480\" height=\"385\"></embed></object>","description":"<p>Captain India - animated movie clip - screenplay by Pinaki Ghosh</p>"}],"external_links":[],"web_presences":[{"external_url":"http://www.flickr.com/photos/pinakighosh/","title":"Pinaki Ghosh in Flickr "},{"external_url":"http://stores.lulu.com/pinakighosh","title":"Pinaki Ghosh in Lulu"},{"external_url":"http://en.wikipedia.org/wiki/User:Pinaki_ghosh","title":"Pinaki Ghosh in Wikipedia"},{"external_url":"http://www.linkedin.com/in/writerpinaki","title":"Pinaki Ghosh in Linkedin"},{"external_url":"https://www.xing.com/profile/Pinaki_Ghosh","title":"Pinaki Ghosh in Xing"}]}