{"first_name":"Pär-Jörgen","last_name":"Pärson","permalink":"pr-jrgen-prson","crunchbase_url":"http://www.crunchbase.com/person/pr-jrgen-prson","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Northzone","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Mar 21 07:48:58 UTC 2008","updated_at":"Sat Mar 24 04:29:22 UTC 2012","overview":"<p>Pär-Jörgen joined Northzone in April 2003, bringing another fifteen years of strategic analysis, creativity and entrepreneurship onboard.</p>\n\n<p>Pär-Jörgen spent the last decade - since 1994 to be exact - within private equity and venture capital, most recently as a business angel investor.</p>\n\n<p>During 1998 to 2001 he built Cell Ventures, an early stage technology venture capital company to one of the hot European Internet investors. Cell Ventures in 2000 was sold to a publicly listed UK Investment Company for SEK 1.2 Billion. In the years before that, 1994-1998, he was active in the Private Equity sector, investing in consumer goods companies and serving as a Director in companies such as Falcon Bryggerier, Gillebagaren and Candelia.  During this period he also privately acquired Falkeskog Delikatesser, a distressed seafood producer, which he managed through a successful turn-around process.    </p>\n\n<p>Like a few others within Northzone, Pär-Jörgen also has a background as a Management Consultant with McKinsey &amp; Co. in Europe and in the US, serving clients within the telecom, technology and consumer goods industries.</p>\n\n<p>Although you are most likely to meet Pär-Jörgen in a business situation, you may also encounter this multi-talented partner as part of a Heavy Metal band, belting out his highly appreciated versions of Hendrix classic Purple Haze and such, at the same time bending the strings of one of many vintage guitars from his private collection.</p>\n\n<p>Pär-Jörgen holds an MBA from Stockholm School of Economics (1989) and Universita Commerciale Luigi Bocconi in Milan. Pär-Jörgen speaks Swedish, English, Italian, German and French.</p>\n\n<p>Pär-Jörgen serves as Chairman of the Board of Fox Technologies Inc and Wiral Internet Group, and as Director of Jasper Design Automation Inc, Proxilliant Systems Corp and Envox.</p>","image":{"available_sizes":[[[150,84],"assets/images/resized/0002/9652/29652v3-max-150x150.png"],[[250,141],"assets/images/resized/0002/9652/29652v3-max-250x250.png"],[[450,254],"assets/images/resized/0002/9652/29652v3-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Northzone","permalink":"northzone-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,25],"assets/images/resized/0001/6117/16117v3-max-150x150.png"],[[250,41],"assets/images/resized/0001/6117/16117v3-max-250x250.png"],[[450,75],"assets/images/resized/0001/6117/16117v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}