{"first_name":"Pradyot","last_name":"Sahu","permalink":"pradyot-sahu","crunchbase_url":"http://www.crunchbase.com/person/pradyot-sahu","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"3innovate","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jan 31 18:52:45 UTC 2011","updated_at":"Fri Feb 04 22:25:39 UTC 2011","overview":"<p>Pradyot Sahu is an Innovator and Speaker in Innovation and Technology and creator of Innovation Engineering a NEW discipline of Innovation and Engineering.</p>\n\n<p>PROFESSIONAL ACTIVITIES -Senior Member of IEEE, Member of Association of Computing Machinery and Internet Society. Speaker, IEEE India National Distinguished Lecturer Program, NDLP.</p>\n\n<p>Mentor of MentorEdge of IIM Ahmedabad’s Centre for Innovation Incubation and Entrepreneurship (CIIE). Mentor in IEEE Mentoring Connection Program and Mentor Net through ACM. Awarded International Innovation Award at Innovation Exchange for a Platform Innovation in a Global major company present in 180 countries in Food and Beverages Industry in 2009. </p>\n\n<p>Technical Program Committee Member and Paper Reviewer of IEEE International Conference on Management of Innovation and Technology ICMIT-2010 held in Singapore and ICMIT-2008 held in Bangkok, Thailand </p>\n\n<p>Paper Reviewer of IEEE International Technology Management Conference ITMC-2011 to be held in San Jose, CA, USA. Paper Reviewer of IEEE International Engineering Management Conferences; IEMC China-2008 held in Beijing, China, IEMC-2006 held in Brazil, IEMC-2005 held in Canada. Judge of IEEE Computer Society Web Programming Competition (CHC61) 2007. Interim Report Evaluator and Submission Evaluation Team Member of IEEE Computer Society International Design Competition, CSIDC-2005 and CSIDC-2004.</p>\n\n<p>VISUAL ARTS-Paint modern abstract arts in acrylic and digital medium. Work on artistic photography and video including non-fiction and non-profit sector. Work on theories of abstraction and transformation in Visual Arts and Innovation including Philosophical Abstractionism in modern art.</p>\n\n<p>SPECIALTIES Innovation, Innovation Engineering, Innovation Management, Technology, Product, Service and Social Innovation</p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0012/0104/120104v2-max-150x150.jpg"],[[80,80],"assets/images/resized/0012/0104/120104v2-max-250x250.jpg"],[[80,80],"assets/images/resized/0012/0104/120104v2-max-450x450.jpg"]],"attribution":"<p>Creative Commons</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"3innovate","permalink":"3innovate","type_of_entity":"company","image":{"available_sizes":[[[101,101],"assets/images/resized/0011/9753/119753v2-max-150x150.jpg"],[[101,101],"assets/images/resized/0011/9753/119753v2-max-250x250.jpg"],[[101,101],"assets/images/resized/0011/9753/119753v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/profile/view?id=4684617","title":"Pradyot Sahu in LinkedIn"},{"external_url":"http://www.facebook.com/pradyot.sahu","title":"Pradyot Sahu in Facebook"}]}