{"first_name":"Praerit","last_name":"Garg","permalink":"praerit-garg","crunchbase_url":"http://www.crunchbase.com/person/praerit-garg","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue May 05 05:18:08 UTC 2009","updated_at":"Tue May 05 05:18:47 UTC 2009","overview":"<p>Praerit was previously a Senior Director in Microsoft&#8217;s Server and Tools division where he built and managed the Dynamic Systems Platform &amp; Tools team.  Under his leadership, the team grew from 0 to over 70 people and drove a broad industry initiative to expand W3C&#8217;s XML standards to incorporate modeling enhancements called Service Modeling Language (SML).  The team also delivered technology and solutions across several Microsoft products, including the distributed modeling system in Visual Studio 2007, Group Policy tools in Windows Vista/Server 2008, Server Manager in Windows Server 2008 and Desired Configuration Management in System Center Configuration Manager 2007.  Praerit also led an acquisition and integration of a software company developing Group Policy tools.  Earlier in his 12+ year tenure at Microsoft he held various engineering leadership positions in Windows, ranging from a software developer driving US and European security certifications of Windows NT 3.51/4.0 products, to Group Program Manager for Windows Security delivering security infrastructure, such as Active Directory, Kerberos, PKI, EFS and Group Policy in Windows 2000, XP and 2003 releases.</p>\n\n<p>Praerit is a co-inventor on 14 U.S. and international patents and a co-author of IETF RFC 3645, Web Services WS-Trust and WS-Secure Conversation specifications. He holds an M.S. in Computer Science from Purdue University and a B.E.(Hons.) from Birla Institute of Technology &amp; Science, Pilani, India.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President & Co-founder","firm":{"name":"Symform","permalink":"symform","type_of_entity":"company","image":{"available_sizes":[[[150,35],"assets/images/resized/0004/3195/43195v1-max-150x150.png"],[[217,51],"assets/images/resized/0004/3195/43195v1-max-250x250.png"],[[217,51],"assets/images/resized/0004/3195/43195v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}