{"first_name":"Pratish","last_name":"Thaker","permalink":"pratish-thaker","crunchbase_url":"http://www.crunchbase.com/person/pratish-thaker","homepage_url":"","birthplace":"","twitter_username":"global_astro","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1979,"born_month":11,"born_day":15,"tag_list":"astrology-report, free-astrology-reading, indian-astrology, vedic-astrology, vedic-astrology-chart, chinese-astrology, love-astrology, astrology-compatibility, astrology-reading, astrology-chart, astrology-software, horoscope, birth-chart, natal-chart, as","alias_list":null,"created_at":"Tue Oct 12 09:05:25 UTC 2010","updated_at":"Tue Oct 12 18:23:00 UTC 2010","overview":"<p>We are one of the leading astrological services providers across the nation, having a remarkable background of consistently transmitting practical solutions by adopting innovative approaches committed to quality, accomplishments and outstanding results.\nThe organization has been providing reliable consulting services with huge customer support and counteractive measures to enterprises worldwide. It specializes in the areas of astrology and allied fields. Our expertise is our prevailing strength. A dynamic and young team with strong international exposure and advanced achiever spirit allows us to provide an exclusive arena of astrology experience to our clients.\nWe&#8217;ve been successfully creating positive changes to solve routine domestic issues and corporate concerns. To achieve this, we use practical, results-driven remedial measures that enable people to reduce their difficulties all the way through divine power.</p>","image":{"available_sizes":[[[150,139],"assets/images/resized/0010/5197/105197v2-max-150x150.jpg"],[[250,232],"assets/images/resized/0010/5197/105197v2-max-250x250.jpg"],[[450,418],"assets/images/resized/0010/5197/105197v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}