{"first_name":"Praveer","last_name":"Kumar","permalink":"praveer-kumar","crunchbase_url":"http://www.crunchbase.com/person/praveer-kumar","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jun 20 17:19:09 UTC 2012","updated_at":"Wed Jun 20 17:21:18 UTC 2012","overview":"<p>As Vice President of Engineering and Operations, Praveer is responsible for all aspects of core software development and operations infrastructure at BancBox. </p>\n\n<p>Praveer has more than ten years of software development management experience at both public and start-up companies, where he has managed the development of a wide range of technologies— including online marketing platforms, and globally distributed scalable applications.</p>\n\n<p>Prior to joining BancBox, Praveer oversaw research and development of performance marketing engineering as Sr. Manager of Software development at Yahoo! Inc. He was instrumental in the design and development of the next-gen lead generation platform at Yahoo. Praveer also lead a working group to identify and solve issues related to the end-to-end latency of banner advertisements. </p>\n\n<p>Prior to joining Yahoo, Praveer oversaw research and development of the entire product range at Digital Impact (Acxiom Digital) as Director of Software development. Praveer was the lead architect of the Relevance-X platform currently used by Acxiom to leverage the direct marketing power of PersonicX in an online environment. During his tenure at Digital Impact, Praveer was instrumental in designing and developing key infrastructure components for online email and search marketing. </p>\n\n<p>Apart from other distinctions, Praveer designed patent pending online event collection engine. Praveer has received Master’s degree in System Science and Structural Engineering from Louisiana State University. He holds a bachelors degree from National Institute of Engineering Rourkela, India.</p>","image":{"available_sizes":[[[132,139],"assets/images/resized/0019/6437/196437v1-max-150x150.png"],[[132,139],"assets/images/resized/0019/6437/196437v1-max-250x250.png"],[[132,139],"assets/images/resized/0019/6437/196437v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"VP Engineering","firm":{"name":"BancBox","permalink":"bancbox","type_of_entity":"company","image":{"available_sizes":[[[150,83],"assets/images/resized/0019/6435/196435v2-max-150x150.png"],[[161,90],"assets/images/resized/0019/6435/196435v2-max-250x250.png"],[[161,90],"assets/images/resized/0019/6435/196435v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}