{"first_name":"Pravin","last_name":"Narwankar","permalink":"pravin-narwankar","crunchbase_url":"http://www.crunchbase.com/person/pravin-narwankar","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Nov 18 11:51:12 UTC 2008","updated_at":"Tue Nov 18 12:15:02 UTC 2008","overview":"<p>Dr. Pravin Narwankar has a dual role as chief technology officer (CTO) for Applied Materials in India and investment manager for Applied Ventures in Applied Materials Corporate Business Development group since 2006. As CTO, his responsibilities include driving research and development for the India Global Development Capability center that provides engineering and software support services to Applied Materials locations around the world, as well as serving as the local Corporate Technology Council representative. His investment manager responsibilities include identifying new business and startup investment opportunities and engaging with local entrepreneurs and venture firms.</p>\n\n<p>Dr. Narwankar has been with Applied Materials for more than 11 years and has held a number of positions of increasing responsibility in research and product development for front end and back end of line products. He has more than 20 patents and 50 published articles on product development, materials synthesis and process integration.</p>\n\n<p>Dr. Narwankar received Bachelor of Technology and Master of Technology degrees in metallurgical engineering and materials science from the India Institute of Technology Bombay and holds a doctorate degree in materials science and engineering from the University of California, Berkeley.</p>","image":{"available_sizes":[[[105,150],"assets/images/resized/0002/8813/28813v1-max-150x150.jpg"],[[140,200],"assets/images/resized/0002/8813/28813v1-max-250x250.jpg"],[[140,200],"assets/images/resized/0002/8813/28813v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Investment Manager","firm":{"name":"Applied Ventures","permalink":"applied-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[111,46],"assets/images/resized/0002/8809/28809v1-max-150x150.jpg"],[[111,46],"assets/images/resized/0002/8809/28809v1-max-250x250.jpg"],[[111,46],"assets/images/resized/0002/8809/28809v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}