{"first_name":"Professor","last_name":"TAN Chorh Chuan","permalink":"professor-tan-chorh-chuan","crunchbase_url":"http://www.crunchbase.com/person/professor-tan-chorh-chuan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Nov 22 07:06:43 UTC 2008","updated_at":"Sun Nov 23 08:14:01 UTC 2008","overview":"<p>Professor Tan Chorh Chuan is Acting President and President-designate of the National University of Singapore. Currently the Deputy Chairman of Singapore’s Agency for Science, Technology and Research (A*STAR), Prof Tan also serves as Chief Executive of the National University Health System, as well as Senior Advisor to the Governing Board of Duke-NUS Graduate Medical School.</p>\n\n<p>A graduate of the National University of Singapore and a renal physician, Prof Tan started his medical career in 1983. He carried out his research training in the Institute of Molecular Medicine in Oxford, and obtained his PhD from NUS based on his research on the regulation of erythropoietin. He has been a Senior Consultant with the Division of Nephrology, National University Hospital (NUH), since 1997 and a Professor of Medicine with NUS since 1999. He headed the Department of Medicine from 1997 to 1998 and was Dean of the Faculty of Medicine from 1997 to 2000 and Chairman of the NUH Medical Board during the same period.</p>\n\n<p>He was appointed as the Director of Medical Services, Ministry of Health, from 2000 to 2004, in which capacity he was responsible for the medical response to the SARS epidemic in 2003.</p>\n\n<p>Prof Tan is the recipient of several awards. These include the National Science and Technology Medal in 2008 which accords national recognition to his role in developing Biomedical Sciences Research and Translational Clinical Research in Singapore; the Public Service Star (Singapore National Day Awards) in 2003 for outstanding contributions to overcoming SARS in Singapore; and the Public Administration Gold Medal in 2004 for his work in the Ministry of Health. In the academic field, the awards received include the Albert Schweitzer Gold Medal (awarded by the Polish Academy of Medicine); and the Achievement Medal (awarded by the Singapore Society of Nephrology). In addition, he won the 1996 Singapore Youth Award for his research in the regulation of erythropoietin.</p>\n\n<p>The fellowship awards which Prof Tan has received include the Commonwealth Medical Fellowship, Association of Commonwealth Universities, UK; and Wellcome Fellow, University of Oxford, UK.</p>\n\n<p>Prof Tan is a Fellow of the Royal College of Physicians of Edinburgh, Royal College of Physicians of London, the Royal Australasian College of Physicians, the American College of Physicians, the Academy of Medicine, Singapore, and elected Fellow of the Polish Academy of Medicine. He is also a Fellow of the Royal Geographical Society, UK. </p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0002/9220/29220v1-max-150x150.jpg"],[[80,80],"assets/images/resized/0002/9220/29220v1-max-250x250.jpg"],[[80,80],"assets/images/resized/0002/9220/29220v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Acting President","firm":{"name":"National University of Singapore","permalink":"national-university-of-singapore","type_of_entity":"financial_org","image":{"available_sizes":[[[139,63],"assets/images/resized/0002/9218/29218v1-max-150x150.jpg"],[[139,63],"assets/images/resized/0002/9218/29218v1-max-250x250.jpg"],[[139,63],"assets/images/resized/0002/9218/29218v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}