{"first_name":"Professor","last_name":"TAN Eng Chye","permalink":"professor-tan-eng-chye","crunchbase_url":"http://www.crunchbase.com/person/professor-tan-eng-chye","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Nov 22 07:06:43 UTC 2008","updated_at":"Sun Nov 23 08:15:47 UTC 2008","overview":"<p>Professor Tan Eng Chye is Deputy President (Academic Affairs) and Provost at the National University of Singapore.</p>\n\n<p>As Deputy President and Provost, he oversees and drives special strategic initiatives of critical importance for the University. His responsibilities include proposing the budget and resource allocation plan for the academic cluster; overseeing NUS Deans and their Faculties/ Schools; providing strategic directions and setting academic policies. He also has oversight of the development and implementation of new educational programmes and initiatives; and is responsible for educational quality assurance, overseeing admission policies and processes to ensure best quality enrolments. Prof Tan is responsible for the appointment, promotion and tenure process, as well as the reward and incentive systems for academic staff.</p>\n\n<p>Prof Tan has held positions of administrative leadership at Faculty and Department levels. He was Dean of Science from June 2003 to March 2007. Other positions included Chairman, Faculty Promotion and Tenure Committee from July 2001 to June 2003; Vice-Dean (Academic Affairs), Faculty of Science from July 1999 to June 2003; and Sub-Dean, Faculty of Science from July 1994 to August 1996 and from July 1998 to June 1999. He was also Deputy Head, Department of Mathematics from July 1999 to June 2000. </p>\n\n<p>Prof Tan initiated the Special Programme in Science in 1996, the precursor of NUS&#8217; Talent Development Programme which was re-structured as the current University Scholars Programme. Prof Tan is a passionate teacher and has won several teaching awards at the University and Faculty level &#8211; he was awarded the Innovative Teaching Award 1998 by the Faculty of Science; the Teaching Excellence Award for Innovative Teaching 1998 by the University; the Faculty Teaching Excellence Award 2004/2005; and the University Teaching Excellence Award 2004/2005.</p>\n\n<p>Currently, Prof Tan chairs the Management Board of the Risk Management Institute, NUS; and has been a member of the Management Boards of the Defence Science National Laboratories, MINDEF; Institute for Mathematical Sciences, NUS; Management Board, Singapore MIT Alliance and the MINDEF-NUS Temasek Laboratories, MINDEF. Prof Tan is also a Council member of the National Institute of Education, NTU.</p>\n\n<p>Prof Tan obtained his Bachelor in Mathematics (First Class Honours, 1985) at NUS and his PhD (1989) at Yale University. He joined NUS as a faculty member of the Department of Mathematics in 1985 (as a Senior Tutor) and has held visiting positions at various universities overseas such as the Rutgers University, University of Washington at Seattle, University of California at Berkeley and University of Maryland, USA; Universities of Tokyo and Kyoto, Japan; as well as the Hong Kong University of Science and Technology.</p>\n\n<p>Prof Tan is still an active national serviceman in Singapore, holding the rank of Deputy Superintendent of Police, and a command appointment as Commanding Officer of the Yishun South Neighbourhood Police Centre. He has also been active in promoting mathematics and mathematics education – he established the Singapore Mathematical Society Enrichment Programmes in 1994, revamped the Singapore Mathematical Olympiads in 1995 to allow more participation from students, as well as a series of workshops on the teaching of mathematics projects to teachers. He was Honorary Secretary, Singapore Mathematical Society from 1993 to 1995; serving as President of the Society from 2001 to 2005. He was also President of the South East Asian Mathematical Society from 2004 to 2005.</p>\n\n<p>Prof Tan&#8217;s research interests are Representation Theory of Lie Groups and Lie Algebras; and Invariant Theory and Algebraic Combinatorics. He has been invited to speak in numerous top conferences overseas, and has published more than 20 articles in top internationally-refereed journals and conference proceedings. He has co-authored three books on mathematics, including a graduate text on the Lie group SL(2,R). Prof Tan has also been active in organising workshops and international conferences, the most notable one being the recent Fourth Asian Mathematical Conference held at NUS in July 2005.</p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0002/9221/29221v1-max-150x150.jpg"],[[80,80],"assets/images/resized/0002/9221/29221v1-max-250x250.jpg"],[[80,80],"assets/images/resized/0002/9221/29221v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Deputy President (Academic Affairs)","firm":{"name":"National University of Singapore","permalink":"national-university-of-singapore","type_of_entity":"financial_org","image":{"available_sizes":[[[139,63],"assets/images/resized/0002/9218/29218v1-max-150x150.jpg"],[[139,63],"assets/images/resized/0002/9218/29218v1-max-250x250.jpg"],[[139,63],"assets/images/resized/0002/9218/29218v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}