{"first_name":"Profit Sense","last_name":"Innovations","permalink":"profit-sense-innovations","crunchbase_url":"http://www.crunchbase.com/person/profit-sense-innovations","homepage_url":"http://www.profitsi.com","birthplace":"USA","twitter_username":"profitsense","blog_url":"http://profitsenseinnovations.blogspot.com","blog_feed_url":"http://feeds.feedburner.com/blogspot/OXfAa","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"business, small-business, entrepreneur, entrepreneurs, consulting, management, web-design, web, website, web-development, marketing, market-research, seo, business-plan, logo, logo-design, design","alias_list":null,"created_at":"Fri Apr 15 17:02:11 UTC 2011","updated_at":"Sat Apr 30 08:28:56 UTC 2011","overview":"<p>Profit Sense Innovations (Profit SI) is an online based small business development firm. Profit Sense Innovations has developed its system of providing its clients with the essential tools necessary to establish a thriving business. We are a pioneering company, able to identify the emerging trends in today’s business world. With the use of our knowledge, our clients will be equipped for the emerging needs that appear in everyday business operations. Profit Sense Innovations is committed to providing innovative solutions to aid in the success of our clients. The continuous communication we provide is vital in avoiding pitfalls and common trial and error mistakes that normally occur with owning your own business.</p>\n\n<p>Profit Sense Innovations takes pride in the support we provide by keeping constant contact with our clients each step of the way in the decision-making process. We pursue this objective by providing superior service, aggressive research and constant development of new strategies to improve our clients standing in the marketplace.</p>\n\n<p>Profit Sense Innovations, headquartered in the Northeast, was founded by a group of experienced individuals who have been in the industry for over a decade and understand the need for quality and reliable service necessary to establish a growing business. Our goal is to supply high quality service which integrates meaningful employment while earning an acceptable profit for our clients. Interacting with our experts in the e-commerce industry, website development, and our specialists in business planning and financing will give our clients the leverage they need in a fast-paced moving market.</p>\n\n<p>VISIT US AT www.ProfitSI.com to read more on how to start a successful business online.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0013/0721/130721v2-max-150x150.png"],[[250,250],"assets/images/resized/0013/0721/130721v2-max-250x250.png"],[[250,250],"assets/images/resized/0013/0721/130721v2-max-450x450.png"]],"attribution":"<p>Profit Sense Logo</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"<iframe title=\"YouTube video player\" width=\"480\" height=\"390\" src=\"http://www.youtube.com/embed/MR5dWxj2GEk\" frameborder=\"0\" allowfullscreen></iframe>","description":"<p>Profit Sense Innovations Helps Entrepreneurs</p>"}],"external_links":[],"web_presences":[{"external_url":"http://www.profitsi.com","title":"Profit Sense Innovations"},{"external_url":"http://www.twitter.com/profitsense","title":"Profit Sense Twitter"},{"external_url":"http://www.facebook.com/profitsenseinnovations","title":"Profit Sense Facebook"},{"external_url":"http://profitsenseinnovations.blogspot.com","title":"Profit Sense Blog"}]}