{"first_name":"Promod","last_name":"Haque","permalink":"promod-haque","crunchbase_url":"http://www.crunchbase.com/person/promod-haque","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jan 05 00:19:35 UTC 2010","updated_at":"Fri Dec 17 23:18:25 UTC 2010","overview":"<p>Promod has 19 years of experience in the venture capital industry and currently serves as managing partner at Norwest Venture Partners. He joined Norwest Venture Partners in 1990. He has been ranked as a top dealmaker on the annual Forbes Midas List for the past nine years, and in 2004, Forbes named him as the #1 venture capitalist based on performance over the last decade. In 2006, Promod was presented with a Global Leadership award from NASSCOM.\nPromod focuses on investments in semiconductor and components, systems, software and services. He was an early investor and a board member of Cerent (acquired by Cisco), Siara Systems (acquired by Redback Networks), OnDisplay (acquired by Vignette), Winphoria Networks (acquired by Motorola) and Extreme Networks (Nasdaq: EXTR).</p>\n\n<p>His current investments include Adventity, AmberPoint, Appnomic Systems, Cast Iron Systems, Cyan Optics, FireEye, Persistent Systems, Sonoa Systems, Sulekha, Vanu, Veveo, Virtela Communications and Yatra. Other notable investments and previous board seats include Tivoli Systems (acquired by IBM), Forte Software (acquired by Sun Microsystems), Kiva Software (acquired by Netscape), Information Advantage (acquired by Sterling Software), Arbortext (acquired by PTC), Open-Silicon (acquired by Unicorn Investment Bank), Resonext Communications (acquired by RF Micro Devices), Showcase (acquired by SPSS), Yipes (acquired by Reliance/Flag Telecom) and ZettaCom (acquired by IDT).</p>\n\n<p>Prior to Norwest Venture Partners, Promod spent 18 years in various operational roles ranging from product development, marketing, Chief Operating Officer and Chief Executive Officer at various public and private companies - Siemens International, Thorn EMI, Emergent Technologies and Dimensional Medicine, Inc.\nHe received a bachelor of science in electrical engineering from the University of Delhi, India. He holds a Ph.D. in electrical engineering from Northwestern University and an MBA from Northwestern&#8217;s Kellogg Graduate School of Management, where he serves on the advisory board. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing Partner","firm":{"name":"Norwest Venture Partners","permalink":"norwest-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[86,88],"assets/images/resized/0001/5074/15074v1-max-150x150.png"],[[86,88],"assets/images/resized/0001/5074/15074v1-max-250x250.png"],[[86,88],"assets/images/resized/0001/5074/15074v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}