{"first_name":"Pubashan","last_name":"Naidoo","permalink":"pubashan-naidoo","crunchbase_url":"http://www.crunchbase.com/person/pubashan-naidoo","homepage_url":"http://www.bashan99.com","birthplace":"South Africa, Durban","twitter_username":"bashan99","blog_url":"http://www.bashan99.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1985,"born_month":12,"born_day":7,"tag_list":"pubashan-naidoo, bashan99, seo, search-engine-optimizationseo, search-engine-optimization, social-media, facebook, twitter, seo-guru","alias_list":null,"created_at":"Sat Jul 03 19:05:34 UTC 2010","updated_at":"Tue Jun 05 03:10:52 UTC 2012","overview":"<p>The name Naidoo, Pubashan Naidoo but friends and family call me bashan. I am proudly South Africa and enjoy every second of it. I am a Sagittarius (The Archer) by nature. Yes ladies big and strongJ in addition to that I am a freedom loving, optimistic and honest dude. Thank to my parents who put me through 12 hard years of school, I ended up with a merit in grade 12. Then further my education by completing my BTECH in Information Technology(IT) at the Durban University of Technology(DUT). Recently completed my Search Engine Optimization Exam (Check it out http://seocertification.org/viewmember.php?ID=720  )</p>\n\n<p>So what do I do…? I’m into website development and online marketing. I can design, develop and SEO(Search Engine Optimization) a website from start to finish. My website will crack a specific market I choice within two weeks when it generally takes 3-5 weeks for google to index you website. What can I say when you good you good:-). You must be wondering how I do that. Well you know the saying a magician does not give await his secrets. In this case me tooJ. Ok I will share with you just one. It is by understanding how google really works. Google works in three ways. First google uses Googlebot(aka Google&#8217;s Web Crawler) which finds and retrieves pages on the web and hands them off to the google indexer. Secondly Googlebot gives the indexer the full text of the pages it finds, which is then stored alphabetically in Google&#8217;s index database. Last but not least Google uses Google&#8217;s Query processor, this has several part including the search box/search interface that evaluates queries and matches them to the relevant documents and the results formatter. In addition PageRank is Google&#8217;s system for ranking web pages. A page with a higher Pagerank is deemed more important and is more likely to be listed above the page with a lower PageRank. Well that all the secrets I’m going to give away today kids. That was just a brief understanding of how Google operates.</p>\n\n<p>I have +- 2years in Search Engine Optimization(SEO) experiences. I have been trained by the best in the business. My Specialties is Search Engine Optimisation organic style, Pay per click (PPC) advertising, Search Engine Marketing (SEM), Email Marketing, Article Marketing, Social Media Marketing and Blogging.</p>\n\n<p>Enough about me, I want to hear from you. You can contact me for advice or just to chat.</p>\n\n<p>Regards</p>\n\n<p>Pubashan Naidoo(bashan99)</p>","image":{"available_sizes":[[[97,130],"assets/images/resized/0009/2379/92379v2-max-150x150.jpg"],[[97,130],"assets/images/resized/0009/2379/92379v2-max-250x250.jpg"],[[97,130],"assets/images/resized/0009/2379/92379v2-max-450x450.jpg"]],"attribution":"<p>Pubashan Naidoo</p>"},"degrees":[{"degree_type":"BTECT","subject":"Information Technologu","institution":"Durban University Of Technology","graduated_year":2008,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}