{"first_name":"Puneet","last_name":"Agarwal","permalink":"puneet-agarwal","crunchbase_url":"http://www.crunchbase.com/person/puneet-agarwal","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Oct 30 15:12:35 UTC 2009","updated_at":"Mon Jul 11 19:07:46 UTC 2011","overview":"<p>Puneet Agarwal is Chief Operating Officer of Bling Nation. In this role, Agarwal is responsible for overseeing all company operations and product development for Bling Nation. Prior to joining Bling Nation, Agarwal led product development and marketing for an industry innovating debit product within Capital One&#8217;s Payments business. During his tenure with Capital One, he also led strategic management and pricing for their fast growing Direct Bank business. Prior to that, Agarwal worked as a consultant with McKinsey &amp; Co. where he helped clients develop and implement strategies to grow the business and achieve competitive advantage through operational excellence. He used his expertise in operations design and improvement to help clients across industries (including financial services, pharmaceuticals and manufacturing) achieve significant improvements in cost, effectiveness and time to introduce products and services in the market. He was also a leader in McKinsey&#8217;s Operations Strategy and Effectiveness practice. Agarwal holds an MBA degree from Purdue University and a mechanical engineering degree from IIT (Indian Institute of Technology), New Delhi.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"COO","firm":{"name":"Bling Nation","permalink":"bling-nation","type_of_entity":"company","image":{"available_sizes":[[[150,100],"assets/images/resized/0005/1717/51717v13-max-150x150.jpg"],[[165,110],"assets/images/resized/0005/1717/51717v13-max-250x250.jpg"],[[165,110],"assets/images/resized/0005/1717/51717v13-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}