{"first_name":"pure","last_name":"vpn","permalink":"pure-vpn","crunchbase_url":"http://www.crunchbase.com/person/pure-vpn","homepage_url":"http://www.purevpn.com","birthplace":"Hongkong","twitter_username":"purevpn","blog_url":"http://www.purevpn.com/blog/","blog_feed_url":"http://www.purevpn.com/blog/feed/","affiliation_name":"Unaffiliated","born_year":1999,"born_month":null,"born_day":null,"tag_list":"vpn, vpn-service, vpn-connection, unbloc-sites, android-vpn, uk-vpn, usa-vpn","alias_list":null,"created_at":"Fri Jan 21 12:08:41 UTC 2011","updated_at":"Wed Sep 26 12:54:55 UTC 2012","overview":"<p>A VPN or virtual private network is a method used to connect two networks together securely. It provides a secure way for your data to travel through what is known as a tunnel</p>\n\n<p>VPN technology is based on the idea of security, anonymity and to access certain resources over the network that are not accessible directly because your computer is not plugged into the network when you are not on campus or if you are using wireless connections. Also, it allows user to by pass Geo-restrictions and access the content that is blocked on your network, your territory or in your whole Country.</p>\n\n<p>PureVPN is one of those VPN providers in the market who are pioneers and very well equipped with the technology. They are currently offering PPTP, L2TP and SSTP VPN services with their existence in 18 countries and VPN servers in 50+ locations.</p>\n\n<p>Iv&#8217;e been using it for quite some time now. It is really enough for a normal personal usage. The speeds can be a bit slow at night, but that is more than likely also the prime time for people to be using the service. I do most of my downloading during the day and find that the speeds stay pretty close to my ISP provided speeds.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.purevpn.com/vpn-service/uk-vpn-services.php","title":"UK VPN Service"}]}