{"first_name":"quincy","last_name":"jackson","permalink":"quincy-jackson","crunchbase_url":"http://www.crunchbase.com/person/quincy-jackson","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"n/a","born_year":1977,"born_month":1,"born_day":3,"tag_list":"music, art, games, pets, world-events, people, entertainment, anime, rock, goth, punk-rap, rb, jazz, ska, hip-hop-electronic, house, classical, newage, world-music, international-music, video-game-music, sound-stracksscifi-types, horrortypes, porn-types, ","alias_list":null,"created_at":"Sun Aug 01 19:19:07 UTC 2010","updated_at":"Mon Aug 02 20:27:10 UTC 2010","overview":"<p>I would say that I am easy going Dark type of humor type being who likes to\nmake fun of everything. I am a crazy capricorn from Buffalo Ny that lives In\na place called Baltimore md. Been here most of my life. never been to hung up on luck but there is a number  that i call my own and that is  2. when it comes down to\nfaith am I the  Satanists,Atheists,Agnostic,Pangan type person.  If thats to much for you then you should stop reading this right now.Not  religious but I am spiritual  some what. I am my own God and Devil as I see it. In other words I have a God complex. it is a is a non-clinical term generally used to describe an individual who consistently believes they can accomplish more than is humanly possible or that their opinion is automatically above those they may disagree with. The individual may believe he or she is above the rules of society and should be given special consideration.  Of course to put in anothere way would be Narcissistic personality. Don&#8217;t worry I dont do cults. Life To me is the self and how we live it. Its also  a hunt to find our self or  whatever there out there. Just like evey body else we all have to feast or eat. This eveything that comes out this thing called life.   Our Idealism,Politics,faith, Ideology is all one big perception in\nmy Opinion.</p>\n\n<p>I can be a real smart ass at times but there is a kind side to my self  I can be cold but i can be cool too. For the most part  I am just me. Never been one to follow the rest the sheep.  </p>\n\n<p>When I see the plight of this world it makes me feel better about my self becaues i know it can alway be worse.  I can be social or anitsocial. Thats me playing my lone wolf card.Not  much for saying good moring or giving to the poor. Not that I would not give to one.  What can I say? I am very selective of my generosity to people. In my mind friends are very important to have. it makes life fun next to every thing else.</p>\n\n<p>In theroy I feel that I can hang out with anyone  as long as they don&#8217;t mess up my world.</p>\n\n<p>Money makes the world go round thats what I hear but I know better. Money is only a tool for me to open othere doors.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"n/a","permalink":"n-a","type_of_entity":"company","image":null}},{"is_past":false,"title":"","firm":{"name":"Doma","permalink":"doma","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://en.wikipedia.org/wiki/Mercedes-Benz","title":""}],"web_presences":[]}