{"first_name":"R.","last_name":"Adam Smith","permalink":"r-adam-smith","crunchbase_url":"http://www.crunchbase.com/person/r-adam-smith","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"VandM (Vintage and Modern)","born_year":null,"born_month":null,"born_day":null,"tag_list":"vintage-and-modern, vandm","alias_list":null,"created_at":"Mon Feb 06 22:17:12 UTC 2012","updated_at":"Thu Oct 25 06:56:05 UTC 2012","overview":"<p>Adam is an experienced investor and advisor to small and middle market private companies, with approximately 20 years’ experience in private equity and mergers &amp; acquisitions. In 2002, he founded Circle Peak Capital (CPC), a private investment partnership based in Manhattan; and in December of 2010, he formed Design Holdings Co LLC and acquired V&amp;M, the leading online source for unique vintage furniture, antiques, art, jewelry, fashion and design from around the world.</p>\n\n<p>Prior to forming Circle Peak, Adam served in principal capacities at two leading private equity firms based in New York City, Caxton-Iseman Capital LLC and Castle Harlan, In., each with over $2 billion in managed equity capital. At these firms, he worked directly with senior management teams and institutional limited partners, co-investors, and lenders in the acquisition and growth of $25 million to $1 billion companies. Adam has also been involved in control-stake private investments, collectively representing approximately $1.5 billion in sales, $200 million in EBITDA, and $400 million in equity commitments. At Lehman Brothers he was in the Financial Sponsors Group where he advised on financial and strategic issues for leading consumer, financial services, and industrial U.S. and European middle market corporations and private equity firms. Adam was also employed by Columbus Advisors, prior to Columbia Business School, then a leading emerging markets alternative investment partnership with approximately $100 million in assets, which launched his career in the global financial institutions practice at Solomon Brothers Inc.</p>\n\n<p>Adam earned an MBA with honors from the Graduate School of Business at Columbia University and a BA cum laude in International Relations and Economics from Boston University. He is an active alumnus of Columbia Business School, a founding board member of the School’s Private Equity Advisory Board, and a founder of the school’s Investment Management Conference in 1997. </p>\n\n<p>His passion for philanthropy has involved him with numerous organizations: co-founder of Friends of Leukemia Fighters, an oncology non-profit associated with the Weill Medical College of Cornell University and New York Presbyterian Hospital of New York City; chairman, Inaugural Piece for Peace Concert of the Tanenbaum Center in New York City; and advisor to 1000 Museums and Sylvester Manor, an educational farm on Shelter Island, New York.</p>\n\n<p>In addition to Capital Peak Capital and Design Holdings, Adam is an adviser and/or board member to several private businesses and partnerships including Rocket Dog Holdings LLC. He is married with two children and lives in New York City and Shelter Island.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0021/6667/216667v2-max-150x150.jpg"],[[220,220],"assets/images/resized/0021/6667/216667v2-max-250x250.jpg"],[[220,220],"assets/images/resized/0021/6667/216667v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor","subject":"International Relations","institution":"Boston University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"Bachelor","subject":"Economics","institution":"Boston University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"Columbia Business School","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chairman and CEO","firm":{"name":"VandM (Vintage and Modern)","permalink":"vandm-vintage-modern","type_of_entity":"company","image":{"available_sizes":[[[150,57],"assets/images/resized/0017/3172/173172v4-max-150x150.jpg"],[[162,62],"assets/images/resized/0017/3172/173172v4-max-250x250.jpg"],[[162,62],"assets/images/resized/0017/3172/173172v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.circlepeakcapital.com","title":"Circle Peak Capital, Managing Member & Founder"},{"external_url":"http://www.vandm.com","title":"CEO & Chairman"}]}