{"first_name":"R.","last_name":"Duncan McPherson","permalink":"r-duncan-mcpherson","crunchbase_url":"http://www.crunchbase.com/person/r-duncan-mcpherson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri May 15 11:09:37 UTC 2009","updated_at":"Fri May 15 12:47:58 UTC 2009","overview":"<p>Duncan McPherson has more than 30 years experience as a successful software and information technology executive, with a history and passion for building, managing and transforming companies into market leaders. He joined Unitrends in January 2006, and served as its President and Chief Operating Officer before assuming the position of Chief Executive Officer in January 2007. McPherson also serves on Unitrends&#8217; Board of Directors.</p>\n\n<p>Before joining Unitrends, McPherson had held top-level advisory and interim-executive positions at a number of firms within the information technology industry for the last 11 years. In these roles, he provided operational leadership, general CEO and management team coaching and support, strategy development and implementation, operational analysis and corporate development support. Previously, he spent more than 20 years in traditional operating positions, all with technology companies.</p>\n\n<p>From 1986 to 1995, McPherson held various roles with Corbel &amp; Co, a computer services and software firm specializing in the employee benefits industry. He ultimately served as President and Chief Executive Officer and a member of the Board of Directors, and helped successfully sell the company in 1993 to Broadway &amp; Seymour, another software and services firm. For the next two years, McPherson continued to manage this business, as it became the most profitable and successful division of Broadway &amp; Seymour, achieving 100 percent revenue growth and 150 percent profit growth during that period.</p>\n\n<p>Before taking the helm at Corbel &amp; Co, he held several Vice President positions, including both Sales and Marketing functional responsibilities and overall leadership of the company’s Employee Benefit Services division. McPherson began his career at ADP Network Services, Inc. in Ann Arbor, MI, eventually becoming Vice President of Financial Services, responsible for $25 million in revenue.</p>\n\n<p>McPherson earned a Bachelor of Arts degree in computer science and psychology from Colgate University and a Master of Business Administration degree from the University of Michigan.</p>","image":{"available_sizes":[[[109,150],"assets/images/resized/0004/4228/44228v1-max-150x150.jpg"],[[125,171],"assets/images/resized/0004/4228/44228v1-max-250x250.jpg"],[[125,171],"assets/images/resized/0004/4228/44228v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor of Arts ","subject":"computer science and psychology","institution":"Colgate University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"President and CEO","firm":{"name":"Unitrends Software","permalink":"unitrends-software","type_of_entity":"company","image":{"available_sizes":[[[150,75],"assets/images/resized/0004/4197/44197v1-max-150x150.jpg"],[[250,125],"assets/images/resized/0004/4197/44197v1-max-250x250.jpg"],[[300,150],"assets/images/resized/0004/4197/44197v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}