{"first_name":"R \"Ray\"","last_name":"Wang","permalink":"r-ray-wang","crunchbase_url":"http://www.crunchbase.com/person/r-ray-wang","homepage_url":"http://www.ConstellationRG.com","birthplace":"United States","twitter_username":"rwang0","blog_url":"http://blog.softwareinsider.org","blog_feed_url":"http://blog.softwareinsider.org/feed/","affiliation_name":"Constellation Research","born_year":null,"born_month":null,"born_day":null,"tag_list":"rwang0-softwareinsider-r-ray-wang-altimeter-enterprise-software-next-generation-cio-cto-disruptive-technologies-altimeter-founder","alias_list":null,"created_at":"Sat Sep 04 06:46:07 UTC 2010","updated_at":"Mon Apr 09 07:33:07 UTC 2012","overview":"<p>Enterprise Strategist and Disruptive Technologies Expert</p>\n\n<p>R &#8220;Ray&#8221; Wang currently is the Principal Analyst and CEO at Constellation Research, Inc.. He previously was a founding partner and research analyst for enterprise strategy at Altimeter Group and the author of the popular enterprise software blog &#8220;A Software Insider’s Point of View&#8221;. With viewership in the millions of page views a year, his blog provides insight into how disruptive technologies and new business models impact the enterprise. A background in emerging business and technology trends, enterprise apps strategy, technology selection, and contract negotiations provides clients and readers with the bridge between business leadership and technology adoption.</p>\n\n<p>Buyers seek Ray’s research in disruptive technologies and their impact on business processes, business models, and organizational design. Business topics focus on harnessing innovation, creating next generation business and IT leadership, and applying the new rules of business. Technology topics include SaaS/Cloud solutions, Social CRM, Next Gen ERP and apps, business process transformation, Project Based Solutions, Order Management, Master Data Management, and middleware technologies.</p>\n\n<p>For technology sellers, Ray provides strategic guidance in go-to-market strategies; reviews and designs software licensing, pricing, support, and maintenance policies; delivers competitive assessments; evaluates software partner ecosystems, and researches business processes such as the perfect order and customer experience for the enterprise and SMB markets.\nMedia Influence</p>\n\n<p>Publications such as The Wall Street Journal, Bloomberg, Business Week, Fortune, Inc., The Associated Press, CIO Magazine, Information Week, ComputerWorld, Financial Times, eWeek, CRM Magazine, IDG News, ZDNet, TechTarget, and Managing Automation frequently seek his point of view. An energetic and passionate keynote speaker, Ray’s appeared on several video outlets including CNBC.\nIndustry Recognition</p>\n\n<p>In both 2008 and 2009, Ray was recognized by the prestigious Institute of Industry Analyst Relations (IIAR) as the Analyst of the Year and in 2009 he was recognized as one of the most important analysts for Enterprise, SMB, and Software. In 2009, A Software Insider’s POV was listed in the top 20 of Jonny Bentwood’s Technobabble 2.0 Top Industry Analyst Blogs. In 2010, Ray was listed as one of the Top 5 Analyst Tweeters in Edelman’s TweetLevel Index, recorded as part of the ARInsights Power 100 List Of Industry Analysts, and named one of the top Influential Leaders in the CRM Magazine 2010 Market Awards.\nBusiness And Technology Experience</p>\n\n<p>Ray brings enterprise experiences honed from two decades of product management, management consulting, and technology marketing roles. Prior to serving as a VP and Principal Analyst at Forrester for enterprise apps strategy and contract negotiations, he headed up the customer relationship management (CRM) analyst relations program for PeopleSoft. At Oracle, Ray served senior product management roles in the E-Business Suite. While at Personify, Ray was the marketing chief for a Web analytics startup valued at $500 million.</p>\n\n<p>Before working for packaged application vendors, Ray developed his management consulting and business strategy experience at Capgemini Ernst &amp; Young, Deloitte Consulting, Detroit Medical Center, and the Johns Hopkins Hospital. He specialized in business transformation at the executive level, general strategy, program management, change management, mergers and acquisitions, SAP/ERP implementations, and healthcare operations.\nEducation</p>\n\n<p>Ray graduated from the Johns Hopkins University with a B.A. in natural sciences and public health. His graduate training includes a master’s degree from the Johns Hopkins University in health policy and management; and health finance and management. He is also certified in SAP FI/CO modules, facilitation, and program management office.</p>\n\n<p>Ray currently serves on the Board of Advisors for the University of Toronto’s Rotman School of Management’s Centre For CRM Excellence.</p>\n\n<p>Email: r AT ConstellationRG DOT com &amp; r AT softwareinsider DOT com</p>","image":{"available_sizes":[[[104,150],"assets/images/resized/0010/0536/100536v2-max-150x150.png"],[[129,186],"assets/images/resized/0010/0536/100536v2-max-250x250.png"],[[129,186],"assets/images/resized/0010/0536/100536v2-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"MPH","subject":"Health Finance and Management","institution":"Johns Hopkins","graduated_year":1995,"graduated_month":null,"graduated_day":null},{"degree_type":"MPH","subject":"Health Policy and Management","institution":"Johns Hopkins","graduated_year":1995,"graduated_month":null,"graduated_day":null},{"degree_type":"BA","subject":"Natural Sciences and Public Health","institution":"Johns Hopkins","graduated_year":1993,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO & Principal Analyst","firm":{"name":"Constellation Research","permalink":"constellation-research","type_of_entity":"company","image":{"available_sizes":[[[150,90],"assets/images/resized/0010/9341/109341v2-max-150x150.png"],[[250,150],"assets/images/resized/0010/9341/109341v2-max-250x250.png"],[[450,270],"assets/images/resized/0010/9341/109341v2-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"","firm":{"name":"Altimeter Group","permalink":"altimeter-group","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0005/3605/53605v5-max-150x150.png"],[[250,83],"assets/images/resized/0005/3605/53605v5-max-250x250.png"],[[300,100],"assets/images/resized/0005/3605/53605v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.softwareinsider.org","title":"Founder"},{"external_url":"http://blogs.forbes.com/people/raywang/","title":"Contributor"}]}