{"first_name":"Rael","last_name":"Levitt","permalink":"rael-levitt","crunchbase_url":"http://www.crunchbase.com/person/rael-levitt","homepage_url":"http://www.raellevitt.co.za/","birthplace":"South Africe","twitter_username":"RaelLevitt","blog_url":"http://www.raellevitt.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"rael-levitt, alliance-group, south-africa, auctions","alias_list":null,"created_at":"Mon Aug 20 12:10:12 UTC 2012","updated_at":"Mon Aug 27 08:41:12 UTC 2012","overview":"<p>Who is Rael Levitt</p>\n\n<p>Auctioneering in South Africa is almost synonymous with the name Rael Levitt. Levitt established and managed one of the country’s (in fact the world’s) most successful auction companies. As a young man of 20 Levitt founded the Levco Property Group, his first company, which proved to be the first step on the way to his current position as CEO of the Alliance Group. Auction Alliance, Asset Alliance, Alliance BusinessBrokers, Alliance Finance and Valuation Alliance were united under the umbrella of the group.</p>\n\n<p>Auction Alliance</p>\n\n<p>Since its establishment in 1998, Auction Alliance grew into one of SA’s largest auctioneering houses, and at one stage reaching over 300 employees with offices in South Africa, Namibia, Swaziland and Dubai (in the United Arab Emireates). The company focuses on helping its clients first to identify their assets, and then to monetize them, utilizing the auction mechanism. Under Marketing Director, Ronen Jackson together with Rael Levitt’s leadership,  the marketing department of Auction Alliance grew into an international award winner, taking the number one position at the prestigious “USA-Today NAA Award” for auction marketing on three different occasions. Another innovation under Levitt’s management was the development of the first ever multiple </p>\n\n<p>auctions in South Africa. </p>\n\n<p>Rael Levitt’s hands-on, results-oriented approach to management led to organizational improvements and the implementation of best practices, making a large contribution to the growth of the Alliance Group to a R55 million company.</p>\n\n<p>Benefits and Charity</p>\n\n<p>Rael Levitt is active on many levels in the community in South Africa and believes firmly in giving back to this community. He is a founder trustee of the Tsojana Trust, a former trustee of the Rambam Trust, and a board member of several charities.  Led by Rael Levitt, the Alliance Group over the years held benefit auctions for President Zuma, President Mbeki, President Mandela and President FW De Klerk. Over the last twenty years Auction Alliance and its predecessors raised over R200m for a  host of charities. </p>\n\n<p>Background</p>\n\n<p>Rael Levitt was born, raised and educated in Cape Town, the city he still calls home. His degree in law and economics is from the University of Cape Town. </p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0020/6949/206949v2-max-150x150.jpg"],[[143,190],"assets/images/resized/0020/6949/206949v2-max-250x250.jpg"],[[143,190],"assets/images/resized/0020/6949/206949v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"<iframe width=\"420\" height=\"315\" src=\"http://www.youtube.com/embed/iVEdKPC1UCg\" frameborder=\"0\" allowfullscreen></iframe>","description":"<p>Rael Levitt - Top Dog interview</p>"}],"external_links":[],"web_presences":[{"external_url":"http://www.raellevitt.org/","title":"Who is Rael Levitt?"}]}