{"first_name":"Raffi","last_name":"Kesten","permalink":"raffi-kesten","crunchbase_url":"http://www.crunchbase.com/person/raffi-kesten","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 14 17:33:41 UTC 2008","updated_at":"Sun Nov 16 19:49:04 UTC 2008","overview":"<p>Raffi is a seasoned veteran of the Israeli business scene with over 20 years of experience in semiconductors and innovative materials. He uses his expertise to advise JVP in communications software, semiconductors and components sectors. Widely considered an expert in his field, Raffi also serves as General Manager of NDS Israel and as Senior Vice President of NDS World Wide (NASDAQ: NNDS).</p>\n\n<p>At NDS Israel, Raffi is responsible for leading a highly successful company that focuses on pay television technology, video encryption, and other security applications as well as pioneering iTV and PVR technology for satellite and cable communication. The company currently employs more than 650 people in Israel and 1500 employees worldwide. Prior to joining NDS, he spent 5 years as VP of Operations and Production of Imaging Products at Indigo. At Indigo, Raffi was responsible for production output of sophisticated Imaging products, logistics, budget control and interaction with key customers. Previously, Raffi worked at Intel, where he held several engineering and managerial positions, including process engineering, integration of advanced technologies, deployment of state of the art equipment and human resources managerial activities. During his 11 years at Intel, Raffi won numerous awards for his forward thinking and problem solving. Among these awards are the International Achievement Award for the development of an improved process that doubled the yield of the 80386 chip. Raffi served in an elite commando unit of the Israeli Defense Forces.</p>","image":{"available_sizes":[[[150,103],"assets/images/resized/0002/8695/28695v1-max-150x150.jpg"],[[160,110],"assets/images/resized/0002/8695/28695v1-max-250x250.jpg"],[[160,110],"assets/images/resized/0002/8695/28695v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Venture Partner","firm":{"name":"Jerusalem Venture Partners","permalink":"jerusalem-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[104,150],"assets/images/resized/0002/8552/28552v2-max-150x150.jpg"],[[113,162],"assets/images/resized/0002/8552/28552v2-max-250x250.jpg"],[[113,162],"assets/images/resized/0002/8552/28552v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}