{"first_name":"Raghu","last_name":"Ramakrishnan","permalink":"raghu-ramakrishnan","crunchbase_url":"http://www.crunchbase.com/person/raghu-ramakrishnan","homepage_url":"http://pages.cs.wisc.edu/~raghu/","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Yahoo!","born_year":null,"born_month":null,"born_day":null,"tag_list":"yahoo-community-systems-scientist-audience-cloud-computing","alias_list":null,"created_at":"Wed Oct 29 18:21:12 UTC 2008","updated_at":"Wed Oct 29 18:22:38 UTC 2008","overview":"<p>Raghu Ramakrishnan got his B.Tech. from IIT Madras in 1983 and his Ph.D. from the University of Texas at Austin in 1987. He has been a member of the Database Systems Group in the Computer Sciences Department at the University of Wisconsin-Madison since 1987, and is a co-founder of the UW Data Mining Institute. In 1999, he founded QUIQ, a company that developed innovative collaborative customer support and knowledge management solutions used by companies such as Business Objects, Compaq, National Instruments, Network Appliances, Sun Microsystems, and others, and served as the Chairman and CTO until 2003, when QUIQ was acquired by Kanisa.</p>\n\n<p>His research is in the area of database systems, with a focus on data retrieval and integration, analysis, and mining, and is often done in collaboration with researchers in industry. He led the CORAL project, which developed and distributed the CORAL deductive system, and contributed to recursive query language extensions in the SQL:1999 standard. He and his group have developed scalable algorithms for clustering, decision-tree construction, and itemset counting, and were among the first to investigate mining of continuously evolving and streaming data. His work on query optimization has found its way into several commercial database systems, and his work on extending SQL to deal with queries over sequences has influenced the design of window functions in SQL:1999. None of this would have been possible without a great group of former students; of all his contributions, he is proudest of this list.</p>\n\n<p>Ramakrishnan received the ACM SIGKDD Innovation Award in 2008 (talk slides) and the ACM SIGMOD Contributions Award in 1999. He was elected Fellow of the Association for Computing Machinery (ACM) in 2001, Fellow of the IEEE in 2008, and has received several awards, including a David and Lucile Packard Foundation Fellowship in Science and Engineering, a Distinguished Alumnus Award from IIT-Madras, an NSF Presidential Young Investigator Award, and Faculty awards from IBM, Microsoft and Xerox. He was selected as a Vilas Associate at the University of Wisconsin in 1999. He has written the widely-used text Database Management Systems (WCB/McGraw-Hill), now in its third edition (with J. Gehrke). A list of his papers is available here.</p>\n\n<p>He is Chair of ACM SIGMOD (Management of Data), on the Board of Trustees of the VLDB Endowment and the Board of Directors of ACM SIGKDD (Knowledge Discovery and Data Mining), an associate editor of ACM Transactions on Database Systems, recently served as editor-in-chief of the Journal of Data Mining and Knowledge Discovery, and maintained the dbworld mailing list until 2006, since creating it in 1987.</p>\n\n<p>Ramakrishnan is currently on leave at Yahoo!, where he heads the Community Systems Group in Yahoo! Research, and serves as Chief Scientist for Audience and Cloud Computing. </p>","image":{"available_sizes":[[[98,150],"assets/images/resized/0002/7554/27554v1-max-150x150.jpg"],[[164,250],"assets/images/resized/0002/7554/27554v1-max-250x250.jpg"],[[190,288],"assets/images/resized/0002/7554/27554v1-max-450x450.jpg"]],"attribution":"<p>http://pages.cs.wisc.edu/~raghu/</p>"},"degrees":[{"degree_type":"B. Tech","subject":"Technology","institution":"IIT Madras","graduated_year":1983,"graduated_month":null,"graduated_day":null},{"degree_type":"PhD","subject":"Computer Science","institution":"University of Texas at Austin","graduated_year":1987,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chief Scientist, Audience & Head of Communisty Systems Research Group","firm":{"name":"Yahoo!","permalink":"yahoo","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0001/0836/10836v9-max-150x150.png"],[[226,81],"assets/images/resized/0001/0836/10836v9-max-250x250.png"],[[226,81],"assets/images/resized/0001/0836/10836v9-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://research.yahoo.com/bouncer_user/67","title":"Yahoo Research Bio"}],"web_presences":[]}