{"first_name":"Raghu","last_name":"Kilambi","permalink":"raghu-kilambi","crunchbase_url":"http://www.crunchbase.com/person/raghu-kilambi","homepage_url":"http://www.raghukilambi.com","birthplace":"Montreal","twitter_username":"RaghuKilambi","blog_url":"","blog_feed_url":"http://www.raghukilambi.com/feeds/posts/default","affiliation_name":"Unaffiliated","born_year":1968,"born_month":1,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Sep 13 19:21:58 UTC 2010","updated_at":"Thu Mar 15 00:19:45 UTC 2012","overview":"<p>A new economy executive with twenty years of broad business experience in building businesses and creating shareholder value.  Kilambi&#8217;s experience includes operational management, corporate finance, strategic acquisitions, business development, merchant banking and corporate restructuring.</p>\n\n<p>Raghu Kilambi is the CFO and Executive VP of MyScreen Mobile Inc.  As CFO he secured strategic partnership with Omnicom and international partners including a joint venture partner in Turkey.</p>\n\n<p>Prior to this role he was co-founder and CEO of Swiss Medica and led the launch of Swiss Medica, including building its management team and securing financing. Prior to launching Swiss Medica, he was General Partner of Rubicon Investment Group, a Toronto-based merchant bank focused on private equity buyouts and active public market investments. Between 2001 and 2003, Rubicon made several successful investments in the IT services, software and natural resources fields that generated significant return on investments for Rubicon and its investors.</p>\n\n<p>Prior to co-founding Rubicon, Mr. Kilambi was the Co Founder, CFO and Chief Strategy Officer of FutureLink Corp., a leading Application Service Provider that had $140 million in revenue and a peak Nasdaq market capitalization of $2 billion. FutureLink was a Forbes ASAP Top 25 Ramp Champ in 1999 and 2000. </p>\n\n<p>Kilambi earned a Bachelor of Commerce and a Graduate Diploma in Public Accounting from McGill University in Montreal and is a Chartered Accountant. </p>","image":null,"degrees":[{"degree_type":"Bachelors","subject":"Accounting","institution":"McGill University","graduated_year":1988,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.forbes.com/asap/2000/0403/084.html","title":"Ramp Champs "},{"external_url":"http://www.canadianbusiness.com/entrepreneur/sales_marketing/article.jsp?content=20061019_171756_5660","title":"Try it! You'll like it!"}],"web_presences":[{"external_url":"http://www.raghukilambi.com","title":"Articles About Raghu Kilambi "},{"external_url":"http://www.zoominfo.com/search#search/profile/person?personId=433230&targetid=profile","title":"ZoomInfo Profile"}]}