{"first_name":"Ragy","last_name":"Thomas","permalink":"ragy-thomas","crunchbase_url":"http://www.crunchbase.com/person/ragy-thomas","homepage_url":"http://sprinklr.com","birthplace":"","twitter_username":"ragythomas","blog_url":"http://somema.org","blog_feed_url":"http://www.somema.org/feed/","affiliation_name":"Unaffiliated","born_year":1973,"born_month":null,"born_day":null,"tag_list":"social-media-marketing, email-marketing","alias_list":null,"created_at":"Thu May 13 13:17:29 UTC 2010","updated_at":"Fri May 14 19:26:18 UTC 2010","overview":"<p>Ragy Thomas is the Founder and CEO of Sprinklr, a Social Media Marketing Services Provider for large companies. </p>\n\n<p>Sprinklr provides a SaaS technology platform and related services that helps companies connect with their social media audience. The platform (SIREn) allows marketers to manage conversations and campaigns across multiple social media platforms like Twitter and Facebook, while measuring reach, engagement and virality against ROI goals.</p>\n\n<p>Prior to founding Sprinklr, Ragy was the president of Epsilon’s Interactive Services Group (formerly Epsilon Interactive) where he grew the company’s revenue 40% to 100MM dollars. The company provided email marketing technology and interactive agency services (including creative, strategy, acquisition, web development and search marketing) to over 500 blue chip clients including Walmart, Target, JP Morgan Chase, Citibank, Unilever and P&amp;G . Its global client base was served by over 500 associates in 23 offices in 11 countries. Prior to being named as the president of Epsilon Interactive, Ragy was the CTO of Email Marketing Service Provider, Bigfoot Interactive, which was acquired by Alliance Data’s Epsilon division in September 2005 for over 120MM dollars.</p>\n\n<p>As the CTO and chief architect of Bigfoot Interactive, Ragy led the company’s platform to three consecutive years of leadership in analyst (Forrester &amp; Jupiter) reviews. In addition to building this world-class product, Ragy also established Epsilon Interactive’s ASP client service team and its self service infrastructure.</p>\n\n<p>Ragy is an established thought leader in the eMarketing space, writing for industry publications like DMnews and speaking at industry forums, like the Direct Marketing Association and National Center for Database Marketing.</p>\n\n<p>You can read his personal blog at ragythomas.com</p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0008/7026/87026v2-max-150x150.jpg"],[[80,80],"assets/images/resized/0008/7026/87026v2-max-250x250.jpg"],[[80,80],"assets/images/resized/0008/7026/87026v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder and CEO","firm":{"name":"Sprinklr","permalink":"sprinklr","type_of_entity":"company","image":{"available_sizes":[[[150,112],"assets/images/resized/0014/7140/147140v8-max-150x150.png"],[[250,187],"assets/images/resized/0014/7140/147140v8-max-250x250.png"],[[450,337],"assets/images/resized/0014/7140/147140v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}