{"first_name":"Rahul","last_name":"Agrawal","permalink":"rahul-agrawal-4","crunchbase_url":"http://www.crunchbase.com/person/rahul-agrawal-4","homepage_url":"http://www.naturalcosmeticsupplies.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"natural-cosmetics, cosmetic-ingredients, cosmetic-supplies, cosmetic-herbs, natural-cosmetics-ingredients, wholesale-cosmetic-ingredients, natural-cosmetic, cosmetics-ingredients, cosmetics-supplies","alias_list":null,"created_at":"Mon May 07 09:58:49 UTC 2012","updated_at":"Thu May 10 18:55:52 UTC 2012","overview":"<p>Natural Cosmetic Supplies </p>\n\n<p>Beauty may only be skin deep, but that doesn&#8217;t mean that you should not use the healthiest and most effective products available. Our passion for sustaining timeless herbal wisdom &amp; tradition envisioned the company &#8216;Natural Cosmetics&#8217; that integrated traditional herbal wisdom of our ancestors with the researched beauty of modern skin science. At Natural Cosmetics, we presents the combination of Time tested, age old formula of natural goodness of herbs founded on the principle of natural &#8216;care &amp; cure&#8217; for your body, skin and hair care needs of today. </p>\n\n<p>We are wholesale suppliers and exporters of Natural Cosmetic Herbs from India. The gamut of our product is enriched with the unique formulations of herbs combining the aspirations of the great previous civilization with ultra modern technology. Carefully selected over years of search each ingredient in any of our product designed promises to give your hair, body &amp; skin the natural touch along with a healthy body &amp; balanced mind. Natural Cosmetics preparations are environment friendly and Biodegradable. We are a community of like-minded folks that share an interest in living in harmony with the environment.</p>\n\n<p>We aim for total customer satisfaction and meet the needs of the discriminating tastes of our valued clients through supreme quality products. We are committed to deliver quality-assured and scientifically researched natural health solutions. Every product marketed undergoes stringent Quality Control Measures. The emphasis is given on right selection of the herbs for making these nature cosmetics, its scientific processing and efficacy evaluation. Our research unit is exemplary, equipped with sophisticated facilities. We pride ourselves on being a completely research driven enterprise, our constant endeavour is to create innovative products that caters to the health care requirements of contemporary living. </p>\n\n<p>Tel : (91)-(931)-3324338 </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}