{"first_name":"Rainbow","last_name":"Realty","permalink":"rainbow-realty","crunchbase_url":"http://www.crunchbase.com/person/rainbow-realty","homepage_url":"http://www.rainbow.ky/","birthplace":"","twitter_username":"","blog_url":"http://rainbow-realty-property.blogspot.in/","blog_feed_url":"http://rainbow-realty-property.blogspot.com/feeds/posts/default?alt=rss","affiliation_name":"Rainbow Realty","born_year":null,"born_month":null,"born_day":null,"tag_list":"cayman-real-estate, cayman-property, cayman-islands-real-estate, cayman-islands-property, cayman-real-estate-company","alias_list":null,"created_at":"Thu Aug 23 10:39:38 UTC 2012","updated_at":"Thu Aug 23 18:51:23 UTC 2012","overview":"<p>For more than 25 years, Rainbow Realty has been providing friends, neighbours and visitors with unsurpassed real estate options in the Cayman Islands. We specialise in Commercial and Residential Real Estate sales as well as Property Development across the Cayman Islands.\nFounded in 1987, we were one of the first Real Estate providers in Cayman. Like the islands, our business has seen many changes throughout the years but our sales family continues to provide our clients with the same distinguishing friendly, professional, personal attention that our clients expect.</p>\n\n<p>First Class Knowledge and Experience&#8230;</p>\n\n<p>Rainbow Realty offers a diverse selection of property listings in the Cayman Islands real estate market especially in Luxury Homes. We are not only real estate specialists but developers of the following real estate projects: Smith Road Centre, Airport Commercial Park, Harbour Centre, Savannah Grand, Grand Palms, Savannah Estates, Palm Springs amoung others.</p>\n\n<p>Rainbow Realty was one of the founding members of the Cayman Islands Real Estate Brokers Association (CIREBA) and several of our agents have been CIREBA board members over the years.</p>\n\n<p>We are your neighbours&#8230;</p>\n\n<p>We know Cayman Islands properties, because Cayman is where we call home. At Rainbow Realty, we all live, work, play and raise our families here so we take pride in helping others call Cayman home too. Contact any of our staff members today for more information about our extensive MLS listings of Cayman properties.</p>","image":{"available_sizes":[[[150,68],"assets/images/resized/0020/7663/207663v2-max-150x150.png"],[[214,98],"assets/images/resized/0020/7663/207663v2-max-250x250.png"],[[214,98],"assets/images/resized/0020/7663/207663v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Cayman Real Estate Agency","firm":{"name":"Rainbow Realty","permalink":"rainbow-realty","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}