{"first_name":"Raj","last_name":"Seethapathy","permalink":"raj-seethapathy","crunchbase_url":"http://www.crunchbase.com/person/raj-seethapathy","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Seepath Solutions","born_year":null,"born_month":null,"born_day":null,"tag_list":"software-as-a-service, saas, cloud-computing, program-management, project-management, onsiteoff-shore-it-client-engagement, management-and-technology-consulting, force-com-solutions-implementation, crm-consulting","alias_list":null,"created_at":"Fri Feb 19 14:40:35 UTC 2010","updated_at":"Tue Feb 23 19:32:42 UTC 2010","overview":"<p>Industry veteran, with over 14 years of Wall Street experience in Management &amp; Technology consulting, Raj advises his clients (From SMBs to large enterprise) on how to maximize their existing IT investments, enable compliance and increase user adoption. Partnering with the Salesforce.com and Microsoft Online Services, Seepath, which Raj co-founded in the year 2000, offers compelling business benefits to its clients using Software as a Service (SaaS) Model.  </p>\n\n<p>Business savvy with deep technical insight, Raj has an impressive track record of leading technology driven business transformation initiatives across Fortune 500 companies and has led global enterprise projects spanning NA and EMEA at Moody’s Investor Services, McGraw Hill, Citigroup, Merrill Lynch, Thompson, Ernst &amp; young, Qualcomm, SWIFT, GE Capital, State, agencies as well as SMB market. </p>\n\n<p>SaaS and Social Media are transforming the way business is run today.  Raj is passionate about bringing his Wall Street experience, research (Industry &amp; Technology) and insight to help every business succeed. Raj enjoys travelling to his customer locations across North America and Western Europe.  He is also passionate about playing his acoustic as well as making independent films during is off time. </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0007/7702/77702v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0007/7702/77702v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0007/7702/77702v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Pricipal","firm":{"name":"Seepath Solutions","permalink":"seepath-solutions","type_of_entity":"company","image":{"available_sizes":[[[150,65],"assets/images/resized/0007/7701/77701v2-max-150x150.png"],[[250,108],"assets/images/resized/0007/7701/77701v2-max-250x250.png"],[[450,195],"assets/images/resized/0007/7701/77701v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}