{"first_name":"Raj","last_name":"Atluru","permalink":"raj-atluru","crunchbase_url":"http://www.crunchbase.com/person/raj-atluru","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Draper Fisher Jurvetson","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Feb 07 01:56:19 UTC 2008","updated_at":"Sat Jun 06 10:10:38 UTC 2009","overview":"<p>Raj Atluru is a Managing Director at Draper Fisher Jurvetson where he has been spearheading the firm&#8217;s cleantech investment practice since 2001 and its India investment operations since 2005.  He has been active across technology sectors, with an emphasis on renewable energy, energy storage, smart grid and energy efficiency applications, wireless technologies and business software and services, among others.  Raj&#8217;s current boards include Planet Metrics, Nanotune, Ping Identity, Great Point Energy, Konarka Technologies, Solicore Technologies, and Varolii, and he has been the lead partner on a variety of other companies across the cleantech sector, including EnerNOC (ENOC), Bright Source Energy, CoalTek, Deeya Energy, Reva Electric Vehicle, and Tioga Energy.  He has over 16 years of venture capital, private equity, and leveraged finance experience both domestically and in emerging markets with a specific focus on India. In 2005, Raj lead the firm&#8217;s partnership with partner fund Element Partners, to launch DFJ Element, one of the largest dedicated cleantech funds.  Raj is frequently cited in leading industry and national publications talking about the trends in cleantech venture capital, and speaks globally about the opportunities for innovation within this sector.  Raj previously worked in the leveraged finance and Asian corporate finance groups at Credit Suisse in New York, Hong Kong and Singapore and also spent three years with TL Ventures where he focused on early stage software, wireless communications and energy technologies. </p>\n\n<p>Raj sits on the advisory board of the Cleantech Investors Forum, and co-founded The Spotlight Fund, a non-profit dedicated to funding start-up educational entrepreneurs.  Raj received B.S. and M.S. degrees in Civil/Environmental Engineering from Stanford University where he taught the solar and wind energy lab and was a full time research assistant on the Waste Isolation Pilot Project for Sandia National Labs (Department of Defense Nuclear Repository Study). In addition, he received an MBA from the Stanford Graduate School of Business. </p>","image":{"available_sizes":[[[110,148],"assets/images/resized/0004/7104/47104v1-max-150x150.jpg"],[[110,148],"assets/images/resized/0004/7104/47104v1-max-250x250.jpg"],[[110,148],"assets/images/resized/0004/7104/47104v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.S. and M.S. ","subject":"Civil/Environmental Engineering","institution":"Stanford University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Venture Partner","firm":{"name":"Draper Fisher Jurvetson (DFJ)","permalink":"draper-fisher-jurvetson","type_of_entity":"financial_org","image":{"available_sizes":[[[150,106],"assets/images/resized/0001/0989/10989v1-max-150x150.png"],[[222,157],"assets/images/resized/0001/0989/10989v1-max-250x250.png"],[[222,157],"assets/images/resized/0001/0989/10989v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Board","firm":{"name":"Konarka Technologies","permalink":"konarka","type_of_entity":"company","image":{"available_sizes":[[[135,94],"assets/images/resized/0003/8081/38081v1-max-150x150.png"],[[135,94],"assets/images/resized/0003/8081/38081v1-max-250x250.png"],[[135,94],"assets/images/resized/0003/8081/38081v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}