{"first_name":"Rajat","last_name":"Bhatia","permalink":"rajat-bhatia","crunchbase_url":"http://www.crunchbase.com/person/rajat-bhatia","homepage_url":"http://www.accrotechscientific.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"material-testing-equipment, construction-material-testing-equipment, highway-material-testing-equipment","alias_list":null,"created_at":"Tue May 29 04:35:17 UTC 2012","updated_at":"Sat Jun 02 02:32:09 UTC 2012","overview":"<p>Accro-Tech Scientific Industries</p>\n\n<p>With operations spread across international boundaries, Accro-Tech Scientific Industries is a noted manufacturer, supplier and exporter of cost effective material testing and measuring equipment. All our measuring and test equipment meet the soil testing, compressive strength testing, cement &amp; concrete testing, aggregate testing, bitumen testing, and general laboratory testing requirements. Our product stand high on quality and reliability and are rugged enough for outdoor purpose. Significant investment in research and product enhancement has kept us in pace with changing global markets. Our company is credited for its consistency in quality, customer service and timely delivery schedules. With focus on offering best returns to customers, we have been optimizing on our cumulative experiences. Our efforts have enabled us to successfully suffice the diversified and increasing demands of domestic and overseas customers.</p>\n\n<p>We manufacture, supply and export highly reliable and versatile material testing instruments and measuring equipment. All our measuring and test equipment are manufactured as per industry defined standards and can also be customized to meet the needs of customers. </p>\n\n<p>We are a quality conscious company, operating with highest priority on quality of products &amp; services. Therefore, we source some of the parts / components only from renowned manufacturers and several of them are made in-house. All our products are in compliance with industry defined quality &amp; measurement standards. We stringently adhere to Total Quality Management practices right from raw material procurement to production, packaging and delivery at client&#8217;s end. Our conscious approach has made us a preferred exporter &amp; supplier of material testing &amp; measuring instruments.</p>\n\n<p>Phone\n     +(91)-(11)-41421470</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}