{"first_name":"Rajesh","last_name":"Jha","permalink":"rajesh-jha","crunchbase_url":"http://www.crunchbase.com/person/rajesh-jha","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jan 13 09:14:26 UTC 2009","updated_at":"Tue Jan 13 09:16:06 UTC 2009","overview":"<p>Rajesh Jha is the corporate vice president for Microsoft Office Live and Microsoft Exchange. In this capacity, Jha leads the teams responsible for worldwide development of Microsoft Office Live services, easy-to-use Web-based productivity services for information workers and small businesses, and Microsoft Exchange, one of the world&#8217;s most popular communications systems. The technologies Jha and his team deliver are used daily by tens of millions of people via their PCs, the Web, and mobile phones. By pioneering new online productivity and communications services, Jha and his team are at the forefront of making Microsoft Corp.&#8217;s software-plus-services strategy a reality.</p>\n\n<p>Jha has a long track record of positive contribution to Microsoft. Joining the company right out of university in 1990, he began his career as a software design engineer, developing five product releases with the Microsoft Works team. He moved on to create multimedia technologies in the Consumer Division and as a director of development worked for several years developing Internet technologies. Continuing his path of success in the company, Jha then became the general manager of Microsoft Office InfoPath and oversaw the launch of InfoPath 2003, as well as the planning for and early execution of Office InfoPath 2007 and form technologies in the 2007 Microsoft Office system.</p>\n\n<p>Jha holds a master&#8217;s degree in computer science from the University of Massachusetts Amherst and a bachelor&#8217;s degree in computer science from Indian Institute of Technology, Madras (Chennai).</p>","image":{"available_sizes":[[[150,115],"assets/images/resized/0003/3692/33692v1-max-150x150.png"],[[215,165],"assets/images/resized/0003/3692/33692v1-max-250x250.png"],[[215,165],"assets/images/resized/0003/3692/33692v1-max-450x450.png"]],"attribution":"<p><a href=\"http://www.microsoft.com/presspass/exec/jha/\" title=\"Microsoft\" rel=\"nofollow\">Microsoft</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Development VP, Microsoft Exchange","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}