{"first_name":"Rajiv","last_name":"kakar","permalink":"rajiv-kakar","crunchbase_url":"http://www.crunchbase.com/person/rajiv-kakar","homepage_url":"http://www.centaurweb.com","birthplace":"New Delhi","twitter_username":"rajivkakar","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1971,"born_month":11,"born_day":24,"tag_list":"rajiv-kakar, rajeev-kakar, rajiv-kakkar, centaurweb, rajeev-kakkar, centaurweb-noida","alias_list":null,"created_at":"Mon Mar 21 05:40:01 UTC 2011","updated_at":"Tue Apr 12 01:28:23 UTC 2011","overview":"<p>Rajiv Kakar&#8217;s Experience\nCEO\nCentaurweb</p>\n\n<p>Information Technology and Services industry</p>\n\n<p>April 1997 – Present (14 years)</p>\n\n<p>Over the last few years, I have built up Centaurweb from an Indian IT service provider to a global player. As CEO I have a broad set of daily tasks but clients are always a first priority for whom I am mostly accessible 24/7 with my Client Service Director as backup.</p>\n\n<p>We are based in India&#8217;s National Capital Region of Delhi, that is about 1 hour&#8217;s drive from the international airport. Our expert team has a diverse set of skills from Website design and Web development, Online Reputation Management and Brand Management, Internet marketing and SEO.</p>\n\n<p>Having worked closely with international clients over the last 3 years I have a very clear understanding of their needs, for e.g., confidentiality, copyrights, communication, availability and response, regular reporting, quality control and expectations management. We are probably the only Indian company to have the same charges for clients in USA, UK and Australia that we offer in India. Combine that with our service quality and I believe there is no better Indian Internet services company serving the international SME market. I would be delighted to discuss any thoughts you may have regarding a potential partnership.</p>","image":null,"degrees":[{"degree_type":"IT","subject":"NetDBA, IBM Ecommerce, Software and Systems Diploma, Database Administration, Ecommerce, Software Development, Commerce and Economics ","institution":"Sardar Patel ","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.centaurweb.com","title":"Centaurweb - Internet Marketing"}],"web_presences":[]}