{"first_name":"Rajiv","last_name":"Mehrotra","permalink":"rajiv-mehrotra","crunchbase_url":"http://www.crunchbase.com/person/rajiv-mehrotra","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jan 10 13:28:54 UTC 2011","updated_at":"Mon Jul 18 03:34:36 UTC 2011","overview":"<p>Rajiv Mehrotra, a veteran of the telecom industry, is the Founder and Chairman of the Shyam Group of companies. The group has interests in a wide range of successful telecom ventures, guided by his entrepreneurial vision. In 1974, as a young electronics engineer, Rajiv pioneered the manufacture of low cost satellite TV equipment that brought cable TV to millions of village homes in India. Inspired by this revolution, he took telecom to the masses by installing wireless telephones in over 100,000 Indian villages.</p>\n\n<p>He went on to launch Shyam Telecom, the flagship of the Shyam Group and now a leading name worldwide for mobile coverage solutions. Hexacom (now Bharti Hexacom) was launched by Rajiv in the 1990’s to provide GSM services in Rajasthan, the largest state in India.</p>\n\n<p>Mr. Mehrotra is also the founder of Shyam Telelink Limited (now Sistema Shyam Teleservices Ltd.), one of the first operators in the world to deploy CDMA technology for fixed wireless services. His efforts established Essel Shyam as the leading name in VSAT services in India.</p>\n\n<p>Rajiv founded VNL (Vihaan Networks Ltd.) in 2004. VNL is based on his vision to take telecom to the next frontier - connecting the billions of unconnected across the world. He sees VNL as a catalyst in the transformation of rural communities through telecom. His vision and wealth of experience, combined with his far-reaching contacts in the telecom industry, makes him the ideal leader for the company.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder, Chairman and Chief Executive Officer","firm":{"name":"VNL ","permalink":"vnl","type_of_entity":"company","image":{"available_sizes":[[[122,81],"assets/images/resized/0011/6676/116676v1-max-150x150.jpg"],[[122,81],"assets/images/resized/0011/6676/116676v1-max-250x250.jpg"],[[122,81],"assets/images/resized/0011/6676/116676v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}