{"first_name":"Rajiv","last_name":"Yadav Ranjan","permalink":"rajiv-yadav-ranjan","crunchbase_url":"http://www.crunchbase.com/person/rajiv-yadav-ranjan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Avalanche Technology","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jun 17 16:21:20 UTC 2011","updated_at":"Tue Feb 28 05:45:56 UTC 2012","overview":"<p>Rajiv was recognized by the United States Congress in May 2005 for Leadership in Science, Technology and Commerce during a session of the full house.  This special and rare acknowledgement was given for his extraordinary contribution and pioneering research work in the field of magnetic recording.  Dr. Manmohan Singh, Prime Minister of India mentioned Rajiv’s achievements during an address in front of both houses of Congress in August of 2005. This august recognition was mentioned in Forbes, News Week, Money – CNN, Money Central – MSN, KWWL Cedar Rapids (TV Station), Hindustan Times and India Abroad.</p>\n\n<p>Rajiv was an executive with Seagate Technology from 1997-2006 where he led many core projects and helped Seagate’s earning grow from $4 Billion to $8 Billion. He also served as the Chair of International Electrical and Electronics Engineers Conferences.  While at Seagate, Rajiv was a part of the Executive Patent Review team which was responsible for all Intellectual Property filed by Seagate.  Rajiv led a key Perpendicular technology effort from re-inception to product; this will help Seagate grow to $10 Billion. Rajiv invented Laser Texturing technology which generated over $500 Million in revenue through cross licensing with IBM. Seagate CEO Bill Watkins acknowledged Rajiv&#8217;s patents in data storage and his contribution to data storage technology. &#8220;Innovation like Rajiv&#8217;s is uniquely suited to a culture like Seagate&#8217;s, where people are encouraged to take risks, look at things in new and unconventional ways&#8230; Rajiv’s patents have played an instrumental role in a variety of data-recording technology breakthroughs”. </p>\n\n<p>Rajiv led Komag Inc. research and development team which helped the company grow from $30 Million to $600 Million during his 7 year tenure.  Rajiv pioneered the Granular media and Oriented Media technology which are widely used today in all storage devices.  Prior to Komag, Rajiv was with Control Data Corporation where his first paper on Low-Noise media changed the direction of the data storage industry. Rajiv received “Best Performer” award at Control Data.</p>\n\n<p>In academia, Rajiv’s research and expertise in Magnetic Recording has resulted in graduate level lectures at UC Berkley, Stanford University and Carnegie Mellon University. His work was also published in several international journals such as IEEE and Journal of Applied Physics. </p>\n\n<p>Rajiv has been issued over 125 United States patents/patent applications and over 20 World, European Union and Japanese patents during his 24 year career. </p>\n\n<p>Rajiv received a full scholarship from the United States Department of Energy to Ames Lab – Iowa State University, where he received a PhD in Material Science and Engineering, specializing in Electrical Engineering. He also received the prestigious SIMS-86 award from the Instrument Society of America for his design of a transducer for ultra sound detection. Rajiv graduated from the India Institute of Technology, Kharagpur as a Silver medalist in the field of Metallurgical Engineering receiving his Bachelors of Technology in 1981. At IIT, Rajiv was also the recipient of the prestigious Indernil award from the Metallurgical Society of India. He lives with his family in San Jose, California.</p>","image":null,"degrees":[{"degree_type":"B Tech","subject":"Metallurgical Engineering","institution":"IIT Khargpur","graduated_year":1981,"graduated_month":null,"graduated_day":null},{"degree_type":"PhD","subject":"Material Science","institution":"Iowa State","graduated_year":1987,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder / CTO","firm":{"name":"Avalanche Technology","permalink":"avalanche-technology","type_of_entity":"company","image":{"available_sizes":[[[150,36],"assets/images/resized/0007/6165/76165v1-max-150x150.png"],[[250,60],"assets/images/resized/0007/6165/76165v1-max-250x250.png"],[[320,78],"assets/images/resized/0007/6165/76165v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}