{"first_name":"Rajiv","last_name":"Chatterjee","permalink":"rajiv-chatterjee","crunchbase_url":"http://www.crunchbase.com/person/rajiv-chatterjee","homepage_url":"http://www.readyportal.com","birthplace":"Kolkata","twitter_username":"readyportal","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1972,"born_month":5,"born_day":23,"tag_list":"","alias_list":null,"created_at":"Mon Sep 26 16:44:40 UTC 2011","updated_at":"Thu Nov 17 22:20:13 UTC 2011","overview":"<p>Rajiv is the Founder, President, and C.E.O. of Debut Logic Inc, the holding company for ReadyPortal, a Web Content Management platform for web development and social media marketing strategies.</p>\n\n<p>Rajiv founded Debut Logic in 2006 as a software services company.  Debut Logic acquired the ReadyPortal product in 2009.  Under his leadership, Debut Logic has grown ReadyPortal from a niche product into a leading web solutions platform serving the needs of a broad range of companies including those in the Fortune 500 as well as Non-Profits and Trade Associations. </p>\n\n<p>Prior to ReadyPortal Rajiv was at CyberAd Global Consulting, a leading minority non-profit consulting firm based in Houston, Texas. At CyberAd, Rajiv resolved strategy and operational issues with a variety of results-oriented minority-owned companies and non-profit trade organizations, and he helped develop a business plan to provide affordable Web technology to such agencies. Prior to CyberAd Rajiv was the Divisional Manager for Indonesia-based PT. Ames Indah International a leading commodities trading Company in Southeast Asia. Rajiv was responsible for strategic planning and new product introductions in Southeast Asia. At Ames Indah, Rajiv strengthened the market leadership position of its flagship steel-trading division, which exported more than 500,000 tons of steel in a calendar year. Rajiv also led the introduction of aluminum products to the Southeast Asian market with Alcoa – a leading producer of aluminum worldwide – finally establishing Alcoa as the market leader. </p>\n\n<p>Rajiv holds a B.A. in economics from the National Defence Academy of India and a B.S. in liberal arts (cum laude) from the University of Houston. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}