{"first_name":"Rakesh","last_name":"Hegde","permalink":"rakesh-hegde","crunchbase_url":"http://www.crunchbase.com/person/rakesh-hegde","homepage_url":"http://www.rezopia.com","birthplace":"Mumbai, India","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1971,"born_month":10,"born_day":8,"tag_list":"","alias_list":null,"created_at":"Sat Jun 04 19:40:43 UTC 2011","updated_at":"Mon Jun 13 23:19:44 UTC 2011","overview":"<p>Founder &amp; CEO, Rezopia (www.rezopia.com)\nRezopia is a fast growing cloud technology provider for travel companies. It is the first cloud-based end-to-end travel reservation, contracts, operations and distribution management system for packaged travel providers.</p>\n\n<p>Founder, Chairman of Board of XYKA Inc.\nXYKA is a technology solution provider &amp; business process consulting firm for the travel industry. XYKA has a suite of travel products and services for the travel suppliers, tour operators, travel agents.</p>\n\n<p>Pricesbolo.com - Acquired Pricesbolo.com, which is a price comparison portal for the Indian consumer, currently serve in the board. Pricesbolo is growing rapidly adding merchants &amp; consumers for the ever growing consumer e-commerce market.</p>\n\n<p>RunMantra - the chief running officer for RunMantra (www.runmantra.com) - Running is a passion in life and now want to help other runners with networking and training. Now RRCA certified running coach.</p>\n\n<p>Past:\nPrior to XYKA, had extensive industry experience in architecting, developing and managing large software applications in the travel, healthcare and financial industries.\nPast experiences include Saba, iXL, Health Systems Design(Acquired by Perot Systems), Sonata Software and Kartnatak State Financial Corporation.\nHave a BS in Computer Science, from the University of Karnatak, India\nSpecialties</p>\n\n<p>Serial Entrepreneur, Enterprise and SaaS products for the Travel Industry, application architecture, Running</p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0013/7717/137717v2-max-150x150.jpg"],[[187,250],"assets/images/resized/0013/7717/137717v2-max-250x250.jpg"],[[337,450],"assets/images/resized/0013/7717/137717v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}