{"first_name":"Ralph","last_name":"Marx","permalink":"ralph-marx","crunchbase_url":"http://www.crunchbase.com/person/ralph-marx","homepage_url":"http://www.skinthebottle.com/","birthplace":"N.Y.C.","twitter_username":"advsystem","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1955,"born_month":4,"born_day":24,"tag_list":"","alias_list":null,"created_at":"Mon Nov 02 18:06:15 UTC 2009","updated_at":"Mon Nov 02 19:27:19 UTC 2009","overview":"<p>In his 25-year career in Silicon Valley, Ralph has been tenacious about following early trends and nurturing those ideas into successful companies.  He has built and sold three companies the best known of which is Acteva.com.  Currently he splits his time as an active angel investor and consulting with startups in order to help them get to success faster and easier.</p>\n\n<p>His first entrepreneurial effort involved taking an unused computer at a large San Francisco law Firm and programming a system to automate the tracking of millions of pages of documents.  That led to creating Advocate Systems, Inc which became a market pioneer in this field and where Ralph gained broad expertise in sales, marketing and product development.  A joint venture between Advocate Systems and a European consortium provided international distribution and the company was subsequently acquired.</p>\n\n<p>As an early adopter of the Web Browser, Ralph went on to radically alter the box office service industry by breaking down the barriers of proprietary systems. Acteva garnered thousands of corporate customers and is still a thriving entity 10 years later.  During Ralph’s tenure Acteva received widespread media coverage, including selection as a Fortune Top 10 upcoming company and coverage as a Harvard Business School case study.</p>\n\n<p>Acteva was acquired in 2000 which gave Ralph an opportunity to help other entrepreneurs as an investor, advisor, and consultant.  He has been involved in fund-raising, strategic and financial planning, product development and deployment, marketing and sales and operational management for a very broad range of companies and ideas. </p>\n\n<p>He is currently involved with a new venture called &#8220;SkinTheBottle,&#8221; that personalizes reusable steel water bottles, thus making it fun to be Green.  Most of the distribution and marketing for this product is through social media another trend that Ralph has participated in since the first days.</p>\n\n<p>His interests and hobbies vary widely, including entrepreneurship, music, poker, the environment, skiing and cycling. </p>","image":{"available_sizes":[[[110,150],"assets/images/resized/0006/4557/64557v2-max-150x150.jpg"],[[156,211],"assets/images/resized/0006/4557/64557v2-max-250x250.jpg"],[[156,211],"assets/images/resized/0006/4557/64557v2-max-450x450.jpg"]],"attribution":"<p>John Gunther</p>"},"degrees":[{"degree_type":"BS, Engineering","subject":"Engineering","institution":"University of Massachusetts","graduated_year":1976,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/ralphmarx","title":""}]}