{"first_name":"Ralph","last_name":"Vaz","permalink":"ralph-vaz","crunchbase_url":"http://www.crunchbase.com/person/ralph-vaz","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Wolf Frameworks","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Oct 03 12:47:40 UTC 2008","updated_at":"Wed Jan 21 20:31:59 UTC 2009","overview":"<p>Ralph is the inventor of Wolf Business Solutions Platform, responsible for boot strapping from concept to market, conceptualizing the technical architecture &amp; developing the framework. He has more than 14 years of experience in developing enterprise web solutions &amp; business applications. Prior to Wolf, he was VP Technology for EPiServer APAC, working on product development &amp; building customer solutions with system integrators around the region. He has worked as Director of India for Ebbon Dacs, the Oxford (UK) based Business Process Solution leader for the automotive industry and worked on developing applications which are currently being used by more than 100,000 users worldwide. He gathered tremendous exposure as a Solution Architect in XP Software (later acquired by Sys-Fore) &amp; as the SDM at Skelta Software (formerly NetGalactic) - where he completed Axapta certification (now Microsoft Dynamics AX), worked on Axapta request management server that exposed the X++ components and objects through a web services (first of its kind) and on building products such as Skelta Workflow.NET, DB Query Engine, etc. He has a Bachelor in Commerce &amp; is a diehard biker, gadget lover and dreams of a world where software development is without chaos&#8230; </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder & CTO","firm":{"name":"Wolf Frameworks","permalink":"wolf-frameworks","type_of_entity":"company","image":{"available_sizes":[[[136,16],"assets/images/resized/0002/7068/27068v2-max-150x150.png"],[[136,16],"assets/images/resized/0002/7068/27068v2-max-250x250.png"],[[136,16],"assets/images/resized/0002/7068/27068v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}