{"first_name":"Ralph","last_name":"J. Roberts","permalink":"ralph-j-roberts","crunchbase_url":"http://www.crunchbase.com/person/ralph-j-roberts","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Comcast","born_year":null,"born_month":null,"born_day":null,"tag_list":"ceo, comcast","alias_list":null,"created_at":"Wed May 14 22:51:05 UTC 2008","updated_at":"Fri Jun 03 18:12:39 UTC 2011","overview":"<p>Ralph J. Roberts founded Comcast Corporation, the nation&#8217;s leading broadband provider, with the purchase of a 1,200-subscriber cable television system in Tupelo, Mississippi in 1963. From Comcast&#8217;s humble roots, Mr. Roberts went on to create a company that today serves 24.7 million customers and employs over 100,000 people. Today he is Chairman of the Company&#8217;s Executive and Finance Committee, and his son Brian serves as Chairman and CEO.</p>\n\n<p>Prior to starting Comcast, Mr. Roberts was President and CEO of Pioneer Industries, a leading men&#8217;s clothing accessories company, Vice President of Muzak Corporation, and an account executive with Aitken Kynett Advertising Agency.</p>\n\n<p>Mr. Roberts graduated from the Wharton School of the University of Pennsylvania and served a four-year tour of duty in the U.S. Navy. He also participated in continuing education programs at Harvard Business School.</p>\n\n<p>Mr. Roberts, 88, is involved in numerous community and civic activities. He currently serves on the boards of the Council of Emeritus Directors of the Philadelphia Orchestra and the Brandywine Museum and Conservancy, as well as the Advisory Board of the Greater Philadelphia Urban Affairs Coalition, and the Penn Medicine Board of Trustees, University of Pennsylvania Health System.</p>\n\n<p>His business, entrepreneurial and humanitarian endeavors have brought him many awards including the Distinguished Vanguard Award for Leadership from the National Cable and Telecommunications Association; induction in the Broadcasting &amp; Cable Hall of Fame; the Cable Television Hall of Fame Award; and the Walter Kaitz Foundation Award for contributing to the cable industry&#8217;s diversity efforts. He received the University of Pennsylvania&#8217;s Joseph P. Wharton Award, and the conferral of a Doctor of Humane Letters by Holy Family College.</p>\n\n<p>He was honored by the Anti-Defamation League of B&#8217;Nai B&#8217;Rith with its Americanism Award and by the National Conference of Christians and Jews with its Brotherhood Award. He has also received Philadelphia&#8217;s Edward Powell Award given to the individual whose efforts most benefit the prosperity of the city of Philadelphia; the Police Athletic League Award; the Urban League of Philadelphia&#8217;s Whitney M. Young Jr. Award for Leadership, Diversity and Excellence; the William Penn Award given by the Greater Philadelphia Chamber of Commerce; the Trustees Award from the National Academy of Television Arts &amp; Sciences; and (jointly with his son Brian) the Steven J. Ross Humanitarian Award given by the UJA Federation.</p>","image":{"available_sizes":[[[108,150],"assets/images/resized/0001/8612/18612v1-max-150x150.jpg"],[[113,156],"assets/images/resized/0001/8612/18612v1-max-250x250.jpg"],[[113,156],"assets/images/resized/0001/8612/18612v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.comcast.com/corporate/about/pressroom/corporateoverview/corporateexecutives/corporateexecutives.html\" title=\"Comcast\" rel=\"nofollow\">Comcast</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Chairman, Executive and Finance Committe","firm":{"name":"Comcast","permalink":"comcast","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/8607/18607v1-max-150x150.png"],[[155,50],"assets/images/resized/0001/8607/18607v1-max-250x250.png"],[[155,50],"assets/images/resized/0001/8607/18607v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}