{"first_name":"Ram","last_name":"Charan","permalink":"ram-charan","crunchbase_url":"http://www.crunchbase.com/person/ram-charan","homepage_url":"http://www.ram-charan.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Nov 15 02:50:07 UTC 2009","updated_at":"Wed Nov 25 19:42:49 UTC 2009","overview":"<p>Ram Charan (born Ramcharan in 1939 in Uttar Pradesh, India) is a business consultant, speaker, and writer.</p>\n\n<p>Charan worked in his family&#8217;s shoe shop in northern India while growing up. He earned a degree in engineering from Banaras Hindu University and later studied at Harvard Business School, where he was awarded an MBA (1965) and a doctorate (1967).Before becoming a full-time consultant in 1978, he taught at the Harvard Business School, the Kellogg School of Management, and Boston University.</p>\n\n<p>Charan has consulted for many well-known companies such as GE, KLM, and Bank of America. He is the author of various popular books on business, including Leadership in the Era of Economic Uncertainty: The New Rules for Getting the Right Things Done in Difficult Times, Boards That Deliver, What The CEO Wants You To Know, Boards At Work, Every Business Is A Growth Business (with Noel Tichy), Profitable Growth Is Everyone&#8217;s Business, Confronting Reality,Know How and Execution (with Larry Bossidy and Charles Burck), which was a best-seller.</p>\n\n<p>Ram is a workaholic. He is not married and has no children. At age 67, he recently purchased his first apartment in Dallas, TX. Before this purchase, he did not have a home and spent every night in a hotel room or at an associate&#8217;s residence. Regardless of his location, his assistants in Dallas send him new clothes via courier and he returns his dirty laundry to them.</p>\n\n<p>Charan was elected a Fellow of the National Academy of Human Resources in 2000 and named a Distinguished Fellow in 2005. He is also a director of Austin Industries.</p>","image":{"available_sizes":[[[148,150],"assets/images/resized/0006/7553/67553v2-max-150x150.jpg"],[[247,250],"assets/images/resized/0006/7553/67553v2-max-250x250.jpg"],[[386,390],"assets/images/resized/0006/7553/67553v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}