{"first_name":"Rama","last_name":"Sekhar","permalink":"rama-sekhar","crunchbase_url":"http://www.crunchbase.com/person/rama-sekhar","homepage_url":"http://www.nvp.com/Team/Associates/Rama%20Sekhar.aspx","birthplace":"","twitter_username":"tweetrama","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"nvp, rama, norwest, venture-capital, vc","alias_list":null,"created_at":"Wed Jun 02 20:55:47 UTC 2010","updated_at":"Wed Jun 02 21:55:44 UTC 2010","overview":"<p>Rama focuses on early to late stage venture investments across a wide range of sectors at NVP. Before joining NVP in 2009, Rama was an Associate at Comcast Interactive Capital where he conducted due diligence on early and growth stage investment opportunities in the Digital Media, Internet, and Communications Infrastructure sectors.</p>\n\n<p>Prior to Comcast Interactive Capital, Rama was a Product Manager at Cisco Systems, where he defined product strategy and roadmaps for $1B revenue products including the GSR 12000 Series and CRS-1 routers. Rama&#8217;s clients included international telecom and cable service providers including Verizon Business, British Telecom, and several providers in the Indian telecommunications market. Previously, Rama was a Sales Engineer at Cisco Systems supporting AT&amp;T, where he sold the core and edge networking equipment that comprises AT&amp;T&#8217;s national IP backbone.</p>\n\n<p>Rama holds an MBA from the Wharton School of the University of Pennsylvania with a double major in Finance and Entrepreneurial Management and a Bachelor of Science degree in Electrical and Computer Engineering, with high honors, from Rutgers University.</p>","image":{"available_sizes":[[[119,150],"assets/images/resized/0008/9332/89332v2-max-150x150.jpg"],[[121,152],"assets/images/resized/0008/9332/89332v2-max-250x250.jpg"],[[121,152],"assets/images/resized/0008/9332/89332v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}