{"first_name":"Rameez","last_name":"Bardai","permalink":"rameez-bardai","crunchbase_url":"http://www.crunchbase.com/person/rameez-bardai","homepage_url":"http://semandseo.blogspot.com","birthplace":"Karachi","twitter_username":"Rameezramzan","blog_url":"http://www.socialcubix.com/blog","blog_feed_url":"http://www.socialcubix.com/blog/feed","affiliation_name":"Unaffiliated","born_year":1988,"born_month":11,"born_day":18,"tag_list":"rameez-ramzan-ali, rameez-ramzan, seo-pakistan, seo-expert","alias_list":null,"created_at":"Thu Jun 14 10:56:21 UTC 2012","updated_at":"Fri Jun 22 20:22:29 UTC 2012","overview":"<p>More than Two years of experience in SEO/SEM and SMO and other marketing channels like Pay Per Click, Social Media Marketing and Email Marketing.</p>\n\n<p>I had started my SEO career in Joviant Technology and optimized various websites, but specially my first e-commerce website, AJsCigar. Currently, I am working at Cubixlabs as a SEO Manager since one year.</p>\n\n<p>Expertise:</p>\n\n<p>-SEM/SEO: Wide experience of developing and implementing effective SEO strategies with the goal of producing high organic positions on major search engines and generating increased targeted web traffic. Knowing in advanced SEO techniques, extensive knowledge of Social Media and use in Online Marketing. In-depth knowledge of utilizing the correct types of social media for various clienteles. Exhaustive understanding of Digg, Reddit, MySpace, Delicious, Furl, Wikipedia, forums, social communities, etc. In-Depth cognition of search marketing and uses of Blogs &amp; RSS Feeds. </p>\n\n<p>-SMO:\n•Managing social media properties (Facebook, Linkedin, Twitter and Youtube etc.), including \ndaily monitoring, posting, and content development. </p>\n\n<p>•Coordinate and implement social media marketing communication projects with responsibilities that include social media advertising and creating brand awareness online. </p>\n\n<p>•Prepare status reports on social media efforts and success rates.</p>\n\n<ul>\n<li>Content Development/Optimization: Proficient in all types of content development and optimization. Understanding of vertical search engine integrations and their effect on the several content areas including text, news, photos, video, audio and products images. </li>\n</ul>\n\n<p>-Web Analytics: Know how to use web analytics to analyze traffic trends and behavior and measure success of SEO/SEM efforts. Wide use of web traffic analytical software such as Google Analytics and IBP.</p>\n\n<ul>\n<li>PPC: Capable of managing paid search marketing campaigns in Google Adwords and understanding of CTR &amp; ROI. Know how about banners advertising and ads</li>\n</ul>\n\n<p>Specialties:</p>\n\n<p>-SEM\n-SEO\n-SMO\n-PPC\n-Content Development</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0019/5474/195474v2-max-150x150.jpg"],[[180,225],"assets/images/resized/0019/5474/195474v2-max-250x250.jpg"],[[180,225],"assets/images/resized/0019/5474/195474v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BBA","subject":"Marketing and Finance","institution":"PIMSAT","graduated_year":2012,"graduated_month":null,"graduated_day":null},{"degree_type":"BBA","subject":"Marketing and Finance","institution":"PIMSAT","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.socialcubix.com","title":"Facebook Developers"},{"external_url":"http://semandseo.blogspot.com","title":"SEO News"}],"web_presences":[]}