{"first_name":"RAMI","last_name":"ELKHATIB","permalink":"rami-elkhatib","crunchbase_url":"http://www.crunchbase.com/person/rami-elkhatib","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Acero Capital","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Mar 21 11:15:42 UTC 2012","updated_at":"Wed Jul 11 03:00:46 UTC 2012","overview":"<p>Rami founded Acero Capital in late 2009, and focuses on investments in both IT and Clean Energy. He currently serves on the board of CaptureToCloud (personal and enterprise cloud application company), Bitzer Mobile (enterprise mobile company) and on the boards of Solexant and Banyan Energy (solar energy companies). Prior to Acero, Rami was General Partner at Southeast Technology Funds where he focused on IT infrastructure and software investments, and served on the boards of several investments including Pixel Magic (acquired by Dai Nippon), Waveguide Solutions, Elumens Corporation and Arsenal Digital (acquired by IBM).\nPrior to venture capital, Rami held multiple roles in tech and finance — he co-founded Datacme Software, held multiple senior management roles at Oneworld Software Solutions, and worked as a technology investment banker at UBS Warburg where he led the execution of several public offerings and M&amp;A deals that in aggregate raised over $800M for high tech companies. Before that, Rami had started his career as a software engineer, developing large-scale software applications (Design Automation Systems; Decision Support Systems) for Global Fortune 20 companies (Toyota, Procter &amp; Gamble).\nRami is a graduate of M.I.T. where he earned an MBA in finance and was named the Henry du Pont III Scholar, and a graduate of Purdue University where he earned a B.S. in Computer and Electrical Engineering. Before going on leave from Stanford University, Rami was also pursuing his M.S. in Materials Science and Engineering at Stanford, where he was a member of Stanford’s Honors Coop Program. While at Stanford, Rami’s research included investigation of new materials for fuel cell membranes, solar thin film deposition and catalysts for bio-refining of renewable chemicals. At Stanford Rami also contributed to writing the 2nd edition of the leading textbook on fuel cells (Fuel Cell Fundamentals).</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0018/0381/180381v1-max-150x150.jpg"],[[180,225],"assets/images/resized/0018/0381/180381v1-max-250x250.jpg"],[[180,225],"assets/images/resized/0018/0381/180381v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Acero Capital","permalink":"acero-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,136],"assets/images/resized/0020/0535/200535v2-max-150x150.jpg"],[[250,227],"assets/images/resized/0020/0535/200535v2-max-250x250.jpg"],[[450,409],"assets/images/resized/0020/0535/200535v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}