{"first_name":"Rami","last_name":"Kasterstein","permalink":"rami-kasterstein","crunchbase_url":"http://www.crunchbase.com/person/rami-kasterstein","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Neocrafts","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Apr 21 01:49:06 UTC 2010","updated_at":"Mon Apr 11 22:37:11 UTC 2011","overview":"<p>With a career founded in product development and R&amp;D and augmented by six as a VC, Rami Kasterstein has a broad perspective on building complex technology that includes a deep understanding for the kind of business structures necessary to make that technology scale and grow.</p>\n\n<p>Rami began his career at Aladdin Knowledge Systems, a software security company (NASDAQ:ALDN and later acquired by Vector Capital), and later founding AladdinSoft, a start-up subsidiary of Aladdin, developing home banking and CRM solutions for some of Israel’s largest organizations. It was at AladdinSoft Rami met one of his Do@ co-founders, Ami Ben David. After three years AladdinSoft was acquired, and Rami became Aladdin Knowledge Systems’ CTO and VP of R&amp;D, managing all products, strategic product marketing, R&amp;D, support and technological business development for a geographically dispersed team spanning the US, Germany, the UK and Japan.  </p>\n\n<p>After Aladdin, Rami shifted to the other side of the table to become a venture capitalist. He joined Star Ventures where he led investments and sat on the board of several start-ups in both Israel and the US. Among his successful exits are: Identify (acquired by BMC); Topio (acquired by Network Appliance); Broadbus (acquired by Motorola); Acopia (acquired by F5); and GrooveMobile (acquired by LimeWire).</p>\n\n<p>The siren song of start-up life called Rami back to the entrepreneur world in 2006, when he took the role of CEO with Neocraft, a company that integrated musical instruments with computers and the web. This venture-backed start-up’s first product, a computer-based guitar, represented the first substantive guitar innovation since the 1950s.</p>\n\n<p>In 2009 Rami began consulting on business strategy and product development for both public and start-up companies, and was on the founding team of few start-ups. It was while advising other companies that he and Ami Ben-David, conceived of the idea for Do@ and in 2010 they founded the company, brought in a third co-founder, Joey Simhon, and began development. At Do@ Rami heads the business operations, leading strategic development and investor outreach.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEOl and Co-Founder","firm":{"name":"The Everything Project","permalink":"everything-me","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0010/8632/108632v4-max-150x150.png"],[[250,56],"assets/images/resized/0010/8632/108632v4-max-250x250.png"],[[450,102],"assets/images/resized/0010/8632/108632v4-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Venture Capitalist","firm":{"name":"Star Ventures","permalink":"star-ventures","type_of_entity":"company","image":null}},{"is_past":true,"title":"CEO","firm":{"name":"Neocrafts","permalink":"neocrafts","type_of_entity":"company","image":null}},{"is_past":true,"title":"CTO and VP of R&D","firm":{"name":"Aladdin Knowledge Systems","permalink":"aladdin","type_of_entity":"company","image":{"available_sizes":[[[147,51],"assets/images/resized/0008/8231/88231v1-max-150x150.jpg"],[[147,51],"assets/images/resized/0008/8231/88231v1-max-250x250.jpg"],[[147,51],"assets/images/resized/0008/8231/88231v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}