{"first_name":"Rami","last_name":"Rinot","permalink":"rami-rinot","crunchbase_url":"http://www.crunchbase.com/person/rami-rinot","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"CHIC.TV","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed May 07 06:42:36 UTC 2008","updated_at":"Tue Oct 21 20:04:27 UTC 2008","overview":"<p>Rami Rinot is the Publisher and Executive Editor of CHIC.TV, he published and co-authored The Spirits of Cocktail and The Spirits of New York Restaurant and Lifestyle Guide.</p>\n\n<p>Rami has vast managerial and entrepreneurial experience. Before establishing CHIC.TV, he was Chief Operating Officer of GigaSpaces Technologies, a grid computing software company funded by Intel, BRM Capital and FT Ventures, prior to which he led Gal-On.com Venture Capital, a technology incubator focusing on innovative technology and medical devices. Following GigaSpaces, Rinot served as a V.P. Business Development of IntaMission, a UK based software Integration Company funded by 3i.</p>\n\n<p>Rinot was a member of the Peres Center for Peace and was an escort to Nobel Prize Winner, Archbishop Desmond Tutu, aiding his efforts to promote peace in the Middle East.</p>\n\n<p>Rinot received an honor for outstanding achievement for his service in the IDF as a battalion medic with responsibility for one of the largest military hospitals in Israel.</p>\n\n<p>Rinot has an Executive MBA from Bradford University in England and a Bachelor of Management from Ben-Gurion University in Israel.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"CHIC.TV","permalink":"chic-tv","type_of_entity":"company","image":{"available_sizes":[[[150,70],"assets/images/resized/0001/8068/18068v1-max-150x150.jpg"],[[250,117],"assets/images/resized/0001/8068/18068v1-max-250x250.jpg"],[[450,211],"assets/images/resized/0001/8068/18068v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}