{"first_name":"Rami","last_name":"Branitzky","permalink":"rami-branitzky","crunchbase_url":"http://www.crunchbase.com/person/rami-branitzky","homepage_url":"http://www.numenta.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon May 07 16:35:45 UTC 2012","updated_at":"Fri May 11 03:52:08 UTC 2012","overview":"<p>Rami Branitzky is the CEO of Numenta, Inc. an innovator in the field of intelligent computing.</p>\n\n<p>Rami brings over 15 years of experience in managing and growing software businesses. He spent eleven years with SAP AG, where he held multiple leadership roles. Most recently Rami served as Senior Vice President, Sustainability Business, where he led the company’s efforts in the Sustainability markets. Previously, Rami served as Managing Director of SAP Labs North America, where he was responsible for the strategy and operations of SAP Labs locations in the United States and Canada. Prior to taking on the SAP Labs Managing Director role, Rami served as a Senior Vice President in the Global Partner Group, responsible for managing SAP&#8217;s global relationships with ISV and technology partners, overseeing all relevant business development and alliances activities.</p>\n\n<p>Rami joined SAP following the acquisition of TopTier Software in 2001, where he played an instrumental part in driving the company&#8217;s product and go-to-market strategy. Rami started his career at Cheyenne Software, now a division of Computer Associates, as a business analyst and sales operations manager.</p>\n\n<p>Rami holds a BA from Hofstra University and an MBA in Information Systems and Finance from the Stern School of Business, New York University.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0018/8998/188998v2-max-150x150.jpg"],[[100,150],"assets/images/resized/0018/8998/188998v2-max-250x250.jpg"],[[100,150],"assets/images/resized/0018/8998/188998v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}