{"first_name":"Ramiro","last_name":"Sanchez","permalink":"ramiro-sanchez","crunchbase_url":"http://www.crunchbase.com/person/ramiro-sanchez","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Ayax Systems","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Apr 23 14:57:25 UTC 2009","updated_at":"Fri May 08 18:11:00 UTC 2009","overview":"<p>Ramiro Sanchez manages the Analytics Division, which is responsible for collecting a wide variety of consumer data and then turning it into market information and insights, customer decision models, and market projections. He is also responsible for planning and delivering client-defined consulting engagements and off-the-shelf strategic market reports.</p>\n\n<p>He has 15 years of experience in developing, marketing, selling and implementing technology projects in the US and Latin America. He has worked on defining functional and commercial requirements for business-to-consumer and business-to-business software applications. His professional roles at corporations such as Oracle Corporation (US), Bechtel Corporation (US), Brasiliana Consulting (Brazil), and Tidewater, Inc. (US-Venezuela) has given him significant experience in managing local and remote projects, teams with different backgrounds, and driving projects in risky business dynamics.</p>\n\n<p>Prior to joining Ayax Systems, Ramiro Sanchez was the principal at Maxioma Consulting, a firm that helped American companies to expand their business in Latin America. He holds a BS degree in Civil Engineering from Universidad Iberoamericana (Mexico), an MS in Geomechanics and an MS in Construction Engineering and Management from Stanford University (US), and an MBA from Georgetown University (US).</p>\n\n<p>Language skills: fluent in Spanish (native language), English, and Portuguese.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder & VP of Analytics","firm":{"name":"Ayax Systems","permalink":"ayax-systems","type_of_entity":"company","image":{"available_sizes":[[[150,68],"assets/images/resized/0004/2787/42787v2-max-150x150.jpg"],[[250,114],"assets/images/resized/0004/2787/42787v2-max-250x250.jpg"],[[450,205],"assets/images/resized/0004/2787/42787v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}