{"first_name":"Randall","last_name":"Jacops","permalink":"randall-jacops","crunchbase_url":"http://www.crunchbase.com/person/randall-jacops","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jul 23 15:05:45 UTC 2009","updated_at":"Thu Jul 23 15:06:31 UTC 2009","overview":"<p>Randy Jacops was named President Chief Executive Officer of Versata Enterprises in 2006. Previously, Mr. Jacops was the VP and GM responsible for Trilogy Technology Group, Trilogy&#8217;s enterprise software business unit. Upon acquiring Versata, Trilogy combined Trilogy Technology Group and Versata to form a single business unit, Versata Enterprises, focused on enterprise software and devoted to customer success and innovation. With the combination, Mr. Jacops became CEO.  Versata is now the parent company of several acquired leading technology firms, including Artemis, Gensym, Nextance, Clear Technology, Evolutionary Technologies, and TenFold.  Mr. Jacops serves as CEO of each of these companies. </p>\n\n<p>During his tenure at Trilogy, Mr. Jacops served in a variety of operational and strategic roles encompassing consulting, engineering, finance, and general operations. Before his recent assignment as VP and GM of Trilogy Technology Group, he served as the COO of Trilogy&#8217;s Automotive and High-Tech business units. Throughout his tenure, Mr. Jacops has championed and implemented Trilogy&#8217;s Customer Success Program at a variety of Global 1000 corporations and continues  introducing new and acquired customers to Versata&#8217;s differentiated approach to customer success.</p>\n\n<p>Prior to Trilogy, Mr. Jacops was a partner with Deloitte Consulting, specializing in business transformation initiatives for global corporations in the manufacturing and technology industries. Mr. Jacops was a founding partner of Deloitte&#8217;s Shared Services business, where his team grew a start-up business to a $50M service line, one of the fastest growing and successful endeavors within Deloitte. Mr. Jacops started his career as a financial analyst with Ford Motor Company, where he performed a wide variety of jobs, from Finance Staff to plant-floor analysis.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President and CEO","firm":{"name":"Versata Enterprises","permalink":"versata","type_of_entity":"company","image":{"available_sizes":[[[150,70],"assets/images/resized/0005/4017/54017v1-max-150x150.png"],[[171,80],"assets/images/resized/0005/4017/54017v1-max-250x250.png"],[[171,80],"assets/images/resized/0005/4017/54017v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}