{"first_name":"Randy","last_name":"Jeffers","permalink":"randy-jeffers","crunchbase_url":"http://www.crunchbase.com/person/randy-jeffers","homepage_url":"http://randyjeffers.org","birthplace":"","twitter_username":"randyjeffers","blog_url":"http://randyjeffers.net","blog_feed_url":"http://aloelicious.blogspot.com/","affiliation_name":"Unaffiliated","born_year":1953,"born_month":4,"born_day":10,"tag_list":"randy-jeffers, mlm, leadmlm, marketing, how-to-network-market, liberty-freedom-network, marketing-lead","alias_list":null,"created_at":"Fri Mar 30 16:59:29 UTC 2012","updated_at":"Wed Jun 20 17:37:58 UTC 2012","overview":"<p>The son of a minister, Randy has always worked hard and had many successful business endeavors. By the time he was a senior in high school, Randy was managing a shoe store, attending classes and working twelve hours a day. After attending college, he owned and operated a very successful restaurant. After the restaurant venture, Randy built and operated a prosperous “indoor” 18-hole miniature golf course and amusement centers in multiple locations.</p>\n\n<p>This operation did so well that it became a nationwide model and was visited by people from all over the country who had similar businesses.</p>\n\n<p>In the early 1980′s, Randy was involved in the financial services arena, which allowed him to retire at an early age to pursue some of his dreams. He invested a few years instudying his family’s genealogy and traveling around to meet his relatives. In the early 1990′s, he traveled to Venezuela, South America, and with a local friend, started a rain forest preservation project that was responsible for saving many miles of valuable land from the ravages of the illegal diamond miners.</p>\n\n<p>In 1995, through a chance encounter with a former business associate, Randy Jeffers took a look at the de-regulation that was going on in the telecommunications industry. As he delved into telecommunications, he started to develop some initial concepts and plans for implementing a venture that would meet his ideals for the perfect company. He called an old friend that was the CFO of a phone company in Oakland, California, to discuss his ideas. Randy was invited to California to take a look and as fate would have it, his visit coincided with an international phone card show. Randy attended the show, got totally excited about the possibilities of using phone cards as the vehicle to accomplish a business that could provide everything necessary for hard working people to take charge of their lives, reach their full potential, and Make Their Dreams Come True!</p>\n\n<pre><code>His company became one of the biggest success stories in one of the largest industries in the world!\n</code></pre>\n\n<p>In less than 2 years, his company recruited the largest sales force in the shortest period of time of any company in the Network Marketing industry. Obviously, many thousands of people had incredibly positive things happen in their lives because of Randy Jeffers’ dream, and many of them became totally financially independent.</p>\n\n<p>Traveling the world and speaking before tens of thousands of people, Randy Jeffers has always brought hope and opportunity. He has always believed that for a company to be a “Great” company, it has to remember that it’s Independent Representatives are the most important people in the company and that everything the company does has to be designed to make the opportunity as great for the newest person to join the ranks as it was for the very first person. He realizes that no matter how great a company is, it doesn’t mean a thing if it’s people are not accomplishing their dreams.</p>\n\n<p>Building on the knowledge and experience of creating something that very few could even dream about, Randy Jeffers is committed to building Liberty Freedom Network into the largest Internet Network Marketing company in the world. As he likes to say,</p>\n\n<p>“Liberty’s number 1 product is it’s revolutionary “Debt Liberator” Octonary Compensation Plan, the Greatest Compensation Plan ever devised In The History Of Mankind.</p>\n\n<pre><code>This compensation plan is not theory, it has paid more people more money in the shortest period of time, than any other in this industry.”\n</code></pre>\n\n<p>Randy Jeffers has created an opportunity that is unparalleled in the industry.</p>\n\n<p>One of the things that he is most proud of, is the infrastructure that has been built to handle the processing and operations. Having lived through the challenges of growing quickly and knowing that you can’t just go out and buy computer software that will really do the things that need to be done, LFN has built it’s own proprietary software system to handle unlimited growth. “Real Time” processing is so important on the Internet and that’s what you get with Liberty Freedom Network. It’s truly a “paper-less” system. When someone becomes a Liberty Freedom Network  Independent Representative, they receive a Business Suite that provides all the tools necessary to actually run their business from the comfort of their own home, with access to all the information regarding their on-line business at their fingertips.</p>\n\n<p>Liberty Freedom Network has at it’s core, some cutting edge products that you can actually receive FREE! Based around a simple concept of “Buy 1, Sell 3, Get Yours FREE!”; Local and Long Distance Digital Phone Service, Health &amp; Wellness, Travel Savings Club, Video Email, Video Conferencing, Online Meetings, and an Automated System for sharing this information with others, are some of the initial products with this concept. LFN also offers the Liberty Market Place where you will find Health and Nutrition, Skin Care, Consumer, Telecommunications and many other innovative and unique products that can really make a difference in one’s health and life. There is also an On-line Shopping Mall, where you can purchase anything from a new car to pharmacy items to clothing. There are actually millions of products from companies like Wal-Mart, Office Max, Disney, and many other companies that are household names.</p>\n\n<p>What Randy Jeffers has put together in Liberty Freedom Network, is something that many believe will be the “Opportunity of a lifetime!”  You can have your own Home-based Internet business, receive Local and Long Distance Digital Phone Service, Health &amp; Wellness, Travel Savings Club, Video Email, Video Conferencing, Online Meetings, and a Free Automated System for sharing this information with others. And… by sharing this information with others and building your Liberty Freedom Network business, you can possibly earn a substantial income either part-time or full-time. And… you can have your own Personal Gateway that is a recruiting masterpiece with it’s “About Me” page that lets the world know about you and your dreams and goals.</p>\n\n<p>You know, Real Opportunity only knocks a few times in one’s life. This just may be the opportunity that you have been looking for! In life, TIMING IS EVERYTHING, and Liberty Freedom Network is poised to become a major success story. Why not come join Randy Jeffers and the LFN Team as they build the largest Internet Network Marketing company in the world and be a part of something that truly can MAKE YOUR DREAMS COME TRUE!</p>","image":{"available_sizes":[[[150,147],"assets/images/resized/0018/1933/181933v2-max-150x150.png"],[[250,246],"assets/images/resized/0018/1933/181933v2-max-250x250.png"],[[290,286],"assets/images/resized/0018/1933/181933v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://randyjeffers.net/randyjeffers-netmeet-randy-jeffers/","title":"Randy Jeffers Bio"},{"external_url":"http://randyjeffers.net/randy-jeffers-founder-ofliberty-kidz/","title":"Liberty KIdz"},{"external_url":"http://randyjeffers.org/randyjeffersbiography/","title":"Meet Randy Jeffers "},{"external_url":"http://www.reverbnation.com/randyjeffers","title":"Randy Jeffers Music "},{"external_url":"http://www.myspace.com/randy-jeffers","title":"Randy Jeffers My Space"},{"external_url":"https://www.facebook.com/Randy1jeffers","title":"Randy Jeffers Facebook "},{"external_url":"http://vimeo.com/randyjeffers","title":"Randy Jeffers TV "}]}