{"first_name":"Randy","last_name":"Best","permalink":"randy-best","crunchbase_url":"http://www.crunchbase.com/person/randy-best","homepage_url":"http://www.bestassociates.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1945,"born_month":11,"born_day":20,"tag_list":"","alias_list":null,"created_at":"Fri Jan 27 07:51:12 UTC 2012","updated_at":"Mon Jan 30 09:57:54 UTC 2012","overview":"<p>Randy grew up in Beaumont, Texas and graduated from Lamar University in 1967.  He was a founding partner in the merchant-banking firm Mason Best, which had offices in Texas and London. During a long business career which began in college, he founded companies in publishing, defense, agriculture, health care, energy, specialty foods, and fine art.  He has also founded education initiatives in K-12 and postsecondary. </p>\n\n<p>Randy has devoted a substantial portion of time and resources throughout his career to philanthropic pursuits, and has had a long-standing interest in the welfare of children. Randy now only pursues business initiatives that have a strong social component. </p>\n\n<p>More than a decade ago, Randy made a conscious decision to focus all his business experience and passion on one of the nation’s largest social issues – the widespread problem of illiteracy among our nation’s children, and the resulting cost to them and to our country. No one understands any better than Randy the criticality of literacy to success because he had to wage his own battle with dyslexia to achieve it. His passion in taking literacy to children throughout our country has defined his successful and important work as a social entrepreneur.</p>\n\n<p>Today, Randy heads a company dedicated to delivering technology and comprehensive student support services to state universities allowing them to compete head-to-head with large, for-profit online universities. The innovative approach to distance learning in higher education provides state universities with sustainable growth without compromising quality. More importantly, Randy’s solution fulfills an extremely important social need, particularly for under-served populations: access to an affordable, flexible college education from a state university.</p>\n\n<p>Randy was named to the Board of Directors of the James B. Hunt Institute for Educational Leadership and Policy in 2006. He also is a member of the College of Education Foundation Advisory Council for the University of Texas and Dallas Citizens Council and has served on the boards of numerous community and education organizations; Education Commission of the States Advisory Board, National Education Association Foundation Board, National Urban Alliance Board for Columbia University, and Dallas County Community College Foundation.</p>\n\n<p>Randy is a frequent lecturer on entrepreneurship in the education sector and has spoken at the Harvard School of Business.  To read more about Randy, follow the link below to an excerpt from the book called Finishing Well by Bob Buford.</p>\n\n<p>http://www.halftime.org/experiences/best.aspx</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0017/1852/171852v2-max-150x150.jpg"],[[200,250],"assets/images/resized/0017/1852/171852v2-max-250x250.jpg"],[[200,250],"assets/images/resized/0017/1852/171852v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.bestassociates.com","title":"Best Associates"}],"web_presences":[]}