{"first_name":"Randy","last_name":"Beverly, Jr.","permalink":"randy-beverly-jr","crunchbase_url":"http://www.crunchbase.com/person/randy-beverly-jr","homepage_url":"","birthplace":"Cape May, New Jersey","twitter_username":"RandyBe","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1966,"born_month":12,"born_day":24,"tag_list":"randy-beverly","alias_list":null,"created_at":"Wed Mar 24 17:11:41 UTC 2010","updated_at":"Wed Jul 07 20:01:15 UTC 2010","overview":"<p>Randy is an accomplished video game designer and sports technologist, currently serving as a Consultant based, in Milan, Italy. </p>\n\n<p>Randy&#8217;s gaming career began with the introduction of ground-breaking AI designs for Electronic Arts&#8217; franchise product, John Madden NFL Football. His career highlights include serving as a game designer along-side of other traditional titles and roles, such as Producer, Senior Producer, Executive Producer, and Director. Randy has worked with several major studios such as Fox Sports, Hasbro Interactive, Disney Interactive, and Activision. Between 1998 and 2008, Randy has shipped mutiple game titles each year, on all existing gaming platforms, to include mobile and wireless devices.</p>\n\n<p>In 2004, Randy worked for the National Football League (NFL) to assist in the creation of new training technologies. He also served as a consultant for a major Hollywood Production studio. </p>\n\n<p>In 2007, Randy co-founded an Eastern European gaming studio called Beast Studios.</p>\n\n<p>Randy is a graduate of UCLA, a former American athlete, and the son of Randy Beverly Sr., Defensive Back for NFL&#8217;s Super Bowl III Championship team, the New York Jets.   </p>","image":{"available_sizes":[[[115,150],"assets/images/resized/0008/2040/82040v2-max-150x150.jpg"],[[191,250],"assets/images/resized/0008/2040/82040v2-max-250x250.jpg"],[[291,379],"assets/images/resized/0008/2040/82040v2-max-450x450.jpg"]],"attribution":"<p>Randy Beverly, Jr.</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}