{"first_name":"Randy","last_name":"Wootton","permalink":"randy-wootton","crunchbase_url":"http://www.crunchbase.com/person/randy-wootton","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"AdReady","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Mar 13 15:41:11 UTC 2012","updated_at":"Mon Mar 19 00:59:46 UTC 2012","overview":"<p>Randy is responsible for executing AdReady’s sales, service and marketing initiatives for advertisers and agencies. He has more than eleven years experience in the software, Web and online advertising industries, and is a sought after speaker. Randy was previously Vice President of the Global Search and Online Marketplace at Microsoft, where he was instrumental in operationalizing Microsoft’s “Search Alliance” agreement with Yahoo! for the small and medium sized space. In this role, Wootton led a staff of more than 300 sales, marketing and support employees. While at Microsoft, Wootton also served as Chief of Staff for the Online Services and Windows Division and as head of the U.S. Specialist Sales organization. Prior to Microsoft, Randy spent 4.5 years at aQuantive where he ran the international division for Atlas and had roles in product management and marketing. Previously, he spent 8 years in the US Navy as a Bomardier/Navigator in A-6E intruders and an English instructor at the Naval Academy. Randy earned a BS from the Naval Academy, an MBA from Harvard’s Business School, and a MALA from St. John’s College. Finally, he serves on the advisory board for Parature Inc, Pathwise Leadership &amp; Advising, and sits on the board for The Boyer Childrens’ Clinic</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"SVP of Sales, Service and Marketing","firm":{"name":"AdReady","permalink":"adready","type_of_entity":"company","image":{"available_sizes":[[[150,59],"assets/images/resized/0000/1303/1303v4-max-150x150.png"],[[200,79],"assets/images/resized/0000/1303/1303v4-max-250x250.png"],[[200,79],"assets/images/resized/0000/1303/1303v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}