{"first_name":"Randal (Rand)","last_name":"Leeb-du Toit","permalink":"randal-rand-leeb-du-toit-2","crunchbase_url":"http://www.crunchbase.com/person/randal-rand-leeb-du-toit-2","homepage_url":"","birthplace":"South Africa","twitter_username":null,"blog_url":"http://metarand.com","blog_feed_url":"http://metarand.com/feed/","affiliation_name":"Piclinq","born_year":1965,"born_month":5,"born_day":11,"tag_list":"","alias_list":null,"created_at":"Wed Aug 06 03:47:21 UTC 2008","updated_at":"Thu Apr 28 05:42:50 UTC 2011","overview":"<p>Rand is a multifaceted entrepreneur and seasoned technologist with a unique blend of vision, oversight and operational experience. A consummate business artist, he has changed thinking at some of the world’s largest publishing houses, jumpstarted over 20 businesses and raised more than half a billion dollars. He has software deployed across over 1 billion devices, filed more than 40 patents and his pan-continental canvas extends across a wide range of high tech and media arenas.</p>\n\n<p>Rand is CEO and President of Seggr, a global consulting firm working with clients as diverse as multinationals, banks and start ups to identify and enable growth in new markets, new customers, new products and services. Seggr means ‘hero’ in old Norse (Viking) and the firm are heroes for high growth. As an elite consulting team they work globally to develop, pilot and lead the launch of significant growth opportunities addressing both new and emerging needs in the market and their client organisations.</p>\n\n<p>He is also Chairman of AngelLoft, a premier angel + business network that brings together angels, aspirant angels and senior executives.</p>\n\n<p>He is a veteran of the social business arena. It is over a decade since he helped grow one of the first social business phenomena across 110 cities connecting over 500,000 entrepreneurs and investors.</p>\n\n<p>He has acted as a Strategic Adviser to a number of companies, including Fox Interactive Media and Creative Enclave, a social games developer set up by New York Times bestselling novelist, Garth Nix, which developed the first massively multiplayer social gaming application on Facebook as a marketing tool for an upcoming novel.</p>\n\n<p>He was Chairman of Tigerspike, a New York headquartered BRW Fast 50 mobile advertising company and was the lead investor in 5th Finger, a San Francisco-based pioneer of the mobile advertising arena.</p>\n\n<p>He regularly undertakes keynote engagements and was a co-founder of Innovation Bay, a Sydney-based invite-only business and angel network. In the last 12 months of his involvement Innovation Bay was instrumental in deploying $7m in seed funding. One of those companies funded, a social commerce venture, went from inception to $2m in funding to a $40m trade sale in 10 months.</p>\n\n<p>He is on the Advisory Board of E-Diary, a software company which builds events-based software  that enables communication with sports and entertainment fans via the intimacy of their personal calendar.</p>\n\n<p>He was CEO of a social media software company headquartered in Burlingame, California, with operations is Los Angeles, St Petersburg and Galway. In this change agent role he built up a cohesive culture around a new product direction in the field of photo management and metadata and put in place an ethnographically-driven design team to work on over the horizon ideation.</p>\n\n<p>Rand was the Director of Business Development &amp; Commercialisation at NICTA, a prestigious Australian Center of Excellence for a number of years. NICTA is focused on applied research in Biomedical &amp; Life Sciences, Environmental Management, Intelligent Transport Systems, Mobile Systems &amp; Services, Safety &amp; Security and Software Infrastructure.</p>\n\n<p>During his tenure at NICTA, Randal created a culture of entrepreneurism and put in place a stage gated commercialization process and IP management system, which included an internal fund and an Entrepreneur in Residence Program. He was successful in spinning out a number of venture-backed companies and building a strong pipeline of further opportunities, while also raising half a billion dollars, growing the organization from 20 staff in one lab to over 600 in five labs across Australia and taking its brand global.</p>\n\n<p>Spin outs included:</p>\n\n<ul>\n<li>Open Kernel Labs, a Chicago-based venture-backed developer of embedded virtualization software for mobile phones and broadband Internet devices. OK-Labs has deployed its software on over 1 billion mobile devices;</li>\n<li>Audinate, a Sydney-based venture-backed developer of Internet protocol networking technologies for professional-grade installed audio networks and equipment;</li>\n<li>7ip, a Sydney-based company which develops optimized and instant wireless telecommunication systems; and</li>\n<li>Monitoring Division, a Sunnyvale-based venture-backed company providing greater visibility to optical fibre degradation for network operators.</li>\n</ul>\n\n<p>Before that he was the CEO of an early stage venture capital firm. His portfolio companies have IPO’d, been sold in trade sales and also via the first secondaries portfolio play in Australia, which pioneered an entirely new private equity sector.</p>\n\n<p>His portfolio companies included:</p>\n\n<ul>\n<li>Genetraks, a venture-backed personalized medicine and bioinformatics company; and</li>\n<li>5th Finger, a venture-backed creative mobile marketing company that has spearheaded more than 5,000 integrated mobile campaigns and 300+ million consumer interactions globally.</li>\n</ul>\n\n<p>He set up a global think tank which focused on using pattern recognition to uncover disruptive technologies. As an intrapreneur within a major publishing conglomerate in the mid 90′s he:</p>\n\n<ul>\n<li>built a specialist legal vertical portal, which attracted over a million page views in its first month of operation; and</li>\n<li>created ComStrata, a software as a service solution for the strata property management industry.</li>\n</ul>\n\n<p>He is an early pioneer of social commerce, having conceived of the group buying concept as early as 1998.</p>\n\n<p>He was previously on the Advisory Board of the Global Security Challenge, a London Business School initiative to foster innovation in the homeland security arena.</p>\n\n<p>In addition to his board level experience with numerous high tech companies around the world he has a background in publishing and the law. He is an admitted attorney of the High Court of South Africa. He is a former South African Lifesaving Champion across a number of disciplines, has surfed for over 30 years and loves to stand up paddleboard, surf, mountain bike, photowalk, paint and cook.</p>\n\n<p>Rand lives in Sydney, Australia and can be contacted on +61 419 371 596 or randal dot leebdutoit at gmail dot com.</p>\n\n<p>He appeared on the front cover of the Business Review Weekly magazine in September 2006. His full LinkedIn profile is here and he can be found on twitter as @metarand.</p>","image":{"available_sizes":[[[150,146],"assets/images/resized/0002/3409/23409v2-max-150x150.jpg"],[[250,243],"assets/images/resized/0002/3409/23409v2-max-250x250.jpg"],[[440,429],"assets/images/resized/0002/3409/23409v2-max-450x450.jpg"]],"attribution":"<p>Business Review Weekly</p>"},"degrees":[{"degree_type":"Bachelor of Law","subject":"","institution":"University of Cape Town","graduated_year":1992,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"Piclinq","permalink":"piclinq","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}