{"first_name":"raoke","last_name":"kaeloe","permalink":"raoke-kaeloe","crunchbase_url":"http://www.crunchbase.com/person/raoke-kaeloe","homepage_url":"http://www.samrx.com/","birthplace":"us","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1979,"born_month":3,"born_day":4,"tag_list":"news, stories, articles, health","alias_list":null,"created_at":"Tue Nov 22 05:03:56 UTC 2011","updated_at":"Tue Nov 22 20:21:02 UTC 2011","overview":"<pre><code>           Samrx.com company profile\n</code></pre>\n\n<p>Samrx.com is the most efficient consistent online drugstore that provides consumers with great satisfaction and flawless service. Samrx.com serves customer all around the globe with its simplicity and trustworthy medications. Being trust worthy and reliable is the best feature of this online pharmacy. Samrx basically deals with the distribution of generic as well as trademark medication for the treatment of various health related issues such as ED treatment, hair loss, weight loss, quit smoking, antibiotic, anti allergy medications and pain relieve medications. \nAll the medication that are listed on the website are best quality medication   and are approved by the world greatest quality check administration FDA (food and drug administration). FDA has approved all the generic as well as patented medication as safe and effective to consume.  Samrx is completely customer oriented website that intends to provide every customer with complete satisfaction and security when they are navigating our website and placing an order for any medications. \nSamrx provides its customers with timely discounts on purchase of any product and also proffers special offers on special occasions.  We also provide free shipping facility to our customer’s far and wide. This online pharmacy is designed in a very simple manner so that the customers navigating this website do not find it difficult to understand the website. This apothecary’s shop provides all the generic medication at an inexpensive cost which is less as compared to the cost price offered by other medications. All the products availed are inexpensive so that the customers count on us whenever they wish to purchase medications from online pharmacy. \nOur customer care executives are always on toes to solve the queries of the customers while placing an order on our website. Customers can interact with our customer service executives through a toll free number mentioned on the website and can also interact through live chat and offline support. Above all our website is completely secure from any internet threats with the help of McAfee antivirus that is updated daily. All the transactions that are carried out on our website are completely safe and secured as the customer details are not exposed to any third person and the details are deleted as soon as the transaction is completed. \n&lt;a href=&quot;http://www.samrx.com/&quot;&gt; Smarx &lt;/a&gt;</p>","image":{"available_sizes":[[[150,43],"assets/images/resized/0016/3413/163413v2-max-150x150.jpg"],[[189,55],"assets/images/resized/0016/3413/163413v2-max-250x250.jpg"],[[189,55],"assets/images/resized/0016/3413/163413v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.samrx.com/","title":"Samrx"}],"web_presences":[]}