{"first_name":"Rashi","last_name":"Patel","permalink":"rashi-patel","crunchbase_url":"http://www.crunchbase.com/person/rashi-patel","homepage_url":"http://www.milecore.com","birthplace":"India","twitter_username":"milecoreA","blog_url":"http://hiremobileappsdeveloper.blogspot.com/","blog_feed_url":"http://hiremobileappsdeveloper.blogspot.com/feeds/posts/default","affiliation_name":"Unaffiliated","born_year":1988,"born_month":1,"born_day":18,"tag_list":"open-source-customization, ecommerce-website-development, search-engine-optimization, iphone-and-android-apps-development-word-press-website-development, joomla-development, magento-website-development, drupal-development, professional-website-design, eco","alias_list":null,"created_at":"Fri Aug 03 09:18:44 UTC 2012","updated_at":"Sat Aug 04 14:48:15 UTC 2012","overview":"<p>MILECORE - A specialized Web Design &amp; Web Development Company given Custom Web Design services includes Flash Website Design, Web App Development, venture Web Portal Development, Business Applications,  Ecommerce website Solutions, Custom eCommerce Shopping Carts, Search engine Optimization services, Pay Per Click management Services, SMM, Mobile application development, Website web Design &amp; Development, iPhone and android Application Development.</p>\n\n<p>Our specialty\nOpen Source Customization, Ecommerce website development, Search engine Optimization, iPhone and android apps development Word press website development, Joomla development, Magento website development, Drupal development, Professional Website Design, Ecommerce Website Design, Small Business Web Design, Custom Website Design, Website Redesigning, Flash Web Designing, Yahoo! Store Designing, PHP Web Development, PHP MySQL Web Development, ASP.net Web Development, Open Source Apps Development, Web Application Development, Offshore Web Development, LAMP Web Development, CMS Development</p>","image":{"available_sizes":[[[150,104],"assets/images/resized/0020/4199/204199v2-max-150x150.jpg"],[[250,174],"assets/images/resized/0020/4199/204199v2-max-250x250.jpg"],[[327,228],"assets/images/resized/0020/4199/204199v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}