{"first_name":"Raudline","last_name":"Etienne","permalink":"raudline-etienne","crunchbase_url":"http://www.crunchbase.com/person/raudline-etienne","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 02 19:26:03 UTC 2009","updated_at":"Tue Jun 02 19:27:01 UTC 2009","overview":"<p>Ms. Raudline Etienne is the Chief Investment Officer at New York State Common Retirement Fund. She was previously a Managing Director at CRA RogersCasey, LLC. Ms. Etienne led a team of investment professionals that provided consulting services to a limited number of corporate and public pension clients and was responsible for investment consulting for a series of both large and small public retirement systems. She was the lead consultant to several sophisticated clients with significant allocations to non-traditional investments, including hedge funds, private equity, and real estate and during her 11 Ѕ-year tenure at Rogerscasey, she developed broad experience in a wide variety of asset classes and investment strategies. Given her expertise and experience, Ms. Etienne was a Member of the firm&#8217;s Non-Traditional Manager Review Committee. Prior to joining the firm in 1996, Ms. Etienne was an Associate Consultant at Washington Hackett, Poitevien &amp; Company in Philadelphia. Her responsibilities included conducting manager due diligence, developing and implementing the manager search process, criteria, and evaluation methodology, performance monitoring, and preparing asset allocation studies and manager structure analysis. Prior to that, she was a Research Associate at The RREEF Funds in San Francisco. Ms. Etienne is a Founding Board Member of the Connecticut Hedge Fund Association and a Board member of the Robert Toigo Foundation Alumni Endowment. Ms. Etienne graduated with a B.S. degree from the School of Architecture at the Massachusetts Institute of Technology and an M.B.A. from the Walter A. Haas School of Business at the University of California, Berkeley where she was a Robert Toigo Foundation Fellow.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Investment Officer","firm":{"name":"New York State Common Retirement Fund","permalink":"new-york-state-common-retirement-fund","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}