{"first_name":"Raul","last_name":"Ramos","permalink":"raul-ramos","crunchbase_url":"http://www.crunchbase.com/person/raul-ramos","homepage_url":"http://www.vmc.com","birthplace":"San Antonio, TX","twitter_username":"RaulRamos","blog_url":"http://blog.vmc.com/","blog_feed_url":"http://feeds.feedburner.com/VMCConsulting","affiliation_name":"Unaffiliated","born_year":1968,"born_month":12,"born_day":5,"tag_list":"","alias_list":null,"created_at":"Mon Aug 01 17:54:08 UTC 2011","updated_at":"Thu Aug 04 18:13:06 UTC 2011","overview":"<p>Director, Client Solutions Pacific Northwest, VMC Consulting</p>\n\n<p>As an Information Technology sales specialist, Raul Ramos brings over 15 years of experience in enterprise sales, business development and partner management to his role as Director of Client Solutions, Pacific Northwest. Raul has an extensive background in delivering cloud based services, software lifecycle applications and hardware &amp; software VAR solutions across industries that include cable/telecommunications, software, health care, retail and insurance. Raul is responsible for providing territory leadership and sales strategy, which includes expanding alliance partnerships in the Pacific Northwest. Raul’s consultative approach and knowledge of solving problems through delivering IT solutions makes him a fundamental part of the Client Solutions team at VMC.</p>\n\n<p>Raul began his career as a United States Marine, serving as Military Police Officer and was assigned to HMX-1 Presidential Guard under the G.W. Bush Sr. &amp; Clinton administrations. Upon leaving the U.S. Marine Corps., Raul began his sales career holding local and national sales leadership positions with ExecuTrain Corp., Qwest Communications, (WWT) World Wide Technology, Varolii and CSG International. While at WWT, Raul was instrumental in building and managing an $85M U.S. Peripherals Program at Microsoft Corp. that achieved 148% growth in less than 3 years.</p>\n\n<p>Raul graduated from Central Texas University with a degree in Criminal Justice and is an active part of his community participating on the board of his HOA, a member of Eastridge Church, volunteering at the Seattle Bread of Life Mission &amp; Royal Family Foster Kids Camp. He also attends and supports local (itSMF) IT Senior Management Forum, (WTIA) Washington Technology Industry Association and (CCNG) Contact Center Network </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/raulramos123","title":"LinkedIn"},{"external_url":"http://twitter.com/#!/RaulRamos","title":"Twitter"}]}