{"first_name":"Ravindranath","last_name":"Yarlagadda","permalink":"ravindranath-yarlagadda","crunchbase_url":"http://www.crunchbase.com/person/ravindranath-yarlagadda","homepage_url":"http://www.myvirtualplaza.com","birthplace":"Chirala","twitter_username":"","blog_url":"http://myvirtualplaza.org","blog_feed_url":"","affiliation_name":"Myvirtualplaza","born_year":1984,"born_month":4,"born_day":16,"tag_list":"online-shopping, myvirtualplaza, virtual, shopping","alias_list":null,"created_at":"Fri Apr 20 17:25:59 UTC 2012","updated_at":"Wed Apr 25 21:02:27 UTC 2012","overview":"<p>India&#8217;s first exquisite virtual shopping - Myvirtualplaza</p>\n\n<p>MVP Technologies Pvt. Ltd. - Launches ‘MyVitrualPlaza.com’ - India’s First QR Code Based Shopping\nHyderabad, India, 28 April 2012 - Having gained an extensive experience in e-business and retail industry in India, MVP Technologies Pvt. Ltd. has successfully launched its operations in India with its first venture MyVirtualPlaza.com. MyVirtualPlaza.com is an online retail store that provides exhaustive range of merchandise options at bargain prices through mobile shopping, online shopping and most importantly through QR CODE SCANNING. </p>\n\n<p>With increasing demand for convenience based shopping,  MVP Technologies realized the need for an one-stop website that offers groceries, electronics, electricals, garments, pharmacy, consumer durables, home and kitchen appliances, apparels, bags, furniture, gold and silver, discount coupons, etc. online.</p>\n\n<p>To live up to expectations of its customers this one-stop-website provides a complete range of products and services at best bargain prices. What’s more? MyVirtualPlaza.com offers unbeatable services like home delivery within 24 hours, reminder on groceris and medicine, earn great discounts for your purchase with few clicks and many more“, Vanita Kothari, COO of MVP Technologies, explained.</p>\n\n<p>The main features of MyVirtualPlaza.com are:\nQR ( Quick Response ) Code shopping\nOnline Shopping\nGroup Bargaining\nEarn Reward Points that help you get great DISCOUNTS on product purchase.\nOne-Stop-Shop offering Grocery to Pharmacy to Consumer Durables.\nReminder Service\nMVP Shopping Card\nCompare suppliers to evaluate product price\nExpert reviews and customer recommendations\nDetailed product explanations and a glossary\nSecure billing</p>\n\n<p>The combination of the above features, together with the unique hassle-free shopping experience makes MyVirtualPlaza.com stand out from the crowd. </p>\n\n<p>MVP Technologies’ objective is to create an online platform for Indian consumers, which would be considered as a serious alternative to physical shopping. It aims to propose a value proposition that would make a win-win situation for the consumers, its retail partners and manufacturers purely with passion and technology as its weapons. MVP Technologies intends to create an icon e-commerce brand through laser-focused marketing and well thought through sales strategy that support company’s vision and existing and potential market opportunities.</p>\n\n<p>How is MyVirtualPlaza (MVP) different from any other e-commerce portal??\nMVP offers India’s first QR scan based mobile shopping (scan the QR code while waiting for bus, local train, walking down to office &#8211;&gt;Have delivery made within 24 hours)\nMVP is India’s first portal that lets you EARN DISCOUNTS for your purchase (click ads &#8211;&gt; earn points &#8211;&gt;convert points to discounts)\nMVP introduces GROUP BARGAIN concept for the first time in India (bigger the group you form &#8211;&gt; greater the discount you get)\nMVP, in collaboration with one of the leading banks in India, offers shopping card to all its users (MVP shopping card acts as a credit card)\nConvenience shopping allowing buyers easy access and reach to all under one roof – Malls; Hypermarkets; Category Killers (medicine, groceries, electronics, apparels)\n·Re-defining consumer value : not just the best deals but also quality, convenience, service, experience and innovation.</p>\n\n<p>About MVP Technologies Pvt. Ltd.</p>\n\n<p>MVP Technologies Pvt. Ltd., headquartered in Hyderabad, is the commercial subsidiary of MVP Limited, United Kingdom. MyVirtualPlaza.com is an online marketplace for household essentials that markets consumers&#8217; most trusted and recognized brand names with nearly 90 percent of these brands holding the No. 1 or No. 2 market share positions in their categories. As a leading provider of online retail and interactive marketing services for the Consumer Goods industry, MyVirtualPlaza.com offers manufacturers a direct access to consumer platform that provides shoppers with competitive pricing, instant coupons, and simple automation and management of household purchases. And, with its free iPhone app, all of this is available on-the-go. Accomplished by focusing on operational excellence, MVP Technologies is committed to making a positive difference in the stressed and hectic life of working professionals, teenagers and elderly people in India.</p>\n\n<p>For further information, please visit the website, www.myvirtualplaza.com</p>","image":null,"degrees":[{"degree_type":"Bachelor's Degree","subject":"EEE","institution":"JNTU","graduated_year":2006,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Myvirtualplaza","permalink":"myvirtualplaza","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}