{"first_name":"Ray","last_name":"Cao","permalink":"ray-cao-2","crunchbase_url":"http://www.crunchbase.com/person/ray-cao-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"EightyTwenty Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jun 15 18:25:07 UTC 2009","updated_at":"Mon Mar 21 04:40:58 UTC 2011","overview":"<p>Ray Cao is the Co-Founder and CEO of Loose Button. Loose Button is built on the philosophy that successful businesses are built by exceptional people. </p>\n\n<p>Previously, Ray was the president of the Impact Entrepreneurship Group, now Canada’s largest youth-run entrepreneurship organization. In his role as president, he founded the Global Entrepreneurship Week Canada campaign. Ray has dabbled with the mix of working for companies as well, from growing a mobile startup called Polar Mobile to working as a trader on Wall Street at Barclays Capital. He realized, however, that it was much more fun building companies.\n \nWhen he is not working on Loose Button, Ray is involved as a board member for the Impact Entrepreneurship Group (http://bit.ly/bQHhfR) and is an advisor to VeloCity (http://bit.ly/22HL) a leading technology incubator run by the  University of Waterloo. Ray is also an advisory board member for New York’s Entrepreneur Week. He is a member of the DiverseCity Steering Committee (http://bit.ly/abZymf) which consists of prominent individuals in the Greater Toronto Area who recognize the value and potential of diversity in leadership for the region’s social and economic prosperity. Ray is a past recipient of Waterloo’s Top 40 Under 40 award.\n \nRay holds a Bachelor of Applied Science degree in Systems Design Engineering from the University of Waterloo.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Loose Button","permalink":"loose-button","type_of_entity":"company","image":null}},{"is_past":false,"title":"","firm":{"name":"EightyTwenty Group","permalink":"eightytwenty-group","type_of_entity":"company","image":{"available_sizes":[[[150,26],"assets/images/resized/0004/8609/48609v2-max-150x150.png"],[[250,44],"assets/images/resized/0004/8609/48609v2-max-250x250.png"],[[450,80],"assets/images/resized/0004/8609/48609v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}