{"first_name":"Ray","last_name":"Anderson","permalink":"ray-anderson","crunchbase_url":"http://www.crunchbase.com/person/ray-anderson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Bango","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Mar 28 00:53:59 UTC 2008","updated_at":"Fri Jun 27 22:08:19 UTC 2008","overview":"<p>Ray is Chief Executive of Bango, the only open, global platform that gives content providers fast and easy access to the huge opportunity presented by the emergence of the mobile internet.</p>\n\n<p>He co-founded Bango in 1999 after realising that the convergence of internet connectivity with the ubiquity of mobile phones could open up huge opportunities for content and service providers.</p>\n\n<p>Formerly at IXI, Ray established the industry standard network GUI - X.desktop. IXI was an early leader in the creation of the web. It sponsored the first ever WWW conference at CERN and shipped the world&#8217;s first commercial web browser. In 1993 The company merged with SCO and then floated on NASDAQ.</p>\n\n<p>Ray continued held senior executive roles in SCO, including general manager, senior VP of New Ventures and senior VP world-wide of Marketing, where he played a key role in driving the turnaround of the business, and its repositioning from small business Unix to becoming the industry standard for Intel Unix.(Unixware)</p>\n\n<p>Before IXI Ray was a co-founder of Torch Computers. Its software was sold to Steve JObs at Next and he sold the hardware business to CATSCO in 1984. He also worked for Acorn Computers, The General Electric Company and Sinclair Research.</p>\n\n<p>Ray is an entrepreneur and innovator with 20 years experience holding senior roles in the USA and Europe, building businesses, management teams and M&amp;A. Ray was a founding investor in a variety of growing companies including TeamStudio, Tenison Technology, E<em>Trade UK (Sold to E</em>TRade), Aspective, Trigenix (sold to Qualcomm), Brooks Fiber, Midentity and other technology businesses. He holds a 1st Class Degree in Computer Science from Cambridge University and is a keen pilot.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO and Founder","firm":{"name":"Bango","permalink":"bango","type_of_entity":"company","image":{"available_sizes":[[[150,56],"assets/images/resized/0001/6468/16468v4-max-150x150.png"],[[156,59],"assets/images/resized/0001/6468/16468v4-max-250x250.png"],[[156,59],"assets/images/resized/0001/6468/16468v4-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Non-exec Director","firm":{"name":"Psonar","permalink":"psonar","type_of_entity":"company","image":{"available_sizes":[[[150,58],"assets/images/resized/0007/9312/79312v4-max-150x150.jpg"],[[250,98],"assets/images/resized/0007/9312/79312v4-max-250x250.jpg"],[[450,176],"assets/images/resized/0007/9312/79312v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}