{"first_name":"Ray","last_name":"Bernaz","permalink":"ray-bernaz","crunchbase_url":"http://www.crunchbase.com/person/ray-bernaz","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Socialibrium","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Dec 15 15:05:05 UTC 2008","updated_at":"Mon Jan 04 23:08:01 UTC 2010","overview":"<p>Ray Bernaz is the founder and CEO of Socialibrium LLC. He provides the strategic vision for Socialibrium&#8217;s roadmap and works with the development team to translate that into practice.  His background includes technology management, banking, and consulting. </p>\n\n<p>Before founding Socialibrium, Ray spent 8 years in investment banking in both IT infrastructure and sales &amp; trading; working in New York, London, and Frankfurt.  It was the combination of these experiences in the front and back offices &#8211; both sitting outside a Network Operations Center (NOC) and watching how financial professionals juggled relationships &#8211; that gave him the inspiration for Socialibrium.  The idea was to provide a &#8220;NOC&#8221; for people&#8217;s own personal and professional networks, so they could quickly and easily ascertain which relationships required the most urgent attention.</p>\n\n<p>Prior to that, Ray spent three years in management consulting focused on financial services, sourcing, and energy; working in both New York City and Washington DC.  </p>\n\n<p>Ray holds a Bachelor of Science in Foreign Service from Georgetown University, where he studied Science, Technology, and International Affairs with a concentration in Business.  He also completed an honors certificate program in International Business Diplomacy.</p>\n\n<p>Aside from Socialibrium, Ray helps organize Ultralight Startups in New York City, and co-founded their London chapter.</p>\n\n<p>In his free time, Ray enjoys trail-running, competing in ultramarathons, coaching youth soccer, and spending time with his wife and three young children. </p>","image":{"available_sizes":[[[100,100],"assets/images/resized/0004/6750/46750v2-max-150x150.jpg"],[[100,100],"assets/images/resized/0004/6750/46750v2-max-250x250.jpg"],[[100,100],"assets/images/resized/0004/6750/46750v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder & CEO","firm":{"name":"Socialibrium","permalink":"socialibrium","type_of_entity":"company","image":{"available_sizes":[[[150,24],"assets/images/resized/0003/1795/31795v1-max-150x150.jpg"],[[250,40],"assets/images/resized/0003/1795/31795v1-max-250x250.jpg"],[[281,45],"assets/images/resized/0003/1795/31795v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}