{"first_name":"Ray","last_name":"Jamp","permalink":"ray-jamp","crunchbase_url":"http://www.crunchbase.com/person/ray-jamp","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Genesis Campus","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 21 21:42:48 UTC 2009","updated_at":"Fri Jun 12 20:39:31 UTC 2009","overview":"<p>Dr. Ray Jamp, Ph.D. is technologist who serves as a Venture Partner at Acorn Campus, Genesis Campus, Mobility Ventures and his latest Taiwan based fund called ID Soft capital. Dr. Jamp also has over 20 years experience as a chief technologist, architect, and designer with companies including ANDA Networks, Hewlett Packard Labs, Structured Internetworks, and Klever Communications, as well as six years of teaching and research experience at Penn State. Dr. Jamp is also a General Partner in Dragon Investment Company based in Taipei and a venture partner of Acorn Campus based in Silicon Valley. Previously he was the co-founder and chief technical officer of ANDA Networks, a universal access platform equipment vendor. </p>\n\n<p>ANDA had generated sales over $13 million in the first three quarters of year 2000 before the collapse of the telecomm market. Dr. Jamp helped raise over $97 million through four rounds of funding for the company. Before that he served as chief technology officer and co-founder of Structured Internetworks. Dr. Jamp was chief architect of the ASIC-based Ipath Bandwidth Manager and principal author of a patent on the TCP/IP-based QoS technologies. He has more than sixteen years of experience with Hewlett Packard. As a member of the technical staff at HP Labs, Dr. Jamp designed and implemented network protocols, network management and distributed systems, which became part of the HP OpenView network management platform. He was the principal designer of the system architecture and software implementation of HP color scanners, inkjet and color laser jet printers. He has co-authored three patents in the fields of color scanner and inkjet technologies. </p>\n\n<p>Dr. Jamp holds a BSEE from the National Taiwan University, a M.S. and a Ph.D. in Computer Science from Pennsylvania State University. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Genesis Campus","permalink":"genesis-campus","type_of_entity":"financial_org","image":{"available_sizes":[[[150,52],"assets/images/resized/0003/4738/34738v2-max-150x150.jpg"],[[250,87],"assets/images/resized/0003/4738/34738v2-max-250x250.jpg"],[[450,156],"assets/images/resized/0003/4738/34738v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}