{"first_name":"Raymond","last_name":"Sozzi","permalink":"raymond-sozzi","crunchbase_url":"http://www.crunchbase.com/person/raymond-sozzi","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu May 15 16:36:48 UTC 2008","updated_at":"Thu Aug 18 13:51:32 UTC 2011","overview":"<p>Raymond Sozzi is the Chairman of the Board for beRecruited. He is also the CEO and Chairman of the Board of RVS Ventures, Inc., a private equity and consulting firm. He sits on the Board of Directors of several private companies and non-profit organizations. Over the past 10 years, he has orchestrated nearly $200 million in acquisitions and public and private company financings. In 1992, he founded Student Advantage, Inc., a leading youth media and marketing company. For more than 10 years, he served as President, CEO and Chairman of the Board, charting the company&#8217;s growth to more than 500 employees and nearly $75 million in revenue. Sozzi has appeared in more than 200 different publications, including the New York Times, Boston Globe, Wall Street Journal and Ad Age. He was featured by BrandWeek as a Marketer of the Next Generation and in Chief Executive Magazine as one of the top 10 up and coming CEO&#8217;s in America. In 1999, Sozzi was recognized by Ernst and Young, USA Today and Dow Jones as the nation&#8217;s Young Entrepreneur of the Year. Sozzi, a graduate of Dartmouth College, began his career as an associate consultant for Bain &amp; Company.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chairman","firm":{"name":"beRecruited","permalink":"berecruited","type_of_entity":"company","image":{"available_sizes":[[[150,23],"assets/images/resized/0000/2230/2230v4-max-150x150.png"],[[250,39],"assets/images/resized/0000/2230/2230v4-max-250x250.png"],[[450,70],"assets/images/resized/0000/2230/2230v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}