{"first_name":"Reavis","last_name":"Daniel Moore","permalink":"reavis-daniel-moore","crunchbase_url":"http://www.crunchbase.com/person/reavis-daniel-moore","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"YouLicense","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Aug 04 17:48:10 UTC 2008","updated_at":"Mon Jun 08 02:52:15 UTC 2009","overview":"<p>Reavis Daniel Moore is a music business executive, internet entrepreneur and consultant with over 29 years experience working in the music industry centers of Austin, Los Angeles, San Francisco, New York and London. </p>\n\n<p>Reavis is the sole owner of Serve Music, Inc. a boutique music business consulting and ventures firm based in New York City, and founded in 2002. Serve Music provides strategy, business development and representation services to music companies, both traditional and 2.0, as well as to select music artists. The Serve Music business network includes hundreds of music, entertainment, and Internet business executives in the US and EU, and in other regions.</p>\n\n<p>Serve Music holds equity interest in YouLicense, Inc., an open online music licensing marketplace, and technology solutions provider, based in London and Tel Aviv. YouLicense.com includes over 250,000 music tracks from 17,000 artists that are available for licensing. Reavis serves as board chairman of YouLicense, with responsibility for international business development (2007-present).</p>\n\n<p>Serve Music is also a co-founder and equity partner in EarthDance Global, LLC, an international music and dance festival and lifestyle brand. The Earthdance festival has occurred annually since 1997, and currently includes over 300 event locations around the world on the same weekend. The festival is held in coordination with the annual UN International Day of Peace on September 21st. Reavis serves on the board of directors of both the Earthdance company and its 501c3 non-profit organization, and was its CEO from 2003-2007. </p>\n\n<p>In addition to its equity ventures, Serve Music also owns various music-related trademarks, including MusicMind.</p>\n\n<p>Prior to forming Serve Music, Reavis was CEO and Founder of MBC Networks, Inc. (1997-2001) an international music business consultant network based in New York, Amsterdam and Paris.</p>\n\n<p>His work in music also includes co-founding Open Door Management, a Los Angeles artist management firm (1986-1996); co-founding and producing the Rainbow Warrior Festivals, an annual world music festival held in Santa Fe, New Mexico and the festival&#8217;s related entertainment content including music, video, and books (1989-1993); and serving as Vice President and partner in SouthCoast Communications, a music label and publisher (1981-1986) based in Austin, Texas that released music through, or had joint ventures with some of the leading music companies of the day, including: MCA, CBS, Warner, Atlantic, and Capitol. The company earned numerous gold and platinum sales awards for successful artist album releases (Christopher Cross, Carole King, Firefall and others).</p>","image":{"available_sizes":[[[136,150],"assets/images/resized/0004/6640/46640v2-max-150x150.jpg"],[[187,206],"assets/images/resized/0004/6640/46640v2-max-250x250.jpg"],[[187,206],"assets/images/resized/0004/6640/46640v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chairman","firm":{"name":"YouLicense","permalink":"youlicense","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0000/2314/2314v1-max-150x150.png"],[[200,59],"assets/images/resized/0000/2314/2314v1-max-250x250.png"],[[200,59],"assets/images/resized/0000/2314/2314v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}