{"first_name":"Reed","last_name":"Rogala","permalink":"reed-rogala-2","crunchbase_url":"http://www.crunchbase.com/person/reed-rogala-2","homepage_url":"","birthplace":"Madison","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1980,"born_month":5,"born_day":12,"tag_list":"","alias_list":null,"created_at":"Fri Oct 26 07:53:03 UTC 2012","updated_at":"Sun Nov 04 01:06:58 UTC 2012","overview":"<p>Reed Rogala is a man of many pursuits. He busies himself with horticulture, glassblowing, higher education and much more. He graduated from the University of Wisconsin after intensely studying the field of agriculture. His time learning under experienced professors gave him a greater appreciation for all living things. </p>\n\n<p>After learning so much about growing, it was only a matter of time before he found himself practicing his own gardening. Reed Rogala never saw himself as having a green thumb, but he built the skills necessary. Now he is one of the chief people behind the growing rooftop gardening movement. Practicing what he preaches, he has had  impressive gardens atop  buildings in which he resided. He and his neighbors attributed the better air quality to this endeavor.</p>\n\n<p>Everywhere he goes, he encourages people to look for gardening space. Through the scientific method of hydroponics, gardening can take place anywhere. Hydroponics is the practice of gardening without soil. In place of traditional soil, many other mediums can be used. Clay pebbles, gravel, and glass marbles are all excellent substitutes. He prefers to suspend the roots of plants in water. No matter the style, nutrient solutions are added to the water to ensure healthy, developed plants.</p>\n\n<p>When Reed Rogala isn’t tending to his garden, he can be found blowing glass. He likes to forge all manner of pieces. He sometimes makes vases or containers for his plants. But more often he makes works that are merely meant for appreciation for the sake of art.  He has received a great amount of praise for these works. </p>\n\n<p>Reed Rogala is a multi-talented professional. He employs his services for people around the city, as well as for his own efforts. He frequently leads discussions and lectures encouraging city gardening on rooftops and elsewhere. He hopes that through continued attention, cities will increase space devoted to gardens. But for now, Reed Rogala hopes that more people will pledge themselves to cultivating rooftop gardens.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0021/7361/217361v2-max-150x150.png"],[[250,153],"assets/images/resized/0021/7361/217361v2-max-250x250.png"],[[260,160],"assets/images/resized/0021/7361/217361v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}