{"first_name":"Reggie","last_name":"Best","permalink":"reggie-best","crunchbase_url":"http://www.crunchbase.com/person/reggie-best","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Aug 19 13:26:00 UTC 2011","updated_at":"Fri Aug 19 13:27:55 UTC 2011","overview":"<p>Reggie Best oversees day-to-day operations, handling the company’s sales and marketing expansion and venture capital initiatives. He plays a key role in the development and rollout of ProtoSphere 2.0, the company’s state-of-the-art social environment for highly effective online teaming. Reggie has 25 years of experience in telecommunications, data networking, and IT security. This includes venture capital fundraising, team creation, sales channel development, mergers and acquisitions, executive and general management, and product strategy and development, particularly within early- to growth-stage and venture-financed companies. Reggie has founded three companies and successfully led them to M&amp;A, including Teleos Communications, AccessWorks Communications, and Netilla Networks. Under his leadership, Netilla grew to a $10 million annual run-rate, and became widely known as a pioneer in the SSL VPN and application security marketplace. Netilla later merged with AEP Systems to form AEP Networks, of which Best became COO. This was his most recent post before joining ProtonMedia.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President/COO","firm":{"name":"ProtonMedia","permalink":"protonmedia","type_of_entity":"company","image":{"available_sizes":[[[150,77],"assets/images/resized/0005/2920/52920v1-max-150x150.jpg"],[[169,87],"assets/images/resized/0005/2920/52920v1-max-250x250.jpg"],[[169,87],"assets/images/resized/0005/2920/52920v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}