{"first_name":"Reggie","last_name":"Bradford","permalink":"reggie-bradford","crunchbase_url":"http://www.crunchbase.com/person/reggie-bradford","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"PeopleJar","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Nov 02 11:57:42 UTC 2007","updated_at":"Thu Apr 07 18:59:33 UTC 2011","overview":"<p>Founder and CEO Reggie Bradford brings nearly two decades of experience as an industry pioneer, having blazed a successful path for technology companies under his leadership. With funding from General Catalyst Partners and later from Comcast Interactive Capital and Turner Broadcasting-Bradford founded Vitrue in 2006 to help brands and consumers connect more meaningfully with each other through online social networking and user-generated video. The company currently boasts a growing roster of customers that represent some of the world&#8217;s leading media companies and consumer brands. Most recently, Vitrue was named to Business 2.0&#8217;s &#8220;Next Net&#8221; Top 25 for 2007.</p>\n\n<p>Bradford&#8217;s leadership experience spans 16 years in the consumer packaged goods, Internet and television industries. Prior to Vitrue, he was President and a member of the board at TANDBERG Television, an organization of more than 400 employees and over $100 million in revenues. In his 14-month tenure, he led the company to a 40% annual growth rate, successfully integrated two major acquisitions and led the global repositioning of the re-launched brand.</p>\n\n<p>Bradford also served as President and CEO of N2 Broadband, the leading provider of open-platform, on-demand entertainment solutions. During his tenure, N2 Broadband grew annual revenues from less than $1 million to more than $35 million in just under five years. The company, which achieved cash-flow profitability during the same period, boasts a customer roster that includes the world&#8217;s top 10 cable operators and the world&#8217;s leading entertainment companies Bradford was named one of Television Week&#8217;s &#8220;10 to Watch&#8221; for 2005.</p>\n\n<p>Prior to joining N2 Broadband, Bradford served as Chief Marketing Officer at WebMD from 1998 to 2000. During his tenure there, the company grew from 40 to 4,000 employees and received more than $2 billion in funding. While at WebMD, Reggie was instrumental in defining interactivity on the web as an early pioneer of social communities. WebMD later became one of the world&#8217;s leading Internet destinations with over 38 million unique visitors a month. He previously held various marketing and management positions with Miller Brewing Company, a subsidiary of Phillip Morris.</p>\n\n<p>Bradford received a BBA in Finance from the University of Georgia and an MBA from Emory University. He and his wife Holly have six children.</p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0012/9677/129677v1-max-150x150.jpg"],[[250,167],"assets/images/resized/0012/9677/129677v1-max-250x250.jpg"],[[327,219],"assets/images/resized/0012/9677/129677v1-max-450x450.jpg"]],"attribution":"<p>Vitrue</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Executive Officer","firm":{"name":"Vitrue","permalink":"vitrue","type_of_entity":"company","image":{"available_sizes":[[[142,92],"assets/images/resized/0000/1795/1795v1-max-150x150.jpg"],[[142,92],"assets/images/resized/0000/1795/1795v1-max-250x250.jpg"],[[142,92],"assets/images/resized/0000/1795/1795v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}