{"first_name":"Reka","last_name":"Vaughn","permalink":"reka-vaughn","crunchbase_url":"http://www.crunchbase.com/person/reka-vaughn","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Lovetropolis.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jun 18 17:18:11 UTC 2009","updated_at":"Mon Aug 24 21:22:35 UTC 2009","overview":"<p>Ms. Vaughn has considerable service experience in positions of increasing responsibility in the public sector.  With almost 15 years of dedicated service in the tertiary sector, Ms. Vaugn is skilled in communicating essential information and delivering service and professional attention to identified recipients.  Recently, Ms. Vaughn was formally recognized by the U.S. Department of Homeland Security for her instrumental contributions during one of Barack Obama&#8217;s overnight campaign visits in Michigan.</p>\n\n<p>Ms. Vaughn received her Bachelor’s of Science Degree in Public Administration from Eastern Michigan University and will complete a Master&#8217;s Degree in Technology Studies in spring of 2010.</p>\n\n<p>As Executive Department Assistant, Ms. Vaughn is responsible for providing administrative and clerical support to executive officers and key department managers, accumulating and coordinating data, preparing and/or processing input for reports, maintaining records and files, cataloging and maintaining multiple indicative data fields, consolidating data in areas of responsibility for inclusion in department reports and maintaining files and records related to specific reporting activity.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Executive Department Assistant","firm":{"name":"Lovetropolis.com","permalink":"lovetropolis-com","type_of_entity":"company","image":{"available_sizes":[[[150,22],"assets/images/resized/0004/9655/49655v2-max-150x150.png"],[[250,36],"assets/images/resized/0004/9655/49655v2-max-250x250.png"],[[450,66],"assets/images/resized/0004/9655/49655v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}