{"first_name":"Relentless Bill","last_name":"Robinson","permalink":"relentless-bill-robinson","crunchbase_url":"http://www.crunchbase.com/person/relentless-bill-robinson","homepage_url":"http://www.relentlessmarketing.com","birthplace":"White Plains, NY","twitter_username":"RelentlessBill","blog_url":"http://www.huffingtonpost.com/billrobinson","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1958,"born_month":11,"born_day":30,"tag_list":"","alias_list":null,"created_at":"Tue Sep 13 20:55:00 UTC 2011","updated_at":"Thu Dec 29 20:29:04 UTC 2011","overview":"<p>Bill lives in New York and has written columns, articles and cover stories for The Huffington Post, FORTUNE Small Business, The Wall Street Journal Europe, Marketing Magazine (UK), the Financial Times, Cisco System’s iQ Magazine, Business 2.0, Forbes.com, The Moscow Times, United Airline’s Hemispheres Magazine and Upside Magazine, amongst many others. He has appeared frequently on CNN, PBS, Bloomberg, BBC World and had his own segment on SKY News and speaks, moderates and chairs technology, marketing and business conferences worldwide. Bill’s “TechScape” column on the Register won broad accolades and his “On Location” columns for Upside won multiple prestigious ASBPE awards and gave him an understanding and love of global technology.</p>\n\n<p>In traveling the world as a journalist, Bill Robinson has learned about technology and future technologies that he is sure will shape our future world. During the two years he wrote his “On Location” column for Upside Magazine and then in writing his column on next-generation devices for the Wall Street Journal Europe, Bill traveled to over 76 cities in 44 countries covering technology, biotech, venture capital/investment, incubators, economic development, the Internet, hardware, software, wireless technologies, Bluetooth, the media and convergence devices of the future for his writings and SKY News segment.</p>\n\n<p>Bill has interviewed more than 200 Global CEO&#8217;s and many luminaries in business, technology and science including: Bob Pittman, former CEO of AOL &amp; COO of AOL/Time-Warner; Charles Schwab for PBS; Sven-Christer Nilsson, former CEO of Ericsson; Ambassador Andrew Young; Sir Arthur C. Clarke while in Colombo, Sri Lanka for SKY News; Marc Andreessen, founder of Netscape; Lord Tim Bell; Jim Yost, CIO of Ford Motor Company; Jan Carlzon, former CEO of SAS Airlines and management legend; and Vint Cerf, a “Father of the Internet”; among others. Bill now counts these important men as friends. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}