{"first_name":"Rene","last_name":"Seifert","permalink":"rene-seifert-2","crunchbase_url":"http://www.crunchbase.com/person/rene-seifert-2","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jan 29 23:27:14 UTC 2009","updated_at":"Thu Jan 29 23:27:14 UTC 2009","overview":"<p>René Seifert (37) is the founder and Managing Director of Level 360 Services in Bangalore, a &#8220;flat world&#8221;-consultancy for software outsourcing and media-tech investment to India. In addition, René has been involved in founding and incubating several internet and tech-companies, also as part of the investor-network MumbaiAngels.</p>\n\n<p>René, half German and half Croatian, began his career hosting radio shows and running a small advertisement agency parallel to his studies. He was head of marketing and presenter at the radio station Bayern 3. One of his most challenging experiences had been reporting as a wartime-correspondent for the radio network ARD from the Kosovo-conflict in former Yugoslavia. During the &#8220;new economy&#8221; he headed the entertainment department at the internet portal Lycos Europe, after which he took one year off for a sabbatical to travel the world.</p>\n\n<p>René is a member of the Entrepreneurs&#8217; Organization (chapter Bangalore) and a regular blogger under reneseifert.com. He holds a Master&#8217;s Degree in Economics and Management from the University of Augsburg. In his free time he enjoys flying with his pilot license, reading, supporting the Vatsalya Orphanage in Bangalore and - of course - travelling.</p>","image":{"available_sizes":[[[102,150],"assets/images/resized/0003/5272/35272v1-max-150x150.jpg"],[[170,250],"assets/images/resized/0003/5272/35272v1-max-250x250.jpg"],[[240,351],"assets/images/resized/0003/5272/35272v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}