{"first_name":"Reo","last_name":"Kobayashi","permalink":"reo-kobayashi","crunchbase_url":"http://www.crunchbase.com/person/reo-kobayashi","homepage_url":"","birthplace":"Japan","twitter_username":"kobe037","blog_url":"http://reokobayashi.tumblr.com","blog_feed_url":"","affiliation_name":"My Eskimo Friend","born_year":1974,"born_month":6,"born_day":19,"tag_list":"creative, strategy, marketing, branding, design","alias_list":null,"created_at":"Mon May 21 14:13:24 UTC 2012","updated_at":"Tue May 29 01:51:26 UTC 2012","overview":"<p>Reo Kobayashi succeeds in creating communications that are cross-cultural and geographically boundless by striving to uncover the fundamental and universal concepts in any presentation or design. Born in Tokyo and raised in Los Angeles, Reo brings an Eastern heritage and philosophical base to bear on a Western outlook. Through the blending of these sometimes disparate social views, Kobayashi seeks to distill the most complex ideas into simple aesthetics and concepts, uncovering universally applicable tenets. He is noted for his strategic, motivational management style resulting in high levels of team productivity. His exceptional communication, presentation and interpersonal skills, marketing and sales mentality has led him into many successful ventures for the global lifestyle market of consumers and brands.\nSpecialties</p>\n\n<p>Creative strategies and marketing, branding and identity, transformations in design thinking, developing innovative new ideas and concepts with high-impact immersive content for companies and brands.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Creative Producer / Strategist","firm":{"name":"My Eskimo Friend","permalink":"my-eskimo-friend","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.facebook.com/kobe037","title":""},{"external_url":"http://www.twitter.com/kobe037","title":""}]}