{"first_name":"Reshma","last_name":"Saujani","permalink":"reshma-saujani","crunchbase_url":"http://www.crunchbase.com/person/reshma-saujani","homepage_url":"http://www.reshma2010.com/","birthplace":"United States","twitter_username":"reshma2010","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Wed May 12 22:51:18 UTC 2010","updated_at":"Wed May 12 22:51:18 UTC 2010","overview":"<p>Reshma Saujani is running for Congress in New York’s 14th congressional district.  Her parents, originally of Indian origin, barely escaped the brutal regime of Idi Amin in Uganda and came to the United States with almost nothing. Reshma paid her way through college with student loans, receiving her undergraduate degree at the University of Illinois, her Masters in Public Policy from Harvard University’s Kennedy School of Government, and her law degree from Yale University.</p>\n\n<p>She was an associate at Davis Polk &amp; Wardwell while volunteering on social justice cases, including asylum cases to ensure legal representation for the most vulnerable defendants.  She worked with community organizers to register young voters across New York City and volunteered with the New York Bar Association after the enactment of the Patriot Act to offer free legal services to documented immigrations in Queens.  Before running for Congress, she was deputy general counsel of the liquid markets business at Fortress Investment Group. </p>\n\n<p>Throughout her campaign, Reshma has focused on comprehensive immigration reform and the need for innovation and entrepreneurship to create jobs.  She also has pledged not to accept any corporate PAC money because she&#8217;s committed to ending special interest influence in politics.  </p>\n\n<p>Source: Reshma For Congress</p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0008/6958/86958v1-max-150x150.jpg"],[[150,100],"assets/images/resized/0008/6958/86958v1-max-250x250.jpg"],[[150,100],"assets/images/resized/0008/6958/86958v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.reshma2010.com/","title":"Campaign page"}],"web_presences":[]}