{"first_name":"Restaurant","last_name":"Dashboard","permalink":"restaurant-dashboard","crunchbase_url":"http://www.crunchbase.com/person/restaurant-dashboard","homepage_url":"http://www.restaurantdashboard.net/","birthplace":"","twitter_username":"restaurantdashb","blog_url":"http://www.restaurantdashboard.net/","blog_feed_url":"http://www.restaurantdashboard.net/","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"restaurant-marketing, restaurant-online-marketing","alias_list":null,"created_at":"Tue Aug 23 13:03:48 UTC 2011","updated_at":"Fri Aug 26 22:23:10 UTC 2011","overview":"<p>Restaurant Dashboard extends the competence with which the modern capable marketing mediums can be used to promote restaurants or bars. The online platform provides full support to the restaurants to impel new customers and hold the existing ones. </p>\n\n<p>The website uses the very popular LoSo dashboard that posts live updates about restaurants and bars to the popular social networks like Facebook and Twitter. Updates about the happy hours, latest menus and ongoing events are immediately reflected through the fan pages on these social networks. Popularity of different restaurants based upon the number of check-ins and loyalty rewards available with various restaurants too are updated in no time.</p>\n\n<p>LoSo dashboard assists restaurant and bar owners in email and SMS marketing campaigns as well. The members signing up with the website can upload their photos, videos and other promotional contents on the website. To make its better, the dashboard offers mobile applications to facilitate location-based advertising for the restaurants. </p>\n\n<p>The company allows each of its members to have a client admin area to manage their restaurant marketing campaigns. Manage your restaurant promotion campaigns using a personal dashboard and encourage your customers make quick reservations.</p>\n\n<p>Visit: - http://www.restaurantdashboard.net/</p>","image":{"available_sizes":[[[84,84],"assets/images/resized/0015/0685/150685v2-max-150x150.jpg"],[[84,84],"assets/images/resized/0015/0685/150685v2-max-250x250.jpg"],[[84,84],"assets/images/resized/0015/0685/150685v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}