{"first_name":"Ric","last_name":"DeAnda","permalink":"ric-deanda","crunchbase_url":"http://www.crunchbase.com/person/ric-deanda","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jan 14 14:16:29 UTC 2011","updated_at":"Fri Jan 14 14:25:08 UTC 2011","overview":"<p>Prior to joining Improving Enterprises, Mr. DeAnda co-founded Expede, Inc. in 1998, that later merged into Valtech Technologies, Inc. in early 1999. Here he served in various senior level positions, culminating in Vice President of North American Operations.</p>\n\n<p>Over this 8 year period Mr. DeAnda assisted Valtech’s CEO Curtis Hite, in buying and integrating both domestic and international companies, as well as, establishing software development centers in the U.S.</p>\n\n<p>Before co-founding Expede, Mr. DeAnda served as the Director of Human Resources in the critical start up phase for ObjectSpace, Inc., an advanced software technology consulting and training firm. There he established the Human Resources function and was integral in the recruitment of key technical staff and senior level executives.</p>\n\n<p>Prior to ObjectSpace, Mr. DeAnda was part of the Microsoft experience where he was instrumental in establishing the Latin American Technical Account Management Division, supporting Mexico, Venezuela, Argentina, Guatemala, Brazil and Puerto Rico. He started his career at NTS, a division of PHH Corporation, where he held several positions with increasing levels of responsibility over a 10 year period, including Production Control Analyst, Data Center Supervisor, Support Systems Manager, Assistant Data Center Manager, and Human Resources Manager.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0011/7313/117313v1-max-150x150.jpg"],[[150,112],"assets/images/resized/0011/7313/117313v1-max-250x250.jpg"],[[150,112],"assets/images/resized/0011/7313/117313v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Vice President of Operations","firm":{"name":"Improving Enterprises","permalink":"improving-enterprises","type_of_entity":"company","image":{"available_sizes":[[[150,55],"assets/images/resized/0011/7307/117307v1-max-150x150.jpg"],[[250,92],"assets/images/resized/0011/7307/117307v1-max-250x250.jpg"],[[251,93],"assets/images/resized/0011/7307/117307v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}