{"first_name":"Ricardo","last_name":"Diaz","permalink":"ricardo-diaz","crunchbase_url":"http://www.crunchbase.com/person/ricardo-diaz","homepage_url":"http://www.promonu.com/","birthplace":"Miami","twitter_username":"roheenaa","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1970,"born_month":6,"born_day":16,"tag_list":"seo-miami, search-engine-optimization-miami, merchant-account-setup, best-seo, seo-company, best-merchant-rates, lowest-merchant-rates, merchant-services","alias_list":null,"created_at":"Tue May 01 12:02:50 UTC 2012","updated_at":"Wed May 23 01:30:20 UTC 2012","overview":"<p>PROMONU SEO Services &amp; Merchant Account Setup</p>\n\n<p>Promonu Company is a marketing consulting group including Merchant Account Setup, Affordable SEO, Web Designing &amp; Developing Company based in South Florida Miami. The company is run by Rick Diaz and it is the support center of several of his projects. Promonu is responsible for the creation and launch of the BidaBing Real Estate Auctioning Network, Mariners Warehouse, MiamianRealty and dozens of other sites. Promonu is ready to help any size company. Project sizes so far have ranged from a couple of hundred dollars to a couple of hundred thousand dollars. Promonu is excited about helping businesses succeed in their online marketing efforts with the help of new search engine optimization techniques. We know what it takes to keep you as a client forever and we strive to do just that. We have the world&#8217;s best and expert website designer and SEO guys who take care of your website. </p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0018/7386/187386v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0018/7386/187386v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0018/7386/187386v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.bidabing.com/","title":"South Florida Real Estate"}]}