{"first_name":"Richard","last_name":"Townsend","permalink":"richard-townsend","crunchbase_url":"http://www.crunchbase.com/person/richard-townsend","homepage_url":"http://www.orglearn.org/","birthplace":"Australia","twitter_username":"rictownsend","blog_url":"http://orglearn.org/career_success_blog/","blog_feed_url":"http://orglearn.org/career_success_blog/feed/","affiliation_name":"Unaffiliated","born_year":1949,"born_month":null,"born_day":null,"tag_list":"orglearn, career-success, resume-form, resume-examples, rictownsend, management-training, blogger, tweeter, web-design, social-media-consultant, seo","alias_list":null,"created_at":"Tue Nov 16 23:14:12 UTC 2010","updated_at":"Sat Nov 20 02:13:40 UTC 2010","overview":"<p>Web design, social media (Twitter, blogging and Facebook), SEO and operates www.orglearn.org Commercial experience includes; senior branch and state positions in sales/marketing and general management in the finance/banking industry in Australia; Owner / Sales Director of a manufacturing business, also in Australia; Creative Director of an advertising agency in Malaysia and Senior Learning Consultant for Ericsson Academy Malaysia. </p>\n\n<p>For the last 12 years operated as an independent ‘Corporate Learning Consultant’ with services being provided to Ericsson Telecommunications in Malaysia, India, Taiwan, China, Japan, Thailand, Vietnam, Singapore, Indonesia and Pakistan. Also written and conducted a programme on ‘Entrepreneurship’ for ‘Perhebat&#8217; an organization for retiring military officers of the Malaysian Armed Forces. Other major projects have included a competency-modeling programme co-developed for Celcom, a mobile telephone operator in Malaysia, a Total Quality Management training programme and consultancy for Bartercard Thailand and Customer Service training for the Australian Commerce and Industry Office in Taipei. Recently conducted ‘Value Adding in Organisations’ for pt Aneka Kimia Raya Indonesia, Management Training for Bureau Veritas Indonesia and Sales training for Sheraton Hotels in Thailand and Taiwan and for The Hotel Mulia Senayan Indonesia. An Emotional Intelligence training course was most recently written and conducted for the US Embassy Indonesia.</p>\n\n<p>In the past delivered lectures to the Australian Society of Accountants, the Queensland TAFE, Taipei University, many Rotary Clubs in Asia and various small business groups. Articles have been published by, The Small Business Guide for the State Government of Victoria (Aust.), The Australian Medical Practitioner, The Australian Accountant, The Pattaya Mail Newspaper and the Website ‘eThailand’. As a writer been instrumental in preparation of lending proposals, advertising campaigns, legal documentation, training courses, authored articles for websites and written sales and marketing letters and procures and ad copy for a number of companies across a wide variety of industries.</p>","image":{"available_sizes":[[[129,150],"assets/images/resized/0011/0524/110524v2-max-150x150.jpg"],[[199,231],"assets/images/resized/0011/0524/110524v2-max-250x250.jpg"],[[199,231],"assets/images/resized/0011/0524/110524v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/rictownsend","title":"Twitter - rictownsend"},{"external_url":"http://en-gb.facebook.com/rictownsend","title":"Facebook - Richard Townsend"},{"external_url":"http://www.linkedin.com/in/rictownsend","title":"Richard Townsend - Linkedin"}]}