{"first_name":"Richard","last_name":"D. Forman","permalink":"richard-d-forman","crunchbase_url":"http://www.crunchbase.com/person/richard-d-forman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Dec 17 13:13:41 UTC 2008","updated_at":"Wed Dec 17 13:17:43 UTC 2008","overview":"<p>Richard D. Forman is the managing member of Health Venture Group, LLC. He also serves as a board member of the New York Angels (newyorkangels.com) , a member led and managed investment group focused primarily on technology based ventures in the Northeast United States. Previously, Mr. Forman was President and CEO of Register.com, Inc. (NASDAQ-RCOM) through June of 2003. During his tenure as CEO of Register.com, Inc., Mr. Forman led the Company through explosive growth and change including:</p>\n\n<p>Grew the employee base from 9 to over 500 employees\nIncreased annual revenue from under $1mm to over $115mm\nSuccessfully completed three (3) acquisitions, including one cross-border EU based acquisition\nReceived the Ernst &amp; Young Entrepreneur of the Year Award (Winner in 2002 and a Finalist in 2000)\nRaised over $150mm through a series of private and public (IPO) offerings of preferred and common stock\nGenerated $100mm in cumulative operating cash flows and achieved 12 quarters of positive operating cash flow\nFrom August 1987 to October 1990, Mr. Forman was a consultant with Booz Allen &amp; Hamilton, Inc., where he helped implement numerous business development and technology strategies. Mr. Forman is a 1987 Cum Laude graduate of the University of Pennsylvania&#8217;s Management and Technology Program, and earned a B.S. in Economics from the Wharton School of the University of Pennsylvania and a B.S. in Electrical Engineering from the Moore School of Electrical Engineering. He also obtained a Masters Degree from New York University&#8217;s Real Estate Institute in 1995. Currently, he sits on the Board of Overseers of the School of Engineering and Applied Sciences of the University of Pennsylvania and is the Chairman of the Dean’s New York Advisory Council.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing Partner ","firm":{"name":"Health Venture Group, LLC","permalink":"health-venture-group-llc","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}