{"first_name":"Rich","last_name":"Hull","permalink":"rich-hull","crunchbase_url":"http://www.crunchbase.com/person/rich-hull","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Blowtorch","born_year":null,"born_month":null,"born_day":null,"tag_list":"blowtorch-ignition-pioneer-media-entertainment-leader-warner-bros--mtv-disney-shes-all-that-avalanche-movies-online-web-variety-hollywood-reporter-growth-turnaround-restructuring-leader-leadership-vision-strategy-dealmaking-finance-board-directors","alias_list":null,"created_at":"Thu Nov 15 21:56:37 UTC 2007","updated_at":"Thu Aug 16 09:27:56 UTC 2012","overview":"<p>Rich Hull is a recognized steward of investor capital who occupies a rare position at the heart of digital media, traditional entertainment, and finance. He has always spotted trends and then led the people and ventures which capitalize on them. </p>\n\n<p>Most recently, Hull correctly identified the explosion of the U.S. Latino demographic, and then sourced and led the investor group which acquired and consolidated multiple film libraries (representing over $60M of production costs) into what is now believed to be the largest Spanish language film library in the nation – 1,000+ films. As CEO of Latin Anywhere, Inc., Hull has transformed a “diamond in the rough” IP catalog previously focused solely on DVD distribution into a licensor of its never-exploited digital and VOD rights by creating new partnerships with Google, Hulu, Vudu, CinemaNow, GoDigital and Lionsgate, among others. Through a restructuring, he wiped out several million dollars of debt, and has now packaged the library for long-term distribution.</p>\n\n<p>In addition, Hull has continued to act as a trusted advisor to major media companies, as well as to more than 25 equity groups (including Goldman Sachs, Bain, Franklin Templeton and many more). For instance, he recently advised on the $660M+ sale of Miramax by Disney, and he advised certain creditors of MGM in the studio’s latest restructuring. Based on these experiences, he co-authored the recent book “Dancing With Digital Natives: Staying in Step With the Generation That&#8217;s Transforming the Way Business Is Done” (Cyberage Books) – the Bronze Award winner in the 2012 Axiom Business Book Awards and a Finalist in the USA Best Books of 2011 Awards.</p>\n\n<p>Previously, Hull was recruited by Ignition Partners, a $2B venture fund comprised of early Microsoft executives, to develop and lead a strategy to build and monetize the asset value of Blowtorch Media &amp; Entertainment. The formerly struggling company had raised $50M to finance and distribute content to young-adult audiences, including film and TV content, advertiser-financed digital content, and digital media applications. Over three years, on behalf of Ignition and Blowtorch’s senior lender, Comerica Bank, Hull and his team successfully recovered a larger than expected portion of the capital.</p>\n\n<p>In the mid-2000’s, Hull became instrumental in crafting Hollywood’s initial shift to online and mobile entertainment, and he successfully innovated new financing vehicles in both the digital and traditional realms. As a media deal maker and digital entertainment expert, Hull led teams from major media companies (such as Warner Bros., Walt Disney, Miramax, MTV Networks, and others) and, in particular, he orchestrated and acted as lead advisor on Universal Studios’ and JPMorgan’s $350M+, multi-picture co-financing fund – one of the first major studio co-financing deals of the recent era.</p>\n\n<p>Hull’s ability to manage large groups from differing backgrounds and to create and communicate simple solutions for complicated problems was developed in his former role as an award-winning film and television producer/financier. Constantly identifying and capitalizing on leading market trends, Hull quickly proved himself as one the most prolific in the business with collaborations that include most major studios and networks. His 20+ produced projects, primarily geared toward teen and young-adult audiences, have collectively grossed hundreds of millions of dollars and range from one of the most successful teen movies in history, She’s All That, to Sony’s Daddy Day Camp, to thought-provoking documentaries such as his collaboration with Halle Berry, For Love of Liberty: The Story of America’s Black Patriots, which won the NAACP Image Award for Best Documentary.</p>\n\n<p>Hull conveys his insights on entertainment through his regular column in eContent Magazine, and through keynote engagements. He has acted as an advisor and expert witness in legal cases concerning media-related claims of hundreds of millions of dollars, and he is a long-time board member, angel investor, and mentor of entrepreneurial media companies.  He serves on the Alumni Board of Directors of Vanderbilt University, and as Co-Chairman of the Board and co-founder of Vanderbilt-in-Hollywood, which places 30+ current Vanderbilt students per year into summer media and entertainment internships in Los Angeles.  </p>","image":{"available_sizes":[[[95,150],"assets/images/resized/0003/0564/30564v7-max-150x150.jpg"],[[159,250],"assets/images/resized/0003/0564/30564v7-max-250x250.jpg"],[[287,450],"assets/images/resized/0003/0564/30564v7-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President","firm":{"name":"Blowtorch","permalink":"blowtorch","type_of_entity":"company","image":{"available_sizes":[[[150,33],"assets/images/resized/0000/2167/2167v1-max-150x150.png"],[[200,45],"assets/images/resized/0000/2167/2167v1-max-250x250.png"],[[200,45],"assets/images/resized/0000/2167/2167v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"","firm":{"name":"The Walt Disney Company","permalink":"the-walt-disney-company","type_of_entity":"company","image":{"available_sizes":[[[150,73],"assets/images/resized/0001/0929/10929v1-max-150x150.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-250x250.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"","firm":{"name":"GetInToo","permalink":"getintoo","type_of_entity":"company","image":null}},{"is_past":false,"title":"","firm":{"name":"Warner Bros.","permalink":"warner-bros","type_of_entity":"company","image":{"available_sizes":[[[150,147],"assets/images/resized/0002/3089/23089v2-max-150x150.jpg"],[[250,245],"assets/images/resized/0002/3089/23089v2-max-250x250.jpg"],[[350,343],"assets/images/resized/0002/3089/23089v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"","firm":{"name":"MTV Networks","permalink":"mtv-networks","type_of_entity":"company","image":{"available_sizes":[[[136,24],"assets/images/resized/0002/0494/20494v2-max-150x150.png"],[[136,24],"assets/images/resized/0002/0494/20494v2-max-250x250.png"],[[136,24],"assets/images/resized/0002/0494/20494v2-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Partner/Co-Founder","firm":{"name":"Avalnache! Entertainment","permalink":"avalnache-entertainment","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}