{"first_name":"Richard","last_name":"Fox","permalink":"richard-fox","crunchbase_url":"http://www.crunchbase.com/person/richard-fox","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 21 20:01:23 UTC 2008","updated_at":"Fri Nov 21 20:10:16 UTC 2008","overview":"<p>Richard Fox is a managing director of Cross Atlantic and has been with the firm since 1999. He oversees the activities of two dedicated funds managed by Cross Atlantic: The Co-Investment 2000 Fund, L.P. and The Co-Investment Fund II, L.P.   Richard has worked closely with entrepreneurs in multiple portfolio companies in a wide variety of different industries and has served as a director on the board of numerous companies.  </p>\n\n<p>Richard has over 25 years of investment experience in venture capital, institutional investing, and commercial banking. Prior to joining Cross Atlantic, he was president of Penn Janney Advisory, which managed both the direct private equity and partnership investments for The Penn Mutual Life Insurance Company and its wholly owned subsidiary, Janney Montgomery Scott. Before joining Penn Mutual, he was a vice president in the corporate lending division of PNC Bank and managed a portfolio of large corporate relationships.  Richard began his career with Chemical Bank&#8217;s (now J. P. Morgan&#8217;s) Latin American Division, where he held a number of management positions. He serves as an adjunct associate professor at New York University , where he teaches seminars on credit analysis to both domestic and foreign bankers.  </p>\n\n<p>Richard received a B.A. from the University of Connecticut and an M.A. from Georgetown University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"managing director","firm":{"name":"Cross Atlantic Capital Partners","permalink":"cross-atlantic-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,67],"assets/images/resized/0002/9155/29155v1-max-150x150.jpg"],[[215,97],"assets/images/resized/0002/9155/29155v1-max-250x250.jpg"],[[215,97],"assets/images/resized/0002/9155/29155v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}