{"first_name":"Richard S.","last_name":"Cherry","permalink":"richard-cherry","crunchbase_url":"http://www.crunchbase.com/person/richard-cherry","homepage_url":"http://www.thenowmall.com","birthplace":"Toronto, ON","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"marketing, business, fulfillment, shopping, restaurant, grocery, retail, patent","alias_list":null,"created_at":"Wed Sep 02 22:19:42 UTC 2009","updated_at":"Fri Sep 04 21:06:44 UTC 2009","overview":"<p>Richard is a founder of TheNowMall.com (NOW), a patented technology-enabled, Internet-based Network using proprietary wireless technology.  NOW links stores and restaurants with neighborhood consumers with rapid order fulfillment usually in 30 to 45 minutes via independent CyberValet® Shoppers.</p>\n\n<p>Richard is also the senior founder of Willow CSN (now Arise.com), the pioneer in virtual off-premise staffing for major call centers for which Richard patented the technologies and business method.</p>\n\n<p>Richard has over 30 years experience with consumers, major national restaurants, grocers and retailers as well as CyberValet Shoppers, franchise systems, call centers and delivery (fulfillment) systems in the U.S. and Canada. </p>\n\n<p>Richard has numerous patents for products used worldwide by the beverage and food processing industry, as well as plastic shipping containers.</p>\n\n<p>Richard recently received a Smithsonian Award for his developments in Internet-related innovative use of technology. He also received a President&#8217;s Task Force Award for Employment of Adults with Disabilities  for his efforts creating employment for thousands of such people.  Richard received an Entrepreneur of the Year Award and an Environmental Award for his patented plastic shipping containers that saved trees instead of destroying them as did conventional cardboard boxes. </p>","image":{"available_sizes":[[[76,150],"assets/images/resized/0005/8615/58615v2-max-150x150.jpg"],[[127,250],"assets/images/resized/0005/8615/58615v2-max-250x250.jpg"],[[131,257],"assets/images/resized/0005/8615/58615v2-max-450x450.jpg"]],"attribution":"<p>Richard Cherry</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}