{"first_name":"Richard","last_name":"Butler-Creagh","permalink":"richard-butler-creagh","crunchbase_url":"http://www.crunchbase.com/person/richard-butler-creagh","homepage_url":"http://www.richardbutlercreagh.com/","birthplace":"Bristol, UK","twitter_username":"richardcreagh1","blog_url":"http://richardbutlercreagh.wordpress.com/2012/07/16/richard-butler-creagh-property-developer-and-consultant/","blog_feed_url":"","affiliation_name":"Mainstream Management (UK) Limited","born_year":1963,"born_month":null,"born_day":null,"tag_list":"richard-butler-creagh, property-management, real-estate, investments, mainstream-management, consulting","alias_list":null,"created_at":"Tue Sep 11 14:49:35 UTC 2012","updated_at":"Tue Sep 18 16:58:43 UTC 2012","overview":"<p>Buying, refurbishing and managing prime London properties are all in the scope of daily business for Richard Butler-Creagh. This experienced real estate broker has been active in the field since 1985, first as an independent property developer and currently as a main shareholder and consultant with Mainstream Management and its finance division, Mainstream Commercial Finance, which he established.  </p>\n\n<p>Butler-Creagh started his career in real estate in the mid-1980s, after finding he had an eye for properties that, although in good locations, were being sold below their market worth as a result of their run-down condition and need for repair. The acquisition of these properties, refurbishing and then reselling them led to a business with this as its prime focus, and the accumulation of a considerable portfolio. In 2003 Richard Butler-Creagh took up a position with Mainstream Management as a consultant, responsible for acquisition and resale, and building projects. He is also a main shareholder in the company. A typical project under Butler-Creagh’s responsibility is one such as the property at 53 Fitzroy Park in Highgate. This prime property, overlooking Hampstead Heath, is being remodelled to include a large family home built with modern technologies and materials, and designed to integrate with the environment. During his years as an independent developer, Richard Butler-Creagh established solid relations with banking and mortgage establishments, and learned to overcome many of the difficulties and challenges posed by the acquisition of property. In 2006 he applied this knowledge to the establishment of a new division of Mainstream Management, Mainstream Commercial Finance Ltd. This division provides the company’s clients with support for the financing process, including examining the various financing options available – bespoke loans, short-terms financing or interim loans, among others – and finding the financing best suited to the particular customer’s requirements. Mainstream Commercial Finance also offers its own broker solutions and, in most cases, does not charge arrangement or redemption fees. Mainstream Commercial Finance fills a need that Richard Butler-Creagh felt was lacking in the market.</p>\n\n<p>Richard Butler-Creagh works hard and plays hard. He is a member of the elite member-only Henley 100 and Royal Automobile clubs, and is an avid sportsman, and a keen sailor. He owns a yacht – the Carpe Diem – which he has sailed across the Atlantic Ocean to Barbados, and also enjoys skiing. Marathon running is another sport in which Richard Butler-Creagh participates, and he has run the London marathon, completing it in slightly more than three and a half hours. He recently combines sports with fundraising for the Sue Ryder Hospice where his friend Anthony Head recently died of cancer. Together with Anthony’s father, who is blind, he rode tandem in a 35 km ride from Henley on Thames, to Peppard, passing through Nettlebed, where the hospice is located. Butler-Creagh and Head started training together a few weeks prior to the ride as the former had never ridden a tandem bicycle. </p>\n\n<p>Henley on Thames is home today to Richard Butler-Creagh, who was born in Bristol. He is married to Charlotte, and they have two young children. Some leisure time is also spend at home, where he enjoys cooking. </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0021/0875/210875v2-max-150x150.jpg"],[[167,250],"assets/images/resized/0021/0875/210875v2-max-250x250.jpg"],[[300,448],"assets/images/resized/0021/0875/210875v2-max-450x450.jpg"]],"attribution":"<p>Richard Butler-Creagh</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Consultant and Main shareholder","firm":{"name":"Mainstream Management (UK) Limited","permalink":"mainstream-management-uk-limited","type_of_entity":"company","image":null}},{"is_past":false,"title":"Consultant and Main shareholder","firm":{"name":"Mainstream Commercial Finance Ltd","permalink":"mainstream-commercial-finance-ltd","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.henleystandard.co.uk/news/news.php?id=1107503","title":"Richard Butler Creagh and the 35km cycle ride"},{"external_url":"http://www.henleystandard.co.uk/news/news.php?id=37529","title":"Blind man completes 35km bike ride "}],"web_presences":[{"external_url":"http://www.4networking.biz/Members/Details/84496","title":"4Networking"},{"external_url":"http://peoplepond.com/richardbutlercreagh","title":"PeoplePond"},{"external_url":"http://www.visualcv.com/richardbutlercreagh","title":"Visual CV"},{"external_url":"http://butlercreagh.gather.com/","title":"Gather"}]}