{"first_name":"Richard","last_name":"Garriott","permalink":"richard-garriott","crunchbase_url":"http://www.crunchbase.com/person/richard-garriott","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Portalarium","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 19 04:07:54 UTC 2011","updated_at":"Fri Jul 27 21:32:59 UTC 2012","overview":"<p>Richard was born in the UK to American parents while his father, Owen, was a Cambridge professor and was raised in Houston when his dad became a NASA scientist-astronaut. So, one might say that Richard was destined for lofty aspirations, also incorporating plenty of his mother&#8217;s artistic talents along the way. Under his gaming nom de plume, Lord British, he programmed his first computer game, Akalabeth, for the Apple II in 1980. Thereafter he launched the first installment in his legendary fantasy role play game series, Ultima, through his own game company, ORIGIN Systems, founded with his brother, Robert. Success came quickly and prompted Richard to drop out of his studies at the University of Texas to pursue computer game creation full time.</p>\n\n<p>The Ultima series enjoyed a prosperous nine-edition run before giving way to the groundbreaking, Ultima Online, widely regarded as the first commercially successful massively multiplayer online game (MMOG) and is still providing fun for many thousands today in 2010 as a product of Electronic Arts. Richard went on to found a new game studio, Destination Games, which was acquired by NCsoft, and there he remained working on the online game Tabula Rasa until it launched in 2007.</p>\n\n<p>He then set his sights on outer space. After a year of intense training, Richard blasted off in October 2008 to the International Space Station (ISS) on Soyuz TMA-13 through another of his ventures, Space Adventures. That 12-day excursion proved to be a life-changing experience. Richard&#8217;s story &#8211; from growing up as the son of an astronaut, to building a computer gaming franchise and empire, to his wonderous journey to the ISS &#8211; has just been chronicled in a full-length 2010 documentary feature film, Richard Garriott: Man On A Mission which debuted at the 2010 South-by-Southwest Film Festival.  Richard also hosts a British-based learning website in conjunction with the U.K Space Agency, GovEd Communications and many other partners called Our Space - Digital Adventures In Space. </p>\n\n<p>Since his return to earth Richard has set about greening his entire lifestyle footprint and dedicating himself to projects that will help improve the world through the privatization of space travel and improved personal ground transportation. But games, fun and adventure remain a vital part of his daily routine so he will be closely involved in Portalarium&#8217;s evolution, including the design and development of several yet-to-be-announced premium titles which will take him back to his gaming roots while advancing the state of gameplay in social networking environments.</p>","image":{"available_sizes":[[[139,150],"assets/images/resized/0014/4941/144941v1-max-150x150.jpg"],[[232,250],"assets/images/resized/0014/4941/144941v1-max-250x250.jpg"],[[417,450],"assets/images/resized/0014/4941/144941v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder, Executive Vice President","firm":{"name":"Portalarium","permalink":"portalarium","type_of_entity":"company","image":{"available_sizes":[[[150,32],"assets/images/resized/0013/7301/137301v1-max-150x150.jpg"],[[250,53],"assets/images/resized/0013/7301/137301v1-max-250x250.jpg"],[[321,69],"assets/images/resized/0013/7301/137301v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}