{"first_name":"Richard","last_name":"Huey","permalink":"richard-huey","crunchbase_url":"http://www.crunchbase.com/person/richard-huey","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 03 18:34:47 UTC 2008","updated_at":"Tue Jun 03 18:38:11 UTC 2008","overview":"<p>Dick Huey started Toolshed Incorporated in 2001, with the idea that compelling music content from independent labels and artists, bundled and creatively delivered, could compete strongly for online promotional and sales space. Toolshed provides new media promotion, digital licensing, and online strategy services to a select list of Media and Entertainment clients, as well as state-of-the-art digital promotion tools. Toolshed&#8217;s clients depend on Toolshed to keep them at the forefront of industry initiatives and opportunities. Toolshed has also handled online audio and video promotion for artists as diverse as Ani DiFranco, Stephen Malkmus, XTC, Richard Thompson, Cat Power, Sleater-Kinney, and many others. Prior to creatng Toolshed, Dick started and for five years developed and ran the new media department at the Beggars Group of independent record labels (XL Recordings, Matador Records, Beggars Banquet, 4AD). One of his high-profile Beggars Group accomplishments is the AVDeck Internet radio station, one of several featured QT radio stations at Apple.com.</p>\n\n<p>Dick is a Soundexchange Board member, representing Matador Records, serving on the licensing, policy, and new business committees. He also served on the creditors committee for the Napster bankruptcy. He is a new media committee member for the American Association of Independent Music (A2IM) headquartered in New York. In addition, he is the chairperson and co-founder of INMPA (Independent New Media Professional Association), a New York based professional organization that claims as members new media directors from a large number of top independent record labels in the United States. INMPA provides a forum for discussion of new media opportunities to a cross-section of the independent label community, and also assists in the professional development and profile of its members. Dick graduated from the University of Michigan in 1985 with a concentration in International Business, and speaks Swedish and German as second and third languages.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"New Media Marketing / TuneCore Technical Advisor","firm":{"name":"TuneCore","permalink":"tunecore","type_of_entity":"company","image":{"available_sizes":[[[150,121],"assets/images/resized/0001/9897/19897v1-max-150x150.png"],[[250,202],"assets/images/resized/0001/9897/19897v1-max-250x250.png"],[[285,231],"assets/images/resized/0001/9897/19897v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}