{"first_name":"Richard","last_name":"M. Stallman","permalink":"richard-m-stallman-2","crunchbase_url":"http://www.crunchbase.com/person/richard-m-stallman-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jan 23 11:50:03 UTC 2011","updated_at":"Sun Jan 23 11:54:30 UTC 2011","overview":"<p>Richard is a software developer and software freedom activist. In 1983 he announced the project to develop the GNU operating system, a Unix-like operating system meant to be entirely free software, and has been the project&#8217;s leader ever since. With that announcement Richard also launched the Free Software Movement. In October 1985 he started the Free Software Foundation.</p>\n\n<p>Since the mid-1990s, Richard has spent most of his time in political advocacy for free software, and spreading the ethical ideas of the movement, as well as campaigning against both software patents and dangerous extension of copyright laws. Before that, Richard developed a number of widely used software components of the GNU system, including the original Emacs, the GNU Compiler Collection, the GNU symbolic debugger (gdb), GNU Emacs, and various other programs for the GNU operating system.</p>\n\n<p>Richard pioneered the concept of copyleft, and is the main author of the GNU General Public License, the most widely used free software license.</p>\n\n<p>Richard graduated from Harvard in 1974 with a BA in physics. During his college years, he also worked as a staff hacker at the MIT Artificial Intelligence Lab, learning operating system development by doing it. He wrote the first extensible Emacs text editor there in 1975. He also developed the AI technique of dependency-directed backtracking, also known as truth maintenance. In January 1984 he resigned from MIT to start the GNU project.</p>","image":{"available_sizes":[[[126,150],"assets/images/resized/0011/8636/118636v1-max-150x150.jpg"],[[210,250],"assets/images/resized/0011/8636/118636v1-max-250x250.jpg"],[[300,357],"assets/images/resized/0011/8636/118636v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President","firm":{"name":"Free Software Foundation","permalink":"free-software-foundation-2","type_of_entity":"company","image":{"available_sizes":[[[150,25],"assets/images/resized/0011/8634/118634v1-max-150x150.jpg"],[[250,42],"assets/images/resized/0011/8634/118634v1-max-250x250.jpg"],[[299,51],"assets/images/resized/0011/8634/118634v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}