{"first_name":"Richard","last_name":"J. Dumler","permalink":"richard-j-dumler","crunchbase_url":"http://www.crunchbase.com/person/richard-j-dumler","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Nov 22 18:12:33 UTC 2008","updated_at":"Thu Jan 07 22:13:16 UTC 2010","overview":"<p>Richard Dumler joined Milestone Venture Partners in January 2002 following 34 years in the venture capital industry. He is actively involved in all of Milestone’s investment decisions. He represented MVP on the boards of directors of Premise and CareGain until each company was profitably sold to Eclipsys Corp. (Nasdaq: ECLP) and Fiserv, Inc. (Nasdaq: FISV), respectively.  He currently sits on the boards of Worktopia and Searchandise, and he monitors dLife, Navtrak, Octagon Research Solutions and OneRiot. His prior investment experience is particularly helpful in sharing insights learned from other start-ups about key marketing, operational, financial and technology decisions.</p>\n\n<p>Prior to joining Milestone, Mr. Dumler served for 20 years as a general partner of the Lambda Funds, which were outside investor venture capital partnerships originally sponsored by the investment-banking firm Drexel Burnham Lambert. Although Lambda invested nationally in a wide range of businesses, Mr. Dumler focused primarily on early-stage technology companies. Lambda had a number of notable successes, such as the leveraged buyout and subsequent IPO of Sungard Data Systems; follow-on investments in Kronos (Nasdaq: KRON]; and the purchase of Environetics out of bankruptcy, which later resulted in a high-multiple sale to IDEXX Laboratories, Inc. (Nasdaq:IDXX).                  </p>\n\n<p>Before working with Lambda, Mr. Dumler was with Bessemer Venture Partners, which he joined as the third partner. While at Bessemer, Mr. Dumler made multiple successful technology-related investments including equity placements in Kronos, Syntrex, Micro Peripherals, and Compumotor, all of which went public or were profitably acquired.  Kronos, which is now the nation’s leading provider of time and attendance software, possesses a market capitalization in excess of $1billion, and the distinction for producing more consecutive years of revenue growth and profitability than any other publicly traded software firm besides Microsoft. Mr. Dumler has been a Kronos director for 25 years.</p>\n\n<p>Mr. Dumler entered the venture capital business at the Allstate Insurance Company in 1968. At the time, Allstate was the largest provider of venture capital in America.  Mr. Dumler made a number of successful investments in the areas of new media and technology.  These investments included Actmedia, ADVO (NYSE: AD), Amdahl, Applicon, Baron Data Systems, and Four Phase Systems - each of which experienced a profitable IPO and/or were acquired at a significantly higher valuation.</p>\n\n<p>Mr. Dumler responded to the extraordinarily challenging economic environment of the 1970’s by developing capital efficient investment strategies. For example, he purchased for Allstate a 20% share in ADVO (at the time, a failed buyout of KKR) for $200,000 plus a $250,000 bank guarantee. He also bought approximately 12% of Actmedia, the pioneer of in-store supermarket advertising now owned by News Corp., for $500,000. Both companies are now billion dollar businesses.  In 1978, Mr. Dumler was promoted to the newly formed Corporate Planning Department at Allstate’s then parent, Sears Roebuck.</p>","image":{"available_sizes":[[[103,150],"assets/images/resized/0004/5148/45148v1-max-150x150.jpg"],[[138,200],"assets/images/resized/0004/5148/45148v1-max-250x250.jpg"],[[138,200],"assets/images/resized/0004/5148/45148v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"","institution":"University of Michigan","graduated_year":1968,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"","firm":{"name":"Milestone Venture Partners","permalink":"milestone-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[98,112],"assets/images/resized/0002/9383/29383v1-max-150x150.jpg"],[[98,112],"assets/images/resized/0002/9383/29383v1-max-250x250.jpg"],[[98,112],"assets/images/resized/0002/9383/29383v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"","firm":{"name":"Allstate","permalink":"allstate","type_of_entity":"company","image":{"available_sizes":[[[150,107],"assets/images/resized/0012/8608/128608v2-max-150x150.png"],[[250,179],"assets/images/resized/0012/8608/128608v2-max-250x250.png"],[[450,322],"assets/images/resized/0012/8608/128608v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}