{"first_name":"Richard","last_name":"Pancoast","permalink":"richard-pancoast","crunchbase_url":"http://www.crunchbase.com/person/richard-pancoast","homepage_url":"http://www.simplyboundless.com","birthplace":"Chicago, Il","twitter_username":"simplyboundless","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1959,"born_month":7,"born_day":4,"tag_list":"entertainment, social-entertainment","alias_list":null,"created_at":"Sat Jan 15 21:49:52 UTC 2011","updated_at":"Sun Mar 04 05:42:44 UTC 2012","overview":"<p>Richard Pancoast is the president of Social Entertainment Site &#8220;Simply Boundless&#8221; (www.simplyboundless.com). Richard has previous experience in the entertainment industry of over 8+ years in music publishing as well as years of experience in various capacity in both marketing &amp; sales. Simply Boundless has a unique vision and we feel we are the future of Social Entertainment destinations.</p>\n\n<p>Simply Boundless focus will be on the fans, and in bringing the the media and digital entertainment they want. This is the just the start for SIMPLY BOUNDLESS, we promise you many more features, programs and improvements to come, all based upon your requests, desires, wants and needs! Fans…together growth in entertainment is Simply Boundless, and our goal is to always strive to bring you the very best in:</p>\n\n<pre><code>* Your personal enjoyment of the entertainment you want\n* Excellent visual or sound quality of your entertainment\n* The ability to purchase your entertainment easily\n* Hours of enjoyment your entertainment will provide\n* The ability to access your entertainment immediately\n* The most advertisement-free entertainment possible\n* Fan engagement, input, co-creation both direct &amp;amp; indirect\n* Creating methods of fan/creator engagement for joint creation of media\n* and so much more\n</code></pre>\n\n<p>Simply Boundless is 100% committed to the fact that we not only have to take into account, (but moreover), benefit from user input and will, to co-create an direct (on content) or indirect (on context) the incremental experience. The fear of fragmenting and decreasing revenue on content and advertising is partially due to the unknown, partially incorrect. We totally believe that it is fan engagement that indirectly fuels advertising revenues. It’s about taking the target groups into consideration in co-creating the Social Entertainment experience, be it in whatever phase of the innovation process. This co-creation point of perspective (also content and formats) can generate revenue. Involve the end-user in shaping the format and consuming that format, and you’ve just killed two birds with one stone: loyalty/engagement and revenue generation in terms of advertising, virtual-goods, revenues and so on.</p>\n\n<p>SIMPLY BOUNDLESS will open up new opportunities for media recommendations, community building, viral marketing, and content sharing.</p>\n\n<p>SIMPLY BOUNDLESS will be your one-stop shop for all of your entertainment and digital media needs. A place where fans can share, discover and consume the things they care about, be it music, movies, television, celebrities, etc.</p>\n\n<p>So come and join us today, the future of your entertainment is limited only by your bounds and is truly SIMPLY BOUNDLESS!</p>\n\n<p>Simply Boundless is currently seeking development &amp; technology partners as well as funding capital. We are looking to be all of what companies like myspace, hulu, crackle, netflix, Kickstarter and more are, and everything they are not, to give users, fans, and industry a direct connect with and to each other to create the most unique fan driven entertainment network ever!</p>\n\n<p>For more information contact Richard at: rick@simplyboundless.com</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.dealerrefresh.com/an-adp-and-reyrey-blitz/","title":""}],"web_presences":[{"external_url":"http://www.simplyboundless.com","title":""}]}