{"first_name":"Richard","last_name":"Holcomb","permalink":"richard-holcomb","crunchbase_url":"http://www.crunchbase.com/person/richard-holcomb","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue May 19 10:33:39 UTC 2009","updated_at":"Tue May 19 10:46:00 UTC 2009","overview":"<p>Richard Holcomb is a serial entrepreneur in the Research Triangle Park, NC area. His newest venture is StrikeIron, Inc. (www.strikeiron.com) a technology company founded in 2002 that is focused on the emerging web services software market, where he served as CEO until December 2005 and is currently Chairman. Prior to founding StrikeIron, he served as the Interim CEO of GadgetSpace, a wireless technology company, and oversaw its successful acquisition by Inphonic (Nasdaq: INPC) in 2001. He was a founder of HAHT Commerce in 1995, a major e-commerce application provider, and served as HAHT&#8217;s first CEO and Chairman prior to its acquisition by GXS. Prior to HAHT, he was a founder of Q+E Software in 1986, a supplier of client-server database access technology, and served as that company&#8217;s CEO, president, and chairman from inception to its acquisition by Intersolv (Nasdaq: ISLI) in 1994.</p>\n\n<p>Mr. Holcomb has been an active angel investor and consultant for several technology companies and venture funds. He is currently a Venture Partner with The Aurora Funds (www.aurorafunds.com) in Durham, NC, and is on the board of the portfolio companies Covelight, Synchris, and Unitrends. He also serves on the corporate boards of several public and private technology companies including Neon Systems (Nasdaq: NEON), ChannelAdvisor, IITS and Ultimus.</p>\n\n<p>Mr. Holcomb has served on several public advisory boards, including the NCSU Graduate School Board of Advisors, the North Carolina Technology Association (NCTA), the Council for Entrepreneurial Development (CED), NCSU Engineering Entrepreneur&#8217;s Program Advisory Board, and is a former appointed member of the North Carolina Information Resource Management Commission (IRMC). During his career, Mr. Holcomb has won several awards including the 1993 Ernst and Young Technology Entrepreneur of the Year for North Carolina and the 1996 Business Leader Top Gun Entrepreneur of the Year.</p>\n\n<p>Mr. Holcomb is also an active environmentalist, organic farmer and restaurateur. He owns Coon Rock Farm, an all organic farm in Hillsborough, NC that primarily produces produce and meat for his organic restaurant venture, Zely &amp; Ritz. Zely &amp; Ritz was named as one of the 20 best organic restaurants in America by Organic Style Magazine and is a winner of Wine Spectator Magazine&#8217;s &#8220;Award of Excellence&#8221;</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0004/4634/44634v1-max-150x150.jpg"],[[107,150],"assets/images/resized/0004/4634/44634v1-max-250x250.jpg"],[[107,150],"assets/images/resized/0004/4634/44634v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"M.S.","subject":"Computer Science","institution":"North Carolina State University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Venture Partner","firm":{"name":"The Aurora Funds","permalink":"the-aurora-funds","type_of_entity":"financial_org","image":{"available_sizes":[[[150,34],"assets/images/resized/0003/0298/30298v1-max-150x150.png"],[[250,58],"assets/images/resized/0003/0298/30298v1-max-250x250.png"],[[271,63],"assets/images/resized/0003/0298/30298v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}