{"first_name":"Richard","last_name":"Melmon","permalink":"richard-melmon","crunchbase_url":"http://www.crunchbase.com/person/richard-melmon","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 05 15:36:17 UTC 2008","updated_at":"Mon Jan 03 21:53:01 UTC 2011","overview":"<p>Richard co-founded NSVG in 2002, and has managed its investment in twelve seed stage companies since 2002, including Broadware (sold to Cisco), BigFix (sold to IBM), Zvents, TubeMogul, Aggregate Knowledge, Superfish, and Shortform.</p>\n\n<p>He advised large Japanese high tech companies on using Silicon Valley methods to transform their firms.  His clients included Sony, Matsushita, Fuji Xerox, Fujitsu, and Konica Minolta.</p>\n\n<p>He has actively participated in the creation and management of a number of companies:  Electronic Arts with Trip Hawkins in 1982, market cap today, $5 Billion; Melmon Tawa &amp; Partners, a high tech advertising agency, in 1985, sold to Livingston and Co. in 1989; Objective Software in 1989, sold to Asymetrix in 1993; Vextec, in 2003, Zvents, in 2005, MyDigitalLife in 2006, Shortform in 2009.</p>\n\n<p>Richard started his career as a physicist building klystron tubes for Varian Associates.\nAfter graduating from Stanford Business School in 1973, he joined Intel, where, as a young marketing manager, he introduced the world’s first mass marketed digital watch (Microma), which convinced him the time was right for building and marketing a personal computer.</p>\n\n<p>Unable to convince Intel’s management, he left to join Regis McKenna Inc. as General Manager, where from 1979 to 1981, he helped launch Apple Computer, 3Com, and Genentech, among others.</p>\n\n<p>While at RMI, the venture capitalist Ben Rosen showed him a prototype of what would become the world’s first spreadsheet, VisiCalc.  Convinced it would change the world, he took on the launching of the company, then called Personal Software.  Soon, he joined the company, which he renamed VisiCorp, where he had the privilege of marketing the world’s number one personal computer software product.\nIn 1982, the prestige by association with VisiCalc allowed him to easily raise money to start Electronic Arts with Trip Hawkins.</p>\n\n<p>Falling out with Trip led him to leave the company and start Melmon Tawa &amp; Partners with Tom Tawa in 1985.  This high tech ad agency launched numerous companies and products, including Xilinx (the first programmable gate array), Stratacom (the inventor of modern packet based technologies leading to the internet as we know it), and Adobe’s Adobe Illustrator.  MT&amp;P also had as clients Sun Microsystems, Atari, Frame Technology, and many of Silicon Valley’s high tech firms.  The agency was sold in 1990 to a large west coast agency.</p>\n\n<p>From his VisiCalc experiences, Richard had a vision of combining the spreadsheet metaphor with a formal relational database back-end.  This led to his formation of Objective Software, the development and launch of the product Spreadbase, and the subsequent sale of the company to Asymetrix in 1993. The product was a precursor to the rise of the data warehouse, and the data analytics market.</p>\n\n<p>He rejoined Regis McKenna as a Partner with The McKenna Group from 1995 to 1998, advising Japanese companies on the impact of the internet.  His clients included all of the major Japanese high technology firms.</p>\n\n<p>He found NSV, a precursor to NSVG, in 1998, to do early stage investing.  His investments included Commerce One, BigFix, Inktomi, Broadware, and others.\nRichard graduated with a B.A. in Physics from the University of California, Berkeley in 1969, and with an M.B.A. from Stanford University in 1973.</p>","image":{"available_sizes":[[[134,150],"assets/images/resized/0011/6109/116109v1-max-150x150.png"],[[224,250],"assets/images/resized/0011/6109/116109v1-max-250x250.png"],[[233,260],"assets/images/resized/0011/6109/116109v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Partner","firm":{"name":"NSV","permalink":"netservice-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,115],"assets/images/resized/0001/9974/19974v5-max-150x150.png"],[[250,193],"assets/images/resized/0001/9974/19974v5-max-250x250.png"],[[450,347],"assets/images/resized/0001/9974/19974v5-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Managing Director","firm":{"name":"Bullpen Capital","permalink":"bullpen-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,29],"assets/images/resized/0011/6091/116091v1-max-150x150.png"],[[181,35],"assets/images/resized/0011/6091/116091v1-max-250x250.png"],[[181,35],"assets/images/resized/0011/6091/116091v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}