{"first_name":"Richard","last_name":"Yanowitch","permalink":"richard-yanowitch","crunchbase_url":"http://www.crunchbase.com/person/richard-yanowitch","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Mig33","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Apr 03 22:45:11 UTC 2008","updated_at":"Mon Feb 09 19:37:38 UTC 2009","overview":"<p>Richard Yanowitch is a successful Silicon Valley entrepreneur with a proven track-record transforming early-stage companies into high-growth market leaders, creating millions of customers, billions of dollars in revenue, and multi-billions of dollars in sustained shareholder value. Since September 2006, he has served as venture partner for Accel Partners, with a particular focus on digital media. He currently serves as an independent director on the boards of video ad network, Yume, and global mobile social network, mig33. </p>\n\n<p>Prior to Accel, Richard served as Vice Chairman of the NDS Group, a $600 million market leader in digital media technologies, and as Senior Consultant to the News Corporation. For nearly five years, he served as Executive Vice President for internet services provider VeriSign, where his team built numerous high-growth businesses and led its international expansion, generating hundreds of millions of dollars in annual revenues. He participated in VeriSign&#8217;s strategic financings, IPO, and acquisitions. VeriSign grew from 30 to 2,500 employees and from $500,000 to $700 million in revenue during this period, creating a multi-billion dollar market valuation. Richard reported to Stratton Sclavos, Chairman and CEO. </p>\n\n<p>Prior to VeriSign, Richard served as Vice President of Corporate Marketing for database provider Sybase, where his team drove core marketing operations, including marketing communications, direct marketing, product marketing, customer acquisition, and international. He participated in Sybase&#8217;s late-stage financings, IPO and acquisitions. Sybase grew from 300 to 5,000 employees and from $10 million to nearly $900 million in annual revenue during this period, generating a multi-billion dollar market valuation. Richard reported to Dr. Stuart Schuster, Executive Vice President. </p>\n\n<p>Prior to Sybase, Richard was Director of Strategic Marketing at UNIX operating system provider The SCO Group, where he was lead negotiator for a breakthrough Microsoft licensing agreement and investment. SCO grew from $5 million to $24 million in revenue during this period, subsequently going public and achieving a half-billion dollar market valuation. Prior to SCO, Richard held various sales, marketing, and management positions with Digital Equipment Corporation and Lanier Harris. He also served as entrepreneur in residence at the venture capital firm IVP. </p>\n\n<p>Richard received a B.A. in the Honors Program for Classical Studies at Swarthmore College and a MBA from the Harvard Business School. He serves on the board of directors of the Bay Area Discovery Museum. He is married to Wendy Shuman Kesser, a former Executive Producer for ABC News in San Francisco, and they have two children. He also serves as a senior advisor to national congressional leaders on economic leadership, entrepreneurialism, and the Internet. \nDixon R. Doll</p>\n\n<p>For more than 35 years, Dixon has influenced and guided entrepreneurs, investors and executives in the computer and communications industries. In recognition of his accomplishments in venture capital, Dixon was named by Forbes Magazine as one of the top 100 venture investors on its Midas List for the past four years, as well as one of the top 100 personalities involved in creating the information highway by Upside Magazine. In April, 2005, he was elected to the Board of Directors of the National Venture Capital Association in Washington, D.C. He was recently appointed to the NVCA Executive Committee, is chairing the 2007 Annual Meeting, and will become NVCA Chairman-elect in April, 2007. </p>\n\n<p>Since the early 1980s, Dixon has been a telecom and Internet venture capital pioneer. In 1996 he launched DCM, an early stage technology venture capital firm which currently has more than $1.5 Billion under management, headquartered in Menlo Park, California. DCM has backed such well known entrepreneurial companies as About.com, @Motion, Clearwire, 51job, Foundry Networks, Internap, Ipivot, Neutral Tandem, PGP Corp., Recourse Technologies, Semiconductor Manufacturing International Corp, and Sling Media. DCM has become widely recognized as one of the top Silicon Valley venture firms actively investing in China and Japan. In the mid-1980s, Dixon cofounded the venture capital industry&#8217;s first fund focused exclusively on telecommunications opportunities. Those funds he organized launched such noteworthy companies as Alantec, Bridge Communication, Centillion Networks, Network Equipment Technologies, Optilink, Picturetel, Polycom, and UUNet. </p>\n\n<p>Prior to becoming a venture capitalist, Dixon was the founder and CEO of an internationally recognized strategic consulting firm focused on telecommunications and computer networking. From 1972 to 1980, Dixon also served as a faculty member of the IBM Systems Research Institute in New York City, and then served on the IBM Networking Systems Organization&#8217;s External Advisory Board from 1983 to 1991. </p>\n\n<p>He has authored two books, and traveled extensively to six continents to give highly sought after lectures and conference presentations. Through their family foundation, he and his wife, Carol, give generously to numerous educational and philanthropic organizations. Among these are, the Asian Art Museum of San Francisco (where he serves as Chair of the museum&#8217;s dual governing boards), San Francisco Symphony, Kansas State University, the University of Michigan Business School, the Papal Foundation, the Boys &amp; Girls Clubs of San Francisco, the Stanford Institute for Economic Policy Research, and the University of San Francisco where he has served as the Investment Committee Chair. He also has served as a trustee or advisory board member for each of these organizations. He received his B.S.E.E. degree (cum laude) from Kansas State University as well as M.S. and Ph.D. degrees in Electrical Engineering from the University of Michigan, where he was a National Science Foundation scholar.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Board of Directors","firm":{"name":"Booyah","permalink":"booyah","type_of_entity":"company","image":{"available_sizes":[[[150,98],"assets/images/resized/0002/6698/26698v6-max-150x150.png"],[[250,164],"assets/images/resized/0002/6698/26698v6-max-250x250.png"],[[450,296],"assets/images/resized/0002/6698/26698v6-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Board of Directors","firm":{"name":"mig33","permalink":"mig33","type_of_entity":"company","image":{"available_sizes":[[[94,54],"assets/images/resized/0000/0490/490v25-max-150x150.png"],[[94,54],"assets/images/resized/0000/0490/490v25-max-250x250.png"],[[94,54],"assets/images/resized/0000/0490/490v25-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.mig33forum.com","title":"Mig33 Forum Community"}]}