{"first_name":"Richard","last_name":"M. Fox","permalink":"richard-m-fox","crunchbase_url":"http://www.crunchbase.com/person/richard-m-fox","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"TMMI (TMM Inc.)","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 21 04:17:51 UTC 2012","updated_at":"Fri Nov 30 04:31:50 UTC 2012","overview":"<p>TMM Inc., on September 27, 2012 announced the appointment of Richard M. Fox to its advisory board, effective September 15, 2012.</p>\n\n<p>Mr. Fox is a Managing Director of Cross Atlantic Capital Partners of Radnor, Pennsylvania, a venture capital firm with $550 million under management. A venture capitalist with extensive co-investment experience in Software, Mobile/Wireless and Internet Technologies, he has in-depth expertise with a wide array of companies including NetSuite, Infoblox, ICG Commerce, R2 Technology, Navini Networks, and Interactions.</p>\n\n<p>He is also currently an Adjunct Associate Professor at NYU in New York, conducting intensive credit seminars for domestic and international banking.</p>\n\n<p>The former President of Penn Janney Advisory, he managed Penn Mutual&#8221;s direct venture capital investments and alternative asset portfolio as well as those of its wholly owned subsidiary, Janney Montgomery Scott. At Penn Janney, he served on the investment advisory boards of numerous alternative asset and private placement funds of over $300 million.</p>\n\n<p>Prior to that, he managed an extensive portfolio of large U.S. corporate relationships as Vice President with PNC Financial Corp. He began his career with Chemical Bank&#8221;s (now JP Morgan Chase) Latin American Division where he managed a $300 million loan portfolio in Puerto Rico and was involved in a number of sovereign debt restructurings.</p>\n\n<p>Mr. Fox is a 1977 graduate of the University of Connecticut (B.A) and Georgetown University (M.A.). </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Advisory Board ","firm":{"name":"TMMI (TMM Inc.)","permalink":"tmm-inc","type_of_entity":"company","image":{"available_sizes":[[[150,40],"assets/images/resized/0018/6335/186335v10-max-150x150.png"],[[250,67],"assets/images/resized/0018/6335/186335v10-max-250x250.png"],[[250,67],"assets/images/resized/0018/6335/186335v10-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}