{"first_name":"Richard","last_name":"P. Kuntz","permalink":"richard-p-kuntz","crunchbase_url":"http://www.crunchbase.com/person/richard-p-kuntz","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Nov 30 17:45:02 UTC 2008","updated_at":"Sun Nov 30 17:49:45 UTC 2008","overview":"<p>Richard Kuntz, a Managing Director of Shepherd Ventures, has more than 20 years of private equity and venture capital experience, including startup, early stage, mezzanine, and buyout investments. Rich has also had operational, financial, and strategic planning responsibility for various startup and early stage life science ventures, most recently as president of a San Diego-based biotechnology company.</p>\n\n<p>As Senior Managing Director of Premier Medical Partner Fund, L.P., a San Diego based healthcare/medical technology venture fund, Rich developed and implemented investment strategies and directed the fund’s investment activities and operations. Under his leadership, Medical Partner Fund built a portfolio of investments in seven emerging venture-backed companies whose realized liquidity events to date included two IPOs and three M&amp;A transactions. Previously, as a principal at Senmed Medical Ventures, Rich was responsible for the assessment and implementation of the financial and legal aspects of Senmed’s venture capital and technology commercialization activities, as well as a member of the firm’s Investment Committee. Four of the five venture-backed life sciences companies funded by Senmed during Rich&#8217;s tenure with the firm have successfully achieved liquidity (three through IPO and one through M&amp;A), with the remaining one having received several subsequent significant venture financing rounds. Earlier in his career Rich held investment principal positions within 3i Group plc and The Prudential Insurance Company of America.</p>\n\n<p>Rich holds BS and MS degrees in Aeronautical Engineering from the Massachusetts Institute of Technology and an MBA with multiple concentrations from the J.L. Kellogg Graduate School of Management at Northwestern University. A Chartered Financial Analyst (CFA), Rich is a member of the CFA Institute and the CFA Society of San Diego.</p>","image":{"available_sizes":[[[126,150],"assets/images/resized/0003/0257/30257v1-max-150x150.jpg"],[[186,220],"assets/images/resized/0003/0257/30257v1-max-250x250.jpg"],[[186,220],"assets/images/resized/0003/0257/30257v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Shepherd Ventures","permalink":"shepherd-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[108,150],"assets/images/resized/0003/0252/30252v1-max-150x150.jpg"],[[146,202],"assets/images/resized/0003/0252/30252v1-max-250x250.jpg"],[[146,202],"assets/images/resized/0003/0252/30252v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}