{"first_name":"Richard","last_name":"Robinson","permalink":"richard-robinson","crunchbase_url":"http://www.crunchbase.com/person/richard-robinson","homepage_url":"http://cn.linkedin.com/in/richardrobinson","birthplace":"Boston, MA","twitter_username":"richardrobinson","blog_url":"","blog_feed_url":"","affiliation_name":"Youlu, Inc","born_year":1967,"born_month":8,"born_day":11,"tag_list":"","alias_list":null,"created_at":"Tue Jul 06 05:05:56 UTC 2010","updated_at":"Thu Mar 17 21:34:13 UTC 2011","overview":"<p>Rich is knee-deep in entrepreneurship in the China market.</p>\n\n<p>He heads up international for Youlu, a social mobile networking company he co-founded with terrific Chinese entrepreneurs in Beijing. </p>\n\n<p>Richard&#8217;s also the Chairman and Co-founder of Kooky Panda which is venture-backed and creates socially-connected mobile games in their secret underground labs in the Middle Kingdom.</p>\n\n<p>Previously Richard started Dada Asia along with Milan-listed investor Dada, one of the top mobile entertainment companies in the world.  He spent 24 months kickstarting services and building up teams across Asia Pac with a footprint covering India to Australia to Greater China building up teams and operations in ten countries.  After exiting the venture and putting new management in place, Richard sat on the board of the company and served as a consultant for one additional year.</p>\n\n<p>Richard is also a Co-Founder and Board Advisor to Shouji Mobile Entertainment (www.shoujimobile.com), China&#8217;s leader in customizing, optimizing and testing mobile applications with clients such as EA Mobile, Disney Mobile, THQ Mobile, Vivendi Games Mobile, etc.</p>\n\n<p>He also serves as a Board Advisor for ACL Wireless (www.acl-wireless.com - voted #1 fastest growing tech company in India in 2005 and #2 in 2006 by Deloitte Consulting) a dynamic New Delhi-based wireless instant messaging company invested in by MIH, Tencent&#8217;s largest shareholder.  </p>\n\n<p>Richard is also an Advisor to Icebreaker Software based in Seattle with development in Beijing.  Venture-backed Icebreaker connects people through mobile social networking software and services that are engaging and easy to use. Their flagship product Crush or Flush is the &#8216;Hot or Not&#8217; for mobile.</p>\n\n<p>Richard is the Co-Founder of the first Beijing Chapter for EO (Entrepreneurs&#8217; Organization), the world&#8217;s largest community for entrepreneurs (www.eonetwork.org) and he also sits on the Board of Governors for China Entrepreneurs (www.ce-online.cn).</p>\n\n<p>Richard sat on the Asia Board of the Mobile Entertainment Forum (www.m-e-f.org) from November 2006 until November 2008.  MEF is the leading global industry group representing all participants in the mobile entertainment value chain.  </p>\n\n<p>For the past decade Richard has been producing ChopSchticks live standup comedy shows throughout Asia for the expat community as a labor of love on the side  (www.ChopSchticks.com).  Founded in Hong Kong in 1998, ChopSchticks has given sore abdominal muscles to over 35,000 expats to date over the past decade and has brought out such top international acts as Russell Peters, Pablo Francisco, Colin Quinn, Jake Johanssen, Second City from Chicago and The Just For Laughs Comedy Festival, the biggest comedy festival in the world, for their first Asia tour.</p>\n\n<p>Previously, Richard was Vice President of International for Linktone (www.linktone.com), a leading provider of wireless value-added services to mobile phone users in China. Richard joined the company prior to its listing on NASDAQ which was a first globally for a company in the mobile entertainment space. In his role at Linktone, Richard sourced, closed and managed relationships with international wireless content partners such as Sony Music, BMG, Warner Music Group, Universal Music Group, Disney, Cartoon Network, Kodak, Reuters and NewsCorps&#8217; Channel V, among others to bring their wireless content and services to the mobile Middle Kingdom.</p>\n\n<p>Prior to Linktone, Richard was the Founder and CEO of MIG, China&#8217;s first SMS-focused game company which morphed into a leading J2ME and BREW developer and distributor.  MIG was incubated in Beijing in 2001 inside PricewaterhouseCoopers Consulting. Richard closed an exclusive deal with Yao Ming to create a suite of mobile services for the China market around the NBA All-Star in the process initiating deals with both Sorrent and later Macrospace (both companies ultimately merged to become Glu Mobile).  Richard also created a mobile tie-in with the release of Spiderman, the first for a major Hollywood movie in China. Richard initiated and closed a merger of MIG with Sun Microsystems-invested Softgame (merged entity retained MIG name) and MIG was ultimately acquired by Glu Mobile in 2007 (NASDAQ: GLUU).</p>\n\n<p>Before founding MIG, Richard was a founding executive of renren.com - the global community site for Chinese. As Vice President of Marketing and Sales, he ran the Marketing, Public Relations, Sales and Customer Service teams of over 75 people across six cities in three countries with a marketing budget of nearly US$12 mln. Richard was with renren.com from an 8 person company to a 350+ person company and continued with the company from initial seed funding through to funding of over US$37 million, on to renren&#8217;s listing on the Hong Kong Stock Exchange and finally through to renren&#8217;s full acquisition in early 2001.</p>\n\n<p>Richard came to renren.com from Modem Media in Hong Kong where he was the Regional Director of Strategy and Media for more than two years through to Modem&#8217;s listing on NASDAQ. During his time at Modem, he helped grow the Hong Kong team from 3 people in early 1997 up to nearly 50 staff. Richard oversaw the regional interactive strategy and online media planning on all accounts including AT&amp;T, Citibank, Intel, IBM and Cathay Pacific in markets such as Hong Kong, Mainland China, Singapore, Taiwan and Australia.</p>\n\n<p>Mobile Entertainment Magazine ranked Richard as one of the top 50 mobile entertainment executives globally in 2005. Advertising Age Magazine selected Richard as a Top Ten international Internet Superstar in 2000. Richard also founded the first Asian chapter of the IAB (Interactive Advertising Bureau) in Hong Kong and served as its chairman from 1997-2000.</p>\n\n<p>Richard received an MBA from the Rotterdam School of Management at Erasmus University in The Netherlands in 1996, and a B.S. in Business Administration from the University of Southern California in Los Angeles in 1989.  He also did an exchange at Cambridge University in 1988 and the obligatory Eurail trip around Europe which sparked his love of travel.</p>\n\n<p>After graduating from college, Richard was a wild-eyed backpacker who worked his way around the world for a few years as a bartender in the Virgin Islands, a concierge/ski bum in a Swiss Hotel, an English teacher in post-revolution Prague, a housepainter in Norway, a grape picker in France and a BMW factory worker in Munich. Richard also traveled overland from Switzerland to Hong Kong in 1993 through hitchhiking and train travel via Siberia, Mongolia and Beijing.  He also did a 5,000km solo mountain biking trip through Africa from Kenya to Capetown in 1996. </p>\n\n<p>Richard has two wonderful sons &#8216;Made in China&#8217; and speaks Mandarin.</p>","image":{"available_sizes":[[[133,150],"assets/images/resized/0009/2504/92504v2-max-150x150.jpg"],[[222,250],"assets/images/resized/0009/2504/92504v2-max-250x250.jpg"],[[400,450],"assets/images/resized/0009/2504/92504v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"International Business","institution":"Rotterdam School of Management, Erasmus University","graduated_year":1996,"graduated_month":null,"graduated_day":null},{"degree_type":"B.S.","subject":"Business Admin","institution":"University of Southern California","graduated_year":1989,"graduated_month":null,"graduated_day":null},{"degree_type":"Exchange","subject":"History, English","institution":"University of Cambridge ","graduated_year":1988,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Co-founder and President, Int'l","firm":{"name":"Youlu, Inc","permalink":"youlu-inc","type_of_entity":"company","image":null}}],"investments":[],"milestones":[{"description":"Joined Youlu as Co-founder and President, International","stoned_year":2010,"stoned_month":1,"stoned_day":15,"source_url":"","source_text":null,"source_description":"","stoneable_type":"Person","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"first_name":"Richard","last_name":"Robinson","permalink":"richard-robinson"}}],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://cn.linkedin.com/in/richardrobinson","title":"LinkedIn"}]}