{"first_name":"Rick","last_name":"Pendykoski","permalink":"rick-pendykoski","crunchbase_url":"http://www.crunchbase.com/person/rick-pendykoski","homepage_url":"http://www.sdretirementplans.com","birthplace":"Goodyear","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1954,"born_month":9,"born_day":10,"tag_list":"self-directed-retirement-palns-llc, retirement-investment-options, 401k-investment, self-directed-401k","alias_list":null,"created_at":"Mon Nov 05 10:39:09 UTC 2012","updated_at":"Thu Nov 08 07:59:56 UTC 2012","overview":"<p>Rick PendykoskI brings a unique skill set to Self Directed Retirement Plans LLC.</p>\n\n<p>Thirty years ago, in 1982 he purchased a franchise opportunity.  The Franchisor was a relatively new private company and their pro forma indicated a successful franchise would peak at $900,000 per year.  Rick surpassed this within months and went on to become the largest franchise in North America – surpassing the Franchisor’s top goals many times over.  </p>\n\n<p>In 1985, he bought a second franchise, then a third and a fourth – each time surpassing the Franchisor’s goals.  He understood that his customers and sales people were responsible for the franchises success.  Giving back by virtue of mentoring, trips, tournaments, encouragement seminars etc. his staff and sales force remained loyal throughout the years.   The success of these franchises allowed for many trips to exotic parts of the world and a very nice lifestyle.  It also served as a wonderful education developing businesses and helping people.  For two years Rick travelled the continent at the behest of the Franchisor, visiting and encouraging franchises coast to coast.</p>\n\n<p>After running multi million dollar businesses for 15 years, the excitement diminished and it became a job.  He had always harbored the thought of becoming a licensed trusted advisor. In 1998 he acted on his passion and became a successful advisor.  </p>\n\n<p>His focus as an advisor changed ten years ago when he researched the world of self directed accounts and “alternative” investments.  He also realized these types of investments were not promoted nor encouraged by traditional advisors.  The reason was simple; most advisors can only recommend products their broker dealers have for sale.  They cannot step outside  “The Box” of traditional investments.</p>\n\n<p>Most advisors want to help their clients achieve their goals.  Rick took this to another level.  Not only can clients of his company continue with traditional investments but now they can enter the world of true self directed accounts and alternative investments.  Investing in real estate, tax liens, private placements, precious metals, businesses and loaning money are just a few more asset classes available to his clients.  </p>\n\n<p>Rick takes great pride that Self Directed Retirement Plans LLC continues to give honest and very experienced advice, many times with investments most CPA’s or other advisors can’t or won’t.  Rick can readily converse with business owners and people looking to take control of their retirement accounts.  His clients appreciate 30 years of diverse experience.</p>","image":{"available_sizes":[[[150,51],"assets/images/resized/0021/8784/218784v2-max-150x150.png"],[[250,85],"assets/images/resized/0021/8784/218784v2-max-250x250.png"],[[450,154],"assets/images/resized/0021/8784/218784v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.nuwireinvestor.com/members/0611ab91-8cf0-4830-8b0c-8d8cc494ebf9/profile.aspx","title":"NuWireInvestor"},{"external_url":"http://www.aboutus.org/SdRetirementPlans.com","title":"AboutUs.Org"},{"external_url":"http://www.writeonfinance.com/profiles/blogs/how-to-open-a-self-directed-ira-account-and-what-are-its-benefits","title":"WriteOnFinance"},{"external_url":"http://seekingalpha.com/instablog/4604201-rickpendykoski/1042561-implications-of-self-directed-rollover-401-k-to-ira-ira-to-401-k","title":"SeekingAplha"}],"web_presences":[{"external_url":"http://www.linkedin.com/pub/rick-pendykoski/2b/199/666","title":"LinkedIn"}]}