{"first_name":"Rick","last_name":"Rolandi","permalink":"rick-rolandi","crunchbase_url":"http://www.crunchbase.com/person/rick-rolandi","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Vovici","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed May 13 13:07:45 UTC 2009","updated_at":"Sat May 16 21:43:20 UTC 2009","overview":"<p>An industry leader with more than 30 years of experience, Rick Rolandi is responsible for overseeing Vovici’s financial strategy, including capital structuring and profit improvement.</p>\n\n<p>Prior to joining Vovici, Rolandi served as Chief Financial Officer of Softek Storage Solutions Corporation, a provider of data migration software. While in this role, he was responsible for overseeing the finance, legal, information technology, and human resources business functions, supporting the Company’s efforts to becoming a leader in the data migration space. Before working with Softek, Rolandi served as CFO of DataDirect Technologies, where under his leadership the Company’s first two fiscal years as an independent company resulted in consecutive year-over-year increases in revenues and profitability, while also generating strong operating cash flows.  Rolandi was also the CFO of two NASDAQ listed companies, Landmark Systems and Data Measurement Corporation.  Rolandi holds a bachelor’s degree in industrial engineering from Stanford University and an MBA from Harvard University.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"CFO","firm":{"name":"Vovici","permalink":"vovici","type_of_entity":"company","image":{"available_sizes":[[[105,27],"assets/images/resized/0004/3916/43916v2-max-150x150.png"],[[105,27],"assets/images/resized/0004/3916/43916v2-max-250x250.png"],[[105,27],"assets/images/resized/0004/3916/43916v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}