{"first_name":"Rick","last_name":"Kornfeld","permalink":"rick-kornfeld","crunchbase_url":"http://www.crunchbase.com/person/rick-kornfeld","homepage_url":"http://grid2home.com/team.html","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"grid2home, rick-kornfeld","alias_list":null,"created_at":"Wed Sep 15 15:05:26 UTC 2010","updated_at":"Thu Sep 23 03:02:01 UTC 2010","overview":"<p>Rick Kornfeld is the president and chief executive officer of Grid2Home in San Diego. </p>\n\n<p>Mr. Kornfled has worked for some of San Diego&#8217;s most notable tech companies, including Linkabit, Qualcomm and Texas Instruments. Prior to joining Grid2Home, he was EVP &amp; Chief Strategy Officer, NextWave Wireless and NextWave Broadband and previous to that served as President &amp; CEO, Staccato Communications from 2004 to 2006.</p>\n\n<p>Mr. Kornfeld previously served as vice president and general manager of Texas Instruments&#8217; Wireless Chipset Business Unit. He joined TI as part of the acquisition of Dot Wireless, where he was co-founder, chairman, and CEO. </p>\n\n<p>Prior to founding Dot Wireless, Mr. Kornfeld was a founding member of NextWave Telecom, Inc., where he was the senior vice president and general manager of the Consumer Products division. Previously, Mr. Kornfeld was vice president of engineering at Qualcomm, leading the development of the first commercial CDMA subscriber equipment. Prior to joining Qualcomm, Mr. Kornfeld held technical positions at M/A-Com Linkabit.</p>\n\n<p>Mr. Kornfeld received his B.S. from the University of California, San Diego where he was also named the Alumni of the Year in 2001. He serves on the Council of Advisors of UCSD&#8217;s Jacobs School of Engineering. He also serves as the Vice-Chairman of CommNexus, the Chairman of EvoNexus, the Vice-Chairman of the San Diego AIPAC Council and serves on the national AIPAC council. </p>\n\n<p>Mr. Kornfeld has earned distinction in the wireless industry for his many innovations in the field of wireless voice and data communications. He has published numerous papers and is a named inventor on 17 patents. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/rick-kornfeld/4/191/39a","title":"Rick Kornfeld on LinkedIn"}]}