{"first_name":"Rip","last_name":"Gerber","permalink":"rip-gerber-2","crunchbase_url":"http://www.crunchbase.com/person/rip-gerber-2","homepage_url":"http://www.ripgerber.com","birthplace":"Washington, DC","twitter_username":"","blog_url":"http://www.chieflocationofficer.com","blog_feed_url":"","affiliation_name":"Locaid","born_year":1962,"born_month":12,"born_day":null,"tag_list":"thriller-writer, software-executive, ceo, cia, nokia, loc-aid","alias_list":null,"created_at":"Mon Oct 04 03:02:23 UTC 2010","updated_at":"Sun Mar 04 09:30:29 UTC 2012","overview":"<p>Rip Gerber is a writer, high tech entrepreneur, software executive and former analyst for the Central Intelligence Agency (CIA).  He has run several public software companies and is an international best-selling thriller novelist.</p>\n\n<p>Mr. Gerber is currently President and Chief Executive Officer of Locaid Technologies, Inc., the world&#8217;s largest location enabler for mobile developers.</p>\n\n<p>Professional career Prior to Locaid:  Rip Gerber was the Chief Marketing Officer and head of Ecommerce and Business Development for NOKIA(NOK) following its acquisition of Intellisync, a wireless software company, in 2006. Mr. Gerber was a corporate executive and marketing force behind several high-profile branding campaigns and product launches before he left the high-technology sector to become a full-time writer.</p>\n\n<p>Intellisync turnaround and sale to Nokia: In 2004, Mr. Gerber joined Intellisync, then a struggling consumer data sync company, to lead a restructuring, repositioning and re-branding of the company, consolidate its products and market focus and position Intellisync for sale. Mr. Gerber and CEO Woody Hobbs transformed the company and brand to a worldwide leader in wireless email and mobile software for the enterprise and wireless carrier markets. Nokia acquired Intellisync for $480M in February 2006. During this period Mr. Gerber was an often-quoted industry expert on wireless technology and corporate mobility.</p>\n\n<p>Consulting Period: Prior to joining Intellisync, Mr. Gerber served as Managing Director and Group Vice President of Carlson Marketing Group, the $2 Billion subsidiary of Carlson Companies. Mr. Gerber led regional integration of CMG&#8217;s acquisitions, notably the Peppers &amp; Rogers Group, and he initiated and led the firm&#8217;s technology practice for clients including HP, Intel, Oracle, Xerox and Home Depot. Prior to that he was Senior Vice President for Digitas Inc. (NASDAQ: DTAS) where he established the firm&#8217;s B2B division, leading strategic marketing programs for Microsoft and Charles Schwab, advising CMOs and senior client executives on strategy, market positioning, customer acquisition and retention, CRM, communications, branding and infrastructure investment.</p>\n\n<p>Email Infrastructure: In 1999 Mr. Gerber joined a company based out of Tel Aviv, Israel and took the company public on NASDAQ. At Commtouch Inc., an email infrastructure company, (NASDAQ: CTCH), Mr. Gerber served as Chief Strategy Officer and Chief Marketing Officer and led several operating divisions. Prior to that, Mr. Gerber also served as President of @once Inc, an email marketing company he founded, which was later acquired by InfoUSA.</p>\n\n<p>Pre-Silicon Valley Roles\nPrior to his work in software, Mr. Gerber was a senior practitioner at Deloitte &amp; Touche, later Deloitte consulting. He is most noted for being the first management consultant in Deloitte&#8217;s software practice in 1992. He also served in Deloitte&#8217;s Merger &amp; Acquisition division (and an affiliation with KKR), and helped build the firm&#8217;s Financial Services practice, serving clients such as Bank of America, Charles Schwab, and First Republic Bank. He was also a key analyst in the thrift portfolio consolidation for Gerry Ford&#8217;s acquisition of Cal Fed.</p>\n\n<p>Mr. Gerber also held key line positions as a senior marketing director at American Express, Inc. in New York, where he was the youngest employee in American Express&#8217;s history to join the Graduate Managament Program. He built the first polychromatic polyethylene manufacturing plant for Firestone Tire &amp; Rubber in Hopewell, Virginia. He began his career at the Central Intelligence Agency, with documented roles in both the Psychological Testing Division in Arlington, Virginia and at Central Records in Langley, Virginia.</p>\n\n<p>Credentials\nMr. Gerber earned a biochemical engineering degree from the University of Virginia and an MBA from Harvard Business School. He has served on numerous boards and industry committees. He is also a published author (PHARMA; Random House in July 2007; PILOTS TO PROFITS; Hudson House in 2005), and KILLER VIRUS (Random House, December 2010). He is a member of various writing and national organizations, including:</p>\n\n<p>MENSA</p>\n\n<p>International Thriller Writers</p>\n\n<p>Squaw Valley Writer&#8217;s Conference (2007)</p>\n\n<p>San Francisco Writer&#8217;s Workshop</p>\n\n<p>Mystery Writers of America</p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0011/9415/119415v7-max-150x150.jpg"],[[250,166],"assets/images/resized/0011/9415/119415v7-max-250x250.jpg"],[[450,300],"assets/images/resized/0011/9415/119415v7-max-450x450.jpg"]],"attribution":"<p>Locaid Technologies</p>"},"degrees":[{"degree_type":"MBA","subject":"General Management","institution":"Harvard Business School","graduated_year":1992,"graduated_month":null,"graduated_day":null},{"degree_type":"BS","subject":"Biochemical Engineering","institution":"University of Virginia","graduated_year":1985,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President & Chief Executive Officer","firm":{"name":"Locaid","permalink":"loc-aid-technologies","type_of_entity":"company","image":{"available_sizes":[[[128,55],"assets/images/resized/0002/3247/23247v3-max-150x150.png"],[[128,55],"assets/images/resized/0002/3247/23247v3-max-250x250.png"],[[128,55],"assets/images/resized/0002/3247/23247v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://en.wikipedia.org/wiki/Rip_Gerber","title":"Wikipedia - Rip Gerber"},{"external_url":"http://en.wikipedia.org/wiki/Rip_Gerber","title":"Amazon.com Reviews (5 Stars)"},{"external_url":"http://www.ctiaenterpriseandapps.com/info/speakerdetails.cfm/18995","title":"CTIA Speakers Bio"},{"external_url":"http://www.silicon.com/technology/mobile/2006/01/26/mobile-roaming-rip-off-to-roll-on-and-on-39155940/","title":"Silicon.com"}],"web_presences":[{"external_url":"http://www.ripgerber.com","title":"Rip Gerber Author Website"},{"external_url":"http://www.chieflocationofficer.com","title":"Chief Location Officer"}]}