{"first_name":"Rishi","last_name":"Sood","permalink":"rishi-sood","crunchbase_url":"http://www.crunchbase.com/person/rishi-sood","homepage_url":"http://www.gartner.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Gartner","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Feb 24 00:13:06 UTC 2011","updated_at":"Thu Feb 24 20:43:16 UTC 2011","overview":"<p>Rishi Sood is a vice president in Gartner, where he leads the Gartner for Business Leaders research for the U.S. State and Local Government, U.S. Federal Government and Global Public Sector programs. In this capacity, Mr. Sood provides strategic direction for his clients by helping them understand key business issues, leading technology trends and drivers, demand for IT solutions, industry best practices, competitive landscapes, and future scenarios for public sector organizations. Within the state and local government marketplace, Mr. Sood specializes in the following agency segments: health, human services, tax/revenue and public safety. Mr. Sood&#8217;s key technology areas include e-government, CRM, outsourcing, homeland security, ERP and agency-specific solutions. His key business issues include economic development, governance, sourcing and customer service. Within the U.S. federal government market, Mr. Sood focuses on the civilian, defense and intelligence agency segments. His key technology areas include Cloud, Virtualization, RFID, CRM, IT services, outsourcing, data warehousing and ERP. Mr. Sood&#8217;s key business issues are e-government, homeland security, transformation and sourcing. He frequently presents at major industry conferences and is a regular contributor to leading IT services publications. He managed a monthly column called &#8220;Across the Digital Nation&#8221; for Washington Technology magazine.</p>\n\n<p>Mr. Sood joined Gartner with the acquisition of G2 Research, where he was vice president, managing the firm&#8217;s Global Industries group, as well as being chief analyst for state and local government.</p>\n\n<p>&#8220;Government is the ultimate industry, where each decision will impact everyone&#8217;s life. As a dedicated government analyst for Gartner, I find that the ability to advise and educate public sector officials and technology vendors about the current and future innovations in this industry is an interesting challenge, as well as a rewarding service.&#8221;</p>","image":null,"degrees":[{"degree_type":"","subject":"","institution":"University of Chicago","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Vice President, Government","firm":{"name":"Gartner","permalink":"gartner","type_of_entity":"company","image":{"available_sizes":[[[107,36],"assets/images/resized/0004/7265/47265v1-max-150x150.png"],[[107,36],"assets/images/resized/0004/7265/47265v1-max-250x250.png"],[[107,36],"assets/images/resized/0004/7265/47265v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://linkedin.com","title":""}]}