{"first_name":"Rishi","last_name":"Shah","permalink":"rishi-shah-2","crunchbase_url":"http://www.crunchbase.com/person/rishi-shah-2","homepage_url":"http://www.contextmediainc.com/team/rishi-shah/","birthplace":"","twitter_username":"rishishah","blog_url":"","blog_feed_url":"","affiliation_name":"Rishi Shah","born_year":null,"born_month":null,"born_day":null,"tag_list":"contextmedia","alias_list":null,"created_at":"Mon Nov 19 21:20:59 UTC 2012","updated_at":"Thu Nov 22 04:39:23 UTC 2012","overview":"<p>Rishi U. Shah, Chief Executive Officer and Founder of Contextmedia, is a successful media and technology entrepreneur. Rishi started ContextMedia in 2006 to help patients with chronic diseases live healthier through contextually relevant media services. The company’s DOOH networks and mobile media offerings are now used by over a million patients monthly and the firm’s clients include more than half of the 20 largest pharmaceutical companies.</p>\n\n<p>Rishi advises several early stage companies and serves on the Board of Directors of many civic organizations including the Chicagoland Chamber of Commerce and the Institute for Student Business Education at Northwestern University and serves as a mentor for Chicago’s technology start-up incubator, Excelerate Labs. He was recognized by Crain’s Chicago Business as a member of their 40-Under-40 class in 2009 and is an active member of the Executives Club of Chicago, the Chicagoland Entrepreneurial Center and the Illinois Technology Association.</p>\n\n<p>He is past founder of the Northwestern Business Review, a Northwestern University-based collaborative publication distributed to more than 60 leading campuses nationwide. Prior to that, he founded a home computer consulting firm whose clients were acquired by Best Buy. Rishi has also founded several non-profit initiatives at the intersection of youth, education and media including the Urban-Suburban Domestic Exchange Initiative, a program sponsored by the Gates foundation to facilitate cross-school interaction.</p>\n\n<p>Oakbrook, Ill.-native, Rishi is an avid fan of the Chicago Bulls, ancient Indian philosophy and new media.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"ContextMedia","permalink":"contextmedia","type_of_entity":"company","image":{"available_sizes":[[[150,46],"assets/images/resized/0015/4261/154261v1-max-150x150.jpg"],[[250,77],"assets/images/resized/0015/4261/154261v1-max-250x250.jpg"],[[306,95],"assets/images/resized/0015/4261/154261v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}