{"first_name":"Rob","last_name":"Hutter","permalink":"rob-hutter-2","crunchbase_url":"http://www.crunchbase.com/person/rob-hutter-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Revolution Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 12 08:28:20 UTC 2008","updated_at":"Sat Nov 15 18:40:15 UTC 2008","overview":"<p>Robert J. Hutter is a Partner. As a charter member of Revolution Ventures, Robert has led investments and taken active management roles in the firm&#8217;s portfolio companies since the partnership began in late 1999.  Currently Robert is CEO of NR2B Research, a company backed by Revolution.  Previously, Robert served as Executive Vice President of CombineNet during its formation stage, where he led financing efforts. Today the company is the market&#8217;s leading provider of advanced combinatorial procurement technology for Fortune 500 corporations.  Robert also served as VP of Corporate Development at Solarflare Communications, the worldwide pioneer in PHYs and controllers for standards-based 10 Gigabit Ethernet networks running on copper cabling.</p>\n\n<p>Currently, Robert is on the Board of Directors of Smartdrive Systems, Quantcast, and NR2B Research.  Prior to Revolution, Robert was an Associate at Fundamental Capital in Palo Alto, CA. At Fundamental, Robert was instrumental in the start-up phases of a variety of companies including Silicon Spice, a fabless semiconductor company that was acquired by Broadcom in August 2000 for $1.3 billion. In addition, as part of a longstanding interest in education, Robert helped found the web-based student assessment company Edusoft Inc., which was acquired by Houghton-Mifflin in 2003. Robert is a graduate of Harvard University. </p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0002/8508/28508v2-max-150x150.jpg"],[[178,250],"assets/images/resized/0002/8508/28508v2-max-250x250.jpg"],[[250,350],"assets/images/resized/0002/8508/28508v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Revolution Ventures","permalink":"revolution-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,67],"assets/images/resized/0002/8339/28339v2-max-150x150.jpg"],[[250,112],"assets/images/resized/0002/8339/28339v2-max-250x250.jpg"],[[271,122],"assets/images/resized/0002/8339/28339v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}