{"first_name":"Rob","last_name":"Chaplinsky","permalink":"rob-chaplinsky-2","crunchbase_url":"http://www.crunchbase.com/person/rob-chaplinsky-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Bridgescale Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 27 20:57:53 UTC 2010","updated_at":"Thu Jul 29 15:44:01 UTC 2010","overview":"<p>Rob Chaplinsky is the managing director and co-founder of Bridgescale Partners and brings more than 12 years of investing experience and more than 15 years of marketing experience to technology companies. Prior to forming Bridgescale, Rob was a general partner at early-stage venture capital firm Mohr Davidow Ventures (MDV). At MDV, Rob was the lead investor and board member involved in the launches of companies such as Accelerant Networks (acquired by Synopsys), Brion Technologies (acquired by ASML), Cooligy (acquired by Emerson Electric), Pivotal Technologies (acquired by Broadcom), Pixim Technologies and Quake Technologies (acquired by AMCC).</p>\n\n<p>Before joining MDV, Rob was technology research analyst at Hambrecht &amp; Quist. In that capacity, Rob led investment research on some of the industry&#8217;s most dynamic public and private semiconductor companies in the United States and Asia. During that time, Rob also made personal investments in successful private companies including FormFactor (NASDAQ: FORM), Galileo (sold to Marvell), Netboost (sold to Intel) and Quantum Effect Design (sold to PMC Sierra). Prior to Hambrecht &amp; Quist, Rob held various senior marketing and sales positions at Intel Corporation.</p>\n\n<p>At Bridgescale, Rob is the lead investment representative in Bluecat Networks, Cortina Systems, IMVU, Incentium, Proofpoint and Open-Silicon.</p>\n\n<p>Rob earned a B.S. in mechanical engineering from the University of Waterloo, Canada, and an M.B.A. from Harvard Business School.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Bridgescale Partners","permalink":"bridgescale-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,41],"assets/images/resized/0002/3033/23033v1-max-150x150.jpg"],[[250,68],"assets/images/resized/0002/3033/23033v1-max-250x250.jpg"],[[273,75],"assets/images/resized/0002/3033/23033v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}