{"first_name":"Rob","last_name":"Stavis","permalink":"rob-stavis","crunchbase_url":"http://www.crunchbase.com/person/rob-stavis","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Mar 15 03:22:56 UTC 2010","updated_at":"Mon Mar 15 03:24:15 UTC 2010","overview":"<p>Rob Stavis is a Partner in Bessemer&#8217;s Larchmont, NY office. He focuses on investments in the financial services sector as well as in emerging software technologies. Since joining BVP, Rob has led the firm’s investments in and sits on the boards of  the independent research companies Gerson Lehrman Group and Soleil Securities, CRM software developer Portrait Software (formerly AIT Group, LSE-AIM: PST), financial marketplace Zopa, leads generator Yodle, online creative messaging service Smilebox, online educational website Knewton, and the stock loan focused Broker/Dealer financial services company Quadriserv. He was closely involved in BVP&#8217;s investment in Motilal Oswal Financial Services, an India-based financial services and brokerage company, which has since gone public on India&#8217;s Bombay and National Stock Exchanges as MOSL.</p>\n\n<p>His exited investments include website security rating firm SiteAdvisor (acquired by McAfee), home network management software provider Pure Networks (acquired by Cisco), pre-paid debit card provider PRE Solutions (acquired by Incomm), the financial services analytics company LifeHarbor (acquired by Vestmark), and Skype Technologies (purchased by E-bay in 2005), where Rob led the A round.</p>\n\n<p>Prior to joining Bessemer in 2000, Rob was an independent private equity investor. In this capacity, he led the A round and served on the board of Arbinet (NASDAQ:ARBX), the world&#8217;s leading electronic market for trading, routing, and settling communications capacity. He also managed a portfolio of interests in a number of industries, including telecommunications, software, technology, and restaurants. His restaurant partnerships have backed such operations as Union Pacific, Calle Ocho, Django, Rain and BLT Prime.</p>\n\n<p>Rob entered private equity after a 15-year career at Salomon Smith Barney, where he became co-head of global arbitrage trading. He was a member of Salomon&#8217;s operating and risk management committees, and chaired the recruiting committee, in addition to managing a $100 billion balance sheet.</p>\n\n<p>Rob holds degrees from the Engineering School of the University of Pennsylvania and the Wharton School of Management. He has published articles on derivatives pricing and risk management for financial services companies. Rob&#8217;s charitable work includes serving as president of the board of WJCS, Westchester County&#8217;s oldest and most comprehensive social-service agency, and formerly as a director of The Kingswood-Oxford School and the Larchmont Temple.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"board of directors","firm":{"name":"Hunch","permalink":"hunch","type_of_entity":"company","image":{"available_sizes":[[[145,56],"assets/images/resized/0002/3134/23134v3-max-150x150.png"],[[145,56],"assets/images/resized/0002/3134/23134v3-max-250x250.png"],[[145,56],"assets/images/resized/0002/3134/23134v3-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Partner","firm":{"name":"Bessemer Venture Partners","permalink":"bessemer-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,39],"assets/images/resized/0001/3853/13853v1-max-150x150.png"],[[250,65],"assets/images/resized/0001/3853/13853v1-max-250x250.png"],[[284,74],"assets/images/resized/0001/3853/13853v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}