{"first_name":"Rob","last_name":"Kendrick","permalink":"rob-kendrick","crunchbase_url":"http://www.crunchbase.com/person/rob-kendrick","homepage_url":"http://www.greatbritmusic.com","birthplace":"England","twitter_username":"GreatBritMusic","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Apr 16 09:43:54 UTC 2011","updated_at":"Tue Apr 19 06:40:25 UTC 2011","overview":"<p>Rob Kendrick is the owner of Great Brit Music, a United Kingdom multimedia entertainment company. He also owns Wunder Audio U.K, a professional audio equipment sales company. </p>\n\n<p>Clients include Sir Paul McCartney, Norah Jones, Peter Gabriel, The Strokes, Christina Aguilera, Pink, Gwen Stefani and the world&#8217;s premier studios.</p>\n\n<p>Great Brit Music excels in promoting films and international recording artists from both sides of the Atlantic on America’s Fox Television, the BBC and live shows. Rob is the Associate Producer of the newly released film Red Dirt: Songs from the dust.</p>\n\n<p>Guitarist and vocalist Rob Kendrick began his career as a member of two world renowned British rock bands, the English band Trapeze and their Welsh counterpart Budgie, enjoying great success with both outfits while touring Britain, Europe and the United States.</p>\n\n<p>The celebrated musician recorded three albums with Trapeze who soared to fame with the albums Medusa and You Are The Music We’re Just The Band, both of which were on The Moody Blues’ Threshold label.</p>\n\n<p>Rob was enlisted as a member of Trapeze in 1974 and subsequently Warner Brothers Records signed the band for the release of the critically acclaimed Hot Wire album. Impressed with his individual song writing ability, Warner Brothers Records signed Rob to a seven year publishing agreement. Rob and Trapeze then toured extensively in the United States with The Rolling Stones, The Eagles, ZZ Top and many other celebrated bands.</p>\n\n<p>Following the success of Hot Wire, Warner Brothers Records released the eagerly anticipated self titled album Trapeze, again featuring Rob on guitar. The recent CD issue of an early live Trapeze performance entitled Live at the Boat Club further highlights Rob Kendrick’s contribution to the band’s legendary sound.</p>\n\n<p>To this day Trapeze remains a firm favourite within the music industry while the internet continues to attract new and younger fans. Rob has plans to reform the band for a Texas tour later this year! </p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0013/0885/130885v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0013/0885/130885v2-max-250x250.jpg"],[[450,450],"assets/images/resized/0013/0885/130885v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}