{"first_name":"Rob","last_name":"Chandra","permalink":"rob-chandra","crunchbase_url":"http://www.crunchbase.com/person/rob-chandra","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Nov 30 23:33:42 UTC 2009","updated_at":"Mon Nov 30 23:42:44 UTC 2009","overview":"<p>Rob Chandra is a Partner in <a href=\"/financial-organization/bessemer-venture-partners\" title=\"Bessemer Venture Partners&#8217;\" rel=\"nofollow\">Bessemer Venture Partners&#8217;</a> Menlo Park office. Since entering the venture capital industry in 1996, Rob has been involved with 22 early-stage investments that have gone public or been acquired by public companies. Three of Rob&#8217;s portfolio companies went public during 2008.</p>\n\n<p>Rob is the founding partner of the firm&#8217;s investment practice in India, where he recruited an experienced local team, established the office, and developed the investment strategy. Rob has led Bessemer&#8217;s investments in Applied Solar Technologies, Anant Raj Industries, IL&amp;FS Transportation Networks, Motilal Oswal (IPO), OnMobile (IPO), Orient Green Power, Shriram City Union Finance and Shriram EPC (IPO).</p>\n\n<p>Over his career, Rob has invested in and helped build companies in a variety of industries. His semiconductor investments include PA Semi (acquired by Apple Computer), Envoy (acquired by TI), LightLogic (acquired by Intel), Mellanox (IPO), Mobilian (acquired by Intel), and Morphics (acquired by Infineon). His active semiconductor investments are Avnera, Berkeley Design, Kovio, Summit Microelectronics, and Tilera.  His communications industry investments include Altiga (acquired by Cisco), Catena (acquired by Ciena), NBX (acquired by 3Com), and Wavesmith Networks (acquired by Ciena). Previously, he invested in internet start-ups such as BuyerZone.com (acquired by Reed Elsevier), Direct Hit (acquired by Ask Jeeves), SmarterKids.com (IPO), MotherNature.com (IPO) and Centra (IPO). He has been involved with health care services investments such as American Hearing Centers (acquired by HearUSA) and IPC – The Hospitalists Company, which went public in January 2008 and was the best performing IPO of that year. Rob led Bessemer&#8217;s first clean tech investments in Miasole and Exclara.</p>\n\n<p>Prior to joining Bessemer, Rob was a general partner with Commonwealth Capital Ventures. Before he became a venture capitalist, Rob worked in consulting, most recently as an engagement manager with McKinsey &amp; Company and previously at Accenture’s offices in both the U.S. and London. Rob began his career with IBM.</p>\n\n<p>Rob holds an MBA from Harvard Business School and a BA from University of California at Berkeley. He was recognized by Forbes Magazine on its Midas List as a top dealmaker in both 2007 and 2008.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Bessemer Venture Partners","permalink":"bessemer-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,39],"assets/images/resized/0001/3853/13853v1-max-150x150.png"],[[250,65],"assets/images/resized/0001/3853/13853v1-max-250x250.png"],[[284,74],"assets/images/resized/0001/3853/13853v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Director","firm":{"name":"Avalanche Technology","permalink":"avalanche-technology","type_of_entity":"company","image":{"available_sizes":[[[150,36],"assets/images/resized/0007/6165/76165v1-max-150x150.png"],[[250,60],"assets/images/resized/0007/6165/76165v1-max-250x250.png"],[[320,78],"assets/images/resized/0007/6165/76165v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}