{"first_name":"Rob","last_name":"Jevon","permalink":"rob-jevon","crunchbase_url":"http://www.crunchbase.com/person/rob-jevon","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon May 18 14:31:58 UTC 2009","updated_at":"Mon May 18 14:39:25 UTC 2009","overview":"<p>Mr. Jevon has been a Partner at Boston Millennia Partners since its founding in 1997. He was previously a venture partner at Boston Capital Ventures, which he joined in 1996. Prior to that, he was Managing Director and co-owner of Watch Hill Corporation, a Boston based private investment firm. Previously, he was Controller of Bolt, Beranek and Newman’s Communications Division. He also gained significant operational and international experience stationed in Copenhagen as Finance Director of BBN Communications A/S. His earlier business career included several assignments in General Electric’s Financial Management Program.</p>\n\n<p>Mr. Jevon serves as a Director of Athenix, an agricultural-biotechnology company developing insect and herbicide resistant plants; PHT, a provider of mobile and Web technologies that help pharmaceutical companies simplify clinical trials; and MedAptus, a healthcare information technology company.</p>\n\n<p>Previous investment responsibilities have included Galt Associates, which provides safety and outcomes data management products and services to major pharmaceutical companies (sold to Cerner (Nasdaq:CERN)); eMed, which provides systems to digitally store and transmit radiological images (sold to Cedara Software (NasdaqGM: CDSW)); Proteome, a protein database company (sold to Incyte Genomics (NasdaqGM: INCY)); and HotJobs.com, an online recruiting solution (acquired by Yahoo (NasdaqGS: YHOO).</p>","image":{"available_sizes":[[[150,115],"assets/images/resized/0004/4454/44454v1-max-150x150.jpg"],[[152,117],"assets/images/resized/0004/4454/44454v1-max-250x250.jpg"],[[152,117],"assets/images/resized/0004/4454/44454v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"Economics","institution":"Haverford College","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Boston Millennia Partners","permalink":"boston-millennia-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,14],"assets/images/resized/0004/4445/44445v1-max-150x150.png"],[[250,24],"assets/images/resized/0004/4445/44445v1-max-250x250.png"],[[450,44],"assets/images/resized/0004/4445/44445v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}