{"first_name":"Rob","last_name":"Bliss","permalink":"rob-bliss-4","crunchbase_url":"http://www.crunchbase.com/person/rob-bliss-4","homepage_url":"http://www.atsnexgen.com","birthplace":"Canada","twitter_username":"atsnexgen","blog_url":"http://www.tumblr.com/tumblelog/atsnexgen","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"phone-system, telephone-system, voip-phone-system, voip-telephone-system, hosted-phone-system, business-telephone-system, avaya, nortel, mitel, intertel, nec, samsung, toshiba, iwatsu, panosonic, asterisk, opensource-phone-system, dallas, fort-wort, texas","alias_list":null,"created_at":"Thu Jun 23 21:50:24 UTC 2011","updated_at":"Thu May 10 08:54:07 UTC 2012","overview":"<p>&#8220;Telephone, Phone System Specialist&#8221; for ATSnexgen Telephone, Phone System Solutions in Dallas, Fort Worth, Texas. Having worked in the industry for the past twenty six years, ATSnexgen was founded for a couple of reasons. </p>\n\n<p>1) Large Monopolies were gauging their clients pocket books\n2) Those same companies had proprietary phones, yearly licensing fee&#8217;s with maintenance charges up the wazoo.</p>\n\n<p>In this &#8220;NEW WORLD&#8221; of open source technology Rob knew there was a better way, so that the client could get better and faster technology with faster updates for software releases at no charge to their clients and no proprietary phones or equipment.  After all we sent man to the moon over 50 years ago, the world has changed.  Why hadn&#8217;t the telephone industry?</p>\n\n<p>Companies take Telephone, Phone Systems for granted. &#8220;A phone is a phone !  This is definitely not true of course.  There are many things you as a business owner need to be concerned about.  Especially in this new &#8220;VoIP World&#8221; we live in.  Are your routers and switches up to date?  Do they handle Qos?  ( quality of service )  Is a managed switch or unmanaged.  There is a big difference here.  The main reasons why VoiP has not worked for companies 99% of the time is the companies IT infrastructure.  We call it the plumbing that is essential for your company.  Especially since data pipes are getting less and less.  Companies like Time Warner offering 10 meg pipes for $179 is helping with this.</p>\n\n<p>We at ATSnexgen Telephone, Phone System Solutions help educate the client on all necessary information that they need to be made aware before they even think of getting a VoIP Telephone System.  It&#8217;s crucial.  We help our clients by holding their hand through he entire process from end to end.</p>\n\n<p>That&#8217;s why ATSnexgen Telephone, Phone System Solutions has become one of the leaders in Telephone/Phone System Solutions in the Dallas, Fort Worth, Houston, Austin, San Antonio, Texas.</p>","image":{"available_sizes":[[[150,49],"assets/images/resized/0014/0779/140779v9-max-150x150.jpg"],[[250,81],"assets/images/resized/0014/0779/140779v9-max-250x250.jpg"],[[450,147],"assets/images/resized/0014/0779/140779v9-max-450x450.jpg"]],"attribution":"<p>http://www.atsnexgen.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"<iframe width=\"425\" height=\"349\" src=\"http://www.youtube.com/embed/DR1oTJIogAk\" frameborder=\"0\" allowfullscreen></iframe>","description":"<p>Microsoft Integration with the 3CX Telephone System</p>"},{"embed_code":"<iframe width=\"420\" height=\"315\" src=\"http://www.youtube.com/embed/pnkt_JQcFP0\" frameborder=\"0\" allowfullscreen></iframe>","description":"<p>LG Ericsson Telephone/Phone System</p>"}],"external_links":[{"external_url":"http://www.tumblr.com/tumblelog/atsnexgen","title":"Who has the right phone system for you?"}],"web_presences":[{"external_url":"http://www.atsnexgen.com","title":"Telephone/Phone System, Hosted Telephone Systems"},{"external_url":"http://atsnexgen.blogspot.com/","title":"blog"}]}