{"first_name":"Rob","last_name":"Chrone","permalink":"rob-chrone-2","crunchbase_url":"http://www.crunchbase.com/person/rob-chrone-2","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"cfo, financial, online-marketing, marketing","alias_list":null,"created_at":"Tue Aug 12 20:45:47 UTC 2008","updated_at":"Thu Aug 14 23:46:46 UTC 2008","overview":"<p>Robert Chrone, Chief Financial Officer, has more than 20 years experience in private and public company environments. He spent three years at FrontBridge Technologies working with the CEO to grow the company from 15 employees and 35 customers to almost 200 employees and more than 3,000 customers. At FrontBridge, Robert was responsible for finance and administrative functions, and managing the company’s operations. During his tenure at FrontBridge, the company completed a recapitalization and three VC lead rounds of funding. Robert was instrumental in the negotiations that led to the sale of FrontBridge to Microsoft in August 2005. Prior to working with FrontBridge, Robert was CFO and COO of Atlas World Holdings, a private equity investment firm. Robert took an active role with Atlas portfolio companies and personally led the growth and sale of three Atlas companies. Prior to Atlas, Robert was Corporate Controller and then Manager of Finance, Legal &amp; Administration at Dual Drilling, a $400M publicly-traded offshore oil and gas drilling company. Robert holds a B.A. degree in Business Administration from Stephen F. Austin University and is a Certified Public Accountant.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0002/3644/23644v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0002/3644/23644v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0002/3644/23644v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}