{"first_name":"Rob","last_name":"Dyrdek","permalink":"rob-dyrdek","crunchbase_url":"http://www.crunchbase.com/person/rob-dyrdek","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Ditl Inc","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Mar 28 19:22:29 UTC 2012","updated_at":"Wed Apr 25 08:56:49 UTC 2012","overview":"<p>Plain and simple, there is nothing conventional about Rob Dyrdek. He&#8217;s a dreamer who isn&#8217;t scared to take risks. He&#8217;s got the gift to gab and a dangerous knack for persuasion.</p>\n\n<p>MTV viewers might know Dyrdek from his starring role in the reality series Rob and Big- -you know, the adoptive parent of Mini-Horse, the man who performs as alter-ego &#8220;Bobby Light&#8221; or the guy who tried to teach bulldog Meaty to skateboard. Yeah, Rob Dyrdek is that guy, but he&#8217;s also a professional skateboarder who simply refuses to stop chasing glory and an entrepreneur with quite a knack for business.</p>\n\n<p>In his hometown of Kettering, Ohio, at the tender age of 12, Rob picked up a skateboard for the first time. Within a month, he won his first competition and became the youngest member of the G&amp;S skateboard team.</p>\n\n<p>Forgoing his senior year of high school, Dyrdek turned professional at the age of 16 while simultaneously becoming one of the founding members of the legendary Ohio based Alien Workshop team. A regular contender in skateboarding competitions and a staple of street skateboarding videos (he&#8217;s also co-founder of famed DC Video), Rob&#8217;s legend grew fast.</p>\n\n<p>As a entrepreneur, he has contributed game changing shoe design concepts, developed private training facilities for pro boarders and launched companies that include Silver Trucks, Reflex Bearings and Rogue Status, a street wear line that he owns with former blink- 182 drummer Travis Barker. He also has his own sunglasses company (Battle Eyewear), founded the Street League skateboarding league, developed the Wild Grinders cartoon and toy line (based on his childhood skate crew) and formed a charitable foundation to build skate plazas around the country so kids have a safe place to skate.</p>\n\n<p>While conceptualizing and building 40,000 square-foot, award winning Kettering Skate Plaza, as a legal place for street skaters to honor their skills, Rob Dyrdek wrote, financed, produced and starred in the feature film Street Dreams, due in May 2009. And, as you know, he starred opposite his friend and personal bodyguard Chris &#8220;Big Black&#8221; Boykin in three seasons of the hit MTV series Rob and Big.</p>\n\n<p>Not one to slow down, Rob continues to think big. With a goal to &#8220;mogul up,&#8221; he&#8217;s moved Dyrdek Enterprises into a 25,000-square-foot industrial&#8211;and fully skate-able&#8211; warehouse and office complex near downtown Los Angeles. That&#8217;s where we&#8217;ll see him in Rob Dyrdek&#8217;s Fantasy Factory, a place to dream up ideas and bring them to life.</p>\n\n<p>So, despite his success, Rob Dyrdek won&#8217;t be slowing down anytime soon. In fact, he&#8217;s just getting started.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0018/5705/185705v3-max-150x150.png"],[[168,250],"assets/images/resized/0018/5705/185705v3-max-250x250.png"],[[302,450],"assets/images/resized/0018/5705/185705v3-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Ditl Inc","permalink":"ditl-inc","type_of_entity":"company","image":{"available_sizes":[[[128,128],"assets/images/resized/0018/1588/181588v2-max-150x150.png"],[[128,128],"assets/images/resized/0018/1588/181588v2-max-250x250.png"],[[128,128],"assets/images/resized/0018/1588/181588v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Investor","firm":{"name":"Viddy","permalink":"viddy-inc","type_of_entity":"company","image":{"available_sizes":[[[85,41],"assets/images/resized/0017/3393/173393v1-max-150x150.png"],[[85,41],"assets/images/resized/0017/3393/173393v1-max-250x250.png"],[[85,41],"assets/images/resized/0017/3393/173393v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://dyrdek.com","title":"CEO"}]}