{"first_name":"Rob","last_name":"Weiss","permalink":"robb-weiss","crunchbase_url":"http://www.crunchbase.com/person/robb-weiss","homepage_url":"http://eqal.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"EQAL","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jul 23 14:56:56 UTC 2012","updated_at":"Sun Sep 16 19:43:04 UTC 2012","overview":"<p>As Chief Operating Officer for EQAL, Rob oversees all day-to-day creative and business aspects for EQAL&#8217;s portfolio of more than 40 media properties that include its Celebrity Influencer Networks, Branded Entertainment Networks and Owned &amp; Operated Networks. Rob also has oversight of EQAL Media Studios and the company&#8217;s business operations including human resources, research/analytics, business affairs, business development, marketing, publicity and social media strategy.</p>\n\n<p>A digital media pioneer, Rob was among the first in Hollywood to produce content specifically for the Internet back in the 1990s. Throughout his career, Weiss has transitioned between digital media and traditional media; between being a seller and a buyer of content; between the creative and business sides of the industry; and between large corporations and start-up operations.</p>\n\n<p>Prior to joining EQAL, Weiss was CEO and founder of Parkwood Media Ventures. This next-generation media incubator identified, developed and helped launch a diverse portfolio of content-centric entertainment businesses that span television, gaming, the Internet and wireless/mobile. Before his tenure as a media entrepreneur, Weiss served as a senior-level executive for a wide range of cable networks including VH1, FX and FUSE. While leading FUSE - ratings doubled, ad sales doubled, web traffic quadrupled and the cable network became the nation&#8217;s #1-ranked channel in audience concentration of 12-34 year olds. Known as a highly-effective turnaround agent, Weiss tripled the amount of original programming across all of FUSE&#8217;s media platforms to 1,500 hours, successfully launching 23 series on television, the Internet, VOD and mobile.</p>\n\n<p>Earlier in his career, Weiss served for 10 years as co-CEO of Buccieri &amp; Weiss Entertainment. This award-winning multiplatform production company produced more than 2,000 hours of programming for cable, broadcast, syndication, international markets, home video and the Internet. Prior to his pilgrimage to Hollywood, Weiss was a successful print and broadcast journalist. By the time he was 25-years-old, Weiss had already worked as a producer for NBC&#8217;s &#8220;TODAY Show&#8221; and as a staff reporter for the Los Angeles Times. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Operating Officer","firm":{"name":"EQAL","permalink":"eqal","type_of_entity":"company","image":{"available_sizes":[[[64,90],"assets/images/resized/0001/7414/17414v8-max-150x150.png"],[[64,90],"assets/images/resized/0001/7414/17414v8-max-250x250.png"],[[64,90],"assets/images/resized/0001/7414/17414v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}