{"first_name":"Robb","last_name":"Duffield","permalink":"robb-duffield-2","crunchbase_url":"http://www.crunchbase.com/person/robb-duffield-2","homepage_url":"http://www.sequent.com","birthplace":"Okinawa","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Mobility Quotient","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 25 21:52:01 UTC 2010","updated_at":"Fri May 11 09:52:42 UTC 2012","overview":"<p>Robb is SVP of Corporate Development at Sequent, leading strategy, partnerships, and financing. Prior to Sequent, he was a Director of Corporate Business Development with SK Telecom Americas focusing on strategic investments, acquisitions, and partnerships in the mobile payments and mobile banking industry. Under his direction, SK Telecom Americas and SK Telecom Ventures invested in Mobile Money Ventures, Billing Revolution and Sequent Software, respectively.</p>\n\n<p>Prior to joining SK Telecom Americas, Robb led the business development and marketing roles for Autodesk Location Services, a division of Autodesk (Nasdaq: ADSK). At Autodesk, he led the division’s growth strategy to include three product launches on two continents and the creation of a leading application developer program; which combined resulted in 3.5X revenue growth in his tenure.</p>\n\n<p>He previously owned a market development consulting group, Crux Consulting, advising both Fortune 500 and early stage companies in capturing new growth opportunities in emerging markets.</p>\n\n<p>Robb serves as an advisor to several SK Telecom Americas portfolio companies and is a board member of a mobile start-up, Mobility Quotient.</p>\n\n<p>Robb holds an MBA from Thunderbird, BA from Seattle University, and a Certificate of Distinction in Telecommunications and Network Engineering from UC Berkeley and has lived and worked in multiple countries. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Board Member","firm":{"name":"Mobility Quotient","permalink":"mobility-quotient","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}