{"first_name":"Robb","last_name":"Doub","permalink":"robb-tyler-doub","crunchbase_url":"http://www.crunchbase.com/person/robb-tyler-doub","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"New Markets Venture Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Nov 26 14:54:37 UTC 2008","updated_at":"Sat Dec 11 07:20:58 UTC 2010","overview":"<p>Robb joined New Markets Venture Partners as a General Partner in 2003. Robb is the lead administrative partner and serves as Board Director for eCoast Sales Solutions and board observer for Appfluent, Navtrak, and Three Stage Media. Robb also serves on the board of Egeen International and the Conflicts Advisory Board of the off-shore hedge funds managed by Deutsche Asset Management&#8217;s Absolute Return Strategies Group.</p>\n\n<p>Robb has been investing in high growth companies since 1993. Prior to New Markets, Robb was a Managing Director of the Small Enterprise Assistance Funds (SEAF), a $200 million managed emerging market venture capital company. Robb served on the board of SEAF portfolio companies in industries including pharmaceutical distribution, cable television, internet services, food retail and distribution, biotechnology, and enterprise software. Prior to SEAF, Robb was an Associate of Private Equities at the Calvert Group, a $10 billion socially responsible mutual fund and has worked for two start-up companies.</p>\n\n<p>Robb was a visiting professor at the University of Warsaw &#8216;s School of Business teaching finance to MBA candidates and has been a guest speaker the at the Kellogg School of Business at Northwestern and at the Johnson School of Business at Cornell.</p>\n\n<p>Robb graduated from the University of Vermont, with a major in History, and received a MBA with Honors from the Georgetown University. Robb is married with three children.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"New Markets Venture Partners","permalink":"new-markets-venture-partners-2","type_of_entity":"financial_org","image":{"available_sizes":[[[150,30],"assets/images/resized/0002/9665/29665v3-max-150x150.jpg"],[[250,51],"assets/images/resized/0002/9665/29665v3-max-250x250.jpg"],[[450,92],"assets/images/resized/0002/9665/29665v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}