{"first_name":"Robb","last_name":"Duffield","permalink":"robb-duffield","crunchbase_url":"http://www.crunchbase.com/person/robb-duffield","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Sequent Software","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 25 21:23:42 UTC 2010","updated_at":"Fri May 11 11:07:06 UTC 2012","overview":"<p>Robb Duffield is SVP of Corporate Development for Sequent, leading strategy, partnerships, and financing. Before joining Sequent, he was Director of Corporate Business Development with SK Telecom Americas focusing on strategic investments and acquisitions to exploit the convergence of mobile and internet businesses. Robb has led investments in mobile payments companies such as Billing Revolution, mobile banking via a joint venture with Citibank, Mobile Money Ventures, as well as location-based services providers such as deCarta. He has also played a leading role in developing and executing the SK Telecom Americas digital media strategy.</p>\n\n<p>Prior to joining SK Telecom Americas, Robb led the business development and marketing roles for Autodesk Location Services, a division of Autodesk (Nasdaq: ADSK). At Autodesk, he led the division&#8217;s growth strategy to include three product launches on two continents and the creation of a leading application developer program; which combined resulted in 3.5X revenue growth in his tenure. Robb previously owned a market development consulting group, Crux Consulting, advising both Fortune 500 and early stage companies in capturing new growth opportunities in emerging markets.</p>\n\n<p>Robb holds an MBA from Thunderbird, BA from Seattle University, and a Certificate of Distinction in Telecommunications and Network Engineering from UC Berkeley and has lived and worked in multiple countries</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Sequent","permalink":"sparq-mobile-solutions","type_of_entity":"company","image":{"available_sizes":[[[150,115],"assets/images/resized/0013/4048/134048v3-max-150x150.jpg"],[[250,191],"assets/images/resized/0013/4048/134048v3-max-250x250.jpg"],[[450,345],"assets/images/resized/0013/4048/134048v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}