{"first_name":"Robert","last_name":"McDowell","permalink":"robert-mcdowell","crunchbase_url":"http://www.crunchbase.com/person/robert-mcdowell","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Thu Aug 25 21:18:01 UTC 2011","updated_at":"Thu Aug 25 21:18:01 UTC 2011","overview":"<p>Robert M. McDowell was first appointed to a seat on the Federal Communications Commission by President George W. Bush and unanimously confirmed by the Senate in 2006. When he was reappointed to the Commission on June 2, 2009, Commissioner McDowell became the first Republican to be appointed to an independent agency by President Barack Obama. He was unanimously confirmed by the Senate on June 25, 2009.</p>\n\n<p>Commissioner McDowell brings to the FCC approximately sixteen years of private sector experience in the communications industry. Immediately prior to joining the FCC, Commissioner McDowell was senior vice president for the Competitive Telecommunications Association (CompTel), an association representing competitive facilities-based telecommunications service providers and their supplier partners. There he had responsibilities involving advocacy efforts before Congress, the White House and executive agencies. He has served on the North American Numbering Council (NANC) and on the board of directors of North American Numbering Plan Billing and Collection, Inc. (NBANC).</p>\n\n<p>Prior to joining CompTel in February 1999, McDowell served as the executive vice president and general counsel of America&#8217;s Carriers Telecommunications Association (ACTA), which merged with CompTel at that time.</p>\n\n<p>McDowell was graduated cum laude from Duke University in 1985. After serving as chief legislative aide to a member of the Virginia House of Delegates, he attended the Marshall-Wythe School of Law at the College of William and Mary. Upon his graduation from law school, McDowell joined the Washington, D.C., office of the national law firm of Arter &amp; Hadden.</p>\n\n<p>His involvement in civic and political affairs spans three decades. He was appointed by Virginia Governor George Allen to the Governor&#8217;s Advisory Board for a Safe and Drug-Free Virginia, and to the Virginia Board for Contractors where he served for eight years. A veteran of several presidential campaigns, his work during the 1992 presidential campaign is cited in the Almanac of American Politics, 1994. Among many other endeavors, McDowell has twice been a candidate for the Virginia General Assembly. He is a former Chairman of the Board of the McLean Project for the Arts, which strives to connect emerging artists with communities in the Washington region.</p>\n\n<p>He resides in Fairfax County, Va., on what’s left of the farm where he grew up, with his wife Jennifer and their three children.</p>","image":{"available_sizes":[[[150,142],"assets/images/resized/0015/1143/151143v1-max-150x150.jpg"],[[250,236],"assets/images/resized/0015/1143/151143v1-max-250x250.jpg"],[[265,251],"assets/images/resized/0015/1143/151143v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}