{"first_name":"Robert A.","last_name":"Ingram","permalink":"robert-a-ingram","crunchbase_url":"http://www.crunchbase.com/person/robert-a-ingram","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Hatteras Venture Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jun 05 12:20:40 UTC 2009","updated_at":"Wed Feb 09 00:15:37 UTC 2011","overview":"<p>Robert A. Ingram joined the Hatteras team in 2004 as as an advisor with HVP II. In addition to his role at Hatteras, Bob currently serves as Vice Chairman Pharmaceuticals at GlaxoSmithKline (plc), and previously served as the Chief Operating Officer and President of Pharmaceutical Operations. He is Chairman of the Board of OSI Pharmaceuticals, and serves on the board of directors of Allergan, Edwards Lifesciences Corporation, Valeant Pharmaceuticals, and Lowe&#8217;s Companies.</p>\n\n<p>He began his career in the pharmaceutical industry as a sales representative for the company that would later become Merrell Dow Pharmaceuticals, Inc. He advanced rapidly through sales management at Merrell Dow and into government and public affairs. He left Merrell Dow in 1985 as Vice President of Public Affairs to become Vice President of Government Affairs at Merck &amp; Co., Inc. In 1988, he was promoted to President of Merck Frosst Canada, Inc. In 1990, Bob left Merck to join Glaxo, Inc., Glaxo plc&#8217;s U.S. subsidiary, as Executive Vice President of Administrative and Regulatory Affairs and assumed a series of increasingly responsible positions, including Group Vice President. He was named Executive Vice President in January 1993, President and Chief Operating Officer in June 1993, President and Chief Executive Officer in March 1994 and Chairman in January 1999. As an Executive Director of Glaxo Wellcome plc, Bob held responsibility for operations in North America and Latin America. He was appointed to the global company&#8217;s board in May 1995. In October 1997, he became Chief Executive of Glaxo Wellcome with responsibility for worldwide business operations, and added the position of Chairman to his responsibilities. In January 2003, he was appointed Vice Chairman Pharmaceuticals, GlaxoSmithKline, and currently serves in that role.</p>","image":{"available_sizes":[[[123,150],"assets/images/resized/0004/6920/46920v1-max-150x150.jpg"],[[193,235],"assets/images/resized/0004/6920/46920v1-max-250x250.jpg"],[[193,235],"assets/images/resized/0004/6920/46920v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":" B.S. ","subject":"Business Administration","institution":"Eastern Illinois University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Hatteras Venture Partners","permalink":"hatteras-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,39],"assets/images/resized/0004/6917/46917v2-max-150x150.png"],[[250,65],"assets/images/resized/0004/6917/46917v2-max-250x250.png"],[[393,103],"assets/images/resized/0004/6917/46917v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}