{"first_name":"Robert","last_name":"Christie","permalink":"robert-christie","crunchbase_url":"http://www.crunchbase.com/person/robert-christie","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Mar 10 19:08:12 UTC 2010","updated_at":"Wed Mar 10 19:09:46 UTC 2010","overview":"<p>Robert Christie is the SVP of Corporate Communications at the New York Times. He previously served as vice president of communications at Dow Jones &amp; Company, where he was responsible for brand, executive and crisis communications for its consumer businesses worldwide.During his tenure at Dow Jones, Mr. Christie held several roles in the communications and public relations departments handling issues for Dow Jones corporate and its various business units, news departments and ad sales groups. He directed the communications campaigns for the launches of The Wall Street Journal Weekend Edition in 2005, the redesigned Journal in 2007 and the acquisition of CBSMarketWatch.com.</p>\n\n<p>Before joining Dow Jones in August 2003, Mr. Christie spent four years at Sony Electronics Inc., where he played a significant role in Sony’s communications efforts. Previously he served as a senior account director for Goodman Media International Inc., where he managed a wide range of client campaigns for the firm’s corporate clients. Mr. Christie began his career in 1990 at The National Academy of Television Arts and Sciences, where he served in a variety of media relations and public relations positions.</p>\n\n<p>In 2007, Mr. Christie was selected as one of the top 40 public relations executives in the United States under the age of 40 by PR Week magazine, the leading trade magazine for public relations professionals.</p>\n\n<p>Mr. Christie is a graduate of Mansfield University of Pennsylvania and in 2009 his alma mater awarded him its Society of Honors Outstanding Young Alumni Award.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"SVP Corporate Communications","firm":{"name":"New York Times","permalink":"newyorktimes","type_of_entity":"company","image":{"available_sizes":[[[150,28],"assets/images/resized/0001/0591/10591v1-max-150x150.png"],[[250,46],"assets/images/resized/0001/0591/10591v1-max-250x250.png"],[[389,73],"assets/images/resized/0001/0591/10591v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}