{"first_name":"Robert","last_name":"Shorr","permalink":"robert-shorr","crunchbase_url":"http://www.crunchbase.com/person/robert-shorr","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 15 11:51:23 UTC 2009","updated_at":"Mon Jun 15 19:27:26 UTC 2009","overview":"<p>Dr. Shorr is the Chief Executive Officer at Cornerstone Pharmaceuticals. </p>\n\n<p>Prior to joining Cornerstone, Dr. Shorr served as Chief Scientist for United Therapeutics (NASDAQ: UTHR). Dr. Shorr was responsible for the discovery of a longer acting form of Prostacyclin.\nDr. Shorr also spearheaded business development activities for the Center for Advanced Technology (CAT),  in biotechnology established by the State of New York at SUNY Stony Brook.   </p>\n\n<p>Previously Dr. Shorr served as Vice President Science and Technology and as Vice President for Research and Development at Enzon, Inc. (NASDAQ: ENZN). At Enzon, Dr. Shorr was responsible for management of the co-development, with Schering Plough, of a longer-acting, less-frequent dosing form of alpha interferon. The product, PEG INTRON A, is approved in the US and Europe. Dr. Shorr was also responsible for the ground-up establishment of both the preclinical and clinical development infrastructure and facilities, including CGMP fermentation, protein production and PEGylation manufacturing capability, synthetic chemistry, analytical chemistry, and pharmacology and toxicology functions to support clinical trials. In addition to PEG INTRON A, Dr. Shorr established an anticancer program serving as the basis for PEG Hemoglobin radiation sensitization and PEG-paclitaxel and PEG-camptothecin for solid tumor treatment clinical trials. </p>","image":null,"degrees":[{"degree_type":"Ph.D. and D.I.C.","subject":"Biochemistry ","institution":"University of London Imperial College of Science and Technology","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chief Executive Officer","firm":{"name":"Cornerstone Pharmaceuticals","permalink":"cornerstone-pharmaceuticals","type_of_entity":"company","image":{"available_sizes":[[[150,33],"assets/images/resized/0004/8562/48562v1-max-150x150.jpg"],[[250,56],"assets/images/resized/0004/8562/48562v1-max-250x250.jpg"],[[359,81],"assets/images/resized/0004/8562/48562v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}