{"first_name":"Robert","last_name":"Zangrillo","permalink":"robert-zangrillo","crunchbase_url":"http://www.crunchbase.com/person/robert-zangrillo","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"NorthStar Systems International","born_year":null,"born_month":null,"born_day":null,"tag_list":"livingsocial, facebook, zynga, dragon-global","alias_list":null,"created_at":"Wed Jan 07 06:20:57 UTC 2009","updated_at":"Mon Feb 13 04:46:50 UTC 2012","overview":"<p>Robert Zangrillo is the Founder, Chairman and CEO of Dragon Global.  Mr. Zangrillo is a veteran investor and/or executive in the social networking, entertainment media, eCommerce, software and mobile industries and his talents for providing significant financial returns for his investors and building teams dedicated to delivering leading industry solutions are widely known.  For the four years prior to launching the Fund, Mr. Zangrillo founded and continues to manage through affiliates multiple predecessor funds with investments in Facebook, Zynga and LivingSocial.  Mr. Zangrillo has twenty years of experience in venture capital and private equity investments, with a remarkable track record of making investments in leading technology growth companies.\nMr. Zangrillo was one of the early visionaries to recognize the enormous potential of Internet commerce in 1995 and how it would transform the way business is conducted in the new global economy.  Over the last twenty years, Mr. Zangrillo has been a prominent figure in the Internet community, with significant roles as a venture capital investor, active executive director and advisor to high-growth companies.  In addition to his more recent investments with respect to Facebook, Zynga (NASDAQ:ZNGA) and LivingSocial, Mr. Zangrillo has taken active roles with ArcSight (NASDAQ: ARST (acquired by Hewlett Packard (NYSE: HPQ))), EarthLink (NASDAQ: ELNK), InterWorld (NASDAQ: INTW (acquired by The Essar Group)), NorthStar (Acquired by SEI Investments (NASDAQ:SEIC)), Overture (NASDAQ: OVER (acquired by Yahoo! (NASDAQ: YHOO))) and UGO Networks (acquired by Hearst Communications).  Mr. Zangrillo has been recognized for his leadership in the industry and has received numerous personal and technology awards, such as 1998 Ernst &amp; Young Entrepreneur Of The Year and Crain&#8217;s Top 40 under 40 Award.\nPrior to his Internet career, Mr. Zangrillo was the Managing Director of the Cisneros Family Office where he was responsible for the management of venture capital, private and public equity, and real estate investments.  In addition, he was an associate in the Investment Banking Division at Donaldson, Lufkin &amp; Jenrette.  From 2001-2006, Mr. Zangrillo was a member of the Council on Foreign Relations, where he served on the Committee on Finance and Budget.  Mr. Zangrillo received his MBA from Stanford University Graduate School of Business and his BA from the University of Vermont.</p>","image":null,"degrees":[{"degree_type":"B.A.","subject":"","institution":"University of Vermont","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"Stanford University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"Stanford University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder & Chairman","firm":{"name":"NorthStar Systems International","permalink":"northstar-systems-international","type_of_entity":"company","image":{"available_sizes":[[[150,41],"assets/images/resized/0003/3258/33258v1-max-150x150.png"],[[250,68],"assets/images/resized/0003/3258/33258v1-max-250x250.png"],[[320,88],"assets/images/resized/0003/3258/33258v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Founder, Chariman & CEO","firm":{"name":"Dragon Global","permalink":"dragon-global","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.dragonglobal.com","title":"Dragon Global"}]}