{"first_name":"Robert","last_name":"Geiman","permalink":"robert-geiman","crunchbase_url":"http://www.crunchbase.com/person/robert-geiman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Polaris Venture Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Nov 13 17:49:37 UTC 2008","updated_at":"Sun Nov 16 05:55:27 UTC 2008","overview":"<p>Bob Geiman is a general partner in our Boston office. Bob joined Polaris in September 2002 and focuses primarily on investment opportunities in information technology.</p>\n\n<p>Experience:\nPrior to joining Polaris, Bob served in product and business development roles at Envoy Networks where he assisted on product architecture decisions and co-developed the company&#8217;s initial marketing strategy. Previous to Envoy Networks, Bob was with MCK Communications where he served as the Senior Director of Corporate Development and as a member of the executive team. His role included advising the President and CEO, managing business and product development relationships and building sales channels for the company&#8217;s next generation products, and leading the company&#8217;s initial public offering. Before MCK, Bob was an Associate at Summit Partners, a Boston-based private equity firm, where he focused on making investments in communications hardware and software companies and enterprise software businesses. He also served on the Board of Directors for Virtual Prototypes, a Montreal-based public software company.</p>\n\n<p>Boards:\nBob represents Polaris on the Board of Directors of AePona, Paratek, Phreesia, Roundbox, and Wakonda Technologies.</p>\n\n<p>Education:\nBob has an MBA from Harvard Business School and holds a BA, cum laude, from Dartmouth College with a double major in History and Government with Honors. Bob studied a semester at Oxford University and was awarded a Rockefeller Grant to study intellectual property and anti-trust issues at the Stanford University Technology Policy Center.</p>","image":{"available_sizes":[[[91,150],"assets/images/resized/0002/8636/28636v2-max-150x150.jpg"],[[117,192],"assets/images/resized/0002/8636/28636v2-max-250x250.jpg"],[[117,192],"assets/images/resized/0002/8636/28636v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Polaris Venture Partners","permalink":"polaris-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,36],"assets/images/resized/0001/1153/11153v1-max-150x150.png"],[[163,40],"assets/images/resized/0001/1153/11153v1-max-250x250.png"],[[163,40],"assets/images/resized/0001/1153/11153v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}