{"first_name":"Robert","last_name":"Buban","permalink":"robert-buban","crunchbase_url":"http://www.crunchbase.com/person/robert-buban","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Feb 18 13:08:15 UTC 2012","updated_at":"Sat Feb 18 13:09:56 UTC 2012","overview":"<p>Robert Buban has 23 years of experience in the business management and accounting fields. As an accounting professional, Bob was involved in voluminous document audits with complex document organization. Beginning in 1989, Bob served as a legal assistant and a legal assistant supervisor on document intensive cases, at one of the largest international law firms in Dallas, Texas. As a senior legal assistant, Bob acquired first-hand experience with the litigation document needs of corporate professionals, paralegals, and attorneys. With this solid background, he co-founded Texas Legal Copies, Inc. (TLC) in 1995. His vision for TLC integrated services not found at most document management companies, including trial set-up and paralegal outsourcing services, as well as document coding and scanning. Realizing that the future of document management would ultimately depend less on paper documents, and more heavily on digital format, iDOC Corp was formed. Once again, Bob has incorporated into iDOC Corp many services not commonly found in the industry, such as document hosting, development of customized software applications, and eDiscovery services. Bob holds a B.A. in Business Management and Economics from Drake University. He received his Legal Assistant’s degree in 1989 and has been a member of the Paralegal Division of the State Bar of Texas since 1991. Bob has been married to his wife Lisa for almost 25 years and they have two children. When not working, Bob enjoys cycling and running and has participated in the Texas Two Hundred, The Cross Timbers Classic, The Freedom Run and the Susan G. Komen Race for the Cure. Bob and his family are active members of Northwest Bible Church in Dallas.</p>","image":{"available_sizes":[[[125,150],"assets/images/resized/0017/4823/174823v1-max-150x150.jpg"],[[129,154],"assets/images/resized/0017/4823/174823v1-max-250x250.jpg"],[[129,154],"assets/images/resized/0017/4823/174823v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"IDOC Corp","permalink":"idoccorp","type_of_entity":"company","image":{"available_sizes":[[[150,42],"assets/images/resized/0017/4821/174821v1-max-150x150.jpg"],[[176,50],"assets/images/resized/0017/4821/174821v1-max-250x250.jpg"],[[176,50],"assets/images/resized/0017/4821/174821v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}