{"first_name":"Robert W","last_name":"Jones III","permalink":"robert-w-jones-iii","crunchbase_url":"http://www.crunchbase.com/person/robert-w-jones-iii","homepage_url":"http://mesaprobateattorney.net/index.html","birthplace":"","twitter_username":"RobertW_Jones","blog_url":"http://robertwjonesblog.com/","blog_feed_url":"","affiliation_name":"Robert W. Jones III P.C.","born_year":null,"born_month":null,"born_day":null,"tag_list":"lawyer","alias_list":null,"created_at":"Wed Apr 13 17:17:24 UTC 2011","updated_at":"Sat Apr 16 18:37:46 UTC 2011","overview":"<p>Attorney Robert W. Jones has been practicing law since 1973 in his law firm, Robert W. Jones III P.C., in Mesa, AZ.  His law practice mainly covers areas including: wills trusts and estates, probate, estate planning, estate administration, business and business planning, personal injury, estate settlements, ancillary probate, trust administration, and living trusts.</p>\n\n<p>Born in Bloomington, IL, Robert attended the school of law at the University of Illinois, J.D.  Some major accomplishments of Robert’s include: the President of the East Valley Estate Planning Council from 1980 to 1981, the Co-Chairman of the Mesa Tax Study Group from 2002 to 2003 and again from 2006 to 2007.  He is a member of the State Bar of Arizona in the Section of Probate and Trust Law; Robert was also the Probate Chairman from 1978 to 1979 and the Secretary from 1976 to 1978.  This attorney’s professional life has been characterized by mentionable experiences such as an appearance as an expert witness in the 1992 Pinal Country trial involving attorney incompetency and fee gouging.  Attorney Robert W. Jones has been responsible for negotiations in many delicate cases including terminating irrevocable trusts in order to distribute assets to the entitled beneficiaries, and other complicated instances of trust administration.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Robert W. Jones III P.C.","permalink":"robert-w-jones-iii-p-c-2","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.yelp.com/biz/jones-robert-w-iii-pc-mesa","title":"Yelp"}]}