{"first_name":"Robert","last_name":"Donahue","permalink":"robert-donahue","crunchbase_url":"http://www.crunchbase.com/person/robert-donahue","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Mar 19 21:50:18 UTC 2008","updated_at":"Wed Mar 19 21:59:46 UTC 2008","overview":"<p>Robert M. Donahue, Jr. joined Quadrangle Group LLC in 2006 and is a Managing Principal focused on the firm’s public equity business, Quadrangle Equity Investors (&#8220;QEI&#8221;). He is the Portfolio Manager and Chief Investment Officer for QEI. Prior to joining the firm, Mr. Donahue founded and managed Harpoon Equity Management, LLC, a long/short market-directional equity principal trading firm that was transferred to Quadrangle and renamed Quadrangle Equity Investors. Prior to founding Harpoon in 2004, Mr. Donahue was a Managing Director with Citigroup’s Salomon Brothers Asset Management (SBAM) unit. He was with SBAM from 1997 to 2004 and was a leading member of the team that founded and grew the long/short market directional and long/short market neutral businesses. In addition, he served as co-portfolio manager of the Salomon Brothers Capital Fund and as the co-director of Research for SBAM. Mr. Donahue also served on the investment policy and management committees and directed all recruiting efforts for the SBAM professional staff. Prior to Salomon Brothers, Mr. Donahue was a Research Analyst with Gabelli &amp; Company from 1995 to 1997, covering the media and entertainment sectors. Prior to graduate school, Mr. Donahue was an analyst with The Hale Group, a strategic management consultancy. Mr. Donahue graduated in 1990 from the University of Pennsylvania with a Bachelor of Arts in history and in 1995 from the Columbia University Graduate School of Business with an M.B.A., Finance, where he earned membership in Beta Gamma Sigma, the business honor society.</p>","image":{"available_sizes":[[[131,150],"assets/images/resized/0001/5991/15991v1-max-150x150.jpg"],[[167,190],"assets/images/resized/0001/5991/15991v1-max-250x250.jpg"],[[167,190],"assets/images/resized/0001/5991/15991v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":null,"title":"Managing Principal","firm":{"name":"Quadrangle Group","permalink":"quadrangle","type_of_entity":"financial_org","image":{"available_sizes":[[[150,32],"assets/images/resized/0001/5980/15980v1-max-150x150.png"],[[250,53],"assets/images/resized/0001/5980/15980v1-max-250x250.png"],[[450,96],"assets/images/resized/0001/5980/15980v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}