{"first_name":"Robert","last_name":"S. Langer","permalink":"robert-s-langer","crunchbase_url":"http://www.crunchbase.com/person/robert-s-langer","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Combinent Biomedical Systems","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Dec 18 09:07:46 UTC 2009","updated_at":"Thu Apr 05 21:41:52 UTC 2012","overview":"<p>Robert S. Langer is the David H. Koch Institute Professor (there are 14 Institute Professors at MIT; being an Institute Professor is the highest honor that can be awarded to a faculty member).  Dr. Langer has written nearly 1,130 articles.  He also has approximately 800 issued and pending patents worldwide.  Dr. Langer’s patents have been licensed or sublicensed to over 220 pharmaceutical, chemical, biotechnology and medical device companies.  He is the most cited engineer in history.</p>\n\n<p>He served as a member of the United States Food and Drug Administration’s SCIENCE Board, the FDA’s highest advisory board, from 1995 - 2002 and as its Chairman from 1999 - 2002. </p>\n\n<p>Dr. Langer has received over 200 major awards including the 2006 United States National Medal of Science; the Charles Stark Draper Prize, considered the equivalent of the Nobel Prize for engineers, the 2008 Millennium Prize, the world’s largest technology prize and the 2012 Priestley Medal, the highest award of the American Chemical Society.  He is the also the only engineer to receive the Gairdner Foundation International Award; 72 recipients of this award have subsequently received a Nobel Prize.  Among numerous other awards Langer has received are the Dickson Prize for Science (2002), Heinz Award for Technology, Economy and Employment (2003), the Harvey Prize (2003), the John Fritz Award (2003) (given previously to inventors such as Thomas Edison and Orville Wright), the General Motors Kettering Prize for Cancer Research (2004), the Dan David Prize in Materials Science (2005), the Albany Medical Center Prize in Medicine and Biomedical Research (2005), the largest prize in the U.S. for medical research, induction into the National Inventors Hall of Fame (2006), the Max Planck Research Award (2008) and the Prince of Asturias Award for Technical and Scientific Research (2008).  In 1998, he received the Lemelson-MIT prize, the world’s largest prize for invention for being “one of history’s most prolific inventors in medicine.”  In 1989 Dr. Langer was elected to the Institute of Medicine of the National Academy of Sciences, and in 1992 he was elected to both the National Academy of Engineering and to the National Academy of Sciences.  He is one of very few people ever elected to all three United States National Academies and the youngest in history (at age 43) to ever receive thi distinction. </p>\n\n<p>Forbes Magazine (1999) and Bio World (1990) have named Dr. Langer as one of the 25 most important individuals in biotechnology in the world.  Discover Magazine (2002) named him as one of the 20 most important people in this area.  Forbes Magazine (2002) selected Dr. Langer as one of the 15 innovators world wide who will reinvent our future.  Time Magazine and CNN (2001) named Dr. Langer as one of the 100 most important people in America and one of the 18 top people in science or medicine in America (America’s Best).  Parade Magazine (2004) selected Dr. Langer as one of 6 “Heroes whose research may save your life.”  Dr. Langer has received honorary doctorates from Harvard University, the Mt. Sinai School of Medicine, Yale University, the ETH (Switzerland), the Technion (Israel), the Hebrew University of Jerusalem (Israel), the Universite Catholique de Louvain (Belgium), Rensselaer Polytechnic Institute, Willamette University, the University of Liverpool (England), Bates College, the University of Nottingham (England), Albany Medical College, Pennsylvania State University, Northwestern University, Uppsala University (Sweden) and the University of California – San Francisco Medal.  He received his Bachelor’s Degree from Cornell University in 1970 and his Sc.D. from the Massachusetts Institute of Technology in 1974, both in Chemical Engineering.</p>","image":null,"degrees":[{"degree_type":"BS","subject":"Chemical Engineering","institution":"Cornell University","graduated_year":1970,"graduated_month":null,"graduated_day":null},{"degree_type":"Sc.D.","subject":"Chemical Engineering","institution":"Massachusetts Institute of Technology","graduated_year":1974,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Co-founder","firm":{"name":"Combinent Biomedical Systems","permalink":"combinent-biomedical-systems","type_of_entity":"company","image":{"available_sizes":[[[150,59],"assets/images/resized/0007/0284/70284v1-max-150x150.jpg"],[[201,80],"assets/images/resized/0007/0284/70284v1-max-250x250.jpg"],[[201,80],"assets/images/resized/0007/0284/70284v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Co-founder","firm":{"name":"Living Proof","permalink":"living-proof","type_of_entity":"company","image":{"available_sizes":[[[150,38],"assets/images/resized/0005/0098/50098v1-max-150x150.jpg"],[[193,50],"assets/images/resized/0005/0098/50098v1-max-250x250.jpg"],[[193,50],"assets/images/resized/0005/0098/50098v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://web.mit.edu/langerlab/langer.html","title":""}]}