{"first_name":"Robert","last_name":"Peck","permalink":"robert-peck-2","crunchbase_url":"http://www.crunchbase.com/person/robert-peck-2","homepage_url":"http://www.linkedin.com/profile/view?id=684462","birthplace":"New York","twitter_username":"bpeck","blog_url":"http://innovationbanker.wordpress.com/","blog_feed_url":"","affiliation_name":"CoRise Co","born_year":1970,"born_month":1,"born_day":15,"tag_list":"robert-peck-bear-stearns-corise-merchant-investment-banking-research-digital-media-internet","alias_list":null,"created_at":"Mon Jan 09 19:24:10 UTC 2012","updated_at":"Fri Jan 20 09:05:25 UTC 2012","overview":"<p>Robert is the President of CoRise, a merchant bank focused on digital media.</p>\n\n<p>Robert’s involvement in the Internet sector and its assortment of technologies and services dates back to the advent of this disruptive sector. Robert has been a top-ranked industry analyst and a recognized thought leader throughout this time.</p>\n\n<p>Robert discovered his passion for finance and technology concurrently, starting his career in 1992 as an analyst for Merrill Lynch in the Investment Banking technology department. Seeing the changes taking place in technology, media, social interactions, and commerce, awakened his perspective of the confluent opportunity space that was beginning to emerge. Subsequently he set out to hone his skills to focus on this burgeoning sector. </p>\n\n<p>Robert left Merrill Lynch in 1995 to augment his finance skills at Columbia Business School, where he received his MBA with a concentration in Finance in 1997. Upon graduation, he joined the Lehman Brothers equity research department as a junior analyst, covering several technology and media companies. His tenacious interest in the industry led to his promotion to Senior Analyst, with his own coverage universe, in only 18 months. </p>\n\n<p>In 2000, Bear Stearns recruited Robert from Lehman to augment the Technology, Media, and Telecom research team. While Robert started primarily on traditional technology companies, he soon added a wide assortment of Internet companies to his coverage universe. It was here that he discovered the greatest concentration of emerging models and was inspired by the opportunities rapidly arising. Robert became an Institutional Investor-ranked analyst from 2003 until he left the sell-side in 2008, and was ranked as one of The Wall Street Journal’s “Best on the Street.” </p>\n\n<p>Robert joined Baron Capital, a $20 billion mutual fund company, in 2008. At Baron he led Internet research and also covered other technology and media companies. This deeper exposure gave Robert an even keener sense of the disruption and innovation opportunities on the horizon. In 2011, Robert founded Quasar Capital Advisors, where he provided strategic and funding advice to multiple technology companies. Most recently, Quasar merged into CoRise, where Robert focuses on clients in the confluent opportunity space. </p>\n\n<p>Robert has made multiple appearances on CNBC, and has been frequently quoted in The Wall Street Journal, The New York Times, and industry publications. He has also met with and interviewed leading technology CEOs, including Eric Schmidt and others. </p>\n\n<p>Robert has earned a Chartered Financial Analyst (CFA) designation, and is a member of the NY Society of Security Analysts. He resides in Connecticut with his wife and children.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0016/9406/169406v2-max-150x150.jpg"],[[168,126],"assets/images/resized/0016/9406/169406v2-max-250x250.jpg"],[[168,126],"assets/images/resized/0016/9406/169406v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"Finance","institution":"Columbia Business School","graduated_year":1997,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President","firm":{"name":"CoRise Co","permalink":"corise-co","type_of_entity":"company","image":null}},{"is_past":false,"title":"President","firm":{"name":"CoRise","permalink":"corise","type_of_entity":"company","image":{"available_sizes":[[[150,41],"assets/images/resized/0016/9405/169405v2-max-150x150.jpg"],[[179,50],"assets/images/resized/0016/9405/169405v2-max-250x250.jpg"],[[179,50],"assets/images/resized/0016/9405/169405v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Internet analyst","firm":{"name":"Baron Capital","permalink":"baron-capital","type_of_entity":"company","image":null}},{"is_past":true,"title":"Sr. MD - Internet Research","firm":{"name":"Bear Stearns Investment Bank","permalink":"bear-stearns-investment-bank","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"http://www.youtube.com/watch?v=9HM-ZO2lNwA","description":"<p>Interviewing Eric Schmidt, Google CEO</p>"}],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/profile/view?id=684462","title":""}]}