{"first_name":"Robbie","last_name":"Bach","permalink":"robert-bach","crunchbase_url":"http://www.crunchbase.com/person/robert-bach","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Microsoft","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri May 23 02:51:43 UTC 2008","updated_at":"Thu Mar 26 20:46:49 UTC 2009","overview":"<p>As president of Microsoft’s Entertainment &amp; Devices Division, Robbie Bach drives the company’s Connected Entertainment vision, offering consumers new and compelling, branded entertainment experiences across music, gaming, video and mobile communications. As such, Bach’s responsibilities include guiding software, services and hardware innovation throughout Microsoft’s entertainment and mobility platforms, and bringing those solutions to market with retailers and partners. Consequently, he manages Microsoft’s worldwide retail relationships as well as media and entertainment partner relationships.</p>\n\n<p>The Entertainment &amp; Devices Division is a global division comprising five main businesses: Interactive Entertainment Business, home to the Xbox® and Games for Windows® gaming platforms; Mobile Communications Business, which develops and markets Windows Mobile software, services and applications; Media Business, developers of the Zune® portable entertainment devices and services; Connected TV Business, which includes Microsoft® TV and eHome groups; and the Specialized Devices and Applications Business, which includes PC Hardware, Microsoft® Surface, Mac Office, Microsoft® Auto, and Windows Embedded software.</p>\n\n<p>Since joining Microsoft in 1988, Bach has worked on a variety of Microsoft products in a career marked by increasingly senior management positions. His experience includes working in Europe as the Manager of Business Operations from 1990-1992. He also led the marketing effort for Microsoft Office from 1992-1997. Before the formation of the E&amp;D Division in 2005, Bach managed the global launches of Xbox and Xbox 360 in his dual role as Chief Xbox Officer and head of the Home and Entertainment group – a global division then responsible for Xbox®, Windows® games, the Microsoft® TV platform, and consumer hardware and software products.</p>\n\n<p>Before joining Microsoft, Bach worked as a financial analyst at Morgan Stanley &amp; Co. He has a bachelor’s degree in economics from the University of North Carolina at Chapel Hill and an MBA from Stanford University. Bach sits on the Board of Governors for the Boys &amp; Girls Clubs of America, where he leads the BGCA Marketing Committee, and currently serves as chairman of the Entertainment Software Association. He is married with three children.</p>","image":{"available_sizes":[[[117,150],"assets/images/resized/0001/9214/19214v1-max-150x150.jpg"],[[155,198],"assets/images/resized/0001/9214/19214v1-max-250x250.jpg"],[[155,198],"assets/images/resized/0001/9214/19214v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.microsoft.com/presspass/exec/rbach/default.mspx\" title=\"Microsoft\" rel=\"nofollow\">Microsoft</a></p>"},"degrees":[{"degree_type":"Bachelor of Arts","subject":"Economics","institution":"University of North Carolina at Chapel Hill","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"Stanford University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President, Entertainment & Devices Division","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}