{"first_name":"Robert","last_name":"M. Lippmann","permalink":"robert-m-lippmann","crunchbase_url":"http://www.crunchbase.com/person/robert-m-lippmann","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Nov 29 21:28:52 UTC 2008","updated_at":"Sat Nov 29 21:30:40 UTC 2008","overview":"<p>Rob is responsible for assisting our portfolio companies in all areas of information technology including hands-on assistance in product development. He has over 10 years of experience in information technology in a wide variety of industries including Internet Advertising, Interactive Television, Financial Services, Biotechnology, Construction, and Mortgage Banking. His involvement covers the entire systems life-cycle: initial strategy development and analysis, development of customized applications, and final deployment and operation. Rob is also a Vice President of IMS Ventures. Prior to joining IMS in 1999, Rob was the Director of Technology and Chief Architect at Intelligent Interactions Corporation. Rob has also held several technical positions at Oracle Corporation. Most recently he was a senior developer and designed and developed Oracle Interactive Application Objects, a client/server based toolkit for developing object oriented CORBA compliant Oracle Media Server based applications. Prior to joining Oracle, Rob was an Applications Developer, System Administrator and Data Base Analyst for Empbanque Capital Corporation.</p>\n\n<p>Rob holds a Bachelor of Science degree in Management Science (concentrations in Accounting and Management Systems, minor in Computer Science) from Rensselaer Polytechnic Institute, and a Master of Science in Industrial Engineering from Northwestern University.</p>\n\n<p>Rob is the co-inventor of US Patent No. 5,826,085, &#8220;An Object-Oriented Computer Interface Supporting Interactive Networked Applications.&#8221; </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Director","firm":{"name":"Columbus Venture Capital","permalink":"columbus-venture-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,10],"assets/images/resized/0003/0184/30184v1-max-150x150.jpg"],[[250,17],"assets/images/resized/0003/0184/30184v1-max-250x250.jpg"],[[450,31],"assets/images/resized/0003/0184/30184v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}