{"first_name":"Robert","last_name":"Smith","permalink":"robert-smith-6","crunchbase_url":"http://www.crunchbase.com/person/robert-smith-6","homepage_url":"http://www.RobertDaleSmith.com/","birthplace":"Pasadena, Texas","twitter_username":"RobertDaleSmith","blog_url":"http://www.RobertDaleSmith.com/blog","blog_feed_url":"http://www.robertdalesmith.com/rss.xml","affiliation_name":"Chromemote","born_year":1985,"born_month":1,"born_day":24,"tag_list":"entrepreneur, developer","alias_list":null,"created_at":"Wed Jul 25 09:17:11 UTC 2012","updated_at":"Sat Jul 28 11:25:51 UTC 2012","overview":"<p>Robert Dale Smith is an entrepreneur, software developer, and computer support specialist. Founder and developer of Chromemote, the smart remote control, and Co-Founder of Digital Crisis Inc., and IT service business providing premium IT support to everybody equally. Robert studied Entrepreneurship, Computer Science, and Mathematics at the University of Houston. </p>\n\n<p>With over a decade of experience in the computer repair business, Robert has built multiple IT service businesses. In 2007, Robert&#8217;s innovative work station design for computer technicians helped propel Friendly Computers in Houston to the top franchise location in the nation. In 2009, Robert founded Digital Crisis Inc., a premium IT service business that provides top quality computer support for everybody in the Houston area. </p>\n\n<p>Despite his passion for troubleshooting computer problems and helping others to love computers as much as he does, Robert realized he didn&#8217;t want to just fix computers but rather he desired to contribute to advancing future technology. This led him to study computer science and mathematics at the University of Houston. Durring his first semester as an undergraduate Robert fell in love with research and development working as a research assistant for the Quantitative Imaging Laboratory. </p>\n\n<p>While at the university, Robert dropped into a couple of the entrepreneurship courses and reawaken his deep seeded passion for entrepreneurship. Shortly after completing the Corporate Entrepreneurship program offered by the Bauer College of Business at the University of Houston, Robert went on to participate in the universities first ever 3DayStartup event. The idea that Robert pitched made it to the final presentation round of the event, where his team won the 3DS Golden Energy Drink Award for never giving up, staying up all night, and creating a working demo just in time for the final pitch to investors.</p>\n\n<p>Robert has carried on with the idea he pitched and founded the startup Chromemote. Chromemote is a &#8216;smart remote&#8217; for the &#8216;smart tv&#8217;. Chromemote is to the remote control, what the smart phone was to the traditional telephone. It provides a perceptive unified remote control interface that is accessible from all the devices you use most often. Remote controls are ever increasingly difficult to learn and to manage. With Chromemote you never have to search for the remote because its on your laptop, desktop, mobile, and tablet devices.</p>","image":{"available_sizes":[[[116,150],"assets/images/resized/0020/2718/202718v2-max-150x150.jpg"],[[193,250],"assets/images/resized/0020/2718/202718v2-max-250x250.jpg"],[[269,347],"assets/images/resized/0020/2718/202718v2-max-450x450.jpg"]],"attribution":"<p>Chromemote</p>"},"degrees":[{"degree_type":"Associates of Arts","subject":"Mathematics","institution":"San Jacinto College","graduated_year":2006,"graduated_month":null,"graduated_day":null},{"degree_type":"Corporate Entrepreneurship Certificate","subject":"Entrepreneurship","institution":"University of Houston","graduated_year":2012,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder and Developer","firm":{"name":"Chromemote","permalink":"chromemote","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://bauerticker.uh.edu/events/5426865/","title":""},{"external_url":"http://www.guidrynews.com/05Community/36505SanJac.htm","title":""}],"web_presences":[{"external_url":"http://www.robertdalesmith.com/","title":"Blog"},{"external_url":"http://www.youtube.com/ffpsx","title":""},{"external_url":"http://www.linkedin.com/in/RobertDaleSmith","title":""},{"external_url":"https://twitter.com/RobertDaleSmith","title":""},{"external_url":"https://plus.google.com/111291216195697323432/","title":""}]}