{"first_name":"Robert","last_name":"J. Flanagan","permalink":"robert-j-flanagan","crunchbase_url":"http://www.crunchbase.com/person/robert-j-flanagan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jun 06 15:40:09 UTC 2009","updated_at":"Sat Jun 06 15:41:04 UTC 2009","overview":"<p>With a diverse business background ranging from professional sports to technology, Mr. Flanagan oversees the acquisition, management and development of new investment opportunities for CEI.</p>\n\n<p>Prior to joining CEI, he was treasurer, secretary and a member of the board of directors of Baltimore Orioles, Inc. He received a B.S. in business administration from Georgetown University and a master&#8217;s degree in taxation from the American University School of Business. Outside activities include: Washington&#8217;s Federal City Council, the Catholic Charities Foundation, Girl Scouts of America - National Capital Region and the Knights of Malta.</p>\n\n<p>In a complementary role, Mr. Flanagan also serves as Managing Director of CNF Investments LLC, the private equity division of CEI. Since its inception in 1997, Mr. Flanagan has overseen the growth in CNF to its current status as one of the region&#8217;s more dynamic investment funds. Mr. Flanagan is a member of the board of directors of several CNF portfolio companies including: Eagle Oil &amp; Gas Co., ILD Telecommunications, Inc., Martek Biosciences Corporation, MonoSol Rx and Angel Medical Systems, Inc. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Executive Vice President","firm":{"name":"CNF Investments","permalink":"cnf-investments","type_of_entity":"financial_org","image":{"available_sizes":[[[150,60],"assets/images/resized/0004/7132/47132v1-max-150x150.png"],[[232,94],"assets/images/resized/0004/7132/47132v1-max-250x250.png"],[[232,94],"assets/images/resized/0004/7132/47132v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}