{"first_name":"Robert","last_name":"Gallucci","permalink":"robert-gallucci","crunchbase_url":"http://www.crunchbase.com/person/robert-gallucci","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jul 28 21:40:35 UTC 2008","updated_at":"Tue Jul 29 01:43:05 UTC 2008","overview":"<p>Robert Gallucci has a broad range of experience in the technology consulting industry with a strong track record working with the Fortune 500 to implement innovative solutions in IT and business applications. Robert has served as the chief architect and design expert for several enterprise-wide document management and litigation support solutions, including global deployment of Interwoven at several major law firms. His career began at Pfizer Corporation (Upjohn Company) in pharmaceutical sales and operations. From there, Rob joined McGraw Hill Companies as a Network Manager where he worked on the convergence of the departmental LAN into the Enterprise WAN. Rob proceeded to serve a Senior Technology Consultant in the Network &amp; Infrastructure group at Baker Robbins &amp; Company where he worked internationally to develop a secure data warehouse and robust document e-discovery management solution for a Consumer Goods Manufacturer facing multiple global litigation assaults and risk management issues. With an acute understanding of how technology translates into business needs, Rob works as a liaison between the business and technology departments focusing on the development and integration of Security and Compliance solutions for cutting-edge IT groups within the Fortune 500. Rob graduated with a B.S. in Management from Florida International University, and enjoys competitive mountain biking and charity cycling events in his spare time.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"General Partner","firm":{"name":"Landmark Ventures","permalink":"landmark-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,92],"assets/images/resized/0002/2859/22859v7-max-150x150.jpg"],[[250,153],"assets/images/resized/0002/2859/22859v7-max-250x250.jpg"],[[450,277],"assets/images/resized/0002/2859/22859v7-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}