{"first_name":"Robert","last_name":"Kummer","permalink":"robert-kummer","crunchbase_url":"http://www.crunchbase.com/person/robert-kummer","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jul 10 18:05:25 UTC 2011","updated_at":"Sun Jul 10 18:17:08 UTC 2011","overview":"<p>Prior to co-founding National Surgery Network, Mr. Kummer served as CFO of Healthplace America from startup through a reach of covering plans representing more than 300,000 lives. As part of his role, Mr. Kummer managed the development of the company’s information systems infrastructure – the platform making this innovative business model possible.</p>\n\n<p>Mr. Kummer helped found eBondUSA.com, an online municipal bond dealer focused on the interdealer market. He served as the company’s financial principal and took the company from its formation through registration with the NASD as a broker-dealer. Mr. Kummer held NASD registrations as Series 7 (representative), Series 24 (securities principal), Series 27 (financial &amp; operations principal), and Series 53 (municipal securities principal). He also served as project manager and principal architect for the company’s clearing and settlement system.</p>\n\n<p>From 1994 to 1998, Mr. Kummer served as the Chief Financial Officer of Agincourt, Ltd. At Agincourt, he supported the firm’s investment banking activities for both taxable and tax-exempt issuers, project finance, business financial management, and strategic planning. Working with a specialty insurer in Bermuda, he helped develop a program designed to effectively segregate and securitize credit risk from the tax-exempt interest feature of municipal securities within IRS guidelines.</p>\n\n<p>From 1991 to 1993, he was recruited into the CFO role for Discovery Corporation, a financially troubled consumer products manufacturing firm located in Vancouver, Washington. By rationalizing its product line and very carefully managing vendor relationships, he was able to turn the business around without the need for outside capital. He also had the opportunity to create and implement a manufacturing bill of materials system, which greatly simplified ordering and reduced costs.</p>\n\n<p>Prior to that, he was Vice President and Managing Director for Page Mill Intercapital Company, a New York merchant bank, where he performed strategic analysis, development and execution of new acquisition opportunities.</p>\n\n<p>Mr. Kummer began his financial career as an analyst with Merrill Lynch &amp; Co.’s Investment Banking Division. Working both in New York and Los Angeles, he helped develop a number of innovative financial products and services.</p>","image":{"available_sizes":[[[105,131],"assets/images/resized/0014/3371/143371v1-max-150x150.jpg"],[[105,131],"assets/images/resized/0014/3371/143371v1-max-250x250.jpg"],[[105,131],"assets/images/resized/0014/3371/143371v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"M.B.A.","subject":"","institution":"University of Pennsylvania, The Wharton School","graduated_year":1989,"graduated_month":null,"graduated_day":null},{"degree_type":"B.S.","subject":"Engineering","institution":"Princeton University","graduated_year":1984,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CFO","firm":{"name":"National Surgery Network","permalink":"national-surgery-network","type_of_entity":"company","image":{"available_sizes":[[[150,33],"assets/images/resized/0014/3366/143366v1-max-150x150.jpg"],[[250,56],"assets/images/resized/0014/3366/143366v1-max-250x250.jpg"],[[408,92],"assets/images/resized/0014/3366/143366v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}