{"first_name":"Robert","last_name":"Brouillette","permalink":"robert-brouillette","crunchbase_url":"http://www.crunchbase.com/person/robert-brouillette","homepage_url":"http://ca.linkedin.com/in/robertbrouillette","birthplace":"Granby, Quebec, Canada","twitter_username":"rbrouillette","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1948,"born_month":8,"born_day":4,"tag_list":"","alias_list":null,"created_at":"Mon Aug 02 18:48:47 UTC 2010","updated_at":"Mon Aug 02 20:08:59 UTC 2010","overview":"<p>Robert Brouillette is an Angel Investor and Start-up Mentor.</p>\n\n<p>He holds an engineering degree from University of Sherbrooke (1972) and a law degree from University of Laval (1975). He is a member of the Quebec Order of Engineers and of the Quebec Bar. He is an accredited trademark and patent agent in Canada and the US. He is also a Certified Licensing Professional (CLP).</p>\n\n<p>He began his career with Ogilvy Renault in 1977. He founded BCF in 1992. Mr. Brouillette recently founded Brouillette &amp; Partners a Law/Patent and Trademark firm focusing on Entrepreneurs and Innovators.</p>\n\n<p>A majority of his clients are business builders and operate technological enterprises. He has also developed a clientèle in the field of direct selling.</p>\n\n<p>He has become a leading Canadian expert in the fields of intellectual property, direct sales and technology law (The Best Lawyers in Canada).</p>\n\n<p>Mr. Brouillette is a former president of the executive of the national Intellectual Property Law section of the Canadian Bar Association. He is a member of different associations operating in the field of intellectual property and direct selling including the Intellectual Property Institute of Canada, the Licensing Executive Society, the American Intellectual Property Law Association, International Trademark Association, DSA (Canada and USA) and Réseau Action TI Québec.</p>\n\n<p>He is currently a member of the board of directors or advisory committee of a number of companies including: Iweb Group Inc., Investissements Mondias Inc., Leddartech Inc., Newtrax Holdings Inc., Simsmart Technologies Inc. and Transit Publishing Inc. He was a member of the board of directors of Hydro-Quebec between 1998 and 2001 and of Hydro-Quebec Capitech and of Hydro-Quebec Industech between 2001 and 2007.</p>\n\n<p>He is a member of the board of directors of Anges Québec and Capital 16 (two angel investor groups) and has invested as an angel investor/mentor in a number of start-ups.</p>\n\n<p>Specialties:</p>\n\n<p>Intellectual Property (Audits, Securing, Licensing, Transfer, Due Diligence, Litigation), Business Financing &amp; Venture Capital, Business Start-ups and Incorporations, Canadian Implementation, Direct Selling Agreements, Distribution/Representation Agreements, Employment &amp; Consulting Agreements, General Commercial Agreements, International Agreements, Mergers &amp; Acquisitions, Partnerships, Joint-Ventures &amp; Alliances, Purchase &amp; Sale of Businesses, Shareholders Agreements</p>","image":{"available_sizes":[[[149,150],"assets/images/resized/0009/5718/95718v2-max-150x150.jpg"],[[248,250],"assets/images/resized/0009/5718/95718v2-max-250x250.jpg"],[[447,450],"assets/images/resized/0009/5718/95718v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}