{"first_name":"Robert","last_name":"Miller","permalink":"robert-miller-3","crunchbase_url":"http://www.crunchbase.com/person/robert-miller-3","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Nov 17 07:58:12 UTC 2008","updated_at":"Mon Aug 24 21:12:14 UTC 2009","overview":"<p>Mr. Miller is a co-founder of Greywolf Capital and Portfolio Manager for the CLO.  Previously, Mr. Miller was the Firm&#8217;s Head Trader, conducted and supervised credit research, and was a member of the investor relations team.  Prior to co-founding Greywolf Capital, Mr. Miller had been a Senior Trader at Goldman Sachs, where he had worked for 10 years.  Mr. Miller began his career at PNC in 1984.  During his three years at PNC, Mr. Miller successfully completed PNC&#8217;s credit training program and served as a senior credit analyst and then a loan officer.  Mr. Miller left PNC in 1986 to pursue his M.B.A.  Upon receiving his M.B.A. in 1989, Mr. Miller joined Goldman Sachs as a Trader in the Corporate Bond Department, where he was responsible for facilitating customer business and evaluating and initiating proprietary positions for the firm.  After five years in the Corporate Bond Department, Mr. Miller joined the High Yield Trading Desk as a Senior Trader.  Mr. Miller became Manager of the High Yield Trading Desk in 1998 and in this role was responsible for position and risk management of Goldman Sachs&#8217; high yield traders in the US and London which involved aggregating, assessing and hedging Goldman Sachs&#8217; high yield exposure worldwide.  After concluding a ten-year career at Goldman Sachs in 2000, Mr. Miller was retained as a consultant to Goldman Sachs for a year and a half.  During his career, Mr. Miller has traded and analyzed most major industry sectors and held proprietary positions in straight debt, common and preferred stock, futures, convertibles, trust preferred shares, swaps and equipment trust certificates.  Mr. Miller received a B.A. magna cum laude from Franklin and Marshall College in 1983 and an M.B.A., with honors, from UNC-Chapel Hill in 1989.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Greywolf Capital Partners","permalink":"greywolf-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,47],"assets/images/resized/0002/8725/28725v1-max-150x150.png"],[[227,72],"assets/images/resized/0002/8725/28725v1-max-250x250.png"],[[227,72],"assets/images/resized/0002/8725/28725v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}