{"first_name":"Robert","last_name":"Geneid","permalink":"robert-geneid","crunchbase_url":"http://www.crunchbase.com/person/robert-geneid","homepage_url":"http://www.robertgeneid.com","birthplace":"Australia","twitter_username":"","blog_url":"http://robert-geneid.tumblr.com","blog_feed_url":"","affiliation_name":"Department of Public Works New South Wales","born_year":null,"born_month":null,"born_day":null,"tag_list":"robert-geneid, ecotourism, law, civil-engineering, malaysia, mulu-valley","alias_list":null,"created_at":"Thu Aug 30 13:23:21 UTC 2012","updated_at":"Thu Sep 06 08:33:39 UTC 2012","overview":"<p>Robert Geneid – Entrepreneur and Leader</p>\n\n<p>Robert Geneid is a sought after consultant in the field of engineering and law and business in South East Asia. With Bachelor degrees in both disciplines and a wealth of experience equally, Robert Geneid brings that added extra to his role as entrepreneur in one of the toughest business regions in the world.</p>\n\n<p>Property Development Expert</p>\n\n<p>With over two decades of experience in the world of business, large scale engineering and legal requirements of doing business in South East Asia, Robert Geneid lends his passion and commitment to a number of projects. Currently the Managing Director of the company that owns the Royal Mulu Resort, Robert Geneid has brought his experience and talent to enable the development of ecotourism and sustainable development to the Sarawak region of Malaysia. Robert also holds the position of Managing Director of Kumpulan Construction Sdn Bhd and was responsible for the development and construction of the Kuching Outdoor Stadium and the New Kuching Port. Both projects were completed on time and on budget; a rarity in the world of engineering and construction.</p>\n\n<p>Business Consultant</p>\n\n<p>Robert Geneid is an entrepreneur with a heart of adventure and with the business acumen and talent to back it up. He is deeply committed to every project that he is involved in and uses his legal and engineering experience to help drive business in South East Asia, as well as to encourage international corporations to invest in diverse business opportunities in this dynamic region of the world. Often asked to consult for international businesses, Robert Geneid is considered an authority on the world of doing business in South East Asia.</p>\n\n<p>Tourism and Sustainable Development</p>\n\n<p>It may be his business talent and business experience that places Robert Geneid ahead, but it is his passion for the planet that drives him to succeed. Apart from his business ventures in the Sarawak region and the development of a Marriott world-first Nature Resort, Robert is a board member and advisor to the Malaysian tourism industry. It is his firm belief that the development of tourism in ecologically sensitive regions of the world must take into account all of the factors. Success is not just based on the amount of visitors to the region, but on ensuring sustainability and diversification for the betterment of all.\nCurrently based in Malaysia, where he lives with his wife and seven children, Robert Geneid is a private man and prefers to spend his free time with his family and introducing them to the rich heritage of the natural planet. Robert Geneid has spent many years honing his skills and is able to offer a wide range of expertise and dynamic talent to businesses in Malaysia, Indonesia and Singapore. Crediting his love for the planet to his formative years in Australia, Robert Geneid is at home in the boardroom, courtroom, on site and outdoors; a rare combination that is held up as an example to modern business.</p>","image":{"available_sizes":[[[79,89],"assets/images/resized/0020/9746/209746v2-max-150x150.jpg"],[[79,89],"assets/images/resized/0020/9746/209746v2-max-250x250.jpg"],[[79,89],"assets/images/resized/0020/9746/209746v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Batchelor of Engineering","subject":"Civil Engineering","institution":"University of New South Wales","graduated_year":1977,"graduated_month":null,"graduated_day":null},{"degree_type":"Batchelor of Law","subject":"Law","institution":"University of New South Wales","graduated_year":1986,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Borsarmulu Resort Sdn Bhd","permalink":"borsarmulu-resort-sdn-bhd","type_of_entity":"company","image":null}},{"is_past":true,"title":"Engineer","firm":{"name":"Department of Public Works New South Wales","permalink":"department-of-public-works-new-south-wales","type_of_entity":"company","image":null}},{"is_past":true,"title":"Solicitor","firm":{"name":"Freehill, Hollingdale and Page, Sydney and Singapore","permalink":"freehill-hollingdale-and-page-sydney-and-singapore","type_of_entity":"company","image":null}},{"is_past":true,"title":"Project Engineer","firm":{"name":"Bechtel Corporation Jubail Industrial City Kingdom of Saudi Arabia","permalink":"bechtel-corporation-jubail-industrial-city-kingdom-of-saudi-arabia","type_of_entity":"company","image":null}},{"is_past":true,"title":"Partner","firm":{"name":"Mallesons Stephen Jaques, Singapore","permalink":"mallesons-stephen-jaques-singapore","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://robertgeneid.com","title":"Robert Geneid official LookUpPage"},{"external_url":"http://www.robertgeneid.org/","title":"Robert Geneid - wiki page"}],"web_presences":[]}