{"first_name":"Robert","last_name":"Schrimpff","permalink":"robert-schrimpff","crunchbase_url":"http://www.crunchbase.com/person/robert-schrimpff","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Mar 10 18:51:53 UTC 2010","updated_at":"Wed Mar 10 18:55:44 UTC 2010","overview":"<p>Robert Schrimpff works at Novus Modus, a clean energy investment and advisory firm.  He previously served as the EIR at <a href=\"/financial-organization/tvm-capital\" title=\"TVM Capital.\" rel=\"nofollow\">TVM Capital.</a></p>\n\n<p>Robert is involved in European deal sourcing primarily in the areas of Internet applications and software, including software as a service, open source business models, hosted applications, ecommerce and ebusiness platforms.\nIn addition and following more than 15 months research and network building into renewable energy generation including a 3 month stint at Shell Renewables, where he worked on assessing energy generation technologies, Robert is also covering selected deal opportunities in environmental technologies. He is particularly interested in clean energy generation, efficient energy distribution, energy storage, improved energy efficiency and monitoring as well as better waste treatment and water purification technologies.\nRobert has over 10 years experience in creating and running high growth technology companies, was a founding member of two CEO mentoring groups in the UK, co-founded the INSEAD Energy club in 2006, where he organized Singapore first seminar on renewable energy investments and is a founding member of the Munich Network Cleantech Venture Group, which he currently chairs. He is also a member of the European advisory board of the INSEAD Energy Club.\nRobert was brought up in South America, has lived in the UK, Singapore, France and Holland and speaks Spanish, English and increasingly, German. He holds a MEng. Honours degree in Aeronautical Engineering from Imperial College London, an MBA from INSEAD and a commercial pilot’s license</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0007/9851/79851v1-max-150x150.jpg"],[[178,250],"assets/images/resized/0007/9851/79851v1-max-250x250.jpg"],[[200,280],"assets/images/resized/0007/9851/79851v1-max-450x450.jpg"]],"attribution":"<p>TVM Capital</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"ESB Novus Modus","permalink":"novus-modus","type_of_entity":"financial_org","image":null}},{"is_past":true,"title":"Entrepreneur in Residence (EIR)","firm":{"name":"TVM Capital","permalink":"tvm-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,35],"assets/images/resized/0003/0797/30797v1-max-150x150.png"],[[221,53],"assets/images/resized/0003/0797/30797v1-max-250x250.png"],[[221,53],"assets/images/resized/0003/0797/30797v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}