{"first_name":"Robert","last_name":"Miller","permalink":"robert-miller","crunchbase_url":"http://www.crunchbase.com/person/robert-miller","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Skype","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jul 03 05:27:16 UTC 2007","updated_at":"Mon Aug 24 21:13:40 UTC 2009","overview":"<p>Robert Miller has been Skype’s General Counsel since January 2006. He and his team are responsible for Skype’s worldwide legal, regulatory, government relations and law enforcement issues.</p>\n\n<p>Robert has extensive experience in e-commerce and communications having worked in the industry for over thirteen years since he joined British Telecommunications plc in January 1996. Previous to BT, he had qualified as a Solicitor in the London law firm of Nabarro Nathanson. At BT, Robert, working as a corporate and commercial lawyer, built up excellent practical knowledge and experience of the internet industry, both wireless and fixed in the UK and Europe.</p>\n\n<p>Robert joined eBay UK in September 2001 to be its first in-house lawyer and as a member of the management team helped to grow the UK business by building its legal and government relations capability and negotiating UK and EU-wide key marketing and strategic partnership deals. He also established and maintained a pre-eminent reputation with all public affairs constituencies, including law enforcement, and worked hand in hand with eBay’s PR team to support eBay’s high media profile where legal or government relations issues were involved.</p>\n\n<p>Robert attended Merchant Taylors’ School, before attaining a B.A. (Econ) Hons. in Economics and Government at the University of Manchester, and passing his Law School examinations at the City Law School, London. </p>","image":{"available_sizes":[[[104,150],"assets/images/resized/0005/7519/57519v1-max-150x150.jpg"],[[160,230],"assets/images/resized/0005/7519/57519v1-max-250x250.jpg"],[[160,230],"assets/images/resized/0005/7519/57519v1-max-450x450.jpg"]],"attribution":"<p>Skype</p>"},"degrees":[],"relationships":[{"is_past":true,"title":"General Counsel","firm":{"name":"Skype","permalink":"skype","type_of_entity":"company","image":{"available_sizes":[[[150,66],"assets/images/resized/0000/1387/1387v12-max-150x150.jpg"],[[250,110],"assets/images/resized/0000/1387/1387v12-max-250x250.jpg"],[[315,139],"assets/images/resized/0000/1387/1387v12-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}