{"first_name":"Robert","last_name":"Puff","permalink":"robert-puff","crunchbase_url":"http://www.crunchbase.com/person/robert-puff","homepage_url":"http://www.successbeyondyourimagination.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"guru-meditation, inspirational-keynote-speakers","alias_list":null,"created_at":"Sat May 26 11:37:48 UTC 2012","updated_at":"Thu May 31 02:00:08 UTC 2012","overview":"<p>Stress Management Experts</p>\n\n<p>Dr. Robert Puff, M.A., M.Div., Ph.D. is a clinical psychologist, author, international speaker,  stress management expert and mental health expert who has been successfully counseling individuals, families, organizations, and businesses for over twenty years.</p>\n\n<p>Company Overview: \nDr. Robert Puff, M.A., M.Div., Ph.D. is a clinical psychologist, author, motivational speaker, keynote speaker and mental health expert who has been successfully counseling individuals, families, organizations, and businesses for over twenty years.</p>\n\n<p>Dr Puff says that teaching meditation is just like teaching a baby to walk. People have to be taught to take every step, practice it, and then take another. They have to be tutored to comprehend things in the proper perspective and attempt to overcome the challenges with the right approach. </p>\n\n<p>Dr. Puff unravels the phases of stress management meditation, one by one. He coaches how to gain the benefits of meditation to the optimum, reviews various stress management techniques used around the world, and helps you find out what works for you. Among the leading speakers on stress management speakers, he also teaches short meditation that can be practiced during short breaks like while you&#8217;re in the shower, gym or having tea. In the hectic professional life of today, these mini meditation sessions have a very high practical use for the management of stress. He teaches you how to withstand the negative effects of stress and the constant intrusion of technology. He explains ways for you to increase mental clarity, and positively impact your mental / physical health with meditation management techniques. He also shows how you can develop meditation stamina and ability, sustaining it for a long period of time.</p>\n\n<p>Dr. Puff’s talks are perfect for conventions, corporate meetings, sales conferences, and any other business group or meeting in which personal performance is an important part of your success. Dr. Puff’s coaching is highly effective for staff development either in small groups or for targeted one-on-one development.</p>","image":{"available_sizes":[[[150,40],"assets/images/resized/0019/1932/191932v2-max-150x150.jpg"],[[250,68],"assets/images/resized/0019/1932/191932v2-max-250x250.jpg"],[[450,122],"assets/images/resized/0019/1932/191932v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.successbeyondyourimagination.com","title":"Stress Management Program"},{"external_url":"http://www.successbeyondyourimagination.com/stress-management.html","title":"Stress Management Guru"}],"web_presences":[]}