{"first_name":"Robert","last_name":"M. Jaffe","permalink":"robert-m-jaffe","crunchbase_url":"http://www.crunchbase.com/person/robert-m-jaffe","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Dec 01 11:58:22 UTC 2008","updated_at":"Mon Dec 01 11:59:30 UTC 2008","overview":"<p>Robert M. Jaffe co-founded Sorrento Associates, Inc. as one of the first venture capital firms in San Diego with a number of prominent local San Diego business leaders. He has been involved in substantial areas of technology and new venture development, as well as corporate finance for emerging companies.  These include more than 200 financings, mergers and acquisitions.</p>\n\n<p>Mr. Jaffe is currently Chairman of the Board of A-Life Medical, Inc. and Perlan Therapeutics, Inc., and a director of IPMobilenet Inc., V-Enable Inc., and Seat Advisor Inc.  Mr. Jaffe also served as Chairman of the Board of Hot Topic, Inc. for 10 years. Under his leadership, Hot Topic grew from 6 to over 300 stores, became a publicly traded company, and had annual revenues increase from $3 million to over $250 million.  Mr. Jaffe also served Chairman of Keylime Software, Inc., (acquired by Overture, Inc.), Vice-Chairman of Bebe Stores, Inc., and as a director of E.S.I. Software, Inc. (acquired by Macromedia, Inc.), Digirad Corporation (which became a public company), and Combichem, Inc. (acquired by Dupont Co.).</p>\n\n<p>Prior to co-founding Sorrento Associates Mr. Jaffe was Vice President of Merrill Lynch Capital Markets where he was responsible for corporate finance activities of high technology companies in the Western United States. Previously, Mr. Jaffe was Vice President of Corporate Finance at Salomon Brothers, Inc. where he co-formed a group to advise high technology companies on financings and mergers and acquisitions. He started his finance career as an Associate in Corporate Finance at Goldman, Sachs &amp; Co., and he worked on the partnership&#8217;s direct investments. Prior to Wall Street, Mr. Jaffe was a member of the technical staff at Hughes Aircraft Company and a consultant at McKinsey &amp; Co.</p>\n\n<p>Mr. Jaffe received a Master of Business Administration from the Harvard Business School where he was a Baker Scholar, the School&#8217;s highest academic honor.  He was the recipient of The Loeb Rhoades Fellowship; an honor awarded by the faculty to the outstanding graduate in Finance. He graduated with a Master of Science as a Hughes Fellow from The California Institute of Technology in Electrical Engineering, and received a Bachelor of Science in Electrical Engineering and Computer Science (Summa Cum Laude, Phi Beta Kappa) from The University of California at Berkeley in 3 years at the age of 20. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President","firm":{"name":"Sorrento Ventures","permalink":"sorrento-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,66],"assets/images/resized/0003/0445/30445v1-max-150x150.jpg"],[[169,75],"assets/images/resized/0003/0445/30445v1-max-250x250.jpg"],[[169,75],"assets/images/resized/0003/0445/30445v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}