{"first_name":"Robert","last_name":"Shafir","permalink":"robert-shafir","crunchbase_url":"http://www.crunchbase.com/person/robert-shafir","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 21 18:48:39 UTC 2008","updated_at":"Fri Nov 21 18:55:12 UTC 2008","overview":"<p>Robert Shafir is the Chief Executive Officer of the Asset Management business and the Chief Executive Officer of the Americas Region for Credit Suisse, based in New York. He is a member of the Executive Boards of Credit Suisse and Credit Suisse Group and chairs the Americas CEO Management Committee.</p>\n\n<p>In his role as CEO of the Asset Management business, Mr. Shafir is responsible for all of the Bank’s Asset Management operations globally. His mandate as CEO of the Americas includes working with Investment Banking, Private Banking, Asset Management and Shared Services to realize the benefits of Credit Suisse&#8217;s integrated strategy in the Americas. In both capacities, he works in close partnership with the business leadership to ensure the Bank delivers best-in-class service to our global clients.</p>\n\n<p>In August 2007, Mr. Shafir joined Credit Suisse from Lehman Brothers, where he worked for 17 years, having served as Head of Equities, as well as a member of their Executive Committee. He also held other senior roles, including Head of European Equities and Global Head of Equities Trading, and played a key role in building Lehman&#8217;s equities business into a global, institutionally focused franchise. Prior to that, he worked at Morgan Stanley in the preferred stock business within the fixed income division.</p>\n\n<p>Mr. Shafir received a B.A. in Economics from Lafayette College and an M.B.A. from Columbia Business School.</p>","image":{"available_sizes":[[[135,100],"assets/images/resized/0002/9148/29148v1-max-150x150.jpg"],[[135,100],"assets/images/resized/0002/9148/29148v1-max-250x250.jpg"],[[135,100],"assets/images/resized/0002/9148/29148v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Executive Officer of Credit Suisse Americas","firm":{"name":"Credit Suisse","permalink":"credit-suisse","type_of_entity":"financial_org","image":{"available_sizes":[[[150,27],"assets/images/resized/0002/9146/29146v1-max-150x150.jpg"],[[175,32],"assets/images/resized/0002/9146/29146v1-max-250x250.jpg"],[[175,32],"assets/images/resized/0002/9146/29146v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}