{"first_name":"Bobby","last_name":"Marhamat","permalink":"robert-marhamat","crunchbase_url":"http://www.crunchbase.com/person/robert-marhamat","homepage_url":"","birthplace":"","twitter_username":"bobbymarhamat","blog_url":"http://www.bobbymarhamat.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"social-shopping-guru, online-presence-development, social-media-marketing","alias_list":null,"created_at":"Tue May 25 19:53:33 UTC 2010","updated_at":"Thu Aug 30 08:24:03 UTC 2012","overview":"<p>Bobby Marhamat is the founder and CEO of hipscan and jabberly. Marhamat has significant experience in product development and user acquisition. With substantial experience in developing systems that use behavioral marketing techniques to marry merchants with consumer needs and wants, Marhamat has been able to increase marketing ROI in a number of companies including Verizon Wireless EVO², Sprint Nextel, ServerPlex Networks, Looksmart, and Neiman Marcus. </p>\n\n<p>Marhamat has experience as an entrepreneur - and has started and successfully exited from a number of disruptive startups. He is also experienced in multi-unit retail infrastructure development having worked as one of the key players in building the retail side at Nextel Corporation and Verizon Wireless EVO² Stores.</p>\n\n<p>Marhamat worked closely with Ask.com while managing the online advertising portal for the paid search platform at Ask Companies.  Merging years of online marketing excellence with retail and shopping experience, Marhamat was able to identify potholes that would increase revenue by 5-15% on a recurring basis.</p>\n\n<p>That being said, the launch of socialpda comes from frustrations in being able to find a social shopping service that connects with social media outlets to marry recommendations with your wish-list.</p>","image":{"available_sizes":[[[150,125],"assets/images/resized/0008/8494/88494v2-max-150x150.jpg"],[[150,125],"assets/images/resized/0008/8494/88494v2-max-250x250.jpg"],[[150,125],"assets/images/resized/0008/8494/88494v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.hipscan.com","title":"ceo"},{"external_url":"http://www.jabberly.com","title":"ceo"}]}