{"first_name":"Robert","last_name":"Hurley","permalink":"robert-hurley","crunchbase_url":"http://www.crunchbase.com/person/robert-hurley","homepage_url":"http://www.drbobhurley.org","birthplace":"","twitter_username":"","blog_url":"http://www.drbobhurley.org/blog.php","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Wed Dec 28 19:36:55 UTC 2011","updated_at":"Wed Dec 28 19:37:35 UTC 2011","overview":"<p>Dr. Hurley is a Professor at Fordham University and President of Hurley Associates. At Fordham Dr. Hurley has been recognized by the student body for his excellence in teaching with the Gladys and Henry Crown Award for faculty excellence.\nDr. Hurley consults with organizations on leadership development, top team development, coaching, managing transformational change and developing and implementing strategies to maximize customer value. He has been a core faculty member in Columbia Business School&#8217;s High Impact Leadership Program for the past 20 years. He also taught for Duke Corporate Education for three years. Earlier in his career he was a Product Manager at Kraft Foods where he led and managed new product development and established-brands teams. He began his career as a CPA working for Ernst and Whinney and Arthur Andersen where he consulted with large-and medium-sized companies in the financial area.\nDr. Hurley&#8217;s consulting experience has included work on innovation with NASA and managing change with Avon Products, First Tennessee Bank, IBM, Kraft Foods, Kinkos, Mercedes Benz,  Sheetz Convenience Stores and State Farm Insurance. His teaching and consulting has included work in India, United Kingdom, Poland, Portugal, Italy, Japan, China, Switzerland, Hong Kong, Australia, France, and the United States.\nDr. Hurley has a B.S. from Fordham University and earned his MBA at the Wharton School. While at Wharton he served as a Senior Consultant at the Wharton Entrepreneurial Center. Dr. Hurley received his doctorate from Columbia University. He has published over 30 articles or book chapters. His work has appeared in the Wall Street Journal, California Management Review, and Harvard Business Review.</p>","image":{"available_sizes":[[[125,150],"assets/images/resized/0016/7930/167930v1-max-150x150.jpg"],[[209,250],"assets/images/resized/0016/7930/167930v1-max-250x250.jpg"],[[237,283],"assets/images/resized/0016/7930/167930v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}