{"first_name":"Robert","last_name":"Patzig","permalink":"robert-patzig","crunchbase_url":"http://www.crunchbase.com/person/robert-patzig","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 04 02:46:12 UTC 2009","updated_at":"Thu Jun 04 02:49:37 UTC 2009","overview":"<p>Mr. Patzig joined Third Security upon the company&#8217;s inception. Mr. Patzig&#8217;s responsibilities include identifying and researching new investment opportunities for Third Security and its funds, securities valuation and portfolio management. Mr. Patzig is a Director of the Virginia Biotechnology Association, a non-profit industry advocacy group, a member of the Virginia Tech English Department Distinguished Alumni Board and a member of the Virginia Tech School of Business Finance Advisory Board. Mr. Patzig has served as Chairman of the Board of Intrexon Corporation and Cyntellect, Inc. and served as a member of the Board of Directors of Synchrony, Inc. Mr. Patzig served as the head of the Investment Committee for Howe and Rusling, Inc., a registered investment advisor, from 2001 until its sale in 2006. Prior to the formation of Third Security, Mr. Patzig served as Director of Market Research and Analysis at GIV Holdings, Inc. and Director of Research Services at General Injectables &amp; Vaccines, Inc. Mr. Patzig received a B.A. in Philosophy and English and a M.A. in English from Virginia Tech.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Senior Managing Director and Chief Investment Officer","firm":{"name":"Third Security","permalink":"third-security","type_of_entity":"financial_org","image":{"available_sizes":[[[150,35],"assets/images/resized/0004/6579/46579v1-max-150x150.png"],[[250,59],"assets/images/resized/0004/6579/46579v1-max-250x250.png"],[[324,77],"assets/images/resized/0004/6579/46579v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}