{"first_name":"Roberto Warren","last_name":"Fisher","permalink":"roberto-warren-fisher","crunchbase_url":"http://www.crunchbase.com/person/roberto-warren-fisher","homepage_url":"http://www.robertofisher.com","birthplace":"Lodi, CA","twitter_username":"roberto_fisher","blog_url":"","blog_feed_url":"","affiliation_name":"MySpace Music","born_year":1968,"born_month":8,"born_day":27,"tag_list":"product-management, user-experience, information-architecture, project-management, digital-media, social-media, product-development, web, mobile, search, content-management","alias_list":null,"created_at":"Wed Aug 01 14:57:01 UTC 2012","updated_at":"Sat Aug 04 14:15:15 UTC 2012","overview":"<p>Roberto is a digital media and social media, and enterprise product development veteran known for his deep expertise in and passion about technology, and what it means to our collective future. He is a results-oriented leader who delivers best-of-breed products and services. Roberto is also a highly collaborative, creative and energized product guy with a detailed grasp of the business, technological and societal fundamentals required for executing innovative product offerings. He has more than two decades of experience across digital domains, supporting premium subscription, ad-supported, and shrink-wrap business models, as well as professional products and services industries.</p>\n\n<p>Roberto has long been a recognized leader in digital media and social media, and had worked at Myspace Music, Yahoo! Music and LAUNCH Media where he had driven product strategy, managed key product and technology initiatives and partnerships, and had successfully grown numerous offerings to be number one in their categories. In addition to growing Myspace Music to the number two consumer Internet destination, Roberto also played a central role in the successful growth of Yahoo!’s music business from 2001 through to 2008 to be the web’s number one consumer music destination, and to be the leading provider worldwide of Music Videos and Internet Radio. During his time at LAUNCH Media prior to its acquisition by Yahoo! in 2001, Roberto served as both VP of Technology and Operations and also VP of Production and Operations for the innovative website.</p>\n\n<p>Before working in Internet music, Roberto worked on Internet, information, application and automation products and services for Citicorp, CB Richard Ellis and Oracle Corporation. At Citicorp, Roberto spearheaded global retail investment product management, and also participated as a member of Citicorp’s central data and messaging architecture team. At CB Richard Ellis, Roberto worked on a global IT plan for converging numerous, diverse business related to real estate into an integrated system for customer relationship management. Over the nearly 7 years he worked at Oracle, Roberto held various product, marketing, and technology roles in Oracle’s Global Operations, in Product and Product Line Division, and in the Applications Division. During his time at Oracle, Roberto championed some of the earliest effective efforts to apply database technologies to managing and retrieving documents and rich media with associated metadata, to the use the technology for knowledge management and improved organizational productivity, and use in conjunction with the delivery of content to various client types (including to PC, Internet, email, fax, and mobile clients). Roberto was also a principal contributor to the launch of Oracle.com and led the build out out some of the first Internet hosted and database driven B2B services.</p>\n\n<p>Education: Roberto graduated with Honors from Stanford University with a Bachelor of Arts degree in Values, Technology, Science and Society. More information on how to reach or follow Roberto is available on http://robertofisher.com</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0020/3916/203916v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0020/3916/203916v2-max-250x250.jpg"],[[402,402],"assets/images/resized/0020/3916/203916v2-max-450x450.jpg"]],"attribution":"<p>Roberto Warren Fisher</p>"},"degrees":[{"degree_type":"Bachelors with Honors","subject":"Values, Technology, Science and Society","institution":"Stanford University","graduated_year":1992,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"VP of Operations and Technology","firm":{"name":"Citicorp Investments","permalink":"citicorp-investments","type_of_entity":"company","image":null}},{"is_past":true,"title":"VP of Technology Operations","firm":{"name":"Launch Media","permalink":"launch-media","type_of_entity":"company","image":null}},{"is_past":true,"title":"VP of Product","firm":{"name":"MySpace Music","permalink":"myspace-music","type_of_entity":"company","image":{"available_sizes":[[[150,40],"assets/images/resized/0006/6871/66871v1-max-150x150.jpg"],[[250,67],"assets/images/resized/0006/6871/66871v1-max-250x250.jpg"],[[300,81],"assets/images/resized/0006/6871/66871v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Senior Director of Product","firm":{"name":"Yahoo!","permalink":"yahoo","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0001/0836/10836v9-max-150x150.png"],[[226,81],"assets/images/resized/0001/0836/10836v9-max-250x250.png"],[[226,81],"assets/images/resized/0001/0836/10836v9-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Director Global Internet Solutions","firm":{"name":"Oracle Corporation","permalink":"oracle","type_of_entity":"company","image":{"available_sizes":[[[150,51],"assets/images/resized/0001/7825/17825v1-max-150x150.png"],[[158,54],"assets/images/resized/0001/7825/17825v1-max-250x250.png"],[[158,54],"assets/images/resized/0001/7825/17825v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"VP of Enterprise Automation and E-Business","firm":{"name":"CB Richard Ellis","permalink":"cb-richard-ellis","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/robertofisher","title":"LinkedIn"}]}