{"first_name":"Robert","last_name":"Volpe","permalink":"robert-volpe","crunchbase_url":"http://www.crunchbase.com/person/robert-volpe","homepage_url":"http://robertvolpe.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Aug 16 16:44:19 UTC 2011","updated_at":"Wed Jun 20 17:35:42 UTC 2012","overview":"<p>Robert Volpe found his passion in helping organizations develop sustainable strategies that drive business growth. Through decades of hands-on and leadership experience developing marketing, business development and strategy across multiple industries Robert has earned a reputation for being innovative. His experience includes the successful building and leading of early-stage organizations in the software, renewable energy, sustainability, technology and medical industries.</p>\n\n<p>Robert has a track record of bringing in new ideas and making them work. He has a knack for understanding and distilling the needs of each business and proven experience applying both incremental and disruptive innovation to achieve measurable, scalable, sustainable results.</p>\n\n<p>AT DTI, Robert has led international projects in the areas of software, internet/web, mobile/wireless, medical technology, renewable energy, energy efficiency and smart grid. His clients range from startup companies seeking the development and implementation of a strategic business plan to growth-stage companies seeking international business development and capital raising strategies. Also as part of his practice, Robert has worked with investment firms requesting due diligence and opportunity analysis of potential investments. Recent clients have included Fortune 100 companies, such as Johnson &amp; Johnson (NYSE: JNJ ), and other multi-billion dollar companies like Dassault Systèmes (www.3ds.com).</p>\n\n<p>In addition to his active strategic consulting practice, Robert has been a senior executive of business development, finance &amp; strategy at a number of software technology and early-stage renewable energy companies. In the 1990s, Robert was a partner and director at a technology solutions provider that created a suite of SaaS ERP applications that processed more than $550 million annually for customers, and Robert led the company’s growth, including the building of strategic partnerships with Fortune 500 companies.</p>\n\n<p>Robert holds an M.B.A. and M.S. from the University of Colorado and a B.S. from Boston University.</p>","image":{"available_sizes":[[[128,150],"assets/images/resized/0014/9747/149747v2-max-150x150.jpg"],[[173,202],"assets/images/resized/0014/9747/149747v2-max-250x250.jpg"],[[173,202],"assets/images/resized/0014/9747/149747v2-max-450x450.jpg"]],"attribution":"<p>Robert Volpe</p>"},"degrees":[{"degree_type":"MBA","subject":"","institution":"University of Colorado","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MS","subject":"Finance","institution":"University of Colorado","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://DTI-Consulting.com","title":"DTI Consulting"},{"external_url":"http://DTIstrategy.com","title":"DTI Strategy Consulting"}]}