{"first_name":"Robert","last_name":"Battle","permalink":"robert-battle","crunchbase_url":"http://www.crunchbase.com/person/robert-battle","homepage_url":"http://YerBid.com","birthplace":"Landstuhl, Germany","twitter_username":"YerBid","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1981,"born_month":11,"born_day":1,"tag_list":"bidding, auction, service, home-improvement, reviews, service-professionals-","alias_list":null,"created_at":"Wed May 16 20:47:30 UTC 2012","updated_at":"Wed May 23 19:43:33 UTC 2012","overview":"<p>YerBid allows customers to list jobs for any type of service.  The listing will have a detailed description, uploaded photos or documents related to the job as well as tag specific to a field that a business will also tag themselves.  Once the job is listed the business is notified of the listing.  They can then review the listing, ask a question and place a bid.  </p>\n\n<p>Once the bids are in the customer can see the businesses page, past reviews, certifications (verified by YerBid) as well as their location in relationship to their home or listed location.  Bids are not visible to other businesses in order to maintain an honest and level field.  We still want the business to make money and remain competitive without having to put themselves at risk of losing money just to win a job.</p>\n\n<p>Each city will have regional administrators to ensure quality service in each location we are servicing.  The data we process is available to the business to help better dial in their outbound marketing.  Everything from what age range is listing in their field to what location in their community is best suited for certain types of advertising.  The information comes at no extra charge, after all, we&#8217;re all about helping the local community small business owners grow and flourish.</p>\n\n<p>The came to me back in 2007 when I started working at Home and Garden shows.  Every business spends thousands upon thousands on advertising to reach a very specific demographic looking for their services.  The problem with this is that it is ineffective considering the cost to result ration and its hit or miss.  </p>","image":{"available_sizes":[[[150,40],"assets/images/resized/0019/0112/190112v2-max-150x150.jpg"],[[250,66],"assets/images/resized/0019/0112/190112v2-max-250x250.jpg"],[[284,76],"assets/images/resized/0019/0112/190112v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}