{"first_name":"Robert","last_name":"Wang","permalink":"robert-wang","crunchbase_url":"http://www.crunchbase.com/person/robert-wang","homepage_url":"http://www.payever.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jul 09 11:03:10 UTC 2012","updated_at":"Mon Jul 09 16:09:10 UTC 2012","overview":"<p>I am a well-rounded entrepreneurial engineering and professional services executive with seventeen (17) years of line management experience in enterprise software, including five (5) years of general management experience in China. I have built and operated business units and development organizations at four publicly traded companies (BroadVision, Siebel Systems, RightWorks, and IBM). I currently hold two positions at BroadVision. From HQ, I am the VP and General Manager for BroadVision Global Services (BVGS). In this capacity, I am responsible for the sales and delivery of BroadVision’s services engagements worldwide. My other responsibility involves building and operating BroadVision OnDemand (BVOD), a Beijing-based wholly owned subsidiary of BroadVision that specifically addresses the SaaS opportunity in the HR and Enterprise Social Network (ESN) space. Launched in August 2006, BVOD currently has over 3,000 customers, books over RMB 10M per year in subscription revenues, has over 100 employees, and saves BroadVision over $2M USD per year in engineering and global services costs. From 2009 to 2011, as community service, I taught enterprise applications, software engineering, and entrepreneurship at major universities in Beijing. I have a Ph.D. in EECS from UC Berkeley and a MBA from San Jose State University. I am an U.S. citizen and am fluent in English and Chinese (Mandarin).</p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0019/9589/199589v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0019/9589/199589v2-max-250x250.jpg"],[[450,299],"assets/images/resized/0019/9589/199589v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}