{"first_name":"Robert","last_name":"Barker","permalink":"robert-barker","crunchbase_url":"http://www.crunchbase.com/person/robert-barker","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Infoglide Software Corporation","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 15 20:16:59 UTC 2008","updated_at":"Thu Jul 30 17:53:54 UTC 2009","overview":"<p>As senior vice president and chief marketing officer, Robert Barker sets the strategic marketing direction for the company. He also serves as acting chief technology officer. His areas of responsibility include strategy, business development, strategic alliances, public relations, marketing communications, and product marketing and management including setting technology direction, identifying market and product requirements, and leading software development.</p>\n\n<p>Mr. Barker has over 25 years of experience in marketing, business development, product management, and software development. For the past several years, he was vice president of strategic planning for Compuware Corporation where he was responsible for product and technology strategy and direction for the $1.2 billion software and services company.</p>\n\n<p>Prior to Compuware, Mr. Barker was associated with STARTech Early Ventures. In his position there as entrepreneur in residence, he evaluated software startups for potential seed investments. Before STARTech, he was group vice president of business development for Sterling Commerce where he led U.S. and European acquisition and partnership initiatives for Sterling’s Dallas-based Communications Group.</p>\n\n<p>Mr. Barker’s career includes additional executive business development positions with Critical Devices, Anysoft, and Novell. While at Novell, he developed and managed partnerships with the most influential companies in the technology industry, including a partnership with Compaq that funded Novell/Compaq joint sales programs. He also closed technology and marketing partnerships with Lotus Notes and CA-Unicenter that resulted in new markets. He began his career at two Austin-based pioneering software companies, MRI and Execucom.</p>\n\n<p>Mr. Barker holds a Bachelor of Arts with honors from The University of Texas at Austin with a major in psychology and a minor in mathematics. He completed the first year of his Ph. D. in psychology at Princeton University before joining the software industry. Mr. Barker currently serves on the organizing committee for the IEEE International Engineering Management Conference 2007.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Senior Vice President & Chief Marketing Officer","firm":{"name":"Infoglide Software Corporation","permalink":"infoglide-software-corporation","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0002/2138/22138v2-max-150x150.png"],[[187,43],"assets/images/resized/0002/2138/22138v2-max-250x250.png"],[[187,43],"assets/images/resized/0002/2138/22138v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/robertgbarker","title":""}]}