{"first_name":"Robert W","last_name":"Price","permalink":"robert-w-price","crunchbase_url":"http://www.crunchbase.com/person/robert-w-price","homepage_url":"http://director.gcase.org/","birthplace":"","twitter_username":"robertwprice","blog_url":"http://blogs.gcase.org/","blog_feed_url":"http://blog.gcase.org/feed/","affiliation_name":"Global Entrepreneurship Institute","born_year":null,"born_month":null,"born_day":null,"tag_list":"global-entrepreneurship, global-entrepreneurship-program, online-incubator, e-learning, social-entrepreneur","alias_list":null,"created_at":"Tue Jan 25 19:30:31 UTC 2011","updated_at":"Mon Nov 12 00:05:07 UTC 2012","overview":"<p>Robert enjoys world renown as an expert in the field of entrepreneurial capitalism. He has nearly 30 years of entrepreneurial experience. He is a strategist, innovative thought leader, public speaker, creative educator, and prolific author. As the Executive Director as the Global Entrepreneurship Institute (GEI) he has written or edited more than a dozen books. His books are required reading at Harvard Business School, Stanford University, UCLA, USC, Wharton, Caltech, Indiana University, New York University and many more leading universities and colleges around the world. His work has been translated into more than 10 languages.</p>\n\n<p>He has been the intellectual architect for a number of exciting and innovative projects around the world. Most notably, he created innovative business strategies for a new online financial service during the early days of the Internet-era. This project became part of the Permanent Research Collection on Information Technology at the Smithsonian&#8217;s National Museum of American History, as one of the most significant technology advances in the insurance arena.</p>\n\n<p>As a mentor with GEI, Robert currently advises emerging growth companies on strategic planning, business planning, angel/venture capital financing, strategic alliances, and entrepreneurial marketing. An expert in packaging, placing, and presenting business plans. His clients&#8217; business plans have raised more than $100 million from angel investors, venture capitalists, and strategic capital partners like Apax Partners, IBM, HP/Compaq, Oracle, Siemens, Apollo Management, Rare Medium Ventures, and Tech Coast Angels, one of the largest formal angel groups in the world.</p>\n\n<p>As an educator Robert created Roadmap To Silicon Valley, an exclusive travel course to Silicon Valley &amp; San Francisco. Provides a real-world introduction to the process of financing entrepreneurial ventures and the functions of the major venture capitalists. The class visits Silicon Valley, California for one week. Interviews are with a variety of firms including venture capitalists, investment banks, professional service providers, and master entrepreneurs. The class also features a series of classroom lectures and online assignments.</p>\n\n<p>Born in the United States, Robert has lived, worked, or studied in Spain, Germany, France, Austria, and Mexico. He speaks in Spanish, German, and French. Robert earned his MBA from Pepperdine University in Malibu, California and Bachelors degree in International Studies from Ohio State University in Columbus, Ohio.</p>\n\n<p>He has been very active outside of the business world and classroom. Once raced dirt bike motorcycles professionally. Although he has owned more than 28 motorcycles, he now spins his wheels by mountain biking in Southern California in the summer, enjoys skiing in the winter. He travels extensively around the world for business assignments, guest lecturing, presenting, nonprofit projects, and on holidays.</p>","image":{"available_sizes":[[[103,150],"assets/images/resized/0011/8971/118971v2-max-150x150.jpg"],[[171,250],"assets/images/resized/0011/8971/118971v2-max-250x250.jpg"],[[206,300],"assets/images/resized/0011/8971/118971v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"Entrepreneurship","institution":"Pepperdine University","graduated_year":1996,"graduated_month":null,"graduated_day":null},{"degree_type":"BA","subject":"International Studies","institution":"The Ohio State University","graduated_year":1984,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Executive Director","firm":{"name":"Global Entrepreneurship Institute","permalink":"global-entrepreneurship-institute","type_of_entity":"company","image":{"available_sizes":[[[150,56],"assets/images/resized/0013/9532/139532v2-max-150x150.jpg"],[[250,93],"assets/images/resized/0013/9532/139532v2-max-250x250.jpg"],[[450,168],"assets/images/resized/0013/9532/139532v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"<iframe width=\"430\" height=\"242\" src=\"http://www.youtube.com/embed/s_ybXX4C3gw\" frameborder=\"0\" allowfullscreen></iframe>","description":"<p>WordCamp OC 2011</p>"},{"embed_code":"<iframe width=\"430\" height=\"242\" src=\"http://www.youtube.com/embed/3LX2VSaOcac\" frameborder=\"0\" allowfullscreen></iframe>","description":"<p>TEDxTijuanaSalon - Robert W Price - Discusiones Sobre El Ciclo De Vida Emprendedor </p>"}],"external_links":[{"external_url":"http://www.amazon.com/Robert-W.-Price/e/B001KHWUFK","title":"Amazon.com Author Page"},{"external_url":"http://www.forbes.com/sites/ericwagner/2012/05/30/3-startup-secrets-from-a-serial-entrepreneur/","title":"Start Up Secrets from A Serial Entrepreneur "}],"web_presences":[{"external_url":"http://www.linkedin.com/in/robertwprice","title":"LinkedIn"},{"external_url":"http://twitter.com/robertwprice","title":"Twitter"},{"external_url":"http://roadmaptosiliconvalley.org/","title":"Roadmap To Silicon Valley"},{"external_url":"http://angel.co/robertwprice","title":"Angel List"},{"external_url":"http://robertwprice.com/","title":"RobertWPrice.com"}]}