{"first_name":"Robert","last_name":"Geneid","permalink":"robert-geneid-2","crunchbase_url":"http://www.crunchbase.com/person/robert-geneid-2","homepage_url":"http://borsarmulu.com","birthplace":"Australia","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"robert-geneid, borsarmulu","alias_list":null,"created_at":"Tue Sep 25 03:07:13 UTC 2012","updated_at":"Thu Oct 11 17:52:00 UTC 2012","overview":"<p>Robert Geneid is a businessman and civil engineer who currently reside in Malaysia. He was born in Sydney, Australia in 1954. He graduated from the University of New South Wales with a BA (Civil Engineering) in 1976. In the 80s, he decided to further his studies at UNSW this time graduating with honours in law in 1985. Robert is one of the youngest ever Fellows of the Institution of Engineers Australia and one of several people who had dual Law and Civil Engineering qualification at that time.</p>\n\n<p>He has had a successful career with some of Australia and South East Asia&#8217;s top legal, property development and tourism institution. He has handled the commercial side of the project and construction Indonesia, Malaysia and Singapore. He was heavily involved in the setting up of Jakarta&#8217;s first commercial TV station and has served as legal advisor for a joint venture responsible for developing the Malaysia Peninsular’s gas pipeline. Robert Geneid has also been involved in the development of international hotels. </p>\n\n<p>Robert is currently the Managing Director for Borsarmulu Resort Sdn. Bhd., the owner and operator of Royal Mulu Resort and via a subsidiary company, involved in the management of the World Heritage Site Gunung Mulu National Park. Robert has also served as a Board Member of Tourism Malaysia and, since September 2010, has also served as a Board Member of the Malaysia Convention and Exhibition Bureau. He is also a board member of Sarawak Convention Bureau. </p>","image":null,"degrees":[{"degree_type":"BA","subject":"Civil Engineering","institution":"University of New South Wales","graduated_year":1976,"graduated_month":null,"graduated_day":null},{"degree_type":"LLB","subject":"Law","institution":"University of New South Wales","graduated_year":1984,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}