{"first_name":"Robin","last_name":"Woods","permalink":"robin-woods","crunchbase_url":"http://www.crunchbase.com/person/robin-woods","homepage_url":"http://www.bellspharmacy.com/","birthplace":"Edinburgh, USA","twitter_username":"","blog_url":"http://onlinepillsdrug.blogspot.com/","blog_feed_url":"http://onlinepillsdrug.blogspot.com/feeds/posts/default","affiliation_name":"Unaffiliated","born_year":1986,"born_month":7,"born_day":20,"tag_list":"online-pharmacy, grneric-drugs, viagra-online","alias_list":null,"created_at":"Fri Nov 26 10:22:11 UTC 2010","updated_at":"Thu May 17 16:23:50 UTC 2012","overview":"<p>Bellspharmacy.com   is a one of the best online pharmacy generic drugs store which can be provides as a generic drugs medicine all over the world. Bellspharmacy is also a best well known pharmacy for it’s a good quality medications and it will also provides as on a time to time delivery of products. It is provides a better quality of the medicines but in an affordable price. \nBellspharmacy have an option of providing branded as well generic medicines all over the world. All the medicines were being sold through our online drug store are FDA approved. The medicines are manufactured by leading pharmaceutical industries that are well-known worldwide for their excellent quality of the drugs at a better quality. The goal of Bellspharmacy is to fulfill all customer needs and make the customer happy.\nDelivery of medicines on-time is the typical feature of the online store. Our shipping department is one of the best in the world wide for the delivery system and also to care of deliveries. We as an online store understand the importance of online security, thus latest technical measures have been taken into consideration, and also your personal information will be kept secret and safeguarded from others of it. \nThanks of a Robin Woods </p>","image":{"available_sizes":[[[150,50],"assets/images/resized/0011/1798/111798v4-max-150x150.jpg"],[[250,84],"assets/images/resized/0011/1798/111798v4-max-250x250.jpg"],[[258,87],"assets/images/resized/0011/1798/111798v4-max-450x450.jpg"]],"attribution":"<p>bjmsay</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}