{"first_name":"Robin","last_name":"Keith","permalink":"robin-keith","crunchbase_url":"http://www.crunchbase.com/person/robin-keith","homepage_url":"http://www.propertywizza.com","birthplace":"","twitter_username":"propertywizza","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Dec 04 01:52:44 UTC 2011","updated_at":"Tue Jul 10 20:15:14 UTC 2012","overview":"<p>I’m an IT manager, software developer and property developer.</p>\n\n<p>My main career is Head of Web and Development at the University of East Anglia (UEA) in Norwich, our website being www.uea.ac.uk. My team are also responsible for the teaching + learning system (Blackboard), OpenAthens (SAML2 authentication), Identity Management system and various UEA related website. Currently leading a project to move UEA&#8217;s website + portal to the excellent Liferay portal. Keen on Agile, been running the current project using Scrum, getting increasingly interested in software quality and automating testing.</p>\n\n<p>Previously I led the web team at publishers Archant (EDT,EADT etc), and was heavily involved in the original incarnations of www.property24.co.uk, jobs24 and motors24.</p>\n\n<p>I also run www.PropertyWizza.com which is a web gadget for house hunters allowing you to find out all sorts of useful information about a property and it’s neighbourhood for free.</p>\n\n<p>I’ll shortly be releasing two complimentary free products Hit Da Bloc - allows you to take a virtual walk around the block in Google StreetView. WinWizza - is another web gadget for automatically filling out your details for entering online competitions - much more sophisticated than existing form auto-fill.</p>\n\n<p>With my partner Elise, I’ve developed and electronic version of a popular Speech and Language Therapy assessment, the Comprehensive Aphasia Test or CAT. Our website is at www.TherapyFigures.com.</p>\n\n<p>In my spare time, I’m a property developer, just finished renovating a farm cottage in the middle of nowhere in Norfolk.</p>","image":{"available_sizes":[[[150,122],"assets/images/resized/0016/5055/165055v2-max-150x150.jpg"],[[200,163],"assets/images/resized/0016/5055/165055v2-max-250x250.jpg"],[[200,163],"assets/images/resized/0016/5055/165055v2-max-450x450.jpg"]],"attribution":"<p>Robin Keith</p>"},"degrees":[{"degree_type":"BSc Hons","subject":"Physics","institution":"University of East Anglia","graduated_year":1991,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.propertywizza.com","title":""},{"external_url":"http://www.uea.ac.uk","title":""},{"external_url":"http://www.therapyfigures.com","title":""}]}