{"first_name":"Robin","last_name":"Daniels","permalink":"robin-daniels-2","crunchbase_url":"http://www.crunchbase.com/person/robin-daniels-2","homepage_url":"http://www.linkedin.com/profile/edit?trk=hb_tab_pro_top","birthplace":"","twitter_username":"RobinCEDaniels","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jun 14 09:31:48 UTC 2012","updated_at":"Tue Jun 19 12:58:38 UTC 2012","overview":"<p>Robin Daniels is Executive Vice President of Living PlanIT and a member of the founding leadership team.  He was previously founding CEO of the Norwich Research Park, with 11,000 people on site this has developed to become Europe’s largest single-site life science park. </p>\n\n<p>Prior to this Robin was Chief Operating Officer of the Centre for Scientific Enterprise Ltd (“CSEL”), a joint venture between the London Business School and University College London. Robin was also architect and director of the Chevening Technology Enterprise Scholarship (“CTES”). Funded by the UK Government, CTES was a national technology commercialisation programme that supported over 120 projects and saw £50 million of economic value generated for the UK. In 2003, CSEL and CTES were both cited as national best practice by the UK Government. </p>\n\n<p>Robin has held senior roles with Cambridge University, directing the flagship “Manufacturing Leaders Programme”, following programme and general management roles in the automotive and material handling capital equipment sectors.</p>\n\n<p>In addition, he has worked as a consultant and advisor to a number of venture capital firms, investment banks and international manufacturing businesses across a wide range of sectors. Robin is co-founder of two technology start-up companies and an international technology business development consultancy. His start-up experience ranges from medical packaging, through waste to fuel technologies to luxury consumer products. He was also a policy advisor to the UK Shadow Cabinet prior to the 2010 General Election, focused on science, engineering and technology policy development.</p>\n\n<p>Robin Daniels is an engineer with bachelors and doctoral degrees from Loughborough University, is a member of Wolfson College Cambridge and a Fellow of the Royal Society of Arts. </p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0019/5453/195453v2-max-150x150.jpg"],[[170,170],"assets/images/resized/0019/5453/195453v2-max-250x250.jpg"],[[170,170],"assets/images/resized/0019/5453/195453v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}