{"first_name":"Robin","last_name":"Basham","permalink":"robin-basham-2","crunchbase_url":"http://www.crunchbase.com/person/robin-basham-2","homepage_url":"http://enterprisegrc.com","birthplace":"Malden","twitter_username":"EntGRCSolutions","blog_url":"http://www.enterprisegrc.com/index.php?option=com_content&view=section&layout=blog&id=1&Itemid=18","blog_feed_url":"http://feeds.feedburner.com/feedcat/kJiM","affiliation_name":"EnterpriseGRC Solutions, Inc.","born_year":1961,"born_month":8,"born_day":18,"tag_list":"grc, fcm, facilitated-compliance-management, cloud-security, cloud-credential-council, enterprisegrc-solutions, ict-infrastructure, iaas, saas, paas, cobit, itil, iso","alias_list":null,"created_at":"Sun Feb 19 19:05:10 UTC 2012","updated_at":"Wed May 02 01:24:39 UTC 2012","overview":"<p>About Robin Basham, M.ED, M.IT, CISA, CGEIT, CRISC, ACC, CRP, VRP, and HISP, Managing Partner, EnterpriseGRC Solutions Inc.®, creator of Facilitated Compliance Management Software (4Point GRC), and founder of Phoenix Business and Systems Process, Inc. Recent ITPreneurs partner, and board advisory for Holistic Information Security Practitioners,  Robin now leads Cloud Security &amp; Virtualization Controls Management training in the San Francisco and Bay Area. As EnterpriseGRC Solutions lead architect, Robin brings team experience leveraging platforms such as Oracle, Archer, SAP, Web Applications like Joomla, Visual Studio, Access and SharePoint. As an Archer Certified Consultant and SharePoint architect, she&#8217;s known for successful GRC implementations, supplying overall design, development and training to companies ranging from start up to fortune five hundred. Over the last decade Robin has architect more than 70 GRC programs, delivering end to end solutions with full knowledge transfer to program owners and users. Corporate leadership includes acting as technical liaison for ISACA in development of the OCEG Redbook V1, TC Co-Chair for OMG&#8217;s Open Regulatory Compliance Architecture (ORCA) project, working with co-chairs EMC&#8217;s Chief Governance Officer, Dr. Marlin Pohlman and world expert, Dr. Said Tabet. Robin&#8217;s companies remain active in emerging standards with participation on recent releases from ISACA® for both Oracle R12 and SAP ECC 6.0 controls. Ms. Basham is also a director for the Association for Certified Green Technology Auditors, ACGTA, a frequent committee contributor to the ISACA Silicon Valley Chapter and liaison to the ITSMF SV chapter, as well as participant in Cloud Security Alliance. EntepriseGRC Solutions is recently added to the Cloud Credential Council and is named to the certification committee of The Holistic Information Security Practitioner Institute (HISPI).  EnterpriseGRC Solutions® is an active sponsor to Information Systems Audit and Control Association, ISACA®, listed as corporate sponsor and many time CobiT® trainer for the ITGI.  (more at http://enterprisegrc.com)</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0017/4920/174920v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0017/4920/174920v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0017/4920/174920v2-max-450x450.jpg"]],"attribution":"<p>Robin Basham</p>"},"degrees":[{"degree_type":"Masters","subject":"Informtion Technology, Java Enterprise","institution":"AIU","graduated_year":2003,"graduated_month":null,"graduated_day":null},{"degree_type":"Masters","subject":"Computer Based Learning, Special Education","institution":"Lesley","graduated_year":1987,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Partner, CEO","firm":{"name":"EnterpriseGRC Solutions, Inc.","permalink":"enterprisegrc-solutions-inc-2","type_of_entity":"company","image":null}},{"is_past":true,"title":"Officer, Technology","firm":{"name":"State Street","permalink":"state-street","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://enterprisegrc.com","title":"Managing Partner"},{"external_url":"https://twitter.com/#!/EntGRCSolutions","title":""},{"external_url":"http://www.linkedin.com/in/robinbasham","title":""}]}