{"first_name":"Rod","last_name":"Dowler","permalink":"rod-dowler","crunchbase_url":"http://www.crunchbase.com/person/rod-dowler","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Arclight Media Technology","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Mar 13 15:57:57 UTC 2008","updated_at":"Thu Jul 30 17:52:22 UTC 2009","overview":"<p>Rod specializes in managing and trouble-shooting in fast-growing technology companies and management consultancy. He is Chairman of the Industry Forum, a London-based policy dialogue forum and a Governor of a north London Comprehensive school. He is on the Executive Committee of the Campaign for Science and Engineering. He holds a BA in Physics and an MA from Oxford University.</p>\n\n<p>During his career, Rod has worked as a software developer and in management consultancy as a partner in KPMG for 15 years. He led the KPMG European High Technology Practice, for five years, through a phase of rapid growth. He also led a number of high-profile engagements in telecommunications and satellite communications.</p>\n\n<p>Rod has personally provided advice on a number of large outsourcing deals. From 2000, Rod led software start-up, Thinkingcap Technology Ltd, as CEO and managed the product build phase of the company’s development. In 2004/05, Rod was an expert witness in a high-profile software patent case. </p>\n\n<p>From 2006 to 2008, Rod was the CEO/Founder of Web 2.0 property vertical search engine, zoomf.com. During that period Zoomf grew to national coverage with some 360,000 properties listed. Zoomf was acquired by Trinity Mirror in November 2008.</p>","image":null,"degrees":[],"relationships":[{"is_past":null,"title":"CEO","firm":{"name":"Arclight Media Technology","permalink":"arclight-media-technology","type_of_entity":"company","image":{"available_sizes":[[[150,17],"assets/images/resized/0001/5717/15717v2-max-150x150.png"],[[237,28],"assets/images/resized/0001/5717/15717v2-max-250x250.png"],[[237,28],"assets/images/resized/0001/5717/15717v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}