{"first_name":"Rod","last_name":"Geoghegan","permalink":"rod-geoghegan","crunchbase_url":"http://www.crunchbase.com/person/rod-geoghegan","homepage_url":"http://www.metropolis.vc","birthplace":"","twitter_username":"metropolis","blog_url":"http://www.typewrittennotes.com","blog_feed_url":"http://typewrittennotes.com/feed","affiliation_name":"Metropolis Communications","born_year":null,"born_month":null,"born_day":null,"tag_list":"new-business-development, marketing, social-media, social-business, agency, agencies, london","alias_list":null,"created_at":"Mon Oct 08 16:52:43 UTC 2012","updated_at":"Sat Nov 03 03:03:20 UTC 2012","overview":"<p>Rod Geoghegan is an accomplished marketer with over twenty years’ experience in advertising, digital, direct marketing, experiential marketing, market research and promotional marketing.</p>\n\n<p>His specialism is marketing and business development, with a highly successful track record in planning, converting and maintaining new client relationships.</p>\n\n<p>In 1985 he embarked on a seven year career as a market researcher. His understanding of qualitative and quantitative research techniques underpins his thinking and approach to marketing and brand development to this day.</p>\n\n<p>In 1994 he undertook the start-up of the UK subsidiary of a US based marketing services corporation building a team working for global premium brands. The client portfolio he created as Managing Director spanned seventeen countries and he travelled extensively to Asia, the US and across Europe managing these international client relationships.</p>\n\n<p>In 2000 he moved to be the first Business Development Director for zgc, going on to see the agency merge and relaunch as mustard.</p>\n\n<p>In 2005 he identified the requirement for a greater understanding of digital marketing amongst agency and client personnel and founded Metropolis to address this. He created and scripted interactive learning seminars – which became the benchmark for digital learning. Working with world leading advertising networks, digital agencies, industry bodies, marketing and public relations practitioners, the seminars audiences comprised C suite to graduate trainee.</p>\n\n<p>He developed the Metropolis proposition to support agencies in their marketing and new business development initiatives – thus utilising his experience and delivering value at each stage of the agency process.</p>\n\n<p>In 2007-9, he was co-opted to the board of a PLC network agency, the result of the one-month-old merger there marketing agencies with responsibility across marketing, PR and business development – building the agency proposition, reputation (on and offline), branding, profile, client list and revenue. The result was a nomination for Marketing Sales Promotion Agency of the Year 2008. He also raised industry issues where there was justification and necessity especially in relation to agency engagement with procurement and new EU legislation.</p>\n\n<p>Metropolis Communications advises across a broad range of management, group and shareholder requirements. Business development planning is at the heart of this thinking - utilising marketing, social media, training through to new business activation. </p>\n\n<p>The client base comprises agencies that are recognised as experts for the brands they deliver for (in the advertising, digital, experiential, DM, sponsorship, promotional, field and shopper marketing space),  corporate advisors and digital start-ups. </p>","image":{"available_sizes":[[[72,72],"assets/images/resized/0021/4706/214706v2-max-150x150.png"],[[72,72],"assets/images/resized/0021/4706/214706v2-max-250x250.png"],[[72,72],"assets/images/resized/0021/4706/214706v2-max-450x450.png"]],"attribution":"<p>Rod Geoghegan / [Metropolis.vc] (http://metropolis.vc)</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Metropolis Communications","permalink":"metropolis-communications","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.promomarketing.info/industry/achieving-buy-in-from-procurement/2871","title":"Marketing Agencies: Achieving Buy-In from procurement"}],"web_presences":[{"external_url":"http://uk.linkedin.com/in/rodgeoghegan","title":"LinkedIn - Rod Geoghegan"},{"external_url":"http://twitter.com/metropolis","title":"@metropolis"},{"external_url":"http://about.me/rodgeoghegan","title":"About Me: Rod Geoghegan"},{"external_url":"http://www.facebook.com/metropoliscomms","title":"Facebook: Metropolis Communications"},{"external_url":"http://www.slideshare.net/metropolis","title":"Slideshare: Metropolis Communications"},{"external_url":"http://www.flickr.com/photos/metropoliscomms/","title":"Flickr: Metropolis Communications"},{"external_url":"http://www.delicious.com/metropolislondon","title":"Deliciopus: Metropolis Communications"}]}