{"first_name":"Rod","last_name":"Robinson","permalink":"rod-robinson","crunchbase_url":"http://www.crunchbase.com/person/rod-robinson","homepage_url":"http://connxus.com/","birthplace":"Pompano Beach, Florida","twitter_username":"rodrobinson","blog_url":"http://connxus.com/blog/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1967,"born_month":10,"born_day":26,"tag_list":"entrepreneur, technology, procurement","alias_list":null,"created_at":"Fri May 13 03:41:11 UTC 2011","updated_at":"Fri Jun 03 17:49:33 UTC 2011","overview":"<p>Rod is the founder &amp; CEO of connXus, an online service that makes it easy and affordable for companies to locate, evaluate and engage performance-rated small, minority- or woman-owned businesses across more than 100 spend categories.</p>\n\n<p>As the founder and managing partner of consulting firm Accel Advisors, Rod has worked with Fortune 1000 companies to improve or create strategic sourcing and supplier diversity programs. He previously served as Chief Procurement Officer for Cincinnati Bell, where he drove more than $14 million in annual purchasing cost reductions while increasing spending with minority business enterprises by 42%.</p>\n\n<p>Before joining Cincinnati Bell, Rod was a management consultant with AT Kearney, Accenture, and Diamond Cluster International where he was a supply chain practice leader and sourcing subject matter expert. During his consulting career, Rod was involved in strategic sourcing and operations improvement initiatives that resulted in more than $1 billion in savings delivered to his Fortune 500 clients.</p>\n\n<p>Rod earned his MBA from the Wharton School at the University of Pennsylvania and a Bachelor of Science in Accounting from the West Virginia Institute of Technology. He earned his CPA credentials as an auditor with Deloitte &amp; Touche.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0013/4445/134445v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0013/4445/134445v2-max-250x250.jpg"],[[213,320],"assets/images/resized/0013/4445/134445v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"Finance","institution":"Wharton","graduated_year":1995,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}