{"first_name":"Rodessa","last_name":"Newton","permalink":"rodessa-newton","crunchbase_url":"http://www.crunchbase.com/person/rodessa-newton","homepage_url":"http://www.triadslo.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jul 06 00:34:48 UTC 2012","updated_at":"Fri Jul 06 18:08:16 UTC 2012","overview":"<p>Rodessa Newton is the Broker/Owner of Triad Real Estate &amp; Investment Group. She is a San Luis Obispo County Native and a graduate of Cal Poly University. Rodessa is a member of the Women&#8217;s Council of Realtors, National Association of Realtors, California Association of Realtors, the SLO Chamber of Commerce and is the Public Relations Chairperson for the San Luis Obispo Association of Realtors. She provides the full spectrum of Real Estate services including Residential &amp; Commercial Sales both Retail and Wholesale, Construction Estimating &amp; Build out, Foreclosure Processing, &amp; Real Property Personalized Investment Portfolio’s.</p>\n\n<p>Having grown up in San Luis Obispo County enables her to give her clients more local knowledge, as she is familiar with all of our countywide real estate markets. Rodessa is very well networked within the community and enjoys meeting the needs of her clients.</p>\n\n<p>Some of the career achievements that Rodessa has made include receiving her Brokers License, which gives her a higher level of education in all aspects of the industry. She has received her e-PRO designation which recognizes her as a leader in the practice of Online Real Estate. Rodessa is a Graduate of the Real Estate Institute which is one of the most comprehensive educational programs for Realtors in the nation which sets her apart from other Realtors. Other certifications include a Seniors Real Estate Specialist (S.R.E.S.) helping seniors understand capital gains &amp; estate tax implications of selling, a Certified Short Sale Professional (CSP) a Certified Distressed Property Expert (CDPE) and in addition, is an advisor to Westward Funds which is a Real Estate Investment Trust Firm.</p>\n\n<p>Rodessa&#8217;s involvement in the community includes contributing to the Performing Arts Center, Womenade, Women&#8217;s shelter, member of the Los Ranchos School Site Council, Board of Director’s for the San Luis Association of Realtors and various other organizations.</p>\n\n<p>Rodessa is proud to have such professional and knowledgeable agents who take pride in building strong, long term relationships with the highest standards and personal commitment to their clients.</p>","image":{"available_sizes":[[[150,38],"assets/images/resized/0019/9123/199123v2-max-150x150.jpg"],[[250,63],"assets/images/resized/0019/9123/199123v2-max-250x250.jpg"],[[450,114],"assets/images/resized/0019/9123/199123v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}