{"first_name":"Rodney","last_name":"Aiglstorfer","permalink":"rodney-aiglstorfer","crunchbase_url":"http://www.crunchbase.com/person/rodney-aiglstorfer","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"mFoundry","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 07 15:57:58 UTC 2009","updated_at":"Tue May 29 02:16:52 UTC 2012","overview":"<p>Rodney Aiglstorfer is the co-founder and CTO of mfoundry and the principal architect and technical visionary behind mojax. mojax is one of the worlds first Mobile AJAX Application Frameworks. Unlike traditional AJAX Web Frameworks, mojax Moblets do not run within a browser and are not subject to the availability and quality of a network connection. Also, unlike a web application running on a mobile device, a mojax moblet has access to lower level device features such as Camera API, Push Messaging, Bluetooth, Location Services, Contacts and more.\nRodney’s Bio</p>\n\n<p>Rodney began his professional career in Japan, working for a number of companies in the electronic game industry. In addition, Rodney also developed web-based e-business solutions for companies like Osaka Gas, Multimedia Research Center, and Video Systems.</p>\n\n<p>After several years in Japan, Rodney returned to the U.S. and founded multimedia outsourcing company Dream Kinematics. Dream Kinematics was comprised of a cadre of talented Drexel University Computer Science students who developed Macromedia Director and Internet content for a number of local U.S. and Japanese companies.</p>\n\n<p>Not long afterward, Rodney was recruited by Andersen Consulting (now Accenture) to join their advanced solutions group in Palo Alto where he specialized in Java-based Web-Centric Enterprise Architectures. In this capacity Rodney provided mentoring and technical leadership for teams of consultants working on large enterprise applications for the Automotive Insurance industry.</p>\n\n<p>In 1999 Rodney was hired by Novo Interactive to enhance their Software Architecture practice and compete more effectively against larger systems integrators. Two mergers and three years later Rodney assumed the role of National Director of Technology where he provided strategic technical leadership and managed the engineering departments across three geographies (San Francisco, Chicago, and New York). During his tenure, Rodney was directly involved with the delivery of solutions for Orbitz.com, LeapFrog, RestaurantPro, Screen Actors Guild, Behr, and BEA.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0019/1993/191993v2-max-150x150.png"],[[250,250],"assets/images/resized/0019/1993/191993v2-max-250x250.png"],[[450,450],"assets/images/resized/0019/1993/191993v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder & CTO","firm":{"name":"mFoundry","permalink":"mfoundry","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0003/3299/33299v3-max-150x150.jpg"],[[250,83],"assets/images/resized/0003/3299/33299v3-max-250x250.jpg"],[[432,144],"assets/images/resized/0003/3299/33299v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://aiglstorfer.me","title":"Blog"}]}