{"first_name":"Rodolfo","last_name":"Gari","permalink":"rodolfo-gari","crunchbase_url":"http://www.crunchbase.com/person/rodolfo-gari","homepage_url":"http://www.rodolfogarimd.com/","birthplace":"Cuba","twitter_username":"RodolfoGari","blog_url":"http://rodolfogari.typepad.com/blog/","blog_feed_url":"http://rodolfogari.typepad.com/blog/","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"rodolfo-gari, rodolfo-gari-md, rodolfo-gari-md-mba, hig-capital, surgery-partners","alias_list":null,"created_at":"Mon Mar 26 15:30:09 UTC 2012","updated_at":"Wed Apr 11 21:04:01 UTC 2012","overview":"<p>Rodolfo Gari, the President and Chief Executive Officer (CEO) of Gari Enterprises, has spent his career working as both a physician and an entrepreneur. Gari Enterprises, a commercial real estate investment and management firm headquartered in Tampa, Florida, manages over 250,000 square feet of office space. Dr. Rodolfo Gari also oversees Gari Enterprises Investments, managing the investment assets for the single-family investment firm of Gari Family Office. Previously, he served as the founder and CEO of the Tampa Pain Relief Center, Surgery Partners, and Anesthesiology Professional Services, all medical practices with multiple offices throughout Florida. </p>\n\n<p>Dr. Rodolfo Gari earned a Bachelor of Arts in Chemistry, graduating cum laude, from the University of South Florida in Tampa. He went on to study medicine at the University of Miami Miller School of Medicine in Miami, Florida, earning his Doctor of Medicine in 1985. Dr. Gari’s medical training included an internship in internal medicine at Orlando Regional Medical Center and a residency in anesthesiology at Miami’s Jackson Memorial Hospital. </p>\n\n<p>After practicing medicine for a decade, Dr. Gari returned to school and graduated with a Master of Business Administration from the University of South Florida College of Business. He specialized in finance and entrepreneurship and finished in the top one percent of his class. Dr. Gari belonged to the international business honor society Beta Gamma Sigma. </p>\n\n<p>A dedicated philanthropist, Dr. Rodolfo Gari supports a number of national and local charitable endeavors including The Children’s Home, an organization in Tampa serving children who have suffered abuse, neglect, or abandonment. Dr. Gari also contributes to the work of Susan G. Komen for the Cure, various Catholic charities, and the Berkeley Preparatory School, as well as volunteering with Habitat for Humanity International and Metropolitan Ministries. </p>\n\n<p>In his spare time, Dr. Rodolfo Gari enjoys playing football and basketball, jogging, bicycling, and weight training. An avid fisherman, he participates in tournaments sponsored by the local Big Game Fishing Club.</p>","image":{"available_sizes":[[[103,150],"assets/images/resized/0018/3608/183608v2-max-150x150.jpg"],[[172,250],"assets/images/resized/0018/3608/183608v2-max-250x250.jpg"],[[300,434],"assets/images/resized/0018/3608/183608v2-max-450x450.jpg"]],"attribution":"<p>Rodolfo Gari</p>"},"degrees":[{"degree_type":"Doctor of Medicine","subject":"Medicine","institution":"University of Miami School of Medicine","graduated_year":1985,"graduated_month":null,"graduated_day":null},{"degree_type":"Masters","subject":"Business Administration","institution":"University of South Florida","graduated_year":1996,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://news.yahoo.com/rodolfo-gari-completes-strategic-financial-analysis-business-evaluation-070659608.html","title":"Rodolfo Gari"}],"web_presences":[{"external_url":"https://twitter.com/#!/RodolfoGari","title":"Rodolfo Gari"},{"external_url":"http://www.linkedin.com/pub/rodolfo-gari-md-mba/25/1a2/981","title":"Rodolfo Gari MD MBA"},{"external_url":"http://www.facebook.com/people/Rodolfo-Gari/100000441152041#!/RodolfoGari","title":"Rodolfo Gari"}]}