{"first_name":"Roger","last_name":"Allen","permalink":"roger-allen","crunchbase_url":"http://www.crunchbase.com/person/roger-allen","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Oct 23 22:39:09 UTC 2008","updated_at":"Thu Oct 23 22:49:31 UTC 2008","overview":"<p>Roger Allen, director and co-founder of A&amp;B, has practical credentials directly relevant to the Fund based upon over thirty years as a chief executive of a major Australian IT services company with worldwide operations, then 13 years as an active investor in private companies in the ICT industries.</p>\n\n<p>Roger grew shareholder value in Computer Power from $250k in 1978 to $170m in 1995 (at the time of his retirement) and also grew the annual revenue to over $300m and staff to more than 3,000. Roger obtained private equity from News Corporation, through the direct involvement of Rupert Murdoch, prior to taking Computer Power public on the ASX in 1987. He has direct personal experience in selling Australian information technology products and services in the USA, Europe, Asia, as well as Australia.</p>\n\n<p>He served for six years until 1997 as deputy chairman of Austrade and is very well known throughout the information technology industry in Australia and internationally. He was the first chief executive from an Australian company to be elected chairman of the Australian Information Industries Association, has represented Australia at the World Computer Services Forum and was vice-president of the Asia-Pacific industry organisation. He has also served on two advisory councils to the Prime Minister and has chaired state advisory boards in both NSW and Victoria. He has been an adjunct professor in the School of Entrepreneur-ship of Swinburne University and regularly lectures at INSEAD in the School of Entrepreneurship. Roger was recently awarded the 2007 Pearcey Medal for Lifetime Achievement in recognition for his outstanding contribution to the ICT industry.</p>","image":{"available_sizes":[[[58,72],"assets/images/resized/0002/7268/27268v2-max-150x150.png"],[[58,72],"assets/images/resized/0002/7268/27268v2-max-250x250.png"],[[58,72],"assets/images/resized/0002/7268/27268v2-max-450x450.png"]],"attribution":"<p>http://www.a-b.com.au/People.aspx</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Director & Co-Founder","firm":{"name":"Allen & Buckeridge","permalink":"allen-buckeridge","type_of_entity":"financial_org","image":{"available_sizes":[[[150,70],"assets/images/resized/0003/9826/39826v1-max-150x150.jpg"],[[186,87],"assets/images/resized/0003/9826/39826v1-max-250x250.jpg"],[[186,87],"assets/images/resized/0003/9826/39826v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}