{"first_name":"Roger","last_name":"Creasy","permalink":"roger-creasy","crunchbase_url":"http://www.crunchbase.com/person/roger-creasy","homepage_url":"http://RogerCreasy.com","birthplace":"Burlington, NC","twitter_username":"RogerCreasy","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1963,"born_month":5,"born_day":30,"tag_list":"","alias_list":null,"created_at":"Sat Oct 23 10:03:30 UTC 2010","updated_at":"Thu Oct 20 19:46:31 UTC 2011","overview":"<p>Roger is Director of Interactive Operations for the North Carolina Region for Freedom Communications. He is also co-founder of Image Weavers Marketing, a firm that develops corporate image and digital presence for small business owners and non-profits.</p>\n\n<p>Roger is a digital media veteran with 20 years of internet experience and 10 years of newspaper experience. Roger began his newspaper career as the content manager for the Times-News in Burlington, NC.  Roger quickly moved into the Interactive Director role, as digital media increased in importance to the newspaper industry. Roger lead TheTimesNews.com in adding Employment, Real Estate and Automotive verticals. He also lead the Times-News in becoming the first daily newspaper in North Carolina to offer a digital replica edition.<br/>\nDuring his tenure with Freedom, Roger has developed skills in Sales Leadership, Digital Marketing and Social Media.  His work ethic is unsurpassed. His knowledge and overall savvy of today&#8217;s digital media is excellent as is his speed at adopting new digital media. Roger is a geek with an entrepreneurial spirit. His leadership style is one of collaboration and team-building.  Roger is a unique hybrid of artist, intellectual, technologist, and leader.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0010/6894/106894v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0010/6894/106894v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0010/6894/106894v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/rogercreasy","title":"LinkedIn"}]}