{"first_name":"Roger","last_name":"Maloch","permalink":"roger-maloch","crunchbase_url":"http://www.crunchbase.com/person/roger-maloch","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Aug 13 13:50:26 UTC 2009","updated_at":"Thu Aug 13 13:51:42 UTC 2009","overview":"<p>Maloch brings more than 25 years of financial management and software industry expertise to ADERANT. He has extensive experience in completing and integrating complementary acquisitions that add value to clients and shareholders as well as raising private equity, managing investor and analyst relations, and ensuring corporate compliance.</p>\n\n<p>Prior to joining ADERANT, Maloch was the Chief Financial Officer for Fidelity Information Services (FIS), a leading provider of information processing services and technology solutions for the financial services industry and a division of Fidelity National Financial, Inc. (NYSE: FNF), a Fortune 500 corporation. During his tenure at FIS, Maloch completed the acquisition of eight companies worth $800 million and successfully integrated them into FIS core business.</p>\n\n<p>Before FIS, Maloch served as the Chief Financial Officer at WebTone, a provider of customer interaction software for large financial services companies, where he was responsible for raising $70 million in private equity, integrating the acquisition of a key complementary product, and negotiating the sale of the company to Fidelity National Financial, Inc. for $90 million.</p>\n\n<p>Earlier in his career Maloch served as the Chief Financial Officer for several other companies, including ClickChoice.com, an Internet advertising startup; Digital Transmission Systems, Inc., a publicly traded telecommunications equipment provider; and Unicomp, Inc., a publicly traded international software company.</p>\n\n<p>Maloch earned a Master of Business Administration from Harvard University.</p>","image":{"available_sizes":[[[116,135],"assets/images/resized/0005/6335/56335v1-max-150x150.jpg"],[[116,135],"assets/images/resized/0005/6335/56335v1-max-250x250.jpg"],[[116,135],"assets/images/resized/0005/6335/56335v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CFO","firm":{"name":"ADERANT","permalink":"aderant","type_of_entity":"company","image":{"available_sizes":[[[150,67],"assets/images/resized/0005/6334/56334v1-max-150x150.png"],[[170,76],"assets/images/resized/0005/6334/56334v1-max-250x250.png"],[[170,76],"assets/images/resized/0005/6334/56334v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}