{"first_name":"Roger","last_name":"Strauch","permalink":"roger-strauch","crunchbase_url":"http://www.crunchbase.com/person/roger-strauch","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Nov 27 07:45:29 UTC 2008","updated_at":"Sun Jun 21 22:19:00 UTC 2009","overview":"<p>Roger Strauch is chairman of The Roda Group, a venture development company, based in Berkeley, California. His firm, co-founded in 1997 with Dan Miller, provides entrepreneurs the environment, resources, and guidance to launch and grow their high technology businesses.</p>\n\n<p>Roger is on the board of directors of three private companies including GameReady, Ravenflow, and Cardstore.com. The Roda Group company, SightSpeed, which provides video communication services, was sold in the fall of 2008 to Logitech International. PolyServe, a provider of SQL consolidation and file-serving software was acquired in the spring of 2007 by Hewlett-Packard.</p>\n\n<p>Roger recently co-founded and is an owner of iCON Communications, a broadband ISP in Armenia utilitizing WiMax technology.</p>\n\n<p>He was the first CEO and former chairman of Ask Jeeves (now Ask.com) a leading search engine on the web.  Mr. Strauch was a board member and former CEO of Symmetricom, a telecommunications equipment manufacturer. In 1983 he co-founded TCSI Corp., a telecom software company. As TCSI’s chairman and CEO, Mr. Strauch was responsible for growing the company from a start-up to over $60M in annual revenues. TCSI completed a successful IPO in 1991 and secondary public offering in 1996.</p>\n\n<p>Mr. Strauch is a member of the Engineering Dean&#8217;s College Advisory Boards of Cornell University and University of California at Berkeley. He is the recipient of the 2002 Wheeler Oak Meritorious Award from the University of California at Berkeley. In 2006, Mr. Strauch and his wife Dr. Julie Kulhanjian were named and honored as &#8220;Builders of Berkeley&#8221;. He is an executive member of the Board of Trustees for the Mathematical Sciences Research Institute in Berkeley and is on the Board of Trustees and is past President of the Berkeley Repertory Theater.  Mr. Strauch is Vice President and a member of the Executive Board of the Piedmont Council of the Boy Scouts of America and serves as a leader in the local scouting troop. He is a Life Trustee of the Armenian Assembly of America.</p>\n\n<p>Mr. Strauch endowed the Roger A. Strauch Chair in Electrical Engineering and Computer Sciences and co-founded the William Saroyan Endowment for Armenian Studies at the University of California, Berkeley. With Mr. Miller, he helped establish the Ask Jeeves Planetarium at the Chabot Space and Science Center and the Roda Theater at the Berkeley Repertory Theater, winner of the 1997 Tony Award for Outstanding Regional Theatre. </p>\n\n<p>Mr. Strauch is the Chairman of the Paros Foundation which supports arts and education organizations in Armenia. Paros projects include The Paros Chamber Choir - which is composed of disabled musicians, The Manana Youth Center – an after school training program for documentary and animated film production, photography and journalism, Ghoghanj Children’s Center – caring for at risk children in Central Yerevan and The Vanadzor Museum of Fine Arts– an artistic center in the Lori region.</p>\n\n<p>For forty years, Roger has been a licensed amateur radio operator - he holds an extra class license. His current call sign is KD6UO and it was WA1KZE. With his friend Don Melcher, he jointly owns and remotely operates a station based in Mariposa, California.</p>\n\n<p>Mr. Strauch earned a Bachelor of Science degree, with distinction, from Cornell University and Master of Science degree from Stanford University, both in electrical engineering. He holds two patents in the area of wireless communications.</p>","image":{"available_sizes":[[[147,147],"assets/images/resized/0004/9993/49993v1-max-150x150.jpg"],[[147,147],"assets/images/resized/0004/9993/49993v1-max-250x250.jpg"],[[147,147],"assets/images/resized/0004/9993/49993v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chairman","firm":{"name":"Roda Group","permalink":"roda-group","type_of_entity":"financial_org","image":{"available_sizes":[[[141,101],"assets/images/resized/0002/9375/29375v1-max-150x150.png"],[[141,101],"assets/images/resized/0002/9375/29375v1-max-250x250.png"],[[141,101],"assets/images/resized/0002/9375/29375v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Chairman","firm":{"name":"The Roda Group","permalink":"the-roda-group","type_of_entity":"financial_org","image":{"available_sizes":[[[94,68],"assets/images/resized/0004/9992/49992v1-max-150x150.jpg"],[[94,68],"assets/images/resized/0004/9992/49992v1-max-250x250.jpg"],[[94,68],"assets/images/resized/0004/9992/49992v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}