{"first_name":"Roger","last_name":"Stone","permalink":"roger-stone-2","crunchbase_url":"http://www.crunchbase.com/person/roger-stone-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Mar 29 01:50:47 UTC 2011","updated_at":"Tue Mar 29 08:28:16 UTC 2011","overview":"<p>Roger Stone joined IPVG as Deputy Chairman in 2005 and has been involved with all the major developments of the company. In early 2008 Roger took on the additional responsibility as CEO of Prolexic Technologies. Roger brings 40 years of marketing, sales, software development and executive management experience in IT and telecommunications industries. For a number of years he ran his own consultancy business and leveraged his exposure to European, Asian &amp; Pacific rim, Central and Latin American business markets. Roger has specialized in establishing new operations, including joint ventures, in emerging markets, and has spent over 30 years of his career working outside the United Kingdom in Austria, Hong Kong, India, Philippines, Vietnam, Thailand and Costa Rica and has held senior management posts in IT companies including Unisys Corp, IDT Corp, and, prior to joining IPVG, as CEO of a UK based plc. He graduated from Loughborough University of Technology in the United Kingdom with an Honours degree in Aero /Automotive Engineering.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"Prolexic Technologies","permalink":"prolexic","type_of_entity":"company","image":{"available_sizes":[[[150,36],"assets/images/resized/0012/8177/128177v3-max-150x150.jpg"],[[250,60],"assets/images/resized/0012/8177/128177v3-max-250x250.jpg"],[[450,108],"assets/images/resized/0012/8177/128177v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}