{"first_name":"Rohhit","last_name":"Pasi","permalink":"rohhit-pasi","crunchbase_url":"http://www.crunchbase.com/person/rohhit-pasi","homepage_url":"","birthplace":"Nagpur","twitter_username":"Rohhit","blog_url":"https://twitter.com/rohhit","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1987,"born_month":11,"born_day":20,"tag_list":"rohhit-pasi, pasi, rohit-pasi","alias_list":null,"created_at":"Mon Sep 03 13:46:01 UTC 2012","updated_at":"Sat Sep 08 02:19:18 UTC 2012","overview":"<p>Rohhit Pasi was born in Nagpur, Maharashtra on 20 November 1987 but grew up in Ambala Cantt, Haryana. </p>\n\n<p>Rohhit finished high school at the Bhartiya Public School in 2005 and left for college to study engineering at YMCA Institute of Engineering, Faridabad. During his first year, Rohhit’s interest for parties blossomed and he began working as a promoter in Delhi, As his promoter career began to take off, he gradually started taking lessons from his DJs to perform as a DJ at his own parties. Soon Rohhit was found at almost every high profile events from managing the overall promotion to managing the artist and handling the invites at prominent night clubs of Delhi &amp; adjoining areas.\nHis interest for music and parties later on helped him to form two different promoting clubs in Delhi which in a short period became one of the most dominating promoter lobbies in India to promote artists and clubs.</p>\n\n<p>Year 2006 brought path breaking success to his music career as he won War of DJs in 2006 and later at 2007 also. His promoter career took a sharp turn as he signed 84 corporate accounts as the sole concierge partner.   </p>\n\n<p>In 2007, during his promotional career Rohhit formed a group with Raj Singh Negi to promote parties and concentrate equally at his ongoing studies at an engineering college in Faridabad. </p>\n\n<p>In 2008 the partnership ran into a dispute when Rohhit went for his first &amp; only off campus interview at an engineering college in Panipat, Haryana amid what could be considered as one of the biggest club launch of Head Quarters, Hotel Samrat, Chankyapuri a 5 star property.  The dispute later resulted into strong financial loss to Rohhit Pasi and Raj Singh Negi which further led to conflicts among their networks too. </p>\n\n<p>After the dispute, Rohhit returns to college to resume his studies but in a quick succession of time Rohhit gets hired by Jiten Bhatia for his consulting venture Smart Source at Faridabad and moved into corporate life which helped him to plug his financial losses and learn the basics of executive search and retail consulting. </p>\n\n<p>In year 2009 Rohhit left Smart Source to join New Delhi based Electronic Security Company Pravar Electronics. Rohhit was one of the most instrumental guys for turning around the business operations for his company and helped explore different business avenues for his company. During his employment with Pravar Electronics, Rohhit kept on supporting start-ups with his ideas and acting as catalyst in bringing seed funding for them.</p>\n\n<p>Year 2010, Rohhit bagged Youngest Retail Consultant in South Asian Continent by Asia Retail Congress, governing body of retailers in Asia. Rohhit continued to serve Pravar Electronics for the inception of their retail division at Mumbai, Maharashtra and in early 2012 he left to pursue his interest into business consulting and promotion business with his venture Arete and Arista. </p>\n\n<p>Currently he is working as the Director of the start-up and is responsible for the business development and operations of the company.</p>","image":{"available_sizes":[[[98,150],"assets/images/resized/0020/9460/209460v2-max-150x150.jpg"],[[164,250],"assets/images/resized/0020/9460/209460v2-max-250x250.jpg"],[[295,450],"assets/images/resized/0020/9460/209460v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelors","subject":"Information Technology","institution":"YMCA Institute of Engineering, Faridabad","graduated_year":2009,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/rohhitpasi","title":"LinkedIn"}]}