{"first_name":"Roi","last_name":"Sorezki","permalink":"roi-sorezki","crunchbase_url":"http://www.crunchbase.com/person/roi-sorezki","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Sorezki","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue May 22 14:12:02 UTC 2012","updated_at":"Tue Sep 18 13:41:17 UTC 2012","overview":"<p>Roi Sorezki has been involved in the internet optimization and marketing community since 1997 when, as a teenager, he founded his first company specializing in web development and design. Since then his passion and knowledge of the internet fields has grown and led him to found and chair various web-related companies. \nIn 2001 Roi founded the popular website MoviesPlanet.com- a leading international movie related social network serving millions of users around the world. Expanding his reach into the online film niche, Roi also founded Film.FM, a site which works as a search engine exclusively for films.\nHis experience in founding and managing the two successful sites led Roi, in 2004, to co-found Skylab Group Ltd., the company which developed Eradox- an online startup selling established and websites using an advanced e-commerce system. In 2009 Roi became a lecturer at the John Bryce IT College.\nMost recently Roi founded Sorezki Ltd., a company which develops state-of-the-art products for the SEM and SEO industries. Continuing his development in the SEO and SEM fields, Roi purchased the domain BackTweets.com in 2012 and re-launched the Twitter analytics tool as a free service allowing users to search through a Tweet archive for URL links sent via Twitter. \nAs CEO, Roi continues to oversee the development and expansion of his businesses and also acts as an independent consultant for several large technology firms.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder and CEO","firm":{"name":"Sorezki","permalink":"sorezki","type_of_entity":"company","image":{"available_sizes":[[[150,33],"assets/images/resized/0019/1025/191025v2-max-150x150.png"],[[211,47],"assets/images/resized/0019/1025/191025v2-max-250x250.png"],[[211,47],"assets/images/resized/0019/1025/191025v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}