{"first_name":"Roland","last_name":"Schumann","permalink":"roland-schumann","crunchbase_url":"http://www.crunchbase.com/person/roland-schumann","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 10 22:01:24 UTC 2008","updated_at":"Tue Jun 10 22:05:19 UTC 2008","overview":"<p>Roland Schumann is a former military intelligence officer, having served both on active duty and in the reserves. Trained in unconventional warfare and electronic intelligence gathering, he also has practical experience in airborne operations, human intelligence (HUMINT), counter-intelligence, and counter-terrorism. He has performed risk analyses in Latin America for the US government and in the United States for commercial and government interests.</p>\n\n<p>Mr. Schumann is also recognized as a data security expert. He co-founded SwapDrive to enable businesses to store their mission-critical data online in secure data centers located away from their regular company offices. As the Chief Operating Officer at SwapDrive, Roland is a key player in the development of policy and strategic plans. He was formerly a senior associate at Booz, Allen &amp; Hamilton where he provided technical risk management services to the company&#8217;s clientele. Prior to this position, he was a senior project manager and system developer for the Thomson Corporation, overseeing complex technical projects for companies such as Merrill Lynch, West Publishing, and Andersen Consulting. Mr. Schumann has authored three technical books related to the Internet, &#8220;EcoData: Using Your PC to Obtain Environmental Information&#8221;, 1st &amp; 2nd Editions (published by Government Institutes) and &#8220;The Energy Guide to the Internet&#8221; (published by McGraw-Hill) and has been featured on MSNBC and TechTV. He received a B.A. in Political Science from the University of Colorado-Boulder and a M.S. in Information Systems from George Washington University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"COO","firm":{"name":"SwapDrive","permalink":"swapdrive","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0002/0220/20220v1-max-150x150.png"],[[175,62],"assets/images/resized/0002/0220/20220v1-max-250x250.png"],[[175,62],"assets/images/resized/0002/0220/20220v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}