{"first_name":"Roman","last_name":"Stotland","permalink":"roman-stotland","crunchbase_url":"http://www.crunchbase.com/person/roman-stotland","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"SocialTab","born_year":null,"born_month":null,"born_day":null,"tag_list":"roman, roman-stotland, stotland, socialtab, socialtab-inc, social-tab, stuforest, stu-forest","alias_list":null,"created_at":"Tue Oct 06 19:45:54 UTC 2009","updated_at":"Wed Jul 27 19:40:57 UTC 2011","overview":"<p>Roman Stotland is the Chief Creative Officer of SocialTab Inc., and a graduate of Michigan State University, where he earned a Bachelor of Arts with Honors in Digital Media Arts and Technology.</p>\n\n<p>Roman has always been attracted to new and emerging technologies since he moved to the United States from Ukraine in 1994. Since his early childhood he has worked on computer hardware and software to understand and make the technologies better. In his high school years, Roman was a big part of the school&#8217;s desktop publishing program, coordinating on many projects with teachers. Due to the praise he received for his work in high school, Roman became interested in graphic design and animation.</p>\n\n<p>Graduating with an Associates Degree in Business Administration, Roman worked at a major business to business (b2b) IT company. As his career in information technology was taking off, Roman decided to pursue his interests in digital media and design. He resigned from his job and devoted the next several years towards a bachelor&#8217;s degree from Michigan State University. While at MSU, Roman held a position as acting manager for the computer support group at the College of Education. During his student employment, he was nominated student employee of the year and transitioned into web and graphic design projects.</p>\n\n<p>Roman hopes to expand his creative side with his role in SocialTab, by introducing new technologies to the work environment and converting old technologies for the new age. He is a web/graphics designer, as well as a flash animator and programmer, who keeps up with the latest technology trends, and looks for ways to implement technology in creative ways.</p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0013/9545/139545v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0013/9545/139545v2-max-250x250.jpg"],[[450,300],"assets/images/resized/0013/9545/139545v2-max-450x450.jpg"]],"attribution":"<p>Roman Stotland / <a href=\"http://www.socialtab.com\" title=\"SocialTab Inc.\" rel=\"nofollow\">SocialTab Inc.</a></p>"},"degrees":[{"degree_type":"Bachelor of Arts","subject":"Telecommunications, Information Studies, and Media","institution":"Michigan State University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chief Creative Officer","firm":{"name":"SocialTab","permalink":"socialtab","type_of_entity":"company","image":{"available_sizes":[[[150,51],"assets/images/resized/0006/1844/61844v2-max-150x150.png"],[[250,86],"assets/images/resized/0006/1844/61844v2-max-250x250.png"],[[450,155],"assets/images/resized/0006/1844/61844v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.socialtab.com","title":"SocialTab Inc."},{"external_url":"http://www.stuforest.com","title":"Stuforest"}],"web_presences":[]}