{"first_name":"Ron","last_name":"Bell","permalink":"ron-bell","crunchbase_url":"http://www.crunchbase.com/person/ron-bell","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jun 03 23:55:44 UTC 2010","updated_at":"Wed Aug 29 09:56:50 UTC 2012","overview":"<p>Ron Bell is Vice President &amp; Deputy General Counsel for Global Products and the Americas Business Unit at Yahoo!. He and his multinational team provide regulatory counsel to Yahoo!&#8217;s global product teams and structure and negotiate a wide variety of complex commercial transactions in Canada, Latin America, and the United States, including strategic alliances, content, advertising, procurement, technology license agreements, and Yahoo!&#8217;s global mobile product initiatives. Ron also oversees legal department operations and technology infrastructure. He chairs the legal department&#8217;s people committee, which manages initiatives around career and skills development, mentoring, and legal education.</p>\n\n<p>Prior to joining Yahoo!, Ron served as Senior Legal Counsel and hardware licensing attorney to the PowerBook and Imaging groups at Apple.  He also worked in private practice as a general commercial, media, and intellectual property litigator with what is now the SNR Denton firm in Chicago. Ron received his J.D. from the University of Chicago in 1992 and his B.A. from UCLA in 1989. He is admitted to practice in Illinois and California.</p>","image":null,"degrees":[{"degree_type":"J.D.","subject":"Law","institution":"University of Chicago","graduated_year":1992,"graduated_month":null,"graduated_day":null},{"degree_type":"B.A.","subject":"Political Science & Law & Society","institution":"UCLA","graduated_year":1989,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/ronsbell_tech","title":"twitter"}]}