{"first_name":"Ron","last_name":"Watson","permalink":"ron-watson-2","crunchbase_url":"http://www.crunchbase.com/person/ron-watson-2","homepage_url":"","birthplace":"Toronto","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1969,"born_month":3,"born_day":3,"tag_list":"poolexpert-filemobile-start-up-entrepreneur-ugc-internet--ron-watson","alias_list":null,"created_at":"Thu Sep 08 16:31:29 UTC 2011","updated_at":"Fri Oct 26 05:46:18 UTC 2012","overview":"<p>Ron is an internet start-up veteran, having founded Filemobile and 3 other internet businesses over the past 10 years. </p>\n\n<p>In Sept 2006, Ron incubated Filemobile in Toronto, and authored the business plan with the aspiration of providing a corporate toolset that enabled businesses to create their own communities around common philosophies, beliefs and goals.  Ron is a systemic thinker and strategically ensures that people, structures, and processes all collectively work together in growing a healthy organization. He has developed a gift for finding the market gap and understands the resources necessary to deliver a successful technology. He adapts to new information, assesses the risks, and creates opportunities for the team to succeed. </p>\n\n<p>Prior to Filemobile, Ron was the CEO/Owner at PoolExpert Inc. He created one of the largest communities for Fantasy Sports in North America, and successfully negotiated PoolExpert’s acquisition to Rogers Media in July 2008. PoolExpert is a vibrant hockey community of over 350,000 active registered users. </p>\n\n<p>In addition to these achievements, Ron previously worked in M&amp;A with a large accounting firm, achieved a MBA with distinction in finance, and swam on the Canadian National Swim Team for 6 years.</p>","image":{"available_sizes":[[[75,150],"assets/images/resized/0015/3289/153289v2-max-150x150.jpg"],[[125,250],"assets/images/resized/0015/3289/153289v2-max-250x250.jpg"],[[177,354],"assets/images/resized/0015/3289/153289v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"","institution":"U of Q","graduated_year":1999,"graduated_month":null,"graduated_day":null},{"degree_type":"","subject":"","institution":"U of T","graduated_year":1993,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}