{"first_name":"Ron","last_name":"Olsthoorn","permalink":"ron-olsthoorn","crunchbase_url":"http://www.crunchbase.com/person/ron-olsthoorn","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 17 07:48:10 UTC 2012","updated_at":"Wed Jul 18 00:00:04 UTC 2012","overview":"<p>Ron Olsthoorn </p>\n\n<p>Inheriting money can be both a happy and a sad time, notes financial planning expert, Ron Olsthoorn. It’s particularly sad if the person who left the bequest is a close friend or relative whom you will miss. Many people also find themselves suffering from guilt issues. What have they done to be so fortunate when so many around them are struggling?</p>\n\n<p>A financial planner can help you make the important decisions necessary in order to handle your inheritance wisely.</p>\n\n<p>Pay Off All Your High Interest Debts</p>\n\n<p>The first advice your financial planner will probably give you is to pay off all your high interest debts. Chief among these will be your non-secured credit card debts because these carry extremely high interest rates. </p>\n\n<p>Invest the Money</p>\n\n<p>Many people who inherit large sums of money fritter it away without clearly understanding the implications of spending it. The best thing you can do with any sort of inheritance is to invest it. Don’t touch the capital. Instead, use the interest to subsidize the extras you might not have been able to afford previously.</p>\n\n<p>Unless you inherit a truly life-changing amount of money, it’s unwise to quit your day job, says Ron Olsthoorn. What is a life-changing amount of money? For different people, it’s different amounts. It depends upon whether the interest your investment generates is enough for you to live comfortably.</p>\n\n<p>If you inherit $100,000 and invest it at a five percent return, you will not be able to live on $5,000 a year. If you inherit a million dollars, however, you may be able to live on $50,000 a year.</p>\n\n<p>Inheritance and Taxes</p>\n\n<p>The property of your deceased loved one may be subject to a number of different taxes. These include estate taxes, federal and state taxes and other inheritance taxes:</p>\n\n<p>State and federal taxes: The executor of the deceased person’s estate is required to file income taxes on earned income.</p>\n\n<p>Estate tax: A person’s estate is the sum total of all a person’s debts and possessions when he or she dies. The federal government levies a tax on the amount of the estate after all creditors have been paid. The estate itself pays the tax.</p>\n\n<p>Inheritance tax: An inheritance tax is paid by those inheriting the estate on the amounts received by the heirs. The states rather than the federal government levy inheritance taxes. Finance expert Ron Olsthoorn notes that a good financial planner can help people plan their estates so taxes are minimized.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/1390/201390v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/1390/201390v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/1390/201390v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}