{"first_name":"Ron","last_name":"Lissak","permalink":"ron-lissak","crunchbase_url":"http://www.crunchbase.com/person/ron-lissak","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Catapult Advisors","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Feb 12 18:58:40 UTC 2008","updated_at":"Sun Mar 25 06:13:54 UTC 2012","overview":"<p>Ron Lissak helps software and internet entrepreneurs with M&amp;A and capital raising advice and services.</p>\n\n<p>Ron Lissak has dedicated himself to providing value-added advice to entrepreneurs since he began his career as an investment banker in 1985. Ron’s primary professional focus has been to work with CEOs to optimize the value of their companies and to increase their overall strategic and financing options. As the Managing Partner of Catapult Advisors, Ron specializes in advising CEOs of software and internet companies on their capital raising and M&amp;A strategies (both buy-side and sell-side). Ron has been a frequent speaker on the topics of software M&amp;A and venture capital, and is often quoted in the press on these topics.</p>\n\n<p>Prior to founding Catapult Advisors in 2001, Ron focused on raising public and private equity for venture-backed growth companies. Most recently, he served as Managing Director and Head of the Private Equity Group at Banc of America Securities (formerly Montgomery Securities). In that position, Ron was responsible for all private equity capital raising activity for Bank of America globally. Previously, Ron was Co-Head of Montgomery Securities’ international division where, for nine years, he and his team assisted public and private venture-backed companies in accessing capital from international institutions. Ron began his business career with Salomon Brothers in New York and London, where he was responsible for raising capital from institutional investors throughout Europe. </p>\n\n<p>Catapult’s clients have been backed by top tier investment funds including: Kleiner Perkins, NEA, Sequoia, Sierra Ventures, Intel Capital, JK&amp;B Capital among others. Our clients have partnered with/been acquired by: Google, Oracle, Microsoft and Landmark Communications, among others. Catapult’s assignments have spanned a number of vertical areas including: Web 2.0; Social Networking; Clean Technology; Business Intelligence; Storage; Security; Mobile/Wireless; Online Advertising/Lead Generation; Enterprise Search; Database; and Digital Media.</p>\n\n<p>Ron holds a BA in Philosophy from the University of California, Berkeley and an MA in International Economics and International Relations from The Johns Hopkins University, School of Advanced International Studies (SAIS).  </p>\n\n<p>Ron Lissak can be contacted at rlissak@catapultadvisors.com</p>","image":{"available_sizes":[[[98,150],"assets/images/resized/0018/0294/180294v2-max-150x150.jpg"],[[164,250],"assets/images/resized/0018/0294/180294v2-max-250x250.jpg"],[[295,450],"assets/images/resized/0018/0294/180294v2-max-450x450.jpg"]],"attribution":"<p>Self</p>"},"degrees":[{"degree_type":"MA","subject":"International Economics & International Relations","institution":"Johns Hopkins School of Advanced International Studies (SAIS)","graduated_year":1986,"graduated_month":null,"graduated_day":null},{"degree_type":"AB","subject":"Philosophy","institution":"UC Berkeley","graduated_year":1982,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":null,"title":"Managing Partner","firm":{"name":"Catapult Advisors","permalink":"catapult-advisors","type_of_entity":"financial_org","image":{"available_sizes":[[[150,50],"assets/images/resized/0002/3360/23360v1-max-150x150.png"],[[183,62],"assets/images/resized/0002/3360/23360v1-max-250x250.png"],[[183,62],"assets/images/resized/0002/3360/23360v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.catapultadvisors.com","title":""},{"external_url":"http://www.linkedin.com/in/ronlissak","title":""},{"external_url":"http://www.expertceo.com","title":""}]}