{"first_name":"Ron","last_name":"LeMay","permalink":"ron-lemay","crunchbase_url":"http://www.crunchbase.com/person/ron-lemay","homepage_url":"http://www.openairep.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Oct 13 15:41:41 UTC 2011","updated_at":"Sun Oct 30 22:59:24 UTC 2011","overview":"<p>Ron is a pioneer and respected leader in the wireless industry. As our most seasoned director, he brings to the firm nearly 40 years of telecommunications senior operating experience. Prior to co-founding OpenAir, Ron spent many years in senior leadership roles with AT&amp;T, Sprint, and Southwestern Bell. Having worked in an environment known for innovation and emerging technologies, Ron is eminently qualified to recognize innovation and to guide fledgling companies in successfully applying technology in the marketplace. Among Ron&#8217;s accomplishments:\n •Employee #1 and CEO of Sprint’s wireless division\n•President and COO of Sprint Corporation\n•As CEO, orchestrated turn-around and sale of Japan Telecom\n•Partner of October Capital, an early-stage venture capital investment firm, since 1999\n•Current board of director memberships: Allstate (ALL), GoGo In-flight Internet, Imation (IMN), eRecyclingCorps, MachineryLink and Zave Networks</p>\n\n<p>Additional Experience</p>\n\n<p>Ron was employee number one and CEO of Sprint PCS, the break-through wireless division of Sprint. Under Ron&#8217;s leadership, the company generated $10B in annual revenues, faster than any US company has before or since. After leaving Sprint in 2003, he joined Ripplewood Holdings as an Industrial Partner and orchestrated the turn-around (as CEO), and subsequent sale of Japan Telecom, generating outstanding returns to Ripplewood investors. Ron is the current chairman of GoGo Inflight Internet, the leading broadband in-flight Internet service that effectively turns a commercial airplane into a Wi-Fi hotspot with true in-flight Internet access.</p>\n\n<p>Ron is a highly sought after board member for both public and privately-held companies and currently sits on the boards of Allstate (ALL), Imation (IMN), GoGo In-flight Internet, eRecyclingCorps, Zave Networks and MachineryLink.</p>\n\n<p>A native of Arkansas, Ron attended Southern Arkansas University where he earned a bachelor&#8217;s degree, and the University of Arkansas School of Law. </p>","image":{"available_sizes":[[[116,150],"assets/images/resized/0015/7988/157988v2-max-150x150.jpg"],[[116,150],"assets/images/resized/0015/7988/157988v2-max-250x250.jpg"],[[116,150],"assets/images/resized/0015/7988/157988v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chairman","firm":{"name":"eRecycling Corps","permalink":"erecycling-corps","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0015/7998/157998v2-max-150x150.jpg"],[[250,80],"assets/images/resized/0015/7998/157998v2-max-250x250.jpg"],[[450,144],"assets/images/resized/0015/7998/157998v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}