{"first_name":"Ron","last_name":"Fox","permalink":"ron-fox","crunchbase_url":"http://www.crunchbase.com/person/ron-fox","homepage_url":"http://www.winanelection.com/","birthplace":"Las Vegas","twitter_username":"","blog_url":"http://www.winanelection.com/default/blog/cat/News/","blog_feed_url":"","affiliation_name":"Win An Election","born_year":1980,"born_month":null,"born_day":null,"tag_list":"how-to-win-an-election, election-campaign, political-campaign, running-for-office, political-elections, winning-an-election, running-for-public-office, election-campaign-strategy, political-campaign-strategy, election-marketing-campaign","alias_list":null,"created_at":"Fri Dec 23 11:30:31 UTC 2011","updated_at":"Sat Dec 24 04:47:48 UTC 2011","overview":"<p>There are thousands of local elections annually throughout the    United States.  School board, city council, sheriff, judge, the list goes on.  Most of the officials who comprise our democratic system are not career politicians with a large campaign staff and unlimited campaign funds.  They are everyday citizens who want to make their community better.  WinAnElection, a division of Fox Marketing and Print Group, LLC, is dedicated to developing affordable professional election campaign tools so more ordinary citizens can participate in our democratic processes.</p>\n\n<p>WinAnElection.com started by developing a collection of campaign tools for local political campaigns.  Hours of research and study was conducted on each product and service.  A team comprised of individuals from Fox Marketing and other participating companies was built on an idea:  Give the best, support it, and make it affordable.  </p>\n\n<p>WinAnElection has a policy of encouraging input from candidates on the front line.  It is critical to receive honest reviews on current products and services. If we can improve it, we will. But it is just as important to get feedback on what is needed and not there.  We welcome emails and love new ideas.</p>","image":{"available_sizes":[[[150,64],"assets/images/resized/0016/7507/167507v2-max-150x150.jpg"],[[245,106],"assets/images/resized/0016/7507/167507v2-max-250x250.jpg"],[[245,106],"assets/images/resized/0016/7507/167507v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Owner","firm":{"name":"Win An Election","permalink":"win-an-election","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}