{"first_name":"Ronald","last_name":"Simons","permalink":"ronald-simons","crunchbase_url":"http://www.crunchbase.com/person/ronald-simons","homepage_url":"http://www.ronaldsimons.com","birthplace":"Trenton, NJ","twitter_username":"ronaldsimons","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1971,"born_month":null,"born_day":null,"tag_list":"ronald-simons, ronald-c--simons, globe-icons, globe-icons-interactive, globeicons, globeiconsinteractive, ronaldsimons, ronaldcsimons, simons, inventor, entrepreneur, consultant","alias_list":null,"created_at":"Wed Dec 07 18:16:59 UTC 2011","updated_at":"Sun Jul 01 03:29:22 UTC 2012","overview":"<p>I am an Entrepreneur, Founder, Consultant, Mentor, Writer, Inventor and Philanthropist.</p>\n\n<p>As an Entrepreneur I bootstrapped 4 companies. I attend SCORE and learn from retired entrepreneurs. I also became an active member of the NJTC. My entrepreneurial experience started at age 13, working &#8220;Under-The-Table&#8221; at Yellow Cab of Trenton, NJ. I was hired for $1.00 a day, to perform maintenance checks of oil and tire pressure on cabs. I noticed the same man parked his cab in front of the cab garage door every night; even though their was nothing wrong with the cab. In the morning, I had to move the cab, to move other cabs into the garage for service. I figured out the man was making me warm up his cab in the morning, so he could be the first cab out of the lot and get the first fare. I made a sign and began to sell warm-ups as a cash service for $1.00. Soon I had 30+ cabs a day to start and warm-up every morning before school.</p>\n\n<p>As a Consultant at RS Consulting, my blend of advertising agency, start- up and entrepreneurial experience make me a complete B2B and B2C business solution to scale your businesses marketing and sales objectives. I add value through due diligence. I meet with start-up and existing businesses, to assist in business development and projects. I also meet with advertisers, manufacturers, distributors, venture capitalists, angel investors and C level leaders to understand their corporate aims. With a humble approach, I acquire professional knowledge and expertise in each field of need. I demonstrate comprehensive team building, collaborate and manage utilizing a &#8220;Transformational Leadership Style&#8221;. I am conservative, I exercise realism and good common sense. I focus on making well thought out effective decisions to move projects forward.</p>\n\n<p>I give back to society by mentoring and inspiring other entrepreneurs to gain their sea legs.</p>\n\n<p>My passion is the art of the deal for Branding, Marketing and Advertising at Globe Icons Interactive. </p>\n\n<p>Business Card: Send a text message to 20757 and enter the keyword GLOBE.</p>","image":{"available_sizes":[[[54,150],"assets/images/resized/0016/5598/165598v2-max-150x150.jpg"],[[90,250],"assets/images/resized/0016/5598/165598v2-max-250x250.jpg"],[[163,450],"assets/images/resized/0016/5598/165598v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}