{"first_name":"Ronald","last_name":"J. Burns","permalink":"ronald-j-burns","crunchbase_url":"http://www.crunchbase.com/person/ronald-j-burns","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Aug 19 13:26:00 UTC 2011","updated_at":"Fri Aug 19 13:26:32 UTC 2011","overview":"<p>Ronald J. Burns founded ProtonMedia in 1998, and focuses on business development, marketing and alliances. Ron is a true evangelist, passionate about merging technology and gaming for next generation solutions that improve collaboration and learning. He has spoken at several industry conferences, and has published articles in Pharmaceutical Representative and Focus magazines. Prior to ProtonMedia, Ron established Burns Audio in 1987, building an extensive music library that procured and produced music for television and movies. Ron’s company began producing music and sound design for video and computer games in the mid-90s, and in that process, he began the quest to meld gaming with e-learning. He holds a degree in music composition from Temple University. Ron is also involved with e-Learning for Kids, a global nonprofit foundation that provides free e-learning to children via the Internet. He plays blues guitar and collects guitars from the 1950s. Ron is married with four children and lives in Harleysville, PA.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"ProtonMedia","permalink":"protonmedia","type_of_entity":"company","image":{"available_sizes":[[[150,77],"assets/images/resized/0005/2920/52920v1-max-150x150.jpg"],[[169,87],"assets/images/resized/0005/2920/52920v1-max-250x250.jpg"],[[169,87],"assets/images/resized/0005/2920/52920v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}