{"first_name":"Rory","last_name":"Ardagh","permalink":"rory-ardagh-2","crunchbase_url":"http://www.crunchbase.com/person/rory-ardagh-2","homepage_url":"http://www.clipsure.com","birthplace":"Bermuda","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1974,"born_month":4,"born_day":7,"tag_list":"","alias_list":null,"created_at":"Thu Oct 21 15:10:18 UTC 2010","updated_at":"Fri Oct 22 21:36:42 UTC 2010","overview":"<p>Rory Ardagh is an experienced entrepreneur with specialist knowledge of  telecoms, media and regulatory affairs at a national and EU level. Rory has co-founded a number of companies over the last 12 years including Formus Communications, Leap Broadband, EAP consulting, Telecom Property Holdings and most recently ClipSure. Rory was a leading member of the team at Magent Networks. </p>\n\n<p>Rory has extensive experience in telecoms regulation having worked to secure radio spectrum as part of bid teams for wireless licenses across Europe. As technical director of a number of companies Rory was responsible for network strategy, design, planning and  roll out of WLL, LMDS, WiMax, xDSL and fibre networks with Capex budgets in excess of €100 million. </p>\n\n<p>Rory has worked to implement in country as well as pan-European networks including the negotiation and purchase of large scale connectivity from Tier 1 carriers. Rory has worked to secure government and structural funding from the EU and Irish government worth several million euros.  </p>\n\n<p>Rory has operational experience ranging from business start up through to large scale multinational organisations.  Rory is a former member of the Irish Government National Competitiveness Council, a group that reports to the Irish Prime Minister on the nation’s strategic direction to ensure a competitive economy. </p>","image":null,"degrees":[{"degree_type":"MSc","subject":"Masters in Management","institution":"ESCP","graduated_year":1998,"graduated_month":null,"graduated_day":null},{"degree_type":"Bsc","subject":"Economics","institution":"Trinity College Dublin","graduated_year":1996,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://ie.linkedin.com/in/rardagh","title":""}]}