{"first_name":"Rory","last_name":"Jones","permalink":"rory-jones","crunchbase_url":"http://www.crunchbase.com/person/rory-jones","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jul 29 01:41:02 UTC 2008","updated_at":"Tue Jul 29 01:43:47 UTC 2008","overview":"<p>Rory Jones brings to Landmark diverse experience in both the private and non-profit sectors. Working with public policy initiatives and donor-funded microfinance programs, Rory has been a researcher, writer and advocacy leader for numerous philanthropic organizations worldwide. His background in international economics led him to positions with Oxfam America in Boston and the International Organization for Migration in Rome where he was responsible for efforts around international development. In addition, his dynamic resume includes strategic business consulting in the US and abroad. At Landmark, Rory is responsible for managing and supporting an array of account relationships across the Fortune 500 including driving sales pipeline efforts and ROI across client accounts. Rory received a B.A. from Northwestern University with a double major in Economics and International Relations and has fostered a passion for socially responsible business practices. One of his keen interests is the application of emerging renewable and sustainable technologies as a tool for profit and a key to social justice. </p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"General Partner","firm":{"name":"Landmark Ventures","permalink":"landmark-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,92],"assets/images/resized/0002/2859/22859v7-max-150x150.jpg"],[[250,153],"assets/images/resized/0002/2859/22859v7-max-250x250.jpg"],[[450,277],"assets/images/resized/0002/2859/22859v7-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}