{"first_name":"Rosalind","last_name":"Resnick","permalink":"rosalind-resnick","crunchbase_url":"http://www.crunchbase.com/person/rosalind-resnick","homepage_url":"http://www.abcbizhelp.com","birthplace":"New York City","twitter_username":null,"blog_url":"http://vestpocketconsultant.entrepreneur.com","blog_feed_url":"","affiliation_name":"Axxess Business Consulting","born_year":1959,"born_month":8,"born_day":10,"tag_list":"small-business, consulting, business-plans, netcreations, axxess, new-york, entrepreneur, johns-hopkins, do-something","alias_list":null,"created_at":"Tue Sep 23 01:05:47 UTC 2008","updated_at":"Wed May 23 14:49:55 UTC 2012","overview":"<p>Rosalind Resnick is the founder and CEO of Double R Ventures LLC. Founded in 2002, Double R Ventures LLC specializes in real estate investment, development and property management in New York City. Currently, Double R Ventures manages six townhouse properties and one luxury penthouse in New York&#8217;s historic Greenwich Village. Double R Ventures also serves as a springboard for Resnick&#8217;s startup ventures and investments in technology and other industries.</p>\n\n<p>Previously, Resnick founded and served as president of Axxess Business Consulting, a New York City consulting firm that helps startups and emerging businesses develop business plans and financial models to raise capital from angels, banks and investors. </p>\n\n<p>A former business and computer journalist, Rosalind co-founded NetCreations in March 1995 and served as the company&#8217;s CEO and president until December 2001, pioneering the concept of 100% opt-in email marketing in 1996 and spearheading the company&#8217;s successful IPO in 1999. Rosalind also hosted AOL&#8217;s NetGirl Forum, one of the Internet&#8217;s most popular online dating services, from 1995 to 1996. </p>\n\n<p>In 1994, Rosalind co-authored The Internet Business Guide and, from 1994 to 1997, served as the editor and publisher of Interactive Publishing Alert, a semimonthly newsletter tracking trends and developments in online publishing and advertising. </p>\n\n<p>Rosalind began her career in the newspaper industry in 1980 at The Baltimore Sun and worked as a business writer at The Miami Herald from 1984 to 1989. Rosalind received BA and MA degrees in History from Johns Hopkins University and makes her home in New York City with her two daughters. She has been a frequent contributor to Entrepreneur Magazine and served on the board of Do Something, Inc., a New York City-based not-for-profit organization that empowers young people to change their world.</p>","image":{"available_sizes":[[[150,117],"assets/images/resized/0002/5472/25472v2-max-150x150.jpg"],[[250,195],"assets/images/resized/0002/5472/25472v2-max-250x250.jpg"],[[300,235],"assets/images/resized/0002/5472/25472v2-max-450x450.jpg"]],"attribution":"<p>Rosalind Resnick</p>"},"degrees":[{"degree_type":"B.A./M.A.","subject":"History","institution":"Johns Hopkins","graduated_year":1981,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"Axxess Business Consulting","permalink":"axxess-business-consulting","type_of_entity":"company","image":null}},{"is_past":true,"title":"Advisor","firm":{"name":"YourLocal","permalink":"yourlocal","type_of_entity":"company","image":{"available_sizes":[[[150,41],"assets/images/resized/0002/6155/26155v1-max-150x150.jpg"],[[222,61],"assets/images/resized/0002/6155/26155v1-max-250x250.jpg"],[[222,61],"assets/images/resized/0002/6155/26155v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://vestpocketconsultant.entrepreneur.com/","title":"The Vest Pocket Consultant"}],"web_presences":[{"external_url":"http://www.linkedin.com/in/rosalindresnick","title":"Rosalind Resnick Profile"}]}