{"first_name":"Rose","last_name":"Adkins","permalink":"rose-adkins","crunchbase_url":"http://www.crunchbase.com/person/rose-adkins","homepage_url":"","birthplace":"Santa Monica ","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Apr 02 18:25:58 UTC 2012","updated_at":"Fri Apr 06 22:39:17 UTC 2012","overview":"<p>Rose Adkins is a well-respected entertainment executive who has worked in senior positions at The Hollywood Reporter, Sundance Institute and Universal Pictures, where she was the Director of Studio Partnerships. After Universal Pictures, she oversaw all foreign distribution for Ralph Farquhar, producer of TV shows such as Married with Children, Moesha, The Parkers, Disney&#39;s the Proud Family and films with Sony Screen Gems, The Maintenance Man and Boulevard. Adkins has acquired foreign films for key territories, such as Black to the Moon and has secured US and Latin American distribution for those specified titles. Since 2008, she relocated from Los Angeles to New York to launch her own film production company called TAG, The Adkins Group (www.tagstudios.tv). She has a Bachelor&#8217;s of Science in Business Administration from the University of Southern California. In 2012, she invested and started a company called, Screen It! - an online distribution platform for the buying and selling of TV content globally.</p>\n\n<p>In her spare time, she sits on many committees and/or boards for non-profit organizations to include The U.S. Green Building Council of New York, the New York Philharmonic Orchestra, House of the Roses, the Bal de Berceaux, FOCO, AIGA, and many others. She is very active in donating and raising funds for various projects that focus on underprivileged children, music, the arts, education, homelessness, and equality. She has donated her time to organizations in Buenos Aires, Argentina and has helped to raise awareness and finances to fight against the various injustices that occur in third world countries. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}