{"first_name":"Ross","last_name":"Meador","permalink":"ross-meador","crunchbase_url":"http://www.crunchbase.com/person/ross-meador","homepage_url":"http://www.meadorlaw.com","birthplace":"Mexico","twitter_username":"meadorlaw","blog_url":"","blog_feed_url":"","affiliation_name":"Rogers & Meador","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Dec 07 22:26:08 UTC 2009","updated_at":"Mon Dec 07 23:28:21 UTC 2009","overview":"<p>Ross Meador is a lawyer, entrepreneur, investor, teacher and philanthropist. \nNow an internationally recognized authority on international business and law, Mr. Meador’s career began in Vietnam in 1974 when he went alone to Saigon to open the wartime office for a child welfare organization, FCVN. The story of his work and evacuation from the roof of the American Embassy in Saigon has been told in several books and screenplays, his photographs of the evacuation hang in the Gerald R. Ford Presidential Museum, and his organization has been nominated twice for the Presidential Medal of Freedom.\nMr. Meador graduated from UC Berkeley’s Boalt Hall School of Law in 1986, where he served as Executive Editor of the International Tax and Business Lawyer law review. He is a former partner at Preston Gates &amp; Ellis, prior to which he practiced with Morrison &amp; Foerster and Howard, Rice for 14 years. He also practiced law in Korea with Kim &amp; Chang, Indonesia with SSEK and Vietnam with VILAF for 10 years. He is currently the Managing Partner of Rogers &amp; Meador in Berkeley, California, and Senior Foreign Legal Advisor to Vietnam International Law Firm (VILAF) with offices in Ho Chi Minh City and Hanoi.\nMr. Meador’s law practice currently focuses on international business expansion and general company counseling, including organization, financing and business transactions, strategic relationships, and the protection and licensing of intellectual property. Mr. Meador also founded (and later sold) the executive training company, Advanced Global Connections, and he has lectured on business and entrepreneurship in many venues, ranging from the Hass School of Business to the American Association for the Advancement of Science. He continues to serve on the Executive Committee of the International Section of the California Bar Association. Mr. Meador is listed in Who’s Who in American Law, Who’s Who in Finance and Business, Who’s Who in America and Who’s Who in the World.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0006/8780/68780v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0006/8780/68780v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0006/8780/68780v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"J.D.","subject":"","institution":"UC Berkeley Law","graduated_year":1986,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Meador & Engle","permalink":"rogers-meador","type_of_entity":"company","image":{"available_sizes":[[[150,94],"assets/images/resized/0008/1946/81946v4-max-150x150.jpg"],[[250,157],"assets/images/resized/0008/1946/81946v4-max-250x250.jpg"],[[450,283],"assets/images/resized/0008/1946/81946v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.vietnambabylift.org/World_Airways.html","title":"Vietnam Reunion"}],"web_presences":[]}