{"first_name":"Ross","last_name":"Macgregor","permalink":"ross-macgregor","crunchbase_url":"http://www.crunchbase.com/person/ross-macgregor","homepage_url":"http://www.rossmacgregor.biz","birthplace":"Glasgow, United Kingdom","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"ross-macgregor, nu-force-renewable-energy, finance","alias_list":null,"created_at":"Wed Nov 07 10:59:36 UTC 2012","updated_at":"Thu Nov 08 07:57:05 UTC 2012","overview":"<p>Education</p>\n\n<p>Macgregor attended Lochaber high school. Upon his successful completion, he went on to study tourism with a focus in business, studies which he completed in 2000 from Perth College. Macgregor then went on to pass his futures as well as his securities exams and thereby became a senior stock broker. </p>\n\n<p>Alexander Ross Macgregor’s Career </p>\n\n<p>When his career started out, he managed to take the hard work invested in his studies and focus on a being a stock broker. His work in stock brokerage enabled him to gain a perspective on the business world, business models, client relations and client services. </p>\n\n<p>He started out at a firm where he was responsible for introducing new clients to the company, learning to trade clients.  Clients were traded in NASDAQ and FTSE 100. He succeeded in receiving a promotion and passing his examinations. </p>\n\n<p>Macgregor decided to take his skills and leadership to a direction and path nearer to his passion- the environment and renewable energy which is when he reached Nu Renewable. The efforts and work committed to Spean Bridge were especially meaningful to him. </p>\n\n<p>The pride and leadership that Macgregor brings to his work show that he will undoubtedly continue to reach great places in terms of carbon footprint reduction, environmental awareness and education. </p>\n\n<p>He also volunteers for several organizations that relate to animal rights and safety and to the environment. All around, he is a bright businessman dedicated to doing great work for the environment. </p>\n\n<p>When not at work </p>\n\n<p>Alexander Macgregor is an avid athlete. His hobbies range from sailing to golf, shinty, rugby, biking, jet skiing, hiking and more. Macgregor won every top award for playing competitive shinty. </p>\n\n<p>Shinty is a Scottish sport played with sticks and a ball played mainly in the Scottish Highlands. It is often compared to field hockey but the two games are different in several ways. In Shinty, the player is able to use both sides of the stick as well as use the stick to block and tackle. Shoulder to shoulder tackling is allowed. These rules emphasize what a strong sportsman and athlete Macgregor is as the game can get intense. </p>\n\n<p>Macgregor is an avid member of two golf courses – the Inverness golf club and the Spean-Bridge golf. He enjoys taking in a golf game with friends and colleagues in the great green outdoors of Scotland. Nature is a true love and passion or Alexander Macgregor. </p>\n\n<p>Sports Awards</p>\n\n<p>Andrew Macgregor has won several awards and metals from all his great sportsman activities. He won the Mcbain and Mactavish cup for shinty. He also won a trial at Glasgow rangers football club. </p>\n\n<p>As a runner, he won various local Scottish marathons. The list goes on with a prize for the biggest fish caught. At Spean-Bridge, Macgregor won several prizes for clay pigeon </p>\n\n<p>Professional Awards </p>\n\n<p>Alexander Ross Macgregor won a local entrepreneur prize and as a result was featured in several Scottish newspapers. </p>","image":{"available_sizes":[[[150,146],"assets/images/resized/0021/9196/219196v2-max-150x150.jpg"],[[236,230],"assets/images/resized/0021/9196/219196v2-max-250x250.jpg"],[[236,230],"assets/images/resized/0021/9196/219196v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://rossmacgregor.net/","title":"Who Is Ross Macgregor?"},{"external_url":"http://www.rossmacgregor.org/","title":"Ross Macgregor - Wiki page"},{"external_url":"https://twitter.com/rossmacgregor5","title":"Ross Macgregor Twitter account"},{"external_url":"http://www.facebook.com/rossmacgregor4","title":"Ross Macgregor on Facebook"}],"web_presences":[]}