{"first_name":"roxyhandbag","last_name":"roxy","permalink":"roxyhandbag-roxy","crunchbase_url":"http://www.crunchbase.com/person/roxyhandbag-roxy","homepage_url":"http://www.roxyhandbag.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"http://www.roxyhandbag.com","born_year":1981,"born_month":5,"born_day":15,"tag_list":"roxy-bags, roxy-handbag, bags, online-shopping-mall, roxy, handbags, watches, wholesale-replica-handbags, wallets, handbag, shoes, jewelry, belt, bag, cross-body-bags-at-roxyhandbag-com","alias_list":null,"created_at":"Sun Nov 28 09:19:13 UTC 2010","updated_at":"Wed Dec 01 21:01:09 UTC 2010","overview":"<p>While designer handbags do not come cheap, it is the authenticity and glamour that matters. But there are some things that you want to be cautious of when shopping for designer handbags.</p>\n\n<p>There is no denying the fact that women love their designer handbags. It is an essential accessory that every woman includes in her wardrobe. While these handbags do not come cheap, it is the authenticity and glamour that matters. But there are some things that you want to be cautious of when shopping for designer handbags.</p>\n\n<ol>\n<li><p>Refer to the catalogue - If you are going to be purchasing a designer handbag at a retail store, make sure to refer to a catalogue prior to making any decisions. You want to make sure the model or style in the store truly does exist prior to wasting money. As sad as it is to say, there are some fake handbags that make their way into retail stores for a hefty price.</p></li>\n<li><p>Designer label - When it comes to a true designer handbag, there is a distinguishing mark of the designer label. Be cautious of the tags, care cards, and warranties that go with bags. The original bags usually only use embossed tags while replicas will be printed. This can be an easy way to decipher a fake from the real deal.</p></li>\n<li><p>Workmanship and materials - The main reason these bags are so expensive is because of the outstanding workmanship and marvelous materials that are put into them. Designer bags are efficiently made and very clean. There are no double stitches and the spacing between each stitch is consistent. Other features that decipher an original bag from a fake are a particular color of thread used by certain designers, the zipper has the name of the designer on it, and the straps are not made of extra materials.</p></li>\n<li><p>Serial number - As crazy as it may sound; designer handbags generally have the serial number of the bag. There are never the same serial numbers because the manufacturer usually has the original list with them. This too can be an easy way to determine whether or not you are purchasing a replica or a fake.</p></li>\n<li><p>Cost - The last thing you want to look at is the price of the handbag you are purchasing. Designer bags can run as high as $50,000 for some meaning you should expect to pay a lot for them. Chances are you are purchasing a fake if you find a bag for a couple of hundred dollars or less.</p></li>\n</ol>\n\n<p>When it comes to purchasing designer bags, there is nothing worse than falling for a fake or replica. Keeping your eyes open for the things listed above can help assure you that you purchase nothing but the real deal.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.roxyhandbag.com","title":"roxyhandbag"}],"web_presences":[{"external_url":"http://www.roxyhandbag.com","title":"roxyhandbag"}]}