{"first_name":"Roy","last_name":"Arad","permalink":"roy-arad-2","crunchbase_url":"http://www.crunchbase.com/person/roy-arad-2","homepage_url":"http://www.arocon-consulting.com","birthplace":"Haifa Israel","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Tigon Software","born_year":1979,"born_month":10,"born_day":10,"tag_list":"","alias_list":null,"created_at":"Wed Jun 20 14:35:31 UTC 2012","updated_at":"Fri Jun 22 17:35:50 UTC 2012","overview":"<p>The modern economy has been drastically reshaped by two main forces, technology and internationalization—two dynamics that Roy Arad knows intimately well.  A business development executive and entrepreneurial advisor, Arad is an expert at evaluating market opportunities and putting the plans, resources, and people together to capitalize on these windows of economic potential. Drawing upon dual degrees from New York Institute of Technology and Israel’s Ruppin Academy, he currently serves on the Board of Act for Israel with responsibility for leading the organization’s activities in the areas of Development and Investor Relations.</p>\n\n<p>Arad’s  corporate background began on the technical side, working as a Systems Administrator and Information Technology Manager for a key Computer Division of the Israeli Defense Force.  His leadership and communication skills, however, quickly drew him into the entrepreneurial world, where he co-founded Tigon Software in 2003 and helped grow the company. This entrepreneurial acumen is also the trademark of his current role as Director of Business Development for Arocon Consulting, where he helps international companies make the right connections to raise funding, gain a foothold in the U.S. market, and localize their products effectively for American consumers.</p>\n\n<p>In addition to the above roles, Arad was also honored with an appointment as Treasury Manager and Procurement Manager for the Government of Israel, where he spent four years overseeing billions of dollars in trade activity between the Israeli and U.S. governments.  In this capacity, he worked closely with senior U.S. government officials and Fortune 500 executives from companies such as Boeing, Dell, Lockheed Martin, and IBM, gaining an in-depth understanding of the federal contracting process and the way business is done on a global, government-to-government scale.  He also serves as an Advisory Board Member and Entrepreneur in Residence with New York Institute of Technology’s School of Business, where he mentors aspiring young entrepreneurs and plays a role in helping the school deliver cutting-edge business curriculum.</p>","image":null,"degrees":[{"degree_type":"B.S","subject":"Business Administration ","institution":"New York Institute of Technology ","graduated_year":2007,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Director of operations - NY","firm":{"name":"Pango","permalink":"pango","type_of_entity":"company","image":{"available_sizes":[[[150,83],"assets/images/resized/0019/1303/191303v2-max-150x150.jpg"],[[250,139],"assets/images/resized/0019/1303/191303v2-max-250x250.jpg"],[[450,251],"assets/images/resized/0019/1303/191303v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"VP Business Development ","firm":{"name":"Tigon Software","permalink":"tigon-software","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}