{"first_name":"Roy","last_name":"Baharav","permalink":"roy-baharav","crunchbase_url":"http://www.crunchbase.com/person/roy-baharav","homepage_url":"http://www.seambi.com","birthplace":"Israel","twitter_username":"RoyBaharav","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1976,"born_month":9,"born_day":25,"tag_list":"","alias_list":null,"created_at":"Thu Mar 01 23:59:04 UTC 2012","updated_at":"Tue Mar 06 19:35:04 UTC 2012","overview":"<p>Mr. Roy Baharav is the Co-Founder and CEO of SeamBI. Roy oversees SeamBI’s management team and overall business strategy at offices in the United States and Israel. After launching SeamBI in Israel with Guy Morgenstern and Dr. Miky Tamir in 2006, Roy moved the company’s headquarters to Los Angeles in 2008 to expand the business.</p>\n\n<p>Prior to SeamBI, Roy served seven years with the Electronics Research Department in the Israel Defense Forces (IDF) Intelligence Corps. He held a number of positions, starting as an Embedded Systems Engineer, where he was responsible for the development of advanced technology for mission-critical projects. He was soon promoted to the position of Team Leader, managing the development, field testing, installation and maintenance of high-tech communication systems. He later became a Branch Leader and managed four development and operational teams comprised of more than 40 hardware and software engineers. For his contribution as a Branch Leader, in 2004 Baharav was recognized as outstanding officer and was promoted to the rank of Major.</p>\n\n<p>Prior to his role in the IDF, Roy worked for the voice logger division of Nice Ltd.\n He holds a B.Sc. degree in Electrical Engineering and a Masters in Business Administration, both from Tel-Aviv University.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0017/6602/176602v2-max-150x150.jpg"],[[200,250],"assets/images/resized/0017/6602/176602v2-max-250x250.jpg"],[[360,450],"assets/images/resized/0017/6602/176602v2-max-450x450.jpg"]],"attribution":"<p>CEO</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}