{"first_name":"Ruchi","last_name":"Gupta","permalink":"ruchi-gupta-2","crunchbase_url":"http://www.crunchbase.com/person/ruchi-gupta-2","homepage_url":"http://digitalideaz.com","birthplace":"","twitter_username":"digital12","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1988,"born_month":1,"born_day":16,"tag_list":"best-web-designers-in-india, website-design-company-india","alias_list":"","created_at":"Tue Nov 20 05:59:37 UTC 2012","updated_at":"Thu Nov 22 05:04:00 UTC 2012","overview":"<p>Digital Ideaz first came into existence by the name Quasar Technologies by Ritesh Saxena (an Electronics Engineer).\nIt was the year 1998. Ritesh dropped his marketing job, which he did for two years in the web designing field and took a courageous decision of opening this sole proprietorship firm. It was rather a one-man-band. Right from marketing to technical to day to day work, Ritesh carried on alone with the confidence he had in himself.</p>\n\n<p>In the year 2007, the name of the firm was changed to Digital Ideaz and the location from Mumbai, to Chandigarh.\nThe business grew well and in 2010 the company got its Corporate Identity.\nFrom a one-man-band to a team of experts now, the company slowly and steadily started gaining popularity.</p>\n\n<p>Only static websites were designed with small amount of dynamic components in the initial years. Understanding the need of dynamic websites, Ritesh then underwent a course for making dynamic websites and started developing them.\nWith a few successful ventures, the company started getting projects from references given by the satisfied clients.</p>\n\n<p>Again understanding the power of Search Engine Optimization and a hard work for six continuous months on the same, Digital Ideaz started appearing in the most popular search engine results at the first page. Hence, more enquiries, more business. Never during this time or before also, Digital Ideaz compromised on the quality of the good work.</p>\n\n<p>Today, with the help of different departments established in the company Digital Ideaz Private Limited is converting the ideas and dreams of many people and companies into reality. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}