{"first_name":"Rudy","last_name":"Rodriguez","permalink":"rudy-rodriguez","crunchbase_url":"http://www.crunchbase.com/person/rudy-rodriguez","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Mar 22 12:09:06 UTC 2011","updated_at":"Tue Mar 22 12:13:56 UTC 2011","overview":"<p>Rudy Rodriguez is the Chief Scientific Officer of Advanced Animal Diagnostics. He has a Master&#8217;s Degree in Biomedical Engineering from George Washington University and holds the Professional Engineer (PE) certification. He has thirty years experience in development of diagnostic instrumentation, twenty-eight patents and is a four-time winner of the R &amp; D 100 Award as one of the 100 most significant new technical products of the year. He served as the Vice President of Research &amp; Development for Becton Dickinson&#8217;s Primary Care Diagnostics Division for fifteen years. Prior to that, he was an R &amp; D executive for Coulter (now Beckman-Coulter) and Baxter International diagnostic divisions. He was the Project Leader of the world&#8217;s most successful Physician Office Hematology (BD&#8217;s QBC and QBC Autoread ), and the Project Leader in the world&#8217;s most successful Veterinary Office Hematology System (marketed by Idexx as Autoread). He participated in the development of the NCCLS H20 Standard used for evaluation of automated leukocyte differential instruments. He is a co-inventor and was the BD Project Leader of the R &amp; D team that developed the base technology upon which AAD was founded. Rodriguez is also an adjunct professor at North Carolina State University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Scientific Officer","firm":{"name":"Advanced Animal Diagnostics","permalink":"advanced-animal-diagnostics","type_of_entity":"company","image":{"available_sizes":[[[115,70],"assets/images/resized/0012/6439/126439v1-max-150x150.png"],[[115,70],"assets/images/resized/0012/6439/126439v1-max-250x250.png"],[[115,70],"assets/images/resized/0012/6439/126439v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}