{"first_name":"Rupert","last_name":"Hurley","permalink":"rupert-hurley","crunchbase_url":"http://www.crunchbase.com/person/rupert-hurley","homepage_url":"http://www.digitalle.com","birthplace":"London","twitter_username":"digitallecom","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1971,"born_month":4,"born_day":29,"tag_list":"digital-content, cms, business-social-networks, white-label-social-networks, digital-asset-management, digitalle, paperlesse, socialle","alias_list":null,"created_at":"Sat Jul 31 10:51:02 UTC 2010","updated_at":"Mon Aug 02 20:01:26 UTC 2010","overview":"<p>Rupert Hurley is a seasoned business development professional and internet entrepreneur, with 20 years b2b sales and 10+ years direct e-commerce experience under his belt.</p>\n\n<p>In 2000, Rupert set up casevalue.com, one of the first on-line wine merchants in the UK. This expanded into a corporate on-line gift delivery business which served companies including American Express Centurion, Morgan Stanley and Disney to name but a few of their &#8220;blue chip&#8221; client base.</p>\n\n<p>In June 2010, Rupert followed a long held dream of starting a company specialising in delivering digital content to mobile devices and founded digitalle.com with Lance Keay, a veteran e-commerce platform developer, whom he had worked with on and off over the previous 10 years.</p>\n\n<p>Together, they are creating a &#8220;cloud based&#8221;, enterprise digital content management and delivery system which also incorporates social media and networking functionality to provide a 360 degree platform to publishers and content owners and creators. This will be provided via their Paperlesse and Socialle brands.</p>\n\n<p>His dream of being able to read the news in a hand held, &#8216;flexible&#8217; device, &#8220;&#8230;like a thin sheet of plastic but with video and content delivered wirelessly&#8230;&#8221;, is getting ever nearer, and he intends to be at the front of the queue in being a part of that revolution.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/digitallecom","title":""},{"external_url":"http://www.linkedin.com/profile?viewProfile=&key=34338940&trk=tab_pro","title":""}]}