{"first_name":"Rupert","last_name":"Schaefer","permalink":"rupert-schaefer","crunchbase_url":"http://www.crunchbase.com/person/rupert-schaefer","homepage_url":"http://www.result.com","birthplace":"Munich","twitter_username":"rupertrup","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1977,"born_month":5,"born_day":25,"tag_list":"dld, hubert-burda-media","alias_list":null,"created_at":"Thu Mar 25 09:18:15 UTC 2010","updated_at":"Thu Feb 02 22:15:05 UTC 2012","overview":"<p>Rupert Schäfer (born in 1977) has more than 10 years experience in the field of technology, internet, media, entrepreneurship, venture capital and conference design. Rupert lives and breathes the digital lifestyle.</p>\n\n<p>Currently Rupert Schaefer is co-founder of the digital strategy consultancy boutique The Nunatak Group and german partner of Result.com, an international firm with specialized on growth advisory, internationalization, internet strategy and M&amp;A consulting. Rupert has successfully completed various digital projects for both national and international clients, has founded several companies and is an active seed investor.</p>\n\n<p>Before he was producer of the DLD (Digital Life Design) conference from 2005-2010 -the most important tech and design conference in Europe. Besides DLD, he was senior project manager for digital innovation of DLD Media &amp; DLD Ventures - both companies of Hubert Burda Media, one of Europe´s largest and most innovative media corporations. His focus was on new media research and development, internet strategy and strategic investments. He was involved in the management of the investments Sevenload, Mydeco and Glam. </p>\n\n<p>Rupert is a frequent speaker, moderator, lecturer and start-up jury member in conferences and industry events some of which include, Munich Media Days (Germany), SIME (Sweden), DLD Conference (Germany), TWS Start-Up Competition (Israel), Startup2.0 (Spain), La Red Innova (Spain), MipTV (France) or the Globes Conference (Israel).</p>\n\n<p>Rupert studied international economics at the Munich Business School, the EBS London and the EBS Madrid. During his studies, he co-founded a Munich-based event agency and a local publishing company and was an editor at Germany’s first surf magazine, Tidemag. </p>\n\n<p>Personal note: Rupert is passionate about snowboarding, golf, scuba diving and climbing.</p>","image":{"available_sizes":[[[102,150],"assets/images/resized/0008/1716/81716v2-max-150x150.jpg"],[[171,250],"assets/images/resized/0008/1716/81716v2-max-250x250.jpg"],[[230,336],"assets/images/resized/0008/1716/81716v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.result.com","title":""},{"external_url":"http://www.nunatak.com/","title":""}]}