{"first_name":"Russell","last_name":"Rothstein","permalink":"russell-rothstein","crunchbase_url":"http://www.crunchbase.com/person/russell-rothstein","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon May 12 20:06:12 UTC 2008","updated_at":"Mon May 12 20:14:14 UTC 2008","overview":"<p>&#8220;Russell Rothstein is the President and Founder of Sales Spider. A business social network, Sales Spider was launched in March 2006. Rothstein brings his resourceful experience in business and software development, sales and marketing.</p>\n\n<p>Sales Spider is a business social network featuring $25 Billion worth of qualified sales leads, networking with thousands of business professionals, classified ads and online tradeshows to his users – for free. Within 12 months of Sales Spider’s launch, the site has attracted over 600,000 unique visitors and is growing by 100% a quarter.</p>\n\n<p>Sales Spider’s co-branding partners include Salesforce.com and Google. Google’s co-branding initiative involves the first and only social network site in North America where users get paid by Google to surf.</p>\n\n<p>Prior to the development of Sales Spider, Rothstein was the President and Founder of NorthPath, a Sales Outsourcing company offering lead generation and field sales outsourcing to leading technology companies.</p>\n\n<p>Previous to NorthPath, Rothstein served in numerous sales and application capacities for Oracle, and was awarded Highest Performing Territory Sales Representative in Canada for 1998. Before Oracle, Russell was the Managing Partner and Founder of Bizware, a software supply chain for retail petroleum and major convenience stores. He successfully built Bizware into the industry market leader before selling to a Nasdaq listed public company in 1995.</p>\n\n<p>Rothstein holds a Master of Business Administration degree from the University of Western Ontario and a First Class Honors Bachelor of Arts degree in Political Economics from McGill University in Montreal.&#8221; (Source: <a href=\"http://www.salespider.com/index.php?aboutus=1\" title=\"Sales Spider\" rel=\"nofollow\">Sales Spider</a>)</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Executive Officer & Director","firm":{"name":"Sales Spider","permalink":"sales-spider","type_of_entity":"company","image":{"available_sizes":[[[135,50],"assets/images/resized/0001/8401/18401v3-max-150x150.jpg"],[[135,50],"assets/images/resized/0001/8401/18401v3-max-250x250.jpg"],[[135,50],"assets/images/resized/0001/8401/18401v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}