{"first_name":"Russ","last_name":"Irwin","permalink":"russ-irwin","crunchbase_url":"http://www.crunchbase.com/person/russ-irwin","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 21 08:33:03 UTC 2008","updated_at":"Fri Nov 21 08:36:11 UTC 2008","overview":"<p>Russ focuses on investments in communications services, equipment and components.</p>\n\n<p>Before co-founding Convergence Partners Russ was Senior Vice President and General Manager of Multimedia Business Development at NEC USA where he established a business development organization and managed strategic investments in emerging multimedia markets. Previously, Russ was at Apple Computer in both line and corporate development roles. As Senior Manager of CPU Product Marketing he managed a group responsible for product marketing, product planning, configuration management and pricing for over $4 billion of Macintosh CPU sales. As Director of Corporate Development he developed the business case for licensing, private branding and OEM sales of the Macintosh and subsequently negotiated the licensing of the Macintosh to companies such as Olivetti, Power Computing and Radius/Umax. Prior to joining Apple, Russ was Director of Marketing at Plexus Computers, a pioneer in document image management and TCP/IP-based client-server computing. Early in his career Russ founded Pacific Innovations, where he developed and patented a field-of-vision device that was sold to Johnson &amp; Johnson, and later co-founded a UNIX office automation company.</p>\n\n<p>Russ earned his BS degree at the University of California at Berkeley</p>","image":{"available_sizes":[[[150,129],"assets/images/resized/0002/9118/29118v1-max-150x150.jpg"],[[162,140],"assets/images/resized/0002/9118/29118v1-max-250x250.jpg"],[[162,140],"assets/images/resized/0002/9118/29118v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder","firm":{"name":"Convergence Partners","permalink":"convergence-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,20],"assets/images/resized/0002/9116/29116v1-max-150x150.jpg"],[[250,34],"assets/images/resized/0002/9116/29116v1-max-250x250.jpg"],[[450,61],"assets/images/resized/0002/9116/29116v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}