{"first_name":"Russell","last_name":"Vernon","permalink":"russell-vernon","crunchbase_url":"http://www.crunchbase.com/person/russell-vernon","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Apr 07 12:58:03 UTC 2012","updated_at":"Sat Apr 07 12:59:59 UTC 2012","overview":"<p>Russell Vernon, a founder of the firm, is a member of General Partner and was formerly the President of Commerce Capital Markets, Inc. Prior to this he was Director of Operations at Barrett Associates, Inc., a New York based money management firm. Prior to co-founding BVM Capital with Ross Barrett, he served as the Director of Investment Operations at Warburg Pincus Asset Management. He has had a distinguished career in both the public and private sectors.\nPrior to joining co-founding VCE Capital with Ross Barrett, he served as the Director of Investment Operations at Warburg Pincus Asset Management. Prior to this, he served in a similar capacity at Chancellor Capital Management. In these roles he was directly responsible for building a state of the art infrastructure to support all client, business, product development and growth needs and served on numerous management and operating committees.\nHe has also served as a Senior Manager at Deloitte and Touche where his consulting practice focused on management, M and A, financial service and due diligence engagements and issues. Early on in his career, he was a Vice President of Citibank, NA.\nIn the public sector, Russ served as a full Colonel in the National Guard until 2005. He has served in numerous positions including Company Commander, Battalion Operations Officer, Commander of the 1st Battalion 69th Infantry &#8220;The Fighting 69th&#8221;, the Inspector General of the 42nd Infantry Division and as Military Liaison to the New York State Department of Governmental Affairs. He currently commands the New York State ARFOR Command.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0018/3113/183113v1-max-150x150.jpg"],[[130,194],"assets/images/resized/0018/3113/183113v1-max-250x250.jpg"],[[130,194],"assets/images/resized/0018/3113/183113v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"BVM Capital","permalink":"bvm-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,114],"assets/images/resized/0018/3110/183110v1-max-150x150.jpg"],[[192,146],"assets/images/resized/0018/3110/183110v1-max-250x250.jpg"],[[192,146],"assets/images/resized/0018/3110/183110v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}