{"first_name":"Ruth Ann","last_name":"Box","permalink":"ruth-ann-box","crunchbase_url":"http://www.crunchbase.com/person/ruth-ann-box","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1950,"born_month":3,"born_day":3,"tag_list":"","alias_list":null,"created_at":"Tue Jul 17 08:36:32 UTC 2012","updated_at":"Wed Jul 18 00:00:36 UTC 2012","overview":"<p>Ruth Ann Box’s life is far from ordinary. Throughout her life, she&#8217;s had a wide variety of roles: journalist, lawyer and businesswoman. Today, she spends time taking care of her family while pursuing a variety of other interests.</p>\n\n<p>Early Journalism Career</p>\n\n<p>She embarked on a rewarding career in journalism as early as high school. She served as the editorial editor of the Thomas Edison High School newspaper in Tulsa, Oklahoma. When she graduated in 1972, she accepted a journalism scholarship at the University of Oklahoma. She wrote for the University of Oklahoma Daily and also worked in the printing department. She became the youngest person to be named major staff writer during her sophomore year.</p>\n\n<p>She gained valuable experience writing for the Associated Press throughout her college career. When she graduated in 1977, she was offered a permanent position. However, she chose to join the Daily Oklahoman/Oklahoma City Times instead. During her tenure, she covered a variety of news stories. Her most famous story involved in the trial of Karen Silkwood.</p>\n\n<p>Later Careers</p>\n\n<p>As much as she enjoyed her career, the journalist decided it was time for a change. She enrolled in the OU College of Law and earned her law degree in 1982. After she graduated, she practiced real estate law at the law firm of Hastie and Kirschner. Later on, she became the Associate Vice President of American Fidelity Assurance Company. The professional was the first female officer to work within the company.</p>\n\n<p>Well-Traveled</p>\n\n<p>The versatile professional discovered a love for traveling via cruise. At first, she thought it was just a fancy way to travel. However, she decided to give it a shot. She took herself and her then-15-year-old son Allen on an affordable cruise to the Caribbean. As it turned out, she fell in love with the idea of cruising to different destinations.</p>\n\n<p>Aside from going on seafaring voyages, she also enjoys traveling to other destinations. Many of these destinations include:</p>\n\n<p>• The homes of famous figures Ernest Hemingway and Tennessee Williams.\n• The ancient and intriguing Mayan ruins.\n• The Vanderbilt family’s summer cottage.</p>\n\n<p>She&#8217;s also had the opportunity to enjoy a variety of travel-related activities. These include dog sled racing, which she was reluctant to try out at first. Fortunately, she found out the dogs absolutely loved it. Ruth Ann Box also wants to discover native artifacts from the Indians and Tlingits.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/1403/201403v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/1403/201403v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/1403/201403v2-max-450x450.png"]],"attribution":"<p>About Ruth Ann Box</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}