{"first_name":"Ruti","last_name":"Alon","permalink":"ruti-alon","crunchbase_url":"http://www.crunchbase.com/person/ruti-alon","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Pitango Venture Capital","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Sep 08 16:30:12 UTC 2011","updated_at":"Sun Sep 25 05:43:26 UTC 2011","overview":"<p>Ruti Alon joined Pitango in 1997. With over 25 years of international experience in the high-tech medical industry and heads the life sciences activities at Pitango. </p>\n\n<p>Ruti previously worked on Wall Street where she held senior positions with Montgomery Securities and Kidder Peabody &amp; Co. As a senior medical device analyst and was rated as one of the top in her field for four consecutive years.\nShe also managed her own independent consulting business in San Francisco, providing broad-based services to early-stage companies and venture capitalists in the medical devices industry. </p>\n\n<p>Ruti is the force behind the establishment in 2005 of ILSI, Israel Life Science Industry, a non-for-profit organization representing the mutual goals of approximately 700 Israeli life science companies. Ruti is the current Chairperson of ILSI. </p>\n\n<p>Ruti has a B.A. in Economics from the Hebrew University of Jerusalem, an M.B.A. from Boston University, and an M.S. from the Columbia University School of Physicians and Surgeons. </p>\n\n<p>Ruti previously served on the Boards of ColBar, acquired by Johnson&amp; Johnson, Disc-O-Techacquired by Kyphon and Ventor acquired by Medtronic (NYSE: MDT)\nShe is currently is the Chairperson of the Boards of BioControl, BrainsGate and TransPharma Medical. In addition, she is a member of the Boards of numerous Pitango portfolio companies including, BetaO2, HealOr and Vascular Biogenics (VBL).</p>","image":{"available_sizes":[[[150,131],"assets/images/resized/0015/3455/153455v2-max-150x150.jpg"],[[205,180],"assets/images/resized/0015/3455/153455v2-max-250x250.jpg"],[[205,180],"assets/images/resized/0015/3455/153455v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Pitango Venture Capital","permalink":"pitango-venture-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,53],"assets/images/resized/0001/8978/18978v1-max-150x150.png"],[[206,73],"assets/images/resized/0001/8978/18978v1-max-250x250.png"],[[206,73],"assets/images/resized/0001/8978/18978v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}