{"first_name":"Ryan","last_name":"Silverthorn","permalink":"ryan-silverthorn-2","crunchbase_url":"http://www.crunchbase.com/person/ryan-silverthorn-2","homepage_url":"http://www.silverthornnetworks.com","birthplace":"Troy, Michigan, USA","twitter_username":null,"blog_url":"http://www.ryansilverthorn.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1993,"born_month":1,"born_day":8,"tag_list":"","alias_list":null,"created_at":"Thu Dec 25 16:37:45 UTC 2008","updated_at":"Thu Oct 21 13:34:22 UTC 2010","overview":"<p>While most high school students work as baggers, busers, and ice cream scoopers for a little over minimum wage, Ryan Silverthorn, sophomore, is the CEO of his own company, Silverthorn Networks, Inc.</p>\n\n<p>How does a 16 year old end up making $78,000 a year?</p>\n\n<p>&#8220;It all started with $500 and an idea,&#8221; Silverthorn said.</p>\n\n<p>After building a website for a club, Silverthorn decided to make some for himself. He searched ‘building websites’ and eventually came across webhosting. Webhosting is a business that provides the software, servers, and support to create and maintain a website. Twenty websites later, Silverthorn decided to try out the webhosting business.</p>\n\n<p>In Feb. 2006, Silverthorn created GARA Web hosting, a reseller for Snappy Communications. A reseller uses the servers and support of the company it is selling for and only makes a profit in the price difference between the wholesale price the company sets and retail price that the reseller sets. Resellers are basically used as a means of advertising for the companies that employ them.</p>\n\n<p>&#8220;To get started I pulled $500 out of my bank account to buy software and purchased ad space on Google, Facebook, and Yahoo,&#8221; Silverthorn said. &#8220;After a month or two [the sales] started coming.&#8221;</p>\n\n<p>Early on in Silverthorn&#8217;s freshmen year, he decided that he wanted to make more than the 10 percent he was making off domain sales and the 35 percent he was making off hosting sales while being a reseller. With the profits from his company, Silverthorn bought Dell Outlet servers online about every three months until he had 15 of them.</p>\n\n<p>&#8220;I said &#8216;I can’t take it anymore,&#8217; so I bought a C-Panel which is software that runs hosting, and I bought servers from the Dell Outlet,&#8221; Silverthorn said. &#8220;Now I could resell the plans without having to pay [Snappy Communications].&#8221;\nSilverthorn’s 15 servers are co-located at a Liquidweb building in Lansing, MI. Co-location is when rack space is rented out for the servers that are necessary for the webhosting business.</p>\n\n<p>&#8220;When the Dell servers were shipped in from Texas, I went to Liquidweb in Lansing and put the servers there because I wanted specific settings set up,&#8221; Silverthorn said. &#8220;I am also renting servers in Freemont, CA and Birkshire, London in the United Kingdom.&#8221;</p>","image":{"available_sizes":[[[101,150],"assets/images/resized/0003/2445/32445v4-max-150x150.png"],[[168,250],"assets/images/resized/0003/2445/32445v4-max-250x250.png"],[[303,450],"assets/images/resized/0003/2445/32445v4-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.ryansilverthorn.com","title":"Ryan Silverthorn's Blog"},{"external_url":"http://www.silverthornnetworks.com","title":"Silverthorn Networks"},{"external_url":"http://www.garawebhosting.com","title":"GARA Web Hosting"}],"web_presences":[{"external_url":"http://www.facebook.com","title":"Facebook"},{"external_url":"http://www.linkedin.com","title":"LinkedIn"}]}