{"first_name":"Ryan","last_name":"Douthit","permalink":"ryan-douthit","crunchbase_url":"http://www.crunchbase.com/person/ryan-douthit","homepage_url":"http://www.facebook.com/douthit","birthplace":"San Juan Island, Wash.","twitter_username":"rdouthit","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1972,"born_month":8,"born_day":30,"tag_list":"motorsports, video, distribution, magazine, publishing, production","alias_list":null,"created_at":"Wed Jan 13 00:53:51 UTC 2010","updated_at":"Thu Jan 14 00:08:05 UTC 2010","overview":"<p>Ryan Douthit is the founder of Driving Sports TV, an online premium content video network for automotive enthusiasts. </p>\n\n<p>Following a turbulent dot-com career, Douthit&#8217;s professional commitment to media started in 2000, when he was hired to replace an outgoing publisher at Computer Source, a Seattle-area free consumer publication. Following that, Douthit founded Driving Sports in 2004 as a nationally circulated newsstand magazine. It didn&#8217;t find consumer success as a print publication until the title was re-launched as Subiesport, an all-Subaru enthusiast magazine that enjoyed worldwide circulation and record newsstand performance. </p>\n\n<p>Even considering his successes in traditional publishing, Douthit voiced publicly that the days of print magazine profitability were numbered. The publishing market crash hastened that decline. In 2009, Subiesport Magazine was sold to Grassroots Motorsports magazine and Douthit returned his primary focus to Driving Sports, which had continued to be used as a digital media lab (developing a broadcast television show of the same name, DVDs, enthusiast events, and of course live and on-demand streaming media services) even during the print publishing years.</p>\n\n<p>Today, Douthit is building Driving Sports into what he calls the &#8220;automotive network of a new generation.&#8221; His focus is on creating and acquiring high-content editorial assets and distributing them to wherever and however consumers want to engage with them.  </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0007/3086/73086v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0007/3086/73086v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0007/3086/73086v2-max-450x450.jpg"]],"attribution":"<p>Yujiro Otsuki</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/rdouthit","title":""},{"external_url":"http://www.linkedin.com/in/rdouthit","title":""},{"external_url":"http://www.facebook.com/douthit","title":""}]}