{"first_name":"Ryan","last_name":"Cox","permalink":"ryan-cox-2","crunchbase_url":"http://www.crunchbase.com/person/ryan-cox-2","homepage_url":"http://theryancox.com","birthplace":"Indianapolis","twitter_username":"Coxymoney","blog_url":"http://www.pamil-vision.net","blog_feed_url":"http://feeds.feedburner.com/EverythingPR","affiliation_name":"Stats Squared","born_year":1983,"born_month":11,"born_day":3,"tag_list":"stats-squared, argophilia, pamil-vision, schindigs, ninja-button, social-communications, digital-marketing, social-media, seo, mobile","alias_list":null,"created_at":"Mon Nov 29 16:10:28 UTC 2010","updated_at":"Mon Feb 28 06:21:21 UTC 2011","overview":"<p>Ryan is a serial entrepreneur.</p>\n\n<p>After leaving school Ryan got into real estate as a way to attempt to self-fund his entrepreneurial desires.  He was involved in residential real estate to become corporate real estate within the first year, lasting for four weeks, before he saw a huge pain in real estate.  Thus his first start-up was born, iEnfluence, a social CRM tool for the real estate industry.  He left the project he founded after a year and moved on to his second start-up Schindigs.  He has made a living on business consulting in social media, social communications, digital marketing and online marketing since 2006.  </p>\n\n<p>Recognized for his social media consulting, Ryan has made a name for himself as having a strong understanding of social media strategies and best practices.  Ryan has carried a strong understanding of SEO/SEM, and currently works for Deep Ripples (http://www.deepripples.com) in Indianapolis as a SEO consultant.  He also contributes full-time writing to the Pamil Vision PR blog EverythingPR (http://www.pamil-visions.net), a leading PR blog across the world.  Ryan is fascinated with social communications, and how social technologies effect the &#8220;normal consumer.&#8221;  His passions all involve incorporating the social graph into real-case products that fix a problem or need for that &#8220;normal consumer.&#8221;  </p>\n\n<p>Ryan believes, (along with the majority of the rest of tech), that mobile is the next big play on all fronts.  Incorporating mobile into your marketing and engagement strategies &#8211; as well as creating products that serve and focus on the mobile web and mobile consumers first and foremost.  </p>\n\n<p>Currently he has seven start-up projects he is either the founder/co-founder or part of the founding team of:</p>\n\n<p>Stats Squared\nFounder\nhttp://www.statssquared.com\nAnalytics tool for tracking link maturation, click-through rate and the money-making metrics across your entire link profile online.  What you share, and how effective it is to your bottom line.</p>\n\n<p>Argophilia\nFounding Team\nhttp://www.argophilia.com/news\nTurning travel planning into a fun and social activity.  Have fun discovering some of the best attractions, restaurants and hotels around the world, collect places you find interesting in your own guide and share it with family and friends.</p>\n\n<p>Schindigs\nFounder\nhttp://www.schindigs.com\nYour social calendar is the calendar that matters.  Schindigs aims to be the mobile tool that becomes your social calendar assistant.  You are a personal brand, this is the tool that allows you to attach it to your social events.</p>\n\n<p>Ninja Button\nFounding Team\nhttp://www.ninjabutton.com\nThe only split testing software built specifically for website buttons.  Create, test and optimize your call-to-action buttons to convert more on-site visitors into paying customers.</p>\n\n<p>Tag2Do\nFounder\nhttp://www.tag2do.com</p>\n\n<p>AppDar\nBusiness Development\nhttp://www.appdar.com\nA mobile applications company.  We build mobile apps:  iPhone, Andriod, Blackberry &#8211; with a heavy focus on the iOS platform.  </p>\n\n<p>Talentopoly\nMarketing\nhttp://www.talentopoly.com\nA invite-only network for programmers, designers and IT professionals that is where talented people go to share their best links.  Without the clutter of normal social sharing or social networks, the cream rises to the top on Talentopoly.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Stats Squared","permalink":"stats-squared","type_of_entity":"company","image":null}},{"is_past":false,"title":"Founder","firm":{"name":"Schindigs","permalink":"schindigs","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.statssquared.com","title":"Stats Squared"},{"external_url":"http://www.argophilia.com/news","title":"Argophilia News"},{"external_url":"http://www.schindigs.com","title":"Schindigs"},{"external_url":"http://www.deepripples.com","title":"Deep Ripples"},{"external_url":"http://pamil-visions.net","title":"EverythingPR"},{"external_url":"http://www.ninjabutton.com","title":"Ninja Button"}],"web_presences":[{"external_url":"http://www.twitter.com/coxymoney","title":"Twitter"},{"external_url":"http://www.facebook.com/ryanleecox","title":"Facebook"},{"external_url":"http://www.linkedin.com/in/ryanleecox","title":"LinkedIn"},{"external_url":"http://www.flickr.com/photos/coxymoney","title":"Flickr"}]}