{"first_name":"Ryan","last_name":"Litfin","permalink":"ryan-litfin","crunchbase_url":"http://www.crunchbase.com/person/ryan-litfin","homepage_url":"http://www.vincentassetmanagement.com","birthplace":"Minnesota","twitter_username":"vincentassetman","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Aug 21 20:04:45 UTC 2012","updated_at":"Thu Aug 23 18:12:11 UTC 2012","overview":"<p>Vincent Asset Management (VAM) was born out of our passion for the diverse global financial markets, and our desire to make a positive impact in the world. Our mission goes beyond giving our clients the certainty to be able to act decisively as it pertains to making informed and intelligent investment decisions; our vision includes a growing international family of clients and “partners” who together make a lasting contribution to wisdom, prosperity and the global financial markets as a whole.</p>\n\n<p>Regardless of one’s culture or place in society, we all live in a world of contrast; there are opportunities, as well as challenges. Perhaps the universal unstated goal in life is to experience more of the former while attempting to avoid, yet ultimately having to face and manage, life’s challenges. The same can be said of the global financial markets.</p>\n\n<p>Very specifically, VAM specializes in modern-day asset management. We believe the basic approaches to financial planning are archaic and obsolete. We recognized a huge void in the marketplace, which was significantly impeding investors from achieving proper diversification among uncorrelated asset classes, and ultimately decided we needed to be the change we wished to see in the world. </p>\n\n<p>Allow us to prove our dedication to you and to our Company mission.</p>\n\n<p>VAM is a registered alternative investment management firm specializing in managed futures and other investment programs that are uncorrelated to the stock market and economy. </p>","image":{"available_sizes":[[[150,41],"assets/images/resized/0020/7305/207305v2-max-150x150.jpg"],[[250,69],"assets/images/resized/0020/7305/207305v2-max-250x250.jpg"],[[450,124],"assets/images/resized/0020/7305/207305v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}