{"first_name":"Ryan","last_name":"Wells","permalink":"ryan-wells","crunchbase_url":"http://www.crunchbase.com/person/ryan-wells","homepage_url":"","birthplace":"Bay Area, CA","twitter_username":"AcclaroWM","blog_url":"","blog_feed_url":"","affiliation_name":"Acclaro Wealth Management","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Oct 08 16:54:09 UTC 2010","updated_at":"Fri Oct 08 18:24:21 UTC 2010","overview":"<p>Ryan Wells is a prinicpal and chief financial planner at Acclaro Wealth Management. </p>\n\n<p>He is passionate about the financial planning profession and the difference that financial life planning can make in people’s lives. Ryan’s belief is that there is more to investment management and financial planning than just the numbers. His background and experience enable him to effectively design objective financial strategies, customized to each client&#8217;s particular circumstances. More importantly, he has the unique ability to communicate these sophisticated concepts in a thoughtful, caring, and easily understood manner.</p>\n\n<p>For close to a decade Ryan has worked in the financial services industry. Prior to founding Acclaro Wealth Management, he was president and owner of Wells Financial Group, a boutique financial planning firm located in Walnut Creek, CA. He was a financial planner with Mass Mutual Financial Group, for five years prior. Ryan has extensive experience in retirement issues, asset allocation, investment selection, investment management, education planning, estate planning coordination, and asset protection strategies.  </p>\n\n<p>He has been quoted in such publications as Financial Advisor, Financial Planning and Medical Economics on a variety of topics including retirement planning and real estate investments using qualified dollars. Ryan is also a current member of the Financial Planning Association (FPA) and an active National Association of Personal Financial Advisors (NAPFA)-Registered Financial Advisor.</p>\n\n<p>Acclaro Wealth Management is a 5-star rated advisor with the Paladin Registry of Advisors, an independent and objective rating service of independent advisors. Paladin conducts advisor background checks, advisor quality ratings, and online documentation for advisor credentials, ethics, and business practices. Less than 7% of Paladin rated advisors are 5-star. Their rating process is listed on their website: 5 star rating process.</p>\n\n<p>Since 1983 Ryan has lived in the East Bay of San Francisco. He is married to his beautiful wife, Jessica and is very involved in the community through volunteer work with a number of charitable organizations. Ryan is an avid world traveler, lover of nature and animals. He also enjoys spending as much time as possible with family and friends and laughing every chance he gets.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Principal","firm":{"name":"Acclaro Wealth Management","permalink":"acclaro-wealth-management","type_of_entity":"financial_org","image":{"available_sizes":[[[150,28],"assets/images/resized/0010/4607/104607v2-max-150x150.png"],[[250,47],"assets/images/resized/0010/4607/104607v2-max-250x250.png"],[[450,85],"assets/images/resized/0010/4607/104607v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/profile/view?id=22918140&locale=en_US&trk=tab_pro","title":"LinkedIn"}]}