{"first_name":"Ryan","last_name":"Feit","permalink":"ryan-feit","crunchbase_url":"http://www.crunchbase.com/person/ryan-feit","homepage_url":"","birthplace":"","twitter_username":"ryanfeit","blog_url":"","blog_feed_url":"","affiliation_name":"SeedInvest","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 05 21:47:09 UTC 2012","updated_at":"Tue Aug 28 11:30:08 UTC 2012","overview":"<p>Ryan is the CEO and co-founder of SeedInvest, a revolutionary funding platform for startups and small businesses.  Prior to the passage of the JOBS Act, Ryan supported The Startup Exemption, the nonprofit responsible for bringing the concept of Equity Crowdfunding to Washington, DC.  </p>\n\n<p>Ryan co-founded the Crowdfunding Professional Association and currently serves as an Executive Board Member and the Co-chair of the Education and Training Committee.  Ryan also serves as a Leader of the Crowdfund Intermediary Regulatory Advocates group, which is working with the SEC and FINRA to write the crowdfunding portion of the JOBS Act into law.  </p>\n\n<p>Prior to founding SeedInvest, Ryan worked at Carlson Capital, a $7 billion multi-strategy hedge fund, where he evaluated and recommended public equity investments.  Prior to Carlson, Ryan worked as a Senior Associate at Wellspring Capital Management, a private equity fund with $3 billion under management, where he led small deal teams in conducting detailed due diligence, structured deals, raised hundreds of millions in financing and managed an array of portfolio companies.  Prior to that, Ryan was an Investment Banking Analyst at Lehman Brothers where he structured and executed financings to support leveraged buyouts, refinancings, recapitalizations and acquisitions.  </p>\n\n<p>Ryan received an MBA in Entrepreneurial Management from The Wharton School of the University of Pennsylvania and a BBA in Finance and Accounting from the University of Wisconsin-Madison.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO & Co-founder","firm":{"name":"SeedInvest","permalink":"seedinvest","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0019/4087/194087v5-max-150x150.png"],[[250,57],"assets/images/resized/0019/4087/194087v5-max-250x250.png"],[[450,103],"assets/images/resized/0019/4087/194087v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}