{"first_name":"Ryan","last_name":"Totka","permalink":"ryan-totka","crunchbase_url":"http://www.crunchbase.com/person/ryan-totka","homepage_url":"http://www.RyanTotka.com","birthplace":"Edison, NJ ","twitter_username":"RyanTotka","blog_url":"","blog_feed_url":"","affiliation_name":"AthletePromotions.com","born_year":1977,"born_month":12,"born_day":30,"tag_list":"","alias_list":null,"created_at":"Tue Oct 19 17:29:50 UTC 2010","updated_at":"Sat Oct 23 02:10:30 UTC 2010","overview":"<p>Co-Founder of RedCarpetMonday®, TornadoPromotions.com, EliteJets and AthletePromotions, Ryan was born in Edison, New Jersey on December 30, 1977. Ryan graduated from the University of Central Florida in 1999 with a degree in Business Administration and a minor in Marketing. He was named the winner of the 2003 University of Central Florida Rising Star Award for the College of Business and nominated for top 40 under 40 in the Orlando Business Journal. Ryan currently lives in fast growing downtown Orlando, Florida and has started four successful companies over the past ten years. In his spare time, Ryan constantly looks for ways to change the world and has worked and help support many charities and foundations including: The National MS Society, the Children’s Home Society, the Make a Wish Foundation, Vince Carter&#8217;s Embassy of Hope and the UCF Foundation.</p>\n\n<p>Ryan’s entrepreneurial roots started very young in New Jersey. To earn some extra cash as a kid, he shoveled snow in the winters, raked leaves in the fall and sang Christmas carols door-to-door during the holidays. Being actively involved in sports all his life, he had dreams of pursuing a career in baseball, which fell through due to a knee injury. At Spruce Creek High School, he was also among the top wide receivers in Central Florida. Ryan also earned an I.F.P.A. Certified Personal Trainer degree and has been always believed in the positive effects of having sports and fitness in your life.</p>\n\n<p>In 1998, while attending the University of Central Florida, he started CollegeInvestors.com, a site teaching college students about investing, offering career advice, a section for students to post their resumes and other fun college stuff. The site was voted to the Top 100 sites for college students by U Magazine. He was hired as the &#8220;Webmaster&#8221; for StockDr.com, Inc., an Orlando-based money management company and nationally syndicated investment radio show, where he worked for three years. This is when he decided to take the next step into entrepreneurial freedom. Since then, Ryan has started four successful Internet companies. Totka.com Website Services, a website development company and TornadoPromotions.com, Inc., an Internet marketing consulting firm based out of Orlando, Florida. His company has helped hundreds of corporations with search engine optimization, website development, domain name registration, website hosting, and achieving maximum success on the web. He has implemented successful marketing strategies for many well known companies such as American Express, Overture, EliteJets, Insurance.com, PriceLine.com, LowerMyBills.com and more.</p>\n\n<p>Another company Ryan co-founded in May of 2006 was EliteJets, which provides corporate executives, celebrities and luxury travelers private jet charter services to destinations all across the globe. Other web ventures include TornadoEntertainment.com, a site promoting top athletes such as Lebron James, Torry Holt, Daunte Culpepper, Carmelo Anthony and many other top athletes and entertainers. They have also co-founded MusicFreedom.com with JC Chasez of *NSYNC, a popular music site promoting unsigned musical talent. Real estate has been another passion for Ryan. He has started two real estate information sites, Orlando-Developments.com, a site featuring luxury communities in the Orlando area and CondoBoom.net, which displays the latest preconstruction, new and condo conversions throughout the state of Florida.</p>\n\n<p>While understanding that networking is the key to any successful business, in May of 2006, Ryan created RedCarpetMonday®, an exclusive Invitation-Only business network for Central Florida&#8217;s top business owners, professionals, senior level executives and entrepreneurs. The live events are designed for professionals to relax, socialize and share business ideas. The website is a networking community for members to interact and build business relationships. All the event details, dates, times and locations are at RedCarpetMonday.com.</p>\n\n<p>As years went by, he found his true passion in combining sports, business and the Internet. Being involved in sports all his life as a fan and a player, he has a vast knowledge of the marketing and business of sports, looking for the most creative ways to promote and book athletes for appearances. He founded AthletePromotions, one of the top athlete booking / sports marketing agencies in the country, specializing in booking sports celebrities for corporate appearances, speaking engagements, endorsements and more.</p>\n\n<p>Along the way, he&#8217;s worked with many world class sports celebrities, such as Wayne Gretzky, Tim Tebow, Nick Anderson, Thurman Thomas, Mike Ditka, Joe Theismann, William &#8216;The Fridge&#8217; Perry, Spud Webb, Zack Greinke, Steve Garvey, Torry Holt, Lebron James, Mark Cuban and more. Being a loyal UCF supporter, in the fall of 2007, Ryan created KevinSmithforHeisman.com, a site helping UCF running back Kevin Smith get nationwide Heisman respect.</p>\n\n<p>With a strong passion for baseball, one day Ryan would like to own a minor league baseball team and implement sports marketing tactics, like his Billionaire idol Mark Cuban founder of Broadcast.com, owner of the Dallas Mavericks and HDNet. When it&#8217;s all said and done, Ryan would like to be known as one of the most influential faces in the sports marketing industry.</p>\n\n<p>His other hobbies include traveling to NYC, Chicago and Las Vegas, riding the Vespa, hopping curbs in the Hummer, eating sushi, playing fantasy football, flag football, golf, tennis, biking and coming up with new business ideas. Ryan actively follows the business ideas of Internet billionaire Mark Cuban, and enjoys listening to the music of John Mayer, Jason Mraz, Robin Thicke, Jason Derulo and Michael Buble.</p>","image":{"available_sizes":[[[119,150],"assets/images/resized/0010/6277/106277v2-max-150x150.jpg"],[[199,250],"assets/images/resized/0010/6277/106277v2-max-250x250.jpg"],[[358,450],"assets/images/resized/0010/6277/106277v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"TornadoPromotions.com","permalink":"tornadopromotions-com","type_of_entity":"company","image":null}},{"is_past":false,"title":"Founder","firm":{"name":"AthletePromotions.com","permalink":"athletepromotions-com","type_of_entity":"company","image":{"available_sizes":[[[150,49],"assets/images/resized/0010/8843/108843v1-max-150x150.jpg"],[[250,82],"assets/images/resized/0010/8843/108843v1-max-250x250.jpg"],[[282,93],"assets/images/resized/0010/8843/108843v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Founder","firm":{"name":"RedCarpetMonday.com","permalink":"redcarpetmonday-com","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.Twitter.com/RyanTotka","title":"Twitter"},{"external_url":"http://www.Facebook.com/RyanTotka","title":"Facebook"},{"external_url":"http://www.linkedin.com/in/RyanTotka","title":"LinkedIn"}]}