{"first_name":"Ryan","last_name":"Mayer","permalink":"ryan-mayer","crunchbase_url":"http://www.crunchbase.com/person/ryan-mayer","homepage_url":"http://ryanmayer.ca","birthplace":"St. Catherine's, Ontario","twitter_username":"bluehaus","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1975,"born_month":1,"born_day":27,"tag_list":"designer, art-director, creative-director, marketing, advertising, creative-imaging, photography, web-design","alias_list":null,"created_at":"Tue May 25 15:33:03 UTC 2010","updated_at":"Sat May 29 00:20:08 UTC 2010","overview":"<p>Based in Edmonton, Alberta, Canada, Ryan Mayer is an artist and professional designer, who combines a talent for big ideas with a passion for small details. Ryan has passionate opinions about all things creative and finds himself at home somewhere between art and technology.</p>\n\n<p>Working across a wide range of disciplines, from identity and branding to print media and web design, Ryan believes that an initial inspired idea is key to creating design solutions that work.</p>\n\n<p>A highly creative thinker, he spreads his time between working with clients and building his own creative projects. Sometimes, there is little separation between the two. He enjoys working with ideas and breathing life into the intangible.\nSpecialties</p>\n\n<p>Ability to creatively and strategically design for cross platform compatibility, web application and content development, and development experience using interactive online tools. Also, corporate package design which includes stationary package and identity design. taking a campaign from start to finish working in big format as well, billboards, banners, displays, annual reports, proposals, magazines as well as brochures.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/bluehaus","title":"Twitter"},{"external_url":"http://linkedin.com/http://ca.linkedin.com/in/ryandmayer","title":"LinkedIn"},{"external_url":"http://bluehaus.com","title":"bluehaus communications"},{"external_url":"http://bluehaus.com/playground.htm","title":"bluehaus playground"},{"external_url":"http://behance.net/bluehaus","title":"Behance"},{"external_url":"http://logopond.com/members/profile/showcase/1443","title":"LogoPond"},{"external_url":"http://google.com/profiles/bluehaus","title":"Google Profile"}]}