{"first_name":"Ryan","last_name":"Magnussen","permalink":"ryan-magnussen","crunchbase_url":"http://www.crunchbase.com/person/ryan-magnussen","homepage_url":"http://www.grailproject.com","birthplace":"Palo Alto, CA","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Ripe Digital Media","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Mar 27 21:08:34 UTC 2012","updated_at":"Wed Mar 28 00:25:16 UTC 2012","overview":"<p>Ryan Magnussen is a leading entrepreneur in digital media, technology and advertising. Magnussen has worked with some of the best brands and largest media companies in developing their internet platforms, technology and digital marketing strategies.</p>\n\n<p>In 1995 he founded Zentropy Partners, which grew to become the fifth-largest interactive advertising agency in the United States with annual revenues of over $80 million. Zentropy developed online platforms and strategies for such entertainment companies as Fox, MGM, Paramount, Warner Bros., Polygram, Universal Music and Virgin Records, while also leading e-commerce and interactive advertising for other major corporate clients such as Microsoft, GM, Coca-Cola, Reebok and Procter &amp; Gamble. By the time Magnussen sold Zentropy to Interpublic in 1999, the company had ten offices operating in six countries.</p>\n\n<p>In 2003, Magnussen founded Ripe Digital and raised over $50 million from Time Warner and Hearst to build short-form, on-demand TV channels that were distributed simultaneously over the Internet, cable VOD and mobile devices. By 2006, Ripe Digital had amassed one of the largest short form content libraries in the world and was broadcasting three networks to over 100 million screens which included 44 million cable homes via Comcast and Time Warner. Ripe Digital&#8217;s networks were some of the most popular independent VOD channels with hundreds of millions of views.</p>\n\n<p>Magnussen is currently the founder &amp; CEO of the Grail Project, a collective effort to redefine the way digital content is distributed, discovered and consumed.</p>","image":{"available_sizes":[[[106,150],"assets/images/resized/0018/1396/181396v2-max-150x150.png"],[[144,202],"assets/images/resized/0018/1396/181396v2-max-250x250.png"],[[144,202],"assets/images/resized/0018/1396/181396v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Ripe Digital Media","permalink":"ripe-digital-media","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://en.wikipedia.org/wiki/Ryan_Magnussen","title":"Wikipedia"}],"web_presences":[]}