{"first_name":"S. A.","last_name":"Abbas","permalink":"s-a-abbas","crunchbase_url":"http://www.crunchbase.com/person/s-a-abbas","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Apr 25 10:39:49 UTC 2012","updated_at":"Fri May 04 03:56:53 UTC 2012","overview":"<p>Alika Studio, New Delhi </p>\n\n<p>With an indepth understanding of Art Alika Studios we know that every customer has a unique set of parameters. That&#8217;s why we&#8217;ve developed ourselves to deliver tailored, end-to-end advertising signages, advertising banners, advertisement banners, advertising outdoor sign and advertising solutions on-time that match and exceed our clients&#8217; expectations every time.</p>\n\n<p>With our indepth industry expertize and creative outflow, we have been working within a wide range of vertical marketplaces, from fashion to press and the digital frontier and have participated directly in industry growth from digital pre-press to direct print.</p>\n\n<p>We cater to our clients with the latest in Solvent &amp; Digital Printing with state-of-the-art equipment to solve all requirements of advertising banner, advertising signages, glow sign boards, flex banners, front lit boards, non lit boards, road signages, life size cutouts, digital translites, trivision, table tops, and a host of other customized solutions.</p>\n\n<p>We hold a fully equipped fabrication unit manned with efficient, skilled &amp; experienced team of professionals who ensure that every process &amp; product is streamlined to meet the desired goal. Our team is competent enough to meet the demands of this highly competive industry.</p>\n\n<p>The amalgamation of modern mechinery, sophisticated technology &amp; expert team provides us a cutting edge in the industry. Our products are charecterized by:</p>\n\n<pre><code>Creativity\nImage Clarity\nColour Scheme\nTexture\nPrint Quality\nDurability\n</code></pre>\n\n<p>Phone :     +(91)-(11)-41629603/41672558/41672338</p>","image":{"available_sizes":[[[150,129],"assets/images/resized/0018/5873/185873v2-max-150x150.jpg"],[[209,181],"assets/images/resized/0018/5873/185873v2-max-250x250.jpg"],[[209,181],"assets/images/resized/0018/5873/185873v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}