{"first_name":"S","last_name":"Gopalakrishnan","permalink":"s-gopalakrishnan","crunchbase_url":"http://www.crunchbase.com/person/s-gopalakrishnan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Oct 23 15:13:59 UTC 2009","updated_at":"Fri Oct 23 15:15:06 UTC 2009","overview":"<p>Gopalakrishnan (Kris to his colleagues) is one of the founders of Infosys Technologies Limited. As Chief Executive Officer, he plays a key role in defining the company strategy and using technology and innovation continuously to maintain its leadership in the industry.</p>\n\n<p>On June 22, 2007, Kris took over from Nandan M. Nilekani as the CEO and Managing Director of Infosys Technologies Limited. Kris previously served as Chief Operating Officer (since April 2002), and as the President and Joint Managing Director (since August 2006). His responsibilities included customer services, technology, investments and acquisitions.</p>\n\n<p>Kris&#8217; initial responsibilities at Infosys included management of design, development, implementation and support of information systems for clients in the consumer products industry in the U.S. Between 1987 and 1994, he headed the technical operations of KSA/Infosys (a joint venture between Infosys and KSA at Atlanta, U.S.) as Vice President (Technical). In 1994, Kris returned to India and was appointed Deputy Managing Director of the company.</p>\n\n<p>Kris is currently the Chairman of the Indian Institute of Information Technology and Management (IIITM), Kerala, and Vice Chairman of the Board for Information Technology Education Standards (BITES) set up by the Government of Karnataka. Kris is the Vice Chairman of the Confederation of Indian Industries(CII) Southern Regional Council. He is also a member of ACM, IEEE and IEEE Computer Society.</p>\n\n<p>Kris holds a master&#8217;s degree in Physics and Computer Science from the Indian Institute of Technology Madras.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Executive Officer and Managing Directo","firm":{"name":"Infosys Technologies","permalink":"infosys-technologies","type_of_entity":"company","image":{"available_sizes":[[[150,61],"assets/images/resized/0003/1476/31476v1-max-150x150.png"],[[150,61],"assets/images/resized/0003/1476/31476v1-max-250x250.png"],[[150,61],"assets/images/resized/0003/1476/31476v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}