{"first_name":"S.","last_name":"Ravisankar","permalink":"s-ravisankar","crunchbase_url":"http://www.crunchbase.com/person/s-ravisankar","homepage_url":"http://www.greenstarsolar.net/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"decorative-solar-lights, decorative-solar-lights-manufacturers, solar-led-street-lights, solar-led-street-lights-exporters, residential-solar-water-heater","alias_list":null,"created_at":"Wed Mar 14 12:38:25 UTC 2012","updated_at":"Tue Mar 20 23:11:14 UTC 2012","overview":"<p>Star Enterprises, Tamil Nadu</p>\n\n<p>Incepted in the year 1994, Star Enterprises, Tamil Nadu is one of the leading manufacturers and exporters of solar lighting products. Our range includes decorative solar lights, solar led street lights, residential water heaters, solar street lights, CFL garden lights, LED solar lights, garden light, solar lantern, solar home light, etc. Manufactured by experts, our solar lighting products are known for their light weight, free maintenance, power saving capacity, excellent service back up, and high efficiency.</p>\n\n<p>We are manufacturing and exporting various solar lighting products, which are widely appreciated by our clients. In our range, we offer solar garden lights, LED solar, garden light, solar lantern, solar street lights, solar home lights, solar led lights, decorative solar lights, solar led street lights, residential solar water heaters, CFL street lights, etc. Our assortment of solar products is manufactured using high grade glass and fibre as raw materials. These are widely appreciated by our prestigious clients for their following attributes :</p>\n\n<pre><code>* Application specific design\n* Precision functionality\n* Optimum performance oriented\n* Dimensionally accurate\n</code></pre>\n\n<p>We have a quality assurance team consisting of quality experts having extensive experiences in the same industry. This team ensures that our products are durable, safe and energy-efficient. We have implemented stringent checking measures at different stages from procurement of raw material to manufacturing to the final delivery of our range of solar products. These are monitored before being packed and delivered to ensure that the clients get only the best solar products which are environment friendly as well. Our quality experts conduct regular checks on the manufacturing process based on the following parameters:</p>\n\n<pre><code>* Safety\n* Load performance\n* Durability\n</code></pre>\n\n<p>Telephone:  +(91)-(44)-22533432 </p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0017/8143/178143v2-max-150x150.jpg"],[[200,200],"assets/images/resized/0017/8143/178143v2-max-250x250.jpg"],[[200,200],"assets/images/resized/0017/8143/178143v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}