{"first_name":"Sab","last_name":"Kanaujia","permalink":"sab-kanaujia","crunchbase_url":"http://www.crunchbase.com/person/sab-kanaujia","homepage_url":"http://kanaujia.com","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"NBC Universal","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Feb 16 23:20:07 UTC 2008","updated_at":"Fri Oct 26 04:51:42 UTC 2012","overview":"<p>Sab Kanaujia is a globally renowned digital media executive.</p>\n\n<p>He is the Chief Strategy Officer &amp; EVP, Business Development at Totalmovie, an over-the-top, multi-platform global video service. </p>\n\n<p>Until recently, he was the President, Entertainment Services at Verismo Networks, a Silicon Valley startup that offers business customers solutions to bring seamless convergence of IPTV linear channels, video-on-demand, Internet video, social networking and personal media playback directly to consumers&#8217; television. At Verismo, he launched and ran Mela, a global consumer service with premium entertainment content from South Asia. As the GM of Mela, he was responsible for all aspects of the business including strategy, content acquisition, product, marketing, distribution and operations. Under his leadership, Mela became one of the most promising online South Asian entertainment services in the world, growing to more than 50 countries within months after launch. Mela was the first ever online service to release new Bollywood movies worldwide simultaneous to their theatrical releases in India.  </p>\n\n<p>The genesis of Mela was Kanaujia&#8217;s earlier venture, Digital Entertainment Corporation of India (DECI), a holding company that focused on launching consumer entertainment services using premium entertainment content from India to a global audience.</p>\n\n<p>Before launching DECI, Kanaujia was the General Manager/Vice President, Digital Product Strategy &amp; Development at NBC Universal (NBCU). Based out of the company&#8217;s headquarters in New York City, he ran its global digital product strategy and development across its television broadcast network, cable TV channels, Hollywood studios and digital properties. He joined NBCU in August 2006 as part of its corporate digital media team that incubated Hulu.com, one of the world&#8217;s largest online premium video networks that was announced in March 2007 as a joint venture between NBCU and News Corp. </p>\n\n<p>He was the General Manager of NBCU&#8217;s strategic digital venture with Ten Sports, the most watched sports channel across the Indian sub-continent and Middle East. Working with NDTV, one of India&#8217;s biggest media companies and a strategic investment of NBCU at the time, Kanaujia helped re-launch several of NDTV&#8217;s digital properties including its flagship global news destination, www.ndtv.com. </p>\n\n<p>He was the brainchild behind NBCU&#8217;s corporate social media initiative that distributed firm&#8217;s content covering over a dozen brands including NBC, CNBC, USA Networks, NBC Sports and Olympics, SyFy, MSNBC, Universal Studios, iVillage, Telemundo, Oxygen, and others to fans through viral distribution. He quickly grew this initiative, which within two years accounted for over 25% of the total reach of NBCU&#8217;s network of online properties, providing the firm&#8217;s content a global footprint with presence on more than six million destinations worldwide.</p>\n\n<p>Prior to joining NBC Universal in August 2006, Kanaujia was at AOL where he held several key positions. Focusing on product development at AOL Video, he successfully launched the AOL Hi-Q Video, an online platform that delivered DVD-quality videos to consumers and provided a rich, interactive, lean-back user experience. AOL Hi-Q Video became a critical part of the distribution network for AOL&#8217;s In2TV service, the first broadband TV network in the U.S, that provided users thousands of hours of free, on-demand, full-length classic TV shows from Warner Bros. Earlier, Kanaujia was a founding member of the AOL Audience corporate development team that launched new ventures including TMZ.com (a first-of-its-kind, 24/7, on-demand entertainment news network on the Web), Network Live (the first multi-platform digital entertainment company for live programming), the largest online radio network through strategic partnership between AOL &amp; XM Satellite Radio, among others. </p>\n\n<p>He led the development and execution of the distribution strategy for AOL.com - AOL&#8217;s first open Web portal and other AOL products (IM, Web browsers, toolbar, etc.) that were designed to provide users a rich and convenient online experience and drive traffic to the AOL&#8217;s vast network of online properties. Additionally, he helped the development of AOL&#8217;s international expansion strategy as a Web portal into high-potential, new and emerging markets outside the U.S.</p>\n\n<p>Kanaujia came to AOL after serving as a Director with a closely-held, boutique private equity investment group based in Greenwich, CT, where he led investments in digital media &amp; technology firms. Prior to which, he spent four years with KPMG LLP in New York, where he provided consulting services to KPMG&#8217;s major Fortune 100 global media and technology clients, advising primarily on technology commercialization and global business transformation.</p>\n\n<p>Before joining KPMG in September 1998, Kanaujia was selected for the prestigious Corporate Leadership Development Program of AlliedSignal (now part of Honeywell International). There he managed a $20M global technology initiative across company&#8217;s 15 locations in North America and Western Europe. </p>\n\n<p>Kanaujia started his professional career in the U.S. in January 1996 as the Manager, Strategy &amp; Business Development for a technology startup in Northern Virginia, that has since evolved into ePlus, Inc, a leading provider of technology sales &amp; financing services with annual revenue of over $850M. He led the development of the firm&#8217;s online business strategy and contributed to revenue growth through acquisitions and partnerships. Kanaujia&#8217;s efforts played a key role in the firm&#8217;s highly successful NASDAQ IPO in December 1996.</p>\n\n<p>Kanaujia earned an MBA with honors from the University of Maryland, College Park, USA, where he was awarded full scholarship based on merit. He received his Bachelor&#8217;s in Technology degree from the Indian Institute of Technology, Kanpur, India, graduating third in his Class.</p>","image":{"available_sizes":[[[150,127],"assets/images/resized/0001/2479/12479v1-max-150x150.jpg"],[[250,212],"assets/images/resized/0001/2479/12479v1-max-250x250.jpg"],[[395,335],"assets/images/resized/0001/2479/12479v1-max-450x450.jpg"]],"attribution":null},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Strategy Officer & EVP, Business Development","firm":{"name":"Totalmovie","permalink":"totalmovie","type_of_entity":"company","image":null}},{"is_past":false,"title":"Board Advisor","firm":{"name":"Apigee","permalink":"apigee","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0002/6739/26739v6-max-150x150.jpg"],[[250,85],"assets/images/resized/0002/6739/26739v6-max-250x250.jpg"],[[250,85],"assets/images/resized/0002/6739/26739v6-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Founder & CEO","firm":{"name":"Digital Entertainment Corporation of India (DECI)","permalink":"digital-entertainment-corporation-of-india-deci","type_of_entity":"company","image":null}},{"is_past":true,"title":"Founder & CEO","firm":{"name":"Digital Entertainment Corporation of India ","permalink":"digital-entertainment-corporation-of-india","type_of_entity":"company","image":null}},{"is_past":true,"title":"Vice President, Digital Product Strategy & Development","firm":{"name":"NBC Universal","permalink":"nbcuniversal","type_of_entity":"company","image":{"available_sizes":[[[150,58],"assets/images/resized/0001/5877/15877v4-max-150x150.png"],[[226,88],"assets/images/resized/0001/5877/15877v4-max-250x250.png"],[[226,88],"assets/images/resized/0001/5877/15877v4-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Principal (Director), AOL Audience Corporate Development & Strategy","firm":{"name":"AOL","permalink":"aol","type_of_entity":"company","image":{"available_sizes":[[[150,84],"assets/images/resized/0000/4003/4003v5-max-150x150.png"],[[174,98],"assets/images/resized/0000/4003/4003v5-max-250x250.png"],[[174,98],"assets/images/resized/0000/4003/4003v5-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"President, Entertainment Services","firm":{"name":"Verismo Networks","permalink":"verismo-networks","type_of_entity":"company","image":{"available_sizes":[[[150,77],"assets/images/resized/0004/0180/40180v2-max-150x150.jpg"],[[185,95],"assets/images/resized/0004/0180/40180v2-max-250x250.jpg"],[[185,95],"assets/images/resized/0004/0180/40180v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://kanaujia.com","title":"Tha Sab Kanaujia Blog"}]}