{"first_name":"sabina","last_name":"porfido","permalink":"sabina-porfido","crunchbase_url":"http://www.crunchbase.com/person/sabina-porfido","homepage_url":"http://scholar.google.it/citations?user=D2c15cMAAAAJ&hl=it","birthplace":"Italy","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1956,"born_month":10,"born_day":11,"tag_list":"","alias_list":null,"created_at":"Wed Mar 14 14:22:05 UTC 2012","updated_at":"Sun Mar 25 22:23:33 UTC 2012","overview":"<p>Sabina Porfido\nRicercatore /Researcher\nTel.: +39081 5423843\nFax: +390815423888\nE-mail: sabina.porfido@iamc.cnr.it\nIstruzione (Education)\nLaurea in Scienze Geologiche (03/11/1979)\nUniversity degree in Geology, Federico II University, Napoli, Italy (03/11/1979).\nAttività lavorativa (Working experience)\n1997-pres. Ricercatore CNR-IAMC\n(CNR-IAMC Senior Researcher)\n1988-1997 Ricercatore a tempo indeterminato CNR-GNDT(CNR-GNDT Researcher level III)\n1985-1988 Ricercatore (ex art. 36) CNR-GNDT (Gruppo Nazionale Difesa dai Terremoti)\n(CNR- GNDT Researcher ex art. 36)\n1980-1985 Ricercatore Associato Osservatorio Vesuviano-Università Federico II (Napoli)\n(Associate Researcher Osservatorio Vesuviano- Federico II University, Naples).\nAttività scientifica (Research interests)\nLe attività di ricerca di Sabina Porfido sono state indirizzate allo studio della sismicità attuale e storica relativa soprattutto all’Italia meridionale, alla valutazione e distribuzione dell’Intensità, alla definizione dei campi macrosismici, all’individuazione degli effetti indotti al suolo dai terremoti. Si è interessata di microzonazioni sismiche, nonchè della classificazione simica nazionale. Contestualmente ha sviluppato ricerche sui processi sismotettonici e sull’individuazione di zone sismogenetiche Attualmente è impegnata nelle ricerche per la valutazione e la riduzione dell’hazard sismico attraverso numerosi progetti nazionali ed internazionali (ITHACA; INQUA scale, 2004; ESI scale 2007; TERPRO-INQUA; IGCP) e all’hazard idrogeologico relativo ad aree interne e costiere(GNDCI-CNR, IAEG)\nSabina Porfido is senior researcher at the Institute for Coastal Marine Environment of the Italian Research Council (CNR). Her main Scientific activities are: 1) Seismology: macroseismic survey studies of historical earthquakes in the Southern Apennines, Italy for seismic hazard assessment; 2) Microzonation problems; 3) Seismotectonic processing: recognition and characterization of seismogenic area, capable faults; 4) Study of ground effects earthquakes-induced (primary and secondary effects), implementation of the Environmental Earthquake Effects Catalogue; 5) Natural Hazard : seismic hazard, geologic and hydraulic hazard analysis (ITHACA; INQUA scale, 2004; ESI scale 2007; TERPRO INQUA; GNDCI-CNR, IAEG, IGCP projects)\nPubblicazioni più significative (Selected publications)\nPorfido S., E. Esposito, F. Alaia F. Molisso, M. Sacchi (2009): The use of documentary sources for reconstructing flood chronologies on the Amalfi rocky coast( southern Italy) in “Geohazard in Rocky Coastal Areas” C. Violante ed.- Pub. 322-Geol. Society of London ISBN 978-1-86239-282-3\nhttp://sp.lyellcollection.org/cgi/content/abstract/322/1/173\nBozzano F., E. Esposito, L. Lenti, S. Martino, A. Montagna, A. Paciello, S. Porfido (2009): Numerical Modelling of Eartquake-induced Rock-Landslides: The 1783 Scilla Case-History (Southern Italy) Proc. of 5th Int. Conf. on Recent Advances in Geotechnical.</p>","image":{"available_sizes":[[[106,150],"assets/images/resized/0017/8214/178214v2-max-150x150.jpg"],[[177,250],"assets/images/resized/0017/8214/178214v2-max-250x250.jpg"],[[208,293],"assets/images/resized/0017/8214/178214v2-max-450x450.jpg"]],"attribution":"<p>CNR-Iamc</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}