{"first_name":"Sadhna","last_name":"Paralkar, MD, MBA","permalink":"sadhna-paralkar-md-mba","crunchbase_url":"http://www.crunchbase.com/person/sadhna-paralkar-md-mba","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Altruista Health","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue May 04 15:27:29 UTC 2010","updated_at":"Tue May 04 23:49:39 UTC 2010","overview":"<p>Dr. Sadhna Paralkar is the Chief Operating Officer at Altruista Health. She comes to Altruista fromUnitedHealth Group (UHG) with plethora of experience in healthcare operations, informatics, and\nconsulting in medical management.</p>\n\n<p>As a VP of Clinical Informatics and Medical Management at Ingenix since 2005, Dr. Paralkar was responsible for providing clinical expertise to our clients in the payer, provider, public sector, and employer markets. Her areas of expertise include health care informatics, medical management program design, clinical operations, benefit plan design and network management strategies to optimize health improvement while containing costs, and evaluation and implementation of disease management and wellness programs based on evidence based medicine (EBM) protocols. Prior to Ingenix, Dr. Paralkar was at Optum, another UnitedHealth Group company, where she served as the Director of Business Development for the Care Management suite of products since 2003. She was also responsible for the Care Management ROI model at Optum and commercializing the Care Management value story to Optum’s internal (various UHG segments) and external customers.</p>\n\n<p>Prior to joining United, Dr. Paralkar worked at International Truck and Engine Corporation (Navistar, formerly known as International Harvester) - a Fortune 500 company in various capacities for six years.  The last position Dr. Paralkar held at Navistar was Associate Medical Director responsible for occupational health and disability, on-site wellness programs, health benefits plan design, and health care purchasing. Dr. Paralkar has published several articles on Health and Productivity in peer-reviewed journals and is an invited speaker at national conferences on the business of health care, including the most recent Society of Actuaries conference, and the ACOEM (American College of Occupational and Environmental Medicine) state-of-the-art conference.</p>\n\n<p>A native of Mumbai (Bombay), India, Dr. Paralkar completed her medical internship in 1992 at L.T.M. General Hospital of University of Bombay, India after earning her baccalaureate degree in Medicine and Surgery from the same institution in 1990. As a licensed family practitioner, some of her public health achievements include implementation and evaluation of immunization programs in rural India. In 1995, she completed a Master of Science degree in Public Health from the University of Illinois at Urbana-Champaign focusing on health data analysis and epidemiology. Part of her analytic research on health communications in the mass media was funded by the National Institutes of Health.</p>\n\n<p>Dr. Paralkar also completed an MBA with a focus on health industry management and marketing from the prestigious Kellogg School of Management of Northwestern University in 2003.</p>\n\n<p>Dr. Paralkar is a member of the American Public Health Association, American College of Occupational and Environmental Medicine, The Institute of Medicine of Chicago, American Association of Physicians from India, and Women Business Leaders of the U.S. Health Care Industry Foundation.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Operating Officer","firm":{"name":"Altruista Health","permalink":"altruista-health","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0008/5914/85914v2-max-150x150.png"],[[237,55],"assets/images/resized/0008/5914/85914v2-max-250x250.png"],[[237,55],"assets/images/resized/0008/5914/85914v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.altruistahealth.com/sadhna-paralkar.aspx","title":"Altruistahealth.com"}],"web_presences":[{"external_url":"http://www.linkedin.com/pub/sadhna-paralkar-md/6/a39/144","title":"linkedIn"}]}