{"first_name":"Sadhana","last_name":"Chalasani","permalink":"sadhana-chalasani","crunchbase_url":"http://www.crunchbase.com/person/sadhana-chalasani","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Jul 14 09:31:21 UTC 2012","updated_at":"Sun Jul 15 02:25:40 UTC 2012","overview":"<p>Florida honor student Sadhana Chalasani doesn’t think of herself as anything special. Other people would disagree. For the past few years, the vivacious teenager has been heavily committed to the fight against breast cancer. She works with the Pink Ribbon Club Foundation to bring breast cancer awareness to her high school. Someday, Sadhana would like to be more actively involved in this battle as a practicing physician.</p>\n\n<p>Sadhana’s social activism doesn’t entirely define her, however. This teen is also remarkable for her accomplishments as a Kuchipudi dancer. Kuchipudi is a classical Indian dance, renowned for its grace and fluid movements. Sadhana has been studying this Southern Indian dance form since she was very young. Every summer, Sadhana travels to India for intensive training in this demanding art.</p>\n\n<p>What drives a young woman like Sadhana towards this high level of achievement at such a young age? Sadhana thinks this is a pivotal time for the world. Technology has made the world a smaller place. National cultures are rapidly being replaced by a global culture. As a young American of Indian descent, Sadhana Chalasani sees herself as a representative of this new global culture.</p>\n\n<p>What Is Kuchipudi Dance?</p>\n\n<p>Kuchipudi dance is essentially a celebration of an emotional state known in Sanskrit as a rasa. The concept of rasa is the driving force behind all Indian performance art. Rasa is also the engine behind much of India’s cinema and literature as well.</p>\n\n<p>There are eight rasas in all, and each of them is associated with a different primal emotion. These emotions include love, fury, mirth, tragedy, disgust, horror, amazement and heroism.</p>\n\n<p>To evoke the rasas, Kuchipudi dancers introduce a lot of mime into their dance movements. As carriage and elegance are important, they sometimes dance with pots filled with water on their heads.</p>\n\n<p>Sadhana: An All American Teen?</p>\n\n<p>Though she celebrates her Indian heritage, Sadhana enjoys many of the same activities that every American teen enjoys. She loves to play tennis and enjoys practicing the piano. She also tutors classmates in mathematics. Sadhana is an active member of the Key Club, a service organization for high school students.</p>\n\n<p>One could say that Sadhana Chalasani represents the new type of American teenager. Growing up in a digital age, teenagers are no longer cliquish and parochial. Teenagers like Sadhana know they are citizens both of their countries and of the world. </p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/0953/200953v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/0953/200953v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/0953/200953v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}