{"first_name":"Sahil","last_name":"Alvi","permalink":"sahil-alvi","crunchbase_url":"http://www.crunchbase.com/person/sahil-alvi","homepage_url":"http://www.sahilalvi.com","birthplace":"India","twitter_username":"sahil_alvi","blog_url":"http://www.sahilalvi.com/blog","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1976,"born_month":1,"born_day":null,"tag_list":"advisorconsultantintrapreneurentrepreneur","alias_list":null,"created_at":"Sat Jul 28 05:02:31 UTC 2012","updated_at":"Tue Jul 31 05:05:54 UTC 2012","overview":"<p>Sahil Alvi is a management consultant, economic analyst/investment strategist, intra-preneur and writer with core competencies in Global Macro-economics, Trading Strategies, Growth Strategy, New Venture Creation and Business Development.\nSahil lives and works in Dubai. He is a management consultant with a global consultancy where he spearheads the firm’s business development and thought leadership initiatives.\nHe started his career with the Advisory practice of Ernst &amp; Young in Atlanta. Along the way, he helped build a startup into a high-growth enterprise in Miami. Sahil has also held a management consulting position with PricewaterhouseCoopers in Los Angeles.\nOver the course of his career, Sahil has advised several Fortune 500 clients, sovereign wealth funds/quasi-government conglomerates as well as startup ventures across a variety of disciplines such as: Growth Strategy, Business Transformation, Product Strategy, Enterprise Risk Management, Process Re-engineering, Commercial Due Diligence and Investment Analysis.\nHis industry experience spans:</p>\n\n<ul>\n<li>Financial Services (Banks, Insurance, Private Equity, Venture Capital, and Asset Management)</li>\n<li>Real Estate &amp; Hospitality</li>\n<li>Healthcare (Payors and Providers)</li>\n<li>Distribution &amp; Logistics</li>\n<li>Consumer Internet/Web 2.0</li>\n<li>Energy &amp; Natural Resources</li>\n<li>Special Economic Zones.\nSahil has had the opportunity to live or work across: US, India, UAE (Dubai / Abu Dhabi), Canada, Netherlands, Germany, France, Saudi Arabia, Oman, Qatar, Bahrain.\nHe holds an MBA (Entrepreneurship) from Wake Forest University in North Carolina, USA and a BA (Economics) from University of Bombay in Bombay, India.\nSahil’s avocations include: Tennis, Product &amp; Furniture Design, Abstract Expressionistic Painting, Photography, Biking, Blogging, and Reading Literary Classics, Poetry, Management, Finance and Economics tomes.</li>\n</ul>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.sahilalvi.com","title":"Personal Website & Blog"},{"external_url":"http://ae.linkedin.com/in/sahilalvi","title":"LinkedIn Profile"}]}