{"first_name":"Saikat","last_name":"Ghosh","permalink":"saikat-ghosh-2","crunchbase_url":"http://www.crunchbase.com/person/saikat-ghosh-2","homepage_url":"http://www.phoolwala.com","birthplace":"India","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1974,"born_month":5,"born_day":18,"tag_list":"","alias_list":null,"created_at":"Fri Aug 06 13:48:11 UTC 2010","updated_at":"Fri Aug 06 18:20:21 UTC 2010","overview":"<p>Saikat Ghosh graduated with honours in mechanical engineering from the Delhi College of Engineering, and completed his MBA from IIM Ahmedabad in 1998. He was a management consultant for 3 years with Accenture. During this time, Saikat advised leading clients including the UB Group, Modi Enterprises, Sidhee Cements, Saurashtra Cements, IndoFil, Escorts Limited and others on best practices in supply chain management, logistics and e-commerce strategy. </p>\n\n<p>In 2001-02, Saikat launched Phoolwala.com™ and grew it to the leading company in fresh flowers delivery same-day across 120 cities in India. The company now connects top retailers in all major cities, accounting for 1 out of every 4 deliveries of fresh flowers in India. Phoolwala.com™ owns the proprietary e-commerce suite Phoolwala.NET™ – an online intranet connecting florists nationwide</p>\n\n<p>Saikat launched Teleshope.com in 2002-03 to benefit from the growing needs for Value Added Services (VAS) among India’s expanding mobile operators. In 3 years, Teleshoppe has successfully launched its own 5-digit short code (53456) available across India and has launched over 60 proprietary applications for use by subscribers, corporate clients and mobile operators</p>\n\n<p>In early 2009, Teleshoppe emerged as a leader in Integrated Digital Marketing (IDM), an activity which involves engaging large customer databases through targeted and chronologically structured online messages delivered via web, mobile, response cells and eDM’s. Response rates for digital campaigns are over 88% higher than similar ones in traditional media, making this an attractive media for advertisers and marketers</p>\n\n<p>In his spare time, Saikat is an avid reader and enjoys taking road trips with his wife and their three year old son</p>","image":{"available_sizes":[[[139,150],"assets/images/resized/0009/6335/96335v2-max-150x150.jpg"],[[232,250],"assets/images/resized/0009/6335/96335v2-max-250x250.jpg"],[[418,450],"assets/images/resized/0009/6335/96335v2-max-450x450.jpg"]],"attribution":"<p>Saikat Ghosh</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://in.linkedin.com/in/saikatghosh","title":"LinkedIn"}]}