{"first_name":"Sal","last_name":"Amer","permalink":"sal-amer","crunchbase_url":"http://www.crunchbase.com/person/sal-amer","homepage_url":"http://inceva.com","birthplace":"","twitter_username":"inceva","blog_url":"http://inceva.com/blog","blog_feed_url":"http://inceva.com/feed","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"seo-thailand, marketing-bangkok, sem-thailand, advertising-thailand","alias_list":null,"created_at":"Sun Jan 22 06:59:28 UTC 2012","updated_at":"Mon Jan 23 07:21:44 UTC 2012","overview":"<p>Inceva Marketing has a deep understanding of all the proven and time-tested methods of yesteryear with with an eye on what technology we use today to accomplish the bottom line. To maximize profit for our clients.</p>\n\n<p>The Digital Revolution has changed everything</p>\n\n<p>In the wake of all the rapid technological and social developments over the past 10 years,consumer behavior too has evolved. As a marketing company we have been challenged to try to keep up with the changing landscape, to help create new user experiences,to continually innovate and to ALWAYS look ahead.</p>\n\n<p>Inceva is built on this &amp; for this element</p>\n\n<p>Inceva Marketing agency has been built from the ground up with certain core principals that help foster an entrepreneurial culture that thrives on learning and executing brilliant ideas with brute force. Our foundation is built on intellect &amp; fearlessness.</p>\n\n<p>We’re in this together</p>\n\n<p>Consumer attention today is extremely fragmented, your online and offline business faces new challenges and obstacles in a complex landscape that offers no road signs to follow.Our clients hire us to help navigate these new waters to help them grow their business, generate new web traffic optimize their Internet revenue. Our aim goes beyond the demographic and psychographics segmentation &amp; beyond just search engines. Inceva looks at the how, who,where and why of business  to see what drives your customers,visitors. Our job is to understand what converts this traffic into customers and how social and new media marketing are evolving.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.facebook.com/seointhailand","title":"Facebook"},{"external_url":"http://www.linkedin.com/in/inceva","title":"LinkedIn"},{"external_url":"http://www.youtube.com/user/SEOinThailand","title":"YouTube"}]}