{"first_name":"Salman","last_name":"Khan","permalink":"salman-khan","crunchbase_url":"http://www.crunchbase.com/person/salman-khan","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Khan Academy","born_year":null,"born_month":null,"born_day":null,"tag_list":"neelu","alias_list":"","created_at":"Wed Feb 16 11:32:28 UTC 2011","updated_at":"Mon Aug 06 22:12:34 UTC 2012","overview":"<p>Sal Khan is the founder of the Khan Academy, a nonprofit with the mission of providing free, high-quality education for “anyone, anywhere” in the world. Khan graduated from MIT in 1998 with three degrees: two bachelor of science degrees in mathematics and electrical engineering/computer science; and a master of science degree in electrical engineering. He worked in technology in Silicon Valley until the first bubble burst, after which he attended Harvard Business School. After earning a masters degree in business administration in 2003, Khan became an analyst at a Boston based hedge fund.</p>\n\n<p>In 2004 as a side project, Sal began tutoring his young cousin in math, communicating by phone and using an interactive notepad. When others expressed interest, he began posting videos of his hand-scribbled tutorials on YouTube. Demand took off, and in 2009 he quit his day job to commit himself fully to the not-for-profit Khan Academy. The Khan Academy website now provides self-pacing software and unlimited access to over 3,000 instructional videos covering everything from basic arithmetic to college level science and economics. It’s the most-used library of educational videos on the web, with over 5 million unique students per month, over 150 million lessons delivered, and over half a billion exercises completed. Over 10,000 classrooms around the world are also using Khan Academy to help build student mastery of topics and to free up class time for dynamic project based learning.</p>\n\n<p>Khan was recently profiled by 60 Minutes and recognized by Time Magazine as one of the 100 most influential people in the world.</p>","image":{"available_sizes":[[[150,114],"assets/images/resized/0020/4142/204142v2-max-150x150.jpg"],[[250,191],"assets/images/resized/0020/4142/204142v2-max-250x250.jpg"],[[450,344],"assets/images/resized/0020/4142/204142v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Khan Academy","permalink":"khan-academy","type_of_entity":"company","image":{"available_sizes":[[[150,41],"assets/images/resized/0014/9770/149770v1-max-150x150.png"],[[200,55],"assets/images/resized/0014/9770/149770v1-max-250x250.png"],[[200,55],"assets/images/resized/0014/9770/149770v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}