{"first_name":"Sam","last_name":"Gough","permalink":"sam-gough","crunchbase_url":"http://www.crunchbase.com/person/sam-gough","homepage_url":"http://www.freightcalculator.com.au","birthplace":"","twitter_username":"freightcalculat","blog_url":"http://freightcalculator.com.au/interstate-courier-services","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"xcart-virtuemart-calculator-australia-freight-shipping-modules","alias_list":null,"created_at":"Wed Dec 22 20:54:15 UTC 2010","updated_at":"Sat Dec 25 18:45:24 UTC 2010","overview":"<p>www.FreightCalculator.com.au provides online freight reviews and bookings and we have the capablility to power ecommerce stores like virtuemart, xcart, magento, oscommerce, interspire and more:</p>\n\n<p>Need an interstate courier service? When it comes to the accurate and cost efficient interstate delivery of your goods, www.FreightCalculator.com.au is the freight provider of choice. The large network of depots and courier agents under our control allows us to meet all of your interstate courier needs, no matter how unique they may be. We can courier your goods across the country with ease, no matter what weight or size your load might be. If you require interstate delivery of commercial freight, industrial freight or even private freight, we are able to deliver in the fastest time frame possible. Our courier service for interstate freight encompasses the delivery of frames, cartons, pallets and skids. Our experience in interstate transport includes virtually everything, from machinery and furniture, to vehicles and crates at a time, while we are also experts in transporting more vulnerable loads, including refrigerated and fragile goods. </p>\n\n<p>www.FreightCalculator.com.au Australian freight services work with a network of more than 80 different courier depots across Australia, so you can be sure that the coverage we offer is the most extensive. Each of the depots we use is managed and owned independently, which means that they consider your business extremely important. They never take chances, they only want to deliver a quality service, with the attention to detail and care that is necessary to guarantee your load is delivered in a reliable, professional and secure fashion. CourierQuotes.com.au network of trucks, trains and transport flights make daily runs to all parts of the country, and we even offer an express courier service for anyone who needs their interstate freight delivered yesterday. Options include overnight interstate road courier transport between Melbourne, Sydney, Brisbane and many other large interstate cities, while our next city, next day delivery service can meet the speeds of air transportation, but at less than half the price. Don’t wait any longer, make sure your load gets where it needs to be. CourierQuotes.com.au operates nationwide delivery services.</p>\n\n<p>Australian Pallet Delivery ?www.FreightCalculator.com.au can help with shipping If you’re looking for a fast and reliable palletized courier delivery service, Freight One Logistics is the partner you can rely on to meet your needs. We bring together the skills and strengths of more than 80 expert pallet delivery professionals countrywide, including depots, transportation firms and logistical experts, to deliver a first class, highly professional and reliable transportation service. Our network is spread throughout the country, with representatives in every state, so you can be sure that your transport needs will be met in an efficient and timely manner, each and every time.</p>\n\n<p>When it comes to the distribution of pallet sized loads, www.FreightCalculator.com.au is one of Australia’s fastest and most reliable local and interstate courier experts. </p>\n\n<p>We have been helping Australians move freight since 1996, we have been delivering pallet  on an almost daily basis to virtually every part of the country. Our service is now second to none, and even when faced with the ever-changing demands of  distribution, we are flexible enough to bend with the times. No matter what your  needs are, we can take care of it.Our  services correspond to a timely, effective and reliable delivery each and every time, regardless of what size your load is. We can hundreds of pallets at a time, and send them safely and quickly to destinations across the country, from Darwin to Pert, Brisbane to Cairns. When it comes to pallet loads, Freight One Logistics is the safest pair of hands there is. We understand that not every location is equipped to deal with pallet sized loads, and so as part of our service we are also able to supply the lifting and loading equipment that your load needs, in order to remove and store your goods once they arrive. Rest assured, we meet all of the requirements necessary for your interstate pallet delivery in Australia.</p>","image":{"available_sizes":[[[150,102],"assets/images/resized/0011/5164/115164v2-max-150x150.jpg"],[[250,170],"assets/images/resized/0011/5164/115164v2-max-250x250.jpg"],[[450,306],"assets/images/resized/0011/5164/115164v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}