{"first_name":"Samantha","last_name":"Lurey","permalink":"samantha-lurey-2","crunchbase_url":"http://www.crunchbase.com/person/samantha-lurey-2","homepage_url":"http://gotrexx.com","birthplace":"","twitter_username":"gotrexx","blog_url":"http://gotrexx.om/blog","blog_feed_url":"","affiliation_name":"GoTrexx","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Aug 03 01:41:27 UTC 2012","updated_at":"Sat Aug 04 14:45:25 UTC 2012","overview":"<p>Samantha Lurey, founder and president of Go Trexx, is a successful serial entrepreneur and business consultant. Prior to launching Go Trexx, Lurey was the President of Plus Delta Consulting, a woman-owned firm specializing in management consulting, where she advised Fortune 500 and not-for-profit  organizations in best practices for strategic development and growth.</p>\n\n<p>As an avid traveler, she has toured 22 countries and more than half of the United States. During a trip with her niece and nephew, she realized that the needs and curiosities of children were being underserved by current travel tools, an observation that inspired her to create a series of apps that would help children more fully appreciate the destinations they were visiting.</p>\n\n<p>Lurey received her degree in Industrial/Organizational Psychology from the California School of Professional Psychology.   She believes in giving back to her community.  As such, she is on the Advisory Board of the Association of Women in Technology and volunteers with Working Wardrobes.  When she isn’t planning her next adventure, Lurey enjoys hiking with her two Australian Shepherds and spending Sunday mornings cooking or chasing balls around on the golf course.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"GoTrexx","permalink":"gotrexx","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/gotrexx","title":"Twitter"},{"external_url":"http://facebook.com/gotrexxtravel","title":"Facebook"}]}