{"first_name":"Samir","last_name":"Kaul","permalink":"samir-kaul","crunchbase_url":"http://www.crunchbase.com/person/samir-kaul","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Sep 10 00:18:18 UTC 2008","updated_at":"Tue Aug 25 17:45:32 UTC 2009","overview":"<p>Samie Kaul is a partner at <a href=\"http://www.crunchbase.com/financial-organization/khosla-ventures\" title=\"Khosla Ventures\">Khosla Ventures</a>. Samir became a founding general partner at Khosla Ventures in 2006,  focusing primarily on renewable energy.on clean technologies and life sciences investing. Since joining forces with Khosla, Samir has been a co-founder/founding investor in Calera, CoSkata, Mascoma, Range Fuels, Seeo and led the firms investments in Amyris, Ausra, Great Point Energy, PRAJ Industries (BSE:PRAJ), Stion, Transonic Combustion, Segetis, NanoH20, Soladigm, and a number of early stage science projects. </p>\n\n<p>Samir grew up in a family of engineers and doctors. Both his father and uncle were early engineers in a pioneering satellite communications company where he worked during his high school and college summer breaks. However, it became clear during high school that it was biology rather than engineering which was his true passion. This led him to attend the University of Michigan where he majored in Biology and taught undergraduate Biochemistry. He then continued on to graduate school to study Biochemistry at the University of Maryland.</p>\n\n<p>Samir attended Harvard Business School to pursue an MBA. With a strong scientific background and experience running large project teams, this would provide the business training needed to enter industry. </p>\n\n<p>Upon graduating, Samir joined Flagship Ventures to start and invest in early stage biotechnology companies. During his five years there, he was involved in starting and investing in a number of companies including Helicos BioSciences (NASDAQ: HLCS), Epitome Biosystems, Codon Devices, LS9, and Morphotek (acquired by Eisai). Helicos, co-founded with Stan Lapidus and Steve Quake from Stanford, is developing single molecule sequencing instruments to revolutionize personalized medicine. </p>\n\n<p>As CEO for the first 18 months of Codon Devices, Samir raised the Series A Financing, built the technical and advisory team, and booked significant revenues in the company first year of operations.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0005/7659/57659v1-max-150x150.jpg"],[[166,250],"assets/images/resized/0005/7659/57659v1-max-250x250.jpg"],[[299,450],"assets/images/resized/0005/7659/57659v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.flickr.com/photos/juccce/\" title=\"JUCCCE on Flickr\" rel=\"nofollow\">JUCCCE on Flickr</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Khosla Ventures","permalink":"khosla-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,36],"assets/images/resized/0000/1507/1507v1-max-150x150.jpg"],[[250,60],"assets/images/resized/0000/1507/1507v1-max-250x250.jpg"],[[300,73],"assets/images/resized/0000/1507/1507v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}