{"first_name":"Samuel","last_name":"Colella","permalink":"samuel-colella","crunchbase_url":"http://www.crunchbase.com/person/samuel-colella","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Feb 02 20:00:45 UTC 2010","updated_at":"Tue Feb 02 20:40:59 UTC 2010","overview":"<p>Sam Colella is a Managing Director and Co-Founder of <a href=\"/financial-organization/versant-ventures\" title=\"Versant Ventures\" rel=\"nofollow\">Versant Ventures</a>. </p>\n\n<p>A highly respected venture capitalist recognized for his leadership in life sciences investing, Sam Colella co-founded Versant Ventures with six other managing directors in 1999. Over the course of his career, Mr. Colella has acquired more than 20 years of successful operating experience in the high technology industry and more than 25 years of investing experience in the healthcare sector. </p>\n\n<p>Prior to founding Versant, Mr. Colella managed one of the first life science-focused investing groups in the industry as a general partner with Institutional Venture Partners (IVP). Previously, he was president of a New York Stock Exchange company and held a variety of functional positions in a broad array of diverse businesses, including president of Spectra-Physics, the world&#8217;s leading laser supplier, and senior manager of the Technical Products Division of Corning Glass. </p>\n\n<p>Having managed investments concentrated in medical devices, biotechnology and health care technology companies, Mr. Colella is credited with an extensive list of successful public life science companies, including Alexza Pharmaceuticals, Argonaut Technologies, Arthrocare, Athena Neurosciences, Aviron, CV Therapeutics, Endosonics, Genomic Health Inc., IVAC Holdings, Onyx Pharmaceuticals, Pharmacopeia, Symyx Technologies, Thermage, Tularik and Vivus. He is currently a director of Alexza Pharmaceuticals, EuroVentures, Flexion, Genomic Health Inc., Jazz Pharmaceuticals, Rennovia, Veracyte, and he is Chairman of Fluidigm. </p>\n\n<p>Mr. Colella’s professional affiliations include terms of service as an officer in the National Venture Capital Association, the Western Association of Venture Capitalists, and American Entrepreneurs for Economic Growth and Chairman of the Stanford Council on Interdisciplinary Biosciences. Mr. Colella has a B.S. degree in Business and Engineering from the University of Pittsburgh and an M.B.A. degree from Stanford University.</p>","image":{"available_sizes":[[[150,34],"assets/images/resized/0007/5821/75821v1-max-150x150.png"],[[250,57],"assets/images/resized/0007/5821/75821v1-max-250x250.png"],[[450,104],"assets/images/resized/0007/5821/75821v1-max-450x450.png"]],"attribution":"<p>Versant Ventures</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director, Co-Founder","firm":{"name":"Versant Ventures","permalink":"versant-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,90],"assets/images/resized/0004/6455/46455v1-max-150x150.png"],[[161,97],"assets/images/resized/0004/6455/46455v1-max-250x250.png"],[[161,97],"assets/images/resized/0004/6455/46455v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}