{"first_name":"Samuel","last_name":"Holtzman, Ph.D.","permalink":"samuel-holtzman-ph-d","crunchbase_url":"http://www.crunchbase.com/person/samuel-holtzman-ph-d","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Ayax Systems","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Apr 28 14:49:44 UTC 2009","updated_at":"Fri May 08 18:09:14 UTC 2009","overview":"<p>In addition to being an Advisor to Ayax Systems, Holtzman is also a professor at Stanford University, teaching Management Science and Engineering.</p>\n\n<p>Holtzman also is co-founder, Chairman of the Board, President, and CEO of Rosa Pharmaceuticals, Inc.  Rosa Pharmaceuticals is a drug development company that provides strategic risk analysis, drug development, and market analysis services to pharmaceutical and biotechnology firms. Rosa&#8217;s unique Predictive Risk Management(tm) methodology combines scientific, clinical, financial, and market modeling expertise with powerful quantitative methods to reduce costs, optimize development, and maximize value. Rosa advisory services include trial design, dose-response simulation, strategic program planning, due-diligence evaluation, dynamic market analysis, and pipeline prioritization. As a clinical development partner, Rosa provides leadership and execution services from preclinical studies and proof-of-concept trials to late clinical stages.</p>\n\n<p>Before co-founding Rosa Pharmaceuticals, Dr. Holtzman co-founded and was chairman, president, and CEO of Entelos, Inc. [www.entelos.com], the world leader in biosimulation for in silico drug discovery and development. Before Entelos, he was a partner of Strategic Decisions Group (SDG), an international management consultancy, and has worked extensively with pharmaceutical and health care companies. He led SDG&#8217;s biosimulation practice, which identified novel therapeutic and diagnostic targets, optimized clinical program designs, and supported regulatory submissions. He\nalso led the design and development of R&amp;D Decision Advisor(r), an intelligent decision system (IDS), which has been applied to R&amp;D portfolio management by major corporations worldwide. He directed several other IDS efforts in such areas as infertile patient treatment, critical-care patient treatment, pharmaceutical development, and plant management. His IDS work is the subject of his book, Intelligent Decision Systems, published by Addison-Wesley Publishing Co. Dr. Holtzman is a consulting associate professor in Management Science and Engineering at Stanford University, where he teaches and directs research in business decision analysis, medical decision analysis, and decision systems. </p>\n\n<p>He received a doctorate in decision analysis from the EES (now MS&amp;E) department at Stanford University and holds degrees in electrical engineering and computer science from the Massachusetts Institute of Technology. </p>\n\n<p>Degrees\nS.B. MIT - Electrical Engineering and Computer Science\nS.M. MIT - Electrical Engineering and Computer Science\nE.E. MIT - Electrical Engineering and Computer Science\nM.S. Stanford - Engineering-Economic Systems\nPh.D. Stanford - Engineering-Economic Systems</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Stanford Professor, Advisor to Ayax","firm":{"name":"Ayax Systems","permalink":"ayax-systems","type_of_entity":"company","image":{"available_sizes":[[[150,68],"assets/images/resized/0004/2787/42787v2-max-150x150.jpg"],[[250,114],"assets/images/resized/0004/2787/42787v2-max-250x250.jpg"],[[450,205],"assets/images/resized/0004/2787/42787v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}