{"first_name":"Samuel","last_name":"D. Sousa","permalink":"samuel-d-sousa","crunchbase_url":"http://www.crunchbase.com/person/samuel-d-sousa","homepage_url":"","birthplace":"Montreal","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"StreamTheWorld","born_year":null,"born_month":null,"born_day":null,"tag_list":"streamtheworld-cirque-soleil-specialist-technology","alias_list":null,"created_at":"Mon Apr 19 21:36:24 UTC 2010","updated_at":"Sat Feb 18 22:31:16 UTC 2012","overview":"<p>Samuel D. Sousa, possesses a unique background in media, IT, and live entertainment that has served him well at StreamTheWorld, where he joined in 2006.</p>\n\n<p>As production manager, he was responsible for the product and project management efforts of StreamTheWorld&#8217;s development team during the initial years of the company. </p>\n\n<p>As Senior Solutions Specialist, Mr. Sousa continues to be active on two fronts. He provides technical expertise to support the new business development effort, working with StreamTheWorld&#8217;s sales team to make sure its solutions satisfy the technical requirements of both clients and the company. In addition, he continues to assist in the strategic development of the business by playing a hands-on role in various key projects.</p>\n\n<p>After the acquisition of StreamTheWorld by the Triton Media Group, StreamTheWorld and other properties where merged to form Triton Digital. Mr Sousa continues to provide his technical and strategic expertise within the Triton Digital group.</p>\n\n<p>Prior to joining StreamTheWorld (Triton Digital) , Mr. Sousa spent seven years with world-renowned Cirque du Soleil. As Projects and Infrastructure Architect, he supervised technological implementation of IT efforts for live entertainment shows including the popular Love and Delirium. While his Cirque experience may not have taken him into the Grand Chapiteau, he helped create the organization&#8217;s touring infrastructures and gained understanding of marketing, human resources, and publicity activities.</p>\n\n<p>Mr. Sousa, who began his career as a technology consultant, systems administrator, and programmer, speaks fluent English, French, and Portuguese, and is conversant in two other languages</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0008/4189/84189v2-max-150x150.jpg"],[[165,250],"assets/images/resized/0008/4189/84189v2-max-250x250.jpg"],[[200,302],"assets/images/resized/0008/4189/84189v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Senior Solutions Specialist","firm":{"name":"StreamTheWorld","permalink":"streamtheworld","type_of_entity":"company","image":{"available_sizes":[[[150,28],"assets/images/resized/0005/9520/59520v2-max-150x150.jpg"],[[200,38],"assets/images/resized/0005/9520/59520v2-max-250x250.jpg"],[[200,38],"assets/images/resized/0005/9520/59520v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://ca.linkedin.com/in/samuelsousa","title":"LinkedIn Profile"},{"external_url":"http://www.twitter.com/samsousa","title":"Twitter"}]}