{"first_name":"Samuel","last_name":"Stewart","permalink":"samuel-stewart","crunchbase_url":"http://www.crunchbase.com/person/samuel-stewart","homepage_url":"http://www.ifcmarkets.com","birthplace":"london","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1983,"born_month":11,"born_day":17,"tag_list":"forex-services, trading-frome-home, money-market-trading, trading-techniques, forex-market-analysis, global-market, forex-economic-calendar, online-gold-trading, web-trading, forex-investment, global-forex, forx-analysis, trade-xauusd, trade-eurusd","alias_list":null,"created_at":"Fri Nov 23 08:21:08 UTC 2012","updated_at":"Sun Nov 25 01:13:00 UTC 2012","overview":"<p>IFCM Group is a group of сompanies which activity is involved in development and implementation of various projects in the field of financial technologies.</p>\n\n<p>The activity of the IFCM Group conforms to international brokerage and financial services legislation.</p>\n\n<p>The IFCM Group consists of:\nIFC Markets Corp.\nIFC Markets Corp. is incorporated in British Virgin Islands under the registration number 669838. \nIFC Markets Corp. offers brokerage services to clients of IFCM Group dealing in financial instruments trading at the World&#8217;s most important established market places and beyond using trading-analytical platforms NetTradeX and MetaTrader 4.\nIFC Markets Corp. is a licensee of a new generation trading platform NetTradeX.</p>\n\n<p>I Securities Global Ltd.\nI Securities Global Ltd. is incorporated in British Virgin Islands under the registration number 1530297. \nI-Securities Global Ltd. is a licensee of the MetaTrader 4 trading platform.</p>\n\n<p>IFCM Consulting Limited\nIFCM Consulting Limited is incorporated in Gibraltar under the registration number 96763. \nIFCM Consulting is the IFCM Group’s promotion and marketing Company.\nThe main distinctive feature of the IFCM Group is trading in a new generation trading platform NetTradeX from the NetTradeX company.</p>\n\n<p>IFCM Group sees its main aim in providing its customers with services of the highest level which most distinctive characteristics are the following:\nrequest-free trading (straight from the screen) regardless of the trading amount,\ninstant execution,\nlow spreads,\nno commission,\nonline account opening withing several minutes from anywhere in the World,\n24 hours technical support.\nIFCM Group is focused on cooperation with a large number of Introducing Brokers in many countries of the World. Our IB programme offers our partners the most competitive commission rates in the Industry.</p>","image":{"available_sizes":[[[150,62],"assets/images/resized/0022/1788/221788v2-max-150x150.png"],[[205,86],"assets/images/resized/0022/1788/221788v2-max-250x250.png"],[[205,86],"assets/images/resized/0022/1788/221788v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.ifcmarkets.com","title":"IFC Markets Corp | Forex Broker Services"}],"web_presences":[]}