{"first_name":"Sam","last_name":"Mizrahi","permalink":"samy-mizrahi","crunchbase_url":"http://www.crunchbase.com/person/samy-mizrahi","homepage_url":"https://www.linkedin.com/profile/edit?trk=hb_tab_pro_top","birthplace":"Israel","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Apr 21 02:15:43 UTC 2011","updated_at":"Wed Jul 04 18:09:03 UTC 2012","overview":"<p>Mr. Mizrahi is a seasoned executive and an entrepreneur who has been involved in business management for the past 18 years. During his career Mr. Mizrahi launched and managed several companies. As an entrepreneur, he established an international distribution firm which was sold several years later. As co-founder of a business consulting firm, he assisted start-up as well as early growth companies with business management, capital raising, strategic planning, marketing and operations.  As an operations executive, he led the setup and operations of several private companies one of which he assisted in taking public.  Mr. Mizrahi also served as an adjunct faculty member at a private college teaching Economics, Business, Accounting and Law. He is fluent in French and Hebrew, and in his spare time enjoys golf, music and motion pictures. \n    Mr. Mizrahi holds a Juris Doctorate (J.D.) from Whittier Law School, a Master of Business Administration (M.B.A) from the Cox School of Business at Southern Methodist University and a Bachelor of Science (B.S.) in Business Administration with emphasis in Management and Accounting from the Marshall School Business at the University of Southern California.  </p>","image":null,"degrees":[{"degree_type":"B.Sc.","subject":"Business Administration","institution":"University of Southern California, Marshall School of Business","graduated_year":1992,"graduated_month":null,"graduated_day":null},{"degree_type":"J.D","subject":"Law","institution":"Whittier College, School of Law","graduated_year":2003,"graduated_month":null,"graduated_day":null},{"degree_type":"M.B.A","subject":"Business Administration","institution":"Southern Methodist University, COX School of Business","graduated_year":2010,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}