{"first_name":"Sandip","last_name":"Gupta","permalink":"sandip-gupta-2","crunchbase_url":"http://www.crunchbase.com/person/sandip-gupta-2","homepage_url":"http://www.linkedin.com/in/sandipgupta","birthplace":"india","twitter_username":"sandipgupta1","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1966,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jan 20 07:14:37 UTC 2011","updated_at":"Tue Feb 01 23:01:29 UTC 2011","overview":"<p>Sandip is a results driven senior executive with 20 years of experience managing and growing global IT infrastructure product and service businesses. Over the last 10 years Sandip has led companies in the Data Center Virtualization, Automation and Operations space. In various roles, Sandip has demonstrated to be a decisive and passionate leader with expertise in delivering short-terms results while driving long-term objectives. </p>\n\n<ul>\n<li>Well rounded executive with skill set spanning various CEO, President and VP level operating and corporate development roles in companies with 15M+ in yearly revenue with 50-100% Y/Y growth. </li>\n<li>Trustworthy leader with ability to attract and retain strong team members in a distributed organization of 200 people </li>\n<li>Creative deal-maker that can identify, negotiate and maintain long-term key revenue-generating strategic partnerships and contractual customer relationships in 30+ countries across the globe </li>\n<li>Astute financier with strong understanding of start-up related fund raising ($85M) and cross-border M&amp;A transactions </li>\n<li>Technology savvy individual with keen sense of using technology to create business value in telecommunication, entertainment, retail, financial services, health services and pharmaceutical industries </li>\n</ul>\n\n<p>Mr. Gupta holds an MBA from the Stern School of Business at New York University, New York, NY. He also has a Bachelor&#8217;s degree with Honors in Mechanical Engineering from the MNR National Institute of Technology, Allahabad, India.</p>\n\n<p>Sandip has been a regular speaker at various industry conferences and meetings.</p>\n\n<p>Sandip is an avid hiker and regular soccer player. He is an YPO member in the SF bay area, a TiE charter member and a chair for the TiE CEO forum. </p>\n\n<p>SpecialtiesCEO and VP level Operating and Corporate Development roles in global IT infrastructure/Data Center product and service companies</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0011/8166/118166v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0011/8166/118166v2-max-250x250.jpg"],[[298,450],"assets/images/resized/0011/8166/118166v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}