{"first_name":"Sandy","last_name":"Miller","permalink":"sandy-miller","crunchbase_url":"http://www.crunchbase.com/person/sandy-miller","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Aug 15 05:29:06 UTC 2008","updated_at":"Mon Jun 15 12:54:49 UTC 2009","overview":"<p>Sandy Miller joined Institutional Venture Partners (IVP) in April 2006. He focuses on later-stage venture and growth equity investments in technology companies. Sandy has more than 25 years of venture capital and investment banking experience and has served on over 20 public, private and philanthropic boards. Sandy was recognized by Forbes Magazine as one of the top 100 venture capitalists in the world by inclusion in the 2007, 2008 and 2009 Midas List.</p>\n\n<p>Sandy has led investments in Constant Contact (CTCT), Data Domain (DDUP), Handango, LiveOps, Merchant e-Solutions, Placeware, SkyStream Networks, Swissray, US Internetworking, Vonage (VG), and Zynga. He has also been actively involved with the firm&#8217;s investments in Cortina Systems and RGB Networks. Sandy is Chairman of Handango and a director of Swissray and Vonage (VG).</p>\n\n<p>Prior to IVP, Sandy was a Senior Partner with 3i, a leading global venture capital firm. He established and managed 3i’s later-stage technology investing business in the United States.</p>\n\n<p>Earlier in his career, Sandy was a leading technology investment banker. Sandy co-founded Thomas Weisel Partners (TWPG), where he was a member of the Executive Committee, Chief Administrative and Strategic Officer, and Co-Director of Investment Banking. He was also a Senior Partner at Montgomery Securities and led the technology and healthcare groups. Prior to Montgomery, Sandy was a Managing Director and opened technology investment banking offices in San Francisco for Merrill Lynch and Donaldson, Lufkin &amp; Jenrette. Sandy was also a Manager of strategy consulting at Bain &amp; Company and a securities lawyer at Pillsbury Winthrop. </p>","image":{"available_sizes":[[[124,111],"assets/images/resized/0004/8568/48568v1-max-150x150.jpg"],[[124,111],"assets/images/resized/0004/8568/48568v1-max-250x250.jpg"],[[124,111],"assets/images/resized/0004/8568/48568v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.A.","subject":"","institution":"University of Virginia","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Institutional Venture Partners","permalink":"institutional-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,68],"assets/images/resized/0001/5065/15065v3-max-150x150.jpg"],[[250,113],"assets/images/resized/0001/5065/15065v3-max-250x250.jpg"],[[450,204],"assets/images/resized/0001/5065/15065v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}