{"first_name":"Sanj","last_name":"K. Patel","permalink":"sanj-k-patel","crunchbase_url":"http://www.crunchbase.com/person/sanj-k-patel","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Mar 22 08:39:19 UTC 2011","updated_at":"Tue Mar 22 08:41:12 UTC 2011","overview":"<p>Sanj Patel was appointed President and Chief Executive Officer and to the Company&#8217;s Board of Directors in June 2008. Sanj brings 20 years of experience in the pharmaceutical and biotech industries. He joins Synageva from Genzyme Corporation (1999 to 2008) where most recently he was Head of US Sales, Marketing and Commercial Operations for Genzyme Therapeutics and led the US launch for Myozyme®. Previously, Sanj held several cross-functional senior leadership roles at Genzyme including Vice President, Clinical Research and Head of the Global Clinical Research Operations Council. He was responsible for clinical operations and development for all cross-business Genzyme products and was instrumental in the path to commercialization for several treatments. Notably, Sanj led the Fabrazyme® clinical operations team and development program to FDA approval in April 2003. Prior to Genzyme, Sanj held roles in clinical research and commercial development with increasing levels of responsibility at Burroughs Wellcome, Hoechst Marrion Roussel and Fujisawa Pharmaceuticals. Sanj obtained his BSc with Honors in Pure and Applied Biotechnology from South Bank University, London. He attained his post-graduate management and business degree from Ealing College, London, and completed his Doctorate program in Clinical Pharmacology from King&#8217;s College and The Wellcome Foundation.</p>","image":null,"degrees":[{"degree_type":"BSc ","subject":"","institution":"South Bank University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President & Chief Executive Officer","firm":{"name":"Synageva BioPharma","permalink":"synageva","type_of_entity":"company","image":{"available_sizes":[[[150,54],"assets/images/resized/0004/1377/41377v1-max-150x150.png"],[[203,74],"assets/images/resized/0004/1377/41377v1-max-250x250.png"],[[203,74],"assets/images/resized/0004/1377/41377v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}