{"first_name":"Sanjeev","last_name":"Sharma","permalink":"sanjeev-sharma","crunchbase_url":"http://www.crunchbase.com/person/sanjeev-sharma","homepage_url":"http://www.geminiinternationals.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"bags-accessories, bags-accessories-items, buckles-accessories-supplier, pullers-accessories-manufacturer, hooks-accessories","alias_list":null,"created_at":"Tue Apr 17 10:42:28 UTC 2012","updated_at":"Sun Apr 22 07:22:57 UTC 2012","overview":"<p>Gemini International</p>\n\n<p>Strategically established in the year 1994, Gemini International is a widely popular and preferred manufacturer, supplier, and exporter of an extensive range of India. Gemini International is well-equipped with highly qualified professionals, highly skilled and experienced personnel, sophisticated machineries of the modern technology, diverse processing machineries, and a highly considerate and scrupulous Customer Care and Prompt &amp; Punctual Delivery Services to any region of India and the world.</p>\n\n<p>As regards to quality, our organization does not compromise with the quality of the products. Our highly experienced supervisors do stringent quality checks, which ensure that all products meet the relevant international standards. We use sophisticated testing methods to make sure that only the best of our products reach the clients. We have a team of quality auditors who keep a close check on the whole manufacturing process right from the procurement of the raw material till the final dispatch of the finished accessories.</p>\n\n<p>We offer a wide range of fashionable garment accessories to the customers as per their tastes and specific requirements. Our team of expert craftsmen, designers, and other supporting personnel enable us to finely blend quality and perfection in our fashion accessories featuring both modern and traditional designs in our assortment of buckles, zippers and hooks and other such allied accessories. </p>\n\n<p>Telephone:+(91)-(571)-2505594 </p>","image":{"available_sizes":[[[125,125],"assets/images/resized/0018/4615/184615v2-max-150x150.jpg"],[[125,125],"assets/images/resized/0018/4615/184615v2-max-250x250.jpg"],[[125,125],"assets/images/resized/0018/4615/184615v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}