{"first_name":"Sanj","last_name":"Goyle","permalink":"sanj-goyle","crunchbase_url":"http://www.crunchbase.com/person/sanj-goyle","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jun 20 17:19:09 UTC 2012","updated_at":"Wed Jun 20 17:19:51 UTC 2012","overview":"<p>Sanj Goyle is the co-founder and CEO of BancBox, the first API driven approach to enabling banking services for non-financial institutions.In his leadership role, Sanj is focused on driving forward the product vision of BancBox as a compelling solution for fintech clients, maintaining the trust of our partner banks, and ensuring that BancBox remains a good financial steward of consumer funds and up to date on the current regulatory environment.Prior to BancBox, Sanj spent several years in Online Marketing focusing on Lead Generation and Offer Optimization. Sanj was most recently at Yahoo, where he led the performance marketing team that developed and operated Yahoo&#8217;s first Cost-per-Lead (CPL) line of business. The Yahoo CPL team launched multiple products (namely, Yahoo Tagline in Yahoo Mail, Yahoo Cross Sell in Yahoo Games, and CPL ad units in Yahoo Messenger). Prior to Yahoo, Sanj managed the consumer finance lead generation lines of business at Adteractive and Nextag. At Adteractive, Sanj managed a 20-person team that generated over $40m in annual revenue and managed ad spend of over $1m per month in online and offline channels. While at Nextag, lead gen revenue grew from inception to over $25m within 2 years. Sanj has spoken at industry conferences such as LeadsCon and Affiliate Summit.Sanj started his career as a corporate attorney specializing in Corporate Securities, M&amp;A, and Privacy. Sanj has considerable experience with the privacy and legal issues related to the marketing of consumer finance products— in particular, FTC TSR and Disclosure Guidelines, Gramm-Leach-Bliley and PCI compliance. Sanj is admitted to practice in California and New York, is a licensed real estate broker in California, and is a Certified Information Privacy Professional (CIPP). Sanj graduated from Boston University School of Law (magna cum laude) and Duke University. He currently resides in Menlo Park, CA.</p>","image":{"available_sizes":[[[134,137],"assets/images/resized/0019/6436/196436v1-max-150x150.png"],[[134,137],"assets/images/resized/0019/6436/196436v1-max-250x250.png"],[[134,137],"assets/images/resized/0019/6436/196436v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"BancBox","permalink":"bancbox","type_of_entity":"company","image":{"available_sizes":[[[150,83],"assets/images/resized/0019/6435/196435v2-max-150x150.png"],[[161,90],"assets/images/resized/0019/6435/196435v2-max-250x250.png"],[[161,90],"assets/images/resized/0019/6435/196435v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}