{"first_name":"Sarah","last_name":"Kling","permalink":"sarah-kling-2","crunchbase_url":"http://www.crunchbase.com/person/sarah-kling-2","homepage_url":"http://www.uevision.com","birthplace":"Milwaukee, Wisconsin","twitter_username":"uevision","blog_url":"http://uevision.wordpress.com","blog_feed_url":"","affiliation_name":"UEVision, Inc.","born_year":1971,"born_month":2,"born_day":8,"tag_list":"user-experience, ui-design, usability, ux-design, information-architecture, interaction-design","alias_list":null,"created_at":"Tue Jun 01 19:42:21 UTC 2010","updated_at":"Tue Jun 01 22:37:26 UTC 2010","overview":"<p>Sarah Kling is CEO of UEVision. With 14 years of experience designing software systems, websites, and web applications, Sarah is a leading authority on designing and delivering the perfect product user experience. Prior to founding UEVision, Sarah served as user experience consultant, usability evangelist, and  user experience team leader for a number of B2B and B2C companies. She founded UEVision in 2005 to enable her team to bring world-class user experience strategy and designs to many different organizations and their products, resulting in happier customers, more profitable products, and reduced support costs. </p>\n\n<p>UEVision&#8217;s clients have included Oracle, Fujitsu, Blue Shield of California, LeapFrog Enterprises, E*TRADE Financial, SugarCRM, Taleo, Groupon, Visa, and Saba Software, as well as many small and mid-sized companies.</p>\n\n<p>Sarah specializes in designing a world-class user experience by adapting user-focused design practices to the specific requirements of websites, web applications, mobile applications, and software systems and the needs of their users. She has built user experience teams and re-engineered user experience and usability processes for many organizations, and as a result, has led a variety of successful initiatives to integrate usability &#8220;best practices&#8221; with the product development process to produce enterprise products that are practical, efficient, visually appealing, and highly usable.</p>\n\n<p>Sarah holds an A.B. from Stanford University and has studied usability and human factors at the University of California and U.C.-Santa Cruz. She is a member of the Association for Computing Machinery (ACM), the Usability Professionals Association (UPA), and the Bay Area special interest group in user interface (BayCHI).  </p>","image":null,"degrees":[{"degree_type":"AB","subject":"International Relations","institution":"Stanford University","graduated_year":1993,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.youtube.com/watch?v=njqATwwAfuA","title":"UEVision Celebrates World Usability Day 2009"}],"web_presences":[{"external_url":"http://www.uevision.com","title":"UEVision, Inc. Website"},{"external_url":"http://uevision.wordpress.com","title":"UEVision Blog"},{"external_url":"http://www.linkedin.com/in/sarahkling","title":"LinkedIn"},{"external_url":"http://uevision.twitter.com","title":"Twitter"}]}