{"first_name":"Sarath","last_name":"Raj","permalink":"sarath-raj","crunchbase_url":"http://www.crunchbase.com/person/sarath-raj","homepage_url":"http://www.pixelperfx.com","birthplace":"Thrissur","twitter_username":null,"blog_url":"http://sarathraj.blogspot.com","blog_feed_url":"","affiliation_name":"Aztecsoft","born_year":1983,"born_month":5,"born_day":6,"tag_list":"film-maker, creative-director, animator","alias_list":null,"created_at":"Tue Apr 21 07:19:19 UTC 2009","updated_at":"Mon Apr 27 03:51:13 UTC 2009","overview":"<p>The trail of footprints I have imprinted on the sands of time foresees a path to lead me towards a destination no one has ever reached. As I recall upon my enchanting childhood days amidst the green pastures of my hometown, I smile to realize I have walked through a journey that’s been nothing short of an adventure. Ever since, I have known that I would to be like none other than what my mind has constantly inspired me to be. Very often, crystal clear images of my budding vision flash across my eyes to recollect those days that induced in me the passion for creativity. The surrounding ambience I lived in instilled the ingenuity I see in myself today.</p>\n\n<p>The nature I lived with so closely aroused the interests of photography, the films I watched in my young days stimulated my love for drama, and art in every form provoked me to create magic with my hidden skills in every possible way. These are those unforgettable days of my life that have prompted me to so desperately and passionately seek what I have always seen myself to be….A man of ingenious substance. There has been no looking back ever since.</p>\n\n<p>I acknowledge having encountered some demanding and challenging phases of life as well, however I am pleased that it could not have been a better learning experience. But most importantly, the journey has just begun.</p>\n\n<p>Time has been the best teacher. Every enterprise I have been a part of and every venture I undertook reflected distinct sparks of craft and technological attributes, cultivating which I embarked my journey towards my objective. Technologies be it, contemporary or conventional have had a profound influence in my insights of creative expression. Moreso, there has always been a constant urge in me to acquire novel technological advancements to evolve my representation of art. It is this teaching that enables the manifestation of my thoughts in an appreciative form.</p>\n\n<p>Through Pixelperfx™, I intend to revolutionize and redefine the world of fine arts, graphics and motion picture. It is a fantastic cosmos of a visionary and imaginative world I want to create. This is my medium to transmit the flair of technological artistry through the aesthetic channels of innovative brilliance and proficiency.</p>","image":null,"degrees":[{"degree_type":"Bachelors","subject":"Animation","institution":"Manipal University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Creative Artist/Designer","firm":{"name":"Aztecsoft","permalink":"aztecsoft","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0003/1309/31309v1-max-150x150.png"],[[237,72],"assets/images/resized/0003/1309/31309v1-max-250x250.png"],[[237,72],"assets/images/resized/0003/1309/31309v1-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Web & Flash Designer","firm":{"name":"Gloria Multimedia","permalink":"gloria-multimedia","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.pixelperfx.com/pixelperfx_aboutus.html","title":""}],"web_presences":[{"external_url":"http://www.linkedin.com/in/sarathraj","title":""}]}