{"first_name":"Sarah","last_name":"Bird","permalink":"sarah-bird-2","crunchbase_url":"http://www.crunchbase.com/person/sarah-bird-2","homepage_url":"http://www.fucase.com/","birthplace":"San Diego","twitter_username":"fucase","blog_url":"http://www.fucase.com/","blog_feed_url":"http://fucase.com/blog/","affiliation_name":"Unaffiliated","born_year":1982,"born_month":8,"born_day":26,"tag_list":"","alias_list":null,"created_at":"Sun Dec 04 14:52:52 UTC 2011","updated_at":"Thu Dec 08 17:24:05 UTC 2011","overview":"<p>Are you in love with the little gadgets you own? If yes, then here’s where you have a chance to take your gadget love to the next level. We are not just retailers of Smartphones &amp; Tablet Accessories but gadget lovers just like you; someone who is always looking to get more out of the priced gadgets we own.</p>\n\n<p>At Fucase, you will find finest quality of accessories for your favorite electronic gadgets including finest quality of safety cases, covers and other utility add-ons for your tablets and smart phones. At Fucase, you can dress up your iPad, iPhones, Blackberries and others for safety and style. Shop for latest and most amazing protective Covers, Cases for leading brands in Smart Phones and tablets like Apple, Blackberry, Samsung, HTC etc.</p>\n\n<p>Fucase offers something for everyone. Fucase Tablet &amp; Smart Phone accessories are dressing up the gadgets of teenagers, students, executives etc. From the shopper looking for fun novelty printed iPhone cases to the shopper who enjoys the simplicity of leather cases for his/her new iPad.</p>\n\n<p>While you will find our collection inexpensive, Fucase guarantees that every single product featured at Fucase.com is of finest of quality.</p>\n\n<p>Fucase is your online one stop store for fabulous Tablet and Mobile Phone Accessories.</p>","image":{"available_sizes":[[[150,78],"assets/images/resized/0016/5079/165079v2-max-150x150.jpg"],[[250,130],"assets/images/resized/0016/5079/165079v2-max-250x250.jpg"],[[450,234],"assets/images/resized/0016/5079/165079v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}