{"first_name":"Sara","last_name":"Hlunty","permalink":"sara-hlunty","crunchbase_url":"http://www.crunchbase.com/person/sara-hlunty","homepage_url":"http://www.vacanciesengineering.com/","birthplace":"Pasadena, CA","twitter_username":"VacanciesEng","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1979,"born_month":1,"born_day":1,"tag_list":"engineering-jobs","alias_list":null,"created_at":"Wed Jun 20 08:42:54 UTC 2012","updated_at":"Fri Jun 22 16:56:35 UTC 2012","overview":"<p>The World&#8217;s Premier Engineering Jobs Job Aggregation Service</p>\n\n<p>Headquartered in Pasadena, California, with offices throughout the world, Vacanciesengineering.com locates and classifies engineering jobs from every source it can find and provides its highly specialized research to job seekers, recruiters, and other job sites throughout America.</p>\n\n<p>Vacanciesengineering.com is the world leader in &#8220;pure&#8221; monitoring and reporting of engineering jobs, through its active and growing research into all employers throughout the world. We take no money from employers or advertisers, so our research results remain &#8220;pure&#8221; and uninfluenced by others.</p>\n\n<p>Vacanciesengineering.com serves job seekers, recruiting firms, university career service offices, unemployment offices, and outplacement firms, bringing engineering job opening research, employer information, and more to Vacanciesengineering.com&#8217;s clients.</p>\n\n<p>Vacanciesengineering.com is a company owned by Employment Research Institute, one of the world&#8217;s largest conglomerates of job search-related companies. Being in this industry for more than 10 years, we have developed the most extensive database of engineering jobs in the US and across the world. Employment Research Institute strives to build meaningful relationships with its clients and guide them during the college, post-graduate, entry-level, and veteran years of their careers.</p>\n\n<p>Vacanciesengineering.com has been exceptionally effective at what it does, consistently increasing the number of engineering jobs on its site year after year, even in down economies. The sole purpose of Vacanciesengineering.com and Employment Research Institute is to assist all engineering professionals with finding the most satisfying careers that suit their interests and ambitions. So take this step and find your perfect job. Let Vacanciesengineering.com put you in touch with opportunities of your choice. </p>","image":{"available_sizes":[[[32,27],"assets/images/resized/0019/6335/196335v2-max-150x150.jpg"],[[32,27],"assets/images/resized/0019/6335/196335v2-max-250x250.jpg"],[[32,27],"assets/images/resized/0019/6335/196335v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.vacanciesengineering.com/","title":"Engineering Jobs"}],"web_presences":[{"external_url":"http://www.vacanciesengineering.com/","title":"Engineering Jobs"}]}