{"first_name":"Sarah","last_name":"Gosler","permalink":"sarah-gosler","crunchbase_url":"http://www.crunchbase.com/person/sarah-gosler","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Mouthweight","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Aug 12 19:50:13 UTC 2010","updated_at":"Sun Mar 06 01:15:48 UTC 2011","overview":"<p>Ms. Gosler is the Director of Marketing for IFG Capital. She has focused her career primarily in the real estate development industry. Prior to joining IFG, she was the Director of Marketing and Operations for Lautman Economic Architecture (LEA) and the Interim Executive Director for the Community Economics Lab (CELab), a 501c3 dedicated to promoting economic development through grant funding in rural and low-income areas within New Mexico and surrounding states. </p>\n\n<p>Prior to LEA, she was responsible for pioneering the first strategic marketing business unit at Dekker/Perich/Sabatini Architecture (DPS). She was also a Founding Executive Member of the New Mexico Chapter of the Urban Land Institute focused on the responsible use of land in creating and sustaining thriving communities worldwide.\nMs. Gosler previously worked with the Director of Microsystems and Engineering Sciences at Sandia National Laboratories transitioning the technical organization into a more business centric operation servicing a varied number of organizations, including National Laboratories and the Department of Energy.</p>\n\n<p>She earned a Bachelors of Business Administration (BBA) in Entrepreneurial Studies and Marketing, graduating Summa Cum Laude from the University of New Mexico. Sarah also received an MBA from the Anderson School of Management with a dual degree focus in Marketing and Operational Studies.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0009/7403/97403v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0009/7403/97403v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0009/7403/97403v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}