{"first_name":"Sashi","last_name":"Chimala","permalink":"sashi-chimala","crunchbase_url":"http://www.crunchbase.com/person/sashi-chimala","homepage_url":"","birthplace":"","twitter_username":"chimala","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"chimala, sashi, paypod, knibble, exp-rs","alias_list":null,"created_at":"Sun Jul 31 15:10:18 UTC 2011","updated_at":"Tue Aug 02 00:33:57 UTC 2011","overview":"<p>Sashi Chimala is a serial entrepreneur with three successful technology startups in US and two consumer retail startups in India. He was part of the founding team of Covansys (NASD: CVNS, sold to CSC). He then founded Indigo Technologies, which was sold in a two-way joint venture of SSI Ltd. and NASDAQ. </p>\n\n<p>Sashi&#8217;s other ventures include PayPod.com, a highly scalable AdServer and AdNetwork solution targeted towards ethnic online consumers. PayPod was merged with EthnicOnlineNetwork.com, a digital ad network owned by MediaMorphosis Inc. With offices in US, India and UK, EON is a leader in helping brands reach South Asian online consumers worldwide.</p>\n\n<p>Sashi also founded Knibble.com, one of the largest aggregator of online casual games with over 10,000 games. Knibble was one of the earliest pioneers in bringing casual games to iPhone and Nintendo Wii. Knibble.com was acquired in December 2007 by FX Labs Limited, one of the largest game development studios in Asia.</p>\n\n<p>As the Founder of Qwiky&#8217;s Coffee and creator of JavaGreen (A joint venture with Reliance), Sashi was hailed by press and media in India as a pioneer in organized retail in India. </p>\n\n<p>Sashi is well recognized for his extraordinary ability for consumer brand creation, innovative marketing and promotion. Sashi has been featured on Fox TV, CNN, CNBC, BBC and many TV stations and news papers worldwide. Sashi also appeared on  the covers of Business World and Business Today magazines.</p>","image":{"available_sizes":[[[97,150],"assets/images/resized/0014/7120/147120v2-max-150x150.jpg"],[[163,250],"assets/images/resized/0014/7120/147120v2-max-250x250.jpg"],[[293,450],"assets/images/resized/0014/7120/147120v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}