{"first_name":"Sasha","last_name":"Madfes","permalink":"sasha-madfes","crunchbase_url":"http://www.crunchbase.com/person/sasha-madfes","homepage_url":"http://www.sashamadfes.com","birthplace":"San Francisco, CA","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1974,"born_month":1,"born_day":16,"tag_list":"sasha-madfes, resume-salesforce-admin-salesforce-com-admin-san-francisco-sasha-k-madfes-sasha-kate-madfes-sasha-madfes-sashakatemadfes-sashamadfes-sfdc","alias_list":null,"created_at":"Thu Jun 10 08:00:34 UTC 2010","updated_at":"Sat Feb 19 01:54:33 UTC 2011","overview":"<p>San Francisco, CA &#8211; Sasha Madfes has over 10 years of proven success in identifying opportunities to increase efficiencies through the optimization of department processes while coordinating assignments, motivating team members, and supervising staff at B2B focused Web 2.0 technology and New Media companies.</p>\n\n<p>Madfes quickly identifies meaningful relevant patterns and considers issues strategically from a business perspective in an effort to achieve targeted and measurable results. She manipulates and analyzes large volumes of data with a high level of accuracy and creates reports so informed business decisions are possible. </p>\n\n<p>Another strength of hers is her ability to examine complex situations and develop innovative, effective, and repeatable processes to simplify them.  Madfes successfully maintains an emphasis on customer satisfaction while establishing and evaluating department policies and operational procedures in workforce analyst and performance management capacities.</p>\n\n<p>She has become knowledgeable in the principles and processes for providing customer service, including needs assessment, meeting quality standards, and evaluation of customer satisfaction.  She is adept at developing and deploying effective service delivery, call center, and quality control strategies.</p>\n\n<p>In addition, she has both an ability to understand and appreciate business and management principles involved in strategic planning, resource allocation, human resources modeling, leadership technique, production methods, and coordination of staff.</p>\n\n<p>Her depth of experience in supporting sales efforts has covered performing competitive research, lead generation, lead nurturing, and management of the revenue cycle and sales pipeline.</p>\n\n<p>In most recent months she has worked with current web technologies, web services, and enterprise software and is familiar with interactive dashboards used by online publishers, advertisers, and in e-commerce to analyze key metrics and develop solutions to reduce barriers and increase conversion rates. In her personal time she maintains active independent relationships with affiliate marketing services in a Publisher role for domains she privately owns.</p>\n\n<p>A strong analytical thinker. \nA resourceful investigator.\nA dynamic manager.\nA data junkie.\nA true asset.</p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0009/0095/90095v2-max-150x150.jpg"],[[187,250],"assets/images/resized/0009/0095/90095v2-max-250x250.jpg"],[[336,450],"assets/images/resized/0009/0095/90095v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor of Arts","subject":"Communication","institution":"San Diego State University","graduated_year":1996,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/sashamadfes","title":""},{"external_url":"http://resume.sashamadfes.com","title":""},{"external_url":"http://links.sashamadfes.com/details","title":""},{"external_url":"http://www.sashamadfes.com","title":""},{"external_url":"http://www.sashamadfes.com","title":""}]}