{"first_name":"Sashi","last_name":"Reddi","permalink":"sashi-reddi","crunchbase_url":"http://www.crunchbase.com/person/sashi-reddi","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"AppLabs","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 02 11:54:57 UTC 2009","updated_at":"Mon May 17 05:41:07 UTC 2010","overview":"<p>Sashi Reddi is the founder and executive chairman of AppLabs, the world&#8217;s largest software testing and quality management company. Since its founding in April 2001, Sashi has grown AppLabs from a 3 person outfit in a shared office space in Philadelphia to its current size of 2,000 employees in the US, UK, and India. </p>\n\n<p>A serial entrepreneur, Sashi has started two other companies prior to AppLabs. His first company was EZPower Systems, a developer of products for building and maintaining large-scale web applications. EZPower was acquired by DocuCorp and then eventually by Oracle. EZPower technology continues to be a part of Oracle’s document management offerings. Following EZPower, Sashi founded iCoop, a group purchasing dotcom company that went bust. He began his career consulting on technology and strategy to Fortune 500 companies in the travel, financial services, automotive and consumer packaged goods industries. </p>\n\n<p>Sashi is also the founder and chairman of FXLabs, a leading developer of high quality game products for PC&#8217;s, consoles, and online.</p>\n\n<p>Sashi received his BTech degree in Computer Science from the Indian Institute of Technology in Delhi. He went on to gain an MS in Computer Science from New York University and later a PhD from The Wharton School, University of Pennsylvania.</p>\n\n<p>Sashi serves on the advisory board of the Wharton Entrepreneurial Programs and is a charter member of TiE Hyderabad.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder and Executive Chairman","firm":{"name":"AppLabs","permalink":"applabs","type_of_entity":"company","image":{"available_sizes":[[[147,71],"assets/images/resized/0004/5894/45894v4-max-150x150.jpg"],[[147,71],"assets/images/resized/0004/5894/45894v4-max-250x250.jpg"],[[147,71],"assets/images/resized/0004/5894/45894v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}