{"first_name":"Satoshi","last_name":"Koike","permalink":"satoshi-koike","crunchbase_url":"http://www.crunchbase.com/person/satoshi-koike","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Nov 26 17:26:11 UTC 2008","updated_at":"Wed Nov 26 17:32:34 UTC 2008","overview":"<p>Satoshi Koike began working as an expatriate for a joint venture formed between Dentsu and General Electric in the early 1990’s, and worked in various job positions in the realm of IT, multimedia, and Internet projects in the United States. There he gained exposure to business investment in various Internet businesses as well as gaining experience in incubation and consulting services. Thereafter Satoshi took on the role of Vice President of iSi Dentsu of America Inc., before becoming CFO of the same company and CEO of Netyear Group, Inc. In 1998, Netyear Group, Inc. became an independent group through an MBO, and during the same year Satoshi was appointed as an external director. In 1999 the Netyear Group, Inc. was established as a corporation in Japan. In his career he has served in advisory committees of the Ministry of Economy, Trade and Industry, Ministry of Internal Affairs and Communications, and Cabinet Office, and he currently serves as a Tokyo Chamber of Commerce International Economics Committee Member and the Chairman of the Information Services Subcommittee （Shibuya Division）. In fiscal year 2007 Satoshi served as the Representative of the Japanese Group participating in the Japan, China, Korea Young Economist Summit. As his work experience demonstrates, Satoshi can leverage his vast experiences in the IT and investment industries in Japan, the United States and China to help our Group achieve even bigger successes in its various businesses.</p>","image":{"available_sizes":[[[143,150],"assets/images/resized/0002/9687/29687v1-max-150x150.jpg"],[[169,177],"assets/images/resized/0002/9687/29687v1-max-250x250.jpg"],[[169,177],"assets/images/resized/0002/9687/29687v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President & CEO","firm":{"name":"Netage Capital Partners","permalink":"netage-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,38],"assets/images/resized/0002/9685/29685v1-max-150x150.jpg"],[[160,41],"assets/images/resized/0002/9685/29685v1-max-250x250.jpg"],[[160,41],"assets/images/resized/0002/9685/29685v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}