{"first_name":"Scott","last_name":"Bogdan","permalink":"scott-bogdan","crunchbase_url":"http://www.crunchbase.com/person/scott-bogdan","homepage_url":"http://www.goldeditions.com","birthplace":"Redwood City, CA","twitter_username":"scottbogdan","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1975,"born_month":2,"born_day":14,"tag_list":"scott-bogdan","alias_list":null,"created_at":"Fri Dec 03 22:57:31 UTC 2010","updated_at":"Wed Apr 04 06:36:32 UTC 2012","overview":"<p>Scott M. Bogdan is a seasoned executive with a background in media technology and sports marketing.</p>\n\n<p>Along with his ability to build award winning organizations that drive shareholder value, he also provides an in-depth knowledge of emerging technology platforms. Scott has a long history in the development of market leading digital media management and delivery architecture.</p>\n\n<p>Mr. Bogdan was one of the founding executives at Brand Affinity Technologies (www.brandaffinity.net) which is a leading provider of affinity marketing and celebrity monetization solutions for advertisers, publishers, sports professionals, and celebrities. Scott joined BAT from Google where he managed the audio business and served as the Head of Media and Affiliate Operations. Prior to that Scott was a founding executive at dMarc which Google acquired in 2006 and also held senior management roles at United Online (NetZero, Juno, Classmates), Winfire, CMGi, and 2CAN Media.</p>\n\n<p>Currently Scott&#8217;s, firm aids early stage companies on their product and advertising strategy, operational structure, and launch process.</p>\n\n<p>Scott received his BS from the Leeds School of Business at the University of Colorado, Boulder in Information System and Entrepreneurship and also studied Electrical Engineering at the U.S. Air Force Academy where he played Division I Football. Scott currently resides in Orange County, CA with his wife and 3 children. </p>","image":{"available_sizes":[[[92,121],"assets/images/resized/0011/2801/112801v2-max-150x150.jpg"],[[92,121],"assets/images/resized/0011/2801/112801v2-max-250x250.jpg"],[[92,121],"assets/images/resized/0011/2801/112801v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Gold Editions, LLC","permalink":"gold-editions-llc","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/scottbogdan","title":"LinkedIn"},{"external_url":"http://twitter.com/#!/scottbogdan","title":"Twitter"},{"external_url":"http://www.facebook.com/Scott.M.Bogdan","title":"Facebook"}]}