{"first_name":"Scott","last_name":"Korman","permalink":"scott-korman","crunchbase_url":"http://www.crunchbase.com/person/scott-korman","homepage_url":"http://www.contactidm.com","birthplace":"Chicago, IL","twitter_username":"contactidm","blog_url":"","blog_feed_url":"","affiliation_name":"ContactIDM.com","born_year":1967,"born_month":4,"born_day":15,"tag_list":"forensic-technology-specialist-expert-witness-agency-design-firm-digital-agency-digital-marketing-firm-forensic-research-for-lawyers-forensic-expert-witness-for-attorneys-accountants-doctors-security-specialists","alias_list":null,"created_at":"Tue Nov 20 23:06:49 UTC 2012","updated_at":"Thu Nov 22 05:11:07 UTC 2012","overview":"<p>C. L. &#8220;Scott&#8221; Korman is graduate from the University of Chicago Law School with a focus on business &amp; how it interacts with law, marketing and social media engagement. Mr. Korman joined Interactive Design + Media (ContactIDM.com) in 2010 when the firm was under different ownership and a different brand name.  Prior to that Mr. Korman was based in Chicago working at the 3 major ad agencies downtown in their brand development and sustainment group.  His passion and forte have been with developing programs and campaigns that create and maintain interest for clients in an cost-effect, long-term and result-oriented manner.</p>\n\n<p>As an expert in Sweepstakes and Social media, Mr. Korman has brought to ContactIDM.com a diverse portfolio of expertise and experience.  For the last 2+ years, Scott has been furthering brand culture and leading the push to reinvent what an ad agency does for clients, how it operates and most-importantly how proper billing should take place for clients.  At ID+M, Scott has worked hand in hand with the CEO and the President of the agency to preserve the traditional advertising agency solutions from print to TV, Radio and Web commercials crossing over to the digital space which ID+M has dominated for over 15 years.</p>\n\n<p>Mr. Korman is open to contacts and consulting services for businesses of all sizes through ID+M and has established the brand consulting and forensic technology research department at ID+M for clients in need.</p>\n\n<p>Mr. Korman has pioneered a new trend of selling or licensing tech solution papers for what a specific business needs to do to grow, sustain and survive in this or any economy.  These Marketing Path documents have the execution strategy that allows businesses to take the step by step (completely custom to that client) plan to execute successful change or they can hire ID+M directly or to work with their agency.  ID+M partners with many agencies to fill their gaps in games, software, apps, sweepstakes and more&#8211;however honors the code of the agency client relationship and ensures that ID+M never crosses that line and ContactIDM.com has never compromised on that promise.</p>","image":null,"degrees":[{"degree_type":"JD","subject":"Business Law, Law & Society","institution":"University of Chicago, Law","graduated_year":1990,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CMO","firm":{"name":"ContactIDM.com","permalink":"contactidm-com","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.contactidm.com","title":"Interactive Design + Marketing"}]}