{"first_name":"Scott","last_name":"Woodworth","permalink":"scott-woodworth","crunchbase_url":"http://www.crunchbase.com/person/scott-woodworth","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jul 18 03:36:52 UTC 2011","updated_at":"Mon Jul 18 03:38:38 UTC 2011","overview":"<p>Scott Woodworth has over 25 years experience leading complex system programs, manufacturing and businesses.  Most recently, Scott served as Senior Vice President of Manufacturing and Operations at SOMA Networks.  At SOMA, Scott lead selection and development of global manufacturing and logistics for a carrier grade telecommunications product.  As part of his globalization effort, Scott built a Supply Chain team in India to support a large carrier deployment.  Prior to SOMA Networks, Scott was Vice President, Manufacturing and Operations for Pacific Broadband Communications, a cable modem termination system, which was bought by Juniper Networks. Prior to that he was Vice President of Operations at EmpowerTel Networks, a next generation carrier grade VOIP telecommunications switch start-up, and Solectron Corporation from January 1996 to June 2000 in several executive roles supporting global system manufacturing. At Solectron, he lead the systems business unit, directed the largest global account and oversaw the acquisition and integration of Nortel manufacturing operations.</p>\n\n<p>Scott has a Juris Doctor degree from the University of the Pacific, McGeorge School of Law, a BS in Nuclear Engineering and Materials Science Engineering from the University of California, Berkeley and is a member of the California State Bar.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Executive Vice President","firm":{"name":"VNL ","permalink":"vnl","type_of_entity":"company","image":{"available_sizes":[[[122,81],"assets/images/resized/0011/6676/116676v1-max-150x150.jpg"],[[122,81],"assets/images/resized/0011/6676/116676v1-max-250x250.jpg"],[[122,81],"assets/images/resized/0011/6676/116676v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}