{"first_name":"Scott","last_name":"Ford","permalink":"scott-ford-2","crunchbase_url":"http://www.crunchbase.com/person/scott-ford-2","homepage_url":"http://www.openairep.com","birthplace":"Sacramento","twitter_username":"scottpford","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1964,"born_month":11,"born_day":9,"tag_list":"","alias_list":null,"created_at":"Fri Jul 30 18:50:11 UTC 2010","updated_at":"Mon Oct 17 22:53:43 UTC 2011","overview":"<p>Scott is a mobile focused VC/PE investor.</p>\n\n<p>Scott Ford is a Managing Director of OPENAIR Ventures, a venture capital and private equity firm focused on the explosive growth of mobility and the associated industries impacted by wireless technology. OPENAIR Ventures is organized with seasoned wireless operating veterans who are adept in identifying and mentoring early and growth-stage wireless ventures in a highly complex industry. Employing an experiential lens of practicality and a vast global network, the firm is equipped to optimize high-potential opportunities operating to thrive within the Mobile Revolution. </p>\n\n<p>Scott is founder and former general manager of Sprint Nextel Ventures (SNV), Sprint’s corporate venture capital unit. During his time as leader of SNV, Scott and his team funded and managed direct investments in strategic wireless start-up companies. He also led business development efforts for Sprint, directing a team responsible for discovering, executing, and managing hundreds of partnerships delivering greater than $1B in contract value. Scott is recognized in the wireless industry as a knowledgeable industry influencer with the rare experience of carrier-side innovation realization coupled with a very solid venture and start-up market reputation and network </p>\n\n<p>Scott has been selected by the CTIA - The Wireless Association®, to serve on its VC Innovation Council. He and select venture industry colleagues communicate with CTIA on wireless innovation trends, best practices, and global developments that are affecting their investment choices, and the impact on the wireless industry. The Council serves to assist the CTIA in guiding the industry to enable innovation realization, a key driver of broad wireless growth into the future. </p>","image":{"available_sizes":[[[105,150],"assets/images/resized/0009/5505/95505v2-max-150x150.jpg"],[[176,250],"assets/images/resized/0009/5505/95505v2-max-250x250.jpg"],[[282,400],"assets/images/resized/0009/5505/95505v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}