{"first_name":"Scott","last_name":"Zagarino","permalink":"scott-zagarino","crunchbase_url":"http://www.crunchbase.com/person/scott-zagarino","homepage_url":"http://sportsgrants.org","birthplace":"Fort Worth, TX","twitter_username":"sportsgrants","blog_url":"","blog_feed_url":"","affiliation_name":"RapidGiving","born_year":1957,"born_month":9,"born_day":6,"tag_list":"","alias_list":null,"created_at":"Thu Dec 09 16:16:57 UTC 2010","updated_at":"Sun Oct 09 22:46:16 UTC 2011","overview":"<p>Scott Zagarino is the founder and Executive Director of the Sportsgrants Foundation, a 501c3 nonprofit set upon changing the face of philanthropy in sports.  He created and produced the Fight Gone Bad annual event, and raised $2 million for Sportsgrants in its first year.  He is also the Executive Director of Rapid Registration and RapidGiving, a revolutionary technology to manage online fundraising and registration systems.</p>\n\n<p>Scott saw the need for Sportsgrants while serving as the Managing Director of Athletes for a Cure, a fundraising and awareness program of the Prostate Cancer Foundation. Scott was responsible for overseeing its development and marketing, and his programs were featured on the Rachel Rae show, Times Square, Outside Magazine, Howard Stern, CNN, New York Times, and even Us and Seventeen Magazine.  His programs Athletes for a Cure and Team Winter continue to thrive and gain recognition.  Scott won the Shorty Award for nonprofit in 2008.</p>\n\n<p>Scott previously founded CS Sports Marketing where he secured Gatorade as the title sponsor of the Ironman World Championship in Hawaii for five consecutive years, a sponsorship valued at more than $6 million. CS Sports Marketing managed sponsorships for other organizations including Pioneer Electronics, Reebok and Quaker Oats. </p>\n\n<p>As an event organizer, Zagarino produced the AMH Ironman Duathlon in 1989 and assisted with the production of the International Triathlon Union (ITU) World Cup tour and the 1989 Triathlon World Championships at Walt Disney World. In 2000, Zagarino founded Adventure Training Consultants, Inc., which specialized in using outdoor and adventure skills as an educational tool to teach people how to confront and overcome adversity. The programs were featured in Outside magazine, National Geographic Explorer, the Los Angeles Times, the New York Times and numerous other news and news magazine television shows. Zagarino also founded Triathletes for Kids, a program in which professional triathletes share their time with chronic and terminally ill children in hospitals throughout North America. </p>\n\n<p>A former professional triathlete and Ironman competitor, Zagarino was a member of the US National Team in 1989 and has competed in more than 100 triathlons around the world. He has also competed in the 24 Hours of Moab mountain bike race and the Adidas Triple By-Pass and Hi Tec adventure races. Zagarino has been elected to a number of sports bodies positions including founding member of the ITU (International Triathlon Union) technical committee; executive director of the United States Professional Athlete Commission; vice president of the Board of Directors of the United States Triathlon Federation; and member of the Board of Directors of USA Adventure Racing. </p>\n\n<p>Born in Laredo, Texas and raised in Miami, Florida, Zagarino grew up racing Olympic class sailboats. Sailing brought him to California in 1979, where he was hired to run a training program for Olympic sailors. He began competing in triathlon in 1985 and qualified to compete as a professional in 1987. He and his wife, Greta Rose, reside in Hood River, Oregon.</p>","image":{"available_sizes":[[[145,150],"assets/images/resized/0011/6909/116909v2-max-150x150.jpg"],[[240,248],"assets/images/resized/0011/6909/116909v2-max-250x250.jpg"],[[240,248],"assets/images/resized/0011/6909/116909v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"RapidGiving","permalink":"rapidgiving","type_of_entity":"company","image":{"available_sizes":[[[146,77],"assets/images/resized/0011/6912/116912v2-max-150x150.tiff"],[[146,77],"assets/images/resized/0011/6912/116912v2-max-250x250.tiff"],[[146,77],"assets/images/resized/0011/6912/116912v2-max-450x450.tiff"]],"attribution":null}}},{"is_past":false,"title":"CEO","firm":{"name":"Rapid Registration, Inc.","permalink":"rapid-registration-inc","type_of_entity":"company","image":{"available_sizes":[[[150,57],"assets/images/resized/0011/6919/116919v2-max-150x150.png"],[[250,95],"assets/images/resized/0011/6919/116919v2-max-250x250.png"],[[276,105],"assets/images/resized/0011/6919/116919v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"<iframe src=\"http://player.vimeo.com/video/18498894?color=ffffff\" width=\"400\" height=\"225\" frameborder=\"0\"></iframe><p><a href=\"http://vimeo.com/18498894\">Fight Gone bad 5</a> from <a href=\"http://vimeo.com/user5664054\">Zagarino</a> on <a href=\"http://vimeo.com\">Vimeo</a>.</p>","description":"<p>Fight Gone Bad 5 at Sony Studios raised $1.5 million on Sept. 25, 2010</p>"}],"external_links":[],"web_presences":[]}