{"first_name":"Scott","last_name":"Flansburg","permalink":"scott-flansburg-2","crunchbase_url":"http://www.crunchbase.com/person/scott-flansburg-2","homepage_url":"http://scottflansburg.com/thc/meet/","birthplace":"","twitter_username":"HumanCalculator","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"mental-calculators, lightning-calculators, human-calculators, mental-math, mental-arithmetic, mental-calculation, math-magic, math-magic-for-kids, humancalculator, the-human-calculator, mathletics, mathlete, pubic-speaking","alias_list":null,"created_at":"Mon Sep 26 17:30:11 UTC 2011","updated_at":"Thu Nov 17 22:15:27 UTC 2011","overview":"<p>The Human Calculator has been teaching math and entertaining people with his astonishing math skills for more than 20 years. People challenge him almost every day to calculate large math problems in his head-and he loves each challenge!</p>\n\n<p>Best selling author Scott Flansburg is &#8220;The Human Calculator&#8221; - a nickname given to him by television star Regis Philbin. Scott earned this nickname because of his remarkable math skills that allow him to add, subtract, multiply, and divide (even do square and cube roots) all in his head with amazing speed and calculator accuracy.</p>\n\n<p>Scott added the same number to itself more times in 15 seconds than a person could do with a calculator, which is why he is the Guinness World Record holder for &#8220;Fastest Human Calculator&#8221;. According to Scott, he would be even faster, but he can&#8217;t speak the answers as fast as he can calculate them in his head!</p>\n\n<p>Now an elite &#8220;edutainer,&#8221; Scott speaks to educators, parents, corporate leaders, and thousands of kids each year, teaching them about math and even showing off his own skills a bit. His mission is to help people improve their basic math skills regardless of their ages, and convince them that math can be fun. Scott is an the accomplished author of &#8216;Math Magic&#8217; and &#8216;Math Magic for Kids&#8217; published by HarperCollins.</p>\n\n<p>In his 20-plus years of teaching math, Scott has appeared on several talk shows including Oprah, The Tonight Show with Jay Leno, The Ellen DeGeneres Show, Dateline NBC, ABC&#8217;s Good Morning America, Coast to Coast AM with George Noory, Larry King Live, Howard Stern, The 700 Club, Primetime America, Regis &amp; Kathy Lee, CNN Day Watch, How&#8217;d They Do That?, ESPN&#8217;s World Series of Poker, and USA Today Radio Network. He has given hundreds of interviews around the world and is also a best-selling author.   meet scott</p>\n\n<p>Scott is available for personal appearances, lectures, and speaking engagements.</p>\n\n<p>Some of the companies, organizations, and events where Scott has appeared as a Keynote Speaker include: NASA, IBM, Polaroid, Unocal, Math Counts, Software Publishers, Tony Robbins Seminars, The Smithsonian Institute, National Council of Teachers of Mathematics, as well as free appearances at thousands of schools.</p>\n\n<p>Scott Flansburg believes everyone has the ability to be good at math and enjoy it, but that most people have not learned to do math in a way that works for them. The Human Calculator is dedicated to helping students and adults to overcome their math-related fears.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.imdb.com/name/nm2192123/","title":"The Human Calculator IMDB"},{"external_url":"http://www.scottflansburg.com/thc/","title":"Scott Flansburg Main Site"}],"web_presences":[{"external_url":"http://twitter.com/#!/HumanCalculator","title":"Human Calculator Twitter"},{"external_url":"http://www.facebook.com/pages/The-Human-Calculator/40297498556","title":"Human Calculator Facebook"},{"external_url":"http://www.myspace.com/thehumancalculator","title":"Human Calculator MySpace"},{"external_url":"http://thehumancalculator.tumblr.com/","title":"Human Calculator Tumblr"},{"external_url":"http://www.flickr.com/photos/67927700@N08/","title":"Human Calculator Flickr"}]}