{"first_name":"Scott","last_name":"Ross","permalink":"scott-ross","crunchbase_url":"http://www.crunchbase.com/person/scott-ross","homepage_url":"","birthplace":"NYC","twitter_username":"DrScottRoss","blog_url":"http://www.scottaross.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1951,"born_month":11,"born_day":20,"tag_list":"","alias_list":null,"created_at":"Tue Mar 20 21:21:41 UTC 2012","updated_at":"Sun Mar 25 22:33:15 UTC 2012","overview":"<p>As one of the most notable pioneers in digital media and entertainment, Scott Ross’ career has been stellar.</p>\n\n<p>He founded, along with Hollywood luminaries James Cameron and Stan Winston, Digital Domain, Inc., (NYSE:DDMG) one of the largest digital production studios in the motion picture and advertising industries.  Under Ross’ direction, Digital Domain garnered multiple Academy Award nominations, receiving its first Oscar for the ground breaking visual effects in TITANIC. That success was followed by a second Oscar for WHAT DREAMS MAY COME and a third for THE CURIOUS CASE OF BENJAMIN BUTTON.  Digital Domain received additional nominations for TRUE LIES, APOLLO 13 and I, ROBOT and has won four Scientific and Technical Achievement Academy Awards for its proprietary software.  For well over a decade Ross oversaw the company that created imagery for movies such as TITANIC, THE FIFTH ELEMENT,APOLLO13, FIGHT CLUB, TRUE LIES, INTERVIEW WITH THE VAMPIRE, O BROTHER WHERE ART THOU, X-MEN, THE LORD OF THE RINGS, THE DAY AFTER TOMORROW, I ROBOT and many, many others.  Ross has worked with the who’s who of film directors such as Cameron, Bay, Fincher, Howard, Scorsese, Coppola, The Coen Brothers, Spielberg, Kurosawa, Jackson, Salles and generally, has nice things to say about them.  </p>\n\n<p>In 2006 as Digital Domain’s CEO and Chairman, he successfully sold Digital Domain to director Michael Bay and a group of private equity investors.  </p>\n\n<p>Prior to forming Digital Domain he led George Lucas’ vast entertainment empire, running ILM, Skywalker Sound, LucasFilm Commercial Productions and DroidWorks. Ross first joined LucasFilm as General Manager of Industrial Light and Magic and under his leadership, ILM won five Academy Awards for Best Visual Effects (WHO FRAMED ROGER RABBIT; INNERSPACE; TERMINATOR 2; THE ABYSS; DEATH BECOMES HER). The company re-organized in the 90’s and Ross was named Sr. VP of the LucasArts Entertainment Group, which was comprised of Skywalker Sound, LucasArts Commercial Productions, LucasArts Attractions, Editdroid/Soundroid and ILM.</p>\n\n<p>Ross has played a significant role in the worldwide advertising industry as well. Having started commercial production companies whilst at LucasFilm (ILM and LCP) as well as Digital Domain’s Commercials Division, he has led two of the largest VFX commercial production companies on the planet. Digital Domain has continually established itself as the premiere visual effects studio in the advertising industry.  With Fortune 500 clients such as Nike, American Express, Gatorade, Anheuser-Busch, Coca-Cola and Mercedes Benz, the DD Commercials Division has garnered dozens of Clio Awards and numerous Cannes Golden Lions.</p>\n\n<p>In addition to the visual effects divisions, Mr. Ross launched Digital Domain Films, a feature film production division.  The first feature film produced by Mr. Ross was the New Line Cinema release SECONDHAND LIONS which  achieved both critical and box office success.</p>\n\n<p>Prior to his celebrated career in film and advertising, Ross was a sound engineer touring with bands such as Miles Davis, The Allman Brothers and Johnny Winter.</p>\n\n<p>A native of New York City, Ross began his career in Media Studies at Hofstra University where he graduated with a BS in Communication Arts.  He returned to Hofstra to receive an honorary doctorate degree from his alma mater. </p>\n\n<p>Mr. Ross is a member of the Academy of Motion Picture Arts and Sciences (OSCARS); The Academy of Television Arts and Sciences (EMMYS). He has worked on over 100 of the world’s largest special effects films and has lectured extensively about the creative process, content and technology in over 30 countries around the world.   </p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0018/0279/180279v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0018/0279/180279v2-max-250x250.jpg"],[[298,450],"assets/images/resized/0018/0279/180279v2-max-450x450.jpg"]],"attribution":"<p>Scott Ross</p>"},"degrees":[{"degree_type":"BA","subject":"Film","institution":"Hofstra University","graduated_year":1975,"graduated_month":null,"graduated_day":null},{"degree_type":"PhD","subject":"Arts and Letters","institution":"Hofstra University","graduated_year":1997,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}