{"first_name":"Scott","last_name":"McNelley","permalink":"scott-mcnelley","crunchbase_url":"http://www.crunchbase.com/person/scott-mcnelley","homepage_url":"http://www.admiralrecordsmanagement.com","birthplace":"Mobile AL","twitter_username":"smcnelley","blog_url":"http://alwaysleading.com","blog_feed_url":"http://alwaysleading.com/feed/","affiliation_name":"Redwood Properties","born_year":1965,"born_month":6,"born_day":19,"tag_list":"scott-mcnelley, hospital-mover, crn, commercial-relocation-network, records-management, arm, admiral-records-management, alwaysleading-com","alias_list":null,"created_at":"Tue Jul 24 16:56:14 UTC 2012","updated_at":"Wed Jul 25 20:47:42 UTC 2012","overview":"<p>An entrepreneur, a marketer, a manger with expertise in large &amp; complex commercial relocations, records management, privacy consulting, secure chain of custody.  </p>\n\n<p>Scott McNelley is a lifelong problem-solver and entrepreneur who uses creativity, ingenuity and hard work to find the best solutions for his moving and storage customers in Alabama and beyond.  When a good solution doesn’t already exist, Scott creates one by “Imagineering” new equipment or systems that deliver the results his customers need and deserve.\nScott’s first business was a small local moving company that he started while in college and later sold (the company is still in business today).  He then started Admiral Movers, which has grown over the years into a much larger office moving firm, now known as “Montgomery’s Only True Office Mover.” \nWith Admiral, Scott took office moving to the next level, by creating several revolutionary techniques and new moving equipment that he conceived and built in direct response to the unmet needs of his customers.  Among other office move improvements, Scott created Admiral’s AirGlide℠ Computer Moving and Office Gondola℠ Systems, which together offer a truly “boxless, crateless” moving solution that better protects expensive equipment and gives customers better access to their property before, during and after a move.<br/>\nEncouraged by the success of Admiral Movers, Scott was able to expand his ability to serve his customers by starting two other enterprises: Redwood Properties, a real estate holding company, and Admiral Records Management (ARM), a document management and storage specialty firm and a proven leader in secure information transition, relocation, conversion and storage.  Banks, hospitals, government agencies, the military, corporations, and medical practices have come to rely on ARM to maintain privacy, coordinate logistics, and provide the ultimate in protection of their client data.\nARM is a natural extension of his work with Admiral, and Scott brought the same creativity and problem-solving ingenuity to the difficulties his customers face when managing their critical business records.  With ARM, Scott introduced Intelligent Archiving, an unconventional approach to on-demand document scanning services that makes it easier and less expensive than ever for customers to transition to a fully-paperless office.  Intelligent Archiving also safeguards patient privacy and ensures total compliance for customers in the medical and healthcare fields that are making the change.\nScott’s efficient and cost-effective solutions have saved his customers money, time, backaches and headaches over the years, and his innovations, along with service that consistently exceeds expectations, are the biggest reasons his customers won’t go anywhere else for office moving or document management and storage assistance. \nTo learn more about how Scott’s passion for creative problem-solving can help your firm with an office move or document management and storage, please visit:\n www.alwaysleading.com\n www.admiralmovers.com\n www.admiralrecordsmanagement.com</p>\n\n<p>Or you can simply email info@alwaysleading.com, or call 334-262-6666 today!</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0020/2595/202595v2-max-150x150.jpg"],[[178,250],"assets/images/resized/0020/2595/202595v2-max-250x250.jpg"],[[321,450],"assets/images/resized/0020/2595/202595v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Undergrad","subject":"Business","institution":"Auburn","graduated_year":1997,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Stockholder","firm":{"name":"ServisFirst Bank","permalink":"servisfirst-bank","type_of_entity":"financial_org","image":null}},{"is_past":true,"title":"Manager","firm":{"name":"Redwood Properties","permalink":"redwood-properties","type_of_entity":"company","image":null}},{"is_past":true,"title":"Owner","firm":{"name":"Third Party Relocation Services","permalink":"third-party-relocation-services","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.montgomerychamber.com/Page.aspx?pid=1194","title":"Opinion Piece"}],"web_presences":[{"external_url":"http://www.linkedin.com/in/scottmcnelley","title":"Linked In"},{"external_url":"https://plus.google.com/u/0/116859078028732265371/about","title":"Google Plus"},{"external_url":"http://www.twitter.com/smcnelley","title":"Twitter"}]}