{"first_name":"Scott","last_name":"Danish","permalink":"scott-danish","crunchbase_url":"http://www.crunchbase.com/person/scott-danish","homepage_url":"http://www.baycreative.com","birthplace":"Portland, Oregon","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"BayCreative","born_year":1965,"born_month":11,"born_day":7,"tag_list":"marketing, marketing-firm, marketing-agency, marketer, advertising, advertising-agency, communications, marcom","alias_list":null,"created_at":"Fri Feb 18 00:35:16 UTC 2011","updated_at":"Sat Feb 19 02:16:14 UTC 2011","overview":"<p>Proven marketing executive with more than 22 years B2B experience in driving product, service, channel and corporate marketing strategies in multiple industries.</p>\n\n<p>I have demonstrated ability to influence and close multi-million dollar sales opportunities and an exceptional track record of results. My passion is building and motivating teams, delivering results while having fun along the way. </p>\n\n<p>Prior to joining BayCreative, Inc. in 2009 as President &amp; Co-owner, I worked for Cisco Systems, the worldwide leader in networking, as Director of Marketing. In this capacity, I led a team of world-class marketers that delivered strategic, innovative and integrated marketing campaigns which helped drive over $2 billion in Cisco Services revenues from large businesses and Federal agencies across the U.S. &amp; Canada theater.</p>\n\n<p>Before joining Cisco, I was Vice President of Global Marketing for CNET Networks, where I had responsibility for all global marketing, product management and sales support of the Channel division. Prior to joining CNET Networks, I held the position of Director of Product Marketing at PeopleSoft where I ran marketing communications, programs and operations for their global supply chain management division. Before that, I held senior marketing positions at OnDisplay (now Vignette) and IDG&#8217;s PC World Communications. </p>\n\n<p>I have B.S. degrees in Marketing and Management from the University of Oregon (Honors).</p>\n\n<p>Demonstrated experience in:\n• Product Marketing and Strategy\n• Branding and Identity\n• Awareness Creation\n• Demand Generation\n• Sales and Partner Enablement\n• Partner Marketing Programs\n• Product Launches</p>\n\n<p>Specialties\nBranding and corporate identity, lead generation and direct response, public relations, ROI tools, interactive marketing, product planning and development, advertising, creative development</p>","image":{"available_sizes":[[[132,150],"assets/images/resized/0012/2671/122671v2-max-150x150.jpg"],[[176,199],"assets/images/resized/0012/2671/122671v2-max-250x250.jpg"],[[176,199],"assets/images/resized/0012/2671/122671v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelors","subject":"(1) Marketing, (2) Management","institution":"University of Oregon","graduated_year":1987,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President & Co-Owner","firm":{"name":"BayCreative","permalink":"baycreative","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.baycreative.com","title":"BayCreative"}]}