{"first_name":"Scott","last_name":"Schreiman","permalink":"scott-schreiman","crunchbase_url":"http://www.crunchbase.com/person/scott-schreiman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Kerio Technologies","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri May 22 15:41:01 UTC 2009","updated_at":"Tue Jul 10 22:19:30 UTC 2012","overview":"<p>Scott Schreiman is the CEO and president of Kerio Technologies, Inc., and a member of Kerio&#8217;s board of directors. In his role, Mr. Schreiman leads Kerio&#8217;s global management team guiding the company&#8217;s strategic development. Prior to becoming CEO, he was COO and responsible for Kerio&#8217;s global business operations and financial management. He joined the company in 2005 as vice president of worldwide operations, managing the areas of business planning, sales operations, customer support, finance and IT.</p>\n\n<p>He brings more than 12 years of senior management experience in sales, business development, marketing, operations, and finance. Prior to joining Kerio Technologies, Mr. Schreiman was vice president and director of knowledge management for Wells Fargo PCS, where he led the roll out of innovative distance learning and communications technologies to the division&#8217;s 6,000 employees. He was the co-founder of MovieWeb.com, a leading film entertainment portal and the CEO of Aladdin Knowledge Systems Ltd.&#8217;s U.S. operating subsidiary. Mr. Schreiman holds Bachelor&#8217;s degrees in Economics and Philosophy from Claremont McKenna College.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO & President","firm":{"name":"Kerio Technologies","permalink":"kerio-technologies","type_of_entity":"company","image":{"available_sizes":[[[150,23],"assets/images/resized/0004/5216/45216v2-max-150x150.png"],[[250,39],"assets/images/resized/0004/5216/45216v2-max-250x250.png"],[[450,71],"assets/images/resized/0004/5216/45216v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}