{"first_name":"Scott","last_name":"Abel","permalink":"scott-abel-2","crunchbase_url":"http://www.crunchbase.com/person/scott-abel-2","homepage_url":"http://www.thecontentwrangler.com","birthplace":"Portsmouth","twitter_username":"scottabel","blog_url":"http://www.thecontentwrangler.com","blog_feed_url":"feed://feeds.feedburner.com/thecontentwrangler","affiliation_name":"Unaffiliated","born_year":1964,"born_month":4,"born_day":8,"tag_list":"xml, ebooks, content-strategy, content-management, technical-communication, mashups, technology, terminology-management, content-quality, translation, localization, internationalization","alias_list":null,"created_at":"Sat Aug 20 17:40:21 UTC 2011","updated_at":"Fri Aug 26 21:22:04 UTC 2011","overview":"<p>Scott Abel, aka The Content Wrangler, is an internationally-recognized content management strategist and social networking choreographer whose strengths lie in helping global organizations improve the way they author, maintain, and deliver information.</p>\n\n<p>In addition to his popular business blog, TheContentWrangler.com, an online resource for content professionals with an interest in content management, content standards and content technologies, Scott maintains several online communities on Facebook and Linkedin, and is the curator of a popular technology channel on Twitter. He also manages the social networking activities for several software and services firms in the high technology and digital mobile publishing arenas.</p>\n\n<p>A founding member of Content Management Professionals (http://www.cmpros.org), Scott previously served as Executive Director of the organization. Scott writes regularly for trade and industry publications, blogs, and newsletters. He also co-produces several content industry events, including the Intelligent Content conference (http://www.intelligentcontentconference.com).</p>\n\n<p>Scott is also a popular dance music mashup artist, dj and music producer who has been spinning tunes since 1982.</p>\n\n<p>Keep track of what Scott is thinking about via Twitter (http://www.twitter.com/scottabel), what he&#8217;s doing via Facebook (http://www.facebook.com/scottpatrickabel and what music he&#8217;s making here: http://thecontentwrangler.official.fm/.</p>","image":{"available_sizes":[[[150,98],"assets/images/resized/0015/0359/150359v2-max-150x150.jpg"],[[182,120],"assets/images/resized/0015/0359/150359v2-max-250x250.jpg"],[[182,120],"assets/images/resized/0015/0359/150359v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}