{"first_name":"Scott","last_name":"Cutler","permalink":"scott-cutler","crunchbase_url":"http://www.crunchbase.com/person/scott-cutler","homepage_url":"http://exchanges.nyx.com/en/scott-cutler/bio","birthplace":"","twitter_username":"NYSE_Euronext","blog_url":"http://exchanges.nyx.com/en/scott-cutler","blog_feed_url":"http://exchanges.nyx.com/en/scott-cutler","affiliation_name":"NYSE Euronext","born_year":null,"born_month":null,"born_day":null,"tag_list":"nyse-ipo","alias_list":null,"created_at":"Tue Jun 21 02:06:47 UTC 2011","updated_at":"Tue Jun 21 17:31:48 UTC 2011","overview":"<p>Scott Cutler is Executive Vice President and Co-Head of U.S. Listings and Cash Execution at NYSE Euronext.</p>\n\n<p>Mr. Cutler is responsible for the NYSE listing business globally.  He manages the Exchange’s relationship with over 2100 companies listed at the NYSE in Canada, Latin America, United States and Asia.   He is also responsible for the Exchange’s relationship with the Investment Banking, Private Equity, Venture Capital, and Legal Communities to attract new listings.  In addition, Mr. Cutler oversees the Capital Markets business including, Initial Public Offerings for operating companies, Structured Products, Closed-End Funds, and REITs listing on the NYSE or NYSE Amex.  </p>\n\n<p>Mr. Cutler has an extensive background in investment banking and corporate securities law.  Before joining NYSE Euronext, Mr. Cutler was an investment banker focused on technology at SG Cowen &amp; Co., and Thomas Weisel Partners.  He was also a corporate securities lawyer at Cooley Godward, focused on M&amp;A, IPOs, venture fund formation and venture capital representation. </p>\n\n<p>Mr. Cutler serves on the Operating Committee of NYSE Euronext.  Mr. Cutler also serves on the executive committee of TechNet, and currently serves as a board member for the Mental Health Association of New York City and British American Business. Mr. Cutler graduated with a B.S. degree in Economics from Brigham Young University and earned a J.D. from the University of California, Hastings College of Law.</p>","image":{"available_sizes":[[[125,150],"assets/images/resized/0014/0131/140131v2-max-150x150.jpg"],[[209,250],"assets/images/resized/0014/0131/140131v2-max-250x250.jpg"],[[257,306],"assets/images/resized/0014/0131/140131v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Executive Vice President, Listings","firm":{"name":"NYSE Euronext","permalink":"nyse-euronext","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}