{"first_name":"Scott","last_name":"Kinghorn","permalink":"scott-kinghorn-2","crunchbase_url":"http://www.crunchbase.com/person/scott-kinghorn-2","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Sportgenic","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jun 10 17:51:27 UTC 2009","updated_at":"Wed Jun 10 18:43:33 UTC 2009","overview":"<p>Scott is responsible for defining the software we create for our media partners and marketers. This process includes creating our software strategy, business requirements, functional design and managing quality assurance.</p>\n\n<p>Prior to joining Sportgenic®, Scott served as the Vice President of Product Design at Del Mar Database, a privately owned company which develops mortgage banking software for small to medium lenders. Scott was responsible for designing the software suite built around the award winning DataTrac mortgage banking platform. The software suite transformed from a legacy application to an enterprise suite built upon the .NET framework within two years during Scott&#8217;s tenure. The new software suite enabled the company to significantly increase revenue, leading to its purchase by Fiserv.</p>\n\n<p>Scott&#8217;s first start-up experience was with PureCarbon where he served as the Vice President of Software Design. Before being sold in 2002, PureCarbon focused on providing Human Resources solutions to Corporate 1000 clients and was the winner of the 2001 HR Executive Magazine&#8217;s Product of the Year for its JobPlanet software.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP of Product Management","firm":{"name":"Sportgenic","permalink":"sportgenic","type_of_entity":"company","image":{"available_sizes":[[[150,37],"assets/images/resized/0001/4428/14428v5-max-150x150.jpg"],[[250,62],"assets/images/resized/0001/4428/14428v5-max-250x250.jpg"],[[285,71],"assets/images/resized/0001/4428/14428v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}