{"first_name":"Scott","last_name":"Knoll","permalink":"scott-knoll","crunchbase_url":"http://www.crunchbase.com/person/scott-knoll","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"AdSafe Media","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Sep 06 22:43:54 UTC 2011","updated_at":"Fri Sep 09 02:25:20 UTC 2011","overview":"<p>Scott Knoll is the Chief Executive Officer and President of AdSafe Media.</p>\n\n<p>Scott was most recently the founder and President of Aperture, the audience targeting and measurement technology platform that provides business intelligence to blue chip brands, agencies and online publishers. Scott has more than 18 years of global experience in Internet technology, digital advertising and traditional media. Prior to Aperture, Scott served as CEO of BlackFoot, a digital advertising solutions company. He also spent 6 years as a senior executive at DoubleClick Inc., directing the launch and development of the DoubleClick ad network in nine countries, including Australia, Hong Kong, Japan, China, Taiwan, New Zealand, Singapore, and Korea. Scott served as managing director of DoubleClick Asia Pacific and Vice President and General Manager of Global Marketer Solutions.</p>\n\n<p>Previously, Scott co-founded and served as COO of Verified Person, and has held management roles at Time Warner Inc. and Andersen Consulting. Scott holds a Masters in Business Administration degree from Harvard University and a Bachelor of Arts degree from Princeton University. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO & President","firm":{"name":"Integral Ad Science","permalink":"integralads","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0008/9405/89405v6-max-150x150.png"],[[226,80],"assets/images/resized/0008/9405/89405v6-max-250x250.png"],[[226,80],"assets/images/resized/0008/9405/89405v6-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}