{"first_name":"Scott","last_name":"C. Kachlany","permalink":"scott-c-kachlany","crunchbase_url":"http://www.crunchbase.com/person/scott-c-kachlany","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 23 07:30:07 UTC 2009","updated_at":"Tue Jun 23 07:30:37 UTC 2009","overview":"<p>Actinobac Biomed was founded by Dr. Scott C. Kachlany.  Dr. Kachlany serves as Chair of the Scientific Advisory Committee.  He obtained his B.S. degree from Cornell University in Ithaca, NY in 1997 and Ph.D. from Columbia University College of Physicians and Surgeons in 2001.  He joined the faculty at University of Medicine and Dentistry of New Jersey in 2003 as an Assistant Professor of Oral Biology in the Dental School with an adjunct appointment in the Department of Microbiology and Molecular Genetics in the Medical School.  In 2008, Dr. Kachlany was promoted to Associate Professor.  Dr. Kachlany will retain his faculty position. </p>\n\n<p>Dr. Kachlany has published more than 20 peer-reviewed research papers, authored a book on oral infectious diseases, and co-authored two book chapters on molecular oral biology and protein secretion systems.  Dr. Kachlany is the recipient of numerous awards and honors including the Howard Hughes Undergraduate Research Fellowship, Paul J. VanDemark Memorial Award, Dean’s Award for Excellence in Research, Richard Parker Memorial Award, and the Anthony A. Rizzo Young Investigator Award.  Since 2004, Dr. Kachlany has received approximately $2 million in research funding from the NIH and $37,500 from the NJ Commission on Science and Technology.  He has served on NIH grant review study sections nearly a dozen times and has reviewed manuscripts for numerous peer-reviewed journals including Journal of Bacteriology, Infection and Immunity, Molecular Microbiology, FEMS Microbiology Letters, Applied and Environmental Microbiology, Oral Microbiology and Immunology, and Veterinary Microbiology.  In addition to research, Dr. Kachlany is the director of the Ph.D. graduate program for the Oral Biology Department and teaches Microbiology, for which he also serves as course director, to dental and graduate students at UMDNJ.  He is also course director for the Oral Biology Seminar Series.  At UMDNJ, Dr. Kachlany serves on numerous committees including the Institutional Biosafety Committee (IBC), Institutional Animal Care and Use Committee (IACUC), the NJDS Planning Committee, and the NJDS Research Committee.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Actinobac Biomed","permalink":"actinobac-biomed","type_of_entity":"company","image":{"available_sizes":[[[150,72],"assets/images/resized/0005/0275/50275v1-max-150x150.jpg"],[[250,121],"assets/images/resized/0005/0275/50275v1-max-250x250.jpg"],[[450,217],"assets/images/resized/0005/0275/50275v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}