{"first_name":"Scott","last_name":"Shreeve, MD","permalink":"scott-shreeve-md","crunchbase_url":"http://www.crunchbase.com/person/scott-shreeve-md","homepage_url":"http://crossoverhealth.com","birthplace":"Redwood City, CA","twitter_username":"crossoverhealt","blog_url":"http://crossoverhealth.com/media/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1969,"born_month":9,"born_day":18,"tag_list":"","alias_list":null,"created_at":"Sat Jun 16 06:01:41 UTC 2012","updated_at":"Fri Jun 22 01:40:13 UTC 2012","overview":"<p>Scott Shreeve, MD is a board certified Emergency Medicine physician who has been actively involved in the design, development, and distribution of life science technologies that improve the delivery of care and enhance the quality of life. </p>\n\n<p>Dr. Shreeve is the founder and chief executive office of Crossover Health, a next generation health care delivery and management services company. Crossover Health designs, implements and manages work site health centers for large self funded companies that understand the financial and cultural return of healthy employees. Crossover currently manages the health care delivery of some of the most innovative companies in the world with an equally innovative approach to health, wellness, and vitality.  </p>\n\n<p>Dr. Shreeve was a co-founder of Medsphere Systems Corporation, the first open source  electronic health record for the healthcare enterprise, where he led the Clients Services team.  He led the implementation of large scale electronic health record implementations at community hospitals, state wide health systems, and networks of primary care clinics. Dr. Shreeve is also founding member of the Health 2.0 technology and reform movement, serving as an advisor to the conference and spokesperson throughout the country. His popular Crossover Health blog focuses on the enabling technologies that transform the delivery, financing, and outcomes of high performance health systems. </p>\n\n<p>He earned his Bachelors of Science in Zoology, with a minor in Economics, from Brigham Young University, is a graduate of the University of Utah School of Medicine, and completed his Emergency Medicine residency training at the University of Arizona Health Science Center. He lives in Southern California with his wife and four children near some of the best breaks on the west coast.</p>","image":null,"degrees":[{"degree_type":"Medical Degree","subject":"","institution":"University of Utah","graduated_year":1998,"graduated_month":null,"graduated_day":null},{"degree_type":"Board Certification","subject":"Emergency Medicine","institution":"University of Arizona","graduated_year":2001,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/crossoverhealth","title":"Twitter"},{"external_url":"http://facebook.com/crossoverhealth","title":"Facebook"},{"external_url":"http://www.linkedin.com/pub/scott-shreeve-md/2/a68/109","title":"Linked In"}]}