{"first_name":"Scott","last_name":"Tse","permalink":"scott-tse","crunchbase_url":"http://www.crunchbase.com/person/scott-tse","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"WebSketch","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Aug 21 16:19:48 UTC 2008","updated_at":"Wed May 12 23:34:12 UTC 2010","overview":"<p>Scott is the Founder of WebSketch, an online service for average users to build professional-looking custom websites without any programming. Prior to founding SplashNote, Scott was a key member of the founding team at venture-backed eTouch.com, and as head of Marketing, built from ground up the marketing infrastructure, processes, and functions of the company. Before eTouch, Scott held Management Consulting and Engagement Management positions at A. T. Kearney, EDS Management Consulting Services, and JSA International. Altogether, he directed and delivered over three dozen projects around the world in areas such as supply chain management, strategic sourcing, customer development, process reengineering, strategy, and competitive analyses. </p>\n\n<p>Scott holds Bachelor and Master of Science degrees from MIT, and an MBA from the MIT Sloan School of Management. </p>\n\n<p>In his &#8216;copious&#8217; spare time, Scott serves as the Co-President of CSPA, a leading non-profit professional association in the Bay Area with over 4500 members (www.cspa.com). Scott is also an avid skier &amp; snowboarder, and is often found somewhere around Lake Tahoe during the winter months.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder & CEO","firm":{"name":"WebSketch","permalink":"websketch","type_of_entity":"company","image":{"available_sizes":[[[150,39],"assets/images/resized/0002/3948/23948v2-max-150x150.png"],[[250,65],"assets/images/resized/0002/3948/23948v2-max-250x250.png"],[[302,79],"assets/images/resized/0002/3948/23948v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}