{"first_name":"Scott","last_name":"Levine","permalink":"scott-levine","crunchbase_url":"http://www.crunchbase.com/person/scott-levine","homepage_url":"http://www.parthenoncapital.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Mar 30 21:44:34 UTC 2011","updated_at":"Wed Apr 06 00:35:39 UTC 2011","overview":"<p>Scott Levine joined Parthenon Capital Partners in 2005 as Director, Human Capital. Mr. Levine has over 20 years of experience working with private equity, public, middle market, and emerging technology companies. As a member of Parthenon Full Potential Team, Mr. Levine oversees human capital and executive recruiting efforts for the portfolio companies, as well as, the human capital due diligence on new investment opportunities, eventually driving recruiting and talent acquisition strategies post-transaction. </p>\n\n<p>EXPERIENCE\nPrior to joining PCP, Mr. Levine was a Principal with Silicon Valley Human Capital (SVHC), a boutique retained executive search firm, focusing on Board and CEO assignments for private equity and venture backed, middle market companies. Mr. Levine’s diverse search practice covers several industry verticals comprised of clients across North America. His portfolios of clients include; technology (software, hardware, telecom, wireless, networking, semiconductor, eCommerce), professional and business services, distribution, financial services, and manufacturing.</p>\n\n<p>Mr. Levine came to SVHC from AT&amp;T Wireless (NASDAQ: AWE), where he was their internal Executive Search Consultant. Mr. Levine’s primary responsibility was conducting executive level searches to help strengthen the leadership team, with focus on building out the executive team for their Mobile Multimedia Services (MMS) and eCommerce (AWE Direct) business units. Mr. Levine is also the founder of the HSIINetwork – the Heidrick &amp; Struggles Alumni Association – with over 250 members in 22 countries.</p>\n\n<p>Mr. Levine began his career in executive search with Heidrick &amp; Struggles International (NASDAQ: HSII) based in Menlo Park, California, where he was a member of the firm&#8217;s Private Equity, Board, and International Technology (ITP) Practices. Mr. Levine&#8217;s search work focused on CEO, Board of Directors, and senior high-level executives in public and venture backed technology companies. Mr. Levine held the positions of CRM Business Analyst as well as the North American ITP Ambassador to Israel, Belgium, and The Netherlands.</p>\n\n<p>Prior to joining Heidrick &amp; Struggles, Mr. Levine was with InterTape Polymer Group (NASDAQ: ITP), Inc. as the New England Territory Channel Manager. Prior to InterTape, Mr. Levine was the New England Director of Sales for LaGasse Brothers, Inc., a division of United Stationers, Inc. (NASDAQ: USTR).</p>\n\n<p>EDUCATION\nMr. Levine is a graduate of the University of Rhode Island where he received a B.A. degree in Communications with a minor in Business, Scott also participated in an overseas study program at Tel Aviv University in Israel.</p>","image":{"available_sizes":[[[105,120],"assets/images/resized/0012/8500/128500v2-max-150x150.jpg"],[[105,120],"assets/images/resized/0012/8500/128500v2-max-250x250.jpg"],[[105,120],"assets/images/resized/0012/8500/128500v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}