{"first_name":"Scott","last_name":"Albert","permalink":"scott-albert","crunchbase_url":"http://www.crunchbase.com/person/scott-albert","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue May 19 10:33:39 UTC 2009","updated_at":"Tue May 19 10:40:21 UTC 2009","overview":"<p>Scott Albert co-founded The Aurora Funds with Jeff Clark in 1994, after already spending nearly a decade in the venture capital industry. Having also spent time as an entrepreneur, he wanted to create an entrepreneur-friendly venture capital firm that could offer hands on support and guidance in addition to funding.</p>\n\n<p>Today, he leads the IT investment team at Aurora and also oversees much of the day-to-day management of the firm, working closely with the CFO and Controller. He tries to make sure that everyone on the team does everything they can to support Aurora&#8217;s portfolio companies. He personally spends more than 50% of his time helping entrepreneurs create their go-to-market strategy, raise additional funds, address customer-oriented issues and develop exit strategies. He spends the remainder of his time dealing with internal operational issues, identifying and evaluating new deals and supporting entrepreneurial efforts of the greater RTP community.</p>\n\n<p>Prior to forming The Aurora Funds, Scott was the Chief Investment Officer of the North Carolina Technological Development Authority, Inc. (&#8220;NCTDA&#8221;), a state funded corporation that supports technology based entrepreneurial companies in North Carolina. While there, he led the new venture investment efforts and performed portfolio company monitoring for the NCTDA&#8217;s extensive statewide portfolio. Prior to serving at the NCTDA, he was at Criterion Venture Partners in Houston, Texas, as a General Partner for a $30 million pool of capital and with Golder, Thoma and Cressey, in Chicago. In addition, he has served as President of a venture-backed start-up company. Before entering the venture capital industry, he was a consultant for Booz, Allen and Hamilton.</p>\n\n<p>During his venture capital career, Scott has helped close more than 40 investment deals including a broad range of Information Technology and Life Sciences companies. Scott currently serves on the boards of several Aurora portfolio companies including ALN Medical Management, Centice, StrikeIron and Trivirix. Scott was previously on the boards of Solution Technology (acquired by Rodel) and DataFlux (acquired by SAS) and led the Aurora investment in Blackboard (NASDAQ: BBBB). </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0004/4629/44629v1-max-150x150.jpg"],[[100,150],"assets/images/resized/0004/4629/44629v1-max-250x250.jpg"],[[100,150],"assets/images/resized/0004/4629/44629v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor of Science","subject":"Engineering","institution":"Duke University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing General Partner","firm":{"name":"The Aurora Funds","permalink":"the-aurora-funds","type_of_entity":"financial_org","image":{"available_sizes":[[[150,34],"assets/images/resized/0003/0298/30298v1-max-150x150.png"],[[250,58],"assets/images/resized/0003/0298/30298v1-max-250x250.png"],[[271,63],"assets/images/resized/0003/0298/30298v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}