{"first_name":"Sean","last_name":"Morgan","permalink":"sean-morgan","crunchbase_url":"http://www.crunchbase.com/person/sean-morgan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Critical Media","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jan 10 05:40:57 UTC 2008","updated_at":"Sun Jan 10 22:20:49 UTC 2010","overview":"<p>Sean Morgan is a pioneer in syndication. In 2002 Mr. Morgan founded Critical Media Inc., a company at the forefront of real-time broadcast media capture, search, syndication and information services. The company is made up of two divisions: the Information Services Group, which markets Critical Mention – a dynamic real-time business intelligence platform, and the Broadcaster Services Group, an online video ecosystem that allows media organizations and content owners to leverage and monetize their video assets.  </p>\n\n<p>Mr. Morgan&#8217;s first venture in syndication was with Pinnacor (formerly ScreamingMedia), the largest text syndication service on the Internet for newspapers, magazines and wire services. As a founder of ScreamingMedia, Mr. Morgan was instrumental in fundamentally changing the business models for online syndication. Within two years of building the business, the service already had partnerships with more than 2,000 text news providers. Mr. Morgan represented the company with industry analysts and investors, and helped raise more than $65 million in various funding rounds. Pinnacor debuted on the NASDAQ in August 2000 and was eventually sold to MarketWatch, Inc. (now a part of News Corporation) for more than $100 million.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder & CEO","firm":{"name":"Critical Media","permalink":"critical-media","type_of_entity":"company","image":{"available_sizes":[[[150,66],"assets/images/resized/0000/3058/3058v4-max-150x150.png"],[[243,107],"assets/images/resized/0000/3058/3058v4-max-250x250.png"],[[243,107],"assets/images/resized/0000/3058/3058v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}