{"first_name":"Sean","last_name":"Mayse","permalink":"sean-mayse-2","crunchbase_url":"http://www.crunchbase.com/person/sean-mayse-2","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1985,"born_month":6,"born_day":17,"tag_list":"","alias_list":null,"created_at":"Tue Aug 07 08:48:25 UTC 2012","updated_at":"Fri Aug 10 09:58:01 UTC 2012","overview":"<p>Sean Mayse </p>\n\n<p>Sean Mayse is someone who takes pride in working in an environment that deals with hospitality and management when it comes to tourism. However, he is also quite productive in fields such as property operations, hotel management and human resources. These experiences allowed Sean to interact with people as well as give himself a lot of career options.</p>\n\n<p>Some of the job opportunities that Sean gets to explore are food &amp; beverage, traveling, spas, managing hotels, sales and the planning of events. Sean was raised in Florida and already had set in his mind what he wanted to do after he graduated high school. Because of his love for the great outdoors, he flourished in his tourism career.</p>\n\n<p>Achievements</p>\n\n<p>In 2005, Sean went to Florida State University. His major was economics while his minor was in business. After some time at FSU, he was offered an internship in Las Vegas at a Hollywood Hotel. He joined a soccer team, and he was a part of a lot of events that were held on campus.</p>\n\n<p>After Sean graduated, he took with him skills and training that allowed him to do well in dealing with front desk managing, sales calling, training staff and much more. Because of the combination of his hands on training and business training, he was able to open doors for himself that would lead to a brighter future.</p>\n\n<p>Services</p>\n\n<p>Sean is still working in the industry and helping to provide information to other young adults about how they can get started in careers in tourism as well. Some of the options that Sean suggests in the field of tourism include recreation assistant, front desk clerk and ride operator. Some of these positions will hire young adults starting at the age of 16.</p>\n\n<p>In hospitality management, young adults can pursue hotel management, activity director, cruise director, event planner and more. Sean Mayse started out as a lifeguard that was CPR certified at Hard Rock Hotel which is a part of Universal Studios, Orlando. This gave him a peek into how the world of tourism functions.</p>\n\n<p>Because of the skills that he has learned as a lifeguard, he is able to do extremely well in his role at Vision One Hospitality. If you are a young adult looking for a career that is exciting, challenging and allows you explore many different venues, you might find a career in hospitality and tourism quite beneficial.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/4770/204770v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/4770/204770v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/4770/204770v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}