{"first_name":"Sean","last_name":"Torsney","permalink":"sean-torsney","crunchbase_url":"http://www.crunchbase.com/person/sean-torsney","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Nov 12 11:46:27 UTC 2012","updated_at":"Mon Nov 12 11:48:20 UTC 2012","overview":"<p>Sean Torsney is the Vice President of Sales and Marketing for VisualOn. Mr. Torsney has over 21 years of diverse business experience including software sales, operations, applications, and engineering. Mr. Torsney brings a proven track record of building a successful team from the ground up and driving a product to a strong market share presence despite the presence of strong entrenched competition. Prior to joining VisualOn from 1999 to 2006 Mr. Torsney was Vice President of Sales and Marketing for Verplex Systems, an EDA startup company that was acquired by Cadence Design Systems in 2003. At Verplex Systems Mr. Torsney was responsible for building a world wide sales and marketing organization from scratch. During his tenure at Verplex and Cadence he built and grew the organization to over 50 people world wide while growing revenue and achieving 70% market share.His responsibilities included coordination of sales and marketing activities including overall responsibility for negotiating and managing global accounts such as Intel, Texas Instruments, Fujitsu, Toshiba, ST, Motorola, Freescale and Philips. Prior to joining Verplex Systems in 1999 Mr. Torsney held various Sales and Application Engineering for Mentor Graphics from 1992 to 1999. Prior to joining Mentor Graphics Mr. Torsney worked for TRW as a design engineer. Mr. Torsney received his degree from the University of San Diego. </p>","image":{"available_sizes":[[[116,150],"assets/images/resized/0022/0009/220009v1-max-150x150.jpg"],[[127,164],"assets/images/resized/0022/0009/220009v1-max-250x250.jpg"],[[127,164],"assets/images/resized/0022/0009/220009v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Vice President of Sales and Marketing ","firm":{"name":"VisualOn","permalink":"visualon","type_of_entity":"company","image":{"available_sizes":[[[150,61],"assets/images/resized/0003/3540/33540v1-max-150x150.jpg"],[[185,76],"assets/images/resized/0003/3540/33540v1-max-250x250.jpg"],[[185,76],"assets/images/resized/0003/3540/33540v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}