{"first_name":"Sean","last_name":"Sullivan","permalink":"sean-sullivan-3","crunchbase_url":"http://www.crunchbase.com/person/sean-sullivan-3","homepage_url":"http://www.climbsf.com","birthplace":"Northampton, MA","twitter_username":"","blog_url":"http://www.sfdowntownliving.blogger.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1970,"born_month":2,"born_day":21,"tag_list":"","alias_list":null,"created_at":"Thu Feb 02 01:59:53 UTC 2012","updated_at":"Fri Feb 03 23:04:56 UTC 2012","overview":"<p>Sean Sullivan is Senior Sales Leader at Climb Real Estate in San Francisco. </p>\n\n<p>Sean Sullivan serves as Climb’s Senior Sales Leader, where he oversees the brokerage’s agents and resale business. With more than fifteen years in the real estate industry, Sean has sold over $600 million in real estate and built a reputation for his sales leadership in the Bay Area &#8211; from San Francisco, San Mateo, and San Jose.</p>\n\n<p>Sean has extensive experience in a variety of real estate transactions, both on the buying and on the selling sides, and expertly collaborates with attorneys, brokers, and the real estate community at large.  He has strong relationships with developers and buyers alike, who trust his honesty, market knowledge and vast experience in negotiating, renovating and problem solving.</p>\n\n<p>Prior to joining Climb, Sean was a top producer at Redfin.  In 2011, he completed 26 transactions totaling over $21 million dollars. During his tenure at Herth Real Estate, Sean learned to weather a difficult market getting great satisfaction from working with buyers and sellers.  Throughout the course of his career, Sean has a reputation for always putting his client first.  </p>\n\n<p>Sean Sullivan’s vast experience in new development and re-development includes working with Polaris Group selling 1234 Howard, and BLU.  During his 6 years as Sales Manager for The Mark Company, he worked on many new development projects including Arterra, The Hayes, The Beacon, Montebello and Miraval</p>\n\n<p>As Senior Sales Leader, he is very involved in the real estate community as a member of SFAR, CAR, and NAR.  He is also active in SPUR San  Francisco Planning &amp; Urban Research Association, California Preservation Foundation, The National Trust for Historic Preservation, GSA Networks, and Panhandle Park Stewards. Today, he continues to provide advice to his broker peers and volunteers his time teaching and participating in seminars.</p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0017/2568/172568v2-max-150x150.jpg"],[[187,250],"assets/images/resized/0017/2568/172568v2-max-250x250.jpg"],[[338,450],"assets/images/resized/0017/2568/172568v2-max-450x450.jpg"]],"attribution":"<p>Sean Sullivan</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}