{"first_name":"Serge","last_name":"Huber","permalink":"serge-huber","crunchbase_url":"http://www.crunchbase.com/person/serge-huber","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Jahia","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Feb 17 13:27:25 UTC 2009","updated_at":"Sun Jul 26 02:39:58 UTC 2009","overview":"<p>Serge Huber is the Chief Technology Office (CTO) at Jahia as well as a co-founder and the initial developer of the software. He has more than 15 years of experience in developing WCM and CMS solutions in various technologies, and is constantly striving to find new ways to build high-quality and high-performance software. He has experience in building high visibility mission critial applications for customers such as the French government or Garmin. He now overseas the development of the software as well as spending time talking to integrators and partners to help them leverage Jahia. His development skills range from assembly language to high-end data modeling tools, although currently Java is his current weapon. Previous to that, Serge worked co-created in 1999 Xo3-MyComponents and acted as the CTO until a management buy-out of the IP allowed the creation of Jahia. During his time at Xo3, Serge wrote CMS systems in both the Delphi and C++ languages, and then built upon that experience to create Jahia in Java. Prior to that, he has also worked on the Visible Human project to build high-performance extraction tools to help physicians visualize parts of the human body, and real-time augmented reality software. An early start, he developed his first application at the age of seven and won a programming competition at the age of 16 and was part of the demoscene in the Imphobia diskmag group. His current hobby is developing iPhone applications. He holds a Masters Degree in Computer Science from the Swiss Federal Institute Of Technology.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"CTO","firm":{"name":"Jahia","permalink":"jahia","type_of_entity":"company","image":{"available_sizes":[[[100,100],"assets/images/resized/0003/6360/36360v2-max-150x150.png"],[[100,100],"assets/images/resized/0003/6360/36360v2-max-250x250.png"],[[100,100],"assets/images/resized/0003/6360/36360v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}