{"first_name":"Sergio","last_name":"Bonomi","permalink":"sergio-bonomi","crunchbase_url":"http://www.crunchbase.com/person/sergio-bonomi","homepage_url":"","birthplace":"Milano","twitter_username":"bonomis","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1965,"born_month":10,"born_day":25,"tag_list":"innovative-thinking, business-modeling, business-development, management, digital-strategy, digital-marketing, digital-media, social-media-marketing, online-advertising, advertising-sales","alias_list":null,"created_at":"Fri Aug 31 06:19:50 UTC 2012","updated_at":"Sat Sep 08 12:33:45 UTC 2012","overview":"<p>Sergio is an entrepreneur and management consultant. He is the founder of PIANOadv and co-founder of HUGOWIZ. PIANOadv is a third generation digital ad-sales agency, and with HUGOWIZ, assist company and individuals in Innovation, Strategy, Organization and Communication. Sergio was business manager of Bibop Spa. Until October 2010 Sergio was the CEO and owner of the website www.university.it, the largest web community of Italian university students. Founded on 1997, it’s students network grew up to 350.000 individuals, from the most important universities in Italy.</p>\n\n<p>Sergio joined Bibop at the end of 2010 to develop strategies for products and projects.</p>\n\n<p>Sergio joined University in 1999 as a member of the Board of Directors, on 1999 Win the WWW prize of &#8220;Il Sole 24 Ore&#8221; for The Best Italian Website in “Schools and Universities”, and in September 2003 he became the CEO. He restructured the company and did many implementations and developments. In 2004 he founded ADV Company Srl, of which he is also the CEO. ADV Company is a University brand name created to provide and sell web advertising throughout the network and specializes in vertical communities and young targets. In 2005 he created B-Project, a University business unit . B-Project manages projects related with the web ensuring a great know how and knowledge for the development of web based projects.</p>\n\n<p>Sergio Bonomi was Marketing &amp; Communiction Manager of a professional soccer team of the Italian football championship of second division (Serie B) and he was in charge of official relations with the &#8220;Italian Football League&#8221; (Lega Serie A).</p>\n\n<p>In his previous experience he has been for more than 3 years the Head of Marketing, Communication and Web Marketing for TWICE Sim SpA, a leading trading online broker.</p>\n\n<p>Sergio studied Architecture at the Politecnico di Milano and has specialized in the design of multimedia communications.</p>\n\n<p>Specialties</p>\n\n<p>In 2011 he founded with Ugo Mendes Donelli the blog &#8220;Hugowiz&#8221; www.hugowiz.it with the aim to spread the techniques of business model innovation, the innovation of the strategy, the techniques of visual communication and problem solving.</p>","image":{"available_sizes":[[[129,150],"assets/images/resized/0020/9059/209059v5-max-150x150.jpg"],[[216,250],"assets/images/resized/0020/9059/209059v5-max-250x250.jpg"],[[266,307],"assets/images/resized/0020/9059/209059v5-max-450x450.jpg"]],"attribution":"<p>photo courtesy of Michele Migliarini</p>"},"degrees":[{"degree_type":"","subject":"Architecture","institution":"Politecnico di Milano","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/bonomis","title":"Linkedin"},{"external_url":"https://twitter.com/BonomiS","title":"Twitter"},{"external_url":"http://paper.li/BonomiS","title":"The Bonomis Daily"}]}