{"first_name":"Seth","last_name":"Sarelson","permalink":"seth-sarelson","crunchbase_url":"http://www.crunchbase.com/person/seth-sarelson","homepage_url":"http://www.RevTrax.com","birthplace":"Wantagh, NY","twitter_username":"Sarelson","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"revtrax, coupon, digital-coupon, sarelson","alias_list":null,"created_at":"Sat Nov 20 19:36:37 UTC 2010","updated_at":"Tue Nov 23 18:38:05 UTC 2010","overview":"<p>Mr. Sarelson is a co-founder of RevTrax, a technology company headquartered in New York City focused on bridging the gap between digital media and in-store sales for retailers, restaurants, and manufacturers.</p>\n\n<p>The RevTrax Platform provides printable couponing technology and cross-channel analytics to securely deliver, track, manage and measure in-store promotions via existing email marketing, paid search, social media, display ads, rich media, mobile, and other digital media.</p>\n\n<p>Mr. Sarelson has run the daily operations at RevTrax since the company&#8217;s formation, managing client services and RevTrax&#8217;s digital media partners. Prior to RevTrax, Seth worked in Citigroup&#8217;s Global Commercial Cards business in brand management for the Purchasing Card, Fleet Card, and Electronic Account products. In addition to his corporate activities, Mr. Sarelson has been published and quoted in a number of marketing industry publications, including AdWeek, MultiChannel Merchant, iMedia Connection, Chain Store Age and CRM Buyer. Mr. Sarelson holds a Bachelor of Science, Magna Cum Laude, from Cornell University.</p>","image":null,"degrees":[{"degree_type":"BS","subject":"","institution":"Cornell University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/sethsarelson","title":"LinkedIn"}]}