{"first_name":"Seth Michael","last_name":"Curl","permalink":"seth-michael-curl","crunchbase_url":"http://www.crunchbase.com/person/seth-michael-curl","homepage_url":"","birthplace":"","twitter_username":"SethCurl","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1976,"born_month":10,"born_day":16,"tag_list":"seth-michael-curl","alias_list":null,"created_at":"Mon Jul 16 15:16:11 UTC 2012","updated_at":"Mon Jul 16 21:03:46 UTC 2012","overview":"<p>Seth Michael Curl is a current cardiologist with over 20 years of experience. Heart disease is a major problem in the United States. Heart disease is the leading cause of death for both women and men. There are some very awakening facts about heart disease:</p>\n\n<p>• Heart disease is responsible for 25% of all deaths. This means that 1 in 4 deaths is caused by heart disease. </p>\n\n<p>• The most diagnosed type of heart disease is coronary artery disease. </p>\n\n<p>• Around 750,000 people experience a heart attack each year. A half a million people that have had one heart attack will also have another heart attack in the future. </p>\n\n<p>• For African Americans, Hispanics, and Caucasian people heart disease is the number one killer in this population. </p>\n\n<p>• The highest rates for a heart attack were in Mississippi. </p>\n\n<p>• The lowest risks for a heart attack geographically was in Minnesota. </p>\n\n<p>American men have one of the highest incidences of heart disease, and heart attack. Around 26% of men die from a heart attack. Half of the men that die of a heart attack have no previous symptoms. </p>\n\n<p>Women do not often believe they are at risk of heart attack. This can prevent them from getting the proper care they need and the proper testing and diagnosis. Women of all races and age groups can have heart disease and many women may not even know it. </p>\n\n<p>Knowing the signs and symptoms of heart disease can help you to get the care you need to keep your heart healthy. There are some extra steps that you can take at home to help you live a heart healthy life. </p>\n\n<p>• Healthy Diet-This includes eliminating saturated fats. Whole grains, fruits and vegetables should become a very important part of your diet. </p>\n\n<p>• Exercise-Many people think you need to work out for hours each day. You can make time to complete 30 minutes of physical activity just a few times per week. </p>\n\n<p>• Eliminating Stress-There are many ways to de-stress and unwind. Making sure that you take some time out to relax each day can help you to combat daily stress. </p>\n\n<p>• Healthy Weight-You should make sure that you know what your healthy weight should be. This is also dependent upon your age. </p>\n\n<p>Seth Michael Curl can give you many other suggestions to help keep your heart healthy for a long life. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}