{"first_name":"Seth","last_name":"Jacobs","permalink":"seth-jacobs","crunchbase_url":"http://www.crunchbase.com/person/seth-jacobs","homepage_url":"http://eqal.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"EQAL","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jul 23 15:09:10 UTC 2012","updated_at":"Wed Jul 25 10:26:36 UTC 2012","overview":"<p>Seth is the Senior Vice President of Sales, and he was one of the first employees at the company. Since joining Miles Beckett and Greg Goodfried as part of the original &#8216;lonelygirl15&#8217; crew in 2006, Seth has worked in and run a variety of departments at EQAL including music licensing, business development, and platform sales. In 2010 Seth took over day to day management of the combined inside sales account and operations teams and helped established EQAL&#8217;s media track record with brands like Walgreens, Nordstrom and Philly Cream Cheese.</p>\n\n<p>Seth began his media career in high school and has worked for several top-tier entertainment companies in a variety of creative and business development capacities. Seth completed his bachelor&#8217;s degree in Communications from the University of Wisconsin, Madison, during which he also lived abroad in Florence, Italy. Seth received a J.D., with honors distinction from the McCarthy School of Intellectual Property at the University of San Francisco School of Law. He has been a member of the California State Bar since 2004.\n=</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"SVP, Sales","firm":{"name":"EQAL","permalink":"eqal","type_of_entity":"company","image":{"available_sizes":[[[64,90],"assets/images/resized/0001/7414/17414v8-max-150x150.png"],[[64,90],"assets/images/resized/0001/7414/17414v8-max-250x250.png"],[[64,90],"assets/images/resized/0001/7414/17414v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}