{"first_name":"Seth","last_name":"Rupp","permalink":"seth-rupp","crunchbase_url":"http://www.crunchbase.com/person/seth-rupp","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Feb 22 15:22:48 UTC 2011","updated_at":"Tue Feb 22 15:25:23 UTC 2011","overview":"<p>Seth Rupp joined Passport in 2009 and is responsible for helping to lead development activities, infrastructure management and project management. He provides leadership for the organization’s technical roadmap, development commitments and goals and helps Passport leverage its extensive technical capabilities to meet the needs of clients and strengthen client relationships.</p>\n\n<p>Rupp was with Cerner Corporation for more than 10 years and held several executive positions, most recently Vice President and Executive Leader – Academic and Children’s Segment. Before that he was Senior Manager with Grant Thornton and was also with Andersen Consulting (now Accenture). His career includes technology consulting and engineering, technical integration, product launch and strategic leadership in many different health care areas from pediatrics to financial services.</p>\n\n<p>Rupp earned a bachelor’s degree from the University of Kansas and a Master of Science in Business Administration from Rockhurst University in Kansas City, Mo. He has been and is currently involved in several professional and civic activities such as the Aurora Healthcare (Wisc.) Software Best Practices Committee, the University of Kansas Alumni Board of Chapter Advisors and the Kansas City Nelson-Atkins Museum of Arts Business Council.</p>","image":{"available_sizes":[[[125,129],"assets/images/resized/0012/3403/123403v1-max-150x150.jpg"],[[125,129],"assets/images/resized/0012/3403/123403v1-max-250x250.jpg"],[[125,129],"assets/images/resized/0012/3403/123403v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Chief Technology Officer","firm":{"name":"Passport Health Communications","permalink":"passport-health-communications","type_of_entity":"company","image":{"available_sizes":[[[150,30],"assets/images/resized/0012/3397/123397v2-max-150x150.jpg"],[[250,51],"assets/images/resized/0012/3397/123397v2-max-250x250.jpg"],[[382,78],"assets/images/resized/0012/3397/123397v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}