{"first_name":"Seth","last_name":"Besmertnik","permalink":"seth-besmertnik","crunchbase_url":"http://www.crunchbase.com/person/seth-besmertnik","homepage_url":"","birthplace":"New York","twitter_username":null,"blog_url":"http://www.conductor.com/news/company+news","blog_feed_url":"","affiliation_name":"LinkExperts","born_year":null,"born_month":null,"born_day":null,"tag_list":"besmertnik, entrepreneur, linkexperts, natural-search, saas, seo, conductor, search-marketing, founder","alias_list":null,"created_at":"Fri May 23 02:00:37 UTC 2008","updated_at":"Mon Sep 15 00:19:10 UTC 2008","overview":"<p>Seth Besmertnik is the CEO &amp; Co-Founder at <a href=\"http://www.crunchbase.com/company/conductor-inc\" title=\"Conductor, Inc.\">Conductor, Inc.</a> in New York City. Besmertnik guides corporate strategy through his vision and thought leadership of Conductor&#8217;s products and his development of the strategic partnerships and relationships which have established both the company and himself as recognized authorities in Natural Search. Since co-founding the company in 2005, Besmertnik has navigated Conductor through multiple financings and extraordinary growth. Today the company has over forty employees and boasts a client list of more than one hundred Fortune 500 and Internet Retailer 500 companies and hundreds of the world’s most recognized publishers. In addition, Conductor provides Natural Search solutions for more than half the top search engine marketing and optimization agencies in the United States.</p>\n\n<p>Besmertnik’s passion for entrepreneurial business development is grounded in his early experiences in enterprise software sales &amp; real estate development. During the years prior to Conductor, he achieved several sales and achievement awards while spending his evenings attending business school. In 2003, Besmertnik successfully founded health portal MindMD.com, where he learned and developed the innovative search practices that later became the foundation of Conductor’s marketing solutions.</p>\n\n<p>Besmertnik received his Bachelors Degree in Entrepreneurial Management from Baruch College&#8217;s Zicklin School of Business. Additionally, Besmertnik frequently speaks as an expert in search marketing at industry events and is also a frequent guest lecturer on entrepreneurship at various universities including NYU and Baruch College.</p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0001/9212/19212v2-max-150x150.jpg"],[[80,80],"assets/images/resized/0001/9212/19212v2-max-250x250.jpg"],[[80,80],"assets/images/resized/0001/9212/19212v2-max-450x450.jpg"]],"attribution":"<p>Seth Besmertnik</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"CEO and Co-founder","firm":{"name":"Conductor","permalink":"conductor","type_of_entity":"company","image":{"available_sizes":[[[150,42],"assets/images/resized/0002/3239/23239v4-max-150x150.jpg"],[[250,71],"assets/images/resized/0002/3239/23239v4-max-250x250.jpg"],[[420,120],"assets/images/resized/0002/3239/23239v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/besmertnik","title":"LinkedIn Profile"},{"external_url":"http://www.conductor.com/about/management","title":"Conductor's Management Team"}]}