{"first_name":"sexy","last_name":"sexylingerie","permalink":"sexy-sexylingerie","crunchbase_url":"http://www.crunchbase.com/person/sexy-sexylingerie","homepage_url":"http://www.sexysexylingerie.co.uk/","birthplace":"Wolverhampton","twitter_username":"AliciaCorsets","blog_url":"http://www.sexysexylingerie.co.uk/news","blog_feed_url":"http://www.sexysexylingerie.co.uk/rss/catalog/special/store_id/1/cid/0/","affiliation_name":"Unaffiliated","born_year":1980,"born_month":8,"born_day":18,"tag_list":"sexy-lingerie, lingerie, plus-size-lingerie, babydolls, corsets, bustiers, stockings, erotic-lingerie, dreamgirl-lingerie, shirley-of-hollywood-lingerie, hustler-lingerie","alias_list":null,"created_at":"Thu Sep 09 11:47:34 UTC 2010","updated_at":"Fri Aug 05 17:22:51 UTC 2011","overview":"<p>Sexy isn&#8217;t defined by body size or shape, sexy is confidence, real beauty, and the power to be the best you. Our plus size lingerie is designed to celebrate your beautiful curves and accentuate all those assets.\nWhen it comes to feeling sexy, body size is irrelevant. Loving yourself is the essential key to building and nurturing a loving, passionate relationship. Ultimately it’s the attitude of confidence that drives the passion in a relationship. Nothing is sexier than a self-assured woman in touch with her sexuality.\nPlus size lingerie is designed to let plus size women know that they deserve to be and feel sexy every day. Far from being dowdy and full-coverage, plus size lingerie shows off your curves and celebrates you for the beautiful and sexy woman that you are.\nLet’s take the plus size babydoll for example; they are undoubtedly one great piece of lingerie! Not only will plus size babydoll lingerie make you look sexy, it will also make you feel sexy!  There are many different designs and materials for babydoll dresses to choose from; the selections are endless. You may choose from the simplest silk whites to the most daring see though reds.\nSo plus size women, look no further! Here at sexysexylingeire.co.uk we have designated a whole section of our website for you – the big, beautiful woman. we pride ourselves in providing plus size lingerie in almost any imaginable style, including plus size teddies, corsets, bustiers, babydolls and  chemises, stockings and tights, thongs and g-strings. Not forgetting those super sexy and daring plus size body stockings. We also provide a wide range of sexy plus size costumes to make any fantasy come to life! We offer the hottest and most sensual styles to make any woman become a living fantasy. Check out our women’s plus size costumes for police officers, nurses, school girls, French maids, and a whole lot more. The possibilities are endless!</p>","image":{"available_sizes":[[[150,21],"assets/images/resized/0010/1107/101107v2-max-150x150.png"],[[250,36],"assets/images/resized/0010/1107/101107v2-max-250x250.png"],[[350,51],"assets/images/resized/0010/1107/101107v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://victoriasecretcouponscodes.blogspot.com","title":"Free codes"}],"web_presences":[{"external_url":"http://www.sexysexylingerie.co.uk/lingerie-sets/lingerie","title":"Lingerie"},{"external_url":"http://www.sexysexylingerie.co.uk/babydolls","title":"Babydolls"}]}