{"first_name":"Shaharia","last_name":"Azam","permalink":"shaharia-azam","crunchbase_url":"http://www.crunchbase.com/person/shaharia-azam","homepage_url":"http://www.shahariaazam.com","birthplace":"Satkhira, Bangladesh","twitter_username":"shaharia","blog_url":"http://www.shahariaazam.com","blog_feed_url":"","affiliation_name":"Preview ICT","born_year":1988,"born_month":11,"born_day":26,"tag_list":"web-developer, researcher, web, internet, seo, freelancer, bangladesh, php-programmer","alias_list":null,"created_at":"Thu Sep 27 04:51:58 UTC 2012","updated_at":"Fri Oct 12 20:33:15 UTC 2012","overview":"<p>I am G. M. Shaharia Azam, a professional web developer in Bangladesh. I am the managing director of Preview ICT, a leading web development company in Dhaka, Bangladesh.</p>\n\n<p>My passion and interest is with web design, web development, web technology. From the age of 14, I wished to develop a website that likes of Yahoo!, Google . The reason is that I use these website’s feature a great deal. Google impresses me as it is an opportunity to bring the world much closer , and from this I am aiming and thinking how I too may play many part in this wonderful world. Prior to now, I have studied in Dhaka College in B.Sc in Mathematics. But mathematics is not my true passion. I know mathematics is a very useful subject for technician, engineer, programmer and it has helped me a great deal. But even after studying it other things were more appealing. Finally I made the decision? to study in Computer Science &amp; Engineering. And I now study that.</p>\n\n<p>I can honestly say that I love working with computers! I love to use computer and now computer is my true passion, it’s the main thing I spent most of the time involded with, and enjoy every minute. Besides my study, I also work as a professional web developer.? Besides my experience in wewebsite design, web programming and dynamic web application development, my specialization is the usage of Web 2.0 Technology. I see myself as a “Web Scientist” because of my methodical and focused approach to developing greater knowledge in the area. I have studyed, read, applied and improved many years of Web 2.0? from every corner of the world. Google is a wonderful teacher, and for this I call Google my mother of knowledge. I have to say that I love my work. I organize myself properly and make the most time for the work I do. The funny thing is that I study after my work. I love to work much more than I like study. Yes, that’s me, it may sound funny, but it’s true! My areas of expertise are:</p>\n\n<p>What’s my favorite: Favorite Person: Tim Berners Lee (He is the inventor of my tools helping my success) Favorite Time: Evening (Basically I enjoy this time with my friends, colleagues, students). Favorite Teacher: Yusuf M Islam (Associate Professor, Daffodil International University). His speech and attitude inspire me. I wish you the best and God Bless You, I appreciate your Prayers for me. GOD is almighty.</p>","image":{"available_sizes":[[[128,128],"assets/images/resized/0021/3260/213260v2-max-150x150.png"],[[128,128],"assets/images/resized/0021/3260/213260v2-max-250x250.png"],[[128,128],"assets/images/resized/0021/3260/213260v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Preview ICT","permalink":"preview-ict","type_of_entity":"company","image":{"available_sizes":[[[150,49],"assets/images/resized/0021/5384/215384v2-max-150x150.jpg"],[[220,73],"assets/images/resized/0021/5384/215384v2-max-250x250.jpg"],[[220,73],"assets/images/resized/0021/5384/215384v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.shahariaazam.com","title":"Personal Website"},{"external_url":"https://www.facebook.com/shahariaazamweb","title":"Facebook Fan Page"},{"external_url":"http://twitter.com/shaharia","title":"Twitter"},{"external_url":"https://plus.google.com/114541364064474970092","title":"Google+ Profile"}]}