{"first_name":"Shantanu","last_name":"Narayen","permalink":"shantanu-narayen","crunchbase_url":"http://www.crunchbase.com/person/shantanu-narayen","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"web-2-0-summit","alias_list":null,"created_at":"Fri Feb 29 08:55:14 UTC 2008","updated_at":"Sat Mar 24 03:35:10 UTC 2012","overview":"<p>Shantanu Narayen is president and chief executive officer of Adobe, one of the world’s largest and most diversified software companies. Narayen’s leadership, technology insight and operational expertise have strengthened Adobe’s culture of innovation, expanded the company into new markets, and extended its product portfolio and global reach. In 2005, Narayen co-led the $3.4 billion acquisition of Macromedia, expanding Adobe’s software platform and solutions, and strengthening the company’s presence in key markets ranging from enterprises and vertical industries to mobile devices and multimedia publishing.</p>\n\n<p>Prior to his appointment as CEO in December of 2007, Narayen was Adobe’s president and COO, responsible for the company’s day-to-day global operations, product research and development, marketing and corporate development. Previously, he held key product research and development positions within Adobe, including executive vice president of worldwide products, senior vice president of worldwide product development and vice president and general manager of the engineering technology group.</p>\n\n<p>Before joining Adobe in 1998, Narayen was co-founder of Pictra, Inc., an early pioneer of digital photo sharing over the Internet. Prior to that, he served as director of desktop and collaboration products at Silicon Graphics, Inc. and held various senior management positions at Apple Computer, Inc. Narayen holds five patents and is a frequent speaker at industry and academic events. He serves on the Board of Metavante Technologies, Inc. and the Advisory Board of the Haas School of Business, University of California at Berkeley. Narayen holds a bachelor’s degree in electronics engineering from Osmania University in India, a master’s degree in computer science from Bowling Green State University and a master’s degree in business administration from the Haas School of Business.</p>","image":{"available_sizes":[[[130,150],"assets/images/resized/0006/2747/62747v1-max-150x150.jpg"],[[217,250],"assets/images/resized/0006/2747/62747v1-max-250x250.jpg"],[[261,300],"assets/images/resized/0006/2747/62747v1-max-450x450.jpg"]],"attribution":"<p>Adobe</p>"},"degrees":[],"relationships":[{"is_past":true,"title":"President & CEO","firm":{"name":"Adobe Systems","permalink":"adobe-systems","type_of_entity":"company","image":{"available_sizes":[[[56,66],"assets/images/resized/0001/3687/13687v1-max-150x150.png"],[[56,66],"assets/images/resized/0001/3687/13687v1-max-250x250.png"],[[56,66],"assets/images/resized/0001/3687/13687v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}