{"first_name":"Shane","last_name":"Robison","permalink":"shane-robison","crunchbase_url":"http://www.crunchbase.com/person/shane-robison","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Mar 06 20:40:43 UTC 2008","updated_at":"Wed Oct 14 23:26:25 UTC 2009","overview":"<p>Shane Robison is Chief Strategy and Technology at <a href=\"/company/hewlett-packard\" title=\"Hewlett-Packard\" rel=\"nofollow\">Hewlett-Packard</a>, responsible for shaping HP’s overall corporate strategy and technology agenda, and oversees the company’s corporate marketing function. He steers the company’s $3.6 billion research and development investment and fosters the development of the company’s global technical community. All of the company’s senior chief technology officers and the director of HP Labs report into him.</p>\n\n<p>Robison also leads the company’s strategy and corporate development efforts, including mergers, acquisitions, divestitures, intellectual property licensing, venture capital community and partnerships. He was one of four principal architects of HP’s merger with Compaq Computer Corp., and, in 2004, InfoWorld declared Robison one of the world’s 25 most influential chief technology officers. Robison also has responsibility for worldwide corporate marketing activities, including external and internal communications, brand marketing, customer intelligence and corporate affairs.</p>\n\n<p>Robison was senior vice president and chief technology officer of Strategy and Technology at Compaq. Prior to joining Compaq, Robison was president of Internet Technology and Development at AT&amp;T Labs, where he led a 2,000-person team that was responsible for the architecture, planning and development of all of AT&amp;T’s Internet technologies and services.</p>\n\n<p>Robison also was president of the Design Productivity Group at Cadence Design Systems and, prior to that, spent several years at Apple Computer, where he was vice president and general manager of the Personal Interactive Electronics Division. He also held a research management position at Schlumberger’s artificial intelligence lab in Palo Alto.</p>\n\n<p>Robison received bachelor’s and master’s degrees in computer science from the University of Utah.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0006/2749/62749v2-max-150x150.jpg"],[[200,250],"assets/images/resized/0006/2749/62749v2-max-250x250.jpg"],[[360,450],"assets/images/resized/0006/2749/62749v2-max-450x450.jpg"]],"attribution":"<p>HP</p>"},"degrees":[],"relationships":[{"is_past":true,"title":"CTO, Chief Strategy Officer","firm":{"name":"Hewlett-Packard","permalink":"hewlett-packard","type_of_entity":"company","image":{"available_sizes":[[[145,150],"assets/images/resized/0001/4529/14529v5-max-150x150.jpg"],[[242,250],"assets/images/resized/0001/4529/14529v5-max-250x250.jpg"],[[291,300],"assets/images/resized/0001/4529/14529v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}