{"first_name":"Shannon","last_name":"Dwyer","permalink":"shannon-dwyer","crunchbase_url":"http://www.crunchbase.com/person/shannon-dwyer","homepage_url":"http://www.thekeenmachine.com","birthplace":"Norwalk, CA","twitter_username":"mlledwyer","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1974,"born_month":12,"born_day":13,"tag_list":"marketing, creative-director, entrepreneur, design, efficient, long-beach, ca, witty, funny","alias_list":null,"created_at":"Mon Nov 08 20:05:53 UTC 2010","updated_at":"Wed Nov 10 00:35:35 UTC 2010","overview":"<p>Shannon is a Marketing &amp; Creative Director and Founder of The Keen Machine, A Long Beach, CA based creative agency. Shannon is passionate about efficiency and has an all-encompassing understanding of the &#8220;big picture,&#8221; which she uses to fosters her drive and commitment to each business she serves. Shannon loves to provide skilled and intelligent insight into what &#8220;is&#8221; and what &#8220;could be&#8221; and hopes to one day rule the world&#8230; with her dry wit and sometimes odd sense of humor&#8230; Even if it is just her own little world.</p>\n\n<p>Having spent her career listening and learning from the top tier of the corporate world, Shannon wanted to make an impact on a larger scale with her clear and concise understanding of the development process, she garners her experience as a Marketing executive with her design prowess and creates masterful and influential projects both as a leader and as a team member in the trenches.</p>\n\n<p>On the flip side, Shannon has spent her life working to better the lives of those around her. At the ripe-old age of 16, in the height of teenage pregnancy in 1991, Shannon became a statistic and had her daughter, forever changing her (limited) understanding of the world around her. She graduated high school in 1993 and with her 2 year old daughter in tow, set off into the world. Fast forward to today, Shannon has an A.A. in Fashion Design, a B.S. in Marketing and over 15 years of graphic design experience. Her daughter is a Sophomore in College and building her own foundation for the rest of her life.</p>\n\n<p>Marking her daughters accomplishments and newly achieved status as &#8220;adult,&#8221; Shannon decided the timing was right to venture out of the corporate world and pave a path of her own. Along came The Keen Machine&#8230; Established in January of 2010, The Keen Machine has steadily been growing it&#8217;s client base and forever improving the expectations of her clients by being a single resource for Marketing, Design, Print and Web. Convenience and quality is the name of the game and Shannon is an avid fan of the sport &#8220;extreme CRM.&#8221;</p>","image":null,"degrees":[{"degree_type":"B.S.","subject":"Marketing","institution":"University of Phoenix","graduated_year":2007,"graduated_month":null,"graduated_day":null},{"degree_type":"A.A.","subject":"Fashion Design","institution":"Brooks College","graduated_year":2005,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.thekeenmachine.com","title":"The Keen Machine Website"},{"external_url":"http://www.facebook.com/thekeenmachine","title":"The Keen Machine Facebook"},{"external_url":"http://www.facebook.com/fiercemagz","title":"Fierce Magazine Facebook"},{"external_url":"http://www.fiercepublications.com/","title":"Fierce Magazine Website"}]}