{"first_name":"Shankar","last_name":"Chandran","permalink":"shankar-chandran","crunchbase_url":"http://www.crunchbase.com/person/shankar-chandran","homepage_url":"http://panoramacapital.com/tm_shankar_chandran.html","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Panorama Capital","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Nov 25 06:47:12 UTC 2008","updated_at":"Fri Oct 28 01:48:24 UTC 2011","overview":"<p>Shankar is a Partner and part of the founding team at Panorama Capital. He currently focuses on venture capital investments in communication infrastructure, core technology and investments in the mobile space. Shankar has been an active venture investor for 9 years at Panorama Capital and previously at JPMorganPartners. He is deeply passionate about building game changing technology businesses and partnering with outstanding entrepreneurs and management teams. Shankar currently brings his passionate commitment to excellence serving as a director on the boards of Zoove, Validity and Neoconix. Previously Shankar was involved either as a director or observer with the firm’s investments in CHiL Semiconductor (acquired by International Rectifier), Reflectivity (acquired by TI), Valere Power (acquired by Eltek), Portalplayer (acquired by Nvidia) and Tagsys RFID.</p>\n\n<p>Shankar started his career as an engineer in the semiconductor industry in Silicon Valley where he enjoyed solving technical problems and building products. From 1995 to 2000, Shankar held various engineering, business development, and management roles at Applied Materials, Inc., and has been granted seven patents as the primary inventor. He also serves on the Advisory Board of Center for Innovation and Entrepreneurship at the Santa Clara University.</p>\n\n<p>Shankar holds a B.Tech in Metallurgical Engineering from the Institute of Technology, BHU (India), an M.S. in Materials Science from Arizona State University, and an M.B.A. from The Wharton School of the University of Pennsylvania.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Panorama Capital","permalink":"panorama-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,44],"assets/images/resized/0002/9522/29522v1-max-150x150.png"],[[250,73],"assets/images/resized/0002/9522/29522v1-max-250x250.png"],[[305,90],"assets/images/resized/0002/9522/29522v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}