{"first_name":"Shane","last_name":"Lennon","permalink":"shane-lennon","crunchbase_url":"http://www.crunchbase.com/person/shane-lennon","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue May 17 12:03:16 UTC 2011","updated_at":"Tue May 17 12:04:09 UTC 2011","overview":"<p>Shane Lennon is a tried and tested consumer market expert with proven success in emerging technologies, market development, social media, and product to market fit and distribution in the consumer digital space. </p>\n\n<p>Prior to Tabula Digita (DimensionU), Shane was Senior Vice President of Strategy, Marketing &amp; Product Management at GyPSii, a mobile location-based social networking platform. At GyPSii Shane was responsible for global strategy, product management, and marketing. In addition he managed the establishment of beachhead relationships for GyPSii ecosystem partnerships such as advertising and content. He put in place the consumer and business facing brand, the go-to-market strategy, creative concepts, audience profiling and consumer acquisition programs that led to viral growth of 3M users.</p>\n\n<p>Prior to GyPSii, Shane was Chief Marketing Officer (and interim CTO) at Ibis Consulting, a hosted electronic discovery-processing provider, which was acquired by Pitney Bowes Management Services where he assumed the role of Vice President of Strategy &amp; Marketing in Legal Markets. Before that he was Vice President of Strategy &amp; Marketing at Context Media, an Enterprise Content Integration platform, later acquired by Oracle. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP, Marketing","firm":{"name":"DimensionU (formerly Tabula Digita)","permalink":"tabula-digita","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0002/3626/23626v5-max-150x150.jpg"],[[250,83],"assets/images/resized/0002/3626/23626v5-max-250x250.jpg"],[[450,150],"assets/images/resized/0002/3626/23626v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}