{"first_name":"Shannon","last_name":"Callahan","permalink":"shannon-callahan","crunchbase_url":"http://www.crunchbase.com/person/shannon-callahan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Andreessen Horowitz","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jun 21 00:50:11 UTC 2010","updated_at":"Mon Jul 05 22:14:51 UTC 2010","overview":"<p>Shannon Callahan is a partner at the venture capital firm, <a href=\"http://www.crunchbase.com/company/andreessenhorowitz\" title=\"Andreessen Horowitz\">Andreessen Horowitz</a>.</p>\n\n<p>Before joining Andreessen Horowitz, Shannon was director of human resources at Hewlett Packard Software and Solutions. During her tenure at HP, she ran the HR business function for the global BTO organization and partnered with its leadership team to determine growth strategy, hiring plans and retention of critical talent.  </p>\n\n<p>Prior to HP, she was senior director of human resources at Opsware, a global enterprise software company. In her role there, she ran the HR organization, inclusive of staffing, compensation, organizational design and general HR programs. She also implemented staffing strategy to recruit best technical and field talent to Opsware. Before working for Opsware, Shannon served as recruiter and staffing consultant for Loudcloud. She was the lead recruiter in Loudcloud’s Operations organization, where she was responsible for building out the network operations center organization as well as SA’s NE’s and applications engineers. She also led efforts of building the Eastern Region – Professional Services Organization. </p>\n\n<p>In the mid 90s, Shannon was a staffing consultant to at Cisco Systems. As a member of Customer Advocacy organization, she sourced and hired IT talent to aggressive hiring goals. </p>\n\n<p>Shannon received her bachelor of arts degree in psychology from Santa Clara University. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Andreessen Horowitz","permalink":"andreessen-horowitz","type_of_entity":"financial_org","image":{"available_sizes":[[[150,73],"assets/images/resized/0006/5679/65679v2-max-150x150.jpg"],[[250,122],"assets/images/resized/0006/5679/65679v2-max-250x250.jpg"],[[432,212],"assets/images/resized/0006/5679/65679v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}