{"first_name":"Shane","last_name":"Canavan","permalink":"shane-canavan","crunchbase_url":"http://www.crunchbase.com/person/shane-canavan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Mayfair Gaming Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Nov 30 21:35:51 UTC 2008","updated_at":"Mon Dec 22 22:02:12 UTC 2008","overview":"<p>Shane completed his studies he earnestly began to pursue a career in sales and marketing – his first role was a three year tenure as a consultant in the recruitment industry for a leading Dublin based resourcing agency where he regularly achieved his targets.</p>\n\n<p>Shane then relocated to Melbourne, Australia where he took tenure as Business Development Executive for Broadscope Training Services, an innovative provider of private workplace based training where he constantly achieved the aggressive benchmarks set and helped spearhead the twenty-five person sales team and ultimately positioning the company as the leading IT based training company in Australia.  </p>\n\n<p>After Broadscope, Shane continued his career in the training industry moving to Corpfit Training where he again exceeded sales targets winning a string of sales awards and recognition as a leading sales professional.</p>\n\n<p>In 2005 Shane returned to Ireland and moved his focus to online, media and digital advertising sales with NeedaHotel.com where he retained the title of UK Sales Account Manager for 18 months.</p>\n\n<p>Identifying that the web and mobile sector was taking more and more precedence in advertising spend, he recently took tenure at SalesOnline, Irelands largest online performance marketing and advertising agency where his responsibilities include the development of market related business plans, setting promotional and marketing budgets and contractual negotiations with key business partners.</p>\n\n<p>Shane holds a Diploma of Sales and Marketing from the Australian University.</p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0003/1182/31182v2-max-150x150.jpg"],[[187,250],"assets/images/resized/0003/1182/31182v2-max-250x250.jpg"],[[317,422],"assets/images/resized/0003/1182/31182v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CMO","firm":{"name":"Mayfair Gaming Group","permalink":"mayfair-gaming-group","type_of_entity":"company","image":{"available_sizes":[[[150,75],"assets/images/resized/0003/0454/30454v2-max-150x150.png"],[[150,75],"assets/images/resized/0003/0454/30454v2-max-250x250.png"],[[150,75],"assets/images/resized/0003/0454/30454v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}