{"first_name":"Shane","last_name":"Ginsberg","permalink":"shane-ginsberg","crunchbase_url":"http://www.crunchbase.com/person/shane-ginsberg","homepage_url":"http://www.organic.com","birthplace":"","twitter_username":"Shaneginsberg","blog_url":"http://www.threeminds.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Aug 10 15:22:58 UTC 2010","updated_at":"Tue Aug 10 17:49:53 UTC 2010","overview":"<p>Ginsberg is VP of Corporate Development at Organic where he runs the agency’s quarterly Camp Organic event, helps develop Organic’s corporate strategies and spearheads new business efforts throughout the Organic network. His direction has led to the development of ongoing marketing partnerships with Anheuser-Busch, Intel, Microsoft, Nike Canada, VeriSign, and others. </p>\n\n<p>Ginsberg’s digital career began where it is now, at Organic, where he worked on the first Websites ever built and helped invent the medium. In 1996, Ginsberg left Organic to form his own company, Plastic, which became the fourth-largest interactive firm in San Francisco. When Plastic sold to Razorfish in 1998, Ginsberg became a founder of Razorfish San Francisco where he engaged in more than 100 interactive relationships with clients such as Microsoft, McKinsey &amp; Co., and Cisco. Following this venture he joined AKQA San Francisco as Managing Director where helped build their offering, including brands like Nike and XBOX. It was after his time at AKQA that Ginsberg decided to go full circle and return to Organic. </p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0009/6891/96891v2-max-150x150.jpg"],[[200,200],"assets/images/resized/0009/6891/96891v2-max-250x250.jpg"],[[200,200],"assets/images/resized/0009/6891/96891v2-max-450x450.jpg"]],"attribution":"<p>Organic, Inc.</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}