{"first_name":"Shandale","last_name":"Tucker","permalink":"shandale-tucker","crunchbase_url":"http://www.crunchbase.com/person/shandale-tucker","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Lovetropolis.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jun 18 17:18:10 UTC 2009","updated_at":"Fri Jun 19 19:07:09 UTC 2009","overview":"<p>Ms. Tucker&#8217;s impressive professional qualifications in sales and customer care and educational background in finance, communication science and technology, and business have readied her to supervise operations for Lovetropolis.com.  She is skilled in customer retention and demonstrates principled business ethics and a strong professional work doctrine.</p>\n\n<p>Ms. Tucker attended Texas Tech University where her major areas of study were Financial Planning and Telecommunications.  She is currently pursuing a degree in Business Management.  Ms. Tucker has over 15 years experience in sales and customer service in the private sector with prominent employers like Wells Fargo.</p>\n\n<p>As Executive Vice President of Operations, Ms. Tucker&#8217;s general functions include managing the treasury, banking and insurance activities of The Lombard Company, Inc.; directing and implementing the overall regulatory strategy for the corporation to support its broad goals and objectives; providing leadership on strategic, tactical and operational issues; formulating, developing and translating appropriate policies for the company; monitoring performance indicators and initiating corrective actions (as needed); making written recommendations for changes and improvements to existing policies and procedures; and designing solutions using services and technologies.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Executive Vice President of Operations","firm":{"name":"Lovetropolis.com","permalink":"lovetropolis-com","type_of_entity":"company","image":{"available_sizes":[[[150,22],"assets/images/resized/0004/9655/49655v2-max-150x150.png"],[[250,36],"assets/images/resized/0004/9655/49655v2-max-250x250.png"],[[450,66],"assets/images/resized/0004/9655/49655v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}