{"first_name":"Sharon","last_name":"Vosmek","permalink":"sharon-vosmek","crunchbase_url":"http://www.crunchbase.com/person/sharon-vosmek","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Astia","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Nov 08 18:46:39 UTC 2010","updated_at":"Wed Apr 04 06:41:15 UTC 2012","overview":"<p>“Research proves that if women were able to fully participate in high growth entrepreneurship, we would see a significant and measurable benefit to the economy, innovation and society.  Astia’s mission is to create an inclusive community that provides the precise support women entrepreneurs need to thrive in their enterprises and ultimately impact today’s global economy.”</p>\n\n<p>As CEO of Astia, Sharon Vosmek has an unwavering passion and uniquely well-suited background to drive forward the company’s mission of propelling women-owned, high growth, entrepreneurial businesses to success.   Sharon draws from her expertise in public policy, economic gender analysis, management consulting and entrepreneurship to build Astia’s powerful network of diverse resources that serve to mobilize and help promising, women-led businesses thrive.   </p>\n\n<p>In the role of CEO, Sharon has led the effort to double Astia’s resources, which include the mentors, coaches, sponsors, investors, thought-leaders and serial entrepreneurs that provide Astia member companies with counsel, coaching, guidance and advancement opportunities.  </p>\n\n<p>She has expanded Astia’s Entrepreneur Program, which holds the potential to transform high growth startups into market leaders by giving them unprecedented access to Astia’s global network of Angels, VCs, corporations and entrepreneurs, as well as expert personal coaching.  The program is now held in Silicon Valley, New York, and London.</p>\n\n<p>Sharon also founded the Technology Planning Committee that created Astia’s Entrepreneur Program.   This program has resulted in, on average, 60 percent of the participating companies securing funding or achieving a successful exit within one year of presenting, totaling more than $1 billion dollars raised and 23 exits, including two IPOs. </p>\n\n<p>Sharon has served as CEO of Astia since 2007, previously joining the company as COO in 2004.</p>\n\n<p>Ms. Vosmek currently serves as founder and lead of the We Own It Collaboration, an effort of over 65 organizations globally committed to exploring women’s participation in high growth businesses and identifying solutions to move us forward.</p>\n\n<p>In everything she does for Astia and throughout her career, Sharon seeks to create outstanding organizations that inspire individuals, foster creativity, and promote personal and professional growth. For the past two decades, she has worked with both for-profit and non-profit organizations to build more humane organizations that produce exceptional results.  </p>\n\n<p>Prior to joining Astia, Sharon founded SJ Vosmek &amp; Associates, a management firm that included clients such as PG&amp;E, PacBell (now AT&amp;T) and the University of Wisconsin Madison.  She held management positions at American Express and in the office of United States Senator, Dennis DeConcini.   </p>\n\n<p>She currently serves on the Steering Committee for the Cherie Blair Foundation, the Stevenage Bioscience Catalyst Experts Advisor Group, Illuminate Ventures Advisory Board, and the City of San Francisco Mayor’s Commission on Biotech (MayBAC).  In September 2011, Sharon served as a member of the U.S. delegation to the Asia-Pacific Economic Cooperation (APEC) Women and the Economy Summit (WES), the first-ever such meeting held by the premier economic organization in the region, focusing on finding ways to increase women’s economic participation in the region.</p>\n\n<p>A sought-after speaker, Sharon was invited to participate in The White House Women’s Entrepreneurship Conference and The Presidential Summit on Entrepreneurship led by Secretary of State Hillary Clinton. In January 2011, Astia was chosen to join the White House’s StartUP America initiative, developed to celebrate, inspire, and accelerate high-growth entrepreneurship throughout the nation.</p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0012/9371/129371v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0012/9371/129371v2-max-250x250.jpg"],[[450,300],"assets/images/resized/0012/9371/129371v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Masters","subject":"Public Policy","institution":"University Wisconsin, Madison","graduated_year":1995,"graduated_month":null,"graduated_day":null},{"degree_type":"BS","subject":"Political Science","institution":"Arizona State University","graduated_year":1989,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Astia","permalink":"astia","type_of_entity":"company","image":{"available_sizes":[[[150,33],"assets/images/resized/0011/6174/116174v1-max-150x150.png"],[[199,44],"assets/images/resized/0011/6174/116174v1-max-250x250.png"],[[199,44],"assets/images/resized/0011/6174/116174v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.businessweek.com/smallbiz/content/jun2010/sb20100623_705672.htm","title":"Closing the Venture Capital Gap"}],"web_presences":[{"external_url":"http://astia.org","title":"Astia"},{"external_url":"http://www.linkedin.com/in/sharonvosmek","title":""},{"external_url":"https://twitter.com/#!/vosmek","title":"@vosmek"}]}