{"first_name":"Shatec","last_name":"Singapore","permalink":"shatec-singapore","crunchbase_url":"http://www.crunchbase.com/person/shatec-singapore","homepage_url":"http://www.shatec.sg","birthplace":"","twitter_username":"myshatec","blog_url":"http://www.shatec.sg/en/about-us/shatec-institutes-at-a-glance","blog_feed_url":"","affiliation_name":"Shatec Singapore","born_year":null,"born_month":null,"born_day":null,"tag_list":"hotel-mgmt-institute, baking-classes, management-hotel, cullinary-schools, institute-culinary, school-culinary, management-hospitality, hospitality-and-management, hospitality-management, hotel-school, culinary-institute-of, culinary-schools-in, managemen","alias_list":null,"created_at":"Sun Aug 07 08:02:55 UTC 2011","updated_at":"Mon Aug 08 20:04:54 UTC 2011","overview":"<p>Shatec Institutes is one of Asia’s hospitality and tourism education provider. Founded by Singapore Hotel Association (SHA) in 1983, Shatec takes pride in having moulded tourism and culinary graduates of calibre in its 27-year history with more chief executives, general managers, executive chefs and tourism entrepreneurs employed around the world than any other institution in the region.</p>\n\n<p>For those studying with us, Shatec Institutes provides a distinctive programme of academic study with emphasis both on professional practice and soft skills to enhance the individual’s interactions, performance and career prospects. Through tie-ups and internship arrangements with the hospitality and tourism lifestyle industry, and practicum at our commercial restaurant, Recipes, our hosts will receive an education that is relevant to prepare them for their career.</p>\n\n<p>Shatec Institutes has articulation arrangements with the University of Massachusetts Amherst, USA, Lincoln University, New Zealand, Glion Institute of Higher Education, Switzerland and Les Roches International School of Hotel Management, Switzerland. These arrangements allow students to transfer credits for higher education at foreign universities.</p>\n\n<p>Our campus has evolved into a friendly, cosmopolitan and interactive environment with a diverse community of more than 1,400 hosts from over 25 countries. Shatec Institutes maintains strong links with more than 25,000 alumni at work in more than 30 countries to enable interaction and exchange of ideas in the industry.</p>\n\n<p>Shatec Institutes will continue to build on our strengths to become Asia’s foremost institution for human capital development and thought leadership in the hospitality industry. As we grow and advance with exciting developments to complement the changing hospitality and tourism lifestyle landscape, we are confident that Shatec Institutes will continue to mould the movers and shakers needed for the vibrant hospitality industry.</p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0014/8212/148212v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0014/8212/148212v2-max-250x250.jpg"],[[450,299],"assets/images/resized/0014/8212/148212v2-max-450x450.jpg"]],"attribution":"<p>Shatec in Singapore</p>"},"degrees":[],"relationships":[{"is_past":true,"title":"Marketing","firm":{"name":"Shatec Singapore","permalink":"shatec-singapore","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.shatec.sg/","title":"Shatec Institute of Singapore"},{"external_url":"http://www.shatec-cet.sg/","title":"Shatec Institute CET"},{"external_url":"http://www.shatec.sg/en/about-us/shatec-times","title":"Shatec News"},{"external_url":"http://www.recipesbyshatec.sg/","title":"Shatec Recipes"}],"web_presences":[{"external_url":"http://shatecsingapore.tumblr.com","title":"Shatec Institute Tumblr"},{"external_url":"http://twitter.com/#!/myshatec","title":"Shatec Institute Twitter"},{"external_url":"http://www.facebook.com/Shatecinstitutes","title":"Shatec Institute Facebook"},{"external_url":"http://shatecsingapore.livejournal.com","title":"Shatec Institute Livejournal"}]}