{"first_name":"Shaun","last_name":"Molnar","permalink":"shaun-molnar","crunchbase_url":"http://www.crunchbase.com/person/shaun-molnar","homepage_url":"http://design.effectualit.com","birthplace":"","twitter_username":"effectualdesign","blog_url":"http://design.effectualit.com/design-blog","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"web-design, website-design, web-designers, website-designers, graphic-designers","alias_list":null,"created_at":"Tue Mar 27 22:53:57 UTC 2012","updated_at":"Tue Apr 03 02:02:09 UTC 2012","overview":"<p>effectual design is a leading Web Design, website design company based in Melbourne Australia. We pride ourselves on our successful track record of producing quality custom web designs for our diverse range of clients. </p>\n\n<p>Effectual design creates custom, high-quality website design solutions that not only become the forefront of your business, but also helps to maximize your businesses online marketing potential with the end goal to change visitors into customers. Our wide-range of web solutions guarantee that your business gets the competitive edge on time and on budget. Our wide range of web services include website design, web development, application development, search engine optimization, social media marketing, pay per click advertising, IT Consulting, Database Development, software development, graphic design, and much more. </p>\n\n<p>We believe that Internet marketing is the most inexpensive, highly effective way of reaching out to your potential customers. At effectual design, we have a highly qualified, experienced team of web developers, website designers, search engine optimizers and content writers who take into account your specific business needs and those of your clientele while designing web solutions for your business. Our flexible and customized services help you maximize as much web traffic as you can from your website.</p>\n\n<p>Our website designs, social media marketing, IT services and other online marketing services are created specifically to engross customers and make them want to reach out and contact you. For years we have been creating professional custom web design solutions for our clients across the country and we can do the same for your business!</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0018/1985/181985v3-max-150x150.jpg"],[[180,180],"assets/images/resized/0018/1985/181985v3-max-250x250.jpg"],[[180,180],"assets/images/resized/0018/1985/181985v3-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}