{"first_name":"Shaul","last_name":"Olmert","permalink":"shaul-olmert","crunchbase_url":"http://www.crunchbase.com/person/shaul-olmert","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"GameGround","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jun 03 16:47:20 UTC 2009","updated_at":"Tue May 22 04:25:07 UTC 2012","overview":"<p>Shaul Olmert is a digital media executive and entrepreneur. He recently served as Chief Marketing Officer of digital apps phenomenon Conduit.</p>\n\n<p>He is the co-founder of three digital media start-ups- NetAlign, GameGround and Sundaysky. Prior to starting these companies, he  held the position of Vice President, Digital Products at MTV Networks™ Kids &amp; Family Group.</p>\n\n<p>The Digital Products group managed a portfolio of premium digital business units, including digital games (console games, handheld games, CD ROM, paid online games, mobile games and more), E-commerce, wireless and digital video. As head of the group, Mr. Olmert oversaw strategy, production, creative management, operations and business development for these various businesses.</p>\n\n<p>Prior to joining MTV Networks, Mr. Olmert held several leadership positions with entertainment and financial organizations, including venture fund STI Ventures and casual games publisher Oberon Media.</p>\n\n<p>In 2011, Olmert was named Chief Marketing Officer of Conduit, spearheading business development, sales and marketing for one of the largest private Internet companies in the world.</p>\n\n<p>Mr. Olmert earned a Masters degree in Interactive Telecommunications from New York University. A native of Israel, Mr. Olmert now lives in New York. He is married and has three children. He is also known as the son of former Israeli Prime Minister Ehud Olmert.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-founder","firm":{"name":"GameGround","permalink":"gameground","type_of_entity":"company","image":{"available_sizes":[[[69,59],"assets/images/resized/0004/6513/46513v7-max-150x150.png"],[[69,59],"assets/images/resized/0004/6513/46513v7-max-250x250.png"],[[69,59],"assets/images/resized/0004/6513/46513v7-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}