{"first_name":"Shawn","last_name":"Smith","permalink":"shawn-smith","crunchbase_url":"http://www.crunchbase.com/person/shawn-smith","homepage_url":"http://www.shawnbsmith.me","birthplace":"Melbourne, Victoria","twitter_username":"shawnbsmith","blog_url":"","blog_feed_url":"","affiliation_name":"System Hive","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 04 21:26:40 UTC 2012","updated_at":"Sat Apr 14 22:06:07 UTC 2012","overview":"<p>Shawn Smith is a thought-provoking and innovative technologist. A true tech-geek and the Founder of Hypnotic Zoo – a web design business delivering simple, effective websites for clients – and System Hive – a software concept and development company – Shawn blends his interests and passion in technology together with the world of commerce. Highly creative yet with a strong business mind enabling him to successfully manage both of his medium-sized enterprises, Shawn takes a commanding position in the online world to cater to two areas of clients: Done-For-You through Hypnotic Zoo, and Do-It-Yourself through the creations of System Hive. </p>\n\n<p>With his interest budding at any early age and proving his love for technology by selling all his toys to buy a computer as a child, Shawn spent endless hours in front of the screen, mouse and keyboard teaching himself the necessary skills. Developing mastery and making critical mistakes along the way – including wiping disks clean of their data – Shawn wound up choosing to build an entire computer system for a school project in the 1990’s. With his magnificent obsession continuing to grow through to the present day, Shawn has maintained his love for exploring technology and discovering all of its uses and secrets. Gaining extensive experience in the sales arena across large enterprises specialising in mobile applications and working for Hewlett Packard (HP) utilizing lateral thinking to develop web technology strategies, Shawn soon branched out into the entrepreneurial domain and founded Hypnotic Zoo, closely followed by System Hive. </p>\n\n<p>Hypnotic Zoo is Shawn’s web design business that, simply put, develops and manages simple, visually-appealing and well-functioning websites for clients with e-commerce and online business features. With a team who have great personality and who look at things in a different light to a standard web design business (therefore producing better overall results), Hypnotic Zoo primarily serve small-to-medium sized enterprises based in Australia. System Hive is Shawn’s intellectual property arm in business, owning the software and web technology developed under their roof. Building software to solve online business problems that haven’t been taken care of– such as linking up e-commerce sites and accounting software, and managing multiple Wordpress websites under one platform – System Hive’s pipeline of products being developed all streamline systems, minimize unnecessary human labour, and automatically and accurately track data. Balancing the two necessary components of user-experience and functionality together in each piece of software, System Hive also incorporates final products into the services of other companies to help them serve their customer bases. \n “I believe every great concept is born from frustration,” said Shawn, “I’ve had innovations that have been non-technology related, but my real drive is to continue to build great software and technology applications that prove their worth. Taking crazy ideas, working them through until they are solid processes and then building them is both rewarding and profitable. Every website and concept we have designed and built gives me a greater drive to develop more ideas into proven concepts – and then reality.” \nShawn developed the attitude of being the best in the field early on, as he won several awards as a very high achiever in sports over a 15 year period. Aspiring to grow businesses which have great cultures, Shawn has a serious work ethic and outstanding performance. Having also integrated his love of sports by developing websites for and the online presence of Australia’s high performing pro-athletes – such as Tim Berkel, the youngest athlete to ever win the Iron Man event – Shawn is now being recognized in the marketplace for his ability to take proven marketable concepts and technology solutions that improve business and bring them forward into successful fruition. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Owner","firm":{"name":"System Hive","permalink":"system-hive","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://au.linkedin.com/in/shawnbsmith","title":"LinkedIn"},{"external_url":"http://www.flickr.com/photos/shawn_smith/","title":"Flickr"},{"external_url":"http://twitter.com/shawnbsmith","title":"Twitter"}]}