{"first_name":"Shawn","last_name":"Campbell","permalink":"shawn-campbell","crunchbase_url":"http://www.crunchbase.com/person/shawn-campbell","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Future Ads","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 03 22:07:33 UTC 2012","updated_at":"Tue Jul 10 16:24:57 UTC 2012","overview":"<p>At Future Ads, Shawn’s mission is to create a community gaming experience that is entertaining, engaging and competitive. And he wears multiple hats: from designing games to writing code for the Facebook platform.</p>\n\n<p>He brings years of technical production, design and game development experience to the company. He’s designed and programmed more than fifty games for the Web over the last dozen years, is one of the pioneering members of the competitive skill game market and has worked with partners like Popcap, Sony and Hasbro to port custom titles like Bejeweled, Scrabble, MONOPOLY, JEOPARDY! –while creating his own, original titles. He previously served as Manager of Games Development for GSN Digital Labs (a.k.a. The Game Show Network), and as Game Programmer/Team Manager at WorldWinner (a major skill-games/tournament site).</p>\n\n<p>Creating casual games for a mass Internet audience scratches a long time creative itch for Shawn, who graduated with a performing arts B.A. from Colby College, with training in studio art and design. (His artsy side was rounded out with further training in computer language at Boston University.) A former resident of both London and Paris, Shawn hits the games even when he’s not working, whether it’s on Xbox, PC or the golf course!</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Vice President, Game Development","firm":{"name":"Future Ads","permalink":"future-ads","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0011/0205/110205v8-max-150x150.png"],[[180,180],"assets/images/resized/0011/0205/110205v8-max-250x250.png"],[[180,180],"assets/images/resized/0011/0205/110205v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}