{"first_name":"Shawn","last_name":"Colo","permalink":"shawn-colo","crunchbase_url":"http://www.crunchbase.com/person/shawn-colo","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Demand Media","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Aug 31 15:00:35 UTC 2007","updated_at":"Wed Jul 09 01:21:04 UTC 2008","overview":"<p>Shawn is responsible for creating the original concept and executing the simultaneous acquisitions of eNom, eHow, and several domain name portfolios to create Demand Media. Since co-founding the company with Richard Rosenblatt in April 2006, Shawn and his team have sourced, negotiated, and completed over 30 acquisitions, including the acquisition of ExpertVillage, the world&#8217;s leading instructional video platform company, and also the company&#8217;s recent acquisition of Pluck.com, which firmly positioned Demand Media as a true leader in social media. In addition to running mergers and acquisitions, Shawn is also responsible for high-level strategic relationships, including Demand&#8217;s relationship with the Lance Armstrong Foundation which led to the creation of LiveStrong.com.</p>\n\n<p>Prior to Demand Media, Shawn spent 10 years in the private equity industry as a Principal with Spectrum Equity Investors, a $4 billion private equity firm focused exclusively on investing in media and communications companies. While at Spectrum, Shawn was involved in several of the firm&#8217;s most successful investments, including Illuminet (NASDAQ: ILUM, acquired by Verisign). Shawn has served on corporate boards in the US and Europe, where he spent several years building the firm&#8217;s European business from London. Shawn is a graduate of Princeton University, with a degree in Engineering and Operations Research.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder and Head of M&A","firm":{"name":"Demand Media","permalink":"demandmedia","type_of_entity":"company","image":{"available_sizes":[[[150,32],"assets/images/resized/0000/0247/247v3-max-150x150.png"],[[250,54],"assets/images/resized/0000/0247/247v3-max-250x250.png"],[[450,97],"assets/images/resized/0000/0247/247v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}