{"first_name":"Shawn","last_name":"Green","permalink":"shawn-green","crunchbase_url":"http://www.crunchbase.com/person/shawn-green","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Kensel & Co. ","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Apr 05 20:27:11 UTC 2011","updated_at":"Tue Apr 12 01:37:39 UTC 2011","overview":"<p>Shawn Green is a Venture Partner of Kensel &amp; Co. and is actively involved in several of the firm&#8217;s direct investments. Mr. Green has extensive experience in private equity and venture capital investments as a limited partner and in entrepreneurial projects as a partner, angel investor, and advisor. Prior to joining Kensel &amp; Co. Mr. Green was a Major League Baseball player.</p>\n\n<p>Mr. Green&#8217;s professional baseball career spanned more than fourteen years with four MLB teams including the Toronto Blue Jays, the Los Angeles Dodgers, the Arizona Diamondbacks, and the New York Mets. During his baseball career, Mr. Green won numerous accolades including the American League Gold Glove Award and the American League Silver Slugger Award. He was a two-time major league All-Star and holds or is tied for several major league records.</p>\n\n<p>Mr. Green is the author of a book titled, The Way of Baseball: Finding Stillness at 95 MPH that will be published by Simon &amp; Schuster in June 2011. Mr. Green serves on several advisory boards for early and mid-stage companies. He is also actively involved in several charities and is a regular speaker at charitable and business events. Mr. Green attended Stanford University.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Venture Partner","firm":{"name":"Kensel & Co. ","permalink":"kensel-co","type_of_entity":"financial_org","image":{"available_sizes":[[[150,59],"assets/images/resized/0005/2619/52619v2-max-150x150.png"],[[224,89],"assets/images/resized/0005/2619/52619v2-max-250x250.png"],[[224,89],"assets/images/resized/0005/2619/52619v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}