{"first_name":"Shawn","last_name":"Qu","permalink":"shawn-qu","crunchbase_url":"http://www.crunchbase.com/person/shawn-qu","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Feb 01 06:05:44 UTC 2011","updated_at":"Thu Mar 17 08:59:06 UTC 2011","overview":"<p>Dr. Shawn (Xiaohua) Qu has served as Chairman, President and Chief Executive Officer since founding Canadian Solar in October 2001. Prior to joining Canadian Solar, Dr. Qu worked at Automation Tooling Systems (ATS) Inc. from 1998 to 2001, where he performed various duties at both ATS and at its subsidiaries in the solar power business, Matrix and Photowatt International S.A..  He acted as a Research Scientist, Director of Silicon Procurement, Director of Solar Products, Strategic Planning and Business Development, and Technical Vice President (Asia Pacific) of Photowatt International S.A. From 1996 to 1998, Dr. Qu was a research scientist at Ontario Power Generation Corp. (formerly Ontario Hydro), where he worked as a process leader in the development of Sphere Solar™ technology, a next-generation solar technology. Prior to joining Ontario Hydro, Dr. Qu was a post-doctorate research fellow at the University of Toronto focusing on semiconductor optical devices and solar cells. He has published research articles in academic journals such as IEEE Quantum Electronics, Applied Physics Letters and Physical Review. Dr. Qu received a Ph.D. degree in material science from the University of Toronto in 1995, a M.Sc. degree in physics from University of Manitoba in 1990 and a B.Sc. in applied physics from Singh University (Beijing, China) in 1986.</p>","image":null,"degrees":[{"degree_type":"B.Sc.","subject":"Applied Physics","institution":"Singh University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chairman, President & CEO","firm":{"name":"Canadian Solar","permalink":"canadian-solar","type_of_entity":"company","image":{"available_sizes":[[[150,35],"assets/images/resized/0011/9825/119825v1-max-150x150.png"],[[227,54],"assets/images/resized/0011/9825/119825v1-max-250x250.png"],[[227,54],"assets/images/resized/0011/9825/119825v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}