{"first_name":"Sherry","last_name":"Heyl","permalink":"sherry-heyl","crunchbase_url":"http://www.crunchbase.com/person/sherry-heyl","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"eRollover","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Feb 22 00:50:19 UTC 2009","updated_at":"Wed Aug 04 22:47:45 UTC 2010","overview":"<p>Sherry Heyl is the Community Director of eRollover (www.erollover.com), an online consumer destination focused on retirement. The site provides access to information previously not available to the general public, allowing people to take control of their retirement by providing a means to manage, connect, learn and share information through a unique social media community.</p>\n\n<p>Sherry is especially well versed in social media, as an acclaimed author, speaker, and evangelist in supporting the democratization of knowledge and information, and transforming people from content consumers into content producers.</p>\n\n<p>As the Community Director of eRollover, Sherry is responsible for building and nurturing the eRollover community, as well as managing a team responsible for providing a superior social media experience on the site, and throughout the web.</p>\n\n<p>Sherry is also the founder and CEO of Concept Hub, Inc., the premiere, full service social media agency in Atlanta. Under her guidance, Concept Hub provides strategic road maps and training that enables her clients to effectively listen, connect with, and influence their growing and evolving audience.  </p>\n\n<p>An experienced executive recruiter, Sherry has provided prospecting guidance in sourcing new clients, and making successful matches of candidates by effectively counseling them on resume writing, interviewing skills, and self-marketing techniques.</p>\n\n<p>A graduate of Florida State University, Sherry earned dual undergraduate degrees in English (Creative and Business Writing) and Marketing. She also earned an AA in History and Secondary Education at Broward Community College in Pembroke Pines, Florida.</p>\n\n<p>Sherry is a native of Miami, FL.</p>","image":{"available_sizes":[[[124,150],"assets/images/resized/0009/6066/96066v2-max-150x150.jpg"],[[150,181],"assets/images/resized/0009/6066/96066v2-max-250x250.jpg"],[[150,181],"assets/images/resized/0009/6066/96066v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"","subject":"Marketing and English","institution":"Florida State University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Community Director","firm":{"name":"FiPath ","permalink":"fipath","type_of_entity":"company","image":{"available_sizes":[[[150,72],"assets/images/resized/0002/7808/27808v8-max-150x150.jpg"],[[250,120],"assets/images/resized/0002/7808/27808v8-max-250x250.jpg"],[[250,120],"assets/images/resized/0002/7808/27808v8-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}