{"first_name":"Sherrie","last_name":"Glasser-Mayrsohn","permalink":"sherrie-glasser-mayrsohn","crunchbase_url":"http://www.crunchbase.com/person/sherrie-glasser-mayrsohn","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1987,"born_month":1,"born_day":4,"tag_list":"","alias_list":null,"created_at":"Thu Nov 15 08:31:22 UTC 2012","updated_at":"Thu Nov 22 04:58:37 UTC 2012","overview":"<p>Sherrie Glasser-Mayrsohn</p>\n\n<p>Sherrie Glasser-Mayrsohn founded Metro Physical and Aquatic Therapy in 1982. Through her private practice, she provides physical therapy as well as complementary programs to aid her patients’ development. Examples of programs offered to enhance the physical therapy experience are nutritional counseling and exercise classes utilizing premier gym equipment. </p>\n\n<p>Sherrie Glasser-Mayrsohn takes a holistic approach to physical therapy to tailor services for each individual patient. Her patients range in age from newborns to seniors, for which she takes special attention.  Coming from a personal situation with her father, she realizes this population has special needs. Mobility and strength impacts susceptibility to pain, injury and loss of abilities like bladder control, for instance. In this way, her focus on seniors is truly revolutionary and compassionate. </p>\n\n<p>She also specializes in women’s health and sports injuries with plenty of skill and experience in both. She doesn’t use cookie-cutter treatments, but rather a three-pronged approach for maximum benefit to the patient. It includes patient recovery, injury prevention for both present and future, and lifetime wellness. </p>\n\n<p>In addition to massages, one-on-one therapy and her much sought-after aquatic treatments, she offers mental well-being programs and educational classes. The topics discussed in the classes range from senior fall prevention to neck and back alignment to improve posture. Ten locations in the Long Beach, New York area comprise Sherrie Glasser-Mayrsohn’s practice at which her wealth of services is offered. </p>\n\n<p>Sherrie Glasser-Mayrsohn holds a master’s in Orthopedic Physical Therapy and a bachelor’s in Physical Therapy. She also belongs to professional organizations, including the American Society of Shoulder and Elbow Therapists and the Council of Physiotherapists. She served as president of the New York State Society of Physical Therapists, and is on the New York Society of Physiotherapists board. \n </p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0022/0479/220479v2-max-150x150.png"],[[250,153],"assets/images/resized/0022/0479/220479v2-max-250x250.png"],[[260,160],"assets/images/resized/0022/0479/220479v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}