{"first_name":"Shirley","last_name":"M. Tilghman","permalink":"shirley-m-tilghman","crunchbase_url":"http://www.crunchbase.com/person/shirley-m-tilghman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Google","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Feb 22 09:50:12 UTC 2008","updated_at":"Wed Jan 20 20:44:28 UTC 2010","overview":"<p>Shirley M. Tilghman was elected Princeton University&#8217;s 19th president on May 5, 2001, and assumed office on June 15, 2001. An exceptional teacher and a world-renowned scholar and leader in the field of molecular biology, she served on the Princeton faculty for 15 years before being named president.</p>\n\n<p>Tilghman, a native of Canada, received her Honors B.Sc. in chemistry from Queen&#8217;s University in Kingston, Ontario, in 1968. After two years of secondary school teaching in Sierra Leone, West Africa, she obtained her Ph.D. in biochemistry from Temple University in Philadelphia.</p>\n\n<p>During postdoctoral studies at the National Institutes of Health, she made a number of groundbreaking discoveries while participating in cloning the first mammalian gene, and then continued to make scientific breakthroughs as an independent investigator at the Institute for Cancer Research in Philadelphia and an adjunct associate professor of human genetics and biochemistry and biophysics at the University of Pennsylvania.</p>\n\n<p>Tilghman came to Princeton in 1986 as the Howard A. Prior Professor of the Life Sciences. Two years later, she also joined the Howard Hughes Medical Institute as an investigator. In 1998, she took on additional responsibilities as the founding director of Princeton&#8217;s multi-disciplinary Lewis-Sigler Institute for Integrative Genomics.</p>\n\n<p>A member of the National Research Council&#8217;s committee that set the blueprint for the U.S. effort in the Human Genome Project, Tilghman also was one of the founding members of the National Advisory Council of the Human Genome Project for the National Institutes of Health.</p>\n\n<p>She is renowned not only for her pioneering research, but for her national leadership on behalf of women in science and for promoting efforts to make the early careers of young scientists as meaningful and productive as possible.</p>\n\n<p>From 1993 through 2000, Tilghman chaired Princeton&#8217;s Council on Science and Technology, which encourages the teaching of science and technology to students outside the sciences, and in 1996 she received Princeton&#8217;s President&#8217;s Award for Distinguished Teaching. She initiated the Princeton Postdoctoral Teaching Fellowship, a program across all the science and engineering disciplines that brings postdoctoral students to Princeton each year to gain experience in both research and teaching.</p>\n\n<p>In 2002, Tilghman was one of five winners of the L&#8217;Oréal-UNESCO Award for Women in Science.  In the following year, she received the Lifetime Achievement Award from the Society for Developmental Biology, and in 2007, she was awarded the Genetics Society of America Medal for outstanding contributions to her field.\nTilghman is a member of the American Philosophical Society, the National Academy of Sciences, the Institute of Medicine, and the Royal Society of London. She serves as a trustee of the Carnegie Endowment for International Peace and the King Abdullah University of Science and Technology, and as a director of Google Inc.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Board","firm":{"name":"Google","permalink":"google","type_of_entity":"company","image":{"available_sizes":[[[150,51],"assets/images/resized/0002/9578/29578v31-max-150x150.png"],[[250,85],"assets/images/resized/0002/9578/29578v31-max-250x250.png"],[[450,154],"assets/images/resized/0002/9578/29578v31-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}