{"first_name":"shitendra","last_name":"jaimini","permalink":"shitendra-jaimini","crunchbase_url":"http://www.crunchbase.com/person/shitendra-jaimini","homepage_url":"http://www.humaricar.com/","birthplace":"jaipur","twitter_username":"","blog_url":"http://humaricar.blogspot.com/","blog_feed_url":"","affiliation_name":"humaricar.com","born_year":1984,"born_month":9,"born_day":30,"tag_list":"used-car, new-cars, second-hand-cars, cars-in-jaipur, humaricar-com","alias_list":null,"created_at":"Wed May 11 11:07:32 UTC 2011","updated_at":"Fri May 13 14:30:41 UTC 2011","overview":"<p>The Humaricar.com offers vast experience in new and used car buy &amp; sell. We have a large selection of cars on the web, which means that you can easily find the vehicle of your dreams right here. Our commitment to quality and competitive, no hassle pricing – combined with unsurpassed auto service and transparent financing – guarantee a plain, simple and easy new car or used car purchasing experience.</p>\n\n<p>We know that finding the right price is only the first step. Using our web site, you can explore car pricing options with a quick quote or by payment, then research reviews and compare new and used cars that fit your budget and needs; check available auto financing and leasing plans; and search our huge auto inventory to locate the car utility vehicle you desire.</p>\n\n<p>Humaricar.com new car dealers and used car dealers offer the best deals on new and certified pre-owned vehicles. Whether you are looking to buy a pre-owned luxury car or find a crossover for sale in your area, our staff is here to help.</p>\n\n<p>Humaricar.com Portal carry popular brands including Audi, BMW , Ford, Honda, Hyundai, Fiat, Chevrolet, Mahindra, Maruti Suzuki, Mercedes-Benz, Mitsubishi, Nissan, Tata, Toyota, Volkswagen and Volvo.</p>\n\n<p>Our dedicated sales force is available by email or telephone if you have questions, need information or wish to complete your transaction online. Or, if you prefer to visit one of our local auto dealerships, you can search for the closest dealership here. If you are interested in joining our outstanding team of associates, please visit us at http://www.humaricar.com/FeedBack.aspx.com</p>\n\n<p>Humaricar.com Portal are committed to your complete satisfaction. Over the years we’ve built our gratifying success on trust and customer approval. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Humaricar.com","permalink":"humaricar","type_of_entity":"company","image":{"available_sizes":[[[150,49],"assets/images/resized/0016/5384/165384v1-max-150x150.jpg"],[[244,80],"assets/images/resized/0016/5384/165384v1-max-250x250.jpg"],[[244,80],"assets/images/resized/0016/5384/165384v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://humaricar.blogspot.com/","title":"humaricar blog"}],"web_presences":[{"external_url":"http://www.humaricar.com","title":"humaricar"}]}