{"first_name":"shiva","last_name":"shankar","permalink":"shiva-shankar","crunchbase_url":"http://www.crunchbase.com/person/shiva-shankar","homepage_url":"http://buildlink.biz","birthplace":"ahmedabad","twitter_username":"buildlink","blog_url":"http://buildlink.biz/blog/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1985,"born_month":6,"born_day":10,"tag_list":"seo, buildlink, backlink","alias_list":null,"created_at":"Fri Jun 01 13:47:37 UTC 2012","updated_at":"Sat Jun 09 15:11:40 UTC 2012","overview":"<p>Buildlink is a link building company that help their clients to improve their search engine ranking and website traffic.We help our customers to increase website traffic through effective Link Building Services.We want our customers to get to the top search engine rank.We always be in continuous touch with our clients to listen to various suggestions, which are appreciated by the company because we believe in learning at every step to be able to serve our clients in a much better way.</p>\n\n<p>Our goal is to offer every client a effective, comprehensive solution to improve traffic to their site. We target everything from the fundamentals of good onsite optimization to social media and also specialize in link building.Our team comprised of a group of individuals with vast experience in internet marketing, social media, content marketing and technology, each offering their individual expertise in order to provide our clients the very best services available.</p>\n\n<p>Our Link Building experts makes high quality backlinks from authority sites for the client to achieve high rankings and substantial traffic volume to the website. We offer to clients to gain the actual publicity of the business website to ensure continuous flow of visitors.</p>\n\n<p>To help our clients to increase business by providing effective link building solutions. We achieve this mission by our experienced team members efforts and better link building strategy.</p>","image":{"available_sizes":[[[150,57],"assets/images/resized/0019/3452/193452v2-max-150x150.jpg"],[[250,95],"assets/images/resized/0019/3452/193452v2-max-250x250.jpg"],[[450,172],"assets/images/resized/0019/3452/193452v2-max-450x450.jpg"]],"attribution":"<p>shiva shankar</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}