{"first_name":"Shridhar","last_name":"Dandu","permalink":"shridhar-dandu","crunchbase_url":"http://www.crunchbase.com/person/shridhar-dandu","homepage_url":"http://www.sourcemantra.com","birthplace":"India","twitter_username":"","blog_url":"http://www.sourcemantra.com","blog_feed_url":"http://www.sourcemantra.com","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Apr 14 05:07:26 UTC 2012","updated_at":"Tue May 01 04:25:05 UTC 2012","overview":"<p>Mr. Sridhar Dandu\nFounder and Chief Executive Officer\nSource Mantra Inc. </p>\n\n<p>Mr. Shridhar Dandu is the founder and chief executive officer of SourceMantra, an IT consulting firm, Headquartered at New Jersey, US. Mr. Dandu’s leadership, insight and operational expertise have strengthened SourceMantra into one of the fastest growing IT consulting firms along the West Coast.</p>\n\n<p>Founded in 2007, SourceMantra serves all of North America and is an emerging leader in IT consulting and Software development space providing services to Fortune 500 clients. The continued growth and success of SourceMantra bears testimony to Mr. Dandu’s zeal to succeed, his strong business acumen and leadership abilities. Already, SourceMantra has evolved as one of the “Preferred Consultant” status thanks to Mr. Dandu’s availability for all the stake holders.</p>\n\n<p>As a seasoned entrepreneur, Mr. Dandu is progressively establishing a high quality, knowledge based and industry networked IT consulting firm with a vision to be one of the leading players in its vertical, which can compete and excel over its larger peers in IT consulting in terms of client satisfaction and quality service delivery. </p>\n\n<p>“SourceMantra knows the pulse of the job market in the US IT consulting and software development industry. We represent effectively and professionally to the employers. People are our strength and their success is our Mantra. We place our Consultants with the finest organizations”, Mr. Sridhar maintains.</p>\n\n<p>Prior to establishing SourceMantra, Mr. Dandu had successful corporate and entrepreneurial stints with leading corporates. His hobbies include playing golf, reading books during free time, travelling and meeting up with people from different world cultures. </p>\n\n<p>Mr. Dandu holds a bachelor’s degree in economics and a master’s degree in management from Osmania University in India.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0018/4166/184166v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0018/4166/184166v2-max-250x250.jpg"],[[299,450],"assets/images/resized/0018/4166/184166v2-max-450x450.jpg"]],"attribution":"<p>Shridhar Dandu</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[{"description":"SourceMantra, an IT consulting firm, headquartered in New Jersey has participated in career fair at New York Institute of Technology (NYIT). The fair, which was participated by plus 100 companies, was held at Old Westbury campus. A global, private institu","stoned_year":2012,"stoned_month":4,"stoned_day":20,"source_url":"http://pr-usa.net/index.php?option=com_content&task=view&id=1158880&Itemid=34","source_text":null,"source_description":"SourceMantra Offers Great Careers: Shridhar Dandu","stoneable_type":"Person","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"first_name":"Shridhar","last_name":"Dandu","permalink":"shridhar-dandu"}}],"video_embeds":[],"external_links":[],"web_presences":[]}