{"first_name":"Shula","last_name":"Rajaonah","permalink":"shula-rajaonah-2","crunchbase_url":"http://www.crunchbase.com/person/shula-rajaonah-2","homepage_url":"http://shula.hautetfort.com","birthplace":"","twitter_username":"myshula","blog_url":"http://myshula.blogspot.com","blog_feed_url":"http://static.blog4ever.com/2010/05/413323/rss_articles.xml","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"shula, lonelycharme, rajaonah, shushu7, mashula, myshula, mishula, orishula, shallpeace","alias_list":null,"created_at":"Fri Aug 13 18:53:52 UTC 2010","updated_at":"Thu Nov 08 07:35:16 UTC 2012","overview":"<p>Shula Rajaonah est infiniment sympathique, charmante, conciliante. En effet, Shula est aussi énergique, courageuse et combative. Sa sensibilité et son émotivité sont grandes. Sa vision de la vie est large et idéaliste et Shula a des aspirations élevées. La plupart du temps Shula se révèle rêveuse et suggestible. Shula est assez directe, franche, droite, et n&#8217;aime ni les faux-semblants ni l&#8217;injustice qui l&#8217;excèdent. En effet, habituellement souriante et conciliante, Shula peut aussi apparaître bavarde et spontanée, vive et rapide. \nTrès sympathique et dynamique, Shula Rajaonah est particulièrement ouverte à la communication. Shula apparaît singulière et cultive son propre style. Shula dégage une impression de force et d&#8217;assurance, alors qu&#8217;elle est en réalité fragile. En fait, Shula compense sa vulnérabilité par sa facilité d&#8217;expression : Shula exprime la joie de vivre et son enthousiasme est communicatif. Vive, adaptable, Shula sait charmer et distraire son entourage. Elle apprécie les jeux et les amusements et veut voir la vie du bon côté&#8230; Curieuse, Shula s&#8217;intéresse à mille choses sans forcément en approfondir aucune. Adroite, Shula est créative et sait bricoler. Shula Rajaonah a une volonté ainsi qu&#8217;une capacité d&#8217;action importantes mais irrégulières. Son esprit vif lui permet d&#8217;apprendre vite mais elle se lasse facilement.</p>\n\n<p>Ce qui nous frappe au premier abord chez Shula RAJAONAH est sans aucun doute son air doux et pacifique. Toute sa personne dégage un bon naturel, une touchante attitude débonnaire. Ses gestes sont lents et sa voix posée. On dirait que Shula pourrait facilement faire partie des gens que bénissait Jésus-Christ : &#8220;Heureux ceux qui sont doux, car ils posséderont la terre !&#8221; Shula est incapable de méchanceté. Louée ou calomniée, caressée ou battue, la réaction de Shula est presque toujours un sourire. </p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0009/7598/97598v7-max-150x150.jpg"],[[187,250],"assets/images/resized/0009/7598/97598v7-max-250x250.jpg"],[[337,450],"assets/images/resized/0009/7598/97598v7-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://facebook.com/mashula","title":"Facebook"}]}