{"first_name":"Simon","last_name":"Reynolds","permalink":"simon-reynolds","crunchbase_url":"http://www.crunchbase.com/person/simon-reynolds","homepage_url":"","birthplace":"","twitter_username":"simonretromania","blog_url":"http://blissout.blogspot.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Thu Sep 29 22:49:23 UTC 2011","updated_at":"Thu Sep 29 22:50:18 UTC 2011","overview":"<p>Reynolds&#8217; first experience writing about music was with Monitor, a fanzine he helped to found in 1984 while he was studying history at Oxford. The publication only lasted for six issues.When it was discontinued in 1986, Reynolds was already making his name writing for Melody Maker, one of the three major British music magazines of the time (the other two being the New Musical Express and Sounds). His early Melody Maker writings often contained strong criticisms of the concept of &#8220;soul&#8221; (then being heavily promoted by the NME), and of the somewhat earnest politicisation associated with the Red Wedge movement. He has since stated[citation needed] that his apparent de-politicisation at the time was mainly a result of his sheer despair at Thatcherism and desire to escape - into a parallel world which was, as in the title of his first book, &#8220;blissed out&#8221;. He also wrote a number of articles analysing what has since become known as twee pop from a somewhat sociological perspective, seeing in it a desire to escape the dominant 1980s values of commercialism and Americanisation and to return to a perceived innocent past.</p>\n\n<p>In 1990, Reynolds left Melody Maker (although he would continue to contribute to the magazine until 1996) and went freelance, splitting his time between London and New York. The same year, he published Blissed Out: Raptures of Rock, a collection of his writings from the 1980s. Until his switch to freelance writing, Reynolds had focused mainly on rock, punk rock, post-punk, and pop. But in the early 1990s, he became involved in rave culture and the electronic dance music scene. He began writing about electronic music and became one of the foremost music critics of electronic dance music.</p>\n\n<p>In 1994, Reynolds moved permanently to the East Village in Manhattan. In 1995, he co-authored The Sex Revolts: Gender, Rebellion and Rock&#8217;N&#8217;Roll with his wife, Joy Press. Sex Revolts is one of the major reasons why Reynolds has gained a reputation for the discussion of gender roles in music; the book is a critical/clinical analysis of the theme of gender in rock.</p>\n\n<p>In 1998, Reynolds published Energy Flash: a Journey Through Rave Music and Dance Culture in the UK, and became a senior editor at Spin magazine in the US. In 1999, he went back to freelance work and published the American version of Energy Flash in abridged form, titled: Generation Ecstasy: Into the World of Techno and Rave Culture. Energy Flash is a comprehensive history of what became rave music, starting with Detroit techno and Chicago house and tracing the evolution of the music back and forth across the Atlantic, all the way up to the late 1990s. Reynolds combines analysis of the music, social background and history, and interviews with big names of the day. One of the most notable aspects of the book is Reynolds&#8217; analysis of the role of drugs, particularly ecstasy, in rave culture.\nIn 2005, the UK version of Rip It Up and Start Again: Post Punk 1978-1984 was published; the American version came out in early 2006. Rip it Up is a history of post-punk, defining the genre and placing it in the context of 1970s and 1980s music.</p>\n\n<p>In 2007, Reynolds published Bring the Noise: 20 Years of Writing about Hip Rock and Hip Hop in the UK, a collection of his writing themed around the relationship between white bohemian rock and black street music. In 2008, an updated edition of Energy Flash was published, with new chapters on the ten years of dance music following the appearance of the first edition.</p>\n\n<p>In 2011, Reynolds published Retromania: Pop Culture&#8217;s Addiction to Its Own Past, an indictment of and investigation into the current situation of chronic unoriginality in pop.</p>","image":{"available_sizes":[[[150,125],"assets/images/resized/0015/6157/156157v1-max-150x150.jpg"],[[250,208],"assets/images/resized/0015/6157/156157v1-max-250x250.jpg"],[[420,350],"assets/images/resized/0015/6157/156157v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}