{"first_name":"Simon","last_name":"Embley","permalink":"simon-embley-2","crunchbase_url":"http://www.crunchbase.com/person/simon-embley-2","homepage_url":"http://www.lslps.co.uk","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Sep 13 05:56:58 UTC 2012","updated_at":"Wed Sep 19 15:44:20 UTC 2012","overview":"<p>Simon Embley is the Group Chief Executive Officer and Executive Director of LSL Property Services PLC. He deals with the strategizing and development of the group in order to leverage its performance at present.  He has enabled the company to muscle its way to success via selective strategic acquisitions and organic growth. He has had a successful stint of serving as a Wealth Management Director of Norwich Union wealth management and as a Non Executive Director at Zoopla Ltd.\nHis decision of providing an array of services under one roof, changed the face of the company and enabled it to up the ante. Since the management buyout of esurv chartered surveyors and Your Move from Aviva known as Norwich Union Life before, he has introduced a sea change in the working of the company and enabled it to transform into a profitable company from being a loss making one. He shares the board with some key members like Helen Buck, an Independent Non-Executive Director, Roger Matthews, the Non-Executive Chairman, David Newnes, the Executive Director, Estate Agency, Sapna B FitzGerald, the Head of Legal and Company Secretary, Paul Latham, the Non-Executive Director and Steve Cooke, the Group Finance Director.\nLSL Property Services Plc is the largest residential estate agency provider with its services including residential sales, lettings, advise on mortgage and non – investment insurance products and advise on mortgage. Its services are segmented into two major categories including Surveying and Valuation Services, and Estate Agency and Related services.</p>","image":{"available_sizes":[[[135,124],"assets/images/resized/0021/1116/211116v2-max-150x150.jpg"],[[135,124],"assets/images/resized/0021/1116/211116v2-max-250x250.jpg"],[[135,124],"assets/images/resized/0021/1116/211116v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}