{"first_name":"Simon","last_name":"Berman","permalink":"simon-berman","crunchbase_url":"http://www.crunchbase.com/person/simon-berman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"AtHoc","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jun 09 22:42:46 UTC 2008","updated_at":"Mon Jul 14 18:15:05 UTC 2008","overview":"<p>Simon Berman is responsible for all aspects of corporate and product marketing, and oversees the strategic planning and execution of new market penetration and product delivery. Simon brings more than 15 years of product marketing experience to the AtHoc management team. Prior to joining AtHoc, he spent over 12 years at Mercury Interactive and was Senior Director of Product Marketing where he led the IT Service Management initiative and helped establish a leading market presence in less than two years. </p>\n\n<p>Simon also launched numerous successful product and marketing initiatives, and was responsible for the company’s load and performance testing products, bringing them to acknowledged industry standard status with over 70% market share and annual revenues in excess of $250M. Prior to Mercury, Simon spent three years at Radcom, developing network communications test equipment. Simon has a Master of Science degree in computer science from the University College London and a Bachelor of Science degree in aeronautical engineering from Imperial College, London. </p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"VP, Product Marketing","firm":{"name":"AtHoc","permalink":"athoc","type_of_entity":"company","image":{"available_sizes":[[[127,55],"assets/images/resized/0001/9103/19103v2-max-150x150.png"],[[127,55],"assets/images/resized/0001/9103/19103v2-max-250x250.png"],[[127,55],"assets/images/resized/0001/9103/19103v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}