{"first_name":"Simon","last_name":"Christy","permalink":"simon-christy-2","crunchbase_url":"http://www.crunchbase.com/person/simon-christy-2","homepage_url":"http://veo.vn","birthplace":"England","twitter_username":null,"blog_url":"http://simonchristy.com","blog_feed_url":"","affiliation_name":"The Times","born_year":1974,"born_month":null,"born_day":null,"tag_list":"digital, internet, marketing, london, vietnam, entrepreneur","alias_list":null,"created_at":"Fri Feb 20 07:42:43 UTC 2009","updated_at":"Sat Feb 21 19:05:08 UTC 2009","overview":"<p>Simon Christy is a digital entrepreneur and marketing specialist, with a passion for new technology.  His work has spanned advertising agencies, technology start-up’s and publishing/media. </p>\n\n<p>At Mindshare, part of the WPP marketing group, he created and ran major advertising campaigns for a diverse range of blue-chip companies including Ford Motors, IBM, Guinness, Virgin and SAP.</p>\n\n<p>In 1998 Simon joined Jason Drummond’s web hosting start-up, Virtual Internet, to head up the company’s marketing efforts and in preparation for a listing on London’s stockmarket. In the years to follow they drove the company to be one of Europe’s largest business web hosting providers. In 1999 the company acquired NetSearchers, a specialist in online intellectual property, to advise law firms on navigating the pitfalls and dangers of the internet. Simon took the NetSearchers brand into Europe and North America and within twelve months they claimed 60 of the FTSE 100 companies as clients and the ten largest law firms in the world.</p>\n\n<p>In 2004 when he moved to The Times, a News Corporation Company and one of the longest running publishers in the world.\nHe has been a major proponent of new technology at both The Times, The Sunday Times and Times Online and has led digital strategy there. In a year Simon increased the traffic to Times Online, the news portal, by 360% to 7m readers each month.</p>\n\n<p>For The Sun, he has worked across the digital portfolio (Content, Gaming, Gambling, ) to drive new audience, advertising and transactional revenues through digital business strategy and marketing. In two years he helped to grow Sun Bingo to be the largest and most visited pay to play Bingo site in the UK.</p>\n\n<p>Simon holds a first-class honours degree in business from Sheffield University Management School. He has travelled extensively throughout Asia and speaks Vietnamese. Simon’s business interests in Vietnam include VietSoftware, a software development outsourcing company based in Hanoi, and VEO Media, a digital media publisher and media outsourcing specialist. Simon is also currently starting Green Vietnam, an environmental investment and development boutique which develops and invests in Kyoto Clean Development projects in both the public and private sector.</p>\n\n<p>In May &#8216;08 Simon left the luxury of South West London with his wife, baby boy and girl and moved to the craziness of Ho Chi Minh City, Vietnam.</p>","image":null,"degrees":[{"degree_type":"BA (Hons)","subject":"Business and Marketing","institution":"Sheffield University Management School","graduated_year":1996,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"VEO Media Vietnam","permalink":"veo-media-vietnam","type_of_entity":"company","image":{"available_sizes":[[[150,63],"assets/images/resized/0003/6605/36605v2-max-150x150.png"],[[250,105],"assets/images/resized/0003/6605/36605v2-max-250x250.png"],[[302,128],"assets/images/resized/0003/6605/36605v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/1/72a/a19","title":"Linked In"}]}