{"first_name":"Simon","last_name":"Nicholson","permalink":"simon-nicholson","crunchbase_url":"http://www.crunchbase.com/person/simon-nicholson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri May 22 09:23:06 UTC 2009","updated_at":"Fri May 22 09:26:02 UTC 2009","overview":"<p>Simon is an academically and professionally trained manager with 11 years experience in national and international Sales, Business Development and Sales Account management, 7years in national and international Product Marketing and Management and 4yrs in Applications and Design, within the electrical, electronic and technology industry sectors. He has worked for a number of blue chip companies including Samsung and Toshiba in management roles within their Corporate Sales, Business Development, Sales Account Management and Product Marketing departments.He has experience in OEM Account management as well as Channel partner management within the Distributor, Value Added Reseller (VAR) and Agent network, across the Industrial, Medical, Marine/Subsea, Aerospace, Defence and Homeland Security market sectors. He has undertaken numerous personal and business initiatives to improve business efficiencies and processes, which in doing so required strong interpersonal, analytical skills and a variety of management techniques. Mr Nicholson received his HND in Electrical and Electronic engineering from the University of Derby in 1986. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Sales Director Process","firm":{"name":"Cascade Technologies","permalink":"cascade-technologies","type_of_entity":"company","image":{"available_sizes":[[[150,117],"assets/images/resized/0004/5166/45166v1-max-150x150.png"],[[200,157],"assets/images/resized/0004/5166/45166v1-max-250x250.png"],[[200,157],"assets/images/resized/0004/5166/45166v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}