{"first_name":"Simon","last_name":"Nathanson","permalink":"simon-nathanson","crunchbase_url":"http://www.crunchbase.com/person/simon-nathanson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Nov 23 09:29:08 UTC 2008","updated_at":"Sun Nov 23 09:31:17 UTC 2008","overview":"<p>Simon Nathanson was appointed CEO of Neonet in March 2004 and has over 20 years of experience from various positions within the financial industry. Mr. Nathanson joined Neonet from Stockholmsbörsen (currently OMX Stockholm Exchange) where he held the position of Executive Vice President, responsible for overseeing business development, sales and marketing, customer management, exchange- and clearing operations and IT, as well as holding Board positions with different OM companies and NOREX. In addition, Simon Nathanson was for a period acting President of Stockholmsbörsen.</p>\n\n<p>Simon Nathanson, began his career as a stocks and derivatives broker at BohusBanken before moving to OM Stockholm in 1987, where his roles included Exchange Broker, Senior Vice President, Head of Marketplace Operations and President. During his time at OM Stockholm, Mr. Nathanson has been deeply involved in the introduction of electronic trading in Sweden and has been a driving force in developing Exchange and Clearing link co-operations, both in the derivatives markets as well as in equity trading. In 1999, Mr. Nathanson became President of OM Fixed Income Exchange, OM Räntebörsen, where he was responsible for the merger of three businesses to form one profitable and well functioning Fixed Income Exchange.</p>\n\n<p>Simon Nathanson studied Economics and Law at Stockholm University and completed the Nordic Executive Program at the Stockholm School of Economics.</p>","image":{"available_sizes":[[[138,150],"assets/images/resized/0002/9240/29240v1-max-150x150.jpg"],[[231,250],"assets/images/resized/0002/9240/29240v1-max-250x250.jpg"],[[233,252],"assets/images/resized/0002/9240/29240v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President and Chief Executive Officer","firm":{"name":"NeoNet","permalink":"neonet","type_of_entity":"financial_org","image":{"available_sizes":[[[150,36],"assets/images/resized/0002/9239/29239v1-max-150x150.png"],[[207,50],"assets/images/resized/0002/9239/29239v1-max-250x250.png"],[[207,50],"assets/images/resized/0002/9239/29239v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}