{"first_name":"Simon","last_name":"Winters","permalink":"simon-winters","crunchbase_url":"http://www.crunchbase.com/person/simon-winters","homepage_url":"http://www.simonwintersjnf.co.uk/","birthplace":"London","twitter_username":"","blog_url":"http://simonwintersjnf.tumblr.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1960,"born_month":2,"born_day":14,"tag_list":"simon-winters, jnf, london, united-kingdom","alias_list":null,"created_at":"Sun Jul 22 12:04:48 UTC 2012","updated_at":"Wed Jul 25 06:14:17 UTC 2012","overview":"<p>Simon Winters’ is a dynamic and unique figure in the even organising scene in Europe and around the world. He has an extensive background in the industry, both commercial and philanthropic, and his many years of experience provide him with the skills to guide your company to its best strategic even possible. Winters’ himself boasts a long list of personal ties, to figures such as former President Bill Clinton, Prince of Albert of Monaco and General Colin Powell, which is a major point of leverage for his current venture, Formula Won, which specialises in putting together events, conferences, launches and other types of occasions for various organisations.</p>\n\n<p>Before starting Formula Won, Winters’ held a number of prominent positions in the business and philanthropic sectors. One of his major professional achievements was his 16-year tenure as the leader of the Jewish National Fund (JNF). The JNF was the non-governmental international body that works to acquire and develop land in Israel. Today the JNF works in coordination with the Israeli government, but it was in existence long before the country, starting at the outset of the 20th century. Winters’ tenure was obviously not part of the early settlement enterprise, but he did play a critical role in the JNF’s later 20th century work, including raising about 12 million pounds through events, fundraisers, conferences and, of course, his only charisma to inspire people to donate. Winters’ also served as the JNF’s fiscal manager while he was CEO. He was in charge of the planning, risk and investment management, budgeting and spending aspects of this massive international body, critical to the development and survival of the state of Israel. </p>\n\n<p>Another project Winters’ was involved in organizing is a flying club, called J Wing, which joins Jewish private pilots together with veterans from the British military. The small group of hobby-flyers decided to organise a day for ex-servicemen to fly them in groups on light aircraft to the Aviation exhibit of the Imperial War Museum to a former military base near Cambridge. The event will take place in September 2012, inviting friends and family to meet the guests who were flown in order to enjoy a speech by a serving officer. Winters’ and his cohorts hoped to help veterans connect to their legacy and enjoy the fruits of their labours see http://www.jwing.co.uk/</p>\n\n<p>Today, Winters’ spends most of his time with Formula Won Ltd. The company offers management consulting and even coordination services for a variety of companies and non-profit agencies. They are involved in causes involving education and the arts, as well as health and social welfare. Formula Won’s approach is threefold: offering unique, smart and creative ways to promote an organisation or company; be honest and straightforward to evaluate the true situation and best leverage it for a practical solutions; and work together with clients as a collaborative team to get the job done. One of Formula Won’s banner events in July 2012 was the Tutti Frutti Car Rally. This was an eleven day classic car tour of Italy, enjoying the sites, finding places of  Jewish interest and providing a fantastic vacation for those with a penchant for seeing the sites in a nice car. </p>","image":{"available_sizes":[[[150,147],"assets/images/resized/0020/2217/202217v2-max-150x150.jpg"],[[250,245],"assets/images/resized/0020/2217/202217v2-max-250x250.jpg"],[[450,442],"assets/images/resized/0020/2217/202217v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.simonwintersjnf.org","title":"Simon Winters- Biography Page"},{"external_url":"http://about.me/simonwintersjnf","title":"About.Me Page- Simon Winters"}],"web_presences":[{"external_url":"http://uk.linkedin.com/pub/simon-winters-obe/9/796/36b","title":"Simon Winters- LinkedIn Profile"}]}