{"first_name":"Simone","last_name":"Mignoni","permalink":"simone-mignoni","crunchbase_url":"http://www.crunchbase.com/person/simone-mignoni","homepage_url":"","birthplace":"Codogno","twitter_username":"simonemignoni","blog_url":"","blog_feed_url":"","affiliation_name":"Umana S.p.A.","born_year":1985,"born_month":4,"born_day":2,"tag_list":"","alias_list":null,"created_at":"Sun Jun 17 10:36:42 UTC 2012","updated_at":"Thu Jun 21 22:27:06 UTC 2012","overview":"<p>He came up with catching ideas.</p>\n\n<p>He got a BA in Philosohpy in 2009. He has always been in love with reading, writing, travelling. After his graduation he left Italy for United States where he has some really good friends and he spent three outstanding months in California. There he has improved his English and almost understood what he wanted to do in his life: working with words and ideas, but he was not so sure, so he kept travelling a little bit more and he left for France. There he has been working and learned French. After that he made up his mind and he got back to Italy and studied for a semester Linguistic and Cognitivism studies at the University of Siena, before definitely understanding that what he should have fighting for was to became a screenwriter. So he found the best Master in Screenwriting he could in Italy and he won the possibilty to join it. Which is what he did for six intensive months.</p>\n\n<p>Ok. Life goes on. He finished the Master and he wrote down a Bible TV Series. Then he had to survive in some sort of way and he picked up a job that has revealed itself amazing as he did not except: salesman for a temporary job agency. He talks to people every day gathering informations and feelings. He has no words to say how much he appreciates what he is doing and learning right now and even if it does not seem linked with Story Telling profession, let me just say: it is.</p>\n\n<p>Ah. Right now he is working with a team of 5 IT Engineers developing an App for the next release of Windows 8.</p>\n\n<p>And is gonna be huge&#8230;</p>","image":null,"degrees":[{"degree_type":"BA","subject":"Philosophy","institution":"Università degli Studi di Parma","graduated_year":2009,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Co-Founder","firm":{"name":"Kakooi","permalink":"kakooi","type_of_entity":"company","image":null}},{"is_past":false,"title":"Salesman","firm":{"name":"Umana S.p.A.","permalink":"umana-s-p-a","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://twitter.com/#!/following","title":""},{"external_url":"http://www.linkedin.com/profile/edit?trk=hb_tab_pro_top","title":""}]}