{"first_name":"Simon","last_name":"Waldman","permalink":"simon-waldman","crunchbase_url":"http://www.crunchbase.com/person/simon-waldman","homepage_url":"http://digitaldisruption.wordpress.com/","birthplace":"","twitter_username":"waldo","blog_url":"http://digitaldisruption.wordpress.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Wed May 05 08:45:24 UTC 2010","updated_at":"Wed May 05 18:31:12 UTC 2010","overview":"<p>Simon Waldman joined the Guardian as a journalist to work on some of its earliest internet ventures in 1996. He was launch editor of Guardian Unlimited in January 1999, and became the company’s first Director of Digital Publishing in 2001. Under his stewardship Guardian Unlimited became a profitable market leader, widely acknowledged as one of the world’s leading newspaper websites, and the recipient of countless awards, including three prestigious Webby’s - ahead of the New York Times and Washington Post. In 2006, he was appointed Director of Digital Strategy and Development at Guardian Media Group plc and a member of the Group’s Executive Committee, where he is responsible for creating and driving digital strategy across all the Group’s divisions, and working closely with GMG Chief Executive Carolyn McCall on the Group’s broader strategic development. Before joining the Guardian, Simon worked as a freelance journalist, specialising in media and technology. From September 2006 to February 2009, Simon was Chairman of the UK Association of Online Publishers (AOP), and he was appointed to the Board of Eniro, a Swedish directories business, in April 2008. He is married with 3 children.</p>","image":{"available_sizes":[[[127,150],"assets/images/resized/0008/6021/86021v3-max-150x150.jpg"],[[200,235],"assets/images/resized/0008/6021/86021v3-max-250x250.jpg"],[[200,235],"assets/images/resized/0008/6021/86021v3-max-450x450.jpg"]],"attribution":"<p>Eniro</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}