{"first_name":"Simon","last_name":"Ginsberg","permalink":"simon-ginsberg","crunchbase_url":"http://www.crunchbase.com/person/simon-ginsberg","homepage_url":"http://www.usercentric.net","birthplace":"New York","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1971,"born_month":3,"born_day":19,"tag_list":"","alias_list":null,"created_at":"Wed Jul 25 17:57:33 UTC 2012","updated_at":"Sat Jul 28 11:42:16 UTC 2012","overview":"<p>Simon Ginsberg\nSimon@UserCentric.Net</p>\n\n<p>Mr. Ginsberg is the founder of User Centric Communications. He is responsible for the overall strategic focus of the Company as well as developing sales and joint venture opportunities. Mr. Ginsberg also manages the Company&#8217;s sales force. Prior to starting the Company, Mr. Ginsberg performed investment banking services for his own company based in New York City. Clients included Arthur Anderson as well as several publicly traded companies and private equity firms.</p>\n\n<p>Mr. Ginsberg worked at two law firms prior to founding UCC. Most recently, he was an attorney at O&#8217;Sullivan Graev &amp; Karabell in New York City where he successfully closed private equity deals and acquisitions for web and technology based companies. Prior to joining O&#8217;Sullivan Graev &amp; Karabell, Mr. Ginsberg practiced law with the New York firm of Stroock &amp; Stroock &amp; Lavan where he specialized in securities, acquisitions and public offerings.</p>\n\n<p>Prior to law school, Mr. Ginsberg was an investment banking intern at Allen &amp; Company in New York City where he was responsible for analyzing startup and follow-on financing deals.</p>\n\n<p>Mr. Ginsberg graduated with &#8220;Distinction&#8221; from Emory Law School. Prior to Emory, Mr. Ginsberg attended Pomona College where he was a &#8220;Pomona College Scholar.&#8221; During his college career, Mr. Ginsberg raced bicycles as a semi-professional in Europe and as a guest on the United States National Team.</p>\n\n<p>Mr. Ginsberg attended the Bronx H.S. of Science where he spent most of his time racing bicycles and maintaining his floor waxing business at various local establishments on the Upper West Side.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0020/2816/202816v2-max-150x150.jpg"],[[178,250],"assets/images/resized/0020/2816/202816v2-max-250x250.jpg"],[[321,450],"assets/images/resized/0020/2816/202816v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}