{"first_name":"Sina","last_name":"Safarzadeh Amiri","permalink":"sina-safarzadeh-amiri","crunchbase_url":"http://www.crunchbase.com/person/sina-safarzadeh-amiri","homepage_url":"http://www.amiristrategies.com","birthplace":"","twitter_username":"mobile4dev","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Jul 10 17:02:33 UTC 2011","updated_at":"Fri Dec 16 01:34:32 UTC 2011","overview":"<p>Sina is President of the Seneca Alumni Association and a past member of Seneca&#8217;s Honorary Degree Committee. He has served as a Senior Consultant with a Toronto-based non-profit corporation that provides management consulting services to leaders in that sector, helping them improve organizational performance and social impact. </p>\n\n<p>Prior to establishing an independent strategy consulting and business advisory practice focused on serving the needs of emerging and high-growth technology companies, Sina was responsible for maximizing financial performance through contract management, sales operations and customer care quality initiatives at Nightingale Informatix Corporation. Before joining Nightingale, he was the Manager of Business Development at Medworxx Inc. and the Marketing Manager at a privately held healthcare IT company. Sina has participated in trade missions to Washington, DC and Philadelphia, PA along with Canadian business leaders. He worked with General Motors of Canada and Deloitte &amp; Touche LLP before entering the high-tech sector.</p>\n\n<p>Sina has completed Queen’s University&#8217;s Strategic Analytics (Executive Development) Program, the York University Schulich School of Business&#8217; Executive Program in Sales Management and a Fortune 500 company&#8217;s channel sales training program for healthcare IT executives. He holds an Ivey League Certificate in Executive Leadership from Cornell University, a Certificate in Project Management from the University of Toronto, an Advanced Diploma in Marketing Administration along with a Certificate of Achievement in Computer Graphics Design through Seneca College.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0014/3363/143363v2-max-150x150.jpg"],[[200,200],"assets/images/resized/0014/3363/143363v2-max-250x250.jpg"],[[200,200],"assets/images/resized/0014/3363/143363v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}