{"first_name":"sion","last_name":"buckler","permalink":"sion-buckler","crunchbase_url":"http://www.crunchbase.com/person/sion-buckler","homepage_url":"http://wavetele.com","birthplace":"Llandough, Cardiff","twitter_username":"","blog_url":"http://trusted-office.blogspot.co.uk/","blog_feed_url":"","affiliation_name":"?1","born_year":1984,"born_month":10,"born_day":10,"tag_list":"sion-buckler, mod, entrepreneur, web-development, telecommunication, cyber-security, electronic-warfare","alias_list":null,"created_at":"Sat Jun 02 20:13:31 UTC 2012","updated_at":"Sat Jun 09 15:50:41 UTC 2012","overview":"<p>Over a decade in telecommunications, digital advertising and web development has sculpted this unique online entrepreneur. Before leaving school Sion simultaneously studied a home based learning diploma in electronic engineering and industrial electronics. This qualified him an opportunity to work in cyber security and electronic warfare with the British Army during the early 21st century where he embraced his passion for web development and hacking. By his early twenties he&#8217;d excelled in his military career but chose to leave the MOD and become and internet entrepreneur. Sion possesses a rare paradigm which balances between that of an institutional and network thinker. </p>\n\n<p>He has experience and expertise working on global government network &amp; telecommunication infrastructures in addition to pioneering web based services and revenue models for corporations including his own. A dedicated, competent and thorough planner/ consultant, delivering complex technical projects with benefits that exceed the stakeholder’s quality expectation every time. Accustom to operating in upbeat, dynamic environments Sion introduces lasting, resourceful and future-proof solution using his vision and dedicated work ethics which creates leaps in technological advances. A digital architect, philosopher and activist, Sion works towards the social change ideology of creating a resource based economy.</p>\n\n<p>Skills &amp; Experience</p>\n\n<p>A track record in over achievement with extensive technical knowledge and experiences ranging from component level repair, network design, system design, system integration and voice/ surveillance/ radio/ data and satellite communications. Sion is the source of choric solutions in any technical environment as well as a confident trainer and manager of junior technicians. Going further Sion is a competent department head with management experience in manning, reporting, staff career development and fire, electrical and health &amp; safety risk. </p>\n\n<p>A proficient internet marketer and ERP system developer Sion has disciplines in most areas of business management and web development languages ranging from Pascal, PHP, Java and Ajax to CSS3 and HTML5.  Working at the cutting edge of technology for the last ten years Sion has only ever been at the forefront of innovation during which time he’s contributed repeatedly to developing today’s online user experiences.  </p>","image":{"available_sizes":[[[150,101],"assets/images/resized/0019/3635/193635v2-max-150x150.jpg"],[[250,169],"assets/images/resized/0019/3635/193635v2-max-250x250.jpg"],[[450,304],"assets/images/resized/0019/3635/193635v2-max-450x450.jpg"]],"attribution":"<p>Sion Buckler</p>"},"degrees":[],"relationships":[{"is_past":true,"title":"Developed A Solution","firm":{"name":"Santander Bank","permalink":"santander-bank","type_of_entity":"financial_org","image":{"available_sizes":[[[150,51],"assets/images/resized/0006/8628/68628v1-max-150x150.jpg"],[[207,71],"assets/images/resized/0006/8628/68628v1-max-250x250.jpg"],[[207,71],"assets/images/resized/0006/8628/68628v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://wavetele.com","title":"Wave Telecoms"},{"external_url":"https://www.thebigawards.co.uk/Page/ViewIdea?ideaid=2129","title":"Cisco British Innovation Award 2012 (Favourite to Win)"},{"external_url":"http://www.valelife.co.uk/aut_07/features/media.htm","title":"First Company After Leaving the MOD"}],"web_presences":[{"external_url":"https://www.facebook.com/hywel.buckler","title":"Facebook"},{"external_url":"http://www.linkedin.com/in/sionbuckler","title":"LinkedIn"},{"external_url":"https://twitter.com/#!/trustedofficeuk","title":"Twitter"},{"external_url":"http://angel.co/hywel-buckler","title":"Angel List"},{"external_url":"http://trusted-office.blogspot.co.uk/","title":"Blog"}]}