{"first_name":"SIX D MARKETING","last_name":"SOLUTIONS (P) LTD.","permalink":"six-d-marketing-solutions-p-ltd","crunchbase_url":"http://www.crunchbase.com/person/six-d-marketing-solutions-p-ltd","homepage_url":"http://www.sixdindia.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"engineering-consultant-company, engineering-consultant-service, 3d-scanner, 3d-white-light-scanner, portable-cmm, cad-inspection-software, reverse-engineering","alias_list":null,"created_at":"Tue Apr 17 11:02:43 UTC 2012","updated_at":"Mon Apr 23 00:24:04 UTC 2012","overview":"<p>SIX D MARKETING SOLUTIONS (P) LTD. </p>\n\n<p>Offering 3D White light Scanner, HDS Laser Scanner Handheld Portable Laser Scanner System, Portable CMM, Portable Arm, Laser Tracker, Wireless Probing, Dynamic Measuring Machine, Vibration &amp; Motion Analysis System, Scanning Services, RE Services, 3D CAD Services.</p>\n\n<p>Six D is a renowned engineering solution provider in India specializing in Engineering Metrology. We are ISO 9001:2008 certified company into sales &amp; services with more than 15 years of work experience based in capital of India, New Delhi. It was established in 2006 with a mission of &#8220;providing latest generation technology products for Industrial application &amp; related area which will bring an edge over the conventional technologies in inspection &amp; design of engineering components and products.</p>\n\n<p>We are registered vendors of Indian Defence Research Centers. Our esteemed customers are DRDO, CRPF, Ordinance Factories, Space Labs, Aerospace Organizations, Premium engineering institutes, Heavy engineering companies, Wind Energy, Automotive and their vendors. Some of them are HONDA, TATA MOTORS UP STEEL, STARWIRE, SMALL-ARM-FACTORY (Ordinance Factory). MTAR, CRPF, DEFENCE LAB, HERO HONDA, SUZLON, KUKA, ABB, ECIL, NT KANPUR, L&amp;T and many more&#8230;</p>\n\n<p>Our customers from Electronics, Automotive, Aerospace &amp; General industries-highly appreciate our systems quality, accuracy and scanned data. Most of the top Asian brands are using our scanner for inspection and designing applications like Sony, LG, Samsung, Toshiba, Hyundai, Suzuki, Honda etc. In US our systems are topping the list with medical equipments and dental application solutions.</p>\n\n<p>Phone : +(91)-(120)-4542274 / 75</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}