{"first_name":"Skippy","last_name":"Fillzem","permalink":"skippy-fillzem","crunchbase_url":"http://www.crunchbase.com/person/skippy-fillzem","homepage_url":"http://www.fillzem.com","birthplace":"New York","twitter_username":"fillzem","blog_url":"http://fillzem.blogspot.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1987,"born_month":11,"born_day":17,"tag_list":"marketing, social-network, seo","alias_list":null,"created_at":"Tue Apr 26 03:38:07 UTC 2011","updated_at":"Wed Apr 27 04:23:25 UTC 2011","overview":"<p>Fillz&#8217;Em is a service that automatically adds your branded, customized profile to all of the internet&#8217;s most popular social networks and business directories.</p>\n\n<p>Fillz&#8217;Em improves your SEO, protects your online brand, expands your marketing reach, and saves you hours of time.  Just fill out one 10-minute form - we&#8217;ll take care of the rest!</p>\n\n<p>Our team of SEO experts takes the information from your form and uses it to populate hundreds of the most relevant networks and directories on the internet.  Rather than going through this tedious process manually, losing information, re-writing descriptions, and spending hours verifying emails and navigating through these websites, we do all of the work for you.</p>\n\n<p>By using Fillz&#8217;Em, you&#8217;ll be protecting your brand identity and exposing yourself to greater online traffic.  You don&#8217;t want to risk the chance that a third party snatches up your brand name on the most popular websites - from there, they can &#8220;hijack&#8221; your brand, preventing you from creating properly-named accounts and even making false accounts with your name!  We reserve your name on all of these sites so that no one else can, and make sure that people find you where they already spend time online.</p>","image":{"available_sizes":[[[150,95],"assets/images/resized/0013/1984/131984v2-max-150x150.jpg"],[[250,159],"assets/images/resized/0013/1984/131984v2-max-250x250.jpg"],[[450,287],"assets/images/resized/0013/1984/131984v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}