{"first_name":"Skip","last_name":"Speaks","permalink":"skip-speaks","crunchbase_url":"http://www.crunchbase.com/person/skip-speaks","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri May 09 22:22:57 UTC 2008","updated_at":"Fri May 09 22:45:05 UTC 2008","overview":"<p>&#8220;Skip Speaks has over twenty years of telecommunications experience in the network operator and the wireless equipment manufacturing and vendor business. Until 2003, he served as a member of the board and CEO for Kyocera Wireless Corp, a San Diego-based wireless handset manufacturer. Speaks is currently serving on the Board of Directors for Glenayre Technology Inc. and on the Board of the San Diego Telecom Council. He joined Rosum Corporation as CEO in 2003. Speaks also serves on Triton Network Systems&#8217; Board of Directors and he was CEO for this startup broadband microwave equipment manufacturer that he and the management team took public during the summer of 2000. Prior to Triton, Speaks spent thirteen years at Ericsson, and most recently served as Executive Vice President and General Manager for Ericsson&#8217;s Wireless Division. As Executive Vice President and General Manager, Speaks was responsible for sales and deployment of Ericsson&#8217;s wireless communications infrastructure in the United States and helped navigate the company through a significant restructuring in order to better address the impact of the convergence of data and voice over wireless networks. Speaks earned a Bachelor of Science Degree for Civil Engineering from West Virginia Institute of Technology and is a registered professional engineer.&#8221; </p>\n\n<p>(Source: <a href=\"http://rosum.com/rosum_experienced_leadership.html\" title=\"Rosum\" rel=\"nofollow\">Rosum</a>)</p>","image":null,"degrees":[{"degree_type":"Bachelor of Science","subject":"Civil Engineering","institution":"West Virginia Institute of Technology","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Rosum","permalink":"rosum","type_of_entity":"company","image":{"available_sizes":[[[141,93],"assets/images/resized/0001/8264/18264v1-max-150x150.png"],[[141,93],"assets/images/resized/0001/8264/18264v1-max-250x250.png"],[[141,93],"assets/images/resized/0001/8264/18264v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}