{"first_name":"Soft","last_name":"Prodigy","permalink":"soft-prodigy","crunchbase_url":"http://www.crunchbase.com/person/soft-prodigy","homepage_url":"http://www.html5mobileappsdesign.com","birthplace":"","twitter_username":"html5mobileApps","blog_url":"http://blog.html5mobileappsdesign.com/","blog_feed_url":"http://html5mobileapps.blogspot.com/feeds/posts/default","affiliation_name":"Unaffiliated","born_year":1984,"born_month":1,"born_day":20,"tag_list":"html5-development, html5-apis, html5-animations, html5-games-development, html5-ria, geo-location-apps, html5-mobile, html5-multimedia, html5-jo, html5-boilerplate, html5-sencha, html5-apps, html5-developers, html5-websites, html5-mobile-design, mobile-op","alias_list":null,"created_at":"Thu Apr 05 07:50:31 UTC 2012","updated_at":"Wed Apr 11 20:56:10 UTC 2012","overview":"<p>HTML5 - The fifth generation Hyper Text Markup Language, HTML5 is the most preferred coding language being used to create web pages.</p>\n\n<p>HTML5 has made quite big in such a short span of time as it brings features that were seriously lacking earlier. It has a number of things to offer that have made it the instant hit that it is. As it is now the time for smartphones, HTML5 has focused on making mobile web an experience better than ever before. Its main advantage lies in the fact that it can be used across different mobile platforms like iOS, Android, BlackBerry, Windows etc. This gives HTML5 a lot more flexibility and wider approach than its counterparts. Also, HTML5 excludes the need of any third party plug-ins like Adobe Flash or Microsoft Silverlight. This has worked towards the advantages of HTML5 quite a lot.</p>\n\n<p>The HTML5 Development team at Soft Prodigy brings you apps with the best integration of multimedia, optimizing both the audio and video features and with marvelous user interface design, html5 mobile optimized designs, GEO location apps, Html5 Animations, Html5 Games development, Html5 Rich Internet Apps, Mobile Web Apps, Native Applications, Html5 Boilerplate apps.</p>\n\n<p>For all your Html5 Development requirements call 866.235.9128!</p>","image":{"available_sizes":[[[150,33],"assets/images/resized/0018/2734/182734v2-max-150x150.jpg"],[[250,56],"assets/images/resized/0018/2734/182734v2-max-250x250.jpg"],[[450,101],"assets/images/resized/0018/2734/182734v2-max-450x450.jpg"]],"attribution":"<p>Html5 Development Company</p>"},"degrees":[{"degree_type":"","subject":"","institution":"Soft Prodigy System Solution (P) Ltd.","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://blog.html5mobileappsdesign.com/","title":"Html5 Mobile Web Development"}],"web_presences":[{"external_url":"http://www.html5mobileappsdesign.com/","title":"Html5 Development"}]}