{"first_name":"Solavei","last_name":"Business","permalink":"solavei-business","crunchbase_url":"http://www.crunchbase.com/person/solavei-business","homepage_url":"http://www.solaveiii.com","birthplace":"Maryland, USA","twitter_username":"Solavei","blog_url":"http://www.solaveiii.com/solavei/","blog_feed_url":"http://feeds.feedburner.com/Solavei-Business","affiliation_name":"Unaffiliated","born_year":1970,"born_month":9,"born_day":15,"tag_list":"solavei, solavei-business, solavei-mobile-service, what-is-solavie, solavei-marketing-system, solavei-international, solavei-maryland","alias_list":null,"created_at":"Sat Oct 13 05:09:44 UTC 2012","updated_at":"Wed Oct 31 00:03:09 UTC 2012","overview":"<p>Solavei is a social networking and commerce platform that enables users to connect, share, and capitalize on the power of social networks. Solavei’s mission is to make commerce less expensive by empowering individuals to earn income on the products and services they enjoy and use every day.</p>\n\n<p>Solavei’s initial product offering is affordable, no-contract, unlimited voice, text, and data services throughout the United States. It operates as an MVNO through a strategic partnership with T-Mobile USA. Solavei is led by former Fortune 100 telecom and retail executives and advisors. “We’re going to make a difference in people’s lives by shifting billions of dollars from traditional mass-media advertising into the greatest advertising vehicle today — people. Solavei is the first company to create an economic linkage between mobile service, social commerce, and social networking technology. We give people the opportunity to earn income by using and promoting the services they are already consuming each and every day.</p>\n\n<p>– Ryan Wuerch, CEO of Solavei</p>\n\n<p>Solavei has a team of some of the best and brightest that the technology and telecommunications fields have to offer. They’ve made big things happen at their previous companies, and now they’re making even more happen at Solavei. They attracted leading people from AT&amp;T, Walmart, J.P. Morgan, Microsoft, and T-Mobile to our team. They partnered with high profile brands and earned the attention of investors from Amazon.com, News Corp., and numerous venture capital firms.</p>\n\n<p>SolaveiTM, a first-of-its kind social networking and commerce platform, launched its unlimited 4G nationwide voice, text and data mobile phone service with more than 25,000 new members at start, unlocking consumers’ earning potential through an affordable, contract-free service that pays people back for adding new customers. Solavei’s business model is shifting the billions of dollars that the large wireless carriers spend in advertising to benefit the greatest advertising vehicle today – people.\nThe debut of Solavei’s flat $49 unlimited mobile phone plan addresses Americans’ struggle for affordable wireless service, as recently highlighted in the findings of a new survey1 conducted by market research firm Toluna. Results showed a majority of consumers (63 percent) had concerns about their mobile phone service, led by overall high cost and followed by hidden fees, plan changes, and charges for exceeding data limits.</p>\n\n<p>Answering the demand for a simple and affordable mobile phone solution, Solavei created a comprehensive mobile virtual network operator (MVNO) to offer an unlimited service plan to its members at just $49 per month. Consumers have the flexibility to use any compatible unlocked GSM mobile phone, or purchase a new HTC One S, HTC Wildfire or ZTE Origin from Solavei. In addition, consumers can now earn income when they share the mobile phone service with their friends and family through Solavei’s social commerce community, which is integrated into the leading social networks.</p>\n\n<p>“Today’s connected consumers depend on their mobile phones but struggle with the cost of current mobile service offers in the market,” said Ryan Wuerch, founder and CEO of Solavei. “Solavei developed a comprehensive social commerce platform with the tools and resources to leverage the power of relationships using existing social networks to make mobile service more affordable – and even profitable – for our members. In three weeks of Beta testing, we’ve enrolled more than 25,000 new members and demonstrated the breadth and scalability of our systems.”</p>\n\n<p>Solavei empowers consumers to earn a recurring monthly income for an action most Americans already take – suggesting favorite products or services to friends and family. In fact, nearly all consumers (93 percent) have referred a product or service. Consumers have the opportunity to earn by sharing their mobile service experience with others through Solavei’s integrated social networking platform.</p>\n\n<p>“Solavei has a unique approach to how it is working with consumers, not treating them as a commodity, but as part of the team,’’ said Roger Entner, founder and lead analyst of Recon Analytics. “As a pioneer in the social commerce market, Solavei has an appealing solution for consumers to earn recurring monthly income.’’</p>\n\n<p>Beginning today, consumers can go to Solavei and check coverage in their area, explore phone options and sign up for service. Through Solavei’s social commerce platform and mobile application, members can share the Solavei Mobile Service experience with others and generate income. At its simplest, members can earn $20 per month for every three mobile-service members (called a “Trio”) they or someone directly connected to them signs up for mobile service. When members enroll three Trios, the income generated is greater than their monthly plan cost of $49, essentially making their mobile service free and profitable. Members can continue to increase their recurring monthly income as they use their social networks to sign up more people for Solavei Mobile Service, turning their mobile phones into income.</p>\n\n<p>Wuerch founded Solavei in recognition of two significant shifts in consumer behavior: social networking and a desire to find new methods of earning income. With regard to consumer lifestyles, Solavei is meeting consumers where they are in this challenging economy. This is validated in the Solavei/Toluna survey results:</p>\n\n<p>Necessity of Mobile Phones – Wireless phone access is so important to Americans that just 4 percent of consumers surveyed said they would cut their phone service when finances are tight, ranking it ahead of gas, savings and cable TV.\nSeeking Financial Stability – Most consumers would re-invest any money saved/earned from mobile phone service back into their finances with more than a third (37 percent) putting money towards other bills, 28 percent towards savings and 13 percent toward paying off debts.</p>\n\n<p>Consumers Want to Recruit – Solavei’s compensation plan seems to make sense (and cents) to those surveyed, as a majority (80 percent) would say “yes” or “maybe” to sharing a new wireless service with friends and family members if they would get free mobile phone service or earn additional income.</p>\n\n<p>If you’re looking to live the future now, check out Solavei and become a part of history today.</p>\n\n<p>http://www.solaveiii.com</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.solaveiii.com/solavei/what-is-solavei/","title":"What is Solavei"},{"external_url":"http://www.solaveiii.com/solavei/solavei-business/","title":"Solavei Business"},{"external_url":"http://www.solaveiii.com/solavei/how-to-start-solavei/","title":"How To Start Solavei"},{"external_url":"http://www.solaveiii.com/solavei/solavei-training/","title":"Solavei Training"}],"web_presences":[{"external_url":"http://www.solaveiii.com/solavei/","title":"Solavei"},{"external_url":"http://www.solaveiii.com","title":"Solavei"}]}