{"first_name":"Sonia","last_name":"Arrison","permalink":"sonia-arrison","crunchbase_url":"http://www.crunchbase.com/person/sonia-arrison","homepage_url":"http://soniaarrison.com","birthplace":"","twitter_username":"Soniaarrison","blog_url":"http://www.soniaarrison.com/blog/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"futuristic","alias_list":"","created_at":"Wed Oct 05 17:34:33 UTC 2011","updated_at":"Mon Oct 10 00:45:09 UTC 2011","overview":"<p>Sonia Arrison is a futurist and policy analyst who has studied the impact of new technologies on society for more than a decade. A Senior Fellow at the California-based Pacific Research Institute (PRI) and a columnist for TechNewsWorld, she is author of two previous books as well as numerous PRI studies on technology issues. A frequent media contributor and guest, her work has appeared in many publications including CBS MarketWatch, CNN, Los Angeles Times, New York Times, Wall Street Journal, and USA Today. She was also the host of a radio show called &#8220;digital dialogue&#8221; on the Voice America network and has been a repeat guest on National Public Radio, Tech TV, and CNN&#8217;s Headline News.</p>\n\n<p>Often asked for advice on technology issues, Sonia has given testimony and served as an expert witness for various government committees such as the Congressional Advisory Commission on Electronic Commerce and the California Commission on Internet Political Practices. She is an instructor for California’s Command College and serves on the Board of Trustees for Singularity University.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0015/6926/156926v1-max-150x150.jpg"],[[151,151],"assets/images/resized/0015/6926/156926v1-max-250x250.jpg"],[[151,151],"assets/images/resized/0015/6926/156926v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}