{"first_name":"Sonja","last_name":"Perkins","permalink":"sonja-perkins","crunchbase_url":"http://www.crunchbase.com/person/sonja-perkins","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Jobfox","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Dec 24 20:28:37 UTC 2009","updated_at":"Sat Dec 17 02:01:07 UTC 2011","overview":"<p>Sonja Hoel Perkins is a venture capitalist, angel and philanthropist. Sonja joined Menlo Ventures in 1994 and has been a Managing Director in five Menlo Ventures funds. Currently Sonja is an angel and serves on the boards of five Menlo companies. She serves as an adviser to many other high tech companies. Prior to Menlo Ventures, Sonja was in Business Development for Symantec Corporation and was an Investment Analyst for TA Associates. In business, Sonja focuses primarily on Internet, mobile, communications and software investments. She has invested in over 40 companies throughout her career including three that achieved multi billion dollar valuations including AcmePacket (APKT), F5 Networks (FFIV) and McAfee Associates (acquired by Intel). Several companies, including the ones listed above and Q1 Labs, have returned in $100 million plus to her investors. Selected current investments include: 3VR, Crowdcast, Ditto, Dygest, Flurry, HealthTap, Mee Genius, Minted.com, MOG, nCircle, OnSophic, Prism Skylabs, Socialcast and UrbanSitter.</p>\n\n<p>Sonja serves or has served as a director of the Western Association of Venture Capitalists (WAVC), the Foundation Board of the McIntire School of Commerce at the University of Virginia, the Thomas Jefferson Foundation and Meals on Wheels of San Francisco. She is also the past President of the WAVC. Sonja is a supporter of the arts and has helped with the creation of SCKBSTD, an original musical by three-time Grammy award winning singer-songwriter Bruce Hornsby, and “The Glass Ceiling”, the dramatic untold documentary of Pasang Lhamu Sherpa&#8217;s quest to become the first Sherpa woman to summit Mt. Everest. She is the founder of Project Glimmer, a non-profit organization that provides holiday gifts to women and teens. Sonja is a graduate of the University of Virginia (B.S. in Commerce with distinction) and the Harvard University Graduate School of Business Administration (M.B.A.).</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0016/6257/166257v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0016/6257/166257v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0016/6257/166257v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Director","firm":{"name":"Jobfox","permalink":"jobfox","type_of_entity":"company","image":{"available_sizes":[[[120,47],"assets/images/resized/0000/3052/3052v1-max-150x150.jpg"],[[120,47],"assets/images/resized/0000/3052/3052v1-max-250x250.jpg"],[[120,47],"assets/images/resized/0000/3052/3052v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Managing Director","firm":{"name":"Menlo Ventures","permalink":"menlo-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/5062/15062v3-max-150x150.jpg"],[[180,180],"assets/images/resized/0001/5062/15062v3-max-250x250.jpg"],[[180,180],"assets/images/resized/0001/5062/15062v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}