{"first_name":"Sonu","last_name":"Aggrawal","permalink":"sonu-aggrawal","crunchbase_url":"http://www.crunchbase.com/person/sonu-aggrawal","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unify²","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Oct 19 19:41:55 UTC 2012","updated_at":"Wed Nov 07 05:50:50 UTC 2012","overview":"<p>Prior to founding Unify2, Sonu was the Director of Program Management/Group Program Manager for the Office Communications Server team at Microsoft, where he drove the roadmap, technical feature set, and execution for the OCS Server product line including Live Communications Server 2005, Office Communications Server 2007, and the roadmap for the next two releases of Office Communications Server. Sonu led the OCS Program Management team responsible for the feature set, feature design and technical specifications for all Server aspects of OCS. He drove extensive customer feedback from dozens of global enterprises into the technical design of OCS.</p>\n\n<p>Most recently, Sonu was the Director of Technical Strategy and Partnerships for OCS, where he led technical roadmap and delivery for the Open Interoperability Program and Microsoft&#8217;s partnerships with Nortel, Cisco, and other IP-PBX vendors.</p>\n\n<p>Sonu has a B.S. and M.S. in Electrical Engineering and Computer Science from the Massachusetts Institute of Technology. At the MIT Laboratory for Computer Science, he invented the first time-optimal self-stabilizing spanning tree algorithms for asynchronous computer networks.</p>\n\n<p>Sonu co-invented Enterprise Instant Messaging as co-founder of Flash Communications, which was acquired by Microsoft in 1998 to seed its enterprise Real-Time Collaboration efforts starting with Exchange 2000. Sonu holds four patents in Real-Time Collaboration, including the first-ever patent for enterprise Instant Messaging. He is the co-author of Internet RFC 2779. </p>","image":{"available_sizes":[[[117,150],"assets/images/resized/0021/8922/218922v2-max-150x150.jpg"],[[196,250],"assets/images/resized/0021/8922/218922v2-max-250x250.jpg"],[[213,271],"assets/images/resized/0021/8922/218922v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO ","firm":{"name":"Unify² (Unify Square) ","permalink":"unify-2","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0021/4911/214911v2-max-150x150.png"],[[250,74],"assets/images/resized/0021/4911/214911v2-max-250x250.png"],[[450,133],"assets/images/resized/0021/4911/214911v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}