{"first_name":"Soo","last_name":"Boon Koh","permalink":"soo-boon-koh","crunchbase_url":"http://www.crunchbase.com/person/soo-boon-koh","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jul 20 23:43:08 UTC 2011","updated_at":"Wed Jul 20 23:43:47 UTC 2011","overview":"<p>Soo Boon has over 30 years of global experience in finance and venture capital investing and brings this valuable expertise to each and every investment. She founded iGlobe Partners in 1999, in which the funds sponsor is the Economic Development Board (EDB) of Singapore, the pre-eminent statutory board responsible for enhancing Singapore&#8217;s global economic and business position. iGlobe Partners also started iGlobe Treasury Fund (NZ$31 million fund) in 2003 as a joint venture with the New Zealand Government.</p>\n\n<p>From 1988 to 1999, Soo Boon held executive management positions with Vertex Management Inc., (Vertex), the venture capital arm of Singapore Technologies, managing three funds during her tenure. She established the US operation of Vertex and headed the Silicon Valley office for 9 years, where she was instrumental in the early days of technology transfer for over 100 engineers in Silicon Valley for Chartered Semiconductor and Chartered Microwave. Soo Boon then started Vertex&#8217;s European operations (headquartered in London, United Kingdom) and ran its European investment operation. As a result of her expertise, she guided numerous successful investments to IPOs, such as Lattice Semiconductor, Creative Technologies, and Activcard SA.</p>\n\n<p>Before Vertex, Soo Boon also held various senior management positions in the Treasury and Credit departments in her 12 years of work in the Development Bank of Singapore. Her time there also equipped her with in-depth knowledge of the finance aspect of the venture capital industry. She also headed the International Departments, Credit Division with responsibility for its eight overseas offices and Syndication Department for the Asia-Pacific region.</p>\n\n<p>Soo Boon earned her degree in 1973 from King&#8217;s College, University of London with a Bachelor of Science Degree in Mathematics (First Class Honors). She attended the INSEAD Advanced Management program in 1998.</p>\n\n<p>Currently, she serves on the boards of directors of several private companies, including Fortemedia (Nanjing), Telenav Inc., and u-blox AG (SWX:UBXN). Since 2003, she serves on the Investment Committee of iGlobe Treasury Fund, a supported by the New Zealand Government. She is also one of the founding members of the Monte Jade (Singapore Chapter) and an EXCO member of the Singapore Chinese Chamber of Commerce.</p>","image":{"available_sizes":[[[80,82],"assets/images/resized/0014/5387/145387v1-max-150x150.png"],[[80,82],"assets/images/resized/0014/5387/145387v1-max-250x250.png"],[[80,82],"assets/images/resized/0014/5387/145387v1-max-450x450.png"]],"attribution":"<p>iglobe partners team page</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Founder & Managing Partner","firm":{"name":"iGlobe Partners","permalink":"iglobe-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,30],"assets/images/resized/0002/9210/29210v2-max-150x150.jpg"],[[250,51],"assets/images/resized/0002/9210/29210v2-max-250x250.jpg"],[[282,58],"assets/images/resized/0002/9210/29210v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}