{"first_name":"Sophie","last_name":"Vandebroek","permalink":"sophie-vandebroek","crunchbase_url":"http://www.crunchbase.com/person/sophie-vandebroek","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jan 08 01:00:57 UTC 2009","updated_at":"Thu Jan 08 01:27:39 UTC 2009","overview":"<p>Dr. Sophie Vandebroek is Xerox&#8217;s Chief Technology Officer and the President of the Xerox Innovation Group. She was named to this position January 2006, and became a Corporate Vice President in February 2006.</p>\n\n<p>Vandebroek is responsible for overseeing Xerox&#8217;s worldwide research centers and for maximizing the company&#8217;s returns on investment in research and technology.</p>\n\n<p>Previously, she was Chief Engineer of Xerox Corporation and Vice President of the Xerox Engineering Center. As Chief Engineer, a position she assumed in 2002, Vandebroek was responsible for coordinating Xerox&#8217;s engineering efficiency and effectiveness, a period during which Xerox refreshed more than 95 percent of its product line and launched its flagship iGen3™ Digital Production Press. Prior to that, she served as Chief Technology Officer at Carrier Corp. From 1991 until 2000, Vandebroek held a number of increasingly responsible roles at Xerox including technical advisor to Xerox&#8217;s chief operating officer and director of the Xerox Research Centre of Canada.</p>\n\n<p>Vandebroek is a Fellow of the Institute of Electrical &amp; Electronics Engineers and served as an elected member on the IEEE Electron Devices Society Administrative Committee. She is also a Fulbright Fellow and a Fellow of the Belgian-American Educational Foundation. She holds 12 US patents.</p>\n\n<p>Vandebroek has received awards from Xerox, IBM, HP, Monsanto, the Belgium National Science Foundation, Semiconductor Research Corporation, IEEE, and Cornell University. Vandebroek served as a judge for MIT&#8217;s Technology Review Young Innovators awards, the Wall Street Journal Innovation awards and the FIRST Lego and Robotics competition regional awards. Vandebroek is a member of the Board of Directors of PARC Inc., and currently serves on several university and professional advisory boards.</p>\n\n<p>Vandebroek was born in Leuven, Belgium. She earned a master&#8217;s degree in electro-mechanical engineering from Katholieke Universiteit, Leuven, Belgium, and a Ph.D. in electrical engineering from Cornell University.</p>","image":{"available_sizes":[[[100,103],"assets/images/resized/0003/3362/33362v1-max-150x150.jpg"],[[100,103],"assets/images/resized/0003/3362/33362v1-max-250x250.jpg"],[[100,103],"assets/images/resized/0003/3362/33362v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.xerox.com/go/xrx/template/inv_rel_newsroom.jsp?ed_name=Sophie_Vandebroek&amp;app=Newsroom&amp;format=biography&amp;view=ExecutiveBiography&amp;Xlang=en_US\" title=\"Xerox\" rel=\"nofollow\">Xerox</a></p>"},"degrees":[],"relationships":[{"is_past":true,"title":"CTO","firm":{"name":"Xerox","permalink":"xerox","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0002/2592/22592v1-max-150x150.png"],[[167,56],"assets/images/resized/0002/2592/22592v1-max-250x250.png"],[[167,56],"assets/images/resized/0002/2592/22592v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}