{"first_name":"Sophie","last_name":"Wilson","permalink":"sophie-wilson","crunchbase_url":"http://www.crunchbase.com/person/sophie-wilson","homepage_url":"http://www.emobileoffers.co.uk/","birthplace":"London","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1986,"born_month":1,"born_day":1,"tag_list":"contract-mobile-phones","alias_list":null,"created_at":"Sat Apr 30 08:09:32 UTC 2011","updated_at":"Mon Jun 27 18:20:29 UTC 2011","overview":"<p>The eMobileoffer is one of the leading U.K. based online mobile shop that is dealing in offering the splendid handsets of top notch brands like Nokia, HTC, LG, Samsung, Blackberry etc. On this online mobile shop, one can grab the information about exclusively launched branded phones and also to purchase them. Furthermore, we also enable one to compare the mobile phone deals like contract mobile phone, pay as you go phone, Sim only deals and lots more. We have offered branded phones at cheap price under the best offered mobile phone deals. It is not all over, under the best offer, one can also grab the quality gadgets through us with added advantages of free gifts or accessories as well. Moreover, our mobile phone offers also enable one to grab the benefits of free minutes talk time, free SMS, free roaming services with braded handsets. On this portal one can also compare the branded gadgets in terms of their features, prices and deals as well. \nApart from this, we have also offered the hassle free Internet services of highly acclaimed network service providers like O2, Virgin, T-mobile, Vodafone, Orange, 3- mobile etc. The offered network services may be available under the different network service packages which may be valid at monthly or yearly basis. In nut shell, eMobileoffer is the one stop solution to grab the branded phones at cheap price with the benefits of free gifts and high speed network services as well. For more information, you can also logon the website as http://www.eMobileoffers.co.uk and come to know about our best mobile phone offers with ease.</p>\n\n<p>Email: info@emobileoffers.co.uk</p>\n\n<p>Add :Watford , Hertfordshire WS17 1NS</p>\n\n<p>zip code - WD17 1NS</p>\n\n<p>Ph no – 0123456789</p>","image":{"available_sizes":[[[150,27],"assets/images/resized/0013/2692/132692v2-max-150x150.jpg"],[[223,41],"assets/images/resized/0013/2692/132692v2-max-250x250.jpg"],[[223,41],"assets/images/resized/0013/2692/132692v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}