{"first_name":"Søren","last_name":"Jessen Nielsen","permalink":"soren-jessen-nielsen","crunchbase_url":"http://www.crunchbase.com/person/soren-jessen-nielsen","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":"","created_at":"Mon Nov 24 22:07:05 UTC 2008","updated_at":"Wed Jun 27 14:52:26 UTC 2012","overview":"<p>Søren has more than sixteen years working experience in the High-Tech, General Management, Strategy Consulting and Venture Capital/Private Equity industry, having served in multiple senior roles.</p>\n\n<p>Søren began his career in 1989 within core R&amp;D for space applications but soon joined Nokia where he worked for several years in France, Denmark and Sweden. He then joined Andersen Consulting and 3 years later the Management consultancy company A.T. Kearney - at both companies he worked with product &amp; market strategy for telecoms and high-tech companies.</p>\n\n<p>Søren has also had roles as interim Chief Operating Officer - COO, for a mobile semiconductor start-up and Director of Sales &amp; Nordic General Manager for a Californian software (mobile internet focus) start-up company - in these roles he helped raise more than $ 40 Mill in equity for the companies. Most recently he has worked a 5 years in venture capital and private equity. Søren has worked in a $ 200 Million Nordic technologies venture fund and Partner and co-founder in a $ 100 Million industry Leveraged-Buy-Out fund. The past few years he has also been engaged in various entrepreneurial start-up in Asia and US.</p>\n\n<p>Søren holds a Masters Degree from Aalborg University, Denmark, graduated with highest honors; in Microelectronics and Telecom combined with a years extend master thesis in microelectronics at ESIEE, France. He has complemented this with Executive Programs in strategy and finance from INSEAD - France.</p>","image":{"available_sizes":[[[120,120],"assets/images/resized/0002/9465/29465v1-max-150x150.jpg"],[[120,120],"assets/images/resized/0002/9465/29465v1-max-250x250.jpg"],[[120,120],"assets/images/resized/0002/9465/29465v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Northcap Partners","permalink":"northcap-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,13],"assets/images/resized/0002/9457/29457v1-max-150x150.jpg"],[[217,19],"assets/images/resized/0002/9457/29457v1-max-250x250.jpg"],[[217,19],"assets/images/resized/0002/9457/29457v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}