{"first_name":"Souheil","last_name":"Badran","permalink":"souheil-badran","crunchbase_url":"http://www.crunchbase.com/person/souheil-badran","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"First Data Corporation","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 31 06:19:41 UTC 2007","updated_at":"Wed Oct 31 21:38:58 UTC 2012","overview":"<p>Souheil Badran\n Senior Vice President &amp; General Manager, eCommerce Solutions\n First Data Corporation</p>\n\n<p>Souheil Badran leads First Data eCommerce Solutions as senior vice president and general manager. Powered by a suite of industry-leading services, First Data eCommerce Solutions enables businesses to transact securely in an eCommerce and Card Not Present environment and tailors to the unique needs of conducting commerce in the digital age.</p>\n\n<p>Souheil joined First Data in January 2008 with extensive experience in high technology organizations including sales and marketing, product management, strategic development, mergers and acquisitions, and high-growth initiatives. </p>\n\n<p>Prior to First Data, Souheil was president and general manager for Rebtel, responsible for driving Rebtel&#8217;s growth strategy and operations in the Americas and APAC regions.</p>\n\n<p>Souheil joined Rebtel from VeriSign where he served as vice president and general manager for their international operations across Europe, Middle East, Africa, India, Central and Latin America and Asia Pacific. He also had responsibility for VeriSign&#8217;s Global Channel and Partner programs. </p>\n\n<p>Prior to VeriSign, Souheil was at Digital Insight, an Internet Banking provider, where he launched their Cash Management solution running in a service bureau environment. He was part of the management team that positioned the firm through a successful IPO in October 1999. He has also held senior positions at Metavante Corporation in Milwaukee, Wisconsin.</p>\n\n<p>Souheil serves on the Board of Trustees for Cardinal Stritch University and is on several technology Advisory Boards.</p>\n\n<p>Souheil received his M.B.A. in Marketing and undergraduate degree in Computer Studies from Cardinal Stritch University in Milwaukee, Wisconsin.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0008/4158/84158v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0008/4158/84158v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0008/4158/84158v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"SVP & GM","firm":{"name":"First Data Corporation","permalink":"first-data-corporation","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0021/8170/218170v1-max-150x150.jpg"],[[189,63],"assets/images/resized/0021/8170/218170v1-max-250x250.jpg"],[[189,63],"assets/images/resized/0021/8170/218170v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}