{"first_name":"Spencer","last_name":"Lewis Sterling","permalink":"spencer-lewis-sterling","crunchbase_url":"http://www.crunchbase.com/person/spencer-lewis-sterling","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"DEALMAKER.COM","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Sep 30 20:52:47 UTC 2009","updated_at":"Fri Oct 02 00:03:10 UTC 2009","overview":"<p>Spencer Sterling was born in Los Angeles and had a highly successful career with the Ford Motor Company. </p>\n\n<p>37 years with Ford Motor Company included appointments to progressively more senior executive positions in the United States, Canada, Europe, South Africa, Australia and Taiwan. In 1982 he resigned a senior management position with Ford in Detroit, to take up the position of Managing Director of the Sigma Motor Corporation. Sigma was one of the largest motor manufacturers, importers and distributors in South Africa in the 1970&#8217;s and early 80&#8217;s. A wholly owned subsidiary of LSE100 conglomerate, Anglo American Corporation. </p>\n\n<p>In 1985, Sigma Motor Corporation, still under leadership of Spencer Sterling, was merged with Ford South Africa to form the South African Motor Corporation (SAMCOR). Mr. Sterling was then appointed as Group Managing Director and Chairman. </p>\n\n<p>In March 1988 he was elected President of the National Association of Automobile Manufacturers of South Africa, a position he held for an unprecedented four years. </p>\n\n<p>In 1992 he was appointed to the main board of directors of the Anglo American Industrial Corporation. </p>\n\n<p>In 1992 he was also elected President of the South African Federated Chamber of Commerce and Industry. </p>\n\n<p>In March 1994 Mr. Sterling chose to retire from the formality of running big public corporations to start a new career as an entrepreneur and international business consultant. This has enabled him to enjoy not only further success and independence, but the opportunity to give back his wealth of knowledge and experience. </p>\n\n<p>Spencer graduated from University with a BSc degree in Metallurgy and Mechanical Engineering. In 1974 he completed his MBA. In 1988 he was awarded an Honorary Professorship by the University of Pretoria and two years later was elected to the Council of the University. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chairman & CEO","firm":{"name":"DEALMAKER.COM","permalink":"dealmaker-com","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0006/1332/61332v2-max-150x150.jpg"],[[180,180],"assets/images/resized/0006/1332/61332v2-max-250x250.jpg"],[[180,180],"assets/images/resized/0006/1332/61332v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}