{"first_name":"Sridhar","last_name":"Obilisetty","permalink":"sridhar-obilisetty","crunchbase_url":"http://www.crunchbase.com/person/sridhar-obilisetty","homepage_url":"http://www.mfino.com","birthplace":"","twitter_username":"sridhar1116","blog_url":"","blog_feed_url":"","affiliation_name":"mFino","born_year":1970,"born_month":11,"born_day":14,"tag_list":"sridhar-obilisetty, mobile-banking, mobil-solution, mobile-software","alias_list":null,"created_at":"Sun May 02 07:29:54 UTC 2010","updated_at":"Thu Aug 18 23:33:08 UTC 2011","overview":"<p>Sridhar Obilisetty\nPresident &amp; CEO, Co-founder - mFino Inc.</p>\n\n<p>Sridhar founded mFino in February 2009 in partnership with Ori Sasson. He worked with mobile network operators, financial institutions in delivering an advanced mobile financial services platform (with several industry first features such as mobile deposit capture, Active 2 way alerts with CEP/ inference capability, iPhone Edge Computing, Micro-Server technology etc). He is responsible for the company’s operational and strategic direction.</p>\n\n<p>Sridhar is a veteran Silicon Valley executive with 18+ years of successful track record in capitalizing on large market opportunities and building game changing companies. He has strong technology innovation and leadership experience. During his career, Sridhar worked as CEO, Venture Investor, Chief Technology Officer, and Chief Software Architect. He pioneered numerous break-through solutions and played pivotal roles in building companies that delivered immense customer &amp; shareholder value. </p>\n\n<p>Sridhar started his career at Go Corporation (acquired by AT&amp;T; NYSE: T) building the industry’s first mobile operating system designed for a Smart Phone. He built the industry’s first distributed web application server and played a key role in deploying high performance online banking applications for major money center banks such as Bank of America (NYSE: BAC), Citibank (NYSE: C), Banco Santander and web store fronts for leading financial institutions such as Thomas Cook (NasdaqGS: TCG), Liberty Financials.</p>\n\n<p>Earlier in his career, Sridhar was the CEO of Vianeta (leader in the clinical documentation space). He built a new Ad Unit, Analytics Engine &amp; Trading Platform for monetizing brand exposures inside of content (tv, films &amp; music videos) at NextMedium. In addition to working as a Venture Investor, Sridhar played a pivotal role in building BroadVision from a startup employing 20 people to a $10B market-cap company with over 1200 people. He helped grow the company revenues from 0 -&gt; $10 -&gt; $40 -&gt; $120 -&gt; $500 million year over year. Prior to BroadVision, Sridhar held Senior Engineering and Product Management positions at Sybase’s Gain Technology Group. He developed Sybase’s New Media Studio product, a popular multimedia authoring tool used by several media companies in the Interactive TV Industry. Sridhar did early work with SMTP/ MIME protocols and was the Lead Architect for Microsoft Exchange Internet Mail Connector – a product developed by WorldTalk Corporation and sold by Microsoft as a private-label. At Go Corporation, he was the Lead Architect for TAP - a test automation programming language for Penpoint, the industry’s first mobile operating system designed for a Smart Phone.</p>\n\n<p>Sridhar holds several technology patents. He built many industry-first solutions in the fields of Distributed Computing, Online Banking, Electronic Commerce, Personalization, XML based Edge Computing, Interactive TV and Mobile Operating Systems. He holds MSc Tech (Masters degree) in Computer Science from BITS Pilani, India.</p>","image":{"available_sizes":[[[127,131],"assets/images/resized/0008/5658/85658v2-max-150x150.jpg"],[[127,131],"assets/images/resized/0008/5658/85658v2-max-250x250.jpg"],[[127,131],"assets/images/resized/0008/5658/85658v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MSc Tech (Masters Degree) ","subject":"Computer Science ","institution":"BITS Pilani, India","graduated_year":1991,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President & CEO, Co-founder","firm":{"name":"mFino","permalink":"mfino","type_of_entity":"company","image":null}},{"is_past":false,"title":"Operating Partner","firm":{"name":"Primera Capital","permalink":"primera-capital","type_of_entity":"financial_org","image":null}},{"is_past":true,"title":"CEO","firm":{"name":"Vianeta","permalink":"vianeta","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.mfino.com/mfino-exec-bios","title":"President & CEO, Co-founder - mFino"},{"external_url":"http://www.linkedin.com/in/sridhar1116","title":"LinkedIn - Sridhar"}]}