{"first_name":"Sridhar","last_name":"Bathina","permalink":"sridhar-bathina","crunchbase_url":"http://www.crunchbase.com/person/sridhar-bathina","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 26 02:11:11 UTC 2009","updated_at":"Fri Jun 26 02:18:48 UTC 2009","overview":"<p>Sridhar (Sri) is a co-founder and Vice President and General Manager of India Operations at Azingo. He has over 20 years of experience in the networking industry at various levels of responsibilities from engineering to management. Sri has strong technical leadership and management skills with an entrepreneurial sprit.</p>\n\n<p>Prior to joining Azingo, Sri was Director of R&amp;D at Nokia in their Enterprise Solutions division where he was responsible for delivering Nokia’s IP-VPN and SSL-VPN solutions for the enterprise market. He also led the development effort on Mobility Gateway solutions based on the Unlicensed Mobile Access (UMA) specifications for the operator markets. Sri also served as the Country Manager for the Nokia Enterprise Solutions R&amp;D center in Hyderabad, India, where he built a team of 120 employees delivering wide variety of projects including security protocols, network protocols, operating system support, and network management.</p>\n\n<p>Prior to Nokia, Sri was co-founder and Vice President of Engineering at Ramp Networks (NASDAQ: RAMP). Ramp Networks was a pioneer in easy to use Internet Access and Security appliances for the SOHO and enterprise remote office markets. Nokia (NYSE: NOK) acquired Ramp in 2001. Sri has held senior engineering positions at Netlabs and AT&amp;T Bells Labs, specializing in network and systems management. Sri has an M.S in Computer Science from Southern Illinois University and a Bachelors degree in Technology from Jawaharlal Nehru Technological University, Hyderabad, India.</p>","image":{"available_sizes":[[[100,133],"assets/images/resized/0005/0784/50784v1-max-150x150.jpg"],[[100,133],"assets/images/resized/0005/0784/50784v1-max-250x250.jpg"],[[100,133],"assets/images/resized/0005/0784/50784v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Vice President and General Manager India Operations","firm":{"name":"Azingo","permalink":"azingo","type_of_entity":"company","image":{"available_sizes":[[[150,70],"assets/images/resized/0005/0780/50780v1-max-150x150.png"],[[167,78],"assets/images/resized/0005/0780/50780v1-max-250x250.png"],[[167,78],"assets/images/resized/0005/0780/50780v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}