{"first_name":"Stanley","last_name":"Tollman","permalink":"stanley-tollman","crunchbase_url":"http://www.crunchbase.com/person/stanley-tollman","homepage_url":"http://www.stanleytollman.info/","birthplace":"Johannesburg, South Africa","twitter_username":"stanleytollman","blog_url":"","blog_feed_url":"","affiliation_name":"The Travel Corporation","born_year":1930,"born_month":9,"born_day":20,"tag_list":"stanley-tollman, the-travel-corporation, travel, tourism, hospitality, hotels, entrepreneur","alias_list":null,"created_at":"Thu Apr 05 11:42:59 UTC 2012","updated_at":"Wed Apr 11 21:01:11 UTC 2012","overview":"<p>Stanley Tollman, the Chairman and founder of the successful global business The Travel Corporation (TTC), celebrated his milestone eightieth birthday surrounded by family, friends and staff at the company’s International Sales Conference (ISC) in Cape Town in 2010. TTC is one of the world’s largest privately owned travel and tourism companies; consisting of over 25 international businesses and brands including tour operators, hotels and other leisure services. </p>\n\n<p>Born in Johannesburg, South Africa in September 1930, Stanley decided to leave university and join his parents in their local restaurant and small hotel, The Palace Hotel. It was around this time that Stanley met and married his wife Beatrice who also had a passion for the hospitality industry.  Together they worked to expand the family business within the hotel and restaurant industry. In the space of a few years they had built a major restaurant and hotel chain called SA Empire. In 1973, in the wake of interest rate hikes and economic recession, a considerable amount of the family fortune was lost and Stanley relocated to the UK with his family to begin again. His assets consisted of a small share in a travel company and a hotel, which was the start of what is known today as The Travel Corporation. TTC brands operate across the globe over five continents, sixty countries and employ more than 4,000 people. Each brand is clearly differentiated and strategically positioned in its market sector. While Stanley is the Chairman of the group, his son Brett (Global CEO) and his two nephews handle the day-to-day management of The Travel Corporation. His wife Beatrice is the founder and President of their luxury chain of hotels, The Red Carnation Hotel Collection, and is prominent in Uniworld River Cruises, both award winning brands with a presence in the US market. Escorted tours are also a popular choice in the US. Brendan Vacations offer first class and deluxe options in Europe, North, Central and South America and the South Pacific. Grand European Tours is a leading US direct marketer of the same locations but primarily targets mature senior American citizens through mail brochures, internet and call centres.</p>\n\n<p>Today, TTC continues to grow and embrace the changes of the travel and tourism industry, which is the fastest growing economic sector and a useful indicator of social and economic growth in the world. The Asian market continues to show signs of opportunity and expansion. The demands of Chinese travellers have evolved from groups on coach tours to requests for luxurious individually tailored holidays. TTC has made a concerted effort to understand and meet the evolving needs of travellers from Asia, specifically those from China; The Travel Corporation believes that involvement in the development of the global tourism industry can have an affect and make a significant difference to the lives of the traveller and to the people of the destination itself. </p>\n\n<p>As well as providing a unique and unforgettable travel experience, TTC also supports the preservation of landscape and wildlife. The Travel Corporation Conservation Foundation (CF), a non-profit organisation, was established and sustained by the companies that fall under the TTC umbrella. CF recognises and supports projects that encourage and provide sustainable tourism.</p>\n\n<p>Although Stanley Tollman is still very actively involved as the Chairman of TTC, he manages to find time to devote to many philanthropic pursuits and support an array of South African charities that are close to his heart.</p>","image":{"available_sizes":[[[124,150],"assets/images/resized/0018/2785/182785v2-max-150x150.jpg"],[[207,250],"assets/images/resized/0018/2785/182785v2-max-250x250.jpg"],[[373,450],"assets/images/resized/0018/2785/182785v2-max-450x450.jpg"]],"attribution":"<p>Stanley Tollman</p>"},"degrees":[{"degree_type":"PHD Honors","subject":"Humain Lettert","institution":"Schiller University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder and Chairman","firm":{"name":"The Travel Corporation","permalink":"the-travel-corporation","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://eurocheddar.com/2011/03/29/stanley-tollman-and-a-family-dynasty/","title":"Stanley Tollman and a Family Dynasty"}],"web_presences":[{"external_url":"http://stanleytollman.magnt.com","title":"Stanley Tollman on Magnt"},{"external_url":"http://www.visualcv.com/stanleytollman","title":"Stanley Tollman - Visual CV"},{"external_url":"http://www.linkedin.com/in/stanleytollman","title":"Stanley Tollman - LinkedIn Profile"}]}