{"first_name":"Stanley","last_name":"Rous","permalink":"stanley-rous","crunchbase_url":"http://www.crunchbase.com/person/stanley-rous","homepage_url":"http://maid-for-mommy.blogspot.com","birthplace":"","twitter_username":"stanleyrous3","blog_url":"http://maid-for-mommy.blogspot.com","blog_feed_url":"http://maid-for-mommy.blogspot.com/feeds/posts/default","affiliation_name":"Unaffiliated","born_year":1984,"born_month":5,"born_day":21,"tag_list":"nj-maid-service, nj-maid, house-cleaning-service, housekeeping-services, maids","alias_list":null,"created_at":"Wed Aug 18 10:34:22 UTC 2010","updated_at":"Wed Aug 18 23:35:58 UTC 2010","overview":"<p>Many housewives would argue that a dark spill on a white carpet is one of the worst household catastrophes possible. Others disagree, stating that cleaning the dust off of oddly shaped trinkets is much more painstaking. Surprisingly, these two cleaning disasters can be prevented in much the same way—saving you frustration and the money it would cost to hire maids.</p>\n\n<p>The key to keeping your home spotless is usually a matter of keeping a lid on things. Cover items when not in use, and avoid leaving items out in the open. Avoid tall, clumsy stemware around your white carpets, and place glass animals and mementos from trips abroad behind the safety of a glass cabinet.</p>\n\n<p>When hosting a party, think in advance about ways to minimize the possibility of spills. Place beverages in an area where spills are unlikely to strike fabrics or fibers. Cover messy snacks, and encourage guests to recover each item after serving. Better yet, serve food in a designated dining area and provide sturdy plates for use when wandering. Playfully tuck a napkin or two in each guest’s hand, and leave extras around in strategic locations. While you cannot put a lid on every plate, by keeping serving areas covered, you’ll prevent a large number of messes.</p>\n\n<p>Think of creative ways to display your small decorations. By leaving them in the open, they are exposed to dust and the possibility of being damaged. Glass cabinetry and domes are excellent ways to protect items without losing sight of them. Monthly, polish the glass. Dust and clean each item yearly, and only if needed. For houseplants with intricate leaves, consider placing them under a clear plastic dome when you do not have company over. The plants will still enjoy sunlight and the added humidity beneath the loose, clear plastic, but they will not accumulate dust on their leaves. This will also protect them from curious pets.</p>\n\n<p>In your pantry, cover each item for two reasons. First, it will keep all items fresher if they’re sealed in an airtight container or sturdy storage bag. Second, it will keep your pantry much cleaner and neater. Knocking over a bag of flour can lead to a two- to three hour clean-up; but knocking over a protected wrapped bag of flour keeps any of the white matter from flying around your shelves, cans and other stored food.</p>\n\n<p>Store unseasonal clothes in sturdy plastic bins when not in use. By keeping your clothes protected, you’ll avoid moths and other unsightly pests that could ruin them over time. An added bonus: if you store them in a tightly closed container with a dryer sheet or two, they’ll be as fresh six months later as they were the day you packed them!</p>\n\n<p>While your housecleaning service might take care of light dusting and vacuuming, there is a good chance that you’ll still want to do a heavier housekeeping services yourself every now and then. By covering items around your home, you’re able to cut down on the time you spend cleaning and on the maintenance of messes or spills. And remember this advice: when it doubt, don’t leave it out!</p>\n\n<p>To know more about house cleaning service tips from NJ maid service visit maidformommy.com.</p>","image":{"available_sizes":[[[150,58],"assets/images/resized/0009/8288/98288v2-max-150x150.png"],[[250,97],"assets/images/resized/0009/8288/98288v2-max-250x250.png"],[[314,122],"assets/images/resized/0009/8288/98288v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}