{"first_name":"Stead","last_name":"Burwell","permalink":"stead-burwell","crunchbase_url":"http://www.crunchbase.com/person/stead-burwell","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jul 28 04:10:02 UTC 2011","updated_at":"Thu Jul 28 04:13:40 UTC 2011","overview":"<p>Since 2006, Mr. Stead Burwell has been working with Alliance Health to help its founder, Geoff Swindle, build and strategically grow its business. Mr. Burwell has worked with startups in several different capacities as an operating executive, founder, venture board member and angel investor. Previously, Mr. Burwell was the catalyst behind Pinger, a Kleiner Perkins funded startup in the consumer voice space. Before that, as Interim CEO for Venafi, an early stage startup company, Mr. Burwell built the early management team and oversaw the closing of initial customers including several Fortune 100 customers. Previously, Mr. Burwell was a technology investor at UV Partners, an early stage venture capital firm based in Salt Lake City that also invested in the healthcare sector. Mr. Burwell was also an equity research analyst at Lehman Brothers covering the Internet sector in the late 90s.</p>\n\n<p>A recognized thought leader in consumer online health, Mr. Burwell has been an invited speaker at the Health 2.0 Conference, the Symposium for Connected Health at Harvard Medical School, and the National Summit on Personalized Healthcare. For the past 4 years, he has served on the State of Utah’s Air Quality Board helping to manage and monitor the State’s air quality programs and policies. Mr. Burwell is a graduate of the University of Virginia where he later received his MBA.</p>","image":{"available_sizes":[[[72,93],"assets/images/resized/0014/6621/146621v1-max-150x150.jpg"],[[72,93],"assets/images/resized/0014/6621/146621v1-max-250x250.jpg"],[[72,93],"assets/images/resized/0014/6621/146621v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Executive Officer","firm":{"name":" Alliance Health Networks","permalink":"alliance-health-networks","type_of_entity":"company","image":{"available_sizes":[[[150,43],"assets/images/resized/0006/0259/60259v1-max-150x150.png"],[[250,73],"assets/images/resized/0006/0259/60259v1-max-250x250.png"],[[345,101],"assets/images/resized/0006/0259/60259v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}