{"first_name":"Stefania","last_name":"Pomponi Butler","permalink":"stefania-pomponi-butler-2","crunchbase_url":"http://www.crunchbase.com/person/stefania-pomponi-butler-2","homepage_url":"http://clevergirlscollective.com","birthplace":"Honolulu, Hawaii","twitter_username":"CityMama","blog_url":"http://clevergirlscollective.com/blog/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1969,"born_month":10,"born_day":22,"tag_list":"business-development, sales, partnerships, co-marketing, blog-production, blogging, social-mediawomen-of-color","alias_list":null,"created_at":"Tue Oct 18 18:33:53 UTC 2011","updated_at":"Sun Oct 30 23:59:26 UTC 2011","overview":"<p>Stefania Pomponi Butler is co-founder and principal of Clever Girls Collective, Inc. and leads sales and business development efforts. She is responsible for inking key client deals. She is a seasoned social media professional and nationally-recognized blogger. Stefania brings a wealth of knowledge of successful blogger marketing and outreach strategies to projects as well as her deep connections to the parent blog world.</p>\n\n<p>Named one of Forbes&#8217; Ten Mommy &#8216;hood Gurus, Stefania has an extensive background in traditional partner marketing/co-branding and social media consulting. She was on Disney’s Family.com Parenting Advisory Board, UpTake.com’s Marketing Advisory Board, and currently serves as a member of Graco’s parents advisory group, Graco Nation.</p>\n\n<p>Stefania is often invited to speak on social media-related topics. She spoke at BlogHer &#8216;07 on professional blogging, at Blogher Business &#8216;08 on marketing to bloggers of color, and at Blog World Expo &#8216;08 on pitching to mom bloggers. In 2009 she spoke at the Engage Her conference about Social Media for Business, at BlogHer &#8216;09 on the subject of marketing to women of color, and presented the opening remarks at the Blogalicious conference and participated in a panel on Social Media. In 2010 she presented various blogging-related topics at the Mom 2.0 Summit, Evo Conference, and BlogHer Chicago. In 2011 she will be a panelist at Blogworld Expo.</p>\n\n<p>Her recent honors include being named one of Babble.com&#8217;s Top 50 Mommy Bloggers, being selected as a Parents&#8217; Magazine &#8220;Power Mom&#8221;, and being &#8220;nominated&#8221; as One of 10 Social Media Women That Deserve a Vanity Fair Article. Her award-winning personal blog, CityMama, won SheKnows.com’s 2010 Parents’ Choice Award for Best Website for Parents.</p>\n\n<p>As a freelance writer, she has articles published in the August 2008 issues of Good Housekeeping and Redbook and the June 2010 issue of Redbook. Her work has appeared in various parenting magazines and newspapers. In August 2011 she was featured on NPR&#8217;s &#8220;All Things Considered.&#8221; </p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0015/8602/158602v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0015/8602/158602v2-max-250x250.jpg"],[[450,300],"assets/images/resized/0015/8602/158602v2-max-450x450.jpg"]],"attribution":"<p>Photo by Heather Durdil</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://itsnotalecture.blogspot.com/2011/08/clever-girl-that-stefania.html","title":"Clever Girl, That Stefania"}],"web_presences":[{"external_url":"http://twitter.com/citymama","title":"Twitter Handle"},{"external_url":"http://www.linkedin.com/in/spbutler","title":"LinkedIn Profile"}]}