{"first_name":"Stefan","last_name":"Strobel","permalink":"stefan-strobel","crunchbase_url":"http://www.crunchbase.com/person/stefan-strobel","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jan 29 23:32:49 UTC 2009","updated_at":"Thu Jan 29 23:32:49 UTC 2009","overview":"<p>Stefan Strobel studied Medical Computer Science at the Heilbronn University of Applied Sciences and the University of Heidelberg, and Intelligence Artificielle at the LIA of the Université de Savoie in Chambery, France.</p>\n\n<p>Even during his studies he worked as a freelancer at a number of IT firms. He was one of the founders of Centaur Communication GmbH in Heilbronn, which later became part of IntegralisCentaur and Articon-Integralis AG.</p>\n\n<p>At Centaur Communication GmbH he was responsible for the company&#8217;s successful restructuring into a purely IT security firm. He was Technical Director at Centaur Communication GmbH, and later Technical Development Director at IntegralisCentaur, also working in Strategic Development at Articon-Integralis AG.</p>\n\n<p>He has many years of experience in consultation services for large companies with high security requirements, as well as in concept and policy formulation.</p>\n\n<p>In addition to this work, he also teaches at professional academies and at the Heilbronn University of Applied Sciences, gives lectures at industry congresses, and is the author of various technical books which have appeared in a number of different languages.</p>\n\n<p>He is Founder and CEO of cirosec GmbH since February 2002.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0003/5277/35277v1-max-150x150.jpg"],[[166,250],"assets/images/resized/0003/5277/35277v1-max-250x250.jpg"],[[240,360],"assets/images/resized/0003/5277/35277v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}