{"first_name":"Stefan","last_name":"Herbert","permalink":"stefan-herbert","crunchbase_url":"http://www.crunchbase.com/person/stefan-herbert","homepage_url":"http://www.magnigroup.de/group/management.php5?locale=en","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"magniventure","alias_list":null,"created_at":"Tue Apr 28 11:04:45 UTC 2009","updated_at":"Sat Apr 14 03:17:19 UTC 2012","overview":"<p>Stefan Herbert, born in 1961, studied Economics and finished with a degree in Business Administration at the University of Erlangen/Nürnberg, Germany. </p>\n\n<p>After his first years in sales at NCR he joined EDS Electronic Data Systems as Sales Manager for Transportation, where he successfully closed outsourcing contracts in the double-digit million ranges. </p>\n\n<p>1997 Stefan took over international management responsibilities for the first time as Sales Director Automotive EMEA at QAD – a leading US-American provider of enterprise solutions. With staff in the UK, Benelux, France, Germany and Poland he successfully grew QAD’s automotive business in EMEA and since then has a vast international network within the software as well as the automotive industry. </p>\n\n<p>After acting as Managing Director Central Europe for Centric Software, Stefan joined Mercury Interactive in 2002 as Sales Director Central Europe for Manufacturing, High Tech, Retail, Chemical/Pharmaceutical and Utilities, where he managed to push sales into these industries substantially. </p>\n\n<p>Before co-founding MagniGROUP in 2005, Stefan Herbert acted as Chief Executive Sales and Marketing for iTAC Software AG, a portfolio company of SAP Ventures and TVM Capital. Here he was responsible for the initial setup of a professional sales and marketing organization as well as the market entry in North America. In this function he reported directly to the supervisory board and lead staff in Germany, Benelux and the US.</p>","image":{"available_sizes":[[[113,150],"assets/images/resized/0004/2760/42760v2-max-150x150.jpg"],[[140,185],"assets/images/resized/0004/2760/42760v2-max-250x250.jpg"],[[140,185],"assets/images/resized/0004/2760/42760v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/sherbe","title":""}]}