{"first_name":"stefan","last_name":"gillard","permalink":"stefan-gillard-2","crunchbase_url":"http://www.crunchbase.com/person/stefan-gillard-2","homepage_url":"http://au.linkedin.com/in/stefanpgillard","birthplace":"Australia","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Aug 07 12:22:53 UTC 2010","updated_at":"Sat Aug 07 17:05:35 UTC 2010","overview":"<p>Summary</p>\n\n<p>Current Australian Chair of the Visual Effects Society (VES)\nCurrent VES Technology Committee Board Member\nCurrently Serving on the Advisory Team for Digital Sydney - the recently launched initiative from Industry &amp; Investment NSW.</p>\n\n<p>With more than fourteen years in visual effects, technology design, strategy and production &amp; operations management, Stefan&#8217;s experience is broad, encompassing all aspects of business disciplines with expertise in technology, consulting, high-end sales, strategic marketing, project management and team-building. </p>\n\n<p>He has worked with numerous international brands and companies including Mazda Motor Corporation, SAS, Rockwell, Mercury Interactive, Toyota, IBM, Microsoft to name but a few. His career has also enabled him to work with national and international accounts and their agencies throughout Asia Pacific including George Patterson Bates, The Campaign Palace, Clemenger Harvie Edge, Imagination, JWT and Doner US, and has an impressive client experience with mostly Fortune 500 companies.</p>\n\n<p>Stefan previously held the positions of both General Manager of Technology for the Omnilab Media Group of companies, as well as CTO of DrD Studios, a new JV between Omnilab Media and Kennedy Miller Mitchell, developing the sequel to Happy Feet, as well as a number of other George Miller properties. </p>\n\n<p>At Omnilab Media, Stefan oversaw the strategic direction, implementation and use of technology for 16 separate companies encompassing Feature Film Animation &amp; VFX (Iloura &amp; Oktobor), and Post Production Services, Satellite Media Delivery, Broadcasting, Play-out and Distribution.</p>\n\n<p>Stefan is currently the Commercial Director and Equity Partner in a 4000 node / 2PB High Speed Storage HPC Cluster in Australia called Steam Engine that services the Oil &amp; Gas, GeoScience, BioMedical, Pharmaceutical, Financial, Games, Animation and Vfx industry in Pan Asia.</p>\n\n<p>Specialties\nVisual Effects, R&amp;D, technology innovation, high-end sales, strategic marketing, project managemant, team-building, professional management consulting, venture financing, business affairs, entertainment &amp; IP development.</p>","image":{"available_sizes":[[[80,80],"assets/images/resized/0009/6464/96464v2-max-150x150.jpg"],[[80,80],"assets/images/resized/0009/6464/96464v2-max-250x250.jpg"],[[80,80],"assets/images/resized/0009/6464/96464v2-max-450x450.jpg"]],"attribution":"<p>Stefan Headshot</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.cio.com.au/article/303748/ominlab_media_stefan_gillard_how_build_high_performance_team/?fp=&fpid=&pf=1","title":"Building High Performance Teams"},{"external_url":"http://www.if.com.au/2010/06/04/article/Feature-Have-You-Got-the-Power/GOCLIRJFIN.html","title":"Inside Film"}],"web_presences":[{"external_url":"http://au.linkedin.com/in/stefanpgillard","title":"Linked IN"}]}