{"first_name":"Stephen","last_name":"Venute","permalink":"stephen-venute","crunchbase_url":"http://www.crunchbase.com/person/stephen-venute","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"MyStrands","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jun 17 08:19:11 UTC 2007","updated_at":"Mon May 26 19:53:54 UTC 2008","overview":"<p>Stephen Venute has over 15 years experience in advertising, marketing, and strategic alliances. Recently at AOL, where he spent 8 years and was responsible for directing and managing complex global marketing alliances. Double major in International Business and Foreign Policy from the American University in Washington DC.</p>\n\n<p>At AOL, Stephen was responsible for directing and managing complex global marketing alliances with some of AOLs largest and most strategic partnerships. He was responsible for developing and implementing cross-divisional initiatives within the Time Warner family of brands and helped to negotiate some of the more complex partnerships within the AOL portfolio. He helped to pioneer numerous successful online ROI initiatives and launched several internet-first programs.</p>\n\n<p>Prior to joining AOL, Stephen spent several years with McCann-Erickson, based in Prague, Czech Republic where he was responsible for managing a portfolio multi-national and local advertising partnerships. While at McCann he managed a substantial number of major consumer packaged goods brands and was instrumental in helping to close new business.</p>\n\n<p>Stephen holds a double major in International Business and Foreign Policy from the American University in Washington DC and and leads Strands East Coast business development efforts.</p>","image":{"available_sizes":[[[49,66],"assets/images/resized/0001/9392/19392v1-max-150x150.png"],[[49,66],"assets/images/resized/0001/9392/19392v1-max-250x250.png"],[[49,66],"assets/images/resized/0001/9392/19392v1-max-450x450.png"]],"attribution":"<p><a href=\"http://www.strands.com/corp/team.vm\" title=\"Strands\" rel=\"nofollow\">Strands</a></p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}