{"first_name":"Stephen","last_name":"Gilfus","permalink":"stephen-gilfus","crunchbase_url":"http://www.crunchbase.com/person/stephen-gilfus","homepage_url":"http://www.gilfuseducationgroup.com","birthplace":"","twitter_username":"gilfuseducation","blog_url":"http://useducationgroup.com","blog_feed_url":"","affiliation_name":"Event Innovation","born_year":null,"born_month":null,"born_day":null,"tag_list":"education-consulting","alias_list":null,"created_at":"Tue Jul 29 17:53:24 UTC 2008","updated_at":"Mon Jul 18 19:17:13 UTC 2011","overview":"<p>Mr.Gilfus launched a distinguished career as a founder of DC based Blackboard Inc. and principal designer of the company’s platforms and products. His work with educational institutions, leading industry publishers, technology partners, industry investors and standards bodies has helped facilitate Global educational opportunities and the development of online learning capacity.</p>\n\n<p>Gilfus has provided leadership strategies to some of the worlds most prestigious academic institutions and world publishers as the primary author of the &#8220;Educational Technology Framework&#8221;, a model used to guide hundreds of academic institutions to contemplate organizational, technological, and social impact of educational technologies on schools, districts, educational organizations and institutions.</p>\n\n<p>He is recognized by many organizations as a key driver behind the growth of the eLearning industry and has presented at hundreds of academic institutions and industry conferences.</p>\n\n<p>Mr. Gilfus has been active in various professional associations and community service organizations throughout his career. He has been a long-time member of EDUCAUSE. He serves on the board of directors of several companies with education initiatives including the Student Employment Council. He leads an extensive network as the organizer and head of the Blackboard, WebCT, Angel Learning and IBM Education Alumni organizations with deep relationships at 85% of the companies in the education space.</p>\n\n<p>In 2007, Mr.Gilfus left Blackboard to form the Gilfus Education Group, an independent organization that brings together a team of highly skilled industry professionals that foster global education innovation. The team partners with today’s organizational and industry leaders to develop effective and lasting improvements to education and provides independent consulting, technical implementation and industry research services to educational institutions, industry investors and the educational companies that serve them.</p>\n\n<p>Stephen has presented and keynoted several leading global industry conferences and has lectured on teaching and learning on the Internet and the growing online education industry. He has a unique ability to apply complex technology to real world problems, a key factor in the industries growth and institutional technology adoption. He is a highly sought-after speaker and presenter at various forums on education and technology.</p>\n\n<p>He is currently providing consultation to several delegations on innovative areas including the development of organizational capabilities for online learning programs, learning platforms, digital content repositories and distribution, enterprise resource planning and student information systems, community platforms, shared services and the development of both physical and virtual universities in Australia, India, Egypt, Saudi Arabia, Albania, Morocco and the United States.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Blackboard","permalink":"blackboard","type_of_entity":"company","image":{"available_sizes":[[[73,73],"assets/images/resized/0002/2581/22581v1-max-150x150.png"],[[73,73],"assets/images/resized/0002/2581/22581v1-max-250x250.png"],[[73,73],"assets/images/resized/0002/2581/22581v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"President and CEO","firm":{"name":"Gilfus Education Group","permalink":"gilfus-education-group","type_of_entity":"company","image":{"available_sizes":[[[150,19],"assets/images/resized/0015/3036/153036v2-max-150x150.png"],[[250,32],"assets/images/resized/0015/3036/153036v2-max-250x250.png"],[[315,41],"assets/images/resized/0015/3036/153036v2-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Chairman and CEO","firm":{"name":"Event Innovation","permalink":"event-innovation","type_of_entity":"company","image":{"available_sizes":[[[115,48],"assets/images/resized/0002/2892/22892v1-max-150x150.png"],[[115,48],"assets/images/resized/0002/2892/22892v1-max-250x250.png"],[[115,48],"assets/images/resized/0002/2892/22892v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.gilfuseducationgroup.com","title":"Gilfus Education Group"},{"external_url":"http://en.wikipedia.org/wiki/Stephen_Gilfus","title":"Gilfus on Wikipedia"}]}