{"first_name":"Stephen","last_name":"Randall","permalink":"stephen-randall","crunchbase_url":"http://www.crunchbase.com/person/stephen-randall","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"LocaModa","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Aug 24 17:34:55 UTC 2007","updated_at":"Fri Jan 22 23:28:28 UTC 2010","overview":"<p>Prior to founding LocaModa, he was a founder of Symbian, the London-based wireless joint venture between Ericsson, Nokia, Panasonic, Psion, Samsung, Siemens and Sony Ericsson. He served on the Operational Board of Symbian from 1998 to 2002 where his roles included COO, EVP Design and Technology and EVP Advanced Data Services. During that period, he was also the Chairman of The Ambient Computing Working Group, advising the European Parliament on roadmaps for pervasive computing. Prior to Symbian, Stephen was the architect of Psion PLC&#8217;s licensing strategy. He led the restructuring of Psion to form Psion Software, which as Joint President, he helped build into a global licensing business and, in 1998, led its spin-out to form Symbian. He was also a founder of the pen-based computing pioneers, Eden Group, which was acquired by Geoworks. Before venturing into mobile computing, Stephen had a career in music technology, developing the world&#8217;s first digital guitar, for which he received a British Design Award from HRH Prince Phillip. He has several patents to his name, including one of the first British software patents, for his &#8220;write on screen electronic organizer.&#8221;</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder/CEO","firm":{"name":"LocaModa","permalink":"locamoda","type_of_entity":"company","image":{"available_sizes":[[[150,26],"assets/images/resized/0007/4508/74508v2-max-150x150.png"],[[250,43],"assets/images/resized/0007/4508/74508v2-max-250x250.png"],[[450,78],"assets/images/resized/0007/4508/74508v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}