{"first_name":"Stephanie","last_name":"Inge","permalink":"stephanie-inge","crunchbase_url":"http://www.crunchbase.com/person/stephanie-inge","homepage_url":"http://www.virtualtrainingcamp.com","birthplace":"Port Arthur, Texas","twitter_username":"stephinge","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1955,"born_month":2,"born_day":8,"tag_list":"ebay, ecommerce, social-media-marketing","alias_list":null,"created_at":"Mon Dec 26 23:53:19 UTC 2011","updated_at":"Sat Jun 02 00:35:01 UTC 2012","overview":"<p>Stephanie Inge - the consummate Internet/Ecommerce/Social Media  professional, Certified eBay Instructor and adjunct eBay/Amazon professor for Collin County Community College in Plano, Texas.</p>\n\n<p>Featured in numerous books, including The eBay Success Chronicles, as well as eBay Million Dollar Powerseller Ideas. The consummate Internet professional and local leader in the Dallas/Ft. Worth Metroplex, as founder of The Dallas eBaybes &amp; eMales and DFW Social Media Marketing group, with 1,500 plus members, collectively.  </p>\n\n<p>In 2011, she collaborated with other experts on a major project, “The Home Run Guide: Take the Experts with You” a guide to finding buried treasures.</p>\n\n<p>Through her eBay training and ecommerce consulting business, Stephanie has helped thousands since 1999 and an adjunct professor for Dallas and Collin County Community Colleges. She also offers live online computer, Internet, ecommerce and social media classes via her virtual classroom, VirtualTrainingCamp.com.</p>\n\n<p>Since 1999, Stephanie has been the leading DFW eBay instructor and was invited by eBay in 2006, to teach the Advanced classes for eBay University.  In 2002, she became the first in the nation to offer eBay classes at the college-level and two years before eBay introduced their Education Specialist Program.  She was certified by eBay in October 2004, shortly after the inception of the program.</p>\n\n<p>In 2008, she began using various social media platforms to market her eBay store and classes and in March 2009, she founded the DFW Social Media Marketing group, which has grown to nearly 900 members in two years. She has coached individuals and professionals in marketing and branding and offers onsite and online Social Media training.</p>\n\n<p>Stephanie was born and raised in Port Arthur,Texas, grew up in Austin, Texas and moved to Dallas in 1974, where she currently resides.  Of French/Acadian heritage, happily married to husband, Randy, since 1985, proud mom of two, and very proud grandmother of two with a third, due in August 2012.  Passions include hanging out with family and friends, reading, gourmet cooking, technology, social media, genealogy, music and travel.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0017/7252/177252v2-max-150x150.jpg"],[[200,200],"assets/images/resized/0017/7252/177252v2-max-250x250.jpg"],[[200,200],"assets/images/resized/0017/7252/177252v2-max-450x450.jpg"]],"attribution":"<p>Stephanie Inge</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://plus.google.com/109622987146261020320/about","title":"Stephanie Inge, About"},{"external_url":"https://www.facebook.com/stephanie.inge","title":"Stephanie Inge, Facebook"},{"external_url":"http://www.1shoppingcart.com/app/?af=495139","title":"The Home Run Guide: Take the Experts with You"},{"external_url":"http://www.linkedin.com/in/stephanieinge","title":"Stephanie Inge, LinkedIn"},{"external_url":"http://www.meetup.com/dallasebaybesandemales/","title":"The Dallas eBaybes & eMales"},{"external_url":"http://www.meetup.com/dfwsocialmediamarketing/","title":"DFW Social Media Marketing Group"}]}