{"first_name":"Stephano","last_name":"Kim","permalink":"stephano-kim-2","crunchbase_url":"http://www.crunchbase.com/person/stephano-kim-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Nov 12 05:24:47 UTC 2011","updated_at":"Mon Nov 14 12:25:29 UTC 2011","overview":"<p>Stephano Kim is the former President and COO of [x+1], joining the company in 2006 as Senior Vice President of Corporate and Business Development. Stephano now serves as an Advisor to [x+1] lending his vast domain experience in new business opportunities, including strategic alliances and mergers and acquisitions.</p>\n\n<p>Prior to joining [x+1], Stephano led investments in consumer technology and media for Advanced Technology Ventures, an early stage fund with more than $1.5 billion under management. Before joining ATV, Stephano directed business strategy and development at America Online, Inc. At AOL, Stephano advised executives on marketing, distribution and Internet advertising strategy. He also negotiated and managed key partnerships with global corporations, such as Hewlett-Packard, Sony, Dell, and DoubleClick. Stephano led software and service investments for OCI Ventures Group, the U.S. venture subsidiary of an Asian conglomerate with interests in media, consumer goods and manufacturing. He also co-founded two start-ups: Psylum, a content and community network for video and online gaming which was sold to USA Networks, in 2000; and Blackboard, Inc., the leading provider of e-learning enterprise software and services for which he served as director of operations. Stephano holds an M.B.A. with honors from Columbia Business School and a bachelor&#8217;s degree in business marketing and management from Cornell University.</p>","image":null,"degrees":[],"relationships":[],"investments":[{"funding_round":{"round_code":"seed","source_url":"http://techcrunch.com/2011/11/10/browser-plug-in-and-sharing-tool-shareaholic-raises-1-9-million/","source_description":"Browser Plug-In And Sharing Tool Shareaholic Raises $1.9 Million","raised_amount":2100000,"raised_currency_code":"USD","funded_year":2011,"funded_month":11,"funded_day":10,"company":{"name":"Shareaholic","permalink":"shareaholic","image":{"available_sizes":[[[150,29],"assets/images/resized/0004/4262/44262v2-max-150x150.png"],[[250,49],"assets/images/resized/0004/4262/44262v2-max-250x250.png"],[[256,51],"assets/images/resized/0004/4262/44262v2-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}