{"first_name":"Stephen C.","last_name":"Shea","permalink":"stephen-c-shea","crunchbase_url":"http://www.crunchbase.com/person/stephen-c-shea","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":"","created_at":"Sun Nov 30 20:27:25 UTC 2008","updated_at":"Sun Jun 14 18:58:36 UTC 2009","overview":"<p>Stephen Shea is President of Signature Capital Securities, LLC and currently serves on the Board of Directors for Chemogen, Inc., CEI Capital Management, LLC and the Maine Center for Enterprise Development.   Prior to Signature Capital, Mr. Shea&#8217;s career has been devoted to operations management and organizational development. He has held the CEO position for closely held, entrepreneurial companies and in the past twenty two years in this capacity or as a management consultant has grown and led these organizations to merger or acquisition with either private or publicly held companies. In the past, Mr. Shea has been involved in investment banking as well as business turnarounds in the U.S. and Canada for manufacturing and service industries including financial services and healthcare companies.   After leaving the Operations Manager position of the nationally distributed consumer products company, Thos. Moser Cabinetmakers in 1994, Mr. Shea became the President and CEO of Mark Stimson Associates, the largest and most productive real estate company in Maine. Growth through acquisition and franchising for five years led to the company being acquired in 1999 by the publicly traded DeWolfe Companies, where Mr. Shea remained as Vice President of Operations through the acquisition of DeWolfe by a wholly owned subsidiary of the Cendant Company.   In 2004, Mr. Shea founded SCS Capital Group, a private equity investment and consulting group established to invest in or acquire New England based companies involved with manufacturing and consumer products distribution.   Mr. Shea received a B.S. degree in Biology cum laude from Norwich University in 1971, a Masters in counseling from the University of New Hampshire in 1980 augmented by industrial and organizational coursework and an M.B.A. from the Whittemore School of Business and Economics at the University of New Hampshire in 1994.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"President","firm":{"name":"Signature Capital","permalink":"signature-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,83],"assets/images/resized/0003/0281/30281v1-max-150x150.jpg"],[[250,139],"assets/images/resized/0003/0281/30281v1-max-250x250.jpg"],[[261,146],"assets/images/resized/0003/0281/30281v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}