{"first_name":"Stephen","last_name":"Wolfram","permalink":"stephen-wolfram","crunchbase_url":"http://www.crunchbase.com/person/stephen-wolfram","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Mon Mar 09 18:35:38 UTC 2009","updated_at":"Mon Mar 09 18:47:06 UTC 2009","overview":"<p>Stephen Wolfram is a distinguished scientist, inventor, author, and business leader. He is the creator of Mathematica, the author of A New Kind of Science, and the founder and CEO of Wolfram Research. His career has been characterized by a sequence of highly original and significant achievements.</p>\n\n<p>Born in London in 1959, Wolfram was educated at Eton, Oxford, and Caltech. He published his first scientific paper at the age of 15, and had received his PhD in theoretical physics from Caltech by the age of 20. Wolfram&#8217;s early scientific work was mainly in high-energy physics, quantum field theory, and cosmology, and included several now-classic results. Having started to use computers in 1973, Wolfram rapidly became a leader in the emerging field of scientific computing, and in 1979 he began the construction of SMP&#8211;the first modern computer algebra system&#8211;which he released commercially in 1981.</p>\n\n<p>In recognition of his early work in physics and computing, Wolfram became in 1981 the youngest recipient of a MacArthur Prize Fellowship. Late in 1981 Wolfram then set out on an ambitious new direction in science aimed at understanding the origins of complexity in nature. Wolfram&#8217;s first key idea was to use computer experiments to study the behavior of simple computer programs known as cellular automata. And starting in 1982 this allowed him to make a series of startling discoveries about the origins of complexity. The papers Wolfram published quickly had a major impact, and laid the groundwork for the emerging field that Wolfram called &#8220;complex systems research.&#8221;</p>\n\n<p>Through the mid-1980s, Wolfram continued his work on complexity, discovering a number of fundamental connections between computation and nature, and inventing such concepts as computational irreducibility. Wolfram&#8217;s work led to a wide range of applications&#8211;and provided the main scientific foundations for such initiatives as complexity theory and artificial life. Wolfram himself used his ideas to develop a new randomness generation system and a new approach to computational fluid dynamics&#8211;both of which are now in widespread use.</p>\n\n<p>Following his scientific work on complex systems research, in 1986 Wolfram founded the first research center and the first journal in the field, Complex Systems. Then, after a highly successful career in academia&#8211;first at Caltech, then at the Institute for Advanced Study in Princeton, and finally as Professor of Physics, Mathematics, and Computer Science at the University of Illinois&#8211;Wolfram launched Wolfram Research, Inc.</p>\n\n<p>Wolfram began the development of Mathematica in late 1986. The first version of Mathematica was released on June 23, 1988, and was immediately hailed as a major advance in computing. In the years that followed, the popularity of Mathematica grew rapidly, and Wolfram Research became established as a world leader in the software industry, widely recognized for excellence in both technology and business.</p>\n\n<p>Following the release of Mathematica Version 2 in 1991, Wolfram began to divide his time between Mathematica development and scientific research. Building on his work from the mid-1980s, and now with Mathematica as a tool, Wolfram made a rapid succession of major new discoveries. By the mid-1990s his discoveries led him to develop a fundamentally new conceptual framework, which he then spent the remainder of the 1990s applying not only to new kinds of questions, but also to many existing foundational problems in physics, biology, computer science, mathematics, and several other fields.</p>\n\n<p>After more than ten years of highly concentrated work, Wolfram finally described his achievements in his 1200-page book A New Kind of Science. Released on May 14, 2002, the book was widely acclaimed and immediately became a bestseller. Its publication has been seen as initiating a paradigm shift of historic importance in science, with new implications emerging at an increasing rate every year.</p>\n\n<p>Wolfram has been president and CEO of Wolfram Research since its founding in 1987. In addition to his business leadership, Wolfram is deeply involved in the development of the company&#8217;s technology, and continues to be personally responsible for overseeing all aspects of the functional design of the core Mathematica system.</p>\n\n<p>Wolfram has a lifelong commitment to research and education. In addition to providing software for a generation of scientists and students, Wolfram&#8217;s company maintains some of the web&#8217;s most visited sites for technical information. Wolfram is also increasingly active in defining new directions for education, especially in the science he has created.</p>\n\n<p>Building on Mathematica, A New Kind of Science, and the success of Wolfram Research, Wolfram has recently launched several highly creative initiatives that can be expected to have major impacts in diverse areas.</p>","image":{"available_sizes":[[[150,132],"assets/images/resized/0003/7593/37593v1-max-150x150.png"],[[168,148],"assets/images/resized/0003/7593/37593v1-max-250x250.png"],[[168,148],"assets/images/resized/0003/7593/37593v1-max-450x450.png"]],"attribution":"<p><a href=\"http://www.stephenwolfram.com\" title=\"Stephen Wolfram\" rel=\"nofollow\">Stephen Wolfram</a></p>"},"degrees":[{"degree_type":"","subject":"","institution":"Eton","graduated_year":1976,"graduated_month":null,"graduated_day":null},{"degree_type":"","subject":"","institution":"Oxford","graduated_year":1978,"graduated_month":null,"graduated_day":null},{"degree_type":"Ph.D.","subject":"Theoretical Physics","institution":"Caltech","graduated_year":1979,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"Wolfram Alpha","permalink":"wolfram-alpha","type_of_entity":"company","image":{"available_sizes":[[[150,32],"assets/images/resized/0003/7594/37594v1-max-150x150.png"],[[250,54],"assets/images/resized/0003/7594/37594v1-max-250x250.png"],[[261,57],"assets/images/resized/0003/7594/37594v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Advisor","firm":{"name":"Charity Engine ","permalink":"the-charity-engine","type_of_entity":"company","image":{"available_sizes":[[[150,41],"assets/images/resized/0010/4656/104656v4-max-150x150.jpg"],[[250,69],"assets/images/resized/0010/4656/104656v4-max-250x250.jpg"],[[450,124],"assets/images/resized/0010/4656/104656v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}