{"first_name":"Stephanie","last_name":"Kimbro","permalink":"stephanie-kimbro","crunchbase_url":"http://www.crunchbase.com/person/stephanie-kimbro","homepage_url":"http://www.virtuallawpractice.org","birthplace":"","twitter_username":"StephKimbro","blog_url":"http://www.virtuallawpractice.org","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"virtual-law-practice, elawyering, virtual, law, unbundling","alias_list":null,"created_at":"Mon Jul 19 15:43:14 UTC 2010","updated_at":"Mon Jul 19 21:29:53 UTC 2010","overview":"<p>Stephanie Kimbro, Esq., MA, JD, has operated a Web-based virtual law office in North Carolina since 2006 and delivers estate planning and small-business law to clients online. She is the recipient of the 2009 ABA Keane Award for Excellence in eLawyering and the author of Delivering Legal Services Online, to be published by the ABA, Summer 2010.  She is also the co-founder of Virtual Law Office Technology, LLC (VLOTech), which was acquired by Total Attorneys in the fall of 2009.</p>\n\n<p>In addition to her virtual law practice, Kimbro is a consultant and technology evangelist providing assistance to other legal professionals interested in the online delivery of legal services.  Kimbro writes about the ethics and technology issues of delivering legal services online and is interested in the use of technology by legal professionals to increase access to justice in our country.  She has presented continuing legal education (CLE) courses on virtual law practice for the American Bar Association (ABA) and the North Carolina and South Carolina Bar Associations, and she teaches a course on virtual law practice as a faculty member of Solo Practice University, a Web-based legal education community.</p>\n\n<p>Kimbro serves on the board of the Legal Services National Technology Assistance Project (LSNTAP) and is a member of the ABA eLawyering Task Force, the North Carolina Bar Association (NCBA) Law Practice Management (LPM) Council and NCBA Technology Advisory Committee.  </p>","image":null,"degrees":[{"degree_type":"BA","subject":"","institution":"Centre College","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MA","subject":"","institution":"Miami University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"JD","subject":"","institution":"Univ. of Dayton School of Law","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/stephkimbro","title":"Twitter"}]}