{"first_name":"Stephen","last_name":"Stuut","permalink":"stephen-stuut","crunchbase_url":"http://www.crunchbase.com/person/stephen-stuut","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri May 09 22:36:13 UTC 2008","updated_at":"Tue Jun 17 19:15:22 UTC 2008","overview":"<p>Mr. Stuut is responsible for leading TruePosition&#8217;s expansion in the international marketplace with its multi-location technology platform and LBS capabilities.</p>\n\n<p>Prior to joining TruePosition, Mr. Stuut was president and CEO of Broadband Innovations, which provided radio frequency products to facilitate the high quality delivery of digital interactive cable television services.  During his tenure, he raised over $30m in equity from venture capital firms and strategic investors and ultimately sold the company to Motorola in December 2005. </p>\n\n<p>Mr. Stuut&#8217;s management experience includes top-level positions in the telecommunications industry at leading global organizations, including ComStream Corporation, a $100m international provider of digital transmission solutions for satellite and terrestrial broadband systems, and Sprint, where he led corporate and divisional strategy development. </p>\n\n<p>Mr. Stuut also managed the Telecommunications Practice at McKinsey &amp; Company and did business strategy consulting for Booz-Allen &amp; Hamilton in Germany and Braxton Associates (now Deloitte &amp; Touche) in the United Kingdom . Prior to consulting, he worked as an electro-optical systems engineer at Hughes Aircraft (now Raytheon) and Westinghouse (now Northrop Grumman). </p>\n\n<p>Mr. Stuut holds an MBA from the Wharton School of the University of Pennsylvania , an MA from the School of Arts &amp; Sciences of the University of Pennsylvania , a BS in electrical engineering from the Georgia Institute of Technology, and an MS from the College of Optical Sciences at the University of Arizona . At the University of Pennsylvania , Mr. Stuut was a Fellow at the Lauder Institute of Management and International Studies.</p>","image":{"available_sizes":[[[100,129],"assets/images/resized/0002/0531/20531v1-max-150x150.png"],[[100,129],"assets/images/resized/0002/0531/20531v1-max-250x250.png"],[[100,129],"assets/images/resized/0002/0531/20531v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"TruePosition","permalink":"trueposition","type_of_entity":"company","image":{"available_sizes":[[[150,64],"assets/images/resized/0001/8267/18267v1-max-150x150.png"],[[152,65],"assets/images/resized/0001/8267/18267v1-max-250x250.png"],[[152,65],"assets/images/resized/0001/8267/18267v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}