{"first_name":"Stephen","last_name":"Ganis","permalink":"stephen-ganis","crunchbase_url":"http://www.crunchbase.com/person/stephen-ganis","homepage_url":"http://www.ganiscorporatelaw.com","birthplace":"New York City","twitter_username":"steveganis","blog_url":"http://www.ganiscorporatelaw.com/blog","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1951,"born_month":9,"born_day":null,"tag_list":"growth-companies, entrepreneurs, family-business, exit-strategy, investors, employment-law, ip-licensing, non-compete","alias_list":null,"created_at":"Tue Mar 20 14:46:56 UTC 2012","updated_at":"Thu Oct 25 06:20:10 UTC 2012","overview":"<p>Steve Ganis founded his law firm Ganis Corporate Law offices after nearly a decade of practicing law in large corporate law firms in Manahttan and serving as general counsel to a CT-based investment management firm.  Steve assists business owners, entrepreneurs &amp; investors in their pursuit of global opportunities.  His practice areas include: 1) Corporate, including governance, corp finance, contracts, leases, to closely-held companies and new ventures and startups; counsel on commercial transactions; and flat fee part-time General Counsel services to growing established companies; 2) Employment and Human Resources, including traditional employment law and outsourcing services with independent contractors; and 3) Digital Economy and IP Licensing, including licensing and protecting trademarks, trade secrets, and copyrights, IP audits, software and internet site issues.  He is licensed in Connecticut and New York.</p>\n\n<p>Ganis founded his private practice in 1992, and although he is based in Stamford, CT, he has represented companies on a global basis.  While in private practice, he was outside general counsel for a decade to a family of companies known as the Seabury Group, which included a software company, a broker-dealer, a consulting group, and an investment bank advisory group.  </p>\n\n<p>Ganis was associated for nearly a decade in the corporate departments of two large New York City law firms, Robinson Silverman (know known as Bryan Cave) and Whitman &amp; Ransom. </p>\n\n<p>Steve Ganis has been involved with new ventures and startups in his personal life.  He founded his own law firm, and he also co-founded a weekly newspaper in Brooklyn, NY and served as its publisher and executive editor, while obtaining his law degree.</p>","image":null,"degrees":[{"degree_type":"B.S.","subject":"Journalism","institution":"Syracuse University Newhouse School","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"J.D.","subject":"","institution":"Brooklyn Law School","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"B.S.","subject":"Journalism","institution":"Syracuse University Newhouse School","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.ganiscorporatelaw.com","title":"Ganis Corporate Law offices"},{"external_url":"http://www.linkedin.com/in/stephenganis","title":""}]}