{"first_name":"Stephen","last_name":"Ryan","permalink":"stephen-ryan","crunchbase_url":"http://www.crunchbase.com/person/stephen-ryan","homepage_url":"http://www.orcc.com","birthplace":"Newport, RI","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Apr 23 20:50:05 UTC 2012","updated_at":"Fri May 11 11:08:14 UTC 2012","overview":"<p>Steve is a seasoned executive that has held leadership roles within a major credit card processor, a global payment system, a global bank, and several innovative technology start-ups. He has solid and successful experience in bringing new innovative ecommerce products and services to global financial markets and he thrives in ambiguity and change oriented environments. Steve has a reputation as a rainmaker with a great rolodex in the financial services and internet security industries. </p>\n\n<p>Steve&#8217;s expertise includes Strategic Innovation, New technologies, Business Development, Marketing, Sales, Product Management, Product Strategy, Channel Development, OEM&#8217;s and overall Global Expansion.</p>\n\n<p>Addtionaly, Steve&#8217;s International experience in the following countries: Canada, England, France, Germany, Czech Republic, Taiwan, India, Australia, New Zealand, Japan, and Korea.</p>\n\n<p>Steve has been quoted and featured in the following publications: CNET, New York Times, Wall Street Journal, USA Today, American Banker, InformationWeek, InternetWeek, Future Banker, Bank Technology News, The Industry Standard, and Computer World.</p>\n\n<p>Steve is currently an Executive Vice President with Online Resources (NASDAQ:ORCC) and has also held executive positions with IronKey, GeoTrust, Arcot, Visa, First Data, and NationsBank.  Additionaly, Steve has been an advisor to several innovative successful start-ups including dotBank, PayPal, and Splunk.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0018/5570/185570v3-max-150x150.jpg"],[[166,250],"assets/images/resized/0018/5570/185570v3-max-250x250.jpg"],[[300,450],"assets/images/resized/0018/5570/185570v3-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}