{"first_name":"Stephen","last_name":"Jennings","permalink":"stephen-jennings","crunchbase_url":"http://www.crunchbase.com/person/stephen-jennings","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 13 04:42:45 UTC 2009","updated_at":"Thu May 21 10:25:12 UTC 2009","overview":"<p>Mr. Jennings is responsible for the overall strategic direction of Renaissance Capital and the other companies that make up the Renaissance Group, including Renaissance Investment Management, Renaissance Credit and Renaissance Partners.</p>\n\n<p>As one of the founders of Renaissance Capital in 1995, Mr. Jennings was actively involved in building the Firm&#8217;s investment banking and securities sales and trading businesses. He played a key role during the early years of the Firm&#8217;s development, including serving as Head of Investment Banking, Head of Sales, and Chief Operating Officer. Today Mr. Jennings is Chairman and CEO of Renaissance Group.</p>\n\n<p>Prior to establishing Renaissance Capital, Mr. Jennings served as Co-Head of Credit Suisse First Boston (Moscow) from 1992 to 1995. In this role, he was directly responsible for Credit Suisse First Boston&#8217;s investment banking during a period when CSFB was recognised as the dominant market player in developing and executing pioneering transactions in the Russian marketplace. In 1992, Mr. Jennings led the State Property Committee&#8217;s pilot voucher auctions, a project that established the foundations for the creation of Russia&#8217;s capital markets. Subsequently, he has worked on numerous landmark financings and M&amp;A transactions in Russia and throughout the CIS, many of which have won professional awards and commendations.</p>\n\n<p>Before coming to Russia in 1992, Mr. Jennings was with Credit Suisse First Boston in London, where he worked on investment banking and privatisation transactions in Central and Eastern Europe. Previously, he worked for Credit Suisse First Boston and the Treasury in New Zealand, advising the New Zealand and Australian governments on privatization and state enterprise restructuring and working on a wide variety of private sector M&amp;A and capital markets transactions.</p>\n\n<p>Mr. Jennings earned his Bachelor of Business Studies degree from Massey University and holds an M.Phil. in Economics with first class honours from the University of Auckland.</p>","image":{"available_sizes":[[[125,125],"assets/images/resized/0004/4982/44982v1-max-150x150.jpg"],[[125,125],"assets/images/resized/0004/4982/44982v1-max-250x250.jpg"],[[125,125],"assets/images/resized/0004/4982/44982v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor of Business Studies","subject":"","institution":"Massey University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"M.Phil.","subject":"Economics","institution":"University of Auckland","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chief Executive Officer","firm":{"name":"Renaissance Investment Management","permalink":"renaissance-investment-management","type_of_entity":"financial_org","image":{"available_sizes":[[[150,68],"assets/images/resized/0004/3878/43878v2-max-150x150.png"],[[223,102],"assets/images/resized/0004/3878/43878v2-max-250x250.png"],[[223,102],"assets/images/resized/0004/3878/43878v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}