{"first_name":"Stephanie","last_name":"Fohn","permalink":"stephanie-fohn","crunchbase_url":"http://www.crunchbase.com/person/stephanie-fohn","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"WhiteHat Security","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Dec 19 08:38:30 UTC 2008","updated_at":"Fri Apr 22 01:27:22 UTC 2011","overview":"<p>Stephanie has a broad base of management and entrepreneurial experience, with particular expertise in information security. Most recently, she was president and chief operating officer of SecurityFocus, a provider of enterprise security threat management systems. She led the company to its acquisition by Symantec in August 2002.</p>\n\n<p>Previously, she served as vice president of marketing and business development for Tripwire, Inc. and director of distribution partnerships for Infoseek/Go Network. She also co-founded and led two start-ups - Lucidian Technologies, a developer of network-based intrusion detection software, and The WWWorks, a web development firm focused on e-commerce and database integration.</p>\n\n<p>Stephanie began her career in the security industry as director of business development for Pilot Network Services, Inc., one of the first managed security service providers. Prior to joining Pilot, she spent six years in venture capital and investment banking in the technology arena. Ms. Fohn holds an M.S. degree in management from Massachusetts Institute of Technology and bachelor&#8217;s degrees in business and psychology from University of Washington.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"WhiteHat Security","permalink":"whitehat-security","type_of_entity":"company","image":{"available_sizes":[[[150,34],"assets/images/resized/0003/2077/32077v1-max-150x150.png"],[[220,50],"assets/images/resized/0003/2077/32077v1-max-250x250.png"],[[220,50],"assets/images/resized/0003/2077/32077v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}