{"first_name":"Steve","last_name":"Hodges","permalink":"steve-hodges-2","crunchbase_url":"http://www.crunchbase.com/person/steve-hodges-2","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Microsoft","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Thu Sep 08 06:02:19 UTC 2011","updated_at":"Thu Sep 08 06:02:19 UTC 2011","overview":"<p>Steve manages the Sensors and Devices group at MSR Cambridge and is interested in a broad range of technologies within the themes of ubiquitous computing and interaction. These include novel sensors, flexible electronics, new displays, wireless communications, ubiquitous and mobile devices. The cross-disciplinary group aims to leverage its skills across both hardware and software layers to deliver compelling new user experiences, collaborating with researchers from other labs and different disciplines where appropriate. The ultimate goal of this research is to better understand how advances in technology will impact traditional computing and the ways in which people use and interact with computing devices.</p>\n\n<p>Prior to joining Microsoft Research, Cambridge, Steve was the Technical Director of the Cambridge Auto-ID Lab, where he helped both to develop and to evangelise an RFID-based successor to the barcode for tracking goods through supply chains. Steve also co-founded an RFID training and consultancy company. Before that, he worked as a Research Engineer at the Olivetti and Oracle Research Lab, which later became AT&amp;T Laboratories Cambridge. He have also worked at the Xerox Research Centre Europe at Cambridge (formerly known as EuroPARC).</p>\n\n<p>Steve has a background in a broad range of computer-related technologies. His first degree is in Computer Science with Electronic Engineering, from University College London, and later received his PhD from Cambridge University Engineering Department in the area of Robotics and Computer Vision.</p>","image":{"available_sizes":[[[75,75],"assets/images/resized/0015/3204/153204v1-max-150x150.jpg"],[[75,75],"assets/images/resized/0015/3204/153204v1-max-250x250.jpg"],[[75,75],"assets/images/resized/0015/3204/153204v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Principal Hardware Engineer","firm":{"name":"Microsoft","permalink":"microsoft","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0001/0926/10926v1-max-150x150.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-250x250.png"],[[216,70],"assets/images/resized/0001/0926/10926v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}