{"first_name":"Steven","last_name":"Atneosen","permalink":"steven-atneosen","crunchbase_url":"http://www.crunchbase.com/person/steven-atneosen","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 11 13:51:01 UTC 2009","updated_at":"Tue Aug 11 05:13:51 UTC 2009","overview":"<p>Steven Atneosen is the Vice President, Government Relations and Strategy, and acting General Counsel of RxVantage. He has served as an advisor to the company since 2006. From 2007 to 2009, he was a business and legal affairs consultant in New York, NY working with Fortune 100 and development stage companies on technology related strategy, specifically on health care IT and clean/green technology issues. He has served as general counsel and regulatory/government relations to two global technology companies: at Aristocrat Technologies, Inc. in Las Vegas, NV from 2005 to 2007, one of the largest technology providers to hospitality and gaming, he directed all legal and corporate development matters for the company’s North and South American business. From 2000 to 2005 at CarParts Technologies, Inc. in Los Angeles, CA, a leading provider of eCommerce-enabled supply chain software solutions for the automotive industry, he served as a key advisor and strategist for the development of the company’s IP portfolio, managed multiple merger and acquisitions and led key intellectual property litigation.</p>\n\n<p>Before CarParts Technologies he founded a boutique distribution and intellectual property firm in 1996 focused on emerging technology companies. He pursued a similar practice at one of Minneapolis, MN’s oldest firms, Mackall Crounse &amp; Moore beginning in 1994. Prior to that he was appointed to a United States Supreme Court appeal team to serve as a trial and appellate attorney with the Hennepin County Attorney’s Office after serving as a corporate lawyer with Minnesota Life in St. Paul, MN.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO, Operations","firm":{"name":"The Hall","permalink":"the-hall","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0010/3767/103767v2-max-150x150.png"],[[250,83],"assets/images/resized/0010/3767/103767v2-max-250x250.png"],[[300,100],"assets/images/resized/0010/3767/103767v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":" VP Compliance & Governmental Relations Strategy","firm":{"name":"RxVantage","permalink":"rxvantage","type_of_entity":"company","image":{"available_sizes":[[[150,52],"assets/images/resized/0004/7984/47984v1-max-150x150.jpg"],[[209,73],"assets/images/resized/0004/7984/47984v1-max-250x250.jpg"],[[209,73],"assets/images/resized/0004/7984/47984v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}