{"first_name":"Steven","last_name":"Baranowitz","permalink":"steven-baranowitz","crunchbase_url":"http://www.crunchbase.com/person/steven-baranowitz","homepage_url":"http://phillysciderm.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Steven Baranowitz Dermatology and Dermatologic Surgery","born_year":null,"born_month":null,"born_day":null,"tag_list":"dermatologist, acne, allergies, baldness, eczema, hair-loss, itchy-scalp, moles, psoriasis, skin-cancer, skin, infections, warts, wrinkles","alias_list":null,"created_at":"Tue Jun 26 14:48:11 UTC 2012","updated_at":"Tue Jun 26 20:59:20 UTC 2012","overview":"<p>Dr. Baranowitz is a specialist in the biology of the skin and its disorders. He has extensive experience in both clinical dermatology and research.</p>\n\n<p>A graduate of the New York University School of Medicine, Dr. Baranowitz completed specialty training in dermatology at Mount Sinai Hospital in New York. He was also a Dermatology Research Fellow sponsored by the National Institutes of Health. He obtained research expertise in developmental biology of the skin while earning his Master of Science degree from the University of Michigan in Ann Arbor and his Bachelor of Science degree in Brooklyn College.</p>\n\n<p>Dr. Baranowitz was honored by the University of Oxford in England when its Center for Mathematical Biology sponsored him as a Visiting Scientist. As a guest of the University, he lectured and collaborated in original research using mathematics for advanced study of skin biology. During his stay, he also gave an invited guest seminar at the National Institute for Medical Research in London.</p>\n\n<p>Dr. Baranowitz has presented papers at an international symposia and his research has been published in several scientific journals including Journal of Theoretical Biology and the New England Journal of Medicine.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Dermatologist","firm":{"name":"Steven Baranowitz Dermatology and Dermatologic Surgery","permalink":"steven-baranowitz-dermatology-and-dermatologic-surgery","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}