{"first_name":"Steven","last_name":"Potter","permalink":"steven-potter","crunchbase_url":"http://www.crunchbase.com/person/steven-potter","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 28 12:49:51 UTC 2008","updated_at":"Fri Nov 28 13:01:41 UTC 2008","overview":"<p>Steven Potter joined SCP Worldwide, as a partner, in February, 2008. Mr. Potter will be responsible for the identification and deployment of existing and new capital while overseeing all relationships with SCP’s equity and debt partners.</p>\n\n<p>Mr. Potter joins SCP after a very successful career as a senior investment banker with experience in executing over 30 mergers and acquisitions and over $30 billion in debt and equity financings for both private and public companies. In addition, Mr. Potter advised some of the largest consumer and industrial companies in executing corporate restructurings, dividend and share repurchase strategies.</p>\n\n<p>Most recently, Mr. Potter served as Managing Director and Co-head of Consumer Group at Banc of America Securities. During his five-year tenure he built the Food and Beverage Group into one of the leading groups on Wall Street. Important transactions include the recapitalization of Eurofresh, debt and equity issuances for Boulder Specialty’s (SPAC) acquisition of Smart Balance, and over $1.2bn of high yield financings for Constellation Brands.</p>\n\n<p>Prior to Banc of America Securities, Mr. Potter held the position of Managing Director and head of Food and Beverage Group at Deutsche Banc Alex. Brown where he rebuilt the Food and Beverage group spearheading growth in revenues by 400 percent. Noted transactions during his tenure included $8.7 billion Kraft IPO, the $2.6 billion privatization of Dole Foods, and the sale of Vlasic Foods.</p>\n\n<p>Before joining Deutsche Banc, Mr. Potter was a Principal in the Global Consumer Group at Morgan Stanley and Vice President in Mergers and Acquisitions at J.P. Morgan &amp; Co. where he began his investment banking career. While at J.P. Morgan, he advised Anheuser-Busch on the divestiture of The St. Louis Cardinals Baseball Club and associated assets.</p>\n\n<p>Prior to receiving his MBA, Mr. Potter held positions at Trammell Crow Ventures and Ford Motor Company. Mr. Potter completed his undergraduate studies at Brigham Young University and received his MBA from UCLA Anderson School of Management.</p>\n\n<p>Mr. Potter currently resides in Darien, Connecticut with his wife and their two children.</p>","image":{"available_sizes":[[[117,150],"assets/images/resized/0002/9957/29957v1-max-150x150.jpg"],[[150,192],"assets/images/resized/0002/9957/29957v1-max-250x250.jpg"],[[150,192],"assets/images/resized/0002/9957/29957v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Partner, SCP Worldwide","firm":{"name":"SCP Worldwide","permalink":"scp-worldwide","type_of_entity":"financial_org","image":{"available_sizes":[[[150,47],"assets/images/resized/0002/9946/29946v1-max-150x150.jpg"],[[250,79],"assets/images/resized/0002/9946/29946v1-max-250x250.jpg"],[[271,86],"assets/images/resized/0002/9946/29946v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}