{"first_name":"Steve","last_name":"Kiene","permalink":"steve-kiene-2","crunchbase_url":"http://www.crunchbase.com/person/steve-kiene-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Feb 19 20:27:37 UTC 2012","updated_at":"Sun Feb 19 20:39:02 UTC 2012","overview":"<p>Steve Kiene is an experienced entrepreneur, leader, senior executive, and strategist with over 20 years of experience in the IT industry. He started his first successful software company when he was 17 and has been an advisor, mentor, and investor in numerous software startups.</p>\n\n<p>Recently he led the long-term strategic objectives and software development efforts at Internap (NASDAQ: INAP) as the Vice President of Engineering. During his tenure he built a new CDN engineering team in Lincoln Nebraska, creating many new high paying jobs in Lincoln. He simultaneously reduced capital expenditures and operating expenses while expanding the global footprint of the division.</p>\n\n<p>Previously, Steve founded eSellerate and MindVision Software. He led the growth and strategic planning for both companies, specializing in software delivery systems and e-commerce solutions. He piloted the successful sale of MindVision and eSellerate to Digital River in 2006.</p>\n\n<p>While CEO at MindVision, he developed two highly successful software products for other companies- Stacker, which was sold to Stac Electronics when Steve was 22 years old and SpeedDoubler, which was developed in partnership with Connectix.</p>\n\n<p>He currently serves on the board of advisors and volunteers as an adjunct instructor at the Raikes School of Computer Science and Management, helping lead the Design Studio learning experience. He established and serves as director of The Kiene Family Foundation which is dedicated to improving lives of all Nebraskans through support of non-profit organizations. The foundation recently announced a gift of $1,000,000 to NET for their Inspire Nebraska campaign.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0017/4942/174942v1-max-150x150.jpg"],[[250,250],"assets/images/resized/0017/4942/174942v1-max-250x250.jpg"],[[400,400],"assets/images/resized/0017/4942/174942v1-max-450x450.jpg"]],"attribution":"<p>Nebraska Global Management Team</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Principal","firm":{"name":"Nebraska Global","permalink":"nebraska-global","type_of_entity":"financial_org","image":{"available_sizes":[[[150,51],"assets/images/resized/0017/4941/174941v1-max-150x150.jpg"],[[250,86],"assets/images/resized/0017/4941/174941v1-max-250x250.jpg"],[[252,87],"assets/images/resized/0017/4941/174941v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}