{"first_name":"Steve","last_name":"Moffitt","permalink":"steve-moffitt","crunchbase_url":"http://www.crunchbase.com/person/steve-moffitt","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jul 23 11:27:40 UTC 2011","updated_at":"Sat Jul 23 11:32:08 UTC 2011","overview":"<p>Mr. Steve Moffitt joined Comverge with more than 20 years experience in the energy, utility and commodity trading business. Moffitt leads the engineering team and oversees the company&#8217;s day-to-day operations, including network control, software and hardware engineering, measurement and verification and quality. He most recently served as vice president and regional CIO for BG Group, an international London-based energy company. Prior to BG Group, Mr. Moffitt was a managing director with UBS Investment Bank where he was responsible for global commodity trading technology that supported the energy, agriculture and metals trading business. Previously, he held several executive positions at Dynegy, Inc., including senior vice president and CIO. In this position Steve led Dynegy&#8217;s technology architecture through one of the most aggressive expansion periods the energy industry has seen. Steve began his career in utility transmission, distribution and generation operations at Texas Utilities, Inc. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Operating Officer","firm":{"name":"Comverge","permalink":"comverge","type_of_entity":"company","image":{"available_sizes":[[[150,46],"assets/images/resized/0009/8974/98974v3-max-150x150.jpg"],[[250,76],"assets/images/resized/0009/8974/98974v3-max-250x250.jpg"],[[260,80],"assets/images/resized/0009/8974/98974v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}