{"first_name":"Steve","last_name":"Fredrick","permalink":"steve-fredrick-2","crunchbase_url":"http://www.crunchbase.com/person/steve-fredrick-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Grotech Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Nov 17 09:16:44 UTC 2008","updated_at":"Thu Jun 30 17:05:51 UTC 2011","overview":"<p>Steve is a General Partner with Grotech Ventures where he leads investments in the software, wireless, and digital media sectors. He is active on several portfolio company boards, including LogiXML, Omnilink Systems, RollStream, Invincea and TRAFFIQ.</p>\n\n<p>His career spans engineering roles, entrepreneurial company building, and early stage investing. Prior to Grotech, Steve was a General Partner with Novak Biddle Venture Partners where he made significant contributions to the success of numerous companies. He began his career in research and development with IBM, and then joined a venture-funded software company in the document imaging space called Vantage Solutions, which was acquired in 1994.</p>\n\n<p>Steve subsequently co-founded software development firm MartinScott before making his transition to the venture business in 1997. He has served in interim-operating roles with several portfolio companies upon request. Steve has also been instrumental in the launch of StartUpHire, a much needed online job board listing thousands of opportunities at venture-backed companies.</p>\n\n<p>Steve earned his BS and MS in Electrical Engineering, magna cum laude, from Virginia Tech and served for several years as an Adjunct Professor of Entrepreneurship at the University of Maryland&#8217;s Smith School of Business. He is a frequent speaker on entrepreneurship and venture investing.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0014/1806/141806v2-max-150x150.jpg"],[[167,250],"assets/images/resized/0014/1806/141806v2-max-250x250.jpg"],[[301,450],"assets/images/resized/0014/1806/141806v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Grotech Ventures","permalink":"grotech-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,78],"assets/images/resized/0002/9090/29090v1-max-150x150.png"],[[167,87],"assets/images/resized/0002/9090/29090v1-max-250x250.png"],[[167,87],"assets/images/resized/0002/9090/29090v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}