{"first_name":"Steve","last_name":"Barto","permalink":"steve-barto","crunchbase_url":"http://www.crunchbase.com/person/steve-barto","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 23 01:45:03 UTC 2009","updated_at":"Tue Jun 23 01:50:45 UTC 2009","overview":"<p>Steven M. Barto is Chief Financial Officer of BPL Global, overseeing all the financial operations of the company. Steve Barto brings to BPL Global more than 20 years of extensive experience in all aspects of corporate and operational finance, having served in senior financial roles for most of his career. Mr. Barto&#8217;s strengths include financial expertise in mergers and acquisitions, public offerings, working capital management, treasury, regulatory accounting and reporting (Securities and Exchange Commission) and implementation of strong internal controls. He is particularly effective in facilitating company expansion through both organic growth and acquisitions in North America, Europe and Asia.</p>\n\n<p>Most recently, Mr. Barto served as Vice President, Finance and Business Operations, Data Networks at Ericsson, which acquired Marconi Communications&#8217; North American business assets in January 2006. He was with Marconi in several financial executive capacities since April 1999 until the Ericsson acquisition, his most recent role being Vice President of Finance and Business Operations. Prior to Marconi, he served in several financial leadership roles at RELTEC Corporation, which was acquired by Marconi in April 1999. He started his career with Price Waterhouse and held the position of Senior Manager after being with the firm from 1986-1995.</p>\n\n<p>Mr. Barto received his accounting degree from Kent State University in 1986 and has been a Certified Public Accountant (CPA) since 1988 and is a member of the American Institute of Certified Public Accountants.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CFO","firm":{"name":"BPL Global","permalink":"bpl-global","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0005/0232/50232v2-max-150x150.png"],[[213,65],"assets/images/resized/0005/0232/50232v2-max-250x250.png"],[[213,65],"assets/images/resized/0005/0232/50232v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}