{"first_name":"Steven","last_name":"Schneider","permalink":"steven-schneider-2","crunchbase_url":"http://www.crunchbase.com/person/steven-schneider-2","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"RAP Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"zap, steven-schneider, automobile, ceo, apollo-energy-systems, bay-area-alliance","alias_list":null,"created_at":"Tue Feb 22 12:02:47 UTC 2011","updated_at":"Sat Mar 05 01:23:26 UTC 2011","overview":"<p>Mr. Schneider has been the Director and Chief Executive Officer of ZAP since October 2002. Currently the Co-CEO of ZAP Jonway. Has more than 30-years career in the automotive industry and a long-time interest in fun, fuel-efficient cars. </p>\n\n<p>In 2001 founded Voltage Vehicles, a fuel vehicle distributor specializing in electric vehicles and full-performance alternative fuel vehicles such as automobiles, motorcycles, and bicycles. He also founded Auto Distributors, Inc., which is the promotion and distribution division of Voltage Vehicles.</p>\n\n<p>Mr. Schneider also founded the RAP Group, an automotive liquidator and reseller, which ZAP also acquired. He serves on the board of directors of Apollo Energy Systems, a developer of fuel cells and advanced batteries. He also serves as a director of Rotoblock Corporation, a public company focused on the continued development of the oscillating piston engine; is an active member with various industry groups, including the Electric Drive Transportation Association in Washington, DC, and is a member of the Bay Area Alliance of CEOs. </p>\n\n<p>Lectures frequently on industry topics at universities and other organizations. He was recently appointed as the Vice Chairman of Samyang Optics Co. Ltd. of South Korea and is also a Senior Advisor for Economic Development in China. In this position assists the Administration Committee of Yuhang Zutan (Innovation Sone) for Yuhang District, Hangzhou, P.R. China. </p>\n\n<p>Mr. Schneider possesses particular knowledge and experience in automobile industry that strengthens the Board of Director&#8217;s collective qualifications, skills, and experience.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"ZAP Jonway","permalink":"zap-jonway","type_of_entity":"company","image":null}},{"is_past":false,"title":"Member","firm":{"name":"Bay Area Alliance of CEOs ","permalink":"bay-area-alliance-of-ceos","type_of_entity":"company","image":null}},{"is_past":true,"title":"Founder","firm":{"name":"RAP Group","permalink":"rap-group","type_of_entity":"company","image":null}},{"is_past":true,"title":"Director ","firm":{"name":"Rotoblock Corporation","permalink":"rotoblock-corporation","type_of_entity":"company","image":null}},{"is_past":true,"title":"Board of Directors","firm":{"name":"Apollo Energy Systems","permalink":"apollo-energy-systems","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}