{"first_name":"Steve","last_name":"Wadsworth","permalink":"steve-wadsworth","crunchbase_url":"http://www.crunchbase.com/person/steve-wadsworth","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 21 02:33:59 UTC 2008","updated_at":"Wed May 21 03:03:37 UTC 2008","overview":"<p>Steve Wadsworth is president of the Walt Disney Internet Group and has operational responsibility for The Walt Disney Company&#8217;s Internet portfolio, which includes the leading Internet brands Disney.com, the number-one Web site for kids and families; ESPN.com, the number-one sports site; and ABC branded sites, leaders in entertainment and news.</p>\n\n<p>Wadsworth has seven years of Internet experience - all at The Walt Disney Company. Named president of Disney&#8217;s Internet unit in 1999, he is well versed in Internet business and technology operations. He has played a critical role in leading the company&#8217;s successful drive to profitability and growth as he led a restructuring of the business and current expansion into broadband and wireless.</p>\n\n<p>Wadsworth joined Disney Online, Disney&#8217;s first Internet operation, at its inception in September 1995. Prior to being named president of Disney&#8217;s Internet operations, he served as senior vice president and chief financial officer, responsible for all strategic planning, business development, technology operations, finance, accounting and administrative functions. He came to Disney Online from Disney Consumer Products, where he served as director of business planning.</p>\n\n<p>Before joining The Walt Disney Company in 1993, Wadsworth was a principal for the Windsor Park Group in Los Angeles. He was responsible for providing strategic, operational and financial management consulting services to companies primarily in the retail and consumer products industries.</p>\n\n<p>Wadsworth is a frequent spokesperson on Internet issues and guest speaker at Internet industry forums. He holds a B.S. in engineering from the University of Virginia and received his M.B.A. from the UCLA Graduate School of Management. </p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/8999/18999v1-max-150x150.jpg"],[[200,200],"assets/images/resized/0001/8999/18999v1-max-250x250.jpg"],[[200,200],"assets/images/resized/0001/8999/18999v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://corporate.disney.go.com/corporate/management_team.html\" title=\"Disney\" rel=\"nofollow\">Disney</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"President, Walt Disney Internet Group","firm":{"name":"The Walt Disney Company","permalink":"the-walt-disney-company","type_of_entity":"company","image":{"available_sizes":[[[150,73],"assets/images/resized/0001/0929/10929v1-max-150x150.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-250x250.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Board of Directors","firm":{"name":"dwinQ","permalink":"dwinq","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}