{"first_name":"Steve","last_name":"Pixley","permalink":"steve-pixley","crunchbase_url":"http://www.crunchbase.com/person/steve-pixley","homepage_url":"http://www.autocrib.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"AutoCrib","born_year":null,"born_month":null,"born_day":null,"tag_list":"rfid-reader, tool-crib, rfid-solutions, industrial-vending-machines, tool-tracking-software, tool-crib-supply, tool-crib-software, tool-vending-machines, tool-vending, industrial-vending","alias_list":null,"created_at":"Fri Nov 23 09:27:08 UTC 2012","updated_at":"Sun Nov 25 01:08:45 UTC 2012","overview":"<p>Autocrib, Inc. was started in 1994 to help companies control and deliver the tools\nand supplies that workers needed, where they were needed. Workers would spend\na lot of time looking for tools they needed for their jobs, and there was no proper\nsystem in place to track the materials. Our objective was to help manufacturers and\nmaintenance operations efficiently deal with the inventory challenges that they face\nin their operations. Till date we have provided over 5,000 automated inventory control\nsystems for manufacturing companies worldwide.</p>\n\n<p>The industrial vending machines we supply have been saving manufacturers money\nand time because a lot of expensive tools and supplies sometimes go missing, are\naccessed by the wrong people or the stock runs out. Our machines help assign a cost\nand quantity to what each person issues from the system. Additionally, the AutoCrib\nEleVend, a tool vending machine, securely dispenses large, bulky, or soft items\nincluding gloves, safety glasses, hard hats, Tyvek suits, aprons and more.</p>\n\n<p>Tool crib software, the tool tracking software from Autocrib, Inc., is the latest\ntechnology in automated inventory management. It can perform, issue and return tasks\nat a traditional tool crib window, while simultaneously managing many different types of\npoint-of-use tool dispensing machines. It is a complete tool crib management system\nthat allows you to take control of the usage and inventory of your tools and supplies.</p>\n\n<p>AutoCrib IntelliPort is a secure unmanned tool crib solution that can dispense any size\nitem with high accuracy and little to no data entry required. It has infinite storage space\nfor unlimited SKUs and has a low cost per SKU and RFID tag. IntelliPort&#8217;s turnkey\nsystem of RFID readers scans items to be issued or returned, making check-ins and\ncheck-outs fast and easy.</p>\n\n<p>Our product line has evolved from the basic concept of tool vending into a wide\nvariety of systems that assist companies in controlling tooling, gages, safety and MRO</p>\n\n<p>supplies, as well as other “indirect materials”. We lead the industry in software, training,\nsupport and customer service and are always committed to creating the next generation\nof industrial vending innovations.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Industrial Vending Innovations","firm":{"name":"AutoCrib","permalink":"autocrib","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.autocrib.com","title":"Industrial vending innovations"}],"web_presences":[{"external_url":"http://www.facebook.com/AutoCribInc","title":"Facebook"},{"external_url":"https://twitter.com/autocribinc","title":"Twitter"},{"external_url":"https://plus.google.com/104820814642443950625","title":"Google +"}]}