{"first_name":"Steve","last_name":"Dickerson","permalink":"steve-dickerson","crunchbase_url":"http://www.crunchbase.com/person/steve-dickerson","homepage_url":"http://www.cc.gatech.edu/events/newfaceofcomputing/sdickerson","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"DVT","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Aug 01 06:17:45 UTC 2011","updated_at":"Wed Aug 03 23:30:45 UTC 2011","overview":"<p>Dr. Dickerson received his Sc.D.(Doctor of Science) degree from MIT in 1965, and was employed at Georgia Tech in Mechanical Engineering until retirement in 1996. Most of his teaching was in the area of automation and computer integrated manufacturing.</p>\n\n<p>Shortly after joining Georgia Tech in 1965, he went to Stanford on a NASA Summer Design Institute fellowship. For the next three years, 1967 through 1969, he was the Technical Director of a similar program at the University of Houston and Johnson Space Flight Center.</p>\n\n<p>Dr. Dickerson was program manager for flexible automation and one of the original faculty team of the Material Handling Research Center; an NSF originated University-Industry Cooperative Research Center. Specific research projects in the research center have included work on combined passive damping and active control of lightweight manipulators, propulsion and guidance of automated guided vehicles, and sensors to provide inertial, odometry, vision, and range information for the control of motion.</p>\n\n<p>A machine vision system was a particular innovation arising out of this research, which was commercialized in 1990. The system is based on an integrated illumination, optics, CCD video array, microcomputer and software in a single device about the size of a cigarette pack for measurement and monitoring in many manufacturing and other activities. A patent on the novel design was granted, and two awards for innovative technology were received. These were the 1992 Most Innovative Technology Award from the Atlanta based Business and Technology Alliance and the 1992 New Technology Award from the Inventors Clubs of America.</p>\n\n<p>Dr. Dickerson was the founder of Dickerson Vision Technologies, Inc. In 2005 DVT Corporation was sold to Cognex for $115 million and continues to be one of the leading suppliers of industrial machine vision systems.</p>\n\n<p>Subsequently Dickerson founded CAMotion, Inc. CAMotion also utilizes technology developed at Georgia Tech by three mechanical engineering professors, Wayne Book, Nader Sadegh, and himself. The company aims to provide cost effective automation with the hope of being able to help stem the rapid exporting of manufacturing to low wage countries. The underlying technology is proprietary control algorithms to allow high-speed, accurate motion of low weight and imprecise machines. Thus cutting fabrication costs dramatically. Performance improvements are also a large part of the effort.</p>\n\n<p>Most recently, Dickerson co-founded RideCell. RideCell builds fleet automation software that improves customer experiences and reduces operations costs.</p>","image":{"available_sizes":[[[106,150],"assets/images/resized/0014/7212/147212v2-max-150x150.jpg"],[[140,198],"assets/images/resized/0014/7212/147212v2-max-250x250.jpg"],[[140,198],"assets/images/resized/0014/7212/147212v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"D.Sc.","subject":"","institution":"MIT","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Cofounder & CTO","firm":{"name":"Camotion","permalink":"camotion","type_of_entity":"company","image":{"available_sizes":[[[128,68],"assets/images/resized/0015/4449/154449v1-max-150x150.jpg"],[[128,68],"assets/images/resized/0015/4449/154449v1-max-250x250.jpg"],[[128,68],"assets/images/resized/0015/4449/154449v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Cofounder","firm":{"name":"RideCell","permalink":"ridecell","type_of_entity":"company","image":{"available_sizes":[[[150,27],"assets/images/resized/0006/9125/69125v4-max-150x150.png"],[[250,45],"assets/images/resized/0006/9125/69125v4-max-250x250.png"],[[450,82],"assets/images/resized/0006/9125/69125v4-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Cofounder & CTO","firm":{"name":"DVT","permalink":"dvt","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}