{"first_name":"Steve","last_name":"Domenik","permalink":"steve-domenik","crunchbase_url":"http://www.crunchbase.com/person/steve-domenik","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Nov 30 15:16:34 UTC 2008","updated_at":"Sun Nov 30 15:32:29 UTC 2008","overview":"<p>Steve Domenik joined Sevin Rosen Funds in 1995, bringing considerable experience from both established and small companies in the semiconductor and software industries. His current investment interests span high technology. He serves on the boards of Grandis, OpVista, and a public company funded by SRF NetLogic Microsystems (NASDAQ:NETL). </p>\n\n<p>Steve finds great value in being flexible and versatile. &#8220;Rather than becoming tightly focused,&#8221; he says, &#8220;I want to remain fascinated, willing to pursue huge new opportunities wherever they appear. Today, markets change so fast.&#8221;</p>\n\n<p>Steve is no stranger to the startup world. In the early 1980s, Steve was CEO of two high-technology companies in the RFID and software domains, both of which had successful M&amp;A outcomes. He also was the vice president of marketing at Cyrix, an SRF portfolio company where he worked from the early days until after the IPO. Prior to Cyrix, Steve was the vice president marketing at Weitek, another venture-backed start up company that went public. Steve traces his passion for young technology companies to his early years at Intel where he worked in marketing and engineering positions and, finally, as the manager of microprocessor design centers in California and Japan. During his tenures at Cyrix and Weitek, Steve lived in Japan and Singapore where he established the Asian headquarters for each of those companies.</p>\n\n<p>Steve distinguishes Sevin Rosen in its commitment to entrepreneurs and openness to new opportunities. &#8220;Venture capitalists must be quality partners and add real value to their portfolio companies. That&#8217;s how I see my role, and that&#8217;s what we as a firm provide to the entrepreneurs we back,&#8221; he says.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0003/0244/30244v1-max-150x150.jpg"],[[185,185],"assets/images/resized/0003/0244/30244v1-max-250x250.jpg"],[[185,185],"assets/images/resized/0003/0244/30244v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Sevin Rosen Funds","permalink":"sevin-rosen-funds","type_of_entity":"financial_org","image":{"available_sizes":[[[98,87],"assets/images/resized/0003/0241/30241v1-max-150x150.jpg"],[[98,87],"assets/images/resized/0003/0241/30241v1-max-250x250.jpg"],[[98,87],"assets/images/resized/0003/0241/30241v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}