{"first_name":"Steve","last_name":"Robertson","permalink":"steve-robertson-2","crunchbase_url":"http://www.crunchbase.com/person/steve-robertson-2","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"openreach-truphone-colt","alias_list":null,"created_at":"Tue May 22 18:17:40 UTC 2012","updated_at":"Thu May 24 14:12:27 UTC 2012","overview":"<p>Steve Robertson – short biography</p>\n\n<p>Appointed as CEO Openreach on 22 September 2005 - a multi billion pound business, with 30,000 employees, responsible for running the UK&#8217;s local access network infrastructure.</p>\n\n<p>As CEO of Openreach, Steve&#8217;s delivered the services required by all of the UK&#8217;s communications providers, in a completely fair and equal way, so as to ensure that the UK has a healthy and vibrant telecommunications industry.</p>\n\n<p>Prior to this appointment, Steve served as Managing Director of BT Wholesale Operations where he was responsible for the overall performance and operation of the whole of BT&#8217;s UK mainland telecommunications network.</p>\n\n<p>He re-joined BT from COLT Telecommunications in October 2002. In this role At COLT, Steve served as Managing Director, responsible for the design, deployment and operation of their pan-European infrastructure as well as product management and sales for COLT&#8217;s pan-European business.</p>\n\n<p>Steve held a number of positions across BT Group including Director of Data Products responsible for product management and marketing of BT&#8217;s £1.2bn Data portfolio, as well as a range of product management and engineering roles focussed on BT&#8217;s international business.</p>\n\n<p>Between 1994 and 1998 Steve worked at Concert, BT&#8217;s joint venture with MCI. As Senior Vice President Network, Systems and Operations, he was responsible for the design, deployment and operations of Concert&#8217;s global network and systems with teams in fourteen countries around the world.</p>\n\n<p>Steve&#8217;s education includes an MA from Edinburgh University and an MSc from the London School of Economics</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}