{"first_name":"Steven","last_name":"Kydd","permalink":"steven-kydd","crunchbase_url":"http://www.crunchbase.com/person/steven-kydd","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Demand Media","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Aug 31 15:02:28 UTC 2007","updated_at":"Wed Jul 09 01:22:00 UTC 2008","overview":"<p>Steven is currently EVP, Studios at Demand Media where he oversees all original content production, distribution &amp; syndication of Demand&#8217;s video, text, and animation library. Steven joined Demand Media as part of the founding team as EVP Business Development &amp; Content where he helped establish Demand as a market-leader in made-for-internet content.</p>\n\n<p>Steven joined Demand Media from Yahoo where he spent five years, most recently as VP of Business Development &amp; Strategy for the Yahoo Media Group. Hired in 2001 as one of the first executives in Yahoo&#8217;s newly-created Los Angeles office, Steven was responsible for managing content and advertising relationships with major television networks and movie studios. Previously, Steven served in various executive roles at eTour.com, a fast-growing start-up in Atlanta. Prior to eTour, Steven worked as a film distribution and marketing executive for 20th Century Fox in Los Angeles, Hong Kong and Jakarta. Steven started his career with a boutique market-research and consulting company, Macro International, as a Project Manager in Warsaw and Moscow.</p>\n\n<p>Steven graduated from the University of Maine with a degree in Business Administration. Steven also attended the Free University in Berlin, Germany and the Ecole Superieuere Des Affaires, in Grenoble, France.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"EVP, Studio","firm":{"name":"Demand Media","permalink":"demandmedia","type_of_entity":"company","image":{"available_sizes":[[[150,32],"assets/images/resized/0000/0247/247v3-max-150x150.png"],[[250,54],"assets/images/resized/0000/0247/247v3-max-250x250.png"],[[450,97],"assets/images/resized/0000/0247/247v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}