{"first_name":"Steve","last_name":"Cho","permalink":"steve-cho","crunchbase_url":"http://www.crunchbase.com/person/steve-cho","homepage_url":"http://www.stevecho.com","birthplace":"New York City, New York","twitter_username":"supersteeb","blog_url":"http://supersteeb.tumblr.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1990,"born_month":1,"born_day":28,"tag_list":"","alias_list":null,"created_at":"Thu Aug 25 11:52:28 UTC 2011","updated_at":"Mon Oct 24 01:16:40 UTC 2011","overview":"<p>Steve Cho tries to be the best he can be, live the most epic life he can live, and help others do the same. </p>\n\n<p>After he graduated high school, he ran away to Thailand without telling his parents (and left them a note) to train muay Thai for 2 months. He ended up fighting professionally for the first time at the end of the two months. It was a great experience that taught him a lot about discipline and himself. </p>\n\n<p>Having majored in accounting at the J.M. Tull School of Accounting at the University of Georgia, Steve got a glimpse of the importance of ethics (and thus, integrity) in business. He also got a glimpse of the corporate lifestyle &#8211; you know, the one that Tim Ferriss describes as the mundane trap in which so many people have settled instead of exploring their potential. He went through the whole accounting movement &#8211; study, get good grades, network, get an internship at an accounting firm that will lead to a full-time position, and although he learned a lot, he truly didn&#8217;t like it.</p>\n\n<p>So what happened? Some say he snapped and couldn&#8217;t handle the pressure (you know, because accounting is hard and all). Others say he was delusional. He&#8217;ll tell people (which may or may not be true) that he had an epiphany &#8211; an idea that would help so many people &#8211; that he became so obsessed over it and grew impatient.</p>\n\n<p>So on a study abroad to China, his class visited Chinaccelerator (start-up incubator program based in Dalian), and he pitched his idea to the program director, Cyril Ebersweiler. Coincidentally (and perhaps by fate), at the time, Cyril had a native Chinese developer by the name of William Hu working for him who also had a similar idea. So they came up with this idea on independent occasions on opposite sides of the world. William was originally paired up with a business end for Chinaccelerator, but his business end left due to family obligations (he had a newborn daughter). Cyril introduced Steve and William to each other, they hit it off great, and the rest is history.</p>\n\n<p>So as of this post (25 Aug 2011), Steve and William Hu are working together at Chinaccelerator to make their dreams of helping the world a reality. </p>\n\n<p>That&#8217;s his story summed up pretty briefly. He likes to dance, and justifies his fanatic passion for the art with this quote by Albert Einstein: &#8220;Dancers are the athletes of God.&#8221;</p>","image":{"available_sizes":[[[142,150],"assets/images/resized/0015/4236/154236v2-max-150x150.jpg"],[[237,250],"assets/images/resized/0015/4236/154236v2-max-250x250.jpg"],[[427,450],"assets/images/resized/0015/4236/154236v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}