{"first_name":"Steve","last_name":"Bergin","permalink":"steve-bergin","crunchbase_url":"http://www.crunchbase.com/person/steve-bergin","homepage_url":"http://www.generatepartners.net","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Generate Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"bergin, executive, recruiter","alias_list":null,"created_at":"Wed Jan 14 22:55:33 UTC 2009","updated_at":"Sun Jan 18 03:59:03 UTC 2009","overview":"<p>Steve Bergin is Founder and Managing Partner of Generate Partners. Recognized for the breadth and strength of his relationships with senior executives across all sectors, he is in constant dialogue with the marketplace and as such is able to advise clients on trends which are impacting business models and connections with consumers. He works closely with clients to articulate the right search strategy at the outset and stays personally involved at every step to ensure they are seeing the best potential solutions, both top candidates with direct industry experience as well as others from related industries with the right skill set and additive capabilities.</p>\n\n<p>Prior to founding Generate Partners, Steve was Managing Director with a leading boutique search firm. Previously, he was a key member of Korn/Ferry International’s Global Media &amp; Entertainment Practice. Steve has successfully placed CEOs, COOs, and CFOs as well as heads of Marketing, Sales, Business Development, Production and other functions for major media companies, cable and broadcast networks, music, publishing, information services, internet, mobile and sports businesses.</p>\n\n<p>Steve holds a B.S. degree from the University of Florida and a M.A. from the University of Southern California. He has spent significant time traveling internationally and is fluent in Spanish, Italian and German.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing Partner","firm":{"name":"Generate Partners","permalink":"generate-partners","type_of_entity":"company","image":{"available_sizes":[[[150,85],"assets/images/resized/0011/9595/119595v1-max-150x150.png"],[[220,125],"assets/images/resized/0011/9595/119595v1-max-250x250.png"],[[220,125],"assets/images/resized/0011/9595/119595v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}