{"first_name":"Steven","last_name":"Woda","permalink":"steve-woda","crunchbase_url":"http://www.crunchbase.com/person/steve-woda","homepage_url":"","birthplace":"","twitter_username":"SteveWoda","blog_url":"http://www.stevewoda.com","blog_feed_url":"http://feeds.feedburner.com/stevewoda","affiliation_name":"uKnow.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 28 20:26:08 UTC 2011","updated_at":"Mon Apr 02 23:02:18 UTC 2012","overview":"<p>CEO &amp; Co-founder of uKnow.com. Founder of buySAFE. Entrepreneur. Mobile &amp; Internet Safety &amp; Security. eCommerce. Economics. Wharton MBA.</p>\n\n<p>As President and CEO of uKnow.com, Steve leads the company in its mission of empowering parents with smart tools to keep social and mobile kids safe from the greatest digital dangers including child predators, sexting, and cyberbullying. He is responsible for guiding the company&#8217;s strategy and overseeing day-to-day operations.</p>\n\n<p>uKnow.com powers the world&#8217;s leading Parental Intelligence Systems including uKnowKids.com, KidSafe.me, SafeCyberKids.com, and many others. In short, uKnow.com provides parents with a bird&#8217;s eye view of what is going on in their child&#8217;s digital world so that they can keep their finger on the pulse, and when necessary, take action to protect the safety and privacy of their kids.  Here is a brief intro video… http://www.uknow/overview/</p>\n\n<p>Previously, Steve was the Founder and Chairman of buySAFE, the world’s leading ecommerce trust and safety company, which is now partially owned by Symantec (purchased from Verisign) and The Hartford.  During his nine years at buySAFE, Steve led almost every aspect of operations and co-raised almost $30 million in venture capital. As Senior Vice President of Product and Strategy, he was responsible for leading the company’s business intelligence, professional services, and product management teams that developed all of the Company’s core products, including the buySAFE Seal™, Website Bonding, the Safe Shopping Rating™, and the buySAFE Shopping Advisor™. He also previously led the marketing, sales, and business development teams as Senior Vice President of Strategic Growth during the company’s initial years of rapid growth.</p>\n\n<p>Prior to founding buySAFE, Steve led USF&amp;G’s New York City surety bond operations where he managed a $1.5 billion portfolio of surety bond guarantees and built the business from $3 million to more than $10 million annual revenue in just two years. Steve began his career at Travelers, and also worked at PayMyBills.com, an idealab! company focused on online bill management and payments.</p>\n\n<p>Steve is a recognized expert and regular public speaker on the subjects of Internet/mobile safety and security, ecommerce, and information economics, and he serves on the Advisory Boards of buySAFE, Arcus, and LaunchBox Digital. Steve was appointed to the Virginia Joint Commission on Science and Technology’s Cybercrimes Advisory Committee in 2006, and he is also the inventor of the “Safe Transaction Guaranty” (US Patent 7,644,019) as well as two additional patent applications related to “Method, System, and Components for Obtaining, Evaluating and/or Utilizing Seller, Buyer, and Transaction Data” (US Patent Applications 20090119161 and 20090119160).</p>\n\n<p>Steve earned his MBA in both Entrepreneurship and Operations &amp; Information Management at The Wharton School, University of Pennsylvania. With the help of a collegiate golf scholarship, he earned his BS in Business Administration – Finance &amp; Marketing at Florida Southern College. Steve’s most treasured project is that of husband and father for his incredible wife and two young children.</p>","image":null,"degrees":[{"degree_type":"MBA","subject":"Operations & Information Management, and Entrepreneurship","institution":"The Wharton School, University of Pennsylvania","graduated_year":2001,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"co-founder and CEO","firm":{"name":"uKnow.com","permalink":"uknow-com","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0014/1588/141588v2-max-150x150.jpg"],[[250,83],"assets/images/resized/0014/1588/141588v2-max-250x250.jpg"],[[450,150],"assets/images/resized/0014/1588/141588v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Founder, Chairman, & SVP - Product & Growth","firm":{"name":"buySAFE","permalink":"buysafe","type_of_entity":"company","image":{"available_sizes":[[[141,40],"assets/images/resized/0014/0710/140710v2-max-150x150.png"],[[141,40],"assets/images/resized/0014/0710/140710v2-max-250x250.png"],[[141,40],"assets/images/resized/0014/0710/140710v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/stevewoda","title":"Steve Woda on Twitter"},{"external_url":"http://www.facebook.com/stevewoda","title":"Steve Woda on Facebook"},{"external_url":"http://www.linkedin.com/in/stevewoda","title":"Steve Woda on LinkedIn"}]}