{"first_name":"Steven","last_name":"Holcomb","permalink":"steven-holcomb","crunchbase_url":"http://www.crunchbase.com/person/steven-holcomb","homepage_url":"","birthplace":"Park City, Utah","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1980,"born_month":4,"born_day":14,"tag_list":"","alias_list":null,"created_at":"Fri Jul 20 11:33:46 UTC 2012","updated_at":"Tue Jul 24 09:27:19 UTC 2012","overview":"<p>There is truly no other Olympics athlete quite like Steven Holcomb He was born April 14, 1980 in Park City, Utah and found out at an early age that he wanted to be an Olympic star. He has been competing in the Olympics since 1998 as an American Bobsledder. Not only did he graduate from the “The Winter Sports School” in Park City, but he finds himself working on obtaining a Bachelors degree in Computer Science at DeVry University and is expected to graduate in the year of 2016.</p>\n\n<p>Achievements</p>\n\n<p>Steven Holcomb spent some time in the military before he began focusing his full attention on being an Olympic athlete. He was a Boy Scout who obtained the Eagle Scout rank. He enjoyed skiing for about 12 years and once he became an adult, he became more interested in bobsledding in 2002.</p>\n\n<p>He managed to obtain the gold medal in the 2006-2007 and 2009-2010 world championships.\nHe also managed to receive the gold medal in the four-man bobsled 2009 world championship and the 2010 Vancouver Olympics. In the 2012 World Championships for four-man, two-man and mixed team bobsleigh, he received all gold medals.</p>\n\n<p>Community Involvement</p>\n\n<p>Because Steven obtained the skills and discipline needed in adulthood from boy scouts, he continues working with the Boy Scouts of America so that kids all over the world can benefit the same way he did. Steven is also a part of an organization called the Right to Play. This organization believes that sports have the power to assist in building strong communities and promoting some type of peace in a person’s life.</p>\n\n<p>Another organization that Steven so happily represents is the Team Red, White and Blue. This organization focuses on veterans and helps them ease their way back into society if they have been wounded during their time served. Because of the time that he served in the military, he understands the challenges that veterans might have to deal with.</p>\n\n<p>Because of his passion for these people who served in the military, he has often thought about including their logo on his bobsled. Not to mention, he works hard to create effective networking and support group for these veterans. Do more research on Steven Holcomb to find out what else he is up to these days.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/2059/202059v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/2059/202059v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/2059/202059v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}