{"first_name":"Steve","last_name":"Liddell","permalink":"steve-liddell","crunchbase_url":"http://www.crunchbase.com/person/steve-liddell","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 16 11:26:52 UTC 2011","updated_at":"Thu Jun 16 11:32:25 UTC 2011","overview":"<p>As president, Content Delivery and Network Services, Steve Liddell is responsible for overseeing operations for the CDN (content delivery network) and network infrastructure products (IP transit, transport, colocation, peering, etc.). In July 2010 Mr. Liddell oversaw the acquisition of BandCon and managed the integration of the two products, networks and teams. </p>\n\n<p>Mr. Liddell came to Highwinds after serving as an independent consultant advising a number of private equity and venture capital firms. During that time he served as CEO of Panther Express – a distressed CDN which he successfully turned around and divested in early 2009. Prior to joining Panther, Liddell was the COO of Clearwire International. From 1999 until 2005, Liddell held senior leadership roles at Level 3, first as president Asia based in Hong Kong and later as group vice president based in Colorado. Liddell also served in executive positions at British Telecom and MFS, which became MCI WorldCom, where he was also president Asia. In his career, Steve has lived and worked in Europe, Asia and the US building and scaling large international telecom and Internet businesses. </p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"President, Content Delivery and Network Services","firm":{"name":"Highwinds","permalink":"highwinds","type_of_entity":"company","image":{"available_sizes":[[[150,24],"assets/images/resized/0003/2394/32394v3-max-150x150.jpg"],[[250,40],"assets/images/resized/0003/2394/32394v3-max-250x250.jpg"],[[400,64],"assets/images/resized/0003/2394/32394v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}