{"first_name":"Steven","last_name":"Spencer","permalink":"steven-spencer-2","crunchbase_url":"http://www.crunchbase.com/person/steven-spencer-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jan 24 11:43:14 UTC 2010","updated_at":"Wed Mar 24 23:07:54 UTC 2010","overview":"<p>Steven Spencer is a go-to guy. Well known throughout the wireless industry’s inner circle, when Beezag’s Chief Operating Officer isn’t accepting speaker requests for trade events, he can be found serving on the advisory boards for several early-stage mobile, Internet and e-commerce companies. He is also a member of the leadership board of the Cellular Telecommunications Industry Association (CTIA) Wireless Internet Caucus; for him, attending CTIA shows are annual pilgrimages.</p>\n\n<p>Just about the Web-savviest bridge-and-tunnel man around, you may see him on the PATH train toggling on his BlackBerry. Or his iTouch. Or his HTC Touch. He is a Machead and has a fondness for his first-generation Kindle. His wife is a rocket scientist (no joke), and his New Jersey home sports 15 different IP addresses. Steven is such a natural fit for the Beezag team that when his three kids get grounded, they are allowed to do anything but Beezag. This diehard Rangers fan even Beezags from his seat — Section 308, Row 3 — at Madison Square Garden (fact check: only during intermissions).</p>\n\n<p>Prior to making sure Beezag users get paid when they want to, Steven was the Chief Executive Officer of Upoc Networks, a leading wireless messaging company. He was also a board member of Dada Entertainment, a joint venture of Dada USA and Sony BMG. When Dada acquired Upoc in August 2006, he successfully integrated the business, operations and technology sides of Upoc into Dada S.P.A.</p>\n\n<p>Steven spent his pre-CEO days at Upoc as its Chief Technology Officer and Senior Vice President. This capacity included directing QA and customer service, solidifying his commitment to the end-user experience.</p>\n\n<p>As Executive Vice President for Wireless Systems at Pinnacor, Steven grew the firm from a start-up to a significant supplier of content and wireless application services to goliaths Verizon, Vodafone, Virgin Mobile, AT&amp;T and others. He also served as Pinnacor&#8217;s CTO.</p>\n\n<p>Steven’s early career spans 20 years with Bell Laboratories and Lucent Technologies. Products he managed have produced more than $1 billion in revenue. He earned a BSEE from Union College, an MSEE from Cornell University and an MBA from New York University&#8217;s Stern School of Business. He has authored four patents.</p>\n\n<p>An engaging writer, his Mobileman blog is read by thousands of industry insiders on a weekly basis.</p>\n\n<p>It only takes eight words to really sum him up: Industry Guru. Blogger. Bleeds Ranger Blue. Captain Beezag.</p>","image":null,"degrees":[{"degree_type":"Masters of Engineering","subject":"","institution":"Cornell","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"BSEE","subject":"","institution":"Union College","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"New York University - Stern School of Business","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"COO","firm":{"name":"Beezag","permalink":"beezag","type_of_entity":"company","image":{"available_sizes":[[[150,59],"assets/images/resized/0007/4624/74624v1-max-150x150.png"],[[229,91],"assets/images/resized/0007/4624/74624v1-max-250x250.png"],[[229,91],"assets/images/resized/0007/4624/74624v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.stevenspencer.net","title":""},{"external_url":"http://ceospeaks.worpress.com","title":""},{"external_url":"http://www.twitter.com/njspence","title":""}]}