{"first_name":"Steve","last_name":"Smith","permalink":"steve-smith","crunchbase_url":"http://www.crunchbase.com/person/steve-smith","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"CakeMail","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jul 09 15:41:11 UTC 2008","updated_at":"Thu Jul 10 23:26:26 UTC 2008","overview":"<p>Steve has more than 15 years of international sales and reseller channel development experience selling on-demand sales and marketing automation solutions. Steve thrives on creating an environment where there is success in numbers; leveraging the capabilities of channel partners and helping them succeed. He co-founded CakeMail with Francois Lane. </p>\n\n<p>At Got Corporation, Steve served as Director of Sales, leading the world-wide sales group, where he developed and launched new business strategies, increasing lead conversion rates and revenues to record levels.</p>\n\n<p>At Silanis Technology, Steve helped found the company, leading direct sales and then channel sales, developing projects with fortune 500 customers and international partners that translated into significant growth for Silanis, and ultimately their public offering.</p>\n\n<p>He knows the level of commitment resellers and suppliers make to each other when setting out on a new business venture; where resellers must entrust their customers to a supplier. He believes that providing top-notch support, maximizing recurring revenues, and shortening sales cycles for channel partners is a recipe for joint success.</p>\n\n<p>Steve holds a Master’s degree in Economics, and is passionate about sailing, scuba diving, snowboarding, and is active in various children’s charities.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP Sales","firm":{"name":"CakeMail","permalink":"cakemail","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0002/1720/21720v2-max-150x150.png"],[[198,70],"assets/images/resized/0002/1720/21720v2-max-250x250.png"],[[198,70],"assets/images/resized/0002/1720/21720v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}