{"first_name":"Steve","last_name":"Dornbos","permalink":"steve-dornbos","crunchbase_url":"http://www.crunchbase.com/person/steve-dornbos","homepage_url":"http://www.glpa.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Jul 23 18:17:44 UTC 2011","updated_at":"Mon Jul 25 17:15:21 UTC 2011","overview":"<p>My newest venture, Great Lakes Printing Associates, is intended to take the knowledge and experience of the past 36 years in the industry and put them to use for the benefit of our new clients. </p>\n\n<p>Great Lakes Printing Associates was formed to help businesses reduce their printing costs, utilize the newest technologies, and maximize the effectiveness of their printed material. Through experience in the printing trade, training and education for our clients, we help businesses purchase their printing easily, efficiently and economically. </p>\n\n<p>Whether for a specific project or a general over-view of your printing requirements, we will provide a free evaluation which will help you determine if our services are right for you. </p>\n\n<p>We offer printing and related services, project consulting and staff training.</p>\n\n<p>As owners of Taylor Printing Company, Traverse City’s oldest printing firm, my wife Veronica, and I brought new services to the area. Taylor Printing Company began offering foil stamping and blind embossing, the only printer in the area to produce these products in-house. </p>\n\n<p>Taylor Printing maintained it’s reputation as a high quality printer offering unique services. We had a very loyal customer base, which we are still very grateful for and feel fortunate to have been able to serve. The business was sold to a local printer in 2008, at which time I spent the next year working with the new owner to ensure a smooth transition for its clients.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}