{"first_name":"Steve","last_name":"Westly","permalink":"steve-westly-2","crunchbase_url":"http://www.crunchbase.com/person/steve-westly-2","homepage_url":"http://www.westlygroup.com/","birthplace":"Arcadia, California","twitter_username":"SteveWestly","blog_url":"","blog_feed_url":"","affiliation_name":"The Westly Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"clean-tech","alias_list":null,"created_at":"Sun Jan 18 16:42:37 UTC 2009","updated_at":"Mon Feb 06 23:12:58 UTC 2012","overview":"<p>Steve Westly is the founder and Managing Partner of the Westly Group where he leads the clean technology ventre capital firm&#8217;s investments. </p>\n\n<p>Prior to founding The Westly Group, Westly served as the Controller and Chief Fiscal Officer of the state of California – the world’s eighth largest economy. As Controller, he chaired the State Lands Commission and served on 63 other boards and commissions, including CalPERS and CalSTRS, the nation’s two largest public pension funds, which together invest more than $350 billion. During his four-year term, Mr. Westly spearheaded innovative tax programs that helped close the State’s budget deficit and also led an effort to commit more than $1 billion to clean technology investments.</p>\n\n<p>In the 2008 election cycle Mr. Westly served as a California co-chair and a National Finance Committee member of the Obama for America campaign. He currently serves on the Secretary of Energy’s Advisory Board as a representative for the venture capital industry.</p>\n\n<p>Before running for office, Mr. Westly helped guide the online auction company eBay through its period of most rapid growth, serving as the Senior Vice President of Marketing, Business Development, M&amp;A and International. Mr. Westly helped bring eBay to Europe and Asia and developed the marketing and acquisition strategies that paved the path for the firm’s exponential growth.</p>\n\n<p>Mr. Westly began his career in Washington, D.C., where he worked first on Capitol Hill and later in the Office of Conservation and Solar at the U.S. Department of Energy. Mr. Westly returned to California to become special assistant to the President of the California Public Utilities Commission. While there, he published two books on alternative energy and the utilities.</p>\n\n<p>Mr. Westly holds a bachelor’s degree from Stanford University and an MBA from Stanford’s Graduate School of Business, where he served on the faculty for five years. Mr. Westly and his wife, Anita, run the Westly Foundation, which provides education and health care services for children and underserved communities throughout California.</p>","image":{"available_sizes":[[[93,150],"assets/images/resized/0017/2198/172198v2-max-150x150.jpg"],[[155,250],"assets/images/resized/0017/2198/172198v2-max-250x250.jpg"],[[220,354],"assets/images/resized/0017/2198/172198v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"A.B. ","subject":"History","institution":"Stanford University","graduated_year":1978,"graduated_month":null,"graduated_day":null},{"degree_type":"M.B.A. ","subject":"Public Management","institution":"Stanford Graduate School of Business","graduated_year":1983,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Partner","firm":{"name":"The Westly Group","permalink":"the-westly-group","type_of_entity":"financial_org","image":{"available_sizes":[[[150,38],"assets/images/resized/0003/4151/34151v1-max-150x150.png"],[[250,63],"assets/images/resized/0003/4151/34151v1-max-250x250.png"],[[349,89],"assets/images/resized/0003/4151/34151v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://en.wikipedia.org/wiki/Steve_Westly","title":"Wikipedia "}],"web_presences":[{"external_url":"http://www.facebook.com/stevewestly","title":"Facebook Fan Page"}]}