{"first_name":"Steven","last_name":"Katz","permalink":"steven-katz","crunchbase_url":"http://www.crunchbase.com/person/steven-katz","homepage_url":"http://www.vertexvc.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Nov 29 14:14:12 UTC 2011","updated_at":"Wed Dec 14 00:51:15 UTC 2011","overview":"<p>Steven joined Vertex in 2006 and has assumed a critical multi-disciplinary role.  He has co-led investments and exits across all sectors - assuming roles including portfolio company manager, board representative, and portfolio analyst.  In addition, he leads the management and divestiture of a portfolio of companies on behalf of a major financial institution.</p>\n\n<p>Prior to joining Vertex, Steven worked on Wall Street for approximately ten years, most recently as Director at CIBC World Markets in New York.  As business manager of its US investment bank, Steven helped design and implement the division&#8217;s financial turnaround and shaped its business strategy.  Previously, Steven was an equity research analyst following mid-cap industrial technology companies at Schroders and large-cap industrials as an associate at Sanford C. Bernstein.  In addition to his experience in financial institutions, he worked as a consultant for Booz Allen Hamilton and at two start-ups - one which he co-founded.  Before transitioning his career in business, Steven published research as a scientific fellow at Brookhaven National Laboratory.</p>\n\n<p>Steven holds an M.B.A. from Columbia Business School in New York and received a B.S. in Industrial Engineering and a B.A. in Applied Mathematics from SUNY Buffalo.  Steven is a Chartered Financial Analyst (CFA).</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0016/4420/164420v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0016/4420/164420v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0016/4420/164420v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}