{"first_name":"Steve","last_name":"G. Nussrallah","permalink":"steve-g-nussrallah","crunchbase_url":"http://www.crunchbase.com/person/steve-g-nussrallah","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Dec 29 18:54:59 UTC 2010","updated_at":"Wed Dec 29 19:03:08 UTC 2010","overview":"<p>Steve. G. Nussrallah serves as chairman of Concurrent’s board of directors, a position held since his appointment in October 2000.  An industry veteran with over 24 years of experience, Mr. Nussrallah currently holds several senior advisory positions including general partner of Value Plus Ventures, a private equity firm, since December 2007. </p>\n\n<p>Mr. Nussrallah served as Concurrent’s president and chief executive officer from January to October 2000 and as president of the video-on-demand division from January 1999 to December 1999.  Prior to his tenure with Concurrent, he was president and chief operating officer of Syntellect, Inc., a publicly held supplier of call center solutions to the cable television industry, from 1996 to 1998.  </p>\n\n<p>From January 1990 to March 1996, Mr. Nussrallah served as president and chief operating officer of Telecorp Systems Inc., a privately held supplier of call center solutions which was acquired by Syntellect Inc. in March 1996. Previous employment also includes Scientific-Atlanta, where he initially served as vice president of engineering for Scientific-Atlanta’s cable television operation and later served in positions of increasing responsibility including vice president and general manager of its subscriber business unit.</p>\n\n<p>Mr. Nussrallah earned his bachelor’s degree in electrical engineering from the University of Cincinnati and his master’s degree in electrical engineering from the University of Michigan.</p>","image":{"available_sizes":[[[111,150],"assets/images/resized/0011/5734/115734v1-max-150x150.jpg"],[[162,217],"assets/images/resized/0011/5734/115734v1-max-250x250.jpg"],[[162,217],"assets/images/resized/0011/5734/115734v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chairman, Board of Directors ","firm":{"name":"Concurrent","permalink":"concurrent","type_of_entity":"company","image":{"available_sizes":[[[150,27],"assets/images/resized/0011/5729/115729v1-max-150x150.png"],[[201,37],"assets/images/resized/0011/5729/115729v1-max-250x250.png"],[[201,37],"assets/images/resized/0011/5729/115729v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}