{"first_name":"Steven","last_name":"E. Parry","permalink":"steven-e-parry","crunchbase_url":"http://www.crunchbase.com/person/steven-e-parry","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Nov 24 10:28:29 UTC 2008","updated_at":"Mon Nov 24 10:31:54 UTC 2008","overview":"<p>Steven E. Parry is a Managing Director of NGEN. As a professional geologist, Mr. Parry worked in the minerals industry for more than 25 years. Unlike the traditional geologist’s profile, his career has focused on the development, implementation and management of deal pipelines and deal structures – a body of work incorporating approximately 200 transactions. His pioneering efforts, popularizing a venture capital approach to early stage investment in the mining business, are well known in the industry.</p>\n\n<p>Mr. Parry has managed two portfolios prior to his role at NGEN. At Billiton plc and BHP Billiton, he held the position of Vice President Business Development and General Manager, Innovation for the company’s exploration subsidiary. As a principal in BHP Billiton’s venture capital group, he was responsible for creating its first technology venture fund in 2001. Mr. Parry is a BSc graduate of Queen’s University, Canada, and a MSc graduate from the University of Western Ontario. He was awarded the Canada 125 Medal, conferred by Canada’s Governor General, for his work as Founder and Chairman of Save Our North, a group promoting the interests of northern resource communities. Mr. Parry is a member of the board at Artificial Muscle, EnviroTower, eps corp, Powerspan, SolFocus, Tioga Energy, and Venture Vehicles.</p>","image":{"available_sizes":[[[114,150],"assets/images/resized/0002/9409/29409v1-max-150x150.jpg"],[[166,218],"assets/images/resized/0002/9409/29409v1-max-250x250.jpg"],[[166,218],"assets/images/resized/0002/9409/29409v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"NGEN Partners","permalink":"ngen-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,52],"assets/images/resized/0002/9406/29406v1-max-150x150.jpg"],[[201,71],"assets/images/resized/0002/9406/29406v1-max-250x250.jpg"],[[201,71],"assets/images/resized/0002/9406/29406v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}