{"first_name":"Steven","last_name":"Paul","permalink":"steven-paul","crunchbase_url":"http://www.crunchbase.com/person/steven-paul","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Third Rock Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Oct 08 04:54:40 UTC 2010","updated_at":"Fri Oct 15 17:59:38 UTC 2010","overview":"<p>Steve Paul joined Third Rock Ventures in 2010, and will serve as a senior advisor to the firm and participate in the ideation and development of potential new companies. Steve has had a distinguished career in neuroscience, particularly in CNS drug discovery and development.</p>\n\n<p>Steve is the former president of the Lilly Research Laboratories of Eli Lilly and Company and now leads the Helen &amp; Robert Appel Institute for Alzheimer&#8217;s Research at Weill Cornell Medical College. Prior to his appointment at Weill Cornell, Steve spent 17-years at Eli Lilly, during which time he held several key leadership roles, including vice president of neuroscience (CNS) research, group vice president of discovery research (all therapeutic areas). In his most recent role, he was responsible for the company&#8217;s overall research and development efforts - helping to expand Lilly&#8217;s R&amp;D efforts in oncology and biotechnology - resulting in a pipeline of approximately 70 new molecular entities. Prior to Lilly, Steve served as Scientific Director of the National Institute of Mental Health. He has also served as Medical Director in the Commissioned Corps of the United States Public Health Service.</p>\n\n<p>Steve has been the recipient of many awards and honors and has served on numerous committees and advisory boards. He has also authored or co-authored over 500 papers and book chapters. He is an elected fellow of the American Association for the Advancement of Science and a member of the Institute of Medicine of the National Academy of Sciences. Steve is also currently on the board of directors or is a trustee of several organizations, including the Sigma-Aldrich Corporation, Alnylam Pharmaceuticals, the Allen Institute for Brain Sciences, The Mind Research Network, and the Foundation for the NIH. Steve has also served as a member of the National Institute of General Medical Sciences (NIGMS) Advisory Council and was appointed by the secretary of the Department of Health and Human Services (HHS) as a member of the advisory committee to the director of the NIH from 2001-2006. Steve is currently a member of the National Advisory Mental Health Council, NIMH, and is board certified by the American Board of Psychiatry and Neurology. Steve received his Bachelor of Arts degree in Biology and Psychology from Tulane University in 1972, and his Master of Science and Doctor of Medicine degrees from the Tulane University School of Medicine in 1975.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Venture Partner","firm":{"name":"Third Rock Ventures","permalink":"third-rock-ventures-2","type_of_entity":"financial_org","image":{"available_sizes":[[[150,78],"assets/images/resized/0005/0700/50700v1-max-150x150.png"],[[205,107],"assets/images/resized/0005/0700/50700v1-max-250x250.png"],[[205,107],"assets/images/resized/0005/0700/50700v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}