{"first_name":"Steven","last_name":"Chu","permalink":"steven-chu","crunchbase_url":"http://www.crunchbase.com/person/steven-chu","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Fri Oct 22 17:24:15 UTC 2010","updated_at":"Fri Oct 22 17:34:17 UTC 2010","overview":"<p>As United States Secretary of Energy, Dr. Steven Chu is charged with helping implement President Obama&#8217;s ambitious agenda to invest in clean energy, reduce our dependence on foreign oil, address the global climate crisis, and create millions of new jobs.</p>\n\n<p>Dr. Chu is a distinguished scientist and co-winner of the Nobel Prize for Physics (1997). He has devoted his recent scientific career to the search for new solutions to our energy challenges and stopping global climate change - a mission he continues with even greater urgency as Secretary of Energy. </p>\n\n<p>Prior to his appointment, Dr. Chu was the Director of the Department of Energy&#8217;s Lawrence Berkeley National Lab, where he led the lab in pursuit of alternative and renewable energy technologies. He also taught at the University of California as a Professor of Physics and Professor of Molecular and Cell Biology. Previously, he held positions at Stanford University and AT&amp;T Bell Laboratories. </p>\n\n<p>Dr. Chu&#8217;s research in atomic physics, quantum electronics, polymer and biophysics includes tests of fundamental theories in physics, the development of methods to laser cool and trap atoms, atom interferometry, the development of the first atomic fountain, and the manipulation and study of polymers and biological systems at the single molecule level. While at Stanford, he helped start Bio-X, a multi-disciplinary initiative that brings together the physical and biological sciences with engineering and medicine. </p>\n\n<p>The holder of 10 patents, Dr. Chu has published nearly 250 scientific and technical papers. He remains active with his research group and has recently published work on general relativity and single molecule biology and biophysics that includes sub-nanometer molecular imaging with optical microscopy, cadherin adhesion, neural vesicle fusion, and nerve growth factor transport. About 30 alumni of his research group have gone on to become professors in their own right and have been recognized by dozens of prizes and awards. </p>\n\n<p>Dr. Chu is a member of the National Academy of Sciences, the American Philosophical Society, the Chinese Academy of Sciences, Academia Sinica, the Korean Academy of Sciences and Technology and numerous other civic and professional organizations. He received an A.B. degree in mathematics, a B.S. degree in physics from the University of Rochester, and a Ph.D. in physics from the University of California, Berkeley as well as honorary degrees from 15 universities. </p>\n\n<p>Dr. Chu was born in Saint Louis, Missouri in 1948. He is married to Dr. Jean Chu, who holds a D.Phil. in Physics from Oxford and has served as chief of staff to two Stanford University presidents as well as Dean of Admissions. Secretary Chu has two grown sons, Geoffrey and Michael, by a previous marriage. </p>\n\n<p>In announcing Dr. Chu&#8217;s selection, President Obama said, &#8220;The future of our economy and national security is inextricably linked to one challenge: energy. Steven has blazed new trails as a scientist, teacher, and administrator, and has recently led the Berkeley National Laboratory in pursuit of new alternative and renewable energies. He is uniquely suited to be our next Secretary of Energy as we make this pursuit a guiding purpose of the Department of Energy, as well as a national mission.&#8221; Dr. Chu was sworn into office as the 12th Secretary of Energy on January 21, 2009.</p>","image":{"available_sizes":[[[150,126],"assets/images/resized/0010/6793/106793v1-max-150x150.png"],[[217,183],"assets/images/resized/0010/6793/106793v1-max-250x250.png"],[[217,183],"assets/images/resized/0010/6793/106793v1-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"","subject":"Co-Winner 1997","institution":"Nobel Prize for Physics","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Director","firm":{"name":"Lawrence Berkeley National Laboratory","permalink":"lawrence-berkeley-national-laboratory","type_of_entity":"company","image":null}},{"is_past":true,"title":"Professor of Physics","firm":{"name":"Stanford University","permalink":"stanford-university","type_of_entity":"company","image":{"available_sizes":[[[150,35],"assets/images/resized/0006/7302/67302v1-max-150x150.jpg"],[[250,58],"assets/images/resized/0006/7302/67302v1-max-250x250.jpg"],[[255,60],"assets/images/resized/0006/7302/67302v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://nobelprize.org/nobel_prizes/physics/laureates/1997/chu-autobio.html","title":"Nobel Prize Autobiography"}]}