{"first_name":"Steve","last_name":"Woolsey","permalink":"steve-woolsey","crunchbase_url":"http://www.crunchbase.com/person/steve-woolsey","homepage_url":"http://www.devdesk.net","birthplace":"USA","twitter_username":"devdesk","blog_url":"","blog_feed_url":"","affiliation_name":"DevDesk","born_year":null,"born_month":null,"born_day":null,"tag_list":"retail-development, leasing, real-estate, internet-technology, crm, customer-relationship-management, cloud-computing, software-as-a-service, saas, paas, franchise-management, franchising, business-networking, automated-workflows, mobile-applications, cms","alias_list":null,"created_at":"Wed Jul 13 15:21:40 UTC 2011","updated_at":"Sat Sep 01 07:09:48 UTC 2012","overview":"<p>History and experience in franchise development, business administration and entrepreneurial ventures have led to Steve&#8217;s current career in software development of automated systems and processes for business management and retail expansion.</p>\n\n<p>Steve recently returned to his hometown of Seattle, WA after living near London, England between 2009 and 2012 in order to concentrate his efforts on the expansion of his latest business venture: DevDesk LLC.</p>\n\n<p>DevDesk is a Point-of-Sale (POS) hardware, financial software and integrated solutions provider of technologies benefiting franchise organizations, retail establishments and multi-business owners.  Their integrations focus on connecting clients to the cloud through eCommerce and online applications.  </p>\n\n<p>They will be launching their flagship product DevDesk Tabz as a software-as-a-service (SaaS) platform where companies and individuals can find, organize and share online apps and URLs while accessing these favorite applications from a single interface.</p>\n\n<p>Steve worked for nearly 10 years in the franchise industry at Subway Northwest, Inc.: a local development office for Subway sandwiches.  He helped grow the independently owned territory from under 100 locations to over 200 while taking part in all aspects of the business from territory planning, franchisee procurement, acquiring properties, negotiating leases, organizing construction, renegotiations and renewals, and monitoring compliance and operations of opened stores.  </p>\n\n<p>His experience in the industry led to his involvement in the development of a private restaurant chain called Matt&#8217;s Gourmet Hot Dogs where over the course of 5 years he was primarily involved in the investment, consultation, rebranding, store planning, leasing and construction of this chain of restaurants. In the later stages, he helped convert the operation to a &#8220;licensed outlet&#8221; model (as a Licensor) and subsequently relieved his interest in the company.</p>\n\n<p>Given his experience in franchising, retail development and the technology fields Steve is now concentrating his efforts on the DevDesk brand and solving problems related to franchising, multi-business, and multi-concept expansion.  By incorporating the benefits of cloud-computing and SaaS pricing models, the ultimate goal is to provide enterprise level tools to small business owners to assist entrepreneurs in organizing their organizations and expanding their brands.</p>","image":{"available_sizes":[[[150,137],"assets/images/resized/0014/3980/143980v2-max-150x150.jpg"],[[250,229],"assets/images/resized/0014/3980/143980v2-max-250x250.jpg"],[[450,413],"assets/images/resized/0014/3980/143980v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Executive Officer","firm":{"name":"DevDesk","permalink":"devdesk","type_of_entity":"company","image":{"available_sizes":[[[150,93],"assets/images/resized/0014/4062/144062v2-max-150x150.jpg"],[[250,155],"assets/images/resized/0014/4062/144062v2-max-250x250.jpg"],[[289,180],"assets/images/resized/0014/4062/144062v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Development Director","firm":{"name":"Subway Northwest","permalink":"subway-northwest","type_of_entity":"company","image":null}},{"is_past":true,"title":"Secretary Treasurer","firm":{"name":"Matt's Gourmet Hot Dogs","permalink":"matts-gourmet-hot-dogs","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://uk.linkedin.com/in/stevewoolsey","title":"LinkedIn"},{"external_url":"http://twitter.com/devdesk","title":"Twitter"}]}