{"first_name":"Steve","last_name":"Drace","permalink":"steve-drace","crunchbase_url":"http://www.crunchbase.com/person/steve-drace","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Sportgenic","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Mar 04 18:39:13 UTC 2008","updated_at":"Wed Nov 26 07:34:44 UTC 2008","overview":"<p>With nearly 30 years of sales experience in the publishing industry, Steve has been involved in online marketing since the Internet became a mainstream medium. From 1993 to 1996, he was director of corporate online sales and marketing for International Data Group (IDG), where he was instrumental in achieving the company&#8217;s vision of online publishing. In addition to creating Web-based partnerships with major national accounts, he conceived of and managed IDG&#8217;s Cyber Marketing Resource Center, an online advertising resource for IT marketers and ad agencies. In 1997, he was named IDG&#8217;s vice president of national accounts and was promoted to vice president of sales one year later.</p>\n\n<p>His vast experience in online marketing also includes roles as vice president of Internet advertising sales and marketing for Berkeley Systems, Inc., and vice president of sales for Findlaw, the Web&#8217;s leading legal portal. In addition, he has held publishing and sales positions for various media companies such as Reed Business Information and CMP Publications, Inc.</p>\n\n<p>In his free time, Steve enjoys a great road bike ride, a few waves and general fitness training.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"VP of Sales","firm":{"name":"International Data Group","permalink":"international-data-group","type_of_entity":"company","image":{"available_sizes":[[[150,56],"assets/images/resized/0008/7617/87617v1-max-150x150.jpg"],[[179,67],"assets/images/resized/0008/7617/87617v1-max-250x250.jpg"],[[179,67],"assets/images/resized/0008/7617/87617v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}