{"first_name":"Steve","last_name":"Bridge","permalink":"steve-bridge-2","crunchbase_url":"http://www.crunchbase.com/person/steve-bridge-2","homepage_url":"","birthplace":"England","twitter_username":"SteveBridge","blog_url":"","blog_feed_url":"","affiliation_name":"ElementsLocal","born_year":1951,"born_month":7,"born_day":1,"tag_list":"","alias_list":null,"created_at":"Sun Jun 19 22:08:45 UTC 2011","updated_at":"Fri Oct 26 05:08:39 UTC 2012","overview":"<p>Summary </p>\n\n<p>Steve assists small companies and turnarounds to achieve successful operations. His business model is to assist with senior management, financing, and sales and marketing. Presently assisting the VAFB Launch Services organization manage construction projects for launch facilities.</p>\n\n<p>Steve is an owner and serves as CFO and is on the BOD of several companies including, ElementsLocal; Franchise Online Marketing Software, 101 Marketing a new media marketing agency, StoryAd Network, a Digital Signage and Marketing company, LCE a Media Production company, CFO at Gather Wine Bar A comfortable, intimate wine bar and is the CEO for Bridge Business and Entrepreneur Services Inc, a Business Management and Technology Consulting firm. Past BOD memberships include California Space Authority, National Association of Working Seniors, the Aging Connection, Space Information Labs and Frontier Technologies Inc. Steve has over 30 years of Management, Engineering and Information Technology experience and holds a top secret and above clearances. He has held key positions for Frontier Technology Inc, bd Systems Inc., Lockheed Corp., Martin Marietta Corp., Certainteed Corp., and The Boeing Company. Steve is a Registered Mechanical Professional Engineer with a Bachelors degree from Chico State University, California and a Masters of Systems Management from the University of Southern California. </p>\n\n<p>Specialties</p>\n\n<p>Senior engineering, financial and marketing management, construction management, software development and systems engineering expertise.</p>","image":{"available_sizes":[[[115,150],"assets/images/resized/0013/9948/139948v2-max-150x150.jpg"],[[193,250],"assets/images/resized/0013/9948/139948v2-max-250x250.jpg"],[[347,450],"assets/images/resized/0013/9948/139948v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President","firm":{"name":"ElementsLocal","permalink":"elements","type_of_entity":"company","image":{"available_sizes":[[[150,43],"assets/images/resized/0013/9805/139805v4-max-150x150.png"],[[234,68],"assets/images/resized/0013/9805/139805v4-max-250x250.png"],[[234,68],"assets/images/resized/0013/9805/139805v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}