{"first_name":"Steve","last_name":"Winn","permalink":"steve-winn","crunchbase_url":"http://www.crunchbase.com/person/steve-winn","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Aug 13 13:26:34 UTC 2009","updated_at":"Thu Aug 13 13:27:45 UTC 2009","overview":"<p>Chairman of the Board, Chief Executive Officer, President \nSteve Winn is a true visionary who has continually identified revolutionary business concepts and aggressively pursued their development. Before acquiring RealPage, Steve was president of Research Institute of America (RIA), the largest provider of information services to the accounting industry, with more than $300 million in annual revenue. He was also president and CEO of Computer Language Research, a publicly traded company that was a leader in tax compliance, tax research, and accounting software. Accounting Today recognized him as one of the 100 most influential people in the accounting industry. His foresight led to the development of the largest web-based application in the accounting industry, supporting more than 100,000 accountants in the United States. Similar technology is now being applied to develop RealPages on-demand systems for the multifamily industry.\nSteve is a member of the board of directors of the National Multi Housing Council and a member of the Real Estate Council. He has also served as a member of the Stanford University Sloan Board, the American Business Conference, St. Marks Board of Trustees, and the American Electronics Association. As a nationally recognized expert on multifamily issues, Steve has spoken at such events as the National Apartment Association Education Conference and Expo, Multi-Housing World, the Multifamily Trends Conference, the Real Estate Council Conference Group, the National Multi Housing Council Technology Conference, the U.S. Apartment Market Conference, and the Texas Apartment Market Conference.\nIn January 2002, Steve was one of five people recognized by the National Apartment Association as a true leader in the multifamily industry. In January 2006, Multifamily Executive magazine named Steve as one of the 30 men and women who are shaping the multifamily industry.</p>","image":{"available_sizes":[[[93,114],"assets/images/resized/0005/6328/56328v1-max-150x150.jpg"],[[93,114],"assets/images/resized/0005/6328/56328v1-max-250x250.jpg"],[[93,114],"assets/images/resized/0005/6328/56328v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"RealPage","permalink":"realpage","type_of_entity":"company","image":{"available_sizes":[[[126,29],"assets/images/resized/0005/6326/56326v1-max-150x150.png"],[[126,29],"assets/images/resized/0005/6326/56326v1-max-250x250.png"],[[126,29],"assets/images/resized/0005/6326/56326v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}