{"first_name":"Steven","last_name":"Bonacorsi","permalink":"steven-bonacorsi","crunchbase_url":"http://www.crunchbase.com/person/steven-bonacorsi","homepage_url":"http://www.linkedin.com/groups/Lean-Six-Sigma-37987","birthplace":"USA","twitter_username":"sbonacorsi","blog_url":"http://ezinearticles.com/?expert=Steven_Bonacorsi","blog_feed_url":"http://feeds.ezinearticles.com/expert/Steven_Bonacorsi.xml","affiliation_name":"Unaffiliated","born_year":1968,"born_month":11,"born_day":20,"tag_list":"steven-bonacorsi, islss, lean-six-sigma, master-black-belt, consultant, kaizen, president, training, project-coaching","alias_list":null,"created_at":"Sat May 05 13:31:39 UTC 2012","updated_at":"Thu May 10 03:28:33 UTC 2012","overview":"<ul>\n<li>Steve Bonacorsi is the Owner and founder of the Lean Six Sigma Group\n<ul>\n<li>President of the International Standard for Lean Six Sigma (ISLSS)</li>\n<li>Author and Speaker for the International Quality and Productivity Center (IQPC) and Advisory Board Member for the Process Excellence Network (PEX Network)</li>\n<li>Honorary Adviser for the International Six Sigma Council (ISSC) for Six Sigma certification standards. </li>\n</ul></li>\n<li>Author of the American Society of Quality (ASQ) Lean and Six Sigma certification exams. </li>\n<li>Past Board of Directors and Vice President for the Institute of Industrial Engineers (IIE) - Boston Chapter. </li>\n<li>Keynote Speaker for the International Society of Six Sigma Professionals (ISSSP)\n<ul>\n<li>Premier Sponsor and contributing author for iSixSigma</li>\n<li>Lean Six Sigma Deployment Thought Leader - designing and leading the Program Management Office (PMO) Transformations for 27 Fortune 100 Companies.</li>\n<li>Author of the Lean Six Sigma Tollgate Templates and hundreds of continuous improvement articles, magazine, video, blog talk radio, and book publications.</li>\n</ul></li>\n</ul>\n\n<p>Specialties\nLean Six Sigma, Kaizen, Value Stream Mapping, Training, Project Coaching, Curriculum Development, Public Speaking, Workshops, Project Management, Change Management, Transformations.</p>\n\n<ul>\n<li>Leading Complex, Global, Enterprise-wide Projects +$1B in size.\n<ul>\n<li>Designing the Deployment Plan, Infrastructure, Project Identification and Prioritization, Kaizen Event Facilitation, and Contributing Author and Speaker in the Continuous Process Improvement space.</li>\n</ul></li>\n</ul>","image":{"available_sizes":[[[145,150],"assets/images/resized/0018/7971/187971v2-max-150x150.png"],[[154,159],"assets/images/resized/0018/7971/187971v2-max-250x250.png"],[[154,159],"assets/images/resized/0018/7971/187971v2-max-450x450.png"]],"attribution":"<p>Steven Bonacorsi</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}