{"first_name":"Steven","last_name":"Ostad","permalink":"steven-ostad","crunchbase_url":"http://www.crunchbase.com/person/steven-ostad","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Apr 13 12:53:53 UTC 2012","updated_at":"Sun Apr 15 01:04:01 UTC 2012","overview":"<p>Born in 1985, real estate expert Steven Ostad began in the real estate industry at a young age. He first leaned on his two brothers, but it wasn’t long before he stood on his own. Today, Steven is best known as the founder of Empire City Realty. Founded in 2010, the firm has become a major player in the real estate game in New York City.</p>\n\n<p>Though he’s in his late twenties, Steven has accomplished much in his life. He has become involved with several Israeli charities. He also speaks three languages: English, Farsi, and Hebrew. These aspects of his character partially explain his success in real estate. His personality—outgoing and charming—add more to the picture.</p>\n\n<p>Above all else, though, Steven possesses a unique business savvy. Empire City Realty is on the cutting edge. It started with a business model that relies heavily on social networking. This is a strategy adopted by several, larger real estate firms, who had to scramble to catch up with current trends. </p>\n\n<p>Empire City, however, began with Facebook and Twitter already integrated into their marketing strategy. These media work well for reaching the largest demographic of the real estate market—recent college graduates. \nSteven’s relative youth has worked for him in this regard. He has a vast amount of knowledge about the industry, but retains a connection to his audience.</p>\n\n<p>Steven Ostad Discusses the Real Estate Market</p>\n\n<p>With the recent economic recession, the real estate market remains in the public consciousness. There’s no doubt that it’s in trouble, but Steven, as the CEO of Empire City Realty, explains how this affects buyers. On the small scale, he says, it can actually help. Prices have fallen, meaning that homes are more affordable.</p>\n\n<p>Empire City is based in Manhattan, so it specializes in the type of real estate New York City offers. A one-bedroom co-ops can cost anywhere from $130,000 to $170,000. Two bedrooms can be more cost-effective, at around $250,000. \nFor condos, the price ratio between a one bedroom and a two bedroom is closer. However, these prices (some as high as $450,000) can be negotiated down because of the condition of the current market.</p>\n\n<p>Steven Ostad also has vast experience in rentals, many of which run at the low price of $1,400 per month. His career has spanned many facets of the real estate industry. Steven Ostad also has a number of connections throughout the business, enabling him to offer his clients exclusive deals. Steven Ostad truly is the go-to authority in the real estate market. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}