{"first_name":"Steve","last_name":"Harrick","permalink":"steve-harrick","crunchbase_url":"http://www.crunchbase.com/person/steve-harrick","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Aug 15 05:29:06 UTC 2008","updated_at":"Mon Jun 15 12:52:12 UTC 2009","overview":"<p>Steve Harrick joined Institutional Venture Partners (IVP) in October 2001. He focuses on investing in later-stage technology companies with exceptional growth potential. Specifically, Steve targets Internet, communications and technology-enabled services companies which have the potential to become leaders in their respective markets. He enjoys working closely with committed entrepreneurs to help create businesses that are both respected and revolutionary. Steve was recognized by Forbes Magazine as one of the top 100 venture capitalists in the world by inclusion in the 2009 Midas List.</p>\n\n<p>Steve led IVP’s investments in Aster Data Systems, Business.com (RHD), CafePress, eHealth (EHTH), MarkMonitor, Motion Computing, MySQL (JAVA), RGB Networks, Teros (CTXS), Tripwire and WebEx Communications (WEBX), and has been actively involved in IVP&#8217;s investments in ArcSight (ARST) and Danger (MSFT). Steve currently serves on the Board of Directors of MarkMonitor and is a Board Observer at Aster Data Systems, Handango, Motion Computing, RGB Networks, and Tripwire.</p>\n\n<p>Before joining IVP, Steve worked for the Internet Capital Group (ICG) in San Francisco, CA. As Vice President of Acquisitions, his responsibilities included identifying and executing strategic acquisitions, generating partner company liquidity and providing strategic and operational advice to management teams. Steve focused on enterprise applications and infrastructure while at ICG and was extensively involved in the expansion and successful sales of both of Centrimed and EmployeeLife.</p>","image":{"available_sizes":[[[125,113],"assets/images/resized/0004/8567/48567v1-max-150x150.jpg"],[[125,113],"assets/images/resized/0004/8567/48567v1-max-250x250.jpg"],[[125,113],"assets/images/resized/0004/8567/48567v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.A.","subject":"History","institution":"Yale University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Institutional Venture Partners","permalink":"institutional-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,68],"assets/images/resized/0001/5065/15065v3-max-150x150.jpg"],[[250,113],"assets/images/resized/0001/5065/15065v3-max-250x250.jpg"],[[450,204],"assets/images/resized/0001/5065/15065v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}