{"first_name":"Steve","last_name":"Smithwick","permalink":"steve-smithwick","crunchbase_url":"http://www.crunchbase.com/person/steve-smithwick","homepage_url":"http://www.teledini.com","birthplace":"Raleigh, North Carolina","twitter_username":"SteveSmithwick","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1968,"born_month":1,"born_day":22,"tag_list":"","alias_list":null,"created_at":"Mon Aug 20 14:08:36 UTC 2012","updated_at":"Thu Aug 23 18:59:18 UTC 2012","overview":"<p>Steve is the President &amp; Chief Operating Officer for Teledini. Prior to Teledini, Steve served as Chief Technology Officer for Global Connection Inc. of America, a CLEC operating in 30 states. Prior to Global, as Chairman and Chief Executive Officer, Steve oversaw the strategic vision for Reignmaker Communications, driving the company&#8217;s steady growth as an industry leader in providing the highest quality VoIP for the small to medium business marketplace. Steve is an early pioneer in VoIP with more than a decade of front-line experience. He has a successful track record in creating solid growth companies. In 2000, he joined the founding team of Cbeyond Communications, Inc., a voice and broadband Internet provider for small businesses. At Cbeyond, he served in a variety of capacities including V.P. New Markets and V.P. of Sales Operations. In addition to developing the company&#8217;s core sales infrastructure, he grew the company&#8217;s direct sales force to an unprecedented 200+ installs per market/per month. Before his foray into VoIP, he served in a variety of leadership roles with Intermedia Communications, Inc. Steve also held sales leadership positions with PST, Inc., an authorized sales agent of MCI which was later acquired by MCI.</p>","image":{"available_sizes":[[[150,144],"assets/images/resized/0020/6970/206970v2-max-150x150.png"],[[176,170],"assets/images/resized/0020/6970/206970v2-max-250x250.png"],[[176,170],"assets/images/resized/0020/6970/206970v2-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"Bachelor of Science","subject":"Business Administration","institution":"University of North Carolina at Chapel Hill","graduated_year":1990,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}