{"first_name":"Stewart","last_name":"Brand","permalink":"stewart-brand","crunchbase_url":"http://www.crunchbase.com/person/stewart-brand","homepage_url":"http://web.me.com/stewartbrand/SB_homepage/Home.html","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Mon Apr 02 20:09:43 UTC 2012","updated_at":"Mon Apr 02 20:09:43 UTC 2012","overview":"<p>Born 14 Dec 1938, Rockford, Illinois, USA.</p>\n\n<p>1954-56, Phillips Exeter Academy.</p>\n\n<p>1960, Graduated in Biology, Stanford University.</p>\n\n<p>1960-62, Active duty, U.S. Army officer. Qualified Airborne and took up skydiving. Taught basic infantry training and worked as photojournalist out of the Pentagon.</p>\n\n<p>1962, Studied design at San Francisco Art Institute and photography at San Francisco State; participated in legal LSD study at International Foundation for Advanced Study, Menlo Park, California.</p>\n\n<p>1963-66, Researched, photographed, designed, and performed multi-media event, “America Needs Indians.” Spent time on Warm Springs, Blackfoot, Navajo, Hopi, Papago, and other Indian reservations.</p>\n\n<p>1964, Did research, collection, and writing for IBM’s and Gordon Ashbyy’s “Astronomia,” an exhibit on the history of astronomy at the Hayden Planetarium, New York.</p>\n\n<p>1964-66, Hung out with Ken Kesey, Merry Pranksters, and early Acid Tests.</p>\n\n<p>1966, Designed and organized the “Trips Festival,” a 3-day rock-light watershed event at Longshoreman&#8217;s Hall, San Francisco.</p>\n\n<p>1966, Conceived and sold buttons which read, “Why Haven’t We Seen A Photograph of the Whole Earth Yet?” Legend has it that this accelerated NASA&#8217;s making good color photos of Earth from distant space during the Apollo program and that the ecology movement took shape in 1970 partially as a result of those photos.</p>\n\n<p>1966, Did sound and doorways for “We Are All 1” at Riverside Museum, New York City, with USCO (an artist/engineer team based in Garnerville, NY).</p>\n\n<p>1966, Wrote “The Native American Church Meeting&#8221;” for Psychedelic Review #9.</p>\n\n<p>1966, Designed and organized “Whatever It Is,” an all-night multi-stage event at San Francisco State Experimental College.</p>\n\n<p>1966, Received Acid Test Diploma from Neal Cassady at Acid Test Graduation (see Tom Wolfe’s The Electric Kool-aid Acid Test).</p>\n\n<p>1966, Married Lois Jennings, Ottawa Indian who grew up in Washington, DC.</p>\n\n<p>1967, Designed and organized “World War IV,” public war games at San Francisco State College.</p>\n\n<p>1967-69, Designed and performed multi-media “WAR/GOD.”</p>\n\n<p>1968-72, Founded, edited, and published the original Whole Earth Catalog.</p>\n\n<p>1968, Helped design and participated in Doug Engelbart&#8217;s demonstration of “Augmented Human Intellect” at the Fall Joint Computer Conference in San Francisco. It has been described as “the mother of all demoes,” since it inspired much of what was to come in personal computers.</p>\n\n<p>1969, Designed and organized “Liferaft Earth,” a week-long crowded public fast dramatizing overpopulation, starring the Hog Farm.  A film of the event was made by Robert Frank.</p>\n\n<p>1971, Designed and co-organized with Scott Beach the “Demise Party,” which celebrated the end of Whole Earth Catalog with 1,500 guests at the new Exploratorium in San Francisco, and turned over $20,000 in cash to the audience to do good with. Debate lasted till dawn.</p>\n\n<p>1972, Received National Book Award for The Last Whole Earth Catalog, Random House. 1.5 million copies sold. (All editions sales were over 2.5 million; a Millennium Whole Earth Catalog came out in 1994, with a foreword by me.)</p>\n\n<p>1972, Founded Point Foundation, which gave away $1 million in three years to assorted effective individuals. Point was the non-profit foundation which ran all the Whole Earth activities through 2003.</p>\n\n<p>1973, Divorced amicably from Lois Jennings, and she became Lois Britton.</p>\n\n<p>1973, Designed and organized “The New Games Tournament,” which resulted in two books, New Games Book and More New Games, by Andrew Fluegelman.</p>\n\n<p>1974, Authored Two Cybernetic Frontiers, Random House—on Gregory Bateson and cutting-edge computer science. It had the first use of the term “personal computer” in print and was the first book to report on computer hackers. The book expanded on a 1972 article for Rolling Stone called “Fanatic Life &amp; Symbolic Death Among the Computer Bums,” and a 1973 article for Harpers titled “Unbinding—Conversations with Meta-naturalist Gregory Bateson.”</p>\n\n<p>1974, Edited and published the Whole Earth Epilog, Penguin.</p>\n\n<p>1974-85, Founded, edited, and published CoEvolution Quarterly. (It continued to 2003 as Whole Earth Magazine.)</p>\n\n<p>1976, Edited Space Colonies and co-edited Soft Tech (with J. Baldwin), Penguin.</p>\n\n<p>1977-79, Advisor to Governor of California Edmund G. Brown, Jr.  In that role I initiated The California Water Atlas, which now lives in glory online, thanks to The David Rumsey Map Collection.</p>\n\n<p>1977, A son, Noah Brand, born to Alia Johnson. He’s turned into a writer.</p>\n\n<p>1980-81, Edited and published The Next Whole Earth Catalog, Random House. That was the peak edition.</p>\n\n<p>1982-83, Founded Uncommon Courtesy: School of Compassionate Skills, which gave sessions on such subjects as “Creative Philanthropy,” “Business as Service,” “Street Saint Skills.”</p>\n\n<p>1982-83, On faculty of School of Management and Strategic Studies, Western Behavioral Sciences Institute, La Jolla, California.</p>\n\n<p>1982, Purchased a 64-foot tugboat, the &#8220;Mirene&#8221; and have lived there ever since, in Sausalito.</p>\n\n<p>1983, Married Ryan Phelan (then known as Patty). She founds and co-founds things too—”Savvy,”; Planetree; Phelan’s (equestrian mail-order catalog); Direct Medical Knowledge (bought by WebMD); All Species Inventory; and currently a genetic testing company, DNA Direct (now part of Medco Health Solutions). </p>\n\n<p>1983-85, Editor-in-Chief, Whole Earth Software Catalog, Doubleday. A magazine I founded, Whole Earth Software Review, failed conspicuously.</p>\n\n<p>1984, Founded The WELL (Whole Earth ‘Lectronic Link), a computer teleconference system for the San Francisco Bay Area. It now has 9,000 active users worldwide and is considered a bellwether of the genre&#8212;1988 Community Journalism Award from Media Alliance, 1990 Best Online Publication Award from Computer Press Association, 1994 Electronic Frontier Foundation Pioneer Award. (Others involved in starting The WELL were Larry Brilliant, Matthew McClure, Kevin Kelly, and Cliff Figallo.) The WELL is now owned by Salon.</p>\n\n<p>1984, Initiated and co-organized (with Kevin Kelly and Ryan Phelan) “The Hackers Conference,” which became a TV special by Fabrice Florin, broadcast nationally. Since 1986 it is an annual event.</p>\n\n<p>1986, Co-editor with Art Kleiner, News That Stayed News, North Point Press—anthology of greatest pieces from CoEvolution.</p>\n\n<p>1986, Visiting Scientist, The Media Laboratory, MIT.</p>\n\n<p>1986-89, Consultant with Group Planning, Royal Dutch/Shell, London.</p>\n\n<p>1987, Author, The Media Lab: Inventing the Future at MIT, Viking Penguin. Out of print, after 7 printings. Translated into Japanese, Korean, German, Italian, and Spanish (Spain and Latin America versions); British edition; QPB Selection; Eliot Montroll Award.</p>\n\n<p>1987-89, Organizer of private conference series on Learning in Complex Systems sponsored by strategic planners at Royal Dutch/Shell, Volvo, and AT&amp;T.</p>\n\n<p>1988- , Co-founder of Global Business Network with Peter Schwartz, Jay Ogilvy, Napier Collyns, and Lawrence Wilkinson. I founded and ran the “GBN Book Club” from 1988 to 1999 and 2008 to now. GBN explores global futures and business strategy for 90 multinationals such as Ford, Bechtel, Shell, Morgan Stanley, Hewlett Packard, Swedbank, Dupont, Federal Express, along with government clients such as DARPA. Many of GBN’s scenario techniques may be found in the book The Art of the Long View. At present I work half time for GBN.</p>\n\n<p>1988, Author of “Indians and the Counterculture, 1960s-1970s,” in History of Indian-White Relations, Vol. 4 in the authoritative Handbook of North American Indians, Smithsonian Institution.</p>\n\n<p>1989-2004, Member, Board of Trustees of the Santa Fe Institute, the interdisciplinary center studying the sciences of complexity.  I was involved in design of the campus build-out.</p>\n\n<p>1989, Received Golden Gadfly Lifetime Achievement Award from Media Alliance, San Francisco.</p>\n\n<p>1990-1994 , Member of Board of Directors of the Electronic Frontier Foundation, an organization that supports civil rights and responsibilities in electronic media.</p>\n\n<p>1990- , Advisor to Ecotrust, Portland-based preservers of temperate rain forest from Alaska to San Francisco.</p>\n\n<p>1994, Author, How Buildings Learn: What Happens After They’re Built, Viking-Penguin (US) and Orion (UK).  Bay Area Book Reviewers Award. SPNEA Prize. Now in paperback.  Used as a textbook for some architecture and preservation classes.  Many seem to treat it as a book about systems and software design (an example of that).  One reader wrote a summary of the whole book, here.</p>\n\n<p>1995- , Co-founder with Danny Hillis of The Long Now Foundation to foster long-term responsibility. The core projects are building a 10,000-year Clock (designed by Hillis) and tools and services toward a 10,000-year Library (such as the Rosetta Project). Also on the board are Danny Hillis, Peter Schwartz, Brian Eno, Douglas Carlston, Esther Dyson, Paul Saffo, Michael Keller, David Rumsey, Kevin Kelly, Kim Polese, Chris Anderson, and David Eagleman. Serving as president and board co-chair.  Alexander Rose is executive director.</p>\n\n<p>1996-1997, Co-writer and presenter, “How Buildings Learn,” 6-part TV series for the BBC. Aired in July-August 1997 on BBC2. Series directed by James Runcie, music by Brian Eno. The 6 parts may now be viewed online—segments 1, 2, 3, 4, 5, 6; short sample.</p>\n\n<p>1999, Author, The Clock of the Long Now: Time and Responsibility, Basic Books (US) and Orion (UK). A mosaic of essays exploring the meaning and uses of a 10,000-year “now.”</p>\n\n<p>2001-03, Co-founder with Kevin Kelly and Ryan Phelan of the All Species Inventory—to find and document all of life on Earth in 25 years.  It ran out of money, but species discovery and cataloging continues to accelerate in the world, especially with a follow-on called “The Encyclopedia of Life”.</p>\n\n<p>2001- , Co-founder with Kevin Kelly of the Long Bets website, to foster public accountability for predictions.</p>\n\n<p>2003- , Founder and curator of Long Now’s “Seminars About Long-term Thinking” (SALT), a monthly series of public talks in San Francisco, featuring speakers such as Jared Diamond, Bruce Sterling, Freeman Dyson, Jimmy Wales, Ray Kurzweil, and Paul Hawken.  Co-hosted with Kevin Kelly.</p>\n\n<p>2006, Received Erdman Campbell Award for Creative Contributions to the Contemporary Mythopoetic Imagination from the Joseph Campbell Foundation.  </p>\n\n<p>2006, Subject of a book titled From Counterculture to Cyberculture: Stewart Brand, the Whole Earth Network, and the Rise of Digital Utopianism, by Fred Turner.  It’s a well researched book, better than a biography, because its entire interest is tracing influences.</p>\n\n<p>2007, Subject of another book, titled Counterculture Green: The Whole Earth Catalog and American Environmentalism, by Andrew Kirk.  It relates the tech-friendly and science-friendly influence of the Whole Earth publications on the environmental movement.</p>\n\n<p>2008, Received the Gene Burd Urban Journalism Award from the Urban Communication Foundation.</p>\n\n<p>2009, Author, Whole Earth Discipline: An Ecopragmatist Manifesto, Viking-Penguin (US) and Atlantic (UK).  Translated into Italian, Spanish, Portuguese, Korean, Chinese, Japanese.</p>\n\n<p>2010, Received the Cleantech Leader of the Year Award from The Cleantech Group.</p>\n\n<p>2011, Author, The SALT Summaries, on Kindle, collecting 100 of my summaries of the Seminars About Long-term Thinking I curated for The Long Now Foundation.  Foreword by Brian Eno.</p>","image":{"available_sizes":[[[84,150],"assets/images/resized/0018/2286/182286v1-max-150x150.jpg"],[[140,250],"assets/images/resized/0018/2286/182286v1-max-250x250.jpg"],[[169,300],"assets/images/resized/0018/2286/182286v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}