{"first_name":"Stewart","last_name":"Schuster","permalink":"stewart-schuster","crunchbase_url":"http://www.crunchbase.com/person/stewart-schuster","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Nov 25 08:43:12 UTC 2008","updated_at":"Tue Nov 25 08:48:54 UTC 2008","overview":"<p>Stewart Schuster became a general partner at Novus Ventures in 2002. He served as both a Venture Partner at Brentwood Venture Capital and an independent investor since 1995, specializing in enterprise software. Stu&#8217;s extensive investing experience spans more than 15 companies, many of whom went public or were successfully acquired.</p>\n\n<p>Prior to his venture experience, Stu served as executive vice president of marketing at Sybase, Inc. During Stu&#8217;s tenure at Sybase, the Company grew from its initial product launch to $1 billion in revenues, and became the fifth largest independent software company in the US. At Sybase, Stu oversaw the company&#8217;s worldwide marketing, with responsibilities that included marketing communications, product marketing, field programs, channels and partner development, and international marketing. Stu was named to the 1994 All-Star Executive Team by Upside magazine, being recognized for pioneering the marketing of client-server architecture. He previously held technical and marketing management, and executive positions at Ingres, Tandem Computers, and Intel.</p>\n\n<p>Stu earned his Bachelors in applied mathematics and computer science from Washington University, St. Louis. Stu also received a Masters in mathematics and a PhD in computer science from the University of Illinois, Champaign-Urbana.</p>","image":{"available_sizes":[[[135,140],"assets/images/resized/0002/9549/29549v1-max-150x150.jpg"],[[135,140],"assets/images/resized/0002/9549/29549v1-max-250x250.jpg"],[[135,140],"assets/images/resized/0002/9549/29549v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Novus Ventures","permalink":"novus-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[140,80],"assets/images/resized/0002/9544/29544v1-max-150x150.jpg"],[[140,80],"assets/images/resized/0002/9544/29544v1-max-250x250.jpg"],[[140,80],"assets/images/resized/0002/9544/29544v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}