{"first_name":"Stuart","last_name":"Crawford","permalink":"stuart-crawford-2","crunchbase_url":"http://www.crunchbase.com/person/stuart-crawford-2","homepage_url":"http://stuart.calgarybloggers.ca","birthplace":"Irvine, Scotland","twitter_username":"scrawforditm","blog_url":"http://www.stuartcrawford.com","blog_feed_url":"feed://stuart.calgarybloggers.ca/feed","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"it-matters, calgary, htg, iamcp, alberta, canada, technical, it-professional, top-40-under-40, techselect, microsoft","alias_list":null,"created_at":"Sat Sep 06 04:26:15 UTC 2008","updated_at":"Thu Mar 18 20:04:43 UTC 2010","overview":"<p>Stuart Crawford provides Social Media Consulting and Search Engine Optimization services in the Calgary, Alberta, Canada market.  His company, Ulistic is a leader in providing small business and MSP (IT Partners) with the knowledge needed to win new opportunities through effective online marketing, search engine optimization and social networking.</p>\n\n<p>Stuart Crawford is a remarkably talented, goal orientated, and value-driven professional offering over 15 years of business experience in the small to midsize information technology market. He strives to constantly evolve, accomplish and develop his knowledge and then share that expertise with clients, peers and team members.  Stuart understands the importance of giving back to the community that helped him get established.</p>\n\n<p>Involved with Ulistic from conception, his track record of success speaks for itself.  The company has grown with increased performance through dynamic leadership, strategic planning, technology innovation and adaptability to changes in the marketplace. Stuart is equally adept in capitalizing on interpersonal and technology skills to create a unique blend of innovative solutions and products.</p>\n\n<p>Stuart shares his high energy, optimistic entrepreneurial spirit with a network of business people in a variety of industries.  As a member and a leader, he is very involved in several networking groups.  These networking and entrepreneurial groups facilitate the growth of start-up companies as well as assist companies undergoing a transition to long-term growth. His leadership as President IAMCP (International Association of Microsoft Certified Partners) Canada, Facilitator HTG Canada, and chairmen of the Calgary Entrepreneur Group and Calgary IT Elite Group shows the balance of work/community involvement that many business leaders ignore. Stuart is very involved in the Microsoft Small Business Specialist community having received the MVP for Windows Server - Customer Experience. </p>\n\n<p>Passionate about seeing other businesses reap the rewards offered by the right Information Technology solutions and support, he strives to inspire and positively impact Small Business owners and entrepreneurs.  He completes his passion in three ways: by providing IT services through his company IT Matters, by giving day and evening classes to help entrepreneurs navigate the crazy world of technology, and by mentoring IT Professionals to better service their clients. Helping others develop their potential and succeed in their own business is a person goal. </p>\n\n<p>A recognized leader in Calgary, Stuart was awarded as one of the Top 40 Under 40 in 2007and Top 20 Business Leaders of Tomorrow in 2008.  As VP, Business Development with Bulletproof InfoTech, he was thrilled to be recognized with the BBB Small Business Ethics Award in 2007.  In the broader Information Technology community, Stuart received the Microsoft Small Business Specialist IMPACT award in 2006 and in 2008 won the IMPACT award for Networking Infrastructure solution of the Year.</p>\n\n<p>Stuart served for 8 years as the VP, Business Development with Calgary&#8217;s IT Matters. 1 Year with Bulletproof InfoTech and is an active member in the Calgary Chamber of Commerce.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0002/4716/24716v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0002/4716/24716v2-max-250x250.jpg"],[[299,450],"assets/images/resized/0002/4716/24716v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.ulistic.com/calgary-search-engine-optimization","title":"Calgary Search Engine Optimization"},{"external_url":"http://www.ulistic.com/calgary-search-engine-optimization","title":"Calgary Search Engine Optimization"},{"external_url":"http://www.ulistic.com/social-media-consulting","title":"Calgary Social Media Consulting"},{"external_url":"https://ulistic.com/socialmediaseocourses/linkedin-training-calgary.php","title":"Calgary LinkedIn Workshop"}]}