{"first_name":"Subodh","last_name":"Toprani","permalink":"subodh-toprani","crunchbase_url":"http://www.crunchbase.com/person/subodh-toprani","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat May 30 05:32:53 UTC 2009","updated_at":"Sat May 30 05:33:19 UTC 2009","overview":"<p>Subodh Toprani comes to ZettaCore from Infineon Technologies North America, where he ran the Wireline Communications business as senior vice president and general manager. Prior to that, he was president and CEO of Catamaran Communications, a company he sold to Infineon after recruiting key personnel, establishing the infrastructure, completing the first product and developing the first customers. For the six years prior to Catamaran, Toprani was at Rambus Inc., initially as vice president of marketing, and ultimately as vice president and general manager, Logic Products Division. While at Rambus, among his many accomplishments were successfully positioning the company as the industry’s first IP company, developing its thrust into the consumer and communications business, and enabling the successful launch of the Sony PlayStation® 2 incorporating Rambus technology.</p>\n\n<p>Earlier in his career, Mr. Toprani worked for more than a dozen years for Advanced Micro Devices, beginning as a field applications engineer and advancing to become director of marketing and systems engineering for the Embedded Processor Division and the Personal Computer Products Division. He received his BSEE and MSEE from the Illinois Institute of Technology.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"ZettaCore","permalink":"zettacore","type_of_entity":"company","image":{"available_sizes":[[[150,70],"assets/images/resized/0004/6021/46021v1-max-150x150.png"],[[220,104],"assets/images/resized/0004/6021/46021v1-max-250x250.png"],[[220,104],"assets/images/resized/0004/6021/46021v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}