{"first_name":"Sudhakar","last_name":"Ramakrishna","permalink":"sudhakar-ramakrishna","crunchbase_url":"http://www.crunchbase.com/person/sudhakar-ramakrishna","homepage_url":"http://www.polycom.com/company/about_us/executive_team/sudhakar_ramakrishna.html","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Polycom","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jun 15 20:25:03 UTC 2012","updated_at":"Wed Jun 20 19:45:51 UTC 2012","overview":"<p>Sudhakar Ramakrishna is President, Products and Services, for Polycom, the global leader in open standards-based unified communications (UC) solutions for telepresence, video, and voice. He is responsible for defining and delivering best in class unified communication products and solutions and driving revenue growth and profitability.</p>\n\n<p>Mr. Ramakrishna joined Polycom in 2010 as Senior Vice President and General Manager of Unified Communications Solutions, and Chief Development Officer. He was promoted to Executive Vice President in February 2011. </p>\n\n<p>Mr. Ramakrishna brings a wealth of strategy and execution experience to Polycom. Before Polycom, Mr. Ramakrishna was Corporate VP and GM for Wireless Broadband Access Solutions and Software Operations at Motorola. Mr. Ramakrishna was instrumental in scaling the 4G (WiMAX and LTE) and Software business, and led large multi-function teams of more than 2300 employees, and businesses across the globe. Previously, Mr. Ramakrishna held senior management roles at Stoke Networks, 3Com, U.S. Robotics and other companies.</p>\n\n<p>Mr. Ramakrishna has extensive experience working with enterprise and carrier/operator customers. His areas of technology focus include wireless, MoIP/IP telephony, data networking, security, and IP convergence-related technologies and services. Mr. Ramakrishna has significant experience in organization development, strategic planning and execution, incubating and scaling new businesses, and was involved in strategic partnerships with Huawei, Siemens, and several mergers, acquisitions and divestitures.</p>\n\n<p>Mr. Ramakrishna earned a Master&#8217;s of Science degree in Computer Science from Kansas State University. He received his Master&#8217;s Degree in Business Administration from Northwestern University&#8217;s Kellogg Graduate School of Management. Mr. Ramakrishna holds and has filed several patents in the areas of IP telephony, soft switching and load balancing.</p>","image":{"available_sizes":[[[145,126],"assets/images/resized/0019/5728/195728v2-max-150x150.jpg"],[[145,126],"assets/images/resized/0019/5728/195728v2-max-250x250.jpg"],[[145,126],"assets/images/resized/0019/5728/195728v2-max-450x450.jpg"]],"attribution":"<p>Polycom</p>"},"degrees":[{"degree_type":"MBA","subject":"Business Administration","institution":"Northwestern University - Kellogg Graduate School of Management","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"Masters of Science","subject":"Computer Science","institution":"Kansas State University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Preident of Products and Services","firm":{"name":"Polycom","permalink":"polycom-2","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0008/7120/87120v8-max-150x150.jpg"],[[250,76],"assets/images/resized/0008/7120/87120v8-max-250x250.jpg"],[[307,94],"assets/images/resized/0008/7120/87120v8-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}