{"first_name":"Sudip","last_name":"Nandy","permalink":"sudip-nandy","crunchbase_url":"http://www.crunchbase.com/person/sudip-nandy","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jan 02 22:51:36 UTC 2009","updated_at":"Sat Jun 27 02:23:15 UTC 2009","overview":"<p>Sudip has a long history of building internationally successful, high growth businesses. Sudip joined Aricent as CEO in October 2008, with a rich track record and deep domain expertise in the communications and outsourcing industry.</p>\n\n<p>Previously, Sudip was the president of the technology media and telecom business unit at Wipro, overseeing more than 18,000 people and a revenue run rate of US $1.3 billion per annum. He held a number of positions including chief strategy officer, globally responsible for the successful completion of nine merger and acquisitions, and joint venture transactions over a two year period. In addition Sudip headed up the Wipro European Sales and Operations, growing development centers in the United Kingdom and Sweden. Prior to that, Sudip was vice president of product development and marketing at a Silicon Valley semiconductor start-up, which was folded into Wipro. Sudip holds a Bachelors Degree in Physics with Honors from the Indian Institute of Technology, Kharagpur and another one in Electrical Technology and Electronics from the Indian Institute of Science in Bangalore. He also has an MBA from the Indian Institute of Management in Ahmedabad. Sudip has been an active member of the Institute of Directors, and is an active participant in the Global Executive Forum of the Economist Intelligence Unit. </p>","image":{"available_sizes":[[[108,150],"assets/images/resized/0005/1051/51051v1-max-150x150.jpg"],[[140,194],"assets/images/resized/0005/1051/51051v1-max-250x250.jpg"],[[140,194],"assets/images/resized/0005/1051/51051v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Aricent Group","permalink":"aricent","type_of_entity":"company","image":{"available_sizes":[[[150,12],"assets/images/resized/0003/2896/32896v4-max-150x150.jpg"],[[222,18],"assets/images/resized/0003/2896/32896v4-max-250x250.jpg"],[[222,18],"assets/images/resized/0003/2896/32896v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}