{"first_name":"Sue","last_name":"Claridge","permalink":"sue-claridge","crunchbase_url":"http://www.crunchbase.com/person/sue-claridge","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jul 24 15:12:06 UTC 2009","updated_at":"Fri Jul 24 15:13:39 UTC 2009","overview":"<p>Sue has 30 years of experience within the education and training sectors. She joined CENTRA in September 2005 from Nord Anglia Education plc where she was responsible for the operational management of vocational education and sports services at the Army Foundation College under a 28 year PFI contract. Additionally, she was a consultant for the company&#8217;s work on the tri-service Defence Training Review focusing on Trainer Training and Accreditation. </p>\n\n<p>Sue initially trained as an Early Years&#8217; teacher and started her career in primary education then moved on to be a lecturer in Primary Science at Edge Hill College. Later she joined Edge Hill&#8217;s commercial company, Edge Hill Enterprises, responsible for conferences and events and later, as International Manager, responsible for recruiting students from the USA. This involved managing the College&#8217;s semester abroad programmes on which students joined undergraduate programmes or took their final teaching practice in a British school. Additionally, Sue was responsible for an International MBA programme delivered by Oklahoma City University for students in Merseyside, supported by European Social Funding. </p>\n\n<p>At CENTRA, Sue is responsible for our Education &amp; Training Programmes and IT support services for schools, colleges and businesses and is Project Manager for the DCSF Choice Advisers Support and Quality Assurance Network contract. </p>","image":{"available_sizes":[[[100,93],"assets/images/resized/0005/4186/54186v1-max-150x150.jpg"],[[100,93],"assets/images/resized/0005/4186/54186v1-max-250x250.jpg"],[[100,93],"assets/images/resized/0005/4186/54186v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"COO","firm":{"name":"CENTRA","permalink":"centra","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0005/3161/53161v1-max-150x150.jpg"],[[250,250],"assets/images/resized/0005/3161/53161v1-max-250x250.jpg"],[[450,450],"assets/images/resized/0005/3161/53161v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}