{"first_name":"Sue","last_name":"Siegel","permalink":"sue-siegel","crunchbase_url":"http://www.crunchbase.com/person/sue-siegel","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Nov 06 15:51:31 UTC 2008","updated_at":"Thu Nov 06 19:44:55 UTC 2008","overview":"<p>Sue Siegel brings 25 years experience commercializing key enabling technologies in biomedical research and healthcare. She leads investments in personalized medicine spanning areas that include technology platforms to molecular diagnostics to online healthcare, all of which leverage the power of cross-disciplinary convergence. She partners with entrepreneurs that offer &#8220;disruptive innovation&#8221; business solutions to pressing healthcare challenges: age-onset and lifestyle-induced health conditions, consumer-driven wellness preservation, and those that improve healthcare economics.</p>\n\n<p>Prior to joining MDV, Sue was President and Director of Affymetrix, Inc., a company that pioneered GeneChip®technology and was instrumental in the expansion of genomics-based personalized medicine. During her tenure, she grew Affymetrix to become a multibillion dollar market cap company. At Amersham International (now GE), she held several senior executive roles, including President of Hoefer-Pharmacia Biotech. At Amersham, Sue played a key role in growing businesses through acquisitions and via the commercialization of novel enabling technologies. She was also involved in commercializing key biomedical technologies at E. I. DuPont &amp; Co., Eastman Kodak Co., and Bio-Rad Laboratories.</p>\n\n<p>Sue serves on the board of The Tech Museum of Innovation, is a member of the Presidents&#8217; Circle of the National Academies, and serves as an advisor to the Institute of Medicine. As Chair of the Community Relations Committee of The Gladstone Institute in San Francisco, she leads the effort to expand this leading biomedical research organization to the global community. Sue was elected as a Henry Crown Fellow of the Aspen Institute in 2003. As part of this Fellowship, she co-founded at the Stanford Hospital Geriatric Department, Checking-In™, an organization dedicated to serving our aging population. She is a Council member for the Institute for Immunity, Transplantation, and Infectious Diseases (ITI) at Stanford Medical School and is an Officer of the Golden Gate Chapter of YPO. Sue has served as a Regional Panelist for the selection of White House Fellows, on the Council on Biotechnology Research, Innovation, and Public Policy for the Center for Strategic and International Studies (CSIS), and on the IBM Life Sciences and Healthcare Strategic Advisory Council.</p>\n\n<p>Sue received a M.S. in Biochemistry and Molecular Biology from Boston University Medical School where she studied cellular differentiation in mouse embryonic carcinoma stem cells. She received her B.S. in Biology from the University of Puerto Rico.</p>","image":{"available_sizes":[[[102,150],"assets/images/resized/0002/7940/27940v2-max-150x150.jpg"],[[166,242],"assets/images/resized/0002/7940/27940v2-max-250x250.jpg"],[[166,242],"assets/images/resized/0002/7940/27940v2-max-450x450.jpg"]],"attribution":"<p>http://www.mdv.com/team_bio.html?id=25</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Mohr Davidow Ventures","permalink":"mohr-davidow-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,58],"assets/images/resized/0001/9292/19292v3-max-150x150.jpg"],[[250,97],"assets/images/resized/0001/9292/19292v3-max-250x250.jpg"],[[450,176],"assets/images/resized/0001/9292/19292v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}