{"first_name":"Sumit","last_name":"Rai","permalink":"sumit-rai","crunchbase_url":"http://www.crunchbase.com/person/sumit-rai","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Mobclix","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Aug 25 01:32:43 UTC 2008","updated_at":"Fri Nov 04 22:02:23 UTC 2011","overview":"<p>Mr. Rai is Chief Development Officer of Velti (NASDAQ: VELT) where he runs corporate development and global business development.  Previously, Mr. Rai was Sr. Vice President of Velti (NASDAQ: VELT) and General Manager of their Mobile Advertising Business Unit.  Prior, he was CEO and co-founder of Mobclix, Inc. (acquired by NASDAQ: VELT) where he managed the organization and led business development and strategy for the company.  Mr. Rai previously served as Managing Partner of Venus Capital&#8217;s Private Equity Group, which focused on investments globally with an emphasis in India.  Prior, he was a Principal at Riverside Partners, a leading lower middle market private equity firm focused on founder and family owned businesses.  At Riverside, Mr. Rai led an investment into National Display Systems (NDS), a leader in the design and manufacturing of flat panel, liquid crystal displays for the medical industry, where he served on the Board of Directors.  Mr. Rai previously worked at Magma Design Automation (NASDAQ: LAVA), an infrastructure software provider to the semiconductor industry, where he held various operating roles in finance, marketing, and business development.  Prior, Mr. Rai spent several years working on private and public company core technology investments at Crosslink Capital, formerly Omega Ventures of Robertson Stephens.  At Crosslink Capital, private investments that Mr. Rai worked on included Magma Design Automation (NASDAQ: LAVA) and NuCore Technologies, a leading semiconductor supplier to the digital camera market.  Prior, Mr. Rai spent time at Digital Ventures, an incubator and early stage venture capital firm for ecommerce infrastructure companies, where he was instrumental for their investment into FusionStorm, a leading managed services provider.  Mr. Rai began his investment career at American Industrial Acquisition Corporation (AIAC), a middle market focused private equity buyout firm, where he was instrumental in the acquisition and divestiture of Integrated Medical Systems, Inc. (IMSI) from Northrop Grumman Corporation (NYSE: NOC); Mr. Rai continues to serve as a Board Advisor to IMSI, a leader in the design and manufacturing of Life Support Trauma and Transport (LSTAT) equipment. </p>\n\n<p>Mr. Rai has been a judge and mentor for numerous business plan competitions including those held by Stanford Bases, the University of California at Berkeley, and SiliconIndia; he has been featured as a guest lecturer for courses at the University of California at Berkeley and Boston College, and has spoken for various organizations including Ernst &amp; Young and Asian Venture Capital Journal (AVCJ) on the topics of business plan writing, investing, and capital markets in the United States and India.  Mr. Rai serves as a Charter Member of TiE (The Indus Entrepreneurs), a global non-profit entrepreneurship organization.  </p>\n\n<p>Mr. Rai holds a Bachelor of Science and Engineering degree in Electrical Engineering and Computer Science from the University of California at Berkeley, where he graduated as a Regent Scholar.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Development Officer","firm":{"name":"Velti","permalink":"velti","type_of_entity":"company","image":{"available_sizes":[[[150,47],"assets/images/resized/0004/4139/44139v3-max-150x150.jpg"],[[240,76],"assets/images/resized/0004/4139/44139v3-max-250x250.jpg"],[[240,76],"assets/images/resized/0004/4139/44139v3-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"","firm":{"name":"Mobclix","permalink":"mobclix","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0002/4081/24081v2-max-150x150.png"],[[197,79],"assets/images/resized/0002/4081/24081v2-max-250x250.png"],[[197,79],"assets/images/resized/0002/4081/24081v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.facebook.com/profile.php?id=756859171","title":"Facebook"}]}