{"first_name":"Sun","last_name":"Pak","permalink":"sun-pak","crunchbase_url":"http://www.crunchbase.com/person/sun-pak","homepage_url":"http://icomputerdenver.com","birthplace":"Denver","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1978,"born_month":9,"born_day":25,"tag_list":"computer-repair, laptop-repair, mac-repair, apple-repair, refurbished-apple-computers, virus-removal, it-support, network-support","alias_list":null,"created_at":"Wed Jun 13 17:59:35 UTC 2012","updated_at":"Sun Jun 17 14:02:46 UTC 2012","overview":"<p>Mac &amp; PC Repairs</p>\n\n<p>Unlike most repair companies, we repair both Apple Macintosh and Windows PC computers. Our technicians are certified to repair both platforms and hardware.</p>\n\n<p>24 Hour Diagnostic</p>\n\n<p>We have a 99% success rate in completing your repair diagnostic in less than 24 hours. We believe in a fast turnaround while providing excellent service. Customers are always kept in the loop with regular status updates.</p>\n\n<p>Better Pricing</p>\n\n<p>iComputer has competitive pricing.  Not only will you save money with your repair diagnostic, our repair rates are among the best in the industry.  Call us today! 720-253-0092</p>\n\n<p>Our team provides comprehensive computer solutions for your every technical and IT need. iComputer technicians are both Apple Certified and CompTIA A+ / Network+ Certified and well-trained in Mac and PC repair and technical support. We can fix any Apple or Windows-based machines.</p>\n\n<p>We provide superior customer service, fast turnaround, and a friendly staff who are extremely knowledgeable in sales and computer support. </p>\n\n<p>We are open Monday – Friday, 9am-6pm; on Saturdays from 10am-5pm; and closed on Sundays and all major holidays.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://computerstore.icomputerdenver.com","title":"iComputer Online Store"},{"external_url":"http://www.facebook.com/pages/iComputer/360112563450#","title":"iComputer Facebook FanPage"},{"external_url":"http://icomputerdenver.com/services/","title":"iComputer Services"}]}