{"first_name":"Sunir","last_name":"Kapoor","permalink":"sunir-kapoor","crunchbase_url":"http://www.crunchbase.com/person/sunir-kapoor","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"ubmatrix","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Aug 22 05:10:12 UTC 2008","updated_at":"Tue Nov 04 19:29:52 UTC 2008","overview":"<p>Sunir Kapoor is the President and Chief Executive Officer of UBmatrix. He comes to UBmatrix from Cassatt Corporation, where he was its Chief Marketing Officer. Prior to Cassatt, Mr. Kapoor re-joined Oracle Corporation in 2002 as the Vice President responsible for creating and leading the company&#8217;s fourth major business: Oracle Collaboration Suite. This was his second stint at Oracle, where he had formerly been the Vice President of Strategic Marketing &amp; Planning. Kapoor co-founded E-Stamp Corporation and was its President and CEO from inception. He is credited with inventing the market and technology for Internet postage and leading E-Stamp Corporation to a successful IPO. On March 31st 1998, E-Stamp brought to market the first new form of postage evidencing in over 78 years in the U.S. Kapoor has also held management positions at Microsoft Corporation, where he was Director of Worldwide Business Strategy working for the Office of the President, and responsible in Europe for leading the Company&#8217;s efforts in building its enterprise products business. In addition, Kapoor has held management positions for Novell Inc.&#8217;s Europe, Middle East, and Africa organization. He has also been worked at the European Space Agency and Honeywell Inc., both in Europe. Mr. Kapoor holds a BSc. Honours Degree in Physics from the University of Birmingham, and an MSc. in Computer Systems from the Cranfield Institute of Technology, both in the UK.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"UBmatrix","permalink":"ubmatrix","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0002/3999/23999v2-max-150x150.png"],[[168,60],"assets/images/resized/0002/3999/23999v2-max-250x250.png"],[[168,60],"assets/images/resized/0002/3999/23999v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}