{"first_name":"Sunil","last_name":"Verma","permalink":"sunil-verma","crunchbase_url":"http://www.crunchbase.com/person/sunil-verma","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Mobclix","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Aug 25 01:32:43 UTC 2008","updated_at":"Fri Jul 16 00:14:11 UTC 2010","overview":"<p>Mr. Verma is a co-founder of Mobclix and heads the daily operations for the company. Mr. Verma was recently a Partner in Venus Capital&#8217;s Private Equity Group, where he focused on investments in Digital Media in the US and India. Prior, he was with Gabriel Venture Partners, a leading growth equity firm, where he assisted with the firm&#8217;s investments Digital Media, Software and International Investments in India including Persistent Systems, MakeMyTrip.com, and Tejas Networks; additionally, he supported several of Gabriel&#8217;s Public Indian portfolio companies post-investment including Allsec (BSE: ALLSEC), InvestSmart (BSE: INVSTSMART), and Provogue (BSE: PROVOGUE). Prior to Gabriel, Mr. Verma was with Catapult Advisors, a boutique investment bank that focused Digital Media, Mobile and Software M&amp;A. Prior, Mr. Verma worked with Tavant Technologies, where he managed a team of product engineers for online lead generation in the finance vertical.  </p>\n\n<p>Mr. Verma has been a contributor to case studies regarding Indian investing for Harvard Business School and Stanford&#8217;s Graduate School of Business. He has authored numerous articles on the private capital markets in India. Mr. Verma is an active member of TiE (The Indus Entrepreneurs) and has chaired several panels at its annual conference. Mr. Verma previously served as an Executive Member for NextGen Partners, where he co-developed an series of educational and social events for junior investment professionals. </p>\n\n<p>  Mr. Verma graduated with Honors from Santa Clara University with both an M.S. and B.S. in Computer Engineering.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Business Development Officer","firm":{"name":"Velti","permalink":"velti","type_of_entity":"company","image":{"available_sizes":[[[150,47],"assets/images/resized/0004/4139/44139v3-max-150x150.jpg"],[[240,76],"assets/images/resized/0004/4139/44139v3-max-250x250.jpg"],[[240,76],"assets/images/resized/0004/4139/44139v3-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"","firm":{"name":"Mobclix","permalink":"mobclix","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0002/4081/24081v2-max-150x150.png"],[[197,79],"assets/images/resized/0002/4081/24081v2-max-250x250.png"],[[197,79],"assets/images/resized/0002/4081/24081v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}