{"first_name":"Sunny","last_name":"Ahn","permalink":"sunny-ahn","crunchbase_url":"http://www.crunchbase.com/person/sunny-ahn","homepage_url":"http://www.contextconnect.com","birthplace":"Seoul","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Context Connect","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Dec 07 21:34:03 UTC 2011","updated_at":"Thu Dec 08 21:42:01 UTC 2011","overview":"<p>Sunny is a founder of Context Connect and leads the company’s strategic and corporate development activities. Prior to Context Connect, Mr. Ahn co-founded Takeaclass, a database service company focused on providing marketing and procurement services for over 800 educational institutions, which was sold to Mindedge in 2001. Sunny has held senior consulting and marketing positions at GeoPartners Research (sold to Renaissance Worldwide in 1999) and the SAS Institute and was a database analyst within the Internal Medicine Department at the Massachusetts General Hospital.</p>\n\n<p>Sunny holds patents in the areas of directory/connectivity services and serves on the Boards of several technology and telecommunications-related companies. As an industry thought-leader, he frequently appears as a speaker at national and global technology conferences and has testified in front of the US House of Representatives on the topic of privacy and directory services.  Sunny was an academic researcher at the MIT Sloan School of Management and received his Bachelor’s degree (cum laude) from Harvard University.</p>","image":{"available_sizes":[[[103,150],"assets/images/resized/0016/5625/165625v2-max-150x150.jpg"],[[106,153],"assets/images/resized/0016/5625/165625v2-max-250x250.jpg"],[[106,153],"assets/images/resized/0016/5625/165625v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"CEO","firm":{"name":"Context Connect","permalink":"context-connect","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}