{"first_name":"Sunny","last_name":"Sugaya","permalink":"sunny-sugaya","crunchbase_url":"http://www.crunchbase.com/person/sunny-sugaya","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 14 13:40:40 UTC 2008","updated_at":"Sun Nov 16 18:44:04 UTC 2008","overview":"<p>Sunny Sugaya has been head of our business development team and a general partner of JAFCO Ventures since it was formed in 2003. He first joined JAFCO Co., Ltd. in 1999 and has been instrumental in building an organization and network of relationships that distinguish our firm’s ability to bring leading-edge products to the markets in Japan. Sunny’s 17 years of technology and business development experience makes him a remarkable asset to many of our entrepreneurs. Current investments for which he and his business development team have been actively involved include Brion Technologies (acquired by ASML Holdings), Calypto Design Systems, Conformia Software, Devicescape, GTronix, Infinera (INFN), Mimosa Systems, Neterion, Proofpoint, SiTime and Solidcore Systems.</p>\n\n<p>Prior to joining JAFCO, Sunny spent 12 years at Motorola Japan, where he was responsible for design teams building next-generation cell phones and pagers and then oversaw product development and marketing of wireless communication equipment.</p>\n\n<p>Portfolio companies that Sunny has assisted while he was manager of the JAFCO Co., Ltd. business development group include Arkivio, Crescent Networks, Ingrian Networks, Mobilian (Intel), Ocular Networks (Tellabs), Philsar (Conexant) and Trigo Technologies (IBM).</p>\n\n<p>Sunny received a Bachelor of Science degree in computer science and electrical engineering from the National Defense Academy in Japan.</p>","image":{"available_sizes":[[[150,101],"assets/images/resized/0002/8684/28684v1-max-150x150.jpg"],[[163,110],"assets/images/resized/0002/8684/28684v1-max-250x250.jpg"],[[163,110],"assets/images/resized/0002/8684/28684v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Jafco Ventures","permalink":"jafco-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,30],"assets/images/resized/0000/3562/3562v1-max-150x150.png"],[[175,35],"assets/images/resized/0000/3562/3562v1-max-250x250.png"],[[175,35],"assets/images/resized/0000/3562/3562v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}