{"first_name":"Sunwoo","last_name":"Hwang","permalink":"sunwoo-hwang","crunchbase_url":"http://www.crunchbase.com/person/sunwoo-hwang","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Proof Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Sep 13 23:28:30 UTC 2012","updated_at":"Fri Sep 28 22:17:23 UTC 2012","overview":"<p>Sunwoo Hwang is a strategist and entrepreneur with 17 years experience creating, incubating, and operating technology and lifestyle businesses. As Managing Director of Proof Ventures, a Silicon Valley venture firm, Sunwoo specializes in the investment and acceleration of expansion-stage Korean startups seeking growth and exit opportunities via the U.S. market.</p>\n\n<p>Prior to Proof Ventures, Sunwoo ran a consumer web incubator responsible for developing use cases designed to activate music-sports fanaticism with such partners as Adobe, HP and Beats by Dr. Dre. As Co-Founder and Managing Partner of RHS Partners, a hospitality investment group, Sunwoo led the ideation and development of Vessel, a luxury boutique nightclub located in San Francisco’s Union Square district.</p>\n\n<p>While Strategist and early stage EIR at venture incubator, 12 Entrepreneuring, Sunwoo co-founded and led the incubation of Northstar into an enterprise SaaS platform focused on the financial services vertical (later acquired by SEIC). Previously, Sunwoo was an operating executive at GlobalCommerce, a B2B e-commerce software company backed by G.E. Capital, where he led strategic alliances and corporate development initiatives.</p>\n\n<p>Sunwoo started his career at management consultancy, A.T. Kearney, advising such clients as Samsung Electronics on international market entry strategies.</p>\n\n<p>A graduate of Northwestern University, Sunwoo holds black belts in Taekwondo and Judo, and is a former U.S. national Judo champion. He’s also profiled in artist CYJO’s KYOPO Project, a global exhibition featuring 200 full-length portraits of kyopo from across the globe (presently on exhibit at the Smithsonian National Portrait Gallery in Washington D.C.)</p>","image":null,"degrees":[{"degree_type":"B.A.","subject":"Economics","institution":"Northwestern University","graduated_year":1995,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Proof Ventures","permalink":"proof-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,140],"assets/images/resized/0021/1261/211261v2-max-150x150.jpg"],[[241,225],"assets/images/resized/0021/1261/211261v2-max-250x250.jpg"],[[241,225],"assets/images/resized/0021/1261/211261v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/sunwoohwang","title":""},{"external_url":"http://about.me/sunwoohwang","title":""}]}