{"first_name":"Suranga","last_name":"Chandratillake","permalink":"suranga-chandratillake","crunchbase_url":"http://www.crunchbase.com/person/suranga-chandratillake","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"blinkx","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Jul 07 11:21:02 UTC 2007","updated_at":"Thu Jan 13 02:10:43 UTC 2011","overview":"<p>A technology entrepreneur with over a decade of experience in next-generation search, Suranga Chandratillake founded blinkx in 2004 and launched the company in 2005. After early success, Suranga took the company public on the London Stock Exchange in May 2007. Prior to founding blinkx, Suranga was U.S. CTO of Autonomy Corporation, responsible for growing Autonomy&#8217;s research and development division in the United States. Before joining Autonomy, Suranga held a variety of roles in technology, sales and marketing at Morgan Stanley, netdecisions and anondesign. Suranga received his MA in Computer Science from the University of Cambridge.</p>\n\n<p>A highly regarded expert on the convergence of the Web and TV, including the future of television, interactive TV and online advertising, Suranga is often invited to speak at leading industry events including Financial Times&#8217; Digital Media Conference, Cannes Lions International Advertising Festival and Monaco Media Forum. Named a Young Global Leader Honoree in 2009 by the World Economic Forum, Suranga has also been recognized as one of the top 10 leaders in Science and Innovation by The Observer&#8217;s Future 500 list, and one of Digital Media Wire&#8217;s &#8220;25 Executives to Watch in Digital Entertainment&#8221;.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder and CEO","firm":{"name":"blinkx","permalink":"blinkx","type_of_entity":"company","image":{"available_sizes":[[[150,68],"assets/images/resized/0000/2068/2068v3-max-150x150.png"],[[158,72],"assets/images/resized/0000/2068/2068v3-max-250x250.png"],[[158,72],"assets/images/resized/0000/2068/2068v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}