{"first_name":"Suraj","last_name":"Kumar","permalink":"suraj-kumar","crunchbase_url":"http://www.crunchbase.com/person/suraj-kumar","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Jun 23 04:59:59 UTC 2012","updated_at":"Tue Jun 26 04:45:12 UTC 2012","overview":"<p>Suraj Kumar Rajwani is a co-founder and partner of DoubleRock. He has over seven years of management, investment and mergers and acquisitions experience in Silicon Valley, China and India. He was previously the Managing Director of the Global Network Entrepreneurs Network Organization (GENO), an entrepreneur organization with over 27 chapters worldwide. As head of sales and marketing, he grew GENO&#8217;s footprint to over 23 countries and led product expansion into new areas such as enterprise pricing and enterprise incentive management. He has advised on mergers and acquisitions in multiple industries including IT, financial services, real estate, and construction. During his tenure at GENO, he developed the GENO Venture Connect framework which served as a platform for entrepreneurs to meet with potential investors which led to the birth and expansion of many successful enterprises.</p>\n\n<p>His expertise in online branding and marketing has seen him broker internet domain names for global companies such as Salesforce, Yahoo, IBM, RackSpace and many other online brands worth in excess of $50m. He has advised companies on brand positioning online and how to differentiate oneself with premium domains. In this capacity, he has assisted in negotiations for many organizations such as HireCloud, Catch.com, Wireless Inc, Data.com (owned by Salesforce)</p>\n\n<p>Suraj has accumulated invaluable experience in the online media sector and internet sector both in Silicon Valley and in the Greater China region. Over the past three years, Suraj has been providing capital fundraising consulting services to startups such as ShowNearby, Powerset, Cloud9, CloudFlare.</p>\n\n<p>Suraj has also partnered with incubators in China to launch TechChina, an incubator developed to attract the best engineering talent in Beijing and Shenzhen to build China’s future innovative companies. TechChina, which now holds networking events, will be a fully operational incubator by 2012.</p>\n\n<p>He has also been invited as a speaker to many conferences including the World HRD (Human Resource &amp; Development Congress) and the World Entrepreneur Summit by Ernst &amp; Young sharing his views on entrepreneurial leadership in Bahrain and Monte Carlo. He has also coached and advised entrepreneurs through his involvement with the Kauffman Foundation.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0019/6906/196906v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0019/6906/196906v2-max-250x250.jpg"],[[180,271],"assets/images/resized/0019/6906/196906v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[{"description":"Invested in real5d.com","stoned_year":2011,"stoned_month":2,"stoned_day":3,"source_url":"","source_text":null,"source_description":"","stoneable_type":"Person","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"first_name":"Suraj","last_name":"Kumar","permalink":"suraj-kumar"}}],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/doublerock","title":""},{"external_url":"http://www.linkedin.com/in/surajkumarrajwani","title":""}]}