{"first_name":"Suresh","last_name":"Sanadhya","permalink":"suresh-sanadhya","crunchbase_url":"http://www.crunchbase.com/person/suresh-sanadhya","homepage_url":"http://www.airroengineering.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"industrial-filters, industrial-heat-exchangers, ammonia-cracking-units, exo-gas-generators, india, industrial-filters-manufacturers, industrial-heat-exchangers-manufacturers","alias_list":null,"created_at":"Mon May 07 09:28:40 UTC 2012","updated_at":"Wed Aug 15 22:22:57 UTC 2012","overview":"<p>Airro Engineering Company</p>\n\n<p>Incepted in the year 2004, Airro Engineering Company is one of the prominent organizations engaged in manufacturing, supplying and exporting of industrial plants and equipment like industrial filters, industrial heat exchangers, ammonia cracking units, exo gas generators, gas exchangers, gas generators, compressed air / gas drying system, pressure vessels and others. Supported by state-of-the-art manufacturing unit along with in-house quality and research and development department we have been able to offer the equipment that is at par with international standard. We are supported by a dedicated team whose ardent effort helps us in offering qualitative range of industrial process equipment and gas exchangers in stipulated time frame. To augment the expediency of our clients and to optimize the performance of our efficient equipment, we have garnered a wide servicing network across the globe. Creating new benchmarks of brilliance in the industry; we have reached at this position under the supervision of our mentor Mr. J P Sharma. His years of industrial experience in the field of process equipment and others have enabled us to conduct our business operations as per changing need of the clients. </p>\n\n<p>Empowered by the expertise of our competent team of professionals, we are able to offer an exhaustive range of industrial plant and equipment, industrial filters, industrial heat exchangers, ammonia cracking units, exo gas generators and others.</p>\n\n<p>All our range is manufactured at par with various international standards. The entire array has found a wide usage as it address to the requirements across various industries. These are manufactured using steel, motor, pipes and others sourced from reliable vendors.</p>\n\n<p>Quality being our forte, we offer the best quality industrial process equipment, gas exchangers and others to our customers in accordance with their specific requirements. Tested grade of raw material is procured from varied trusted sources and before their final approval; these undergo a stringent quality inspection process. </p>\n\n<p>Telephone:+919979881970)</p>","image":{"available_sizes":[[[125,125],"assets/images/resized/0018/8133/188133v2-max-150x150.jpg"],[[125,125],"assets/images/resized/0018/8133/188133v2-max-250x250.jpg"],[[125,125],"assets/images/resized/0018/8133/188133v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}