{"first_name":"Susan","last_name":"Beausang","permalink":"susan-beausang","crunchbase_url":"http://www.crunchbase.com/person/susan-beausang","homepage_url":"http://www.4women.com","birthplace":"New Jersey, U.S.A.","twitter_username":"thebeaubeau","blog_url":"http://www.4women.com/blog","blog_feed_url":"","affiliation_name":"4Women.com, Inc.","born_year":1948,"born_month":11,"born_day":11,"tag_list":"susan-beausang, 4women-com, the-beaubeau, hair-loss, alopecia, cancer, previvor","alias_list":null,"created_at":"Tue Dec 07 15:45:39 UTC 2010","updated_at":"Wed Dec 08 10:13:22 UTC 2010","overview":"<p>Bald, bold, and beautiful, Susan Beausang is a fierce advocate for women facing drastic appearance changes associated with cancer or other medical conditions.  </p>\n\n<p>As a BRCA2 carrier and &#8220;previvor&#8221; (someone who has had a prophylactic mastectomy and ovaries removed to reduce her risk of developing breast and ovarian cancer) and a woman who suffers with Alopecia Universalis (an autoimmune condition that stripped her of all of her hair), Susan understands the fear, anxiety, depression, embarrassment and emotional assault that women losing their hair during the course of chemotherapy or in the context of other medical conditions feel.  She knows first-hand how isolated women are with their feelings when facing drastic appearance changes.  Susan is blazing a new path of understanding, acceptance, and options for women and girls with medical hair loss.    </p>\n\n<p>Like many, Susan had been searching for that path to her deeper self and to a more meaningful life.  She never could have imagined the events that would ultimately show her that path.  It was hair, or the loss of it, that revealed her greatest passion and strengths and allowed her to connect with women and girls across the world in far deeper and more meaningful ways.  </p>\n\n<p>After completing a degree in Fashion Design, Susan&#8217;s professional path deviated sharply to the world of financial markets, first as a registered representative of various brokerage firms and then as a trader on the floor of the Philadelphia Stock Exchange.  During the same period, she coached the women&#8217;s tennis team at Chestnut Hill College for 8 years, ran competitively, and played competitive golf.  She also completed a second degree in Political Science and graduated summa cum laude from Chestnut Hill College.  </p>\n\n<p>One of 3 generations of breast cancer survivors, Susan&#8217;s life was stopped in its tracks when she discovered that she was a BRCA2 gene carrier.  She was told she had an 85 percent lifetime chance of developing breast cancer.  Rather than wait for her day of diagnosis, she made the bold decision to have a prophylactic mastectomy and oopherectomy.  After a long medical road of surgeries and complications, she was ready to re-begin life as a slightly different version of herself.  Instead, life threw her another curveball, this time in the form of an autoimmune disease called Alopecia Universalis.  Her hair started falling out in handfuls and within 3 short months, she was totally bald, had no eyelashes and no eyebrows and no longer recognized the woman in the mirror.</p>\n\n<p>Not one to take life lying down, Susan did her time in emotional seclusion, cried all the tears she could cry, and eventually made the decision to get back to living.  She just needed a fashionable option to accessorize her bald head.  What she found - torturous wigs, do-rags, baseball caps, slippery head scarves, and disease accessories with horrible names like &#8220;cancer turban&#8221;.  In response, Susan put her Fashion Design education to work and designed her own solution, a head scarf that unites the worlds of fashion and medical head wear.  With strong personal connections to many women who have lost their hair to either Alopecia or cancer treatment, Susan knew she had to share her solution.  The Beaubeau, &#8220;Beautiful Scarves for Beautiful Heads,&#8221; was born and Susan founded her business, 4Women.com, both to make them available to women and girls worldwide and to advocate for deeper understanding of the emotional impacts of medical hair loss in society at large and among the medical professionals that serve women and girls.</p>\n\n<p>Today, Susan Beausang resides with her spouse and two labradoodles in Sarasota, FL.  With five grown sons spread out across the country, she dedicates herself full-time to women in need of emotional support, an advocate, or a fashionable head scarf.  Susan can be reached at 941-361-2408.  Her website is www.4women.com.</p>","image":null,"degrees":[{"degree_type":"","subject":"Fashion Design","institution":"Marymount University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"President","firm":{"name":"4Women.com, Inc.","permalink":"4women-com-inc","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://citypaper.net/articles/2008/02/28/scarf-it-up","title":"Scarf It Up - How a Plymouth Meeting woman lost her hair and reclaimed her confidence"}],"web_presences":[{"external_url":"http://twitter.com/thebeaubeau","title":"thebeaubeau"}]}