{"first_name":"Susan","last_name":"Moon","permalink":"susan-moon","crunchbase_url":"http://www.crunchbase.com/person/susan-moon","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Tabula Digita","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Aug 12 04:38:51 UTC 2008","updated_at":"Thu Apr 30 15:30:42 UTC 2009","overview":"<p>Prior to joining Tabula Digita, Ms. Moon was a Citigroup Senior Vice President in charge of a cross-channel (phone and Internet) team responsible for developing a multi-channel customer interaction model that would enable the correct time, place, and offers to Citi Cards customers. As well, Ms. Moon was the head of the Payment Innovation team, a group which drove the long-term strategy and in-market consumer testing for innovative projects that could generate over $100MM EBIT annually. Under Ms. Moon’s leadership, three projects were launched in market and additional ones are due to market in 2006.</p>\n\n<p>Previously Ms. Moon was a Director of Strategy &amp; Product Management for OnMoney.com, a financial services Internet portal that was a subsidiary of Ameritrade. She defined the vision and strategy and led the development efforts for a number of Internet based applications, such as account aggregation, financial planning and money management products.</p>\n\n<p>Ms. Moon also has extensive experience in strategy consulting having worked in the New York offices of Booz•Allen &amp; Hamilton and PriceWaterhouseCoopers.</p>\n\n<p>Throughout Ms. Moon’s business and education career, she participated and held leadership positions in a number of tutoring programs, including Junior Achievement and The West Philadelphia Tutoring project.</p>\n\n<p>Ms. Moon received her undergraduate degree from The Wharton School of Business and her MBA from Columbia Business School. At both universities, Ms. Moon achieved academic distinctions and leadership positions. She also holds a CPA in the State of New York.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"COO","firm":{"name":"DimensionU (formerly Tabula Digita)","permalink":"tabula-digita","type_of_entity":"company","image":{"available_sizes":[[[150,50],"assets/images/resized/0002/3626/23626v5-max-150x150.jpg"],[[250,83],"assets/images/resized/0002/3626/23626v5-max-250x250.jpg"],[[450,150],"assets/images/resized/0002/3626/23626v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}