{"first_name":"Susan","last_name":"Feldman","permalink":"susan-feldman","crunchbase_url":"http://www.crunchbase.com/person/susan-feldman","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"One Kings Lane","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Thu Sep 16 03:47:22 UTC 2010","updated_at":"Wed Aug 10 18:30:54 UTC 2011","overview":"<p>Susan Feldman is the co-founder and chief merchandising officer of One Kings Lane. In addition to overseeing all buying and merchandising, she travels the world with leading tastemakers to bring exciting and unique products to customers through the company&#8217;s specialized sales. Susan also serves as company spokesperson, appearing on venues such as The Martha Stewart Show to talk about products she loves. </p>\n\n<p>Prior to One Kings Lane, Susan held various senior positions in the apparel industry, including vice president of sales at Polo Jeans and president of sales at Lauren Ralph Lauren Sleepwear. Susan has also held executive positions at Warnaco/Authentic Fitness Corp., Ralph Lauren Swimwear, Liz Claiborne, and Cole of California. </p>\n\n<p>A native New Yorker, she received her MBA from the Anderson School at UCLA and her BA from Stanford University. Susan lives in the Hollywood Hills with her family. She loves to decorate her house with the unique mementos she collects during her travels, and playing with her two yellow labs, Chloe and Maggie (who is One Kings Lane&#8217;s now-iconic canine mascot).</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"One Kings Lane","permalink":"one-kings-lane","type_of_entity":"company","image":{"available_sizes":[[[150,29],"assets/images/resized/0004/0427/40427v1-max-150x150.jpg"],[[250,49],"assets/images/resized/0004/0427/40427v1-max-250x250.jpg"],[[257,51],"assets/images/resized/0004/0427/40427v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}