{"first_name":"Susan","last_name":"Decker","permalink":"susan-decker","crunchbase_url":"http://www.crunchbase.com/person/susan-decker","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 28 21:06:34 UTC 2008","updated_at":"Tue Nov 18 01:43:03 UTC 2008","overview":"<p>As the president of Yahoo Inc., Susan L. Decker is a key participant in determining Yahoo&#8217;s business strategy and vision. She is responsible for all of the global business operations of Yahoo, including sales, product marketing, product, and distribution across the three major customer groups of audience, advertisers and publishers. Prior to that, from December 2006 – June 2007, she served as the head of one Yahoo&#8217;s two major business units, the Advertiser and Publisher Group (APG), where she was instrumental in developing the company&#8217;s recent reorganization plan and strategy to transform how advertisers connect with their target customers on the Internet. Prior to her APG role, Decker was executive vice president and chief financial officer from June 2000 – June 2007, managing all aspects of the company&#8217;s financial and administrative direction within key functional areas, including finance, facilities, investor relations (and human resources and legal through December 2006).</p>\n\n<p>Prior to joining Yahoo in June 2000, Decker was with Donaldson, Lufkin &amp; Jenrette (DLJ) for 14 years. Most recently, she served as the global director of equity research, a $300 million operation, where, among other things, she was responsible for building and staffing a non-U.S. research product based on global sector teams. Before serving as DLJ&#8217;s global and domestic head of research, she spent 12 years as an equity research analyst, providing coverage to institutional investors on more than 30 media, publishing, and advertising stocks. In this capacity, she received recognition by Institutional Investor magazine as a top rated analyst for ten consecutive years.</p>\n\n<p>Decker holds a bachelor of science degree from Tufts University, with a double major in computer science and economics, and a master of business administration degree from Harvard Business School. She also received the designation of Chartered Financial Analyst in 1989 and served on the Financial Accounting Standards Advisory Council (FASAC) for a four-year term, from January 2000 to January 2004. Decker served on the board of directors of Pixar Animation Studios from June 2004 to May 2006, until its sale to Disney and The Stanford Institute for Economic Policy Research (SIEPR) from March 2005 to May 2007. Decker currently serves on the board of directors for Berkshire Hathaway, Intel Corporation and Costco Wholesale.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0001/9581/19581v1-max-150x150.jpg"],[[166,250],"assets/images/resized/0001/9581/19581v1-max-250x250.jpg"],[[300,450],"assets/images/resized/0001/9581/19581v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://yhoo.client.shareholder.com/press/management.cfm\" title=\"Yahoo\" rel=\"nofollow\">Yahoo</a></p>"},"degrees":[{"degree_type":"Bachelor of Science","subject":"Computer Science and Economics","institution":"Tufts University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"Harvard Business School","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"President","firm":{"name":"Yahoo!","permalink":"yahoo","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0001/0836/10836v9-max-150x150.png"],[[226,81],"assets/images/resized/0001/0836/10836v9-max-250x250.png"],[[226,81],"assets/images/resized/0001/0836/10836v9-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}