{"first_name":"Sydney","last_name":"Brenner MD PhD","permalink":"sydney-brenner-md-phd","crunchbase_url":"http://www.crunchbase.com/person/sydney-brenner-md-phd","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 18 15:37:05 UTC 2009","updated_at":"Thu Jun 18 15:37:52 UTC 2009","overview":"<p>Dr Brenner is a Fellow of the Royal Society, a Foreign Associate of the National Academy of Sciences and a recipient of the Albert Lasker Medical Research Award, 1971. He participated in the discovery of messenger RNA and, with Francis Crick, showed that the genetic code was composed of triplets. He is the principal investigator of the massively parallel DNA analysis technologies of Lynx Therapeutics and was a member of the board of directors from 1993 to 2001. </p>\n\n<p>He began his career in the Cavendish Laboratory in Cambridge, and became the Director of its successor, the MRC Laboratory of Molecular Biology, in 1979. He became the Director of the MRC Unit of Molecular Genetics in 1987, retiring in 1992. He is a founder of Combichem, Inc. and served on its Scientific Advisory Board. He founded the Molecular Sciences Institute in Berkley and retired as Director of Research in February 2001. He is now a Distinguished Research Professor of The Salk Institute, La Jolla, California. He was awarded the Nobel Prize in Medicine in 2002 for his pioneering work in genetics and molecular biology. He has received numerous awards and prizes and is a member of several national scientific academies.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"co-founder of Acidophil","firm":{"name":"Acidophil","permalink":"acidophil","type_of_entity":"company","image":{"available_sizes":[[[150,47],"assets/images/resized/0004/9450/49450v1-max-150x150.jpg"],[[250,79],"assets/images/resized/0004/9450/49450v1-max-250x250.jpg"],[[253,80],"assets/images/resized/0004/9450/49450v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}