{"first_name":"Synergy","last_name":"Builders","permalink":"synergy-builders","crunchbase_url":"http://www.crunchbase.com/person/synergy-builders","homepage_url":"http://www.synergyremodel.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"home-improvement-illinois, home-remodeling, home-remodeling-design, remodeling-contractors, home-improvement-contractors, home-improvement-contractor, home-remodeling-company, remodeling-services, home-remodeling-services, kitchen-remodeling, kitchen-remo","alias_list":null,"created_at":"Tue Dec 06 12:12:45 UTC 2011","updated_at":"Thu Dec 08 17:49:21 UTC 2011","overview":"<p>Find professional kitchen remodeling, bathroom remodeling, room addition, basement finishing and home improvement services at Synergy Builders Inc. Call: (630) 293-8070.</p>\n\n<p>Company overview<br/>\nSynergy Builders is a design-build home remodeling company known for inspirational designs and exceptional craftsmanship. We will oversee and execute all aspects of the design as well as the construction of your project. This continuity of service will save you time and money as well as give you an active role in your remodeling project. Rather than using the traditional approach to remodeling, Synergy Builders uses a stress-free process that turns any remodeling project into an enjoyable experience.</p>\n\n<p>As the client, you are a very important member of the design-build team. Your ideas and preferences help with the enhancement of the design process, materials selection, and budget. By conducting research for the best solutions in functionality and elegance we can help you choose the most aesthetically pleasing solution which includes your ideas to make your dream remodeling project come alive.</p>\n\n<p>No matter the project—kitchen &amp; bathroom remodeling, room additions, or basement finishing, our forward thinking staff follows the same fundamental principles of excellence: quality craftsmanship, strong attention to detail, and an absolute commitment to client satisfaction. By always following these principles, we have become the premier choice for home owners in the Chicago area. </p>\n\n<p>Contact Details: \nSynergy Builders\n850 Meadowview Crossing Unit 13\nWest Chicago, Illinois, 60185\nTel: - 630-293-8070\nE-mail: contact@synergyremodel.com \nhttp://www.synergyremodel.com  </p>","image":{"available_sizes":[[[150,34],"assets/images/resized/0016/5380/165380v2-max-150x150.jpg"],[[250,57],"assets/images/resized/0016/5380/165380v2-max-250x250.jpg"],[[306,70],"assets/images/resized/0016/5380/165380v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.synergyremodel.com","title":"Home Remodeling"}]}