{"first_name":"T.","last_name":"Kendall \"Ken\" Hunt","permalink":"t-kendall-ken-hunt","crunchbase_url":"http://www.crunchbase.com/person/t-kendall-ken-hunt","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Nov 24 11:08:02 UTC 2012","updated_at":"Sat Nov 24 11:09:10 UTC 2012","overview":"<p>T. KENDALL “KEN” HUNT—Mr. Hunt is our founder, Chairman of the Board and Chief Executive Officer. Mr. Hunt has served as Chairman of the Board since the Company&#8217;s incorporation in 1997, and currently serves a one-year term. He was our Chief Executive Officer from 1997 through 1999 and returned as CEO in November 2002. He is affiliated with several high-tech early-stage companies, and served as a member of the Board of Directors of Global Med Technologies, Inc. (Nasdaq: glob) from March 2006 until April 2010, and has also been a member of the Advisory Board (which has no decision-making authority) of Victory Park Capital Advisors LLC since June 2007. Mr. Hunt is Chairman of the Midwest Council of TechAmerica (formerly The AeA), the nation&#8217;s largest high-tech trade association, former President of the Belgian Business Club of Chicago, and a member of The Economic Club of Chicago.  He is a member of The President’s Council and on The Board of Overseers for the School of Business at the University of Miami (Florida), his alma mater, and on the Board of Advisors for Northwestern University’s Kellogg School of Business, MMM Program. Additionally, he is on the Advisory Board for the Posse Foundation, an organization dedicated to providing full college scholarships to urban minority youth leaders through its partnerships with elite universities across the U. S. He holds an MBA from Pepperdine University, Malibu, California, and a BBA from the University of Miami, Florida, where he attended on a full football scholarship. Mr. Hunt is 68 years old.</p>","image":{"available_sizes":[[[100,138],"assets/images/resized/0022/1970/221970v1-max-150x150.jpg"],[[100,138],"assets/images/resized/0022/1970/221970v1-max-250x250.jpg"],[[100,138],"assets/images/resized/0022/1970/221970v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"","institution":"Pepperdine University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chairman and Chief Executive Officer","firm":{"name":"Vasco","permalink":"vasco","type_of_entity":"company","image":{"available_sizes":[[[150,30],"assets/images/resized/0021/2934/212934v1-max-150x150.jpg"],[[250,50],"assets/images/resized/0021/2934/212934v1-max-250x250.jpg"],[[307,62],"assets/images/resized/0021/2934/212934v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}