{"first_name":"T.","last_name":"Nathanael Shepherd","permalink":"t-nathanael-shepherd","crunchbase_url":"http://www.crunchbase.com/person/t-nathanael-shepherd","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 08 14:32:25 UTC 2009","updated_at":"Mon Jun 08 14:37:28 UTC 2009","overview":"<p>Nate Shepherd co-founded TSG Equity Partners in 1996. As President of TSG, he is responsible for all operational aspects of TSG in addition to serving on the Investment Committee. Nate has closed and managed investments throughout multiple industries at all stages, including expansion and leveraged buyout. Nate is a current and former Board member of nine companies including The Vermont Teddy Bear Co., Inc., (PIPE) and Katahdin Industries, Inc., (LBO). Nate has also managed several exit opportunities including Andover.net (IPO/merger), Protocol Technologies (merger) and Berkshire Wireless (divestitures).</p>\n\n<p>Prior to co-founding TSG, Nate provided extensive business development, marketing and personnel leadership as Associate Director of PCS, a business development consulting firm serving small and mid-size organizations, and as Director of Development of Perkins, a $17 million 350-staff multi-service program. At Perkins, he served on the senior executive committee leading strategic planning efforts and implementing business expansion initiatives as well as directing marketing, fund raising and human resources. In 1998, he joined the Board of Perkins and currently serves as its President.</p>\n\n<p>Nate earned his MBA in Finance from Clark University&#8217;s Graduate School of Management. Nate also serves on the Board of Directors of the Red Acre Foundation and the Fieldstone Foundation.</p>","image":null,"degrees":[{"degree_type":"MBA","subject":"Finance","institution":"Clark University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Partner","firm":{"name":"TSG Equity Partners","permalink":"tsg-equity-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,60],"assets/images/resized/0004/7371/47371v1-max-150x150.png"],[[250,100],"assets/images/resized/0004/7371/47371v1-max-250x250.png"],[[260,105],"assets/images/resized/0004/7371/47371v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}