{"first_name":"Tallon","last_name":"Hawkins","permalink":"tallon-hawkins","crunchbase_url":"http://www.crunchbase.com/person/tallon-hawkins","homepage_url":"http://www.tallonhawkins.com/","birthplace":"Hobbs N.M.","twitter_username":"tallonh","blog_url":"http://www.facebook.com/tallonhawkins","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1992,"born_month":7,"born_day":18,"tag_list":"tallon, hawkins, tallonhawkins, singer, artist, actor, entertainment, model, dancer, dance-new, aspiring, musician","alias_list":null,"created_at":"Fri Oct 26 19:43:05 UTC 2012","updated_at":"Fri Nov 02 06:59:54 UTC 2012","overview":"<p>Tallon Hawkins - The name Tallon is Hebrew and means God&#8217;s breath. The Hawkins family tree goes back to a guy named Pete Hawkins who was one of the first people to come over on a boat like the Mayflower to the United States of America from England. Hawkins is an English name. Although with that being said, Tallon is a Chickasaw Indian. He was born July 18th 1992 in Hobbs New Mexico. An aspiring artist, he had joined a dance team at the age of four where he learned jazz and hip hop mixed with gymnastics and some martial arts. After the fifth grade, he was home schooled because of the way public schools have become today and so that he could focus more time on the dance. At the age of fifteen, he received the opportunity to travel overseas to China, Hong Kong and the Phillipines with the dance team. There, he was able to give to people and see how they live and was able to teach others as well as learn from them for two months. Going overseas changed his life. Hawkins relocated to Tulsa Oklahoma when he was sixteen. There, he joined another dance group that he currently is apart of learning breakdance, freestyle, and other styles. Hawkins has a love and passion for dance as well as the arts. It seems as though he is always ready and full of joy. He shows love to others around him and encourages others to follow their dreams. He tries to provide assistive direction to his friends on all his topics of influence. To say the least, he is rather intriguing. Yet, if you know him and his heart you will find that he remains teachable, is always asking questions and is a pretty humble guy. He has a few nicknames different groups of his friends made up and call him that are quite hilarious like T-Man, Mr. T, and The Eagle Whisperer. Hawkins says he believes that in today&#8217;s world being normal isn&#8217;t enough. He also says the best way to live is by example for others to follow. He has confidence for a dream that is relatively unusual. Hawkins doesn&#8217;t go with the flow and do what everybody else is doing. He is different, someone memorable and certainly worth getting to know. Hawkins is taking vocal lessons from his mom and Youtube. Part of his aim is to make it successful as a musician. He enjoys songwriting and writing poetry. The genres he truly enjoys singing most are R&amp;B, Pop, and Rap. Other things he loves to do on the side include working out at Gold&#8217;s Gym, parkour, cross fit training, reading books, supplementation and hanging out with friends. He has a job that he is blessed with and loves. On the Weekends he works as a DJ for DJ Connection. Hawkins is a visionary and tries his best to inspire others. He loves to help others work towards reaching their goals and dreams. It is apparent that he has a burning desire, and determination for what he does. He knows his dreams will come true eventually as long as he doesn&#8217;t give up. Hawkins says to take that next step to victory and when you do, never look back. Hawkins says he not only plans on traveling the U.S.A but the whole world. He says he will be going to California, Florida, all around, and inbetween. Hawkins saiys that music is what inspires him most and fuels his passion. He is excited to use his talents to bring an impact to every person he comes in contact with. Like his Facebook page, see his Youtube Channel, or view his Instagram  below by clicking the links. &#8220;Go team Hawkins&#8221;.  </p>","image":{"available_sizes":[[[109,150],"assets/images/resized/0021/7439/217439v2-max-150x150.jpg"],[[182,250],"assets/images/resized/0021/7439/217439v2-max-250x250.jpg"],[[328,450],"assets/images/resized/0021/7439/217439v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.tallonhawkins.com/","title":"Tallon Hawkins"}],"web_presences":[{"external_url":"http://www.tallonhawkins.com/","title":"Tallon Hawkins"}]}