{"first_name":"Tamer","last_name":"Şahin","permalink":"tamer-ahin","crunchbase_url":"http://www.crunchbase.com/person/tamer-ahin","homepage_url":"http://tamersahin.com","birthplace":"Turkey","twitter_username":"tamersahin","blog_url":"http://terramedusa.com/blog","blog_feed_url":"","affiliation_name":"TerraMedusa","born_year":1981,"born_month":null,"born_day":null,"tag_list":"information-security, infosec-consulting, hacker, information-security-professional","alias_list":null,"created_at":"Fri Apr 06 09:10:04 UTC 2012","updated_at":"Wed Apr 11 21:22:41 UTC 2012","overview":"<p>He was born in 1981, İzmir. His interest to computers started when he was 13 years old. Firstly, in 1999 he was accused of hacking the computer systems of Turkey&#8217;s largest internet service provider Superonline. The web site of Superonline was out of service for 7 days.</p>\n\n<p>As a result of this accusation, he has taken place in legal literature by being the first officially judged and sentenced hacker of Turkey. His 1 year and 8 months jail sentence has been postponed without being executed. This event is being studied at lectures and also books of law faculties.</p>\n\n<p>In late of 2001, he was put in court by claim of hacking the Ottoman Bank oldest bank of Turkey, The Osmanlı Bankası. Şahin, who was alleged to leave a message on the website of the Bank, took part in all of thenational print and visual media. The server of the bank was investigated by the authorities who were academics. As they could not find any evidence, he was founded innocent and acquitted.</p>\n\n<p>He entered into the systems of Microsoft Network Operation Center in 2002 and he published personal e-mails of Bill Gates and Steve Ballmer also secret documents about Hotmail and other projects on Internet. In nearly 10 countries, the global sources such as Wired, Slashdot, The Register, ZDnet etc. Made his news about hacking Microsoft.</p>\n\n<p>Sahin spent his time on hacker philosophy and he has emphasized on his own professional business life by being aware of his responsibilities. He used his ability of hacking to reveal the weakness of many computer systems including leading organizations in the private sector and official institutions. He developed defense strategies against these weaknesses. </p>\n\n<p>Tamer Sahin who worked in cooperation with the world famous manufactures such as Microsoft, Novell, HP, AOL to discover the software vulnerabilities, has more than 50 security announcements register in his name. </p>\n\n<p>Almost all media organizations including print and visual media released news about Tamer Sahin. A documentary film was made by Coşkun Aral and his team about Şahin&#8217;s life. His life experience has been handled as projects at Istanbul Technical University, Işık University and American High School. His studies and social reflections of them have been analysed with presentations and documents as lesson scopes.</p>\n\n<p>He was played as &#8220;Hacker Tamer&#8221; plenty of times in Turkish action series such as Kurtlar Vadisi, Deli Yürek. Tamer Şahin wrote columns for the technology magazine T3 and newspaper Star. </p>\n\n<p>He keeps on preparing projects about information security for the leading companies at his own company TerraMedusa.</p>","image":{"available_sizes":[[[150,127],"assets/images/resized/0018/2953/182953v2-max-150x150.png"],[[250,212],"assets/images/resized/0018/2953/182953v2-max-250x250.png"],[[450,383],"assets/images/resized/0018/2953/182953v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"TerraMedusa","permalink":"terramedusa","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://tamersahin.com","title":"Official Page"},{"external_url":"http://terramedusa.com","title":"Corporate Page"},{"external_url":"http://twitter.com/tamersahin","title":"Twitter"}]}