{"first_name":"Tamsen","last_name":"Galloway","permalink":"tamsen-galloway-2","crunchbase_url":"http://www.crunchbase.com/person/tamsen-galloway-2","homepage_url":"http://www.gal-away.com","birthplace":"","twitter_username":"gal_away","blog_url":"http://galaway.wordpress.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"tamsen-galloway, tamsen, gal-away, female-entrepreneurs, ncwit, pdx11, tao, techstart","alias_list":null,"created_at":"Thu Nov 01 19:42:17 UTC 2012","updated_at":"Sun Nov 04 00:46:30 UTC 2012","overview":"<p>Tamsen Galloway is a twenty year contributor to the evolution of high tech.  Building a legacy of thought leadership and innovation, she has applied her technical background and business savvy to a wide span of roles from startups to Fortune 100. She has held positions with world class companies including Anheuser-Busch, IBM, Xerox, and Computer Associates. From her beginnings as a network administrator to the leadership roles that she holds today, Tamsen has had an opportunity to experience all elements of organizations and apply her entrepreneurial spirit to solving problems through creative resource development.  She champions empowerment of women in IT and STEM, and mentors up and coming entrepreneurs through StartupWeekend and other incubator-driven efforts.</p>\n\n<p>At present, Tamsen is the Founder and CEO of Gal-Away.com.  She is a Board Member of the Technology Association of Oregon and the TechStart Foundation.  She also leads the PDX11 Mentor Network, a software industry economic growth effort supported by the Portland Development Commission. She is a respected speaker at many industry and community-focused conferences. </p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0021/8347/218347v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0021/8347/218347v2-max-250x250.jpg"],[[299,450],"assets/images/resized/0021/8347/218347v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}