{"first_name":"Tapan","last_name":"Sheth","permalink":"tapan-sheth","crunchbase_url":"http://www.crunchbase.com/person/tapan-sheth","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Apr 25 10:37:17 UTC 2012","updated_at":"Fri May 04 03:56:40 UTC 2012","overview":"<p>Sheth Enterprise, Ahmedabad</p>\n\n<p>Established in 1992, We Sheth Enterprise take immense pride to introduce ourselves as one of the well known dealers and suppliers of SYNTEL EPABX alongwith GSM Solutions to trade &amp; industry with quality products. We also deal in EPABX System, Time Attendance &amp; Access Control System, GSM Solutions, Vehicle Tracking Solutions, Walkie Talkie and Wireless Communication Telephone/VOIP Phones. We have come a long way in establishing ourselves as one of the leading names in our region. We have experienced significant growth in our networking with our clients spread at large. Our efficiency in business has set benchmarks for our competitors on the lines of quality and finesse. We offer and deal in premium quality products to give our clients excellent services and true value for money.</p>\n\n<p>Products:</p>\n\n<pre><code>Analog EPABX System: We represent different brands of analog EPABX such as SYNTEL from 4 ports to 64 ports. We also deal in Intercom system.\n\nDigital EPABX / KTS System: We represent SYNTEL NEOS &amp;amp; NEC, Japan for Digital EPABX / KTS from 4 ports to 1500 ports. We also have IP PBX of NEC.\n\nCall Centre Solutions: We have different module for Call Centre Solution such as Auto Attendant, CTI, ACD, IVRS, Voice Logger, Voice Mail, Call Logger, etc.\n\nBuilding Intercom System: We deal in Building / Society Intercom System with Security features and Audio/Video Door Phone of SYNTEL, CRYSTAL and NCC. We also have Visitor Management System.\n\nTime Attendance &amp;amp; Access Control System: We deal in Time Attendance and Access Control system using Finger Print and Proximity/Mifare Cards with Time Attendance software.\n</code></pre>\n\n<p>Telephone   :   +(91)-(79)-27683013</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0018/5872/185872v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0018/5872/185872v2-max-250x250.jpg"],[[250,250],"assets/images/resized/0018/5872/185872v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}