{"first_name":"Tara","last_name":"Williams","permalink":"tara-williams","crunchbase_url":"http://www.crunchbase.com/person/tara-williams","homepage_url":"http://www.site.whoistarawilliams.com","birthplace":"Bethesda","twitter_username":"whoistara","blog_url":"http://blog.whoistarawilliams.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1972,"born_month":6,"born_day":26,"tag_list":"social-media, seo, sem, websites, tara-williams, ppc, online-marketing, atlanta, new-business, marketing, empire-avenue, sales, linked-in, facebook, who-is-tara","alias_list":null,"created_at":"Sun Mar 04 04:37:58 UTC 2012","updated_at":"Sat Mar 10 22:52:47 UTC 2012","overview":"<p>Tara Williams Online Marketing, Social Media Expert.\nI have over 15 years of sales and marketing experience. I specialize in online marketing,social media, seo, sem, e-commerce, branding and advertising. Working with businesses all over the nation in various industries. I am a master networker and have developed solid businesses relationships all over the world.</p>\n\n<p>I have been recognized for my many accomplishments throughout my career for being a top producer. And have an amazing client base that has continued to work with me for many years. I under promise and over deliver for my clients. I enjoy working with clients to evaluate their current and future goals to help them through a comprehensive advertising plan, I design specifically for them to help them achieve their goals.</p>\n\n<p>In addition, I have been involved in the real estate industry for over 12 years and have a solid background in the mortgage industry as a Mortgage Broker. I developed many solid relationships in the real estate industry.</p>\n\n<p>I have a great mix of clients in different industries. Entertainment, Retail,Insurance, Law, Real Estate, Collections, Automotive are the industries that I have worked with the most. But I have the ability through my wide range of products to work with any industry starting from a mid size to a large corporation.\nSpecialties</p>\n\n<p>Advertising Sales,Internet Marketing, Branding,New Business Sales, Marketing, Contract Negotiation,Account Management, Networking, Social Media, SEO, SEM, PPC (Pay Per Click), Online PR,Online and Offline Marketing, Entertainment, Retail, Real Estate, Mortgage Broker,Real Estate Consulting.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.vayumedia.com","title":"Vayumedia"},{"external_url":"http://www.whoistarawilliams.com","title":"Who Is Tara?"},{"external_url":"http://www.xeeme.com/whoistara","title":"Tara Williams World"},{"external_url":"http://www.twitter.com/whoistara","title":"Twitter"}]}