{"first_name":"Taranjit","last_name":"Singh","permalink":"taranjit-singh","crunchbase_url":"http://www.crunchbase.com/person/taranjit-singh","homepage_url":"http://www.inopixel.com","birthplace":"","twitter_username":"inopixel","blog_url":"http://www.inopixel.com/blog/","blog_feed_url":"http://www.inopixel.com/feed/","affiliation_name":"Unaffiliated","born_year":1985,"born_month":5,"born_day":28,"tag_list":"search-engine-optimization, web-design-and-development, search-engine-marketing, wordpress-cms-development, joomla-cms-development, drupal-cms-development, logo-designing, web-designing","alias_list":null,"created_at":"Mon Dec 26 06:03:48 UTC 2011","updated_at":"Tue Dec 27 08:38:24 UTC 2011","overview":"<p>Inopixel is a professional services company founded on a heritage of sound strategic thinking, intuitive creativity and astute technical perception. The Inopixel’s Team plans, builds and markets successful business ideas for today’s economy.</p>\n\n<p>Our aim is to help you increase your profitability and cost effectiveness through our accumulated expertise. We keep ourselves abreast of the latest technologies to cater to the varied needs of our clients. You get result oriented solutions that are built around your business goals, economic budget and time frame.</p>\n\n<p>Quality is our forte, and that’s why, our web design and development efforts constantly exceed the norms that our clients expect from us. Due to our high commitment levels, high degree of competence, and strict adherence to quality norms, we have been able to build an impressive list of clients around the world.</p>\n\n<p>Services provided</p>\n\n<p>Inopixel is a full service firm that provides comprehensive services in web designing and development. Using advanced tools and the latest web technologies, we provide web designing, custom web designing, web 2.0 design, and flash header and intro design. We are proficient in proprietary software as well as open source technologies to provide a wide variety of web development solutions. Our web programming skills in ASP.NET, PHP and Ajax are second to none.</p>\n\n<p>Besides, we offer open source customization using leading technologies such as Joomla CMS, osCommerce, Drupal, Magento, Zen Cart, Dot Net Nuke and PHP BB. We also provide cutting edge ecommerce solutions such as payment gateway integration and shopping cart features. Our related services consist of Search Engine Optimization and Internet Marketing to help you connect to the right audience and achieve higher search engine rankings.</p>\n\n<p>Advantages with us</p>\n\n<p>Inopixel is certainly the web design and development company of choice if you are seeking premium quality technical expertise at affordable costs. Inopixel offers the right mix of technical skills and business acumen to deliver results in tune with your business model. There are several advantages of assigning your project requirements with us:</p>\n\n<p>Low costs coupled with cutting-edge expertise\nStrict application of high quality standards Latest technology with dedicated and sophisticated infrastructure Effective communication and follow up on all project aspects 100 % client satisfaction</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0016/7663/167663v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0016/7663/167663v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0016/7663/167663v2-max-450x450.jpg"]],"attribution":"<p>San Antonio Web Design, Web Site Development, Search Engine Optimization</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.inopixel.com/about-us/","title":"About Inopixel"},{"external_url":"http://www.inopixel.com/","title":"Web Design Company"}],"web_presences":[]}