{"first_name":"Taylor","last_name":"Hwang","permalink":"taylor-hwang","crunchbase_url":"http://www.crunchbase.com/person/taylor-hwang","homepage_url":"http://www.proofventures.com","birthplace":"Seoul, South Korea","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Proof Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"proof-ventures, frog, emifinancial, scient, the-atlantic-group, booz-allen, accenture, the-university-of-texas-at-austin","alias_list":"","created_at":"Thu Sep 13 23:28:30 UTC 2012","updated_at":"Thu Sep 27 02:18:09 UTC 2012","overview":"<p>Taylor Hwang is a venture investor, operating executive, and entrepreneur with 20 years experience building new businesses and business units.  As Managing Director of Proof Ventures, a Silicon Valley venture firm, Taylor specializes in the investment and acceleration of expansion-stage Korean startups seeking growth and exit opportunities via the U.S. market. </p>\n\n<p>Prior to Proof Ventures, Taylor served as Country Manager for global innovation firm, frog design, heading up operations in Korea and Singapore.  Taylor was also Founder &amp; CEO of EmiFinancial, which in partnership with MasterCard Worldwide created the first stored value card for the consumer financial services industry.  Taylor successfully merged EmiFinancial with TFG Card Solutions. </p>\n\n<p>Taylor’s experience stems back to the first dot-com bubble, where he was Head of Strategy for Scient, the period’s largest Internet consulting firm.  Shifting into venture, he later served as President for Mark Pincus’ TankHill Ventures, heading up the fund’s media &amp; entertainment portfolio.</p>\n\n<p>Taylor started his career with Accenture and Booz Allen &amp; Hamilton, where he was part of the team responsible for creating the first-ever global Intranet. </p>\n\n<p>A graduate of University of Texas at Houston with a BBA, Taylor is advisor to Ajia Partners, YesAsia, and the University of Texas Business Honors Program. </p>","image":null,"degrees":[{"degree_type":"BBA","subject":"Business Administration, Finance","institution":"The University of Texas at Austin","graduated_year":1990,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Proof Ventures","permalink":"proof-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,140],"assets/images/resized/0021/1261/211261v2-max-150x150.jpg"],[[241,225],"assets/images/resized/0021/1261/211261v2-max-250x250.jpg"],[[241,225],"assets/images/resized/0021/1261/211261v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}