{"first_name":"Taylor","last_name":"Stephens","permalink":"taylor-stephens","crunchbase_url":"http://www.crunchbase.com/person/taylor-stephens","homepage_url":"http://dnrenterprises.com","birthplace":"Redwood City, CA","twitter_username":"","blog_url":"http://dnrenterprises.com","blog_feed_url":"http://dnrenterprises.com","affiliation_name":"Unaffiliated","born_year":1983,"born_month":6,"born_day":21,"tag_list":"orange-county-seo, orange-county-sem, website-implementation","alias_list":null,"created_at":"Tue Jun 08 21:25:02 UTC 2010","updated_at":"Thu Jun 10 18:50:10 UTC 2010","overview":"<p>Taylor is a managing partner in DNR Enterprises and is responsible for much of the SEM, SEO account management and maintaining DNR Enterprises&#8217; many web properties.</p>\n\n<p>DNR Enterprises is a website holding/ consulting company incorporated in Nevada and operating out of Newport Beach California. Our business model focuses on three core competencies: </p>\n\n<p>-Expanding our website portfolio,  growing each websites relevance/traffic and selling advertising.</p>\n\n<p>-Niche consulting specializing in website  SEM, SEO, design and implementation</p>\n\n<p>-Website Design /Development </p>\n\n<p>Our unique position as a website owner/operator coupled with consulting and implementation arms gives us the perspective and capability to  understand your needs and offer a wide array of custom solutions. Give us a  budget and an objective and we will work with you to achieve your companys goals!</p>\n\n<p>The consulting arm of DNR Enterprises branches off to a full service implementation company as the active implementation of the consultative process. Not only can we consult and recommend courses of action, we are aligned with many foreign and domestic programmers &amp; developers. Our resources can complete anything from simple implementation to large scale Content Management Systems (CMS). Our expertise covers the gambit of all of your website needs, give us a budget and an objective and we will work with you to achieve your goal.</p>","image":null,"degrees":[{"degree_type":"Bachelor of Science in Business Administration ","subject":"Entrepreneurship","institution":"University of Southern California (USC)","graduated_year":2005,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}