{"first_name":"Ted","last_name":"Hope","permalink":"ted-hope","crunchbase_url":"http://www.crunchbase.com/person/ted-hope","homepage_url":"","birthplace":"","twitter_username":"tedhope","blog_url":"http://www.Hopeforfilm.com","blog_feed_url":"","affiliation_name":"This is That Corporation","born_year":1962,"born_month":9,"born_day":30,"tag_list":"","alias_list":null,"created_at":"Thu Jul 19 12:37:00 UTC 2012","updated_at":"Thu Jul 19 19:28:02 UTC 2012","overview":"<p>Ted Hope is an American Independent Film Producer based in New York City.</p>\n\n<p>In the early 90&#8217;s, American Independent Film burst on the media scene with the promise of new visions, new stories, and new approaches. Ted Hope was among the first producers to emerge from the pack and remains one of the few consistently delivering vital and exciting new work. As times, platforms, and tastes change, Ted&#8217;s work continues to break new ground, reach new audiences, and define the term &#8220;Independent.&#8221;</p>\n\n<p>A survey of Hope&#8217;s films-numbering close to seventy-includes many highlights of the last two decades. As generative as he is with movies, Ted is no less so in business; Ted co-founded and ran the 90&#8217;s production &amp; sales powerhouse Good Machine, which he and his partners sold to Universal in 2002. Good Machine was honored by a retrospective at the Museum Of Modern Art in 2001. Hope subsequently co-founded the New York production company This is that with his former assistant Anthony Bregman and Anne Carey, whom Hope met on his first day at NYU Film School. In its eight years, This is that produced nineteen features, receiving numerous awards, including four Academy Award Best Screenplay nominations. Most recently, he founded Double Hope with his wife, filmmaker Vanessa Hope.</p>\n\n<p>Hope is one of the film industry’s leading social media voices, posting regularly on his HopeForFilm blog. He also co-founded HammerToNail.com, a film review site focused on Truly Independent Film. Hope curates a monthly screening series at the Film Society Of Lincoln Center, and he will be launching an app this summer, designed to improve film’s business and culture. For all of this and more, Hope has been recognized as one of the most influential people in Independent Film. </p>\n\n<p>Ted’s next film will be Ti West’s THE SIDE EFFECT, starring Liv Tyler, and shooting this fall. Ted produced DARK HORSE, his third collaboration with Todd Solondz, which premiered at the Venice &amp; Toronto Film Festivals. Like he did with HAPPINESS, he is also producing it’s distribution this summer. Also in theaters and on VOD this summer will be the 2011 Karlovy Vary International Film Festival FIPRESCI Prize winner, COLLABORATOR, written and directed by Martin Donovan and starring Donovan, David Morse and Olivia Williams, and executive produced by Ted. He executive produced Sean Baker’s STARLET, which premiered in competition at SXSW, and Music Box will release this fall.  Among his other recent productions are the Directing Award winner at the 2011 Sundance Film Festival MARTHA MARCY MAY MARLENE, written and directed by Sean Durkin and starring Elizabeth Olsen, Hugh Dancy, and John Hawkes. With COLLABORATOR and MARTHA MARCY MAY MARLENE, Hope now has twenty “first features” to his credit, including those of Alan Ball, Todd Field, Michel Gondry, Hal Hartley, Nicole Holofcener, Ang Lee, and Bob Pulcini &amp; Shari Berman, among others. </p>\n\n<p>Hope has received numerous awards and honors. In 2009, he was the recipient of the Vision Award from the LA Filmmakers&#8217; Alliance, as well as the Woodstock Film Festival&#8217;s Trailblazer Award. His films have received some of the industry&#8217;s most prestigious honors: THE SAVAGES (2007) earned two Academy Award nominations; 21 GRAMS (2003), two Academy Award nominations and five BAFTA nominations; and IN THE BEDROOM (2001), five Academy Award nominations. Ted holds a record at Sundance: three of his twenty-three Sundance entries (AMERICAN SPLENDOR (2003), THE BROTHERS MCMULLEN (1995), and WHAT HAPPENED WAS &#8230; (1994)) have won the Grand Jury Prize; no producer has won more. Two of his films, AMERICAN SPLENDOR (2003), and HAPPINESS (1998), have won the Critics Prize at the Cannes International Film Festival. </p>\n\n<p>Hope consults and lectures throughout the world, including at the Forbes Global CEO Conference and as the Keynote Speaker at both the Power To The Pixel trans-media conference in London and Sundance’s Art House Convergence. Many film festival juries, including Sundance, SXSW, and Karlovy Vary have enjoyed Ted&#8217;s participation. He has appeared on A&amp;E, CCTV 7 (China), CNN, Fox News, NPR, Sundance Channel, and numerous other media outlets.  Additionally, Ted is a board member of the IFP and serves on the advisory boards of the Adrienne Shelly Foundation, The Film Collaborative, Power to the Pixel, and the Woodstock Film Festival. Ted teaches &#8220;The Future Of Film&#8221; at NYU Graduate Film School, in conjunction with the think tank he helped found there, The Cinema Research Institute.</p>\n\n<p>Hope lives in New York City with his wife and son.</p>","image":{"available_sizes":[[[134,150],"assets/images/resized/0020/1873/201873v2-max-150x150.jpg"],[[224,250],"assets/images/resized/0020/1873/201873v2-max-250x250.jpg"],[[404,450],"assets/images/resized/0020/1873/201873v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelor Of The Arts","subject":"Film","institution":"Tisch School of the Arts, New York Univeristy","graduated_year":1985,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chair & Cofounder","firm":{"name":"Crowd Play","permalink":"crowd-play","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0022/1340/221340v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0022/1340/221340v2-max-250x250.jpg"],[[450,450],"assets/images/resized/0022/1340/221340v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Co-Founder, Partner, Producer","firm":{"name":"Double Hope Films","permalink":"double-hope-films","type_of_entity":"company","image":null}},{"is_past":false,"title":"Co-founder","firm":{"name":"Crowd-play, LLC","permalink":"crowd-play-llc","type_of_entity":"company","image":null}},{"is_past":true,"title":"Co-Founder, Partner, Producer","firm":{"name":"This is That Corporation","permalink":"this-is-that-corporation","type_of_entity":"company","image":null}},{"is_past":true,"title":"Co-Founder, Partner, Producer","firm":{"name":"Good Machine","permalink":"good-machine","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://www.facebook.com/tedhope.fanpage","title":"Facebook Fan Page"},{"external_url":"http://twitter.com/TedHope/","title":"Twitter"},{"external_url":"http://www.linkedin.com/in/tedhope","title":"Linked In"}]}