{"first_name":"Ted","last_name":"Stourton","permalink":"ted-stourton","crunchbase_url":"http://www.crunchbase.com/person/ted-stourton","homepage_url":"http://www.tedstourton.co.uk","birthplace":"United Kingdom","twitter_username":"","blog_url":"http://tedstourtonart.wordpress.com/","blog_feed_url":"","affiliation_name":"Camelot Castle Hotel","born_year":null,"born_month":null,"born_day":null,"tag_list":"ted-stourton, art, camelot-castle-hotel, painter, john-mappin, irina-mappin","alias_list":null,"created_at":"Tue Oct 16 07:56:11 UTC 2012","updated_at":"Mon Oct 22 16:42:15 UTC 2012","overview":"<p>Internationally acclaimed painter, Ted Stourton is based out of the well-known Camelot Castle Hotel in Cornwall, England which he co-owns with John and Irina Mappin. Loved by anyone who appreciates natural beauty, art and relaxation, Camelot Castle is the birthplace of King Arthur. Ted Stourton together with the Mappins has created an inspiring and unique artistic project at Camelot Castle in order to assist artists worldwide. Any artist that feels that it would be beneficial to their inspiration and creativity is eligible to apply for the “Artist in Residence” Programme. It is run at the owners’ discretion and has helped over 500 artists to establish their careers. This is one of the most exciting and innovative projects to influence the creative community in many years. The purpose of such a programme is to create a safe space to validate the artist’s creativity as artists are a valuable asset to any culture. The Camelot Castle Hotel has always been favoured by artists and celebrities alike as they seem compelled to visit this inspiring and diverse location.  The Mappins and Ted Stourton believe that it takes an enormous amount of courage to be an artist in this current climate and environment.</p>\n\n<p>Ted Stourton whose work can be seen on the walls of the Castle, is a brand in his own right, he has become so popular that art collectors rate him as having an enormous influence on the contemporary art world, so much so that they are advising art lovers and collectors to increase their portfolios of his work. Camelot Castle promises an aesthetic treat to all who visit. Collectors are welcome to meet Ted at his studio at the Camelot Castle Hotel to view his works. He has created a magical experience at Camelot Castle called the Light Box. It is a highly original, multi-media creation and those who have seen it describe it as an uplifting, spiritually invigorating experience. Ted has produced many works of art in various different mediums and his work had become increasingly sought after by art collectors. Many of his creations adorn the walls of the rich and famous. His paintings have been likened to the works of famous contemporary artists like Picasso. He is very good at what he does and his work is increasingly in demand.  </p>\n\n<p>Fame has not affected Ted’s enthusiasm and passion for helping aspiring artists to discover their fulfilment and artistic creativity; he is sincere and generous and has often borne the brunt of cynics because of this. According to leading art investors in the contemporary art world, controversy can play a role in enhancing an investment in an artist’s work.  During the career of an artist, the manifestation of such controversy may influence the timing of investments. Picasso, Jackson Pollack, Dali, Monet, Andy Warhol are just a few of the famous artists that had controversial backgrounds. Luckily none of the controversy seems to have phased Ted at all as he continues to produce fabulous, sought after works of art.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0021/5734/215734v2-max-150x150.jpg"],[[200,250],"assets/images/resized/0021/5734/215734v2-max-250x250.jpg"],[[201,251],"assets/images/resized/0021/5734/215734v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Co-Owner","firm":{"name":"Camelot Castle Hotel","permalink":"camelot-castle-hotel","type_of_entity":"company","image":{"available_sizes":[[[106,150],"assets/images/resized/0021/5736/215736v2-max-150x150.jpg"],[[177,250],"assets/images/resized/0021/5736/215736v2-max-250x250.jpg"],[[200,282],"assets/images/resized/0021/5736/215736v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"https://sites.google.com/site/tedstourtonfansite/","title":"Ted's Fan Site"}],"web_presences":[{"external_url":"http://www.tedstourton.net","title":"Wiki Page"},{"external_url":"http://www.visualcv.com/tedstourton","title":"Online Resume"},{"external_url":"http://ted-stourton.tumblr.com/","title":"Tumblr"},{"external_url":"http://www.camelotcastlehotel.biz","title":"Camelot Castle Hotel"}]}