{"first_name":"Ted","last_name":"Philip","permalink":"ted-philip","crunchbase_url":"http://www.crunchbase.com/person/ted-philip","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jun 11 20:36:51 UTC 2008","updated_at":"Tue May 19 09:50:49 UTC 2009","overview":"<p>Ted is a Managing General Partner of the Highland Consumer Fund focusing on consumer goods and services. Ted has twenty years of experience as an entrepreneur, operating executive, board member and investor in many consumer-facing product and service businesses. His experience includes industry leading consumer businesses such as Lycos, The Walt Disney Company, Hasbro, Bombardier Recreational Products and Specialized Bicycles. Ted represents the Highland Consumer Fund on the boards of Castor &amp; Pollux Pet Works, City Sports, O Beverages and Pacific Pathway.</p>\n\n<p>Background\nPrior to joining Highland, Ted co-founded Decision Matrix Group (DMG), along with Highland General Partner Tom Guilfoile, as an investment vehicle in the Information Services research and consulting space. In May 2004 DMG bought the Yankee Group, one of the world’s leading networking and communications research firms. Over a period of 18 months, Ted and his team revamped the Yankee Group business to significantly improve its strategic direction and operating performance. DMG/Yankee Group was successfully sold in November 2005.</p>\n\n<p>Prior to DMG, Ted was one of the founding members of Lycos, serving at various times as the President, COO and CFO. Ted helped take Lycos from a start-up venture with less than $2 million in funding to an international public company, with operations in 42 countries. Through a growth-oriented management style and strong fiscal discipline, Ted helped grow Lycos into one of the premier internet companies with millions of visitors per day. Under Ted&#8217;s leadership, Lycos released dozens of innovative products and services, acquired and integrated 14 companies, created six major international joint ventures with partners that included Bertelsmann, Sumitomo, Bell Canada and Singapore Telecom, and grew the company from start-up to over 3,000 employees. Lycos was sold to Terra Networks (a subsidiary of Telefonica) in 2000.</p>\n\n<p>Before Lycos, Ted spent nearly five years at The Walt Disney Company, where his most recent role was Vice President of Finance. While at Disney, Ted was involved in the acquisitions of Capital Cities/ABC, Miramax Pictures and The Mighty Ducks hockey franchise. Ted was also involved with the roll-out of The Disney Stores, new theme parks at Walt Disney World, the ramp-up of Disney&#8217;s film and video business, and raising $1.5 billion in film financing and $14 billion in bank financing. Prior to Disney, Ted was an investment banker at Salomon Brothers and Morgan Stanley.</p>","image":{"available_sizes":[[[127,104],"assets/images/resized/0004/4605/44605v1-max-150x150.jpg"],[[127,104],"assets/images/resized/0004/4605/44605v1-max-250x250.jpg"],[[127,104],"assets/images/resized/0004/4605/44605v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.S.","subject":"","institution":"Vanderbilt University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"M.B.A.","subject":"","institution":"Harvard Business School","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing General Partner - Highland Consumer Fund","firm":{"name":"Highland Capital Partners","permalink":"highland-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,50],"assets/images/resized/0001/0992/10992v5-max-150x150.jpg"],[[200,67],"assets/images/resized/0001/0992/10992v5-max-250x250.jpg"],[[200,67],"assets/images/resized/0001/0992/10992v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}