{"first_name":"Teni","last_name":"Sow","permalink":"teni-sow","crunchbase_url":"http://www.crunchbase.com/person/teni-sow","homepage_url":"http://www.tambamedia.com","birthplace":"","twitter_username":"tenisow","blog_url":"http://www.youngrss.com","blog_feed_url":"http://www.youngrss.com/feed","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"online-marketing, digital-media, lead-generation, data-management, email-marketing, social-media-marketing, display-advertisement","alias_list":null,"created_at":"Mon Mar 05 12:08:04 UTC 2012","updated_at":"Sun Mar 11 09:31:39 UTC 2012","overview":"<p>Tamba Media is your performance based ad network, Lead Generation and SEO company</p>\n\n<p>In today&#8217;s highly competitive media landscape differentiating your website and media sales offerings is critical to maximizing revenue. Increasingly, advertisers are demanding highly targeted audiences and advertising environments across their premium media buys. Tamba Media allows you to better meet this challenge by extending your most valuable audiences across your website or network. By using Tamba Grab® Publishers, you can identify site visitors who have previously expressed interest in specific content areas and reach them elsewhere on your site. This allows you to maximize the value of previously undifferentiated inventory, significantly boosting advertising rates.</p>\n\n<p>Advertisers can target and purchase only the inventory that meets your campaign goals - there&#8217;s no need to buy unwanted impressions. Modify campaigns in real time based on performance criteria or to take advantage of event-based bidding.</p>\n\n<p>Use Tamba Goal® to get details on individual sites that interest you. Enter any site to view information such as its traffic, demographics, categories, sites also visited, keywords searched for and advertising details. If the site meets the requirements of a media buy, you can add it directly to a media plan.</p>","image":{"available_sizes":[[[136,150],"assets/images/resized/0017/7021/177021v2-max-150x150.jpg"],[[185,204],"assets/images/resized/0017/7021/177021v2-max-250x250.jpg"],[[185,204],"assets/images/resized/0017/7021/177021v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}