{"first_name":"Terence","last_name":"Graunke","permalink":"terence-graunke","crunchbase_url":"http://www.crunchbase.com/person/terence-graunke","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon May 18 13:31:26 UTC 2009","updated_at":"Mon May 18 13:32:10 UTC 2009","overview":"<p>Terry Graunke brings more than 25 years of experience in starting, building, operating, and investing in companies, including evaluating and executing acquisitions, mergers, and exits.  Prior to forming Lake Capital, Terry was the founder and chief executive of both publicly-traded and private companies.  As an investor, his approach joins operational know-how with financial expertise and resources, resulting in a unique ability to partner with management teams to build successful enterprises that create significant shareholder value.</p>\n\n<p>In 1998, Terry and Paul Yovovich founded Lake Capital.  From 1998 until raising Lake Capital I in 2002, they made four investments, committing more than $400 million in a variety of services enterprises.</p>\n\n<p>From 1994 to 1998, Terry successfully invested more than $100 million of his own and investors&#8217; capital in businesses focused on information technology training, interactive development, and marketing services.  From 1992 to 1994, Terry was a partner in the Hawthorne Group, a Pittsburgh-based investment firm, where he focused on both investments in and exits of a portfolio consisting primarily of media companies, both traditional and new media.  Prior to his involvement with Hawthorne, Terry spent more than ten years as an operating executive leading companies in the marketing communications industry.</p>\n\n<p>Terry serves on the boards of Lake Capital&#8217;s investments along with a variety of community activities.</p>","image":{"available_sizes":[[[119,150],"assets/images/resized/0004/4437/44437v1-max-150x150.jpg"],[[136,171],"assets/images/resized/0004/4437/44437v1-max-250x250.jpg"],[[136,171],"assets/images/resized/0004/4437/44437v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chairman, Principal and Co-Founder","firm":{"name":"Lake Capital","permalink":"lake-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,60],"assets/images/resized/0004/4435/44435v1-max-150x150.jpg"],[[171,69],"assets/images/resized/0004/4435/44435v1-max-250x250.jpg"],[[171,69],"assets/images/resized/0004/4435/44435v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}