{"first_name":"Teresa","last_name":"Engelhard","permalink":"teresa-engelhard","crunchbase_url":"http://www.crunchbase.com/person/teresa-engelhard","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri May 29 18:53:36 UTC 2009","updated_at":"Fri May 29 18:55:30 UTC 2009","overview":"<p>Teresa Engelhard is a Managing Partner at Jolimont Capital, which she joined in 2006 to focus on growth-stage technology companies. Teresa has over ten years of experience in venture capital and executive management positions in the technology industry, mostly in the U.S. Prior to joining Jolimont Capital, her executive positions at technology companies in California included Vice President of Marketing and Business Development at Xponent Photonics (acquired by Hoya International), Vice President Software Solutions at ONI Systems (Nasdaq ONIS acquired by Ciena - Nasdaq CIEN) and CEO of Timeshift (acquired by J2 Communications - Nasdaq JCOM).</p>\n\n<p>Teresa was also a Principal at Mohr, Davidow Ventures in Menlo Park, California in the late 90&#8217;s where she helped lead the firm&#8217;s investment strategy into communications and photonics technologies. She started her career as a management consultant at McKinsey &amp; Company in the U.S. where she served clients in the media, retail and energy sectors.</p>\n\n<p>Teresa is currently either a Director or active participant on the Boards of Directors at Daintree Networks, Redfern Integrated Optics, Redfern Optical Components and Redfern Polymer Optics.</p>\n\n<p>Teresa has a B.S. with Honors from the California Institute of Technology (Caltech) in Pasadena, California, U.S.A and a Masters of Business Administration (MBA) from Stanford University in Palo Alto, California, U.S.A.</p>","image":{"available_sizes":[[[102,98],"assets/images/resized/0004/5962/45962v1-max-150x150.jpg"],[[102,98],"assets/images/resized/0004/5962/45962v1-max-250x250.jpg"],[[102,98],"assets/images/resized/0004/5962/45962v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Partner","firm":{"name":"Jolimont Capital","permalink":"jolimont-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,31],"assets/images/resized/0004/5959/45959v1-max-150x150.jpg"],[[179,38],"assets/images/resized/0004/5959/45959v1-max-250x250.jpg"],[[179,38],"assets/images/resized/0004/5959/45959v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}