{"first_name":"Terry","last_name":"Dillon","permalink":"terry-dillon","crunchbase_url":"http://www.crunchbase.com/person/terry-dillon","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Jul 01 04:08:21 UTC 2009","updated_at":"Wed Jul 01 04:09:09 UTC 2009","overview":"<p>Mr. Dillon has more than thirty-five years experience in the field of telecommunications, security, and network design and has an in-depth, well-rounded expertise in all aspects of business management. He has served in all levels of the Wire-line and Wireless Telecom Business from Operations, Branch Management, Regional Vice President, and President/COO to Chairman/CEO. He is intimately familiar with operating budgets and financials; as well as, business planning and execution, including turn-around. In addition he has served in senior positions in both the Vendor and Operator venues.</p>\n\n<p>Mr. Dillon was the first employee of Boston Technology whose Patented Voice Mail Delivery technology revolutionized the telecommunications industry. Mr. Dillon performed the hardware design for the COACCESS product, and then sold the product to five Regional Bell operating companies, and multiple international Telecommunications firms. Terry has designed, proposed, and sold first of Telecommunications projects to major telephone companies world wide. He has built several profitable businesses and operated and managed several multi-million dollar budgets. Terry has been published in Telephony Magazine, the US Trade magazine for the Telephone Industry, and has been quoted in multiple publications on new industry technologies and their potentials. In addition, Mr. Dillon is the inventor of the three technology patents pending for Gridline Communications Holdings, Inc.</p>\n\n<p>Terry studied at Lamar University and Northeastern Oklahoma State University. He is a member of the Boy Scouts of America Heritage Foundation and a member of the United Way Alexis DeTocqueville Society.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President, CEO/CTO","firm":{"name":"Gridline Communications","permalink":"gridline-communications","type_of_entity":"company","image":{"available_sizes":[[[150,141],"assets/images/resized/0004/6429/46429v2-max-150x150.jpg"],[[250,235],"assets/images/resized/0004/6429/46429v2-max-250x250.jpg"],[[382,360],"assets/images/resized/0004/6429/46429v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}