{"first_name":"Terri","last_name":"Fiez","permalink":"terri-fiez","crunchbase_url":"http://www.crunchbase.com/person/terri-fiez","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue May 19 08:39:21 UTC 2009","updated_at":"Tue May 19 08:40:24 UTC 2009","overview":"<p>Terri S. Fiez received the B.S. and M.S. in Electrical Engineering in 1984 and 1985, respectively, from the University of Idaho, Moscow. In 1990, she received the Ph.D. degree in Electrical and Computer Engineering from Oregon State University, Corvallis.</p>\n\n<p>In 1990, she joined Washington State University, Pullman, as an Assistant Professor, where she became an Associate Professor in 1996. In fall 1999, she joined the Department of Electrical and Computer Engineering, Oregon State University, as Professor and Department Head. She became Director of the School of Electrical Engineering and Computer Science, Oregon State, in 2003. Her research interests are in the design of high-performance analog signal processing building blocks, simulation and modeling of substrate coupling effects in mixed-signal integrated circuits, and innovative engineering education approaches.</p>\n\n<p>Dr. Fiez is an Institute of Electrical and Electronics Engineering (IEEE) Fellow and in involved in a variety of IEEE activities including serving on the committees for the IEEE International Solid-State Circuits Conference, the IEEE Custom Integrated Circuits Conference, and the International Symposium on Circuits and Systems (ISCAS), and as a Guest Editor of the IEEE JOURNAL OF SOLID-STATE CIRCUITS. She was previously awarded the National Science Foundation (NSF) Young Investigator Award and the Solid-State Circuit Predoctoral Fellowship.</p>","image":{"available_sizes":[[[109,150],"assets/images/resized/0004/4578/44578v1-max-150x150.png"],[[145,199],"assets/images/resized/0004/4578/44578v1-max-250x250.png"],[[145,199],"assets/images/resized/0004/4578/44578v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Wi-Chi","permalink":"wi-chi","type_of_entity":"company","image":{"available_sizes":[[[133,40],"assets/images/resized/0004/4577/44577v1-max-150x150.png"],[[133,40],"assets/images/resized/0004/4577/44577v1-max-250x250.png"],[[133,40],"assets/images/resized/0004/4577/44577v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}