{"first_name":"Terry","last_name":"Cross","permalink":"terry-cross-2","crunchbase_url":"http://www.crunchbase.com/person/terry-cross-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri May 23 00:26:57 UTC 2008","updated_at":"Fri May 23 00:35:23 UTC 2008","overview":"<p>Terry Cross is a consultant to early-stage companies in business strategy and capital structure and formation. Through his company, Windward Associates, LLC, he has assisted in raising over $ 100 mil. Prior to founding Windward in 2002, he spent 7 years in the machine tool industry followed by 28 years in the securities industry at Kidder, Peabody &amp; Co. in Detroit, New York City, and San Francisco where he spent 13 years covering Silicon Valley tech companies and VC firms. In 1999, he co-founded and was Chairman and CEO of Sonoma Photonics of Santa Rosa, CA. where he raised $11.0 million of initial capital. Terry began early-stage private investing in 1962, and has invested in 44 early-stage companies including Napster, PayPal, Novel, DSC Communications, Warehouse Club, Inktomi, Machine Vision, and Google. Terry is a member of the board of directors for Great Lakes Angels, a founding member of The Michigan Venture Capital Association, Chairman of MIST Innovations of Detroit, MI., and a director of RealKidz of Ypsilanti, MI and Municipal Financial Securities Corporation of Grosse Pointe MI, MI. He currently serves as a consultant to several Michigan companies</p>","image":{"available_sizes":[[[114,150],"assets/images/resized/0001/9207/19207v1-max-150x150.jpg"],[[145,190],"assets/images/resized/0001/9207/19207v1-max-250x250.jpg"],[[145,190],"assets/images/resized/0001/9207/19207v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.urturn.com/portal/default/team\" title=\"UrTurn\" rel=\"nofollow\">UrTurn</a></p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}