{"first_name":"Terry","last_name":"Sacka","permalink":"terry-sacka","crunchbase_url":"http://www.crunchbase.com/person/terry-sacka","homepage_url":"http://www.cornerstoneassetmetals.com","birthplace":"Detroit, Michigan","twitter_username":"cammetals","blog_url":"http://www.terrysacka.com/blog","blog_feed_url":"http://www.cornerstoneassetmetals.com/blog/feed/","affiliation_name":"Cornerstone Asset Metals","born_year":null,"born_month":null,"born_day":null,"tag_list":"terry-sacka, cornerstone-asset-metals, gold, silver, platinum, palladium, precious-metals, buying, investments, investing, economy","alias_list":null,"created_at":"Tue May 29 03:47:30 UTC 2012","updated_at":"Thu Aug 23 17:11:28 UTC 2012","overview":"<p>Terry Sacka, AAMS is an Accredited Asset Management Specialist at Cornerstone Asset Metals. Terry established Cornerstone Asset Metals to help guide investors who wish to protect their hard earn assets and hedge against inflation by investing in hard assets - precious metals such as gold, silver, platinum and palladium. </p>\n\n<p>Terry Sacka created Cornerstone Asset Metals specifically for individuals who want the option to be in the physical metals market and control the level of risk they take. He specializes in helping investors diversify a portion of their portfolio into hard assets such as gold, silver, platinum, and palladium with advanced investment strategies designed to maximize returns through the purchase of physical precious metals.</p>\n\n<p>Terry has been quoted in Investor&#8217;s Business Daily, Americas trusted financial news source, during key events on matters of the precious metals market for his expertise in both the gold and silver markets. Terry has been quoted notably for his remarkably accurate insight on price targets in the silver market outlining reasons for the rise of the spot price of silver being “This is an important industrial metal and has become the ‘people’s choice’ for hard-asset protection and wealth preservation,” he continued. “The price is right, reasonable for all people and poised to increase over time, helping the average person save for retirement and protect against the coming onslaught of inflation the U.S. will see.” </p>\n\n<p>Terry was able to discern when the bullion banks were covering their short positions in the United States as the heat was coming through the U.S. Commodity Futures Trading Commission to accurately describe the effort to trade down the market so the banks could buy back at lower levels consequently leading to a run in the price of gold and silver. </p>\n\n<p>His company website, CornerstoneAssetMetals.com, is home to the reputable private bullion dealer that enables anyone with a Cornerstone Asset Metals account to have instant buying power, enabling them to enter or exit the precious metals investments market whenever the individual feels the time is right.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0019/2159/192159v2-max-150x150.jpg"],[[213,213],"assets/images/resized/0019/2159/192159v2-max-250x250.jpg"],[[213,213],"assets/images/resized/0019/2159/192159v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Chief Strategist, AAMS","firm":{"name":"Cornerstone Asset Metals","permalink":"cornerstone-asset-metals","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://news.investors.com/article/570044/201104251743/silver-etf-surges-to-new-high.htm","title":"Investors.com (Investors Business Daily)"},{"external_url":"http://www.blogs.investors.com/capitalhill/index.php/home/35-politicsinvesting/2346-gold-experts-explain-why-bullion-dollar-etfs-falling-together-","title":"Investors.com (Investors Business Daily)"},{"external_url":"http://www.blogs.investors.com/capitalhill/index.php/home/35-politicsinvesting/2451-50-silver-metals-strategist-says-yes","title":"Investors.com (Investors Business Daily)"}],"web_presences":[{"external_url":"https://twitter.com/#!/cammetals","title":"Twitter.com"},{"external_url":"http://ezinearticles.com/?expert=Terry_Sacka","title":"Ezine Expert Author"},{"external_url":"https://profiles.google.com/105031462297233676363/about","title":"Google Profile"}]}