{"first_name":"Terrence","last_name":"Brown","permalink":"terrence-brown","crunchbase_url":"http://www.crunchbase.com/person/terrence-brown","homepage_url":"http://www.terrencebrown.net","birthplace":"District of Columbia","twitter_username":"terrence_brown","blog_url":"http://www.terrencebrown.net","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"entrerpreneurship, startup, creating-value, lean-startup, ict, bootstrap, dos-and-donts","alias_list":null,"created_at":"Thu Jun 03 07:30:35 UTC 2010","updated_at":"Mon Aug 16 14:43:22 UTC 2010","overview":"<p>Dr. Brown is a writer, researcher, consultant, entrepreneur and lecturer on creating value. Dr. Brown is also the former Dean of the Stockholm School of Entrepreneurship and an Associate Professor in Entrepreneurship and Innovation at the Royal Institute of Technology. Additionally he was the Program Director for the ICT Entrepreneurship Masters Program at KTH as well as a Program Director for the prestigious Scandinavian International Management Institute (SIMI). Dr. Brown is the founder of Cogeneration.se, the next step in new venture creation, Startup Academy, an offline/online institution providing content and education to entrepreneurs and new venture investors and growthstrategies, a growth agency that specializes in helping to grow companies by creating and developing uncommon opportunities.</p>\n\n<p>He was the past Director of Research for the Association of the Electronic Auction Industry and Director of Research for The net.America Foundation, a think tank focusing on the New Economy, eCommerce and eLearning.</p>\n\n<p>In 1997 Dr. Brown received the National Federation of Business Dissertation Award. This award, given by the Entrepreneurship Division of the Academy of Management, recognises the best dissertation presented in a given year.</p>\n\n<p>He holds an MBA in Entrepreneurial Management from the Wharton School of the University of Pennsylvania, an MBA in Organizational Management and a Doctorate in Entrepreneurship and Corporate Strategy from Rutgers University.</p>\n\n<p>Dr. Brown has previously served a two year engagement in Sweden as a Visiting Professor of Entrepreneurship and the Co-Director of a major research project on firm growth for Jönköping International Business School, Sweden. He has published in various academic journals. He has also lectured throughout North America, Europe, Asia and Africa.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0008/9388/89388v2-max-150x150.jpg"],[[200,200],"assets/images/resized/0008/9388/89388v2-max-250x250.jpg"],[[200,200],"assets/images/resized/0008/9388/89388v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"PhD","subject":"Entrepreneurship & Strategy","institution":"Rutger Graduate School of Management","graduated_year":1996,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"Entrepreneurship and Speculative Markets","institution":"The Wharon School","graduated_year":1986,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder/Chief Opportunist","firm":{"name":"Cogeneration","permalink":"cogeneration","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}