{"first_name":"The","last_name":"Media3","permalink":"the-media3","crunchbase_url":"http://www.crunchbase.com/person/the-media3","homepage_url":"http://www.themedia3.com","birthplace":"Visakhapatam","twitter_username":"TheMedia3","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1987,"born_month":9,"born_day":3,"tag_list":"media3-advertising-company, professional-website-company, best-web-design, visakhapatnam-company, vizag, creative-team, design-studio, website-design, website-development, software-development, multimedia-courses-training, drawing-painting, graphic-design","alias_list":null,"created_at":"Mon Jul 09 10:37:55 UTC 2012","updated_at":"Mon Jul 09 16:08:34 UTC 2012","overview":"<p>Media3 is a creative website design studio in Visakahaptnam specializing in graphic design, website design &amp; development, publishing, printing and SEO services. Since its inception in 2003, Media3 Website &amp; Interactive studio has been creating industry leading Print, Website and Interactive multimedia solutions that perfectly blend form and function. Our Visakhapatnam website design studio creates and implements online marketing strategies that deliver proven results to our clients.</p>\n\n<p>The team at Media3 website studio has over 7 years of experience, combined, in Coporate branding, Print, Website design development and SEO solutions. We bring an open-minded approach to your business, whatever your location.We’ve helped countless businesses from around the globe start their businesses online. Contact us any time to see how we can be of service for your print and web requirements.</p>","image":{"available_sizes":[[[150,94],"assets/images/resized/0019/9584/199584v2-max-150x150.jpg"],[[250,158],"assets/images/resized/0019/9584/199584v2-max-250x250.jpg"],[[450,284],"assets/images/resized/0019/9584/199584v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}