{"first_name":"The-product","last_name":".co.uk","permalink":"the-product-co-uk","crunchbase_url":"http://www.crunchbase.com/person/the-product-co-uk","homepage_url":"http://www.the-product.co.uk","birthplace":"United Kingdom","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1986,"born_month":3,"born_day":3,"tag_list":"bedroom, dining-room, living-room, garden-furniture--more-","alias_list":null,"created_at":"Sun Aug 26 11:40:05 UTC 2012","updated_at":"Thu Aug 30 11:17:46 UTC 2012","overview":"<p>Online furniture store</p>\n\n<p>What we believe\nWe think the high street and expensive designer brands give consumers a raw deal. That&#8217;s because everyone along the way takes a cut, from agents to landlords. And you - our discerning customer - pay for that cut. So we&#8217;re making a stand: taking on the high street to offer you original furniture design at affordable prices. Here&#8217;s how we do it differently:</p>\n\n<p>SAVE UP TO 70%\n DIRECT FROM THE MAKERS\nNo warehouses. No fancy showrooms. No middlemen. We&#8217;re just a passionate team bringing a new way to buy furniture: cutting out the fuss so you can get beautifully made pieces at a price to suit you.</p>\n\n<p>GROUPING ORDERS\nEvery 7 days, we combine all the orders for a piece and put them into production. By only manufacturing what&#8217;s been ordered, we reduce our costs. And pass the savings onto you.</p>\n\n<p>UNCOMPROMISED QUALITY\nWe work with fresh design talent to create our unique furniture collection. And then we find the best craftsmen to build it - often the same people who make products for top high street brands.\nPEACE OF MIND\n DELIVERY\nOur furniture is made to order, so it can take a little longer to arrive than a &#8216;high street&#8217; buy. It&#8217;s a trade-off - but we believe the quality of the design, the beautiful build and the unbeatable price are worth the wait.</p>\n\n<p>REAL TIME TRACKING\nYou can keep an eye on your order every step of the way - while it&#8217;s being made, and while it&#8217;s being shipped. And if anything changes, we&#8217;ll be in touch.</p>\n\n<p>FUSS-FREE RETURNS\nWe&#8217;re sure you will like it, but if not, you can return it to us within seven days of delivery for a refund. Simply contact us with a brief explanation, and we&#8217;ll arrange for it to be collected by our delivery partners. You should read our terms and conditions for more information on returns &amp; refunds.\nPEOPLE WHO BELIEVE IN US\nWe&#8217;re backed by a number of visionary investors and entrepreneurs who believe in us, so we hope you will too.</p>\n\n<p>BRENT HOBERMAN\nFounder of MyDeco and Lastminute.com, board director of the Guardian Media Group.</p>\n\n<p>MARC SIMONCINI\nFounder of iFrance and Meetic, the leading online dating business which floated on the Paris stock market with a market capitalisation of 500M€.</p>\n\n<p>JOHN HUNT\nFounder of the Seattle Coffee Company (sold to StarBucks), Syzygy (e-business consultancy floated on the German stock exchange) and Obongo (acquired by AOL Time Warner).</p>\n\n<p>PROFOUNDERS CAPITAL\nA London-based venture capital fund powered by some of the most successful UK entrepreneurs.</p>","image":{"available_sizes":[[[150,54],"assets/images/resized/0020/8209/208209v2-max-150x150.png"],[[250,90],"assets/images/resized/0020/8209/208209v2-max-250x250.png"],[[286,104],"assets/images/resized/0020/8209/208209v2-max-450x450.png"]],"attribution":"<p>Furniture Retail</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}