{"first_name":"Thomas Marcus","last_name":"George","permalink":"thomas-marcus-george","crunchbase_url":"http://www.crunchbase.com/person/thomas-marcus-george","homepage_url":"http://www.virtuosohaven.org","birthplace":"Mumbai","twitter_username":"AdSpiRatiOn","blog_url":"http://mindmasters101.info","blog_feed_url":"http://soitis4u.posterous.com/rss.xml","affiliation_name":"SO IT IS 4U Motion Picture Production","born_year":1977,"born_month":6,"born_day":1,"tag_list":"thomas-marcus-george, so-it-is-4u, founder--ceo, director, producer, writer, editor, cinematographer, philanthropist, motion-picture, films, movies, commercials, advertising, innovation, shows, television","alias_list":null,"created_at":"Wed Jan 26 07:33:48 UTC 2011","updated_at":"Fri Sep 14 09:39:18 UTC 2012","overview":"<p>Born and raised in Mumbai, India—Thomas Marcus George (TMG) has been exposed early on to a multi-cultural education, exposing him to the startling differences and similarities in the Western and Eastern paradigms.</p>\n\n<p>A multifaceted artist and storyteller, Thomas is devoted to an evolutionary exploration of human inconsistencies orchestrated in perfect harmony by an unexplained divine genius. The challenges posed by the disconnect of human intellect and the timeless infinite forms the canvas of TMG&#8217;s artistic expression of this ever emerging image of our collective consciousness.</p>\n\n<p>A Physics graduate, trained in cinematography and direction at Prague Film School, Thomas has explored storytelling via his short films that have played at numerous festivals including Tribecca Film Festival and has won honors at Schnidt and Syracuse.</p>\n\n<p>Since 1997 he has worked with the finest and largest media, advertising, and film agencies in India: Times of India, Reliance Communications, Vinod Chopra Films, Ogilvy &amp; Mather; to name a few.</p>\n\n<p>At the early age of 23 he was promoted as Creative Supervisor at Ogilvy Interactive and has since been responsible in forming and mentoring some of the most successful creative teams in the country across advertising, design, and film.</p>\n\n<p>During 2006-2009, Thomas made numerous visits to the United States of America researching and developing, &#8220;Broken Horses&#8221; an English language feature film to be directed by Indian film veteran and producer par excellence, Vinod Chopra.\nIn this period TMG also continued to play an important role in the development and marketing of three of the producer&#8217;s films—two of which went on to become the all-time highest grossing films in Indian film history.</p>\n\n<p>Using his 15+ years of successful multi-cultural, international and extensive experience, Thomas offers consultation to businesses, film productions, and brands in developing a strong and thriving future.</p>\n\n<p>Since late 2009, Thomas has been involved with the development of a slate of international feature films set to repeat his record breaking feat globally, only this time, under his own production banner.</p>\n\n<p><strong><em></strong><strong></em></strong><strong><em>_ † _</strong><strong></em></strong><strong><em></strong></em>_</p>\n\n<p>Photography, Films &amp; Philanthropy [Sideshow &gt;]:</p>\n\n<p>What happens in a child&#8217;s life between ages 0-6 defines the person they will become for the rest of their lives&#8230;   A fortunate few enjoy a complete life because of the early care and nurture they&#8217;ve received from their environment and family—a large majority of the children in the world are exposed to uninformed parenting and ill suited environments; the product of which is a life whiled away in trivialities of survival and emotional delinquency.</p>\n\n<p> I am a filmmaker and an artist living just my dream—making a contribution to our planet so as to provide more and more children with the most loving and nurturing environment, so their souls can bloom to achieve its highest potential. I call this state—Full Bloom Power.</p>\n\n<p>When in this state, I believe, we can truly live as the work of God—and every thought, word, action and influence we thus share with the world becomes a divine gift.  I have committed my life to become the hands that facilitate and deliver the prayers and dreams of children all over the world (great souls with infinite potential)—through my films and my shows this is the one message I wish to communicate and inspire in people: Do with what you have, wonders that help bring to life a world that is a creation of God in its purest state—Heaven on Earth. It does not have to be a far fetched idealistic or utopian dream; if only we believe we can, we will.</p>\n\n<p>Believe!  </p>\n\n<p>www.virtuosohaven.org</p>","image":null,"degrees":[{"degree_type":"Bachelors","subject":"Physics","institution":"University of Mumbai","graduated_year":1997,"graduated_month":null,"graduated_day":null},{"degree_type":"Diploma","subject":"Direction, Cinematography","institution":"Prague Film School","graduated_year":2005,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President & CEO","firm":{"name":"Infinite Hues","permalink":"infinite-hues","type_of_entity":"company","image":null}},{"is_past":false,"title":"Founder & CEO","firm":{"name":"SO IT IS 4U Motion Picture Production","permalink":"so-it-is-4u-motion-picture-production","type_of_entity":"company","image":null}},{"is_past":false,"title":"Executive Director","firm":{"name":"Soccer Lama LLC","permalink":"soccer-lama-llc","type_of_entity":"company","image":null}},{"is_past":false,"title":"Founder","firm":{"name":"Mindspeak","permalink":"mindspeak","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.mindmasters101.info","title":"Mind Masters 101"}],"web_presences":[{"external_url":"http://twitter.com/AdSpiRatiOn","title":"@AdSpiRatiOn"},{"external_url":"http://www.linkedin.com/in/thomasmarcusgeorge","title":"Linkedin"},{"external_url":"http://www.flickr.com/photos/thomasmarcusgeorge/show/","title":"Flickr"},{"external_url":"http://www.soitis4u.com","title":"Behance"}]}