{"first_name":"Thomas","last_name":"Rosser","permalink":"thomas-rosser","crunchbase_url":"http://www.crunchbase.com/person/thomas-rosser","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun May 27 10:17:28 UTC 2012","updated_at":"Thu Jun 07 10:14:09 UTC 2012","overview":"<p>Tom Rosser has built a distinguished career in the field of software and hardware technology innovation and invention over the past 29 years. Graduating from the Control Data Institute with a Diploma in Systems Programming (Supercomputers) in 1973, Mr. Rosser went on to design and program large-scale mainframe computer systems in banking, aerospace, telecommunication and defence.</p>\n\n<p>In 1987 he was awarded PC World’s Person of the Year, he founded his own technology development firm in the USA that same year. This firm specialized in building transactional database and encrypted messaging systems for large banks and telecommunications carriers in North America. In 2000, another of his software inventions (Deluxenumbers), won the prestigious Microsoft/Channel 9 Best Internet Business Software Product of the Year Award.</p>\n\n<p>Since that time he has developed a series of new products for mobile phones. These have included biometric authentication systems for people to secure access to their phones, centrally-authenticated crypto &amp; dynamic key systems to assist carriers to secure their public 3G phone (data transmission) networks, and using phones to build new low-cost EKG heart machines. Some of these mobile systems have been applied in the field since 2002 in diverse areas ranging from child-protection to acute-care trauma and coronary care hospital wards.</p>\n\n<p>His technologies have been donated to various United Nations and NGO crisis projects around the world.  These have included the Asian Tsunami assisting Indonesian and Australian doctors to triage and perform emergency surgery on survivors in an ad hoc field hospital in Aceh province. Then in the first week of September 2005, a complete lifeMEDIC Clinical Portal™ server system was deployed in a datacenter in Pittsburgh to provide US Army Reserve doctors and Citizens Emergency Response Teams of doctors and paramedics in Texas with rapid medical triage, wound care &amp; vital signs monitoring for Hurricane Katrina victims arriving in the west Texas area.</p>","image":null,"degrees":[],"relationships":[],"investments":[{"funding_round":{"round_code":"seed","source_url":"","source_description":"","raised_amount":500000,"raised_currency_code":"USD","funded_year":2008,"funded_month":5,"funded_day":1,"company":{"name":"Ecogii Energy Labs","permalink":"ecogii-energy-labs","image":{"available_sizes":[[[150,107],"assets/images/resized/0019/1988/191988v2-max-150x150.jpg"],[[242,174],"assets/images/resized/0019/1988/191988v2-max-250x250.jpg"],[[242,174],"assets/images/resized/0019/1988/191988v2-max-450x450.jpg"]],"attribution":null}}}}],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}