{"first_name":"Thomas","last_name":"G. Kamp","permalink":"thomas-g-kamp","crunchbase_url":"http://www.crunchbase.com/person/thomas-g-kamp","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Aug 15 10:17:31 UTC 2012","updated_at":"Wed Aug 15 10:21:20 UTC 2012","overview":"<p>Thomas G. Kamp joined Cornerstone in February 2006 after thirteen years with Alliance Capital Management. As Cornerstone&#8217;s Chief Investment Officer, Tom leads the research team, is a member of the Investment Policy Committee and is responsible for all portfolio management decisions. At Alliance Capital Management, he was a Senior Vice President and Portfolio Manager within the Large Capitalization Growth Equity Group. He managed the Minneapolis office of Alliance and by December 2005, had responsibility for over $9 billion in assets including the AllianceBernstein Large Cap Growth Fund, the Alliance Premier Institutional Fund, the ACM Global Investments – American Growth Portfolio (Luxembourg based), the ACM Funds, Inc. – American Growth Fund (UK based), and the Alliance American Premier Growth Fund (Japan based). He was also responsible for over $5 billion of assets from public and private institutions and high net worth individuals around the world. Prior to joining Alliance Capital in 1993, Tom evaluated and participated in funding emerging companies for IAI Venture Capital Group. Tom also founded and successfully sold Premier Computer Corporation, the world&#8217;s largest computer disk drive remanufacturing organization and an outgrowth of a business plan formulated while at Northwestern&#8217;s Kellogg Graduate School of Management. He earned an MBA with a specialization in Accounting from Northwestern University and a BSME with a minor in Applied Mathematics from Southern Methodist University. He is an occasional lecturer on strategic approaches to financial management to investment industry audiences across the country. </p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0020/6163/206163v1-max-150x150.jpg"],[[232,232],"assets/images/resized/0020/6163/206163v1-max-250x250.jpg"],[[232,232],"assets/images/resized/0020/6163/206163v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"","institution":"Northwestern University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President, Chief Investment Officer","firm":{"name":"Cornerstone Capital","permalink":"cornerstonecapital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,37],"assets/images/resized/0008/8733/88733v1-max-150x150.jpg"],[[224,56],"assets/images/resized/0008/8733/88733v1-max-250x250.jpg"],[[224,56],"assets/images/resized/0008/8733/88733v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}