{"first_name":"Thomas","last_name":"Reinemer","permalink":"thomas-reinemer","crunchbase_url":"http://www.crunchbase.com/person/thomas-reinemer","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"ubmatrix","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Nov 04 18:55:33 UTC 2008","updated_at":"Tue Nov 04 20:54:29 UTC 2008","overview":"<p>Thomas joins UBmatrix from Oracle Corporation, where he played a leading role in developing Oracle&#8217;s Collaboration Suite business. As their Senior Director of Global Sales Support, He was responsible for the Sales Management in EMEA and Latin America. Prior to Oracle, Thomas was one of the founding members of E-Stamp&#8217;s Executive Management team. As a key member of the executive team, he played a crucial role in all aspects of developing the company, including operations, strategic business development, fund raising, marketing, sales, product development and the successful IPO of the company. Prior to E-Stamp he was Senior Director at Oracle, where he played a key role in developing and implementing Oracle&#8217;s partner strategy. Thomas has held various management positions at Microsoft, Novell in Germany, as well as a range of technical positions at Intergraph Inc. of Germany and Phillips Medical Systems in The Netherlands. Thomas holds a degree in Electronic Processing and an advanced degree in Industrial Electronic Processing Equipment from the Friedrich Ebert Technical College in Wiesbaden, Germany.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"EVP Business Development","firm":{"name":"UBmatrix","permalink":"ubmatrix","type_of_entity":"company","image":{"available_sizes":[[[150,53],"assets/images/resized/0002/3999/23999v2-max-150x150.png"],[[168,60],"assets/images/resized/0002/3999/23999v2-max-250x250.png"],[[168,60],"assets/images/resized/0002/3999/23999v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}