{"first_name":"Thomas","last_name":"Gewecke","permalink":"thomas-gewecke","crunchbase_url":"http://www.crunchbase.com/person/thomas-gewecke","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Warner Bros.","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 14 03:27:06 UTC 2009","updated_at":"Wed Jan 14 03:30:27 UTC 2009","overview":"<p>Thomas Gewecke was named President, Warner Bros. Digital Distribution (WBDD) in December 2007.  In this post, he works to extend Warner Bros. Home Entertainment Group’s digital strategy and reach across current and emerging platforms.  Charged with global responsibility for the strategic growth initiatives around all of the Warner Bros. Home Entertainment Group’s assets, he also leads development and execution of activities in the wireless, online, transactional video-on-demand (VOD)/pay-per-view (PPV) and electronic-sell-through (EST) sectors.  He is further responsible for identifying strategic partnerships and next generation distribution channels to open new revenue streams.</p>\n\n<p>Prior to joining WBDD, Gewecke most recently served as Executive Vice President, Global Digital Business for Sony BMG Music Entertainment, where he headed worldwide digital business development efforts and oversaw the creation of new digital ventures. Gewecke also oversaw that company’s online advertising, digital long-form video, and direct-to-consumer commerce businesses, and led its expansion into the US off-deck mobile market.</p>\n\n<p>Prior to Sony BMG, Gewecke was Senior Vice President of Business Development in the Digital Services Group for Sony Music Entertainment, Inc. While at Sony Music he founded and led its mobile business, building a dominant market position for the company; launching the industry’s first US master ringtone offering in mid 2003; and becoming the only record label to create and operate a major US on-deck direct-to-consumer mobile storefront.</p>\n\n<p>Gewecke also held the position of Publisher of the PC World Online Network at International Data Group (IDG).  During his tenure with the company, he built IDG’s largest online publishing division and oversaw the launch of multiple internet properties.  He also played a major role in the development of IDG’s overall digital strategy.</p>\n\n<p>Gewecke graduated from Harvard College in 1991 with a bachelor’s degree, magna cum laude, in social studies. </p>","image":{"available_sizes":[[[94,140],"assets/images/resized/0003/3763/33763v1-max-150x150.jpg"],[[94,140],"assets/images/resized/0003/3763/33763v1-max-250x250.jpg"],[[94,140],"assets/images/resized/0003/3763/33763v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.mobilemarketingforum.com/?q=node/253\" title=\"Mobile Marketing Forum\" rel=\"nofollow\">Mobile Marketing Forum</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"President, Digital Distribution","firm":{"name":"Warner Bros.","permalink":"warner-bros","type_of_entity":"company","image":{"available_sizes":[[[150,147],"assets/images/resized/0002/3089/23089v2-max-150x150.jpg"],[[250,245],"assets/images/resized/0002/3089/23089v2-max-250x250.jpg"],[[350,343],"assets/images/resized/0002/3089/23089v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}