{"first_name":"Thomas","last_name":"Crampton","permalink":"thomas-crampton","crunchbase_url":"http://www.crunchbase.com/person/thomas-crampton","homepage_url":"http://www.thomascrampton.com","birthplace":"","twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Feb 14 02:44:07 UTC 2008","updated_at":"Thu Jan 29 23:37:14 UTC 2009","overview":"<p>Thomas Crampton worked as a correspondent for the International Herald Tribune and The New York Times for more than a decade, reporting from five continents, writing a column on Asia and covering Asian politics, economics and culture.</p>\n\n<p>Currently based out of China, he is working with the founder of a major media company on entrepreneurial ventures. All views expressed on this blog are entirely personal.</p>\n\n<p>Mr. Crampton has served as president of The Foreign Correspondents&#8217; Club of Hong Kong, president of The Foreign Correspondents&#8217; Club of Thailand and on the board of the New York-based Overseas Press Club.</p>\n\n<p>In addition to citations from Amnesty International for his articles and photography, Mr. Crampton has served as a judge for numerous journalism awards and worked to promote freedom of expression and the training of journalists.</p>\n\n<p>He is co-founder of the Foreign Correspondents&#8217; Club Charity Fund that has raised more than $1 million in four years to support the higher education of disadvantaged children from the Po Leung Kuk. Check out our amazing scholarship winners here!</p>\n\n<p>Mr. Crampton was educated in the United States at the University of Virginia, in Ireland at Trinity College, Dublin and in France at the Institut d&#8217;Etudes Politiques de Paris. He speaks English, French, Thai and is learning Mandarin Chinese.</p>","image":{"available_sizes":[[[150,110],"assets/images/resized/0003/5282/35282v1-max-150x150.jpg"],[[240,176],"assets/images/resized/0003/5282/35282v1-max-250x250.jpg"],[[240,176],"assets/images/resized/0003/5282/35282v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}