{"first_name":"Thomas","last_name":"Pyczak","permalink":"thomas-pyczak","crunchbase_url":"http://www.crunchbase.com/person/thomas-pyczak","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jan 29 23:38:11 UTC 2009","updated_at":"Thu Jan 29 23:38:11 UTC 2009","overview":"<p>Thomas Pyczak is the managing director of CHIP Communications, a Hubert Burda Media Company. Parallel to this, the qualified journalist is the chief editor of CHIP magazine. For ten years Pyczak has been accompanying the development of the digital world with CHIP, and has pointed out the important trends and technologies and makes clear how we can take advantage of them In an optimal way for ourselves. With his team he has developed a number of new products under the chip brand, the last one being the Green CHIP, which looks at digital technology from an ecological perspective. Since 2006 Pyczak has also been responsible for the international management of the CHIP brand; the magazine Is published in 15 countries.</p>\n\n<p>In December last year Pyczak and his team launched ZEHN.DE in collaboration with Lovely Systems - the first big German website to opt for Cloud Computing for all important areas. As much of the data relating to this project is being offloaded to the Amazon Cloud, the application itself has been realized for Google AppEngine.\nJust like the print label CHIP, ZEHN.DE addresses a predominantly male audience - but with a significantly broader theme spectrum: With its expert-lists, the website guides you not only through the digital world but also through seven further &#8220;male-categories&#8221; including motor, travel and sports.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0003/5283/35283v1-max-150x150.jpg"],[[166,250],"assets/images/resized/0003/5283/35283v1-max-250x250.jpg"],[[240,360],"assets/images/resized/0003/5283/35283v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}