{"first_name":"Thomas","last_name":"Monath","permalink":"thomas-monath","crunchbase_url":"http://www.crunchbase.com/person/thomas-monath","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 28 17:13:45 UTC 2008","updated_at":"Thu May 29 00:12:20 UTC 2008","overview":"<p>Dr. Monath is a Partner, Pandemic and Biodefense Fund, Kleiner Perkins Caufield &amp; Byers. He is also Adjunct Professor, Harvard School of Public Health. Between 1992 and 2006, Dr Monath was Chief Scientific Officer and an Executive Director, Acambis (a publicly traded biopharmaceutical company) where he directed R&amp;D on dengue, West Nile, Japanese encephalitis, yellow fever, Clostridium difficile, and smallpox vaccines for defense against bioterrorism. Monath received his undergraduate degree from Harvard College and M.D. from Harvard Medical School and trained in internal medicine at the Peter Bent Brigham Hospital, Boston. COL Monath retired from the US Army in 1992 after 24 years in the uniformed services. Between 1973-1988, he was Director, Division of Vector-Borne Viral Diseases, Centers for Disease Control, Fort Collins CO and from 1989-92 Chief, Virology Division, US Army Medical Research Institute of Infectious Diseases (USAMRIID). He is on the editorial board of 5 scientific journals. He received the Nathanial A. Young Award (1984), the Richard M. Taylor Award (1996), and the Walter Reed Medal (2002) from the American Society of Tropical Medicine &amp; Hygiene and was President of that Society (2004-05). He has served on numerous government and international committees on infectious diseases, biosecurity, World Health Organization expert committees and the National Vaccines Advisory Committee (USA). Dr. Monath has published over 340 papers and edited 6 books on the epidemiology, immunology and pathogenesis of viruses and on vaccine development.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Kleiner Perkins Caufield & Byers","permalink":"kleiner-perkins-caufield-byers","type_of_entity":"financial_org","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/0998/10998v8-max-150x150.jpg"],[[250,250],"assets/images/resized/0001/0998/10998v8-max-250x250.jpg"],[[450,450],"assets/images/resized/0001/0998/10998v8-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}