{"first_name":"Thomas","last_name":"Cifelli","permalink":"thomas-cifelli","crunchbase_url":"http://www.crunchbase.com/person/thomas-cifelli","homepage_url":"http://www.microcapipo.com","birthplace":"United States","twitter_username":"TomCifelli","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1957,"born_month":null,"born_day":null,"tag_list":"cfo, interim-cfo, contract-cfo, general-counsel","alias_list":null,"created_at":"Sun Aug 12 20:39:44 UTC 2012","updated_at":"Sun Oct 28 03:49:28 UTC 2012","overview":"<p>My specialty is helping small growth companies raise capital and go public. I have experience in direct SEC registrations, identifying suitable companies for acquisition, mergers with public companies, and other strategic business development initiatives that require market research, legal, finance, accounting and tax expertise.</p>\n\n<p>I also provide cost effective Contract CFO services  with expertise in Internet application companies. My skills include (a) maintaining excellent financial reporting, (b) regulatory and tax compliance (local, state and federal (even international) regardless of industry or specialty), (c) complex combinations or reorganizations (or developing/executing on other strategic growth initiatives), (d) improving cash flow and tax planning, (d) raising investor capital, (e) going public or (f) improving market valuation and liquidity of your stock if already public.</p>\n\n<p>Small cap public companies or private companies with a public markets exit strategy are a particularly good fit for my experience and interests. </p>\n\n<p>Experience Summary:</p>\n\n<p>Held General Counsel and Chief Financial Officer positions with 2 publicly traded Internet companies and several privately held companies in various industries.</p>\n\n<p>Practiced law in Illinois and Arizona. Wide practice area experience including many business specialties and complex litigation.</p>\n\n<p>Practiced public accounting (as a CPA) with the world&#8217;s largest tax firm, with a financial audit firm, and with private clients.</p>\n\n<p>Was Managing Director of Investment Banking with FINRA/NASD registered broker dealer firms and held securities representative and principal licenses.</p>\n\n<p>Managed the accounting, financial reporting and investments of a municipal system with 10+ accounting staff and over $150MM annual budget.</p>\n\n<p>Extensive real estate development, management and investment syndication experience as well.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}