{"first_name":"Thomas","last_name":"Vardell","permalink":"thomas-vardell","crunchbase_url":"http://www.crunchbase.com/person/thomas-vardell","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Nov 24 23:43:55 UTC 2008","updated_at":"Mon Nov 24 23:48:57 UTC 2008","overview":"<p>Mr. Vardell has served as a Managing Director of Northgate since its inception. Mr. Vardell has been involved in private equity investments as a limited partner in several top-tier funds, as a direct investor, and as an advisory board member. Prior to co-founding Northgate, Mr. Vardell played eight years in the National Football League with the Cleveland Browns, the Detroit Lions, and the San Francisco Forty-Niners.</p>\n\n<p>Mr. Vardell holds a B.S. degree in Industrial Engineering from Stanford University. While at Stanford University, he was honored as the GTE Academic All-American of the Year, which is an award to the top scholar-athlete in the nation. He was a first-round pick (ninth overall) of the Cleveland Browns in 1992 and holds the all-time best marks for rushing and scoring at Stanford. He currently endows a scholarship at Stanford for character, athletic ability, and academic excellence.</p>\n\n<p>Mr. Vardell is a board observer on several venture-backed technology companies and is a member of the Harris Interactive College Football Poll, which ranks the nation&#8217;s top 25 college football teams for the Bowl Championship Series (BCS).</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Northgate Capital","permalink":"northgate-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,44],"assets/images/resized/0002/9482/29482v1-max-150x150.jpg"],[[250,74],"assets/images/resized/0002/9482/29482v1-max-250x250.jpg"],[[357,106],"assets/images/resized/0002/9482/29482v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}