{"first_name":"Thomas","last_name":"E. Cain","permalink":"thomas-e-cain","crunchbase_url":"http://www.crunchbase.com/person/thomas-e-cain","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 04 12:59:54 UTC 2009","updated_at":"Thu Jun 04 13:03:28 UTC 2009","overview":"<p>Tom has a deep understanding of technology, operations and their business interface, and enjoys building businesses with genuine passion. He is a recognized leader in energy investing, cleantech technologies and information technology, having founded, grown and managed some of the leading organizations in these categories. He currently serves on eight corporate boards, two of which he chairs; has been a director in numerous public and private companies, and has overseen businesses in many countries around the world. For SAIL, Tom serves as a director in Xtreme Power, Enerpulse, SNTech, Townsend Advanced Energy, Kokam America, Ice Energy, Cleantech Capital Group, and Oryxe Energy.</p>\n\n<p>His unique professional experience includes holding active patents in electrical device efficiency and IT pioneering of application RTL development leading to the modern day &#8220;DLL&#8221; architecture as well as taking over, restructuring and growing companies, adding tremendous value and engineering successful exit strategies. As Founder and CEO of Distributed Architects International (DAI), a company he led for almost 30 years, he grew the organization into a leader in global supply chain, distribution and manufacturing software with its derivatives having offices throughout the world with thousands of employees. He retired as Chairman of the Board for the acquisition corporation when Mapics was acquired by Info Systems in 2001.   He next focused on turnarounds in the oil and gas industry, accepting both chairman of public company positions and green fielding enterprises restarts.</p>","image":{"available_sizes":[[[123,150],"assets/images/resized/0004/6679/46679v1-max-150x150.jpg"],[[170,207],"assets/images/resized/0004/6679/46679v1-max-250x250.jpg"],[[170,207],"assets/images/resized/0004/6679/46679v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Associated Partner","firm":{"name":"Sail Capital Partners","permalink":"sail-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,95],"assets/images/resized/0004/6678/46678v1-max-150x150.jpg"],[[221,141],"assets/images/resized/0004/6678/46678v1-max-250x250.jpg"],[[221,141],"assets/images/resized/0004/6678/46678v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}