{"first_name":"Thomas","last_name":"Duffy","permalink":"thomas-duffy","crunchbase_url":"http://www.crunchbase.com/person/thomas-duffy","homepage_url":"http://www.venturecapital-advisors.com","birthplace":"bronx new york","twitter_username":"vcipublisher","blog_url":"http://www.venturecapital-advisors.com/blog","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1957,"born_month":8,"born_day":11,"tag_list":"consulting, venture-capital, branding, reg-d--reg-s, fund-strategy, ppm","alias_list":null,"created_at":"Mon Aug 08 13:43:03 UTC 2011","updated_at":"Thu Feb 02 22:15:14 UTC 2012","overview":"<p>CEO/ President and Founder of Venture Capital International, LLC, a private equity firm, has helped companies and non-profits receive millions of dollars from seven private funds. The firm was set up in 2006 for the purpose of identifying companies most poised for success, primarily in the real-estate, green-energy efficient technology and pharmaceutical industries, and investing over $200 million dollars of funding into these companies. With over twenty-five years of experience in merchant banking, extensive networking abilities and business operational knowledge, Mr. Duffy has lead Venture Capital International, LLC to consistently deliver positive financial returns to investors on every project since its inception, with some projects yielding over a 200% return within a twelve to eighteen month period. Recent projects that Mr. Duffy has selected have included clinical trials, which, after funding, have garnered FDA approval. Prior to founding Venture Capital International, LLC, Mr. Duffy was President at Tuthill LLC, a commercial and venture capital fund of over $100 million dollars concentrated in the lending of hard money from 1997-2006. At Tuthill, LLC, Mr. Duffy honed his abilities to negotiate \\win-win. deal terms that motivate portfolio company management teams yet provide solid governance, control and protection for investors. Simultaneously, Mr. Duffy was a Partner at TDI Inc. where he managed over 100 residential real estate projects in the New York Tri-State area, with sales in excess of 1.5 million dollars annually. He spearheaded project development of the waterfront in Jersey City, NJ, and Weehawken, NJ and lead a team of twenty-five in the development of a sixty story residential tower. Mr. Duffy is a Past-President of the Fairfield Connecticut Chapter of Business Network International and is called upon to act as a Real Estate and Financial Consultant to New York City think-tank, Gerson-Lehman Group. He was awarded National Republican Congressional Committee Businessman of the Year in 2007, New Jersey Better Business Bureau Man of the Year in 2006 and Council Businessman of the Year from 1997-2001 by the Bergen County, New Jersey Chamber of Commerce.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0014/8338/148338v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0014/8338/148338v2-max-250x250.jpg"],[[320,240],"assets/images/resized/0014/8338/148338v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"mba","subject":"economics","institution":"fordham","graduated_year":1981,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"CFO","firm":{"name":"Netco Gaming","permalink":"netco-gaming","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.facebook.com/groups/187936954555770/","title":"group"},{"external_url":"http://www.venturecapital-advisors.com","title":"advisory"}]}