{"first_name":"Thomas","last_name":"V. Milroy","permalink":"thomas-v-milroy","crunchbase_url":"http://www.crunchbase.com/person/thomas-v-milroy","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Oct 28 23:29:15 UTC 2008","updated_at":"Tue Oct 28 23:34:16 UTC 2008","overview":"<p>Tom Milroy was appointed Chief Executive Officer of BMO Capital Markets on March 5, 2008. In this position he has responsibility for all of BMO Financial Group&#8217;s businesses involving corporate, institutional and government clients in North America and globally. He is also a member of BMO Financial Group’s Management Committee.</p>\n\n<p>Mr. Milroy has been with BMO since 1993, when he joined the investment bank as a Managing Director with responsibility for a number of key relationships. In 1996, he was appointed Head of Vancouver Investment Banking, where he was actively involved in financing and M&amp;A assignments for numerous clients. In May 1999, Mr. Milroy was named Executive Managing Director and Head of Investment &amp; Corporate Banking (I&amp;CB) where he was responsible for the integration of Bank of Montreal’s corporate banking with the investment banking capabilities of Nesbitt Burns. He was subsequently also responsible for the integration of the corporate banking business of Harris Bank and Nesbitt Burns in the U.S. In April 2001, Mr. Milroy was appointed Vice-Chair and Global Head of I&amp;CB and in February 2006 he was named Co-President of BMO Capital Markets.</p>\n\n<p>Before joining BMO, Mr. Milroy worked in the M&amp;A group of a U.S. investment banking firm in New York and Toronto, from 1987 to 1993. Prior to 1987, he practiced securities law as a partner in a Toronto-based law firm.</p>\n\n<p>Mr. Milroy holds a Bachelor of Arts from McGill University, a Bachelor of Law and a Masters of Law from Cambridge University, a LLB from Dalhousie University, and has completed the Advanced Management Program at the Harvard Business School. Mr. Milroy is also a Director on the Board of the CAMH Foundation, Canada&#8217;s leading addiction and mental health teaching hospital, and is a member of the Board of Trustees of the Bishop Strachan School and a Trustee of the Pacific Parkinsons Research Institute, Vancouver. He is a member of the Law Society of Upper Canada.</p>","image":{"available_sizes":[[[107,150],"assets/images/resized/0002/7510/27510v1-max-150x150.jpg"],[[178,250],"assets/images/resized/0002/7510/27510v1-max-250x250.jpg"],[[321,450],"assets/images/resized/0002/7510/27510v1-max-450x450.jpg"]],"attribution":"<p>http://www2.bmo.com/bio/article/0,1099,contentCode-586<em>divId-4</em>langId-1_navCode-132,00.html</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Executive Officer","firm":{"name":"Bank of Montreal (BMO)","permalink":"bank-of-montreal-2","type_of_entity":"financial_org","image":{"available_sizes":[[[150,20],"assets/images/resized/0002/8946/28946v1-max-150x150.png"],[[250,34],"assets/images/resized/0002/8946/28946v1-max-250x250.png"],[[279,38],"assets/images/resized/0002/8946/28946v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}