{"first_name":"Thomas","last_name":"Tippl","permalink":"thomas-tippl","crunchbase_url":"http://www.crunchbase.com/person/thomas-tippl","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jan 21 20:23:04 UTC 2010","updated_at":"Thu Jan 21 20:24:29 UTC 2010","overview":"<p>Mr. Tippl has been Chief Corporate Officer since March 2009 and became Chief Financial Officer of Activision Blizzard in July 2008 in connection with the combination of Activision and Vivendi Games. He was Chief Financial Officer of Activision Publishing from October 2005 until July 2008, when the transaction with Vivendi Games was consummated. . Prior to joining Activision Blizzard, Mr. Tippl served as Head of Investor Relations and Shareholder Services at The Procter &amp; Gamble Company from 2004 to 2005. Mr. Tippl also served as Finance Director of The Procter &amp; Gamble Company, Baby Care, Europe and as a member of the Board of Directors of The Procter &amp; Gamble Company&#8217;s Fater Italy Joint Venture from 2001 to 2003. Mr. Tippl co-founded The Procter &amp; Gamble Company&#8217;s Equity Venture Fund in 1999 and also served as Associate Director of Acquisitions and Divestitures for The Procter &amp; Gamble Company from 1999 to 2001. Prior to 1999, Mr. Tippl served in various financial executive positions for The Procter &amp; Gamble Company in Europe, China and Japan. Mr. Tippl holds a Masters degree in Economics &amp; Social Sciences from the Vienna University of Economics and Business Administration.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Financial Officer and Chief Corporate Officer of Activision Blizzard","firm":{"name":"Activision Blizzard","permalink":"activision","type_of_entity":"company","image":{"available_sizes":[[[144,45],"assets/images/resized/0002/1792/21792v1-max-150x150.png"],[[144,45],"assets/images/resized/0002/1792/21792v1-max-250x250.png"],[[144,45],"assets/images/resized/0002/1792/21792v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}