{"first_name":"Thrillophilia","last_name":"Adventure","permalink":"thrillophilia-adventure","crunchbase_url":"http://www.crunchbase.com/person/thrillophilia-adventure","homepage_url":"http://www.thrillophilia.com","birthplace":"Karnataka","twitter_username":"thrillophilia","blog_url":"http://www.thrillophilia.com/blog","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1987,"born_month":3,"born_day":5,"tag_list":"adventure-bangalore, adventure-india, bangalore-weekeend-getaways, corporate-day-outing-bangalore, team-outing-bangalore","alias_list":null,"created_at":"Tue Oct 12 15:24:51 UTC 2010","updated_at":"Fri Dec 02 00:34:32 UTC 2011","overview":"<p>Thrillophilia aspires to be the one stop solution for all adventure related activities in the Indian sub continent.</p>\n\n<p>Thrillophilia seeks to offer world class services for the adventurists in the sub continent looking for the likes of nature &amp; adventure trips, merchandise et al. We take upon us the onus of improving the awareness amongst people about the same in India.</p>\n\n<p>Thrillophilia desires to be the strongest player in servicing the adventure sports enthusiasts on a pan India span.</p>\n\n<p>&#8220;There are many things that we can do with our lives. Some things are done for satisfaction; some are done for money and some to gain power. And then there are some things which you want to do only because YOU believe in them. We have always been excited by adventure activities and there is nothing better than doing what we love. We are on our way to provide everyone with the one thing that we have always loved. That is adventure and thrills.&#8221; This is how &#8216;Thrillophilia&#8217; was born. </p>\n\n<p>The team comprises of dynamic, intelligent and confident people who have taken it upon themselves to fulfill all your adventure needs at the click of a mouse. </p>\n\n<p>The idea of a one stop destination of adventure sports manifested itself once Thrillophilia started taking shape. The sleepless nights, the endless discussions and continuous hard work have led us to what we only dreamt of when we started working on this idea. </p>\n\n<p>It&#8217;s the teamwork which has led to the making of Thrillophilia. We believe that in our team we have people who complement each other with their expertise in different areas.</p>\n\n<p>Thrillophilia is here to stay, build sustainable relationships with its clients the basis of which can only be TRUST!! With our presence in many parts of India, we feel that it is only a start and as the famous saying goes we have miles to go before we rest.</p>\n\n<p>In love with thrill - Thrillophilia seems to be the apt place for you. Thrillophilia is a home for all the thrill lovers who have a strong penchant towards adventure sports. That’s why we call it Thrillophilia. There is no room for fear or any trepidation as we shall take care of your safety by ensuring the best trainers and the best equipments.</p>\n\n<p>Today interests have changed from merely expensive dinner parties to eco-friendly expeditions, where one can experience the joys of nature and feel one with it. </p>\n\n<p>As the exercise of choosing the right vendor at an affordable price for an adventure activity is very time consuming and fatiguing, we do it for you and let you choose from the variety of packages that we have handpicked for you. All you need is a computer and a net connection and you can go through our packages, understanding and comparing them in the comforts of your home or office.</p>\n\n<p>Along with this we also offer customized packages wherein you can give your requirements and our team of experts with their meticulous planning will design packages that accomplish your requirements and also fit your budget. Our website offers enormous information in the form of adventure bible and travelogues that will keep the readers posted about the explored as well as the unexplored adventure destinations in India.</p>\n\n<p>Thrillophilia with its skilled trainers and safe equipments promises to take care of all your adventure needs in the best possible manner.</p>\n\n<p>So forget all your worries, just breathe in the crisp mountain air, tune in your mind with nature and let your soul soar out to the ultimate high that you have ever experienced.</p>","image":{"available_sizes":[[[150,56],"assets/images/resized/0010/5235/105235v2-max-150x150.jpg"],[[250,93],"assets/images/resized/0010/5235/105235v2-max-250x250.jpg"],[[450,168],"assets/images/resized/0010/5235/105235v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}