{"first_name":"Tiffany","last_name":"Huggins","permalink":"tiffany-huggins","crunchbase_url":"http://www.crunchbase.com/person/tiffany-huggins","homepage_url":"http://selectiveretreats.com/","birthplace":"","twitter_username":"SRVillas","blog_url":"http://selectiveretreats.com/blog/","blog_feed_url":"http://selectiveretreats.com/blog/feed/","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"jamaica-villas, jamaica-villas-for-rent, vacation-homes-in-jamaica, jamaica-villas-in-montego-bay, montego-villas, ocho-rios-villas, negril-villas, runaway-way-villas-jamaica, discovery-bay-jamaica-villas, jamaica-vacation-homes, holiday-rentals-homes-in-","alias_list":null,"created_at":"Mon Apr 23 14:45:11 UTC 2012","updated_at":"Mon Apr 30 00:55:33 UTC 2012","overview":"<p>Selective Retreats offers holiday homes and vacation villas for rent in Jamaica in areas such as Montego Bay, Ocho Rios and Negril, and other topical paradise destinations including Anguilla, Barbados, Dominican Republic, Bahamas, Bali, the Indian Ocean, South Pacific, Belize, Costa Rica, Mexico and Hawaii. Each property that we promote is unique, specifically selected and designed to enhance travelers’ vacation. From cottages perched atop scenic cliffs to beachfront villas with dazzling white sand and sparkling blue waters that create more than just life on the beach but a vacationer’s heaven, to secluded houses tucked away in serene countryside complemented by lush gardens and flowered valleys with magnificent views and stunning natural beauty. The grandeur of these selective retreats will seduce and tantalize even the most discerning traveler.\nTravel to a place without worries or hurriedness where everything is set by its own gentle pace. Live your vacation dreams – stay in a luxurious home in a tropical paradise. Be spoiled by a friendly staff and let your whims govern. This is the “Selective Retreats experience”.</p>\n\n<p>EXCLUSIVE LUXURY VACATION\nOur collection of vacation properties not only provides guests with exclusive luxury accommodations but also redefines everything you ever know about a villa vacation. From fine dining of delightful synthesis of Caribbean and International Fare, including authentic Jerk and tasty Seafood prepared to the highest quality to specialty drinks and top-shelf brands. <em>Imaginative spa therapies and yoga retreats</em> Adventurous on and off site excursions * World –class golf * and nightly live entertainment. Your indulgence will attribute to a magical experience, resulting in a lasting fascination. Jamaica is sure to amaze and conjure feelings of love and appreciation. Here you will unwind, relax and be restored to perfect harmony of mind, body, spirit and soul.</p>\n\n<p>UNIQUE VACATION EXPERIENCE\nSelective Retreats creates unforgettable memories that last a lifetime. We know that you may not want to share hotel amenities and so we present the opportunity for you to enjoy exclusive use of your vacation property. Our vacation homes and villas are reserved for the discerning travelers, providing the ultimate in total privacy and relaxation. Our specialty lies with planning the perfect villa getaway and execution of our service so that you get the best villa and service suited for your unique desire, budget and lifestyle. We will work closely with from the initial state of planning your trip until you are completely satisfied. We can arrange for a fulltime driver who will meet you at the airport where you are transported to your destination. The trip to your villa can be an exciting adventure as the driver enthusiastically narrates interesting details on significant landmarks and historical sites along the way. On arrival, all guests are welcomed by and introduced to the villa staff. The employees you’ll meet will be your extended family, friends and assistants for the duration of your stay. Villa staff may include gourmet chefs, private butlers, chambermaids, laundresses, gardeners, caretakers and security personnel. Optional service staff includes massage therapists/yoga coaches, nannies, medical doctors, tour guides, and events coordinators/consultants. Additional features include Resort Club Membership with a host of activities such as spas, golf, tennis, kids’ programs, and beach and water sports activities.</p>","image":{"available_sizes":[[[150,131],"assets/images/resized/0018/5507/185507v2-max-150x150.jpg"],[[243,213],"assets/images/resized/0018/5507/185507v2-max-250x250.jpg"],[[243,213],"assets/images/resized/0018/5507/185507v2-max-450x450.jpg"]],"attribution":"<p>Tiffany Huggins</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}