{"first_name":"Till","last_name":"Quack","permalink":"till-quack","crunchbase_url":"http://www.crunchbase.com/person/till-quack","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"kooaba","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Oct 09 07:57:33 UTC 2008","updated_at":"Mon Nov 02 23:58:07 UTC 2009","overview":"<p>his Master’s Degree in Information Technology and Electrical Engineering at the same institution in 2004.</p>\n\n<p>A stay in Palo Alto in 1998 sparked his interested in entrepreneurship and the World Wide Web. Shortly afterwards, he founded Quack Information Architecture. The company delivered web-development services and was among the first in Switzerland to propagate standards-based XHTML and CSS code to their clients.</p>\n\n<p>In 2001 he started one of the first weblogs in Switzerland.</p>\n\n<p>From 1998-2004 Till Quack studied Electrical Engineering and Information Technology at the ETH Zurich, in Switzerland. He completed his Master’s Thesis at the University of California in Santa Barbara, where he contributed to the development of Cortina, a large-scale content-based image search engine for the WWW. Cortina is one of the first image search engines, searching millions of images.\nThe combination of image recognition and the World-Wide Web unites his technological passions and led him to pursue a PhD in the same field.</p>\n\n<p>He co-created several mobile- and web-applications, among them mosaickr.com. He is author of several research papers and patents in the field of computer vision. Till Quack’s interests lie in innovation, travelling, the outdoors, smart tv series, magazines, renewable energies, the baltic countries, and collective intelligence on the web.</p>\n\n<p>His personal page and blog can be found under www.quack.ch.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"co-founder & CTO","firm":{"name":"kooaba","permalink":"kooaba","type_of_entity":"company","image":{"available_sizes":[[[150,28],"assets/images/resized/0003/5383/35383v4-max-150x150.png"],[[250,47],"assets/images/resized/0003/5383/35383v4-max-250x250.png"],[[450,85],"assets/images/resized/0003/5383/35383v4-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}