{"first_name":"Tim","last_name":"Petersen","permalink":"tim-petersen","crunchbase_url":"http://www.crunchbase.com/person/tim-petersen","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jun 04 07:57:49 UTC 2009","updated_at":"Thu Jun 04 08:00:53 UTC 2009","overview":"<p>Tim Petersen specializes in investments in medical device, equipment, and healthcare information technology companies, leveraging his broad business background working in and with entrepreneurial firms. Tim currently serves on the board of directors of Arboretum portfolio companies Accord Biomaterials, Accuri Cytometers, Advanced ICU Care, CerviLenz Inc. and KFx Medical.  He previously sat on the board of directors of HealthMedia (acquired by Johnson &amp; Johnson in 2008), and Asterand (now publicly traded on the London Stock Exchange).</p>\n\n<p>Tim&#8217;s entire career has focused on creating, growing, and financing entrepreneurial companies. Before joining Arboretum in 2002, Tim was the Managing Director of the Zell Lurie Institute for Entrepreneurial Studies at the University of Michigan, leading the creation and rapid growth of the Institute&#8217;s programs. He also directed the Wolverine Venture Fund (WVF), the Institute&#8217;s venture capital fund that includes the active participation of Michigan&#8217;s MBA students. Previously, Tim spent nine years at Industrial Economics, Inc., becoming a member of the firm&#8217;s senior management team in 1991. Industrial Economics, founded in the early 1980&#8217;s in Cambridge, MA, is a leader in the fields of natural resource economics and environmental science. Earlier in his career, Tim was also a manager in the investment banking practice at Plante &amp; Moran.</p>\n\n<p>Tim is involved in a number of community and educational efforts in the entrepreneurial arena.  For instance, he is currently the Alumni Fund Manager for the Wolverine Venture Fund. </p>","image":{"available_sizes":[[[100,125],"assets/images/resized/0004/6623/46623v1-max-150x150.jpg"],[[100,125],"assets/images/resized/0004/6623/46623v1-max-250x250.jpg"],[[100,125],"assets/images/resized/0004/6623/46623v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.A","subject":"Economics","institution":"Williams College","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Arboretum Ventures","permalink":"arboretum-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,60],"assets/images/resized/0004/6621/46621v1-max-150x150.png"],[[151,61],"assets/images/resized/0004/6621/46621v1-max-250x250.png"],[[151,61],"assets/images/resized/0004/6621/46621v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}