{"first_name":"Tim","last_name":"Hewson","permalink":"tim-hewson","crunchbase_url":"http://www.crunchbase.com/person/tim-hewson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"My Internet Corporation ('mi')","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue May 10 18:55:01 UTC 2011","updated_at":"Mon May 23 00:56:19 UTC 2011","overview":"<p>Tim Hewson is the Chief Operating Officer of My Internet Corporation.</p>\n\n<p>Tim started his career as a specialist in Human Computer Interaction working with the esteemed HUSAT Research Institute in England. While at HUSAT he offered user interface design consultancy for varied clients including Reuters, the Royal Navy, Philips and BT. He also worked in EU funded research projects developing advanced telecommunications services across Europe. During this time, he lectured in user interface design techniques for Loughborough University&#8217;s MSc programs and widely published his research in usability evaluation methods.</p>\n\n<p>In 1995, Tim emigrated to Canada and joined Canada&#8217;s leading technology organization, working within software development teams as a user interface designer. After three years, Tim joined the Product Management team with overall business and product development responsibility for a variety of Enterprise Applications; messaging, conferencing, interactive voice response and call center. This position allowed Tim to leverage his user centered design philosophies with his business interest to create three key market leading products with over $250M in Worldwide annual sales. </p>\n\n<p>In 2000 while still employed full time, Tim formed PartingWishes Inc, an innovative online service for preparing legal documents and funeral plans. A host of spin-off sites were then launched including LegalWills.ca, PersonalWillKit.ca, LegalWills.co.uk, USLegalWills.com, ILovedMyPet.com and others. To date, tens of thousands of customers have used LegalWills to prepare their Last Will and Testament. He joined My Internet Corporation in2009, after meeting Denim Smith in a Starbucks and being completely inspired by the vision! Tim is married with a baby daughter. He is currently living in Ottawa, Canada.</p>","image":{"available_sizes":[[[110,150],"assets/images/resized/0013/5431/135431v2-max-150x150.jpg"],[[184,250],"assets/images/resized/0013/5431/135431v2-max-250x250.jpg"],[[331,450],"assets/images/resized/0013/5431/135431v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Operating Officer","firm":{"name":"My Internet Corporation ('mi')","permalink":"my-internet-corporation-mi","type_of_entity":"company","image":{"available_sizes":[[[150,115],"assets/images/resized/0013/4038/134038v2-max-150x150.jpg"],[[250,193],"assets/images/resized/0013/4038/134038v2-max-250x250.jpg"],[[450,347],"assets/images/resized/0013/4038/134038v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}