{"first_name":"Tim","last_name":"Smith","permalink":"tim-smith-2","crunchbase_url":"http://www.crunchbase.com/person/tim-smith-2","homepage_url":"http://endeavorsp.com/","birthplace":"Los Angeles, CA","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"endeavor, search-firm, head-hunter, executive-recruiting, placements","alias_list":null,"created_at":"Thu Sep 29 17:53:31 UTC 2011","updated_at":"Tue Nov 15 00:39:00 UTC 2011","overview":"<p>Tim Smith is the Founder and Managing Partner of Endeavor Search Partners, and brings more than sixteen years of experience successfully recruiting high impact leadership for Venture Capital and Private Equity backed companies in the Technology and Consumer Sectors. Prior to founding Endeavor Search Partners, Mr. Smith served as a Partner with a top boutique retained executive search firm focused on serving the needs of high growth technology and consumer clients. Earlier, he served as Founder and Managing Director of the Venture Capital and Emerging Growth practice for Stanton Chase International, a top 1% retained international executive search firm. Mr. Smith began his career as a Financial Consultant with Merrill Lynch in Los Angeles. He is a past President of the Los Angeles Chapter of YEO (Young Entrepreneur’s Organization), serves on a board committee of ACG (Association for Corporate Growth) and is active in the FCD (Forum of Corporate Directors).</p>\n\n<p>Mr. Smith holds an MBA, with an emphasis in technology and strategy, from the University of California, Irvine. In addition, he received his certification of Corporate Governance from the University of California, Irvine and studied Entrepreneurship at the Anderson School at UCLA. He also received a Bachelor of Science in Economics and Finance from Southern Methodist University.</p>","image":{"available_sizes":[[[150,96],"assets/images/resized/0015/6126/156126v2-max-150x150.jpg"],[[250,160],"assets/images/resized/0015/6126/156126v2-max-250x250.jpg"],[[420,270],"assets/images/resized/0015/6126/156126v2-max-450x450.jpg"]],"attribution":"<p>Tim Smith</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/tsmitty","title":"LinkedIn Profile"}]}