{"first_name":"Tim","last_name":"Tuttle","permalink":"tim-tuttle","crunchbase_url":"http://www.crunchbase.com/person/tim-tuttle","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Expect Labs","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Sep 07 14:47:50 UTC 2012","updated_at":"Sat Oct 13 04:06:14 UTC 2012","overview":"<p>Tim is the Founder and CEO of Expect Labs, a San Francisco startup developing technology to power the emerging generation of &#8216;anticipatory computing&#8217; applications.</p>\n\n<p>Tim was the Founder and CEO of Truveo, which launched in 2005 and became one of the Web&#8217;s largest video search engines. Truveo&#8217;s search engine powered many of the world&#8217;s most popular websites, reaching over 50 million users every month across 15 countries. Truveo was acquired by AOL, and Tim Tuttle served as Senior Vice President at AOL Time Warner, responsible for online video.</p>\n\n<p>Prior to Truveo, Tim was the Founder and CTO of Bang Networks, a company that pioneered the real-time web messaging industry. Tim has also held appointments as a member of the research staff at MIT Lincoln Laboratory, the MIT Artificial Intelligence Lab, and the MIT Lab for Computer Science. Tim served as Research Director at Lucent Bell Laboratories where his work focused on high-performance computing platforms for Internet services.</p>\n\n<p>Tim studied at the MIT AI Lab and Lab for Computer Science, where he received his MS and PhD degrees. Tim also received his BS from MIT, where he graduated Phi Beta Kappa. Tim has authored 18 technical publications and has been awarded several patents. Tim is a recipient of the Harvard Business School Dubilier Prize for Entrepreneurship and was selected as one of the 100 Top Young Innovators by MIT Technology Review Magazine.</p>","image":null,"degrees":[{"degree_type":"PhD","subject":"Artificial Intelligence","institution":"MIT AI Lab","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO and Founder ","firm":{"name":"Expect Labs","permalink":"expect-labs","type_of_entity":"company","image":{"available_sizes":[[[150,90],"assets/images/resized/0021/0910/210910v5-max-150x150.jpg"],[[250,150],"assets/images/resized/0021/0910/210910v5-max-250x250.jpg"],[[450,271],"assets/images/resized/0021/0910/210910v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}