{"first_name":"Tim","last_name":"Albinson","permalink":"tim-albinson","crunchbase_url":"http://www.crunchbase.com/person/tim-albinson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Dec 16 10:12:03 UTC 2008","updated_at":"Tue Dec 16 10:21:34 UTC 2008","overview":"<p>Mr. Albinson is the company&#8217;s Founder, CEO, and chief visionary. With a technology background dating back to the early 1980s, he has held cross-functional positions in marketing, product strategy, and sales management. Prior to founding Aravo, he worked in investment banking at Goldman Sachs in New York and as an associate with Core-Capital Partners, a $350 million early-stage venture capital fund. He has also served as President of the Adelante Consulting Group, a professional services firm he founded to advise Global 2000 corporations and conservation groups on issues of sustainability and cause-related marketing.</p>\n\n<p>Mr. Albinson has been an advocate for conservation and sustainability for over two decades, and has worked with organizations including World Wildlife Fund, The Nature Conservancy, American Forests and Fundacion Natura, Ecuador’s leading conservation group. In the early 1990s he helped formulate sustainability strategies for companies including Eddie Bauer and Timberland, and has written numerous articles on sustainability and environmental issues.</p>\n\n<p>Mr. Albinson holds an MBA from the Haas School at the University of California at Berkeley, where he was a Walter A. Haas Scholar and served as Student Body President. He also holds a BA in English literature from the University of Colorado at Boulder and is a member of the SF Bay Chapter of the Young Presidents Organization.</p>\n\n<p>Outside of Aravo, he serves on numerous advisory boards, teaches entrepreneurship and startup finance at the University of California, Berkeley Extension, and works with the Painted Turtle Camp serving the needs of children with life-threatening diseases.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0003/1831/31831v1-max-150x150.jpg"],[[120,179],"assets/images/resized/0003/1831/31831v1-max-250x250.jpg"],[[120,179],"assets/images/resized/0003/1831/31831v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Executive Officer","firm":{"name":"Aravo Solutions","permalink":"aravo-solutions-inc","type_of_entity":"company","image":{"available_sizes":[[[112,37],"assets/images/resized/0003/1829/31829v2-max-150x150.png"],[[112,37],"assets/images/resized/0003/1829/31829v2-max-250x250.png"],[[112,37],"assets/images/resized/0003/1829/31829v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}