{"first_name":"Tim","last_name":"Horan","permalink":"tim-horan","crunchbase_url":"http://www.crunchbase.com/person/tim-horan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Feb 23 00:37:07 UTC 2010","updated_at":"Tue Feb 23 00:40:33 UTC 2010","overview":"<p>As PocketGear&#8217;s Vice President of Business Development, Tim is responsible for driving new and existing business with device manufacturers, mobile operators, media companies, smartphone operating system providers, and other distribution and channel partners.</p>\n\n<p>With over fifteen years of experience managing and developing a number of fast growth mobile technology and online media businesses, Tim has worked in all facets of the mobile and online media landscape including with carriers, handset manufacturers, content providers, application stores, brands, and in various positions in general management, sales, business development, customer operations and product management.</p>\n\n<p>At <a href=\"/company/motricity\" title=\"Motricity\" rel=\"nofollow\">Motricity</a> a pioneer in providing mobile data solutions to mobile operators, Tim was part of the initial management team where he led global business development, sales and customer operations and helped close the initial contracts with mobile operators. Joining in 2001 as one of the first 30 employees, Tim was responsible for establishing Motricity&#8217;s distribution, technology and content licensing agreements that supported many of the leading mobile operators, handset manufacturers, and content providers, developing a footprint of over 150 million subscribers globally, supporting over 10,000 application developers and content providers, and closing contracts that generated over $2.5 billion in mobile content revenues.</p>\n\n<p>Prior to Motricity, as an early employee at Excite, one of the first search engines and online portals, Tim was responsible for expanding distribution and growing revenues for various search, advertising, and e-commerce businesses for Excite Mobile, Excite.com, and the broader Excite@Home Network of properties. Tim joined Excite Inc. in 1996, and during his tenure in sales and business development, he was responsible for closing advertising and commerce contracts totaling over $50 million in revenue.</p>\n\n<p>Most recently Tim was Co-founder and President of Beecoz, a grant award funded local social search service that makes it simple and easy for people to find and share information about local businesses.</p>\n\n<p>Tim received a Bachelors of Science degree in Business Administration from Northeastern University and has a patent pending for the dynamic creation of address-based social networks.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"VP Business Developments","firm":{"name":"Appia","permalink":"appia","type_of_entity":"company","image":{"available_sizes":[[[150,54],"assets/images/resized/0012/4831/124831v2-max-150x150.png"],[[250,90],"assets/images/resized/0012/4831/124831v2-max-250x250.png"],[[450,162],"assets/images/resized/0012/4831/124831v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}