{"first_name":"Tim","last_name":"Danford","permalink":"tim-danford","crunchbase_url":"http://www.crunchbase.com/person/tim-danford","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Storm Ventures","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Dec 03 13:26:24 UTC 2008","updated_at":"Thu Jul 09 23:39:37 UTC 2009","overview":"<p>Tim Danford is a Managing Director at Storm Ventures.  Tim joined Storm Ventures from Cisco Systems, where he was a technology leader in the Business Development organization. Tim worked with senior executives to develop strategies for entering new markets and was responsible for developing technology strategy, identifying opportunities and working with business development managers to execute investment, partnering and acquisition transactions. \nDuring Tim&#8217;s 6-year tenure at Cisco, he played a key role in developing Cisco&#8217;s wireless strategy. The implementation of this wireless strategy resulted in the acquisition of JetCell, where Tim was the primary technology interface, as well as the acquisition of Exio, where Tim worked closely with the founders as they were exiting Hyundai and developing their product. </p>\n\n<p>Tim also worked closely with senior executives to develop and build Cisco&#8217;s Enterprise VoIP (Voice-over-IP) Business Unit, which resulted in the acquisition of Selsius and the implementation of the Cisco AVVID product lines. Tim was awarded the first prestigious Technology Pioneer award by Cisco&#8217;s CTO for his contributions to the founding VoIP team. </p>\n\n<p>Prior to Tim&#8217;s contributions to Cisco&#8217;s VoIP technology he managed a team responsible for competitive analysis of ATM networking equipment, and he worked closely with the Lightspeed team after their acquisition. Tim supported Cisco&#8217;s early sales efforts and customers as a Systems Engineer designing and building large router networks. </p>\n\n<p>Tim has over 18 years of extensive Internetworking and Telecommunications experience gained while working at Cisco Systems, Synoptics and Ameritech Information Systems. His technical education is in ship-board radio and telecommunications systems from the U.S. Coast Guard and studied at the Advanced Data Networking Institute in Milwaukee Wisconsin. Tim studied Criminal Justice at Kent State University in Ohio. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director ","firm":{"name":"Storm Ventures","permalink":"storm-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,64],"assets/images/resized/0001/5089/15089v1-max-150x150.png"],[[250,107],"assets/images/resized/0001/5089/15089v1-max-250x250.png"],[[301,129],"assets/images/resized/0001/5089/15089v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}