{"first_name":"Tim","last_name":"Jackson","permalink":"tim-jackson","crunchbase_url":"http://www.crunchbase.com/person/tim-jackson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Feb 17 20:23:57 UTC 2008","updated_at":"Tue Feb 19 02:25:15 UTC 2008","overview":"<p>&#8220;Tim&#8217;s strategic vision and passionate leadership have been driving forces behind Tech Capital&#8217;s success. A seasoned investor, he is committed to building world-class companies. Tim negotiated the $550 million sale of PixStream Inc. to Cisco Systems and has orchestrated financial transactions, Initial Public Offerings and corporate acquisitions in many diverse industries. He has the operational expertise, financial acumen and rich network of contacts to take companies seamlessly from startup to acquisition.</p>\n\n<p>Experienced in executive leadership roles, Tim has acted as Chief Financial Officer, Chief Executive Officer and Board Chair for numerous emerging-growth companies. He is a respected, hands-on business manager and his skilled mentoring helps companies ramp quickly, delivering a higher return on investment.</p>\n\n<p>Tim is a popular speaker in both business and academic circles and has served as director on numerous corporate boards, including Sandvine Inc., VideoLocus Inc., LiveHive Systems Inc., DiskStream Inc. and FibreTech Telecommunications Inc. He has also been a board member of many charitable and not-for-profit organizations. He sits on the Board of Governors for the University of Waterloo and is Chair of the University&#8217;s Finance and Investment Committee. He is a director of Communitech Technology Association, an organization that fosters the growth and success of Waterloo Region technology companies, chairs the Waterloo Public Library Board and is President of the Food Bank of Waterloo Region. Tim has a Bachelor of Arts degree in accounting from the University of Waterloo and is a Chartered Accountant.&#8221;</p>\n\n<p>Source: Tech Capital</p>","image":null,"degrees":[],"relationships":[{"is_past":null,"title":"Partner","firm":{"name":"Tech Capital Partners","permalink":"tech-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,43],"assets/images/resized/0003/0285/30285v1-max-150x150.png"],[[250,72],"assets/images/resized/0003/0285/30285v1-max-250x250.png"],[[266,77],"assets/images/resized/0003/0285/30285v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}