{"first_name":"Timothy","last_name":"J Dion","permalink":"timothy-j-dion","crunchbase_url":"http://www.crunchbase.com/person/timothy-j-dion","homepage_url":"","birthplace":"","twitter_username":"timdion","blog_url":"","blog_feed_url":"","affiliation_name":"Sensei ","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Mar 15 18:36:14 UTC 2010","updated_at":"Thu Oct 07 18:30:02 UTC 2010","overview":"<p>Timothy J. Dion is the chief information officer for Sensei Inc., a pioneer in mobile and web-based wellness solutions. With extensive managerial and technical experience, Dion is responsible for operations, technology implementation and infrastructure for the company.\nPrior to joining Sensei, Dion was the director of enterprise architecture for Biogen Idec Inc, a $3.5 billion global biotechnology leader with products and capabilities in oncology, neurology and immunology. While at Biogen Idec, Dion led efforts centered on enterprise architecture and the technology strategy for the global organization.\nPreviously, Dion was a partner and chief technology officer for Riverton LLC, a specialized technology- consulting firm providing Fortune 500 companies with enterprise architecture, operational business intelligence and cross-enterprise integration expertise. Dion was responsible for the technical vision and delivery of all of Riverton&#8217;s engagements. He helped define the company&#8217;s strategy, and instituted numerous efficiency programs.\nDion also has served as chief technology officer for Primix Solutions Inc., a publicly held, world-leading Internet applications services firm. In addition, he has held positions with Advis Inc., Marble Associates and Telco Systems.\nDion has spoken at numerous technology conferences, and has been published in industry publications such as EAI Journal, Mass High Tech and VAR Business Magazine. </p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0010/4279/104279v2-max-150x150.jpg"],[[160,120],"assets/images/resized/0010/4279/104279v2-max-250x250.jpg"],[[160,120],"assets/images/resized/0010/4279/104279v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CIO","firm":{"name":"Sensei ","permalink":"sensei","type_of_entity":"company","image":{"available_sizes":[[[150,45],"assets/images/resized/0008/0413/80413v2-max-150x150.png"],[[250,76],"assets/images/resized/0008/0413/80413v2-max-250x250.png"],[[450,137],"assets/images/resized/0008/0413/80413v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}