{"first_name":"Timothy","last_name":"V. Williams","permalink":"timothy-v-williams","crunchbase_url":"http://www.crunchbase.com/person/timothy-v-williams","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"ManageIQ","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 29 20:07:14 UTC 2012","updated_at":"Thu Sep 06 21:26:53 UTC 2012","overview":"<p>Tim most recently served as senior vice president and chief financial officer of Blackbaud, Inc. (NASDAQ: BLKB), a provider of software and services to non-profit organizations. He retired from that role in November 2011, having held the position since January 2001. He now works as a consultant and serves on several boards. From 1994 to 2001, Tim served as executive vice president and chief financial officer of Mynd Corporation (formerly known as Policy Management Systems Corporation (NYSE: PMS), now a subsidiary of Computer Sciences Corporation), a provider of software and services to the insurance industry. From 1979 to 1994 he held various senior financial management positions with Holiday Inns and from 1971-1979 positions on the audit staff of Price Waterhouse &amp; Co. Since 2007, Tim has served as a director of PROS Holdings, Inc. (NYSE: PRO), a provider of pricing and revenue management software and services for companies in the manufacturing, distribution, services and travel industries. Since March 2011, He has served as a director of Halogen Software, Inc. a privately held provider of talent management software and services. Tim holds a B.A. in business from the University of Northern Iowa.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Director","firm":{"name":"ManageIQ","permalink":"manageiq","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0018/4674/184674v2-max-150x150.png"],[[200,200],"assets/images/resized/0018/4674/184674v2-max-250x250.png"],[[200,200],"assets/images/resized/0018/4674/184674v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}