{"first_name":"Tina","last_name":"Santos","permalink":"tina-santos","crunchbase_url":"http://www.crunchbase.com/person/tina-santos","homepage_url":"http://www.theplatform.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue May 08 19:45:06 UTC 2012","updated_at":"Thu May 10 19:11:32 UTC 2012","overview":"<p>Tina Santos, Chief Legal Counsel</p>\n\n<p>Tina currently serves as the Chief Legal Counsel at thePlatform, where she directs all legal and compliance matters for the company. Prior to thePlatform, Tina was the general counsel and corporate secretary at StreamServe, Inc., where she managed all legal aspects relating to the company’s internal and external operations in the U.S. and 13 jurisdictions in Europe and Asia. Previously, she was a senior associate at the London office of Coudert Brothers, LLP, and served as an associate in the corporate securities and finance group of Perkins Coie, LLP. Prior to attending law school, she worked for Lone Wolf Technologies, a Seattle-based start-up company, where she managed all financing related activities, investor relations, and was Corporate Secretary to the Board of Directors. Tina received her Juris Doctor with honors from the Seattle University School of Law and graduated from the University of Puget Sound with a Bachelor of Arts degree. She is a member of the Washington State Bar Association and the American Bar Association. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Legal Counsel","firm":{"name":"thePlatform","permalink":"theplatform","type_of_entity":"company","image":{"available_sizes":[[[150,36],"assets/images/resized/0002/1171/21171v3-max-150x150.jpg"],[[250,59],"assets/images/resized/0002/1171/21171v3-max-250x250.jpg"],[[450,107],"assets/images/resized/0002/1171/21171v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}