{"first_name":"Tina","last_name":"Weinfurther","permalink":"tina-weinfurther","crunchbase_url":"http://www.crunchbase.com/person/tina-weinfurther","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri May 16 01:14:45 UTC 2008","updated_at":"Fri May 16 01:24:26 UTC 2008","overview":"<p>Tina’s extensive leadership background includes having been the founder and CEO of Benchmarx Solutions, a start-up, customer satisfaction benchmarking firm. Most recently, she served for more than five years as President and CEO of TNS Prognostics. Prognostics was a global customer satisfaction research and software firm, and subsidiary of NFO, one of the largest market research firms in North America. In that role, Tina was responsible for the company’s business strategy and operations – leading the organization through a successful turnaround that resulted in significant revenue and profit growth through customer driven strategies.</p>\n\n<p>Prior to Prognostics, Tina spent over 15 years in human resources management consulting. She was the National Practice Director for Alexander &amp; Alexander Consulting Group, where she created and directed an organization-wide process to align business operations with customer expectations. Before that, Tina was with Watson Wyatt Worldwide and serving as the firm’s Corporate Director of Account Management. There she reported to the CEO and was responsible for the firm’s key customer business throughout the world and grew revenue from $130M to $200M in over two years. Previous to that, she was a Senior Consultant with Towers Perrin, and an Account Manager with Hewitt Associates consulting across a variety of industries including technology, financial services and retail.</p>\n\n<p>Tina acquired her initial experience with GTE’s Financial Associate Development Program, and has her undergraduate degree in Accounting from Fairfield University in Fairfield, CT. </p>","image":{"available_sizes":[[[112,150],"assets/images/resized/0001/8711/18711v1-max-150x150.jpg"],[[150,200],"assets/images/resized/0001/8711/18711v1-max-250x250.jpg"],[[150,200],"assets/images/resized/0001/8711/18711v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://www.saba.com/company/management_team/tweinfurther.htm\" title=\"Saba\" rel=\"nofollow\">Saba</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Senior Vice President, Saba Corporate Strategy","firm":{"name":"Saba","permalink":"saba","type_of_entity":"company","image":{"available_sizes":[[[106,60],"assets/images/resized/0001/8704/18704v1-max-150x150.png"],[[106,60],"assets/images/resized/0001/8704/18704v1-max-250x250.png"],[[106,60],"assets/images/resized/0001/8704/18704v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}