{"first_name":"TINK","last_name":"- - - -","permalink":"tink","crunchbase_url":"http://www.crunchbase.com/person/tink","homepage_url":"http://stripcheez.com/","birthplace":"Canada","twitter_username":"Tink_is_Fab","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"tink, entertainment, stripcheez, comedy, burlesque, striptease, film, production-designer, design","alias_list":null,"created_at":"Fri Jan 08 00:57:59 UTC 2010","updated_at":"Sun Jan 10 08:00:17 UTC 2010","overview":"<p>TINK is the founder and &#8220;Grande Fromage&#8221; of StripCHEEZ.com, a video-pased social-networking site that celebrates the arts of Burlesque and Comedic Stripping.</p>\n\n<p>Born in Canada to globetrotting parents, Tink was raised in numerous locales across Europe and Canada. This filled him with a great sense of adventure and curiosity, characteristics which grew exponentially when he struck out on his own to study design at Ryerson University in Toronto. It was there that his eyes first opened to the many possibilities available to anyone with a dream, and handily, the same great sense of adventure and curiosity.</p>\n\n<p>After university came a variety of opportunities worldwide: acting in Toronto, modeling in Milan, London and Barcelona, pursuing design in Tokyo and New York, then evolving into the entertainment industry, which best took advantage of his abilities and passions.</p>\n\n<p>From his current base in Vancouver, has created and launched StripCHEEZ.com and is developing another, charity-based website for launch in the spring of 2010. Concurrent with this, TINK serves as Production Designer on visually unique feature films and television series. He has also produced two large exhibitions on the local Vancouver creative talent, written, directed and produced a video documentary entitled Fast Forward, plus three short films; Pamplemousse, The Pick-up and Love is in the Air and a music video for the artist Lily Frost.</p>\n\n<p>Pamplemousse has achieved international success with sales throughout Europe, North America, South America and Asia. It is represented by ForeFront Films of New York and Atom Films of Seattle.</p>\n\n<p>Currently, Tink is traveling the world chasing adventures and wrestling dreams into willful submission.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.tinkworld.com/","title":""}]}