{"first_name":"Tit","last_name":"Meng Ang","permalink":"tit-meng-ang","crunchbase_url":"http://www.crunchbase.com/person/tit-meng-ang","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unify² (Unify Square) ","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Nov 08 21:38:25 UTC 2012","updated_at":"Wed Nov 14 06:25:25 UTC 2012","overview":"<p>As the Managing Director of Unify² Asia Pacific based in Singapore, Tit-Meng Ang (‘Tit-Meng’) oversees all aspects of Unify2 Asia Pacific business including Sales (products, solutions and services), Customer Experience, Delivery, and building out a talent pool of trusted advisors (UC architects) for our enterprise customers.</p>\n\n<p>(Unify²s Asia Pacific business region covers Japan, Greater China Region, South East Asia, Indian subcontinent as well as Australia &amp; New Zealand.)</p>\n\n<p>Tit-Meng brings over 23 years of experience in Enterprise Solutions Sales, especially in the Asia-Pacific enterprise ecosystem from his 13.5 years at Microsoft Asia-Pacific.</p>\n\n<p>Tit-Meng was previously  the EPG Director for Microsoft Malaysia, the EPG Director for Microsoft APAC (based in Hong Kong, and responsible for $500M in enterprise software revenue from the MS APAC/GCR regions), General Manager for Microsoft Enterprise Partnerships for China (based in Beijing), and most recently drove the strategic alliance between Microsoft and Lenovo, out of Singapore.</p>\n\n<p>Prior to Microsoft, Tit Meng worked in Sales at NCR, sales at a healthcare startup, and then sales at Oracle, bringing significant experience in vertical industries (healthcare, financial services, and transportation and logistics) that will directly apply to Unify² Communication Enabled Business Process (CEBP) initiatives in the region.</p>\n\n<p>Tit-Meng graduated with Bachelors’ (Honors) Degree in Economics from the National University of Malaysia. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director APAC ","firm":{"name":"Unify² (Unify Square) ","permalink":"unify-2","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0021/4911/214911v2-max-150x150.png"],[[250,74],"assets/images/resized/0021/4911/214911v2-max-250x250.png"],[[450,133],"assets/images/resized/0021/4911/214911v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}