{"first_name":"Title","last_name":"Junction","permalink":"title-junction","crunchbase_url":"http://www.crunchbase.com/person/title-junction","homepage_url":"http://www.title-junction.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"real-estate-title, fort-myers-title-insurance, title-insurance","alias_list":null,"created_at":"Tue Mar 01 17:16:03 UTC 2011","updated_at":"Sun Mar 06 01:33:28 UTC 2011","overview":"<p>Title Junction is a comprehensive real estate title provider, serving Cape Coral, Fort Myers and the entire state of Florida. Jennifer L. Ferri established the real estate title company in 2005 on the foundation of 20 plus years of experience in all aspects of the real estate market.</p>\n\n<p>Title Junction has a unique vision for the Cape Coral and Fort Myers title insurance industry and a strong commitment to all of its customers. Title Junction&#8217;s employees are proactive professionals that focus on communication and service in order to meet all of their client&#8217;s real estate title insurance needs. The company is committed to providing prompt, courteous, and professional service in order to implement solutions. Overall, Title Junction is a title insurance company that creates the best real estate and closing relationship possible.</p>\n\n<p>Title Junction meets its commitment by offering nearly every service that their clients need in the real estate title market. The company handles real estate transactions including residential, commercial, and industrial properties; refinancing, foreclosures, and short sales; new constructions, vacant land, and for sale by owner, FHA and VA closings, and 1031 exchanges. In addition, Title Junction also incorporates witness and courtesy closings, escrow services, and public notary services as a title insurance company that is dedicated to closing deals in a timely manner.</p>\n\n<p>Title Junction treats each one of its customers like a family member and not just a business opportunity.</p>","image":{"available_sizes":[[[150,65],"assets/images/resized/0012/4460/124460v2-max-150x150.jpg"],[[250,109],"assets/images/resized/0012/4460/124460v2-max-250x250.jpg"],[[334,146],"assets/images/resized/0012/4460/124460v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.title-junction.com/","title":"real estate title"}]}