{"first_name":"Tobias","last_name":"Flaitz","permalink":"tobias-flaitz","crunchbase_url":"http://www.crunchbase.com/person/tobias-flaitz","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Burda Digital Systems","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jan 29 23:39:11 UTC 2009","updated_at":"Thu Jan 29 23:39:10 UTC 2009","overview":"<p>Tobias Flaitz (38) is Head of Strategic Business with Burda Digital Systems in Munich, Germany since January 2007. Burda Digital Systems is the IT subsidiary company of Hubert Burda Media which offers new visions and execution capabilities with state of the art, highly flexible technology solutions. The company&#8217;s core competency is the full IT service offering from strategy to conceptualization, creation, implementation and operation of digital business with focus on internet related businesses.</p>\n\n<p>Before joining Hubert Burda Media, Tobias worked as Manager in Business Consultancy for Accenture and Booz Allen Hamilton for more than 8 years. As consultant, Tobias gained international experience in Europe, the USA and Arabia and gathered valuable methodical capabilities from different industries and competencies. He was founding member of the advisory board to the Managing Director of Accenture for Austria, Switzerland and Germany in 2001.</p>\n\n<p>Tobias holds two master degrees, one in chemical process engineering from the University of Stuttgart, Germany, and one in Business Administration from the University of St.Gallen (HSG), Switzerland. With a team of HSG peers, he won the first price in a venture capital competition for the concept of a mobile community media venture in 2002. He studied abroad at the Universities of Berkeley, Michigan (both USA) and Seville (Spain).</p>","image":{"available_sizes":[[[136,150],"assets/images/resized/0003/5284/35284v1-max-150x150.jpg"],[[227,250],"assets/images/resized/0003/5284/35284v1-max-250x250.jpg"],[[240,264],"assets/images/resized/0003/5284/35284v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Head of Strategic Business","firm":{"name":"Burda Digital Systems","permalink":"burda-digital-systems","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}