{"first_name":"Todd","last_name":"Hanson Ph. D","permalink":"todd-hanson-ph-d","crunchbase_url":"http://www.crunchbase.com/person/todd-hanson-ph-d","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1968,"born_month":11,"born_day":15,"tag_list":"","alias_list":null,"created_at":"Thu Aug 05 07:07:41 UTC 2010","updated_at":"Fri Aug 06 17:52:23 UTC 2010","overview":"<p>Dr. Todd Hanson Ph.D is a recognized authority in the trading industry, with his opinion regularly sought by media outlets including CNBC, Reuters, Barron’s, Fox News, and many others.</p>\n\n<p>Todd Hanson PhD is currently CEO of Livetradesignals. </p>\n\n<p>Todd Hanson PhD  began his professional career in computer security in Silicon Valley, Calif. He developed encryption software and provided ethical hacking services and security audits to Fortune 500 companies during the infancy of the Internet. He led a nationwide team of security engineers responsible for research and development in categories including: intrusion detection; emerging data network service security infrastructure design; Internet and intranet security engineering; public key technology and infrastructure issues; Internet and intranet firewall and router integration; and client/server authentication techniques. In addition to Dr. Todd Hanson PhD  extensive background in information security management and information technology systems engineering and administration, he is a Certified Information Systems Security Professional, a Certified Information Security Manager, and a Certified Information Systems Auditor. </p>\n\n<p>During his fifteen years in these industries, he has held positions ranging from contracted software development to chief executive officer. As CEO of Synergy Software Development (NASDAQ: SGYS), Dr. Hanson led the company from concept to funding and public offering, utilizing his software development technology as a cornerstone. As a chief information officer for two separate public companies, (NASDAQ: USTK and TRUC), Dr. Hanson leveraged his custom-developed technologies to raise more than $35 million in funding for the firms. </p>\n\n<p>Throughout his career  Todd Hanson Ph.D has also performed numerous financial consulting projects for a myriad of companies in finance and has applied his expertise in statistical pattern recognition to projects ranging from mining financial transactions data to statistical arbitrage trading strategies.</p>","image":{"available_sizes":[[[90,90],"assets/images/resized/0009/6102/96102v2-max-150x150.png"],[[90,90],"assets/images/resized/0009/6102/96102v2-max-250x250.png"],[[90,90],"assets/images/resized/0009/6102/96102v2-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"Ph.D","subject":"Applied Mathematics","institution":"University of California, Berkeley ","graduated_year":2000,"graduated_month":null,"graduated_day":null},{"degree_type":"MS","subject":"Computer Science","institution":"National University","graduated_year":1996,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://hk.linkedin.com/in/toddhansonphd","title":"Linkedin"},{"external_url":"http://www.facebook.com/people/Todd-Hanson/100000158858411","title":"FaceBook"}]}