{"first_name":"Todd","last_name":"Smith","permalink":"todd-smith-3","crunchbase_url":"http://www.crunchbase.com/person/todd-smith-3","homepage_url":"http://www.ipad-video.biz/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1990,"born_month":6,"born_day":4,"tag_list":"overview-apple-ipad-2010","alias_list":null,"created_at":"Wed Dec 22 09:22:56 UTC 2010","updated_at":"Sat Dec 25 18:41:37 UTC 2010","overview":"<p>For more than a decade, nobody, not even a deep-pocketed company like Microsoft, has successfully cracked the tablet market. Apple, based on the tests over several days, is likely to be the first. The first iPad is a winner. It stacks up as a formidable electronic-reader rival for Amazon&#8217;s Kindle. It gives portable game machines from Nintendo and Sony a run for their money. At the very least, the iPad will likely drum up mass-market interest in tablet computing in ways that longtime tablet visionary and Microsoft co-founder Bill Gates could only dream of.</p>\n\n<p>Back in 2001 when Microsoft first got into tablets, Bill Gates predicted that within five years tablets would be the most popular form of PCs sold in America. That obviously didn&#8217;t come to pass. Apple&#8217;s roots with the tablet form of computing date at least to its ill-fated Newton, an early 1990s personal digital assistant pushed by then-CEO John Sculley and later killed by Steve Jobs. The Windows–powered tablets that appeared as early as 2000 — chunky machines operated with a stylus — are instead footnotes in tech history. The tablet era is only now beginning, and Steve Jobs at Apple is the one defining it.</p>\n\n<p>The half-inch-thick, magazine-size iPad is thin and, at 1.5 pounds, light with a gorgeous, glossy, backlit 9.7-inch multitouch display. The fingerprint-resistant screen has an exceptionally wide viewing sweet spot for a movie and is terrific for showing off most of a Web page. The device resembles an iPhone on growth hormones. It shares many of the smaller handheld&#8217;s design elements, down to the lone home button below the display. As on the iPhone, you can have up to 11 screens of icons. </p>\n\n<p>IPad has the same kind of smart sensors that change the orientation of the screen from portrait to landscape, depending on how it&#8217;s rotated. (It&#8217;s always right side up.) And, like the iPhone, it takes its cue from your fingers, whether you pinch to zoom in or out on Web pages, location-based maps and pictures — or flick to scroll up or down a page. You can easily search across all content.</p>\n\n<p>The iPad will run just about all of the 150,000-plus iPhone or iPod Touch apps sold (or available free) in the App Store, presenting boundless &#8220;there&#8217;s an app for that&#8221; possibilities. If you own an iPhone or Touch, you already have a stable of programs to work on the iPad. </p>\n\n<p>None of this is lost on Apple, which is encouraging developers to write for the bigger screen. Apple expects more than 1,000 iPad-specific apps to be available at launch. </p>\n\n<p>The iPad&#8217;s splendor and power may be best shown by The Elements: A Visual Exploration The $13.99 program is more electronic book than traditional app, but it&#8217;s not like any e-book you&#8217;ve seen. The periodic table of elements comes to life when you touch your finger against any element. Handsome photographs of objects spin around so you can observe them from all vantage points. </p>\n\n<p>The iPad is not so much about what you can do — browse, do e-mail, play games, read e-books and more — but how you can do it. That&#8217;s where Apple is rewriting the rulebook for mainstream computing. There is no mouse or physical keyboard. Everything is based on touch. All programs arrive directly through Apple&#8217;s App Store. Apple&#8217;s tablet is fun, simple, stunning to look at and blazingly fast. Inside is a new Apple chip, the A4. </p>\n\n<p>What does a successful iPad launch mean for traditional netbooks? They&#8217;ll have to adapt or disappear — especially since their price advantage compared with the entry-level iPad isn&#8217;t as great as some might have thought it would be. &#8220;You can use the iPhone as the blueprint for how this will play out,&#8221; Munster says.</p>\n\n<p>Early buyers (and those who were among the first to reserve the iPad online) can get one Saturday at Apple Stores and certain Best Buys. Those who preorder it now online must wait until April 12 because of apparent shortages.</p>\n\n<p>The iPad has its share of Version 1.0 inadequacies. It doesn&#8217;t multitask, save playing iTunes music in the background. There&#8217;s no webcam for those of us hoping to do video chats. The battery is sealed. It&#8217;s too big for your pocket.</p>\n\n<p>Videos failed to play at Hulu and ESPN, among other Web destinations. Why? The Safari browser on the iPad doesn&#8217;t support videos based on the popular Adobe Flash Internet video standard. </p>\n\n<p>The issue may be alleviated over time. Apple is backing an emerging video standard called HTML5. Brightcove, whose video technology is used by many media companies, said it plans to offer HTML5 video streaming to its customers. The iPad can also display video at YouTube (there&#8217;s an app for that), Vimeo and the White House website, whitehouse.gov.</p>\n\n<p>Some will decry the absence of a USB port or other connectors, which might let you hook up a printer or bolster storage. Everything comes through the standard iPod-like dock connector on the bottom of the iPad. You can purchase a $29 iPad Camera Connection Kit, which lets you connect a USB camera or import photos via an SD card. Meanwhile the absence of CD-ROM may also be a disappointed part of iPad, if iPad users want to play their movies on iPad, in order to cover the shortage, they need the help of movie converter for iPad software which supports movies converting.</p>\n\n<p>Many people will still need a more traditional computer. You can&#8217;t edit video on an iPad. And the virtual onscreen keyboard that pops up when needed is fine for e-mails or scribbling notes, but I wouldn&#8217;t want to regularly write articles using it. </p>\n\n<p>You can employ a wireless Bluetooth keyboard, and Apple sells an optional $69 iPad Keyboard Dock. It&#8217;s a full-size keyboard that connects to the dock connector. Apple sells a $39 soft microfiber case that doubles as a stand for watching videos and slideshows. You can bank on third-party companies to provide other accessories and how-to tutorial. </p>\n\n<p>So many third-party software development companies have already set their sights on this huge potential market and aimed at the profits this iPad can bring. Since this revolutionary and innovative iPad is running on the iPhone operating system (currently, version 3.2), users cannot transfer files to iPad freely. In order for iPad users to transfer dvd to iPad and work better to enhance iPad users enjoyment between iPad and any other portable device. Many how-to tutorials have been created, like how to convert dvd to iPad.</p>\n\n<p>The iPad has built-in notes, calendar and contacts applications, and Apple sells slick, redesigned versions of its iWork productivity applications — $10 each for the Keynote presentation program, the Pages word processor and the Numbers spreadsheet. Still, for most folks, the iPad is more about consuming content than creating it. </p>\n\n<p>Apple has pretty much nailed it with this first iPad, though there&#8217;s certainly room for improvement. Nearly three years after making a splash with the iPhone, Apple has delivered another impressive product that largely lives up to the hype. </p>\n\n<p>Jobs unveiled the avidly anticipated gadget on Jan. 27 at a highly choreographed event in San Francisco. Onstage in front of a rapt audience, he coyly asked if there was room for a new computing device that fell somewhere between a smartphone and a laptop. &#8220;We think we&#8217;ve got something,&#8221; Jobs said. &#8220;We call it the iPad.&#8221;</p>\n\n<p>With those words, Jobs sent nearly every major consumer technology company scrambling to create its own version of the iPad. Apple was already the innovation leader in mobile hardware thanks to the iPod and the iPhone, but the iPad has cemented that position. The media tablet market, which research firm Gartner Inc. projects will grow by nearly 700% over the next three years, is one Apple essentially enjoys all to itself for now. More significantly, the iPad&#8217;s success is a growing threat to the companies that dominate the personal computing industry, such as Microsoft, Hewlett–Packard and Intel.</p>\n\n<p>The iPad phenomenon has surprised almost everyone. At release time, the tech community was underwhelmed. &#8220;I think this will appeal to the Apple acolytes, but this is essentially just a really big iPod Touch,&#8221; Forrester analyst Charles Golvin told The New York Times. Another analyst wrote in a research note, &#8220;On balance, we view the iPad as a modest disappointment.&#8221; There was no camera, no Flash capabilities, and it could run only one program at a time. Worst of all, it wasn&#8217;t clear why anyone would pay $500 or more to carry it around. </p>\n\n<p>Such criticisms were forgotten soon after the iPad appeared in stores in April — and sales exploded. &#8220;Our initial thoughts were that Apple would sell 3.5 million iPads in the U.S. in 2010,&#8221; says Sarah Rotman Epps, a consumer electronics analyst at Forrester Research. &#8220;That was really, really wrong.&#8221; She now estimates between eight million and 10 million will be sold in the U.S., and more than 15 million globally. In the first 80 days alone, Apple peddled roughly three million iPads, more than triple the sales pace of the iPhone when it debuted in 2007. That gives the iPad the fastest adoption rate of any tech gadget in history, according to New York&#8217;s Bernstein Research. </p>\n\n<p>In seeking an explanation for the iPad&#8217;s success, it&#8217;s natural to point to Jobs&#8217;s uncanny instincts. If Apple operated like other companies and conducted focus groups to gauge demand, perhaps there would be no iPad. But Jobs pursued his own agenda, and it was only after the iPad appeared that the public realized they did indeed want such a device. &#8220;To create a brand new product category, it takes a pretty ballsy company,&#8221; says Andrew Brown, director of the wireless enterprise group at U.K. research firm Strategy Analytics.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.ipad-video.biz/","title":"video converter for ipad"},{"external_url":"http://www.dvd-to-ipad-converter.biz/","title":"dvd to ipad converter"},{"external_url":"http://www.videoipadconvertermac.com/","title":"ipad video converter mac"},{"external_url":"http://www.movietoipad.com/","title":"movie converter for ipad"}],"web_presences":[]}