{"first_name":"Todd","last_name":"Fast","permalink":"todd-fast","crunchbase_url":"http://www.crunchbase.com/person/todd-fast","homepage_url":"http://toddfast.com","birthplace":"","twitter_username":"toddfast","blog_url":"","blog_feed_url":"","affiliation_name":"zembly","born_year":null,"born_month":null,"born_day":null,"tag_list":"conga-java-software-cloud-paas-zembly-jna-veteran-cto-twitterdata","alias_list":null,"created_at":"Sat Apr 11 23:29:38 UTC 2009","updated_at":"Tue Nov 16 02:44:05 UTC 2010","overview":"<p>Todd Fast is co-founder of Conga, Inc.</p>\n\n<p>Before Conga, Todd was Chief Architect of Platform as a Service offerings at Sun Microsystems, and CTO and founding principal of Zembly (http://zembly.com), Sun&#8217;s hosted application platform and browser-based social development environment. He was also lead author of the Twitter Data proposal (http://twitterdata.org).</p>\n\n<p>Prior to zembly, Todd was Chief Architect of SOA, XML, and Java Enterprise Tools at Sun. While working in the Developer Tools group, he conceived and shipped the world&#8217;s first real-time developer collaboration platform in a mainstream IDE, including features like integrated presence, code-aware chat, pair programming at a distance, simultaneous co-editing, and remote builds.</p>\n\n<p>More recently, Todd was the founder of the popular Java Native Access (JNA) library, a Java-only bridge to native code from the Java VM which now powers core functionality in popular frameworks like JRuby and Jython.</p>\n\n<p>Prior to Sun, Todd held positions as Principal Consultant and Engineer with NetDynamics, Inc., the company that invented and popularized the application server. There, in addition to developing high-performance application server runtimes, he worked with a diverse range of companies ranging from Silicon Valley startups to Fortune 100 enterprises architecting and building both enterprise and e-commerce websites.</p>\n\n<p>As a senior architect and technical leader, Todd has deep expertise in cloud and web application development; app server runtimes; developer tools, frameworks, and platforms; and is a veteran at leading product teams through the tricky process of shipping innovative products. </p>\n\n<p>He is a co-author, a provocative and engaging public speaker, and JavaOne Rock Star. Todd holds two patents, and is named on more than ten patents pending. He earned a B.S.M.E. from the University of Texas at Austin.</p>\n\n<p>In the 1980s at the age of 13, Todd whiled away his free time programming games in 6510 assembly. In the &#8217;90s, he moved on to compose the score for a famous Hollywood director&#8217;s first student film, and discovered a bug that crashed Microsoft.com for several hours.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0011/0362/110362v2-max-150x150.png"],[[166,250],"assets/images/resized/0011/0362/110362v2-max-250x250.png"],[[200,300],"assets/images/resized/0011/0362/110362v2-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"B.S.","subject":"Mechanical Engineering","institution":"University of Texas at Austin","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Co-Founder","firm":{"name":"Conga","permalink":"conga","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0010/9435/109435v7-max-150x150.png"],[[200,200],"assets/images/resized/0010/9435/109435v7-max-250x250.png"],[[200,200],"assets/images/resized/0010/9435/109435v7-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"","firm":{"name":"zembly","permalink":"zembly","type_of_entity":"company","image":{"available_sizes":[[[150,54],"assets/images/resized/0004/1265/41265v2-max-150x150.png"],[[250,91],"assets/images/resized/0004/1265/41265v2-max-250x250.png"],[[276,101],"assets/images/resized/0004/1265/41265v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}