{"first_name":"Todd","last_name":"Chaffee","permalink":"todd-chaffee","crunchbase_url":"http://www.crunchbase.com/person/todd-chaffee","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Institutional Venture Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Aug 15 05:29:05 UTC 2008","updated_at":"Mon May 21 00:00:25 UTC 2012","overview":"<p>Todd Chaffee joined Institutional Venture Partners (IVP) in March 2000. He focuses on venture capital and growth equity investments in rapidly growing media, travel and technology companies. He has more than 25 years of operating and investment experience. Todd was recognized by Forbes Magazine as one of the top 100 venture capitalists in the world by his inclusion in the Forbes Midas List. He was also recognized by AlwaysOn as one of the top 100 venture capitalists by his inclusion in the AlwaysOn VC 100 List.</p>\n\n<p>Todd has led investments in Akamai (AKAM), ArcSight (HPQ), Ariba (ARBA), Business Insider, ComScore (SCOR), CyberSource (CYBS), Domo, Digital River (DRIV), Epiphany (EPNY), Extensity (EXTN), H5 Technologies, HomeAway (AWAY), InphoMatch (SAP), Inspirato, Kayak, LivingSocial, LoopNet (LOOP), Mobile 365 (SAP), Mobileway (SAP), Netflix (NFLX), Nuance Communications (NUAN), Omniture (ADBE), Open Market (OMKT), Trintech (TTPA), Twitter, VeriSign (VRSN), Verisity (VRST) and Yahoo (YHOO). Todd has also actively participated in IVP&#8217;s investments in Advent Software (ADVS), Artisan Components (ARTI), At Road (TRMB), Business.com (DEXO), CafePress, Carbonite, Concur Technologies (CNQR), Danger (MSFT), MarkMonitor, Quigo Technologies (TWX), Sugar, Tripwire, Websense (WBSN) and Yodlee.</p>\n\n<p>Prior to IVP, Todd was Executive Vice President of Visa International. His responsibilities included overseeing the Advanced Technology, Strategic Planning, Corporate Development and Equity Investment divisions for Visa. He was also the President of Visa Marketplace, Inc. (Visa&#8217;s investment subsidiary) and managed Visa&#8217;s global technology investment portfolio. Under Todd&#8217;s leadership, Visa&#8217;s venture capital operation generated more than $1.2 billion in gains and his investments produced a 32.8x multiple of invested capital with an IRR of 243.4%.</p>\n\n<p>Todd joined Visa in 1994 as Senior Vice President of Advanced Payment Systems. After establishing and growing Visa&#8217;s highly successful venture capital business, he was promoted to Executive Vice President of Visa International, becoming the youngest Executive Vice President in Visa&#8217;s history. Prior to Visa, Todd held management positions at Fortune 500 companies such as American Express, Wells Fargo/Norwest and TRW Information Systems Group. During his career, he also founded Grand Expeditions, Inc., a global luxury and adventure travel company with revenues in excess of $200 million.</p>\n\n<p>Todd earned a B.S. with honors from the University of Minnesota Carlson Business School. He also completed the Stanford Graduate Business School Advanced Management Program and the Harvard Business School Venture Capital Program.</p>","image":{"available_sizes":[[[129,117],"assets/images/resized/0004/8565/48565v1-max-150x150.jpg"],[[129,117],"assets/images/resized/0004/8565/48565v1-max-250x250.jpg"],[[129,117],"assets/images/resized/0004/8565/48565v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.S.","subject":"","institution":"University of Minnesota Carlson Business School","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Institutional Venture Partners","permalink":"institutional-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,68],"assets/images/resized/0001/5065/15065v3-max-150x150.jpg"],[[250,113],"assets/images/resized/0001/5065/15065v3-max-250x250.jpg"],[[450,204],"assets/images/resized/0001/5065/15065v3-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Board Member","firm":{"name":"HomeAway","permalink":"homeaway","type_of_entity":"company","image":{"available_sizes":[[[150,37],"assets/images/resized/0001/2422/12422v5-max-150x150.jpg"],[[250,62],"assets/images/resized/0001/2422/12422v5-max-250x250.jpg"],[[450,112],"assets/images/resized/0001/2422/12422v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}