{"first_name":"Todor","last_name":"Fay","permalink":"todor-fay","crunchbase_url":"http://www.crunchbase.com/person/todor-fay","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"NewBlue","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue May 04 19:10:06 UTC 2010","updated_at":"Fri May 06 21:31:56 UTC 2011","overview":"<p>With more than 25 years of software development experience, Todor J. Fay holds 25 audio and video technology patents and has developed nearly 50 successful digital media software products. As President/Chief Technology Officer and co-founder of digital video startup NewBlue, Inc., Fay leads all technology development and architecture design, in addition to guiding the company&#8217;s overall direction. His proven, innovative take on aesthetic technology design provides the company with a vast library of intellectual property, which is currently monetized as NewBlueFX and the upcoming Vibop consumer video service.</p>\n\n<p>Fay&#8217;s career in creative technology stemmed from an early interest in filmmaking and music synthesizers as a teenager. As an undergraduate, he earned his AB in communications from Stanford University, during which time he spent a year as a film student at the California Institute of the Arts. He followed his undergraduate education by earning a MS, Computer Science from Stanford University, as well.</p>\n\n<p>A pioneer in MIDI and music technology, Fay co-founded The Blue Ribbon SoundWorks with partner Melissa Jordan Grey in 1988. At Blue Ribbon, he led the creation of 17 music software titles and 6 audio hardware products. These products were noted not only for their innovation in music and audio, but also for the way they integrated with video software at a time when integration was unheard of. His Score Technology architecture, which became the AudioActive interactive music engine, won Best of Comdex in 1995 and soon after, the company was acquired by Microsoft Corporation.</p>\n\n<p>While at Microsoft, Fay led the creation of DirectMusic and ultimately managed all of the DirectX Audio APIs before moving to the Xbox division to work on advance technologies. A published author (DirectX Audio Exposed) and noted speaker, Fay is a respected expert on digital media technologies and has acted in an advisory capacity for the Interactive Audio Special Interest Group’s DLS1 committee and the MIDI Manufacturer’s Association’s technology board. Notable among his achievements is the co-authoring of the Downloadable Sample 1 specification.</p>\n\n<p>For two and a half decades, Todor Fay has created myriad ways of merging arts and technology into successful, profitable technologies. When not dreaming up his next invention, he spends time pursuing his three &#8220;S&#8221;s (soccer, surfing and squash) and entertaining his wife and sons with ridiculous tales of his past.</p>","image":null,"degrees":[{"degree_type":"AB","subject":"Communications","institution":"Stanford University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"Masters","subject":"Computer Science","institution":"Stanford University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Co-Founder & CEO","firm":{"name":"NewBlue","permalink":"newblue","type_of_entity":"company","image":{"available_sizes":[[[150,112],"assets/images/resized/0010/3914/103914v2-max-150x150.png"],[[250,186],"assets/images/resized/0010/3914/103914v2-max-250x250.png"],[[450,336],"assets/images/resized/0010/3914/103914v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.newblueinc.com","title":"NewBlue Corporate"},{"external_url":"http://www.newbluefx.com","title":"NewBlueFX"},{"external_url":"http://www.vibop.com","title":"Vibop!"}]}