{"first_name":"Tom","last_name":"D'Ambrosio","permalink":"tom-dambrosio","crunchbase_url":"http://www.crunchbase.com/person/tom-dambrosio","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"PositiveTALK","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Sep 11 00:30:50 UTC 2011","updated_at":"Sun Mar 18 13:25:08 UTC 2012","overview":"<p>Prior to co-founding PositiveTALK, Tom was a Senior Vice President and Chief Technology Officer for Ultimate Escapes (formally AMEX: ULEI), the second largest luxury destination club in the world. </p>\n\n<p>Prior to Ultimate Escapes, Tom served as the Chief Information Officer for Reuters Research, a division of Reuters PLC (now Thomson Reuters, NYSE: TRI) formed with the acquisition of Multex.com, Inc. (formally NASDAQ: MLTX). Tom served as Chief Information Officer and Chief Security Officer for Multex.com, a very successful startup company that created the first Internet-based online broker research network, which provided more than 2 million users with online financial information and brokerage research. </p>\n\n<p>Prior to Multex, Tom served as Director of Advanced Systems Development for Automatic Data Processing (NYSE: ADP), designing and building the first Microsoft Windows based market data workstation. Tom received a Bachelor of Science in Business Information Systems and an Associate of Science degree in Computer Technology. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CTO","firm":{"name":"PositiveTALK","permalink":"positivetalk","type_of_entity":"company","image":{"available_sizes":[[[150,40],"assets/images/resized/0015/3601/153601v2-max-150x150.jpg"],[[250,66],"assets/images/resized/0015/3601/153601v2-max-250x250.jpg"],[[450,120],"assets/images/resized/0015/3601/153601v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}