{"first_name":"Tom","last_name":"Weithman","permalink":"tom-weithman","crunchbase_url":"http://www.crunchbase.com/person/tom-weithman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Nov 18 14:42:09 UTC 2008","updated_at":"Tue Nov 18 14:44:18 UTC 2008","overview":"<p>As managing director, Tom Weithman has developed, championed and grown CIT GAP Funds, a family of seed-stage venture funds focused on making equity investments at the earliest stages of tech company formation.  Beginning in 2004, Weithman capitalized the inaugural GAP Fund I, developed and implemented all deal souring, due diligence, and portfolio management processes, and recruited all members of the investment team and GAP Fund board.  Weithman maintains leadership for all day-to-day fund operations, investment strategy, and portfolio management activity. Since launching GAP Fund I in 2005, Weithman&#8217;s team has placed 17 seed-stage equity investments and attracted more than $15M of private equity investment into GAP Fund I portfolio companies, driven 4 portfolio companies to Series-A investment, and propelled one portfolio company to an acquisition event. GAP Fund I has been recognized by Entrepreneur Magazine as a Top 100 venture fund in 2005, 2006, and 2007.  Building on this success, Weithman launched the GAP BioLife Fund and the GAP Tech Fund in 2007. Weithman brings to CIT GAP Funds a strong prior executive experience in sales, business development, and operations with both IBM and a Hughes Electronics-backed software and IT services start-up and has raised over $50M in funding for numerous early stage technology companies.  A board member of the Virginia Tech Intellectual Property Foundation, Weithman is active in numerous angel investment, venture capital, and entrepreneurial support organizations, speaking frequently on the subjects of seed stage investing, federal R&amp;D funding, and technology transfer. Weithman holds a Bachelor’s degree from the University of Notre Dame, an MBA from Michigan State University and a Master&#8217;s degree in Public Administration from Harvard&#8217;s John F. Kennedy School of Government.</p>","image":{"available_sizes":[[[126,150],"assets/images/resized/0002/8819/28819v1-max-150x150.jpg"],[[160,190],"assets/images/resized/0002/8819/28819v1-max-250x250.jpg"],[[160,190],"assets/images/resized/0002/8819/28819v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director ","firm":{"name":"CIT GAP Funds","permalink":"cit-gap-funds-2","type_of_entity":"financial_org","image":{"available_sizes":[[[150,75],"assets/images/resized/0002/8818/28818v2-max-150x150.png"],[[218,110],"assets/images/resized/0002/8818/28818v2-max-250x250.png"],[[218,110],"assets/images/resized/0002/8818/28818v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}