{"first_name":"Tom","last_name":"Scholl","permalink":"tom-scholl-2","crunchbase_url":"http://www.crunchbase.com/person/tom-scholl-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Nov 25 07:09:37 UTC 2008","updated_at":"Tue Nov 25 07:16:35 UTC 2008","overview":"<p>Tom is a successful entrepreneur and investor with experience sitting on both sides of the boardroom table. He has over twenty-five years experience in communications systems, equipment, chipsets and software, and has been active in the high-tech start-up scene in the Washington metro area for over 15 years.</p>\n\n<p>He currently sits on the boards of Novak Biddle portfolio companies Centice, Paratek, Princeton Optronics, Command Information, Fiberzone Networks, Digital Bridge and Avail Media.</p>\n\n<p>In 1990, Tom founded Telogy Networks, a leader in providing embedded communications software products for wireless and IP networks. Telogy’s award-winning products were proven market successes with world-class customers such as Cisco, Motorola, Samsung, Nortel, Alcatel and NEC. In 1998, Motorola purchased Telogy’s digital cellular technology and development team for over $40M, and in 1999, Texas Instruments purchased Telogy as the leader in embedded VOIP software for over $700M.</p>\n\n<p>Prior to joining Novak Biddle, Tom co-founded and was chairman of Cognio, a developer of spectrum management and MIMO antenna technology for wireless applications. Cognio was acquired by Cisco in October 2007. Tom has also served as a Director of Torrent Networking, acquired by Ericsson, and Integrated Telecom, acquired by PMC Sierra.</p>\n\n<p>In 1995, Tom was recognized as the Joseph A. Sciulli &#8220;Entrepreneur of the Year&#8221; by the Maryland High Technology Council. Prior to Telogy, Tom was Senior Vice President of Engineering at Hughes Network Systems, a combination of M/A-Com DCC and Linkabit.</p>\n\n<p>Tom is a member of the Board of Trustees at the University of Maryland and Chairman of the Board of Visitors at the Clark School of Engineering. He is also a member of the Dean’s Advisory Council of the College of Liberal Arts at Purdue University.</p>\n\n<p>Tom has patents relating to software, the Internet, and digital telephone systems, and he is the author of &#8220;Packet Switching&#8221; in McGraw Hill’s Electronic Communications Handbook. He’s a member of IEEE and ACM, and he is an alumnus of Purdue University and the Executive Management (non-dgree) program at MIT Sloan School.</p>\n\n<p>Growing up, Tom was an avid Ham radio operator, and an Eagle Scout.</p>","image":{"available_sizes":[[[122,145],"assets/images/resized/0002/9529/29529v1-max-150x150.jpg"],[[122,145],"assets/images/resized/0002/9529/29529v1-max-250x250.jpg"],[[122,145],"assets/images/resized/0002/9529/29529v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Novak Biddle Venture Partners","permalink":"novak-biddle-venture-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,69],"assets/images/resized/0000/3475/3475v1-max-150x150.png"],[[200,93],"assets/images/resized/0000/3475/3475v1-max-250x250.png"],[[200,93],"assets/images/resized/0000/3475/3475v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}