{"first_name":"tom","last_name":"herry","permalink":"tom-herry","crunchbase_url":"http://www.crunchbase.com/person/tom-herry","homepage_url":"http://saleforowner.blogspot.com/","birthplace":"","twitter_username":"","blog_url":"http://saleforowner.blogspot.com/","blog_feed_url":"http://saleforowner.blogspot.com/feeds/posts/default","affiliation_name":"Unaffiliated","born_year":1985,"born_month":3,"born_day":18,"tag_list":"for-sale-by-owner","alias_list":null,"created_at":"Tue Sep 14 12:20:59 UTC 2010","updated_at":"Thu Sep 23 03:04:02 UTC 2010","overview":"<p>Not everyone knows that selling on your own save sales commission. If you are selling your home as for sale by owner you have the right to not pay any commission even to the agent if the buyer doesn’t have one. Talk to your known friend who have recently sold his/her property and know the experience. If he has listed as for sale by owner then would have a pleasant time selling it else would have spent hell of a time on attending buyers and their agents. Besides would have paid lots of money as sales commission which can be around 6% or 7%. If they have been in contact with Continental Real Estate Group they would have learnt the way to save money while selling as for sale by owner.</p>\n\n<p>For once those property owners who have not sold their property as for sale by owner need to understand the benefits they get with this. Many myths do hover around us that selling as for sale by owner involves too much personal time and work involvement. But you also need to understand the fact that as for sale by owner you save thousands of dollars and you are the own boss to decide the price to sell the property at. For once read various article and personal blogs published on various sites which will support this fact. </p>\n\n<p>Once you decide to sell as for sale by owner you might have few general questions - </p>\n\n<p>How does this work?\nWhere to list the for sale by owner property?\nHow much does this cost to list the FSBO home?\nHow much sales commission do you pay when the deal is closed?\nDoes it take too much time to sell for sale by owner home?</p>\n\n<p>To start with you need to spend some of your valuable time in small research to let you finalize the cost of the property you want to sell at. This is possible with a bit of market research on your local property market. Once you are done with this approach Continental Real Estate Group who will list your property as for sale by owner. It’s not that when you want to sell your property you need to list as for sale by owner. In fact, when you to rent your property you can list as for sale by owner in MLS listing which is the best option to avoid commission paid to the agent.</p>\n\n<p>Continental Real Estate Group will help you do all the necessary paper work that is required to list your home as for sale by owner. These days we all know that for sale by owner is known to be the best option today for home owners if they want to sell the home with lot of savings. To your curiosity how much you save with for sale by owner listing – </p>\n\n<p>When you list in MLS as for sale by owner you end up paying only a small upfront fee which can be $399. </p>\n\n<p>As for sale by owner don’t have to pay the sales commission as paid in past to traditional brokers. </p>\n\n<p>You decide the price of your property while listing as for sale by owner. </p>\n\n<p>To get in touch with for sale by owner listing agent Continental Real Estate Group visit www.ownerama.com.</p>","image":{"available_sizes":[[[139,150],"assets/images/resized/0010/1652/101652v2-max-150x150.jpg"],[[222,239],"assets/images/resized/0010/1652/101652v2-max-250x250.jpg"],[[222,239],"assets/images/resized/0010/1652/101652v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}