{"first_name":"Tom","last_name":"Perkins","permalink":"tom-perkins","crunchbase_url":"http://www.crunchbase.com/person/tom-perkins","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 28 17:18:51 UTC 2008","updated_at":"Thu May 29 02:35:22 UTC 2008","overview":"<p>Tom Perkins is one of Silicon Valley&#8217;s pioneers, with a career spanning entrepreneurship, the management of major corporate activities and most importantly, venture capital. In 1972 he formed America’s premiere venture capital business with co-founder Eugene Kleiner. The partnership and the follow-on Kleiner Perkins Caufield &amp; Byers series of partnerships have created some of the most interesting and innovative businesses in the world.</p>\n\n<p>Prior to Kleiner Perkins, he started a company in the mid-1960’s (University Laboratories) to manufacture lasers based upon his original inventions in optics. The company was successful and merged into Spectra-Physics becoming a major part of that firm’s growth. Later he was the first General Manager of the Hewlett Packard Company’s computer divisions and is credited with establishing the foundation for the enormous growth which that business has enjoyed.</p>\n\n<p>Tom Perkins is a graduate of MIT in Electronic Engineering and Harvard University in Business Administration. He is now, or has been, a Director of the following public corporations: Acuson (Chairman), Applied Materials, Compaq Computer, Corning Glass Works, Genentech (Chairman), Hewlett Packard Company, Hybritech, LSI Logic, The News Corporation, Philips Electronics NV, Spectra-Physics, Symantec and Tandem Computers (Chairman).</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner Emeriti","firm":{"name":"Kleiner Perkins Caufield & Byers","permalink":"kleiner-perkins-caufield-byers","type_of_entity":"financial_org","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/0998/10998v8-max-150x150.jpg"],[[250,250],"assets/images/resized/0001/0998/10998v8-max-250x250.jpg"],[[450,450],"assets/images/resized/0001/0998/10998v8-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}