{"first_name":"Tom","last_name":"Morely","permalink":"tom-morely","crunchbase_url":"http://www.crunchbase.com/person/tom-morely","homepage_url":"http://www.pixpod.com","birthplace":"","twitter_username":"pixpodofficial","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"photobooth, photobooth-london","alias_list":null,"created_at":"Mon Nov 19 11:57:31 UTC 2012","updated_at":"Thu Nov 22 04:36:52 UTC 2012","overview":"<p>PixPod hire photobooths throughout the UK for events such as weddings, proms, charity and a whole lot more. </p>\n\n<p>Weddings, Bar &amp; Bat Mitzvahs\nWhat better way to record the spirit of your special day and picture your guests&#8217; enjoyment! We can print additional copies and put them in a guest book for your friends to sign. Why not use our box of party props – hats, wigs, glasses etc for even more zany pictures! As an option we can customise the backdrop inside the booth, and the panels on the outside to coordinate with your colour scheme or theme.</p>\n\n<p>Corporate Events\nWant to liven up your Corporate function? Then dive into our PixPod and let your hair down! It’s great at award ceremonies, product launches, team building events, or even at an exhibition stand to create interest in your product or service. To personalise the PixPod we can add your company logo or colour scheme as an additional option.</p>\n\n<p>University &amp; Military Balls\nAt the end of your exams let off steam and let it all hang out in our fun PixPod!</p>\n\n<p>Charity Events\nAdd a splash of fun to your fund raising – maybe award a prize for the silliest photo!</p>\n\n<p>School Proms\nBefore you leave school or college have fun with your mates in our PixPod.</p>\n\n<p>Wrap and After show Parties\nCapture the fun – discretion assured if celebs are involved!</p>","image":{"available_sizes":[[[150,56],"assets/images/resized/0022/1001/221001v2-max-150x150.jpg"],[[250,93],"assets/images/resized/0022/1001/221001v2-max-250x250.jpg"],[[288,108],"assets/images/resized/0022/1001/221001v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}