{"first_name":"Tom","last_name":"Woznick","permalink":"tom-woznick","crunchbase_url":"http://www.crunchbase.com/person/tom-woznick","homepage_url":"http://www.snotu.com","birthplace":"US","twitter_username":"snoutymail","blog_url":"","blog_feed_url":"","affiliation_name":"Freestyle Capital","born_year":1962,"born_month":10,"born_day":30,"tag_list":"","alias_list":null,"created_at":"Fri Nov 05 22:22:44 UTC 2010","updated_at":"Tue Jan 04 18:08:11 UTC 2011","overview":"<p>We may be able to have a good business to business relationship. Here is a little about us:  </p>\n\n<p>Do you or someone you know ever dreamed of becoming a star.  Maybe you wanted to be a singer or model.  Some people strive to be actors or maybe write a book.  You could be a dancer or fashion designer.  We promote sports and entrepreneurs. </p>\n\n<p>Snotu will be up soon, definitely be up by the end of year.  An ever better thing is that talents from outside of your country will also be made available. As it grows there will be more diversity in music, politics, medical technologies, electronics, movies, books, etc. This website will promote anyone and everyone.  If you like, you can check back in about 6 months to see the fresh new talents around the world.</p>\n\n<p>I have been looking to start a business for a few years now and need your expert opinion. My website www.snotu.com will be going up by the end of the year. It will promote talent worldwide. Eventually it will be a self promoting website like Facebook, Twitter, Myspace, etc. I have been promoting it myself via several websites, blogs, etc and have found some interest. I do have an established artist (music) in Indonesia, China, and the US. I also have 2 fashion designers (China), one high school quarterback (CA), one model (US), and a head of a student organization (Indonesia). I have possible clients in The Philippines, Japan, Korea, Indonesia, UK, US, Peru, Brazil, Thailand, Saudi Arabia, Australia, and a few other places. I have 2 marketing companies that will promote my business as well. I believe one day this website will be very big, with your help that could be a lot sooner than later. Of course, I do not expect anything from you, I know you are very busy, but any help or advice would be greatly appreciated. If you are too busy or just not interested could you please suggest someone who you know who may be interested. Please let me know either way. Here is a little about my idea: </p>\n\n<p>My website will do a lot of things. It will bring together, singers, songwriters, musicians, producers, directors, choreographers, dancers, movie makers, actors, authors, play writers, TV stars, actors, gamers, game designers, fashion designers, clothing manufacturers, models, customers, media, the general public, critics, athletes, pro, college, and high school coaches and scouts; etc.  </p>\n\n<p>It is going to be the first social networking site to bring together talent worldwide.  It is called snotu.com.  This was named this for the following 3 reasons.</p>\n\n<p>First it is catchy, no one will forget the snot part and will make jokes about it (free advertising). This is similar to the goo in Google. </p>\n\n<p>Secondly it is a statement.  Every struggling singer, songwriter, musician, actor, model, author, entrepreneur, etc., has gone to an audition, producer, agency, talent competition, bank, etc., and was told we have only one spot available (one loan to give) and out of the many who tried out: It&#8217;s not you that was chosen.  We are sorry, you are talented, but we have only so many slots available.</p>\n\n<p>Lastly it is an acronym:  Social Network Of Talent Undiscovered.</p>\n\n<p>I intend to promote each individual relentlessly.  When this gets big, I would love to say one of my first talents promoted was you.   </p>\n\n<p>My brother was a cartoonist and a writer and really good but like many famous painters, he died poor.  If only there was someone to promote him.  This gives me so much motivation and I will succeed no matter what it takes.  </p>\n\n<p>The talent will not have to be subjected to a panel of so called expert judges as it narrows down the amount of people to 12 and then only one country can vote to keep an individual in the competition.  As the contestants get eliminated it becomes a contest of how many teenage girls find a guy cute or how many men vote for the best looking women, it rarely comes down to the most talented.  This is shown by the 9 seasons of AI, there is only Kelly Clarkson and Carrie Underwood that have major success.  Look at the way all of the competitions go, the got talent shows, next top model, last comic standing, next food network star, dancing shows, etc., they always have judges who cut down the number of contestants before anyone else has a say and the modeling and cooking shows never have anyone but judges decide.  Now imagine every person who tries out is promoted, instead of judges, people from one country, people with a specific cell phone carrier; the world is their stage.  If 100 thousand sign up they are all promoted and not just solo artists who are attractive, 16 to 28, and are singers.  I will relentlessly promote each and every talent.  </p>\n\n<p>If you have ever had a door slammed in your face and someone telling we are looking for a special someone but it&#8217;s not you, I know how you felt. Snotu is new and will say yes to all.  This is truly a unique opportunity. </p>\n\n<p>snotu@ymail.com</p>\n\n<p>This website will promote singers, dancers, songwriters, artists, clothing designers, models, authors, animators, sports, entrepreneurs, charities and a lot more.  If you can help in any way it would be appreciated and rewarded.  If you know of a business attorney let me know.</p>\n\n<p>Like Facebook brings together friends and family, snotu will bring together talented people, for example, like Arnel Pineda and Journey.  Let&#8217;s say there is a Iraqi band missing a singer, a songwriter, a guitarist, a drummer, a producer, etc and there happens to be one available in India.  The Iraqi band signs up on Snotu and so does the person in India and once they find each other, music fans all over the world can download their music.  Now let&#8217;s say the person from Iraq was also a model, this would be promoted too, and maybe a company in Egypt will hire them for a commercial.  So maybe you have always wanted to write a book, now you can and you don&#8217;t need to impress a publisher.</p>\n\n<p>We need a little help in the beginning, around $300. Any investment or donation will give the individual a special designation with our company once it is up and successful. Just think if you could have been an early investor with American Idol. Contact us at snotu@ymail.com if there are any questions or you are interested in these services.</p>\n\n<p>Another cool feature of this website will be the community or social network aspect.  Here is what I mean:</p>\n\n<p>Let&#8217;s say you are singer but can not read, write, play, or produce music.  This website will bring together singers, songwriters, musicians, directors, and producers.  Now consider these people coming from different backgrounds, for example:  A group could be developed with a singer from Iraq, a songwriter from Jamaica, a lead guitarist from Africa, another guitarist from The Philippines, a drummer from Russia, a pianist from Mexico, a music producer from Portugal, a video director from the US, a choreographer from Germany, a rap singer from Poland, and a horn player from the UK.  Imagine the music from such a group of people.  Just think of all the new types of music that would come from this.  Now apply this same thought of bringing together talent worldwide into other industries.  There would be great stories created, movies and TV shows that would be new and unique, clothing and fashion, jewelry, sports, entrepreneurs, businesses, medical technologies, IT, electronic technologies, computers, and a whole lot more.  Now image all of the researchers around the world coming together to cure some of the most challenging medical issues, economic issues, environmental issues, political concerns, etc. and much more, the possibilities are endless.  </p>\n\n<p>Thank you for all of your time and consideration in this matter, </p>\n\n<p>Tom Woznick\nCEO Snotu\nsnotu@ymail.com</p>\n\n<p>952-356-9162\ncall or text</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"","firm":{"name":"Freestyle Capital","permalink":"freestyle-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,20],"assets/images/resized/0005/0629/50629v4-max-150x150.jpg"],[[250,34],"assets/images/resized/0005/0629/50629v4-max-250x250.jpg"],[[450,62],"assets/images/resized/0005/0629/50629v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/#!/snotuymail","title":"Snotu Ymail"}]}