{"first_name":"Tom","last_name":"Atencio","permalink":"tom-atencio","crunchbase_url":"http://www.crunchbase.com/person/tom-atencio","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 03 18:34:48 UTC 2008","updated_at":"Tue Jun 03 18:38:59 UTC 2008","overview":"<p>Tom Atencio&#8217;s career in the music industry has spanned over 20 years. During this time he has been involved with many facets of the industry, including, but not limited to, record labels, live performance and artist management.</p>\n\n<p>In the early 1980s, Tom was the Co-Founder and Vice President of Marketing for Backstreet/MCA Records. He oversaw the presentation for such artists as Tom Petty, Nils Lofgrin and Men Without Hats. He also coordinated the release and marketing plan for Universal Films soundtracks including Where the Buffalo Roam (music by Neil Young), The Border (music by Ry Cooder), Cat People (music by Giorgio Moroder and David Bowie) and others.</p>\n\n<p>During the 1990s, Tom founded Atencio &amp; Associates, a firm specializing in artist management. He represented the influential alternative band Jane&#8217;s Addiction during their Ritual de lo Habitual release. In addition, he co-founded the visionary Lollapalooza Festival. He was responsible for guiding No Doubt&#8217;s career during their Tragic Kingdom release, which has sold in excess of 15,000,000 copies worldwide. Tom has represented WEA recording artists New Order (in North America) for the last 18 years. He is also the North American representative for the Joy Division catalog.</p>\n\n<p>In addition to producing an upcoming Joy Division documentary, Tom is currently working in association with Lawrence Bender to develop the feature film Johnny Nemo and a number of other media projects.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Advisor","firm":{"name":"TuneCore","permalink":"tunecore","type_of_entity":"company","image":{"available_sizes":[[[150,121],"assets/images/resized/0001/9897/19897v1-max-150x150.png"],[[250,202],"assets/images/resized/0001/9897/19897v1-max-250x250.png"],[[285,231],"assets/images/resized/0001/9897/19897v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}