{"first_name":"tom","last_name":"herry","permalink":"tom-herry-2","crunchbase_url":"http://www.crunchbase.com/person/tom-herry-2","homepage_url":"http://realtor-discount.blogspot.com/","birthplace":"","twitter_username":"drealtor10gmai","blog_url":"http://realtor-discount.blogspot.com/","blog_feed_url":"http://realtor-discount.blogspot.com/","affiliation_name":"Unaffiliated","born_year":1985,"born_month":3,"born_day":18,"tag_list":"discount-realtor","alias_list":null,"created_at":"Fri Sep 17 07:22:40 UTC 2010","updated_at":"Thu Sep 23 03:22:39 UTC 2010","overview":"<p>Search for right Discount Realtor ends up with Continental Real Estate Group who are the pioneers in real estate industry. With the use of MLS growing, need of an experienced discount realtor also grows. This is where Continental Real Estate Group has shown great amount of respect from a huge list of client base as a renowned discount realtor. </p>\n\n<p>Continental Real Estate Group has been working as discount realtor for last 10 years and is headed by Derek Eisenberg. He is regarded as most experienced discount realtor in US with loads of knowledge about US real estate industry. In his guidance Continental Real Estate Group has served nationwide home owners as the best discount realtor company ever. </p>\n\n<p>Continental Real Estate Group offers great MLS packages which meets the best in the real estate industry. As a discount realtor they offer MLS listing packages which start from $349 with loads of benefits for home owners. Either you are looking to sell or rent discount realtor will help you list in MLS for small upfront fee and get the best market price. </p>\n\n<p>Right now discount realtor Continental Real Estate Group is offering MLS packages where you can extend for one year for mere $100 and upload good number of images of your property. Discount realtor will help you do all paper work with ease and you rest at home in peace to get buying or renting queries in good amount of time. </p>\n\n<p>If you wish to know more how discount realtor work and how to list in MLS with discount realtor visit www.listflatfeeinmls.com.</p>","image":{"available_sizes":[[[150,89],"assets/images/resized/0010/2079/102079v2-max-150x150.jpg"],[[213,127],"assets/images/resized/0010/2079/102079v2-max-250x250.jpg"],[[213,127],"assets/images/resized/0010/2079/102079v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}