{"first_name":"Tom","last_name":"Packert","permalink":"tom-packert","crunchbase_url":"http://www.crunchbase.com/person/tom-packert","homepage_url":"http://www.carecloud.com","birthplace":"","twitter_username":"","blog_url":"http://blog.carecloud.com","blog_feed_url":"http://feeds.feedburner.com/carecloudblog","affiliation_name":"CareCloud","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Mar 18 13:42:17 UTC 2010","updated_at":"Thu Dec 30 02:24:51 UTC 2010","overview":"<p>Thomas Packert is Chief Technology Officer at CareCloud, where he is responsible for identifying technologies and managing implementations of CareCloud&#8217;s proprietary systems to maximize the scalability, flexibility and productivity for the physicians and their respective businesses. His mission is to deliver high productivity, secure and compliant systems for all stakeholders. Tom Packert comes to CareCloud with numerous years of experience in developing healthcare billing systems, healthcare supply chain and financial reporting systems for HMOs.</p>\n\n<p>Prior to CareCloud, Mr. Packert was Vice President Information Management for Visible Assets, a proprietary RFID systems vendor with unique low frequency RuBee technology. In this role, Mr. Packert, developed a wide variety of web based visibility solutions based on open source technologies for orthopedic device manufacturers and multiple hospitals that resulted in significant revenue enhancement, supply chain efficiencies and patient safety enhancements.</p>\n\n<p>Prior to Visible Assets, Packert was VP of Information Technology at Neighborhood Health Partnership (NHP) a Miami based HMO where he oversaw an IT department of 50 and budget of $10 million. Implemented Zero Based Budget for IT department, reduced telecomm budget by 50%, reduced software maintenance budget by 15%, implemented HIPAA privacy, security and transaction rules as well as the 2004 Medicare Drug programs, iImplemented work flow tools for printed materials production and approvals.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0008/1006/81006v2-max-150x150.jpg"],[[167,250],"assets/images/resized/0008/1006/81006v2-max-250x250.jpg"],[[200,299],"assets/images/resized/0008/1006/81006v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Chief Technology Officer","firm":{"name":"CareCloud","permalink":"carecloud","type_of_entity":"company","image":{"available_sizes":[[[150,64],"assets/images/resized/0006/0043/60043v2-max-150x150.png"],[[250,107],"assets/images/resized/0006/0043/60043v2-max-250x250.png"],[[450,192],"assets/images/resized/0006/0043/60043v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.carecloud.com","title":""}],"web_presences":[]}