{"first_name":"Tom","last_name":"Gelson","permalink":"tom-gelson","crunchbase_url":"http://www.crunchbase.com/person/tom-gelson","homepage_url":"http://www.ninetechnology.com","birthplace":"New Jersey","twitter_username":"tgelson","blog_url":"http://www.ninetechnology.com/blog","blog_feed_url":"http://www.ninetechnology.com/blog","affiliation_name":"Unaffiliated","born_year":1964,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon May 02 17:05:58 UTC 2011","updated_at":"Sun May 08 03:16:45 UTC 2011","overview":"<p>Tom is a serial entrepreneur with a track record of success in the data backup and recovery field.</p>\n\n<p>Tom&#8217;s career and entrepreneurial spirit have evolved with the technology leading up to the launch of Nine Technology, his fourth successful venture in the data storage industry. Previously, Tom founded Vault USA, a successful backup and recovery managed service provider that was acquired by NextVault, Inc on April 29, 2010.</p>\n\n<p>Tom started his career in the data storage industry at EMC. He became Director of Sales and Support for Acknowledge, Inc., the first third-party manufactured, unattended tape backup drive company for IBM midrange and mainframe systems.</p>\n\n<p>He then founded More Solutions, his first data storage company, which merged in 2001 with virtual tape storage software company Neartek, Inc. In 2004, he founded More Group Inc. as an employee owned and operated company led by a seasoned enterprise storage executive team that had worked with him at More Solutions. The More Group was a leading enterprise storage management integrator offering turnkey solutions and professional services. In 2008, More Group was acquired by Forsythe Solutions Group Inc.</p>\n\n<p>Tom graduated from St. Joseph&#8217;s University in Philadelphia, PA.  He also served for 5 years in the United States Coast Guard at search &amp; rescue stations on the NJ coast and Governor&#8217;s Island, NY.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0013/2869/132869v2-max-150x150.jpg"],[[125,188],"assets/images/resized/0013/2869/132869v2-max-250x250.jpg"],[[125,188],"assets/images/resized/0013/2869/132869v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}