{"first_name":"Tom","last_name":"Masucci","permalink":"tom-masucci","crunchbase_url":"http://www.crunchbase.com/person/tom-masucci","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Aug 06 03:24:23 UTC 2011","updated_at":"Sat Aug 06 03:29:54 UTC 2011","overview":"<p>Tom Masucci is a seasoned professional with over 10 years of start-up experience in the risk management industry. A sampling of products and services brought to market include enterprise security data warehouse (SDW), enterprise data classification, enterprise static code analysis, application threat modeling, third party vendor assessment, MSSP, multi-vendor front line support, security architecture and assessment, policy and procedure review, firewall, VPN, NAC and IPS. A brief list of accounts broken with new technology include Chevron, Oracle, PG&amp;E, Kaiser, eBay, Qualcomm, Zions, Visa, Seagate, Webex (Now Cisco), E*Trade, Charles Schwab, Safeway, PetMart, Standard Insurance and First American. Prior to Zettaset, Tom lead the western region of several start-ups through acquisition, those include Ounce Labs (IBM), Siegeworks (Fishnet), Intruvert (McAfee) and OneSecure (NetScreen). During these ten years, he was elected Vice President of the Silicon Valley ISSA 2005-2007 and successfully won election for membership chairman in 2008. He’s also successfully built seminars on the use of Predictive Analytics for Fraud Mitigation, and the relationship between Risk Management and Litigation Readiness. Tom is a frequent speaker at security conferences, a respected leader amongst his peers, and a trusted advisor to his customers. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP of Business Development and Sales","firm":{"name":"Zettaset","permalink":"goto-metrics","type_of_entity":"company","image":{"available_sizes":[[[150,39],"assets/images/resized/0007/6812/76812v3-max-150x150.png"],[[250,66],"assets/images/resized/0007/6812/76812v3-max-250x250.png"],[[284,75],"assets/images/resized/0007/6812/76812v3-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}