{"first_name":"Tom","last_name":"Krieglstein","permalink":"tom-krieglstein","crunchbase_url":"http://www.crunchbase.com/person/tom-krieglstein","homepage_url":"http://www.alumnichoose.org","birthplace":"Lawrence, MI","twitter_username":"tomkrieglstein","blog_url":"http://www.tomkrieglstein.com","blog_feed_url":"http://feeds.feedburner.com/TomKrieglstein","affiliation_name":"AlumniChoose","born_year":1980,"born_month":12,"born_day":5,"tag_list":"education, new-york-city, nyc, techstars, edu, higher-ed, technology, college","alias_list":null,"created_at":"Sun Apr 29 17:17:48 UTC 2012","updated_at":"Wed May 23 14:50:13 UTC 2012","overview":"<p>Higher Education Innovator. Founder of AlumniChoose, Swift Kick, &amp; #SAchat. Also, a NY TechStars Alumni as co-founder of Red Rover.</p>\n\n<p>&#8212;&#8212;&#8212;&#8212;&#8211;</p>\n\n<p>As a college junior, Tom started his first business selling used textbooks online, an endeavor that grew to $1.5 million in annual sales. While in college Tom was also named an ALL-USA Academic First Team member and earned top academic honors at both College of DuPage and Aurora University, giving the graduation speech at each institution.\nAfter graduating with a BA in Business Management, Tom worked as a head facilitator for three years with Quantum Learning Network, the premier company for accelerated learning techniques. Through QLN, Tom spoke to thousands of students around the US and the world, including South Korea, Indonesia and Bermuda.</p>\n\n<p>In 2004, Tom co-founded his second business, Swift Kick, to helps colleges create, increase, and measure student engagement. Swift Kick was honored as the 2007, 2008, and 2009 National Campus Speakers of the Year and since 2004 has worked with over 250 colleges, corporations, and US Military bases.</p>\n\n<p>With a desire to make an even greater impact on engagement beyond speaking, Tom co-built Red Rover in 2008 as a peer-to-peer learning platform that helps current and former students connect, learn, and grow from each other.</p>\n\n<p>On January 16th 2012, Tom launched his latest project, AlumniChoose.org, as a digital fundraising tool for campus clubs and organizations that leverages social media and crowd-funding.</p>","image":{"available_sizes":[[[114,150],"assets/images/resized/0018/7049/187049v2-max-150x150.jpg"],[[190,250],"assets/images/resized/0018/7049/187049v2-max-250x250.jpg"],[[342,450],"assets/images/resized/0018/7049/187049v2-max-450x450.jpg"]],"attribution":"<p>Tom Krieglstein</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Founder, CEO","firm":{"name":"AlumniChoose","permalink":"alumnichoose","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.tomkrieglstein.com","title":"Personal Blog"}],"web_presences":[{"external_url":"http://twitter.com/tomkrieglstein","title":"Twitter"}]}