{"first_name":"Tom","last_name":"Ngo","permalink":"tom-ngo","crunchbase_url":"http://www.crunchbase.com/person/tom-ngo","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Aventura","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 15 22:02:41 UTC 2012","updated_at":"Wed Aug 22 19:37:40 UTC 2012","overview":"<p>Dr. Ngo drives all technology initiatives and leads product management, product design, and product development functions.</p>\n\n<p>A highly experienced software executive, Dr. Ngo joins Aventura from Disney Research (Walt Disney Imagineering), where he served as Vice President for three years. Dr. Ngo emphasized customer validation and cross-functional execution to extract maximum commercial value from the portfolio of several hundred research projects. Prior to Disney Research, Dr. Ngo was the Chief Technology Officer at NextPage, an enterprise software company, where he was responsible for product management, product design, and product development, and interacted heavily with customers, the media, and industry analysts. As an Area Director for Interval Research Corporation, Dr. Ngo managed diverse technical teams across software and hardware disciplines. He also personally co-invented in multiple fields, including blind source separation, efficient delivery of broadband media, and synthetic computer animation.  His technology innovations have been patented and published in peer-reviewed journals. Dr. Ngo holds a PhD in Computational Biophysics from Harvard University, where he held a Hertz Fellowship. He holds a BA in Physics and Theoretical Physics from Cambridge University, where he graduated with first-class honors and was awarded the first Sir Neville Mott Prize for best undergraduate thesis in theoretical physics.</p>","image":null,"degrees":[{"degree_type":"PhD in Computational Biophysics","subject":"","institution":"Harvard University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"BA in Physics and Theoretical Physics","subject":"","institution":"Cambridge University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chief Product and Development Officer","firm":{"name":"Aventura","permalink":"aventura","type_of_entity":"company","image":{"available_sizes":[[[150,15],"assets/images/resized/0020/6282/206282v2-max-150x150.png"],[[200,21],"assets/images/resized/0020/6282/206282v2-max-250x250.png"],[[200,21],"assets/images/resized/0020/6282/206282v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}