{"first_name":"Tom","last_name":"Mawhinney","permalink":"tom-mawhinney","crunchbase_url":"http://www.crunchbase.com/person/tom-mawhinney","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Nov 14 13:40:40 UTC 2008","updated_at":"Sun Nov 16 18:49:17 UTC 2008","overview":"<p>Tom Mawhinney joined JAFCO in 2003 as a general partner, bringing a 15-year background in the technology industry as both a venture capitalist and an operating executive. Although an experienced entrepreneur in the software sector, Tom has a wide range of technology investing experience and a very grounded view of the process of building great companies. At JAFCO, Tom is actively involved with The 41st Parameter, Aperto Networks, ClairMail, Conformia Software, Groundwork Open Source, Mimosa Systems, Neterion, Solidcore Systems, Voltage Security and Xambala. Prior investments while at JAFCO include Brion Technologies (acquired by ASML), DATAllegro (acquired by Microsoft), Infinera (INFN) and PostPath (acquired by Cisco Systems).</p>\n\n<p>Before joining JAFCO Ventures, Tom was with Canaan Partners, an early-stage venture capital firm with $2 billion under<br/>\nmanagement. Prior to joining Canaan, Tom co-founded and served as President and COO of North Systems, a venture-backed software company that he helped manage for five years. Tom first developed his skills as a technology investor and entrepreneur during the five years he spent with Summit Partners, a venture capital firm with over $6 billion under management today.</p>\n\n<p>Prior investments Tom was involved with at Canaan and Summit include AmeriPath (PATH), HAHT Commerce (Global eXchange Services), IntelliQuest (IQST), Microbank Software (SunGard Data Systems), Pediatrix Medical Group (PDX), Powerwave Technologies (PWAV) and SteriGenics International (STER).</p>\n\n<p>Tom received his MBA from the Stanford Graduate School of Business and graduated with honors with a Bachelor of Arts degree from Harvard College. </p>","image":{"available_sizes":[[[150,93],"assets/images/resized/0002/8686/28686v1-max-150x150.jpg"],[[177,110],"assets/images/resized/0002/8686/28686v1-max-250x250.jpg"],[[177,110],"assets/images/resized/0002/8686/28686v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Jafco Ventures","permalink":"jafco-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,30],"assets/images/resized/0000/3562/3562v1-max-150x150.png"],[[175,35],"assets/images/resized/0000/3562/3562v1-max-250x250.png"],[[175,35],"assets/images/resized/0000/3562/3562v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}