{"first_name":"Tom","last_name":"Nativ","permalink":"tom-nativ-2","crunchbase_url":"http://www.crunchbase.com/person/tom-nativ-2","homepage_url":"http://gadget-valley.com/","birthplace":"","twitter_username":"","blog_url":"http://gadget-valley.com/blog/","blog_feed_url":"http://gadget-valley.com/rss.xml","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"laser-projector, laser-star-projector, laser-keychain, iphone-car-charger, obdii-scanner, usb-car-charger, led-lights-for-cars, ac-adapter-for-car, bluetooth-handsfree-car-kit, car-diagnostic-tool, dual-usb-car-charger, car-warning-lights, car-mp3-player-","alias_list":null,"created_at":"Mon Aug 27 13:08:41 UTC 2012","updated_at":"Mon Sep 03 23:55:21 UTC 2012","overview":"<p>Gadget-Valley.com is the next generation of online shopping center. Here, you get a large selection of merchandise at very attractive prices. While quality issues are generally tied to low prices in the industry, they hand test most of their shipments unit-by-unit to ensure your satisfaction. New products are selected with reliability considerations and your expectations in mind.</p>\n\n<p>Gadget-Valley.com is one of the biggest online commercial corporations in Asia, committing itself to build a worldwide online shop. Their company was originally set up in Shenzhen, China in 2003, aiming to operate the business-to-customer transactions with overseas consumers. Their brand name was originated from imitating the gurgling voice people better when enjoy something happy. Along with the rapid development of electronic business in China, Hohotrade has earned itself a solid reputation for quality, reliability and professionalism in this field. Their operation capabilities cover favorable policy, affiliate discount, instant and safe delivery, privacy protection and well-rounded customer support.</p>\n\n<p>The mission of Gadget-Valley.com is to provide you with the hottest goods at hot price from China. You can get almost everything you like on this website. They sell a vast range of merchandise produced exclusively by Chinese manufacturers such as CCTV surveillance cameras , wireless spy cameras, laser star projector, power inverters for cars, infrared cameras, CCTV surveillance cameras etc. If you like to hunt for something special at low price by fashionable online shopping, then use Gadget-Valley.com to purchase many thousands of super discount products you are interested in.</p>","image":{"available_sizes":[[[150,63],"assets/images/resized/0020/8316/208316v2-max-150x150.jpg"],[[190,80],"assets/images/resized/0020/8316/208316v2-max-250x250.jpg"],[[190,80],"assets/images/resized/0020/8316/208316v2-max-450x450.jpg"]],"attribution":"<p>Dual USB Car Charger</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://gadget-valley.com/-surveillance-wireless-spy-cameras_c243","title":"wireless spy cameras"},{"external_url":"http://gadget-valley.com/-car-accessories-car-power-inverters_c233","title":"power inverters for cars"},{"external_url":"http://gadget-valley.com/-ipod-iphone-parts-batteries-chargers_c165","title":"Iphone Car Charger"},{"external_url":"http://gadget-valley.com/-health-beauty-hair-trimmer-clipper_c347","title":"Body Hair Trimmer"}],"web_presences":[]}