{"first_name":"Tom","last_name":"Gerace","permalink":"tom-gerace-2","crunchbase_url":"http://www.crunchbase.com/person/tom-gerace-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Dec 30 14:47:13 UTC 2010","updated_at":"Thu Oct 13 01:06:18 UTC 2011","overview":"<p>Prior to founding Skyword™, Tom launched Gather.com, a demand-driven news and entertainment property reaching more than 6M people each month. Gather remains an owned-and-operated property of Skyword Inc.</p>\n\n<p>Gerace also founded and served as President of Be Free, a publicly traded online marketing services company. Be Free transformed online advertising from pay-per-view (i.e. CPM Advertising, where advertisers paid a fixed fee every time their ads were shown) to pay-for-performance advertising (i.e. Cost-Per-Click and Cost-Per-Acquisition Advertising). Be Free-operated channels often saved customers 80% of their cost of new customer acquisition when compared with other marketing methods.</p>\n\n<p>After Be Free&#8217;s launch and financing, Tom served as Chief Marketing Officer through the company&#8217;s initial public offering. As Chief Marketing Officer, he was responsible for creating new and existing products and services, mergers and acquisitions, corporate and product communications, and customer acquisition. Gerace was awarded two U.S. Patents (5,848,396 and 5,991,735) for profiling computer users and targeting advertising based on that profiling. During his tenure with the company, Be Free launched both U.S. and European operations. Be Free served more than 300 leading brands including barnesandnoble.com, Citibank, eBay, AOL, Lending Tree, Bertlesmann, Time Warner, IBM, Dell, and Microsoft.</p>\n\n<p>Prior to founding Be Free, Tom was a senior business analyst at the Harvard Business School. Tom received a Bachelor of Arts in Social Studies, magna cum laude, from Harvard University in 1993. Tom serves on the Board of Advisors for Imagitas and on the Board of Visitors for the Fenway Community Health Center. He is also a director of The Open Gate Foundation.</p>","image":{"available_sizes":[[[150,93],"assets/images/resized/0015/7888/157888v1-max-150x150.png"],[[181,113],"assets/images/resized/0015/7888/157888v1-max-250x250.png"],[[181,113],"assets/images/resized/0015/7888/157888v1-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"Bachelor of Arts","subject":"Social Studies","institution":"Harvard University","graduated_year":1993,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO ","firm":{"name":"Skyword","permalink":"skyword","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0011/5813/115813v2-max-150x150.png"],[[250,250],"assets/images/resized/0011/5813/115813v2-max-250x250.png"],[[371,371],"assets/images/resized/0011/5813/115813v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}