{"first_name":"Tom","last_name":"Hale","permalink":"tom-hale-2","crunchbase_url":"http://www.crunchbase.com/person/tom-hale-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"HomeAway","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jul 14 18:53:02 UTC 2010","updated_at":"Fri Jul 16 19:12:47 UTC 2010","overview":"<p>HomeAway tapped Tom Hale to serve as Chief Product Officer (CPO), overseeing all aspects of product and technology on a global basis. Known for his passion for product development and enhancing the user experience, Hale is also an avid traveler and vacation rental owner himself.</p>\n\n<p>Hale has more than 16 years experience in product development. Prior to HomeAway, he was the Chief Product Officer at Linden Lab from 2008 to 2010, where he led the renovation of all aspects of the Second Life experience.</p>\n\n<p>Before Linden Lab, Hale was an entrepreneur-in-residence at Redpoint Ventures (a capital investor in HomeAway) focused on social networking and virtual goods marketplaces.</p>\n\n<p>From 1995 to 2007, Hale held a variety of senior leadership roles at Macromedia and Adobe Systems Incorporated. At Adobe, he headed the Adobe Acrobat business and drove the redesign of the Acrobat user experience. At Macromedia (acquired by Adobe in 2005), Hale played key roles in making Macromedia the standard for web development, evolving the Flash Player into a platform for video, mobile content, and rich internet applications (RIAs), and starting up the company’s knowledge worker division.</p>\n\n<p>Hale holds a bachelor’s degree from Harvard University. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CPO","firm":{"name":"HomeAway","permalink":"homeaway","type_of_entity":"company","image":{"available_sizes":[[[150,37],"assets/images/resized/0001/2422/12422v5-max-150x150.jpg"],[[250,62],"assets/images/resized/0001/2422/12422v5-max-250x250.jpg"],[[450,112],"assets/images/resized/0001/2422/12422v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}