{"first_name":"Tomas","last_name":"Wells","permalink":"tomas-wells","crunchbase_url":"http://www.crunchbase.com/person/tomas-wells","homepage_url":"http://www.woonky.com","birthplace":"","twitter_username":null,"blog_url":"http://www.woonkyland.com","blog_feed_url":"http://www.woonkyland.com/feed/","affiliation_name":"Woonky","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Dec 04 18:08:38 UTC 2008","updated_at":"Sun Jan 04 21:27:21 UTC 2009","overview":"<p>He starts his career at the logistic area of Wunderman working for the Ford Argentina loyalty program. After a year, he moves to the interactive area in order to work as a web and CRM interfaces designer. Having worked for four years at the company, he continues his career at Mediarythmic, a national interactive agency in which he carried out designer and programmer tasks.</p>\n\n<p>He becomes part of Grey on 2004 in order to keep on developing designer and web programmer activities. A year from that moment, he started his career at the account area as Senior Executive to give support to Kent (BAT) of Argentina. In May 2006 he takes the G2 Interactive Manager position where he was the responsible of the area’s creativity and production.</p>\n\n<p>In March 2008 he started to build his own creative digital agency, Woonky, where is nowadays the Chief Creative Officer.</p>\n\n<p>Tomás studied Systems Analysis and Multimedia Design. In the present he investigates new multimedia technologies and new ways of communication.</p>\n\n<p>Through his career he worked for important and well known accounts as Alcatel, Banco Nación, British American Tobacco, Bayer, Budweiser, Cadbury, Citi, Coca-Cola, Converse, Diners, Disco, Ford, Gillete, GSK, Heineken, La Nación, Lever, Microsoft, Monsanto, Movistar, Nestle, Nokia, Novartis, Penalty, Playboy, Procter &amp; Gamble, Renault, Repsol YPF, RollingStone, Sancor, Syngenta, Visa &amp; Warner Bros, among others </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CCO","firm":{"name":"Woonky","permalink":"woonky","type_of_entity":"company","image":{"available_sizes":[[[150,95],"assets/images/resized/0003/1047/31047v2-max-150x150.png"],[[208,133],"assets/images/resized/0003/1047/31047v2-max-250x250.png"],[[208,133],"assets/images/resized/0003/1047/31047v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}