{"first_name":"Tommy","last_name":"Karyukin","permalink":"tommy-karyukin","crunchbase_url":"http://www.crunchbase.com/person/tommy-karyukin","homepage_url":"http://www.edsd.ru","birthplace":"","twitter_username":"edsdru","blog_url":"http://www.facebook.com/tommy.karyukin","blog_feed_url":"","affiliation_name":"EDISON Software Development Centre","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Feb 05 21:24:16 UTC 2012","updated_at":"Thu Aug 09 20:25:23 UTC 2012","overview":"<p>Founder and CEO of EDISON Software Development Centre</p>\n\n<p>In early childhood Tommy was interested in trains and railways, but in his third year of primary school he developed a fascination for computers, electronics and programming. He was totally engrossed in his new hobby but had no computer at home to work on. Due to this, he began to study programming languages and write programs on paper, debugging them in his mind. As a result, he created specifications for fanciful software, ranging from graphics editors to economics games. Unlike his peers, who were busy playing computer games, he preferred creating them. In his school years he won numerous academic competitions, including some in the sphere of IT.</p>\n\n<p>In his teenage years he became interested in music. After finishing music school he had every chance of becoming a professional classical guitarist, but at the crucial moment he chose to pursue software development as his main profession. Music and music criticism became a favourite hobby of his. For several years Tommy played the bass, rhythm- and solo-guitar in a jazz band.</p>\n\n<p>Tommy graduated from the Economics Faculty of Kuzbass State Technical University, majoring in Company Management. But, while still studying at university, he devoted a great deal of time to his own business. That is how he earned his first million while still in his student years.</p>\n\n<p>Tommy has a son and two daughters. Thanks to his energy and active lifestyle, he also manages to find time to go swimming and relax with friends at weekends.</p>\n\n<p>In his professional life he constantly strives to innovate and make the world a little better. He has valuable experience of communicating with inventors and entrepreneurs. Being an engineer and inventor by nature, Tommy takes great inspiration from working on non-standard ideas and unconventional projects.</p>","image":{"available_sizes":[[[150,127],"assets/images/resized/0017/3055/173055v2-max-150x150.jpg"],[[250,212],"assets/images/resized/0017/3055/173055v2-max-250x250.jpg"],[[300,255],"assets/images/resized/0017/3055/173055v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BS hons","subject":"Company Management","institution":"Kuzbass State Technical University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"EDISON Software Development Centre","permalink":"edison-software-development-centre","type_of_entity":"company","image":{"available_sizes":[[[140,108],"assets/images/resized/0017/2532/172532v2-max-150x150.jpg"],[[140,108],"assets/images/resized/0017/2532/172532v2-max-250x250.jpg"],[[140,108],"assets/images/resized/0017/2532/172532v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/edsdru","title":"LinkedIn"}]}