{"first_name":"Tommy","last_name":"G. Thompson","permalink":"tommy-g-thompson","crunchbase_url":"http://www.crunchbase.com/person/tommy-g-thompson","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Apr 25 12:24:03 UTC 2011","updated_at":"Mon Apr 25 12:25:43 UTC 2011","overview":"<p>Former Health and Human Services Secretary Tommy G. Thompson is the nation&#8217;s leading advocate for the health and welfare of all Americans. He is the 19th individual to serve as Secretary of the department, which employs more than 60,000 personnel and has a fiscal year 2001 budget of $429 billion.</p>\n\n<p>Secretary Thompson has dedicated his professional life to public service, most recently serving as governor of Wisconsin since 1987. Secretary Thompson made state history when he was re-elected to office for a third term in 1994 and a fourth term in 1998.</p>\n\n<p>During his 14 years as governor, Secretary Thompson focused on revitalizing Wisconsin&#8217;s economy. He also gained national attention for his leadership on welfare reform, expanded access to health care for low-income people, and education.</p>\n\n<p>In 1996, Secretary Thompson enacted Wisconsin Works, or &#8220;W-2,&#8221; the state&#8217;s landmark welfare-to-work legislation, which served as a national model for welfare reform. The program required participants to work, while at the same time providing the services and support to make the transition to work feasible and permanent. W-2 provided a safety net through child care, health care, transportation and training assistance. Wisconsin&#8217;s monthly welfare caseload declined by more than 90 percent, while the economic status of those taking part in W-2 improved. The average family on AFDC had been 30 percent below the federal poverty line. However, at the average wage of people leaving W-2, families were 30 percent above the poverty line.</p>","image":null,"degrees":[{"degree_type":"J.D.","subject":"","institution":"University of Wisconsin","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chairman of The Board","firm":{"name":"CareView Communications","permalink":"careview-communications","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0013/1898/131898v1-max-150x150.jpg"],[[226,73],"assets/images/resized/0013/1898/131898v1-max-250x250.jpg"],[[226,73],"assets/images/resized/0013/1898/131898v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}