{"first_name":"Tonny","last_name":"Garden","permalink":"tonny-garden","crunchbase_url":"http://www.crunchbase.com/person/tonny-garden","homepage_url":"http://www.americanmailboxsolutions.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1984,"born_month":2,"born_day":2,"tag_list":"mailbox-stores, mailbox-service","alias_list":null,"created_at":"Tue Jul 31 13:46:53 UTC 2012","updated_at":"Sat Aug 04 13:55:47 UTC 2012","overview":"<p>Our greatest successes over the years has always come from our work with Homeowners, Builders, Property Management Companies and Home Owners Associations. We sold and installed thousands mailboxes with 100% Costumer Satisfaction. Our team is happy to customize a program that will specifically meet your needs whether your goal is a residential makeover or commercial project we simply want to offer you reliable source for high quality products. Our pricing is simply the “best in the industry”.</p>\n\n<p>Types of Mailbox</p>\n\n<ol>\n<li><p>Residential-Mailboxes</p></li>\n<li><p>Commercial-Mailboxes</p></li>\n</ol>\n\n<p>Company Testimonial</p>\n\n<p>This mailbox is FABULOUS!!!! I live in a community that requires us to have rural boxes. I can now stop worrying about my privacy and my identity being stolen. Everyone who has rural delivery should buy this fabulous mailbox. It was delivered by UPS at the time I was told. Your company was very professional and instrumental in my choosing of this particular box. I am just &#8220;Over The Moon&#8221; and cannot say enough good things about it. Cost should never be a factor when security and privacy matter most. My neighbors can&#8217;t stop talking about it! Finally, they have something positive to gossip about! I LOVE THIS MAILBOX! Thank you. I give it 10 stars.\n-Dani, Atlanta Ga</p>\n\n<p>We just received our new Coronado mailbox in black with polished brass trim and it is fantastic. The steel box is very strong and the decorative post and finial really finish it off! We are now the proud owners of the classiest mailbox in our neighborhood- just love the product!\n-Brent Denver, Co</p>","image":{"available_sizes":[[[150,21],"assets/images/resized/0020/3698/203698v2-max-150x150.jpg"],[[250,36],"assets/images/resized/0020/3698/203698v2-max-250x250.jpg"],[[315,46],"assets/images/resized/0020/3698/203698v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.americanmailboxsolutions.com/","title":"Mailbox"}]}