{"first_name":"Tonya","last_name":"Rapley","permalink":"tonya-rapley-2","crunchbase_url":"http://www.crunchbase.com/person/tonya-rapley-2","homepage_url":"http://www.about.me/tonyarap","birthplace":"Luzon, Phillipines","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1984,"born_month":6,"born_day":3,"tag_list":"digital-marketing, strategist, social-media, consultant","alias_list":null,"created_at":"Wed Jul 18 03:46:16 UTC 2012","updated_at":"Mon Jul 23 21:40:04 UTC 2012","overview":"<p>Community Management Expert/ Brand Engagement Specialist\nFounder, TheEargasm.com</p>\n\n<p>Ms.Rapley got her start  in college working for cosmetic conglomerate, Estée Lauder. Tonya quickly rose from an associate beauty advisor position to become the youngest member of the regional marketing team.  In this capacity she traveled around the Carolina&#8217;s aiding in the launch of new products, the facilitation of educational seminars, and special promotions. During this time she received valuable mentoring which she used to land her first job out of college as a customer insights analyst for The Lowe&#8217;s Home Improvement Stores.</p>\n\n<p>In 2009 she relocated to New York City to launch her online magazine TheEargasm.com and the brand quickly caught on. Ms.Rapley gained the support and trust of independent artist and their management teams domestically and internationally.  She formed strong relationships with representatives at companies such as Converse, HBO, and Fluud watches to name a few, effectively boosting the reputation of her magazine in a competitive online market space. Tonya used her successes at the Eargasm to launch an effective career as a digital marketing consultant. She crafted campaigns and monitored the online presence of artists such as Donnis, Kidz In The Hall, and 88 Keyz. She was then hired by Six Flags Entertainment Corporation as a Social Media Specialist, wherein she increased traffic at the company&#8217;s 16 theme parks by way of digital marketing implementing traditional and non-traditional strategies.  </p>\n\n<p>Noticed for her vibrant personality and diligent work ethic, Tonya was recruited by The YWCA of Brooklyn in 2010 to serve as their Coordinator of Community Initiatives. Her primary task was to redesign their marketing materials and oversee the launch of their web presence. Encouraged by their mission of eliminating racism and empowering women, Tonya transformed the historic organization. In her first year she exceeded forecasted revenues for the Community Center for Social Justice and brought Holistic Wellness, Economic Empowerment, and Cultural Awareness programming to Brooklyn residents. She also established the social justice film series in partnership with PBS and produced several events with elected officials and leaders at the brooklyn institution over the past two years. </p>\n\n<p>Ms. Rapley possesses a BA degree in Public Administration from Florida International University and is currently pursuing a Masters degree in Business Management and Leadership. She resides in Brooklyn, NY.</p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0020/1608/201608v2-max-150x150.jpg"],[[250,167],"assets/images/resized/0020/1608/201608v2-max-250x250.jpg"],[[450,301],"assets/images/resized/0020/1608/201608v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Bachelors","subject":"Public Administration","institution":"Florida International Un","graduated_year":2007,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}