{"first_name":"Tony","last_name":"Huang","permalink":"tony-huang","crunchbase_url":"http://www.crunchbase.com/person/tony-huang","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Velocity Financial Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Apr 14 12:44:03 UTC 2009","updated_at":"Fri Sep 07 20:42:59 UTC 2012","overview":"<p>Tony joined Velocity in 2008 and focuses on the firm’s investment activities on the West Coast, primarily in Silicon Valley. Tony has been an active participant in the Silicon Valley venture and entrepreneurial community since 1995.</p>\n\n<p>Prior to joining Velocity, Tony was the Vice President of Technology Banking Group at United Commercial Bank, focusing on asset based lending to expansion and later stage technology companies. Prior to UCB, Tony was the VP of Corporate Development at Asante Networks, a leading provider of optical networking components.</p>\n\n<p>Tony was previously with Silicon Valley Bank, serving in various capacities involving credit underwriting and portfolio management, corporate development, and international strategic alliances during a ten year period. As Director of the International Venture Capital Group, Tony was responsible for maintaining SVB’s network of international venture capital relationships and reviewing strategic investments in venture funds and technology companies. Tony was responsible for sourcing, structuring, and monitoring a loan portfolio of over 200 corporate lending relationships and over $100 million in commitments, comprising mainly of Silicon Valley based technology and life science companies that were funded by Asian venture capital sources.</p>\n\n<p>Tony received his bachelor&#8217;s degree in Business Administration from San Jose State University in 1992 and MBA from California State University-East Bay with a concentration in finance in 1995.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0007/9329/79329v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0007/9329/79329v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0007/9329/79329v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Partner","firm":{"name":"Velocity Financial Group","permalink":"velocity-financial-group","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.velocityfg.com","title":"Velocity Financial Group"},{"external_url":"http://www.linkedin.com/in/tonyhuang","title":"Linkedin"}]}