{"first_name":"Tony","last_name":"Loeser","permalink":"tony-loeser","crunchbase_url":"http://www.crunchbase.com/person/tony-loeser","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Syapse","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu May 13 02:56:10 UTC 2010","updated_at":"Wed May 19 18:34:52 UTC 2010","overview":"<p>As a scientist and software engineer, Tony Loeser has been working with knowledge representation and reasoning technologies since 1996. His experience with biological data comes from six years at Ingenuity Systems, a pioneer in biomedical knowledge engineering. At Ingenuity, he built the initial version of the knowledge base system, and associated search facilities. Tony was responsible for the architecture of the company&#8217;s software and structured content. Tony also served as Lead Knowledge Architect at Science Commons, a project of Creative Commons, where he contributed to their open source knowledge management system for biomedical research. Before Science Commons, Tony was the vice president of engineering at Tumri Inc., applying semantic technology to their targeted internet advertising network, and delivering products from offices in California and India. As a graduate student, Tony spent two years at Stanford&#8217;s Knowledge Systems Lab studying ontology-based simulation. He received an M.S. in Computer Science and Ph.D. in Physics from Stanford University, and an A.B. in Physics and Mathematics from Harvard University. Tony is concurrently a Senior Research Software Engineer at the Stanford Center for Biomedical Informatics Research and the National Center for Biomedical Ontology.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Chief Architect","firm":{"name":"Syapse","permalink":"syapse","type_of_entity":"company","image":{"available_sizes":[[[150,43],"assets/images/resized/0008/6976/86976v2-max-150x150.jpg"],[[250,72],"assets/images/resized/0008/6976/86976v2-max-250x250.jpg"],[[324,94],"assets/images/resized/0008/6976/86976v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}