{"first_name":"tony","last_name":"zhang","permalink":"tony-zhang","crunchbase_url":"http://www.crunchbase.com/person/tony-zhang","homepage_url":"http://www.beijing-tour-car.com","birthplace":"NY","twitter_username":"zhangkeye","blog_url":"http://www.beijing-tour-car.com","blog_feed_url":"http://www.beijing-tour-car.com","affiliation_name":"Unaffiliated","born_year":1970,"born_month":11,"born_day":20,"tag_list":"beijing-airport-carvan-transfer-pick-up-service, tianjin-cruise-port-car-rental-van-transfer-shuttle-bus-transportation-pick-up-service, chauffeur, transfer, coach-transfer-service, tour-travel-great-wall, lower-price-acrobatic-show-and-martial-art-kongfu","alias_list":null,"created_at":"Fri Jul 13 04:26:20 UTC 2012","updated_at":"Fri Jul 13 08:50:38 UTC 2012","overview":"<p>Beijing airport car/van transfer pick up service, Tianjin cruise port car rental van transfer shuttle bus transportation pick up service, chauffeur, transfer, coach transfer service, tour travel great wall, lower price acrobatic show and martial art KongFu show tickets service. Tour advisor Great Wall private tour guide service, Beijing concierge service.\nhttp://www.beijing-tour-car.com\nEmail: zhangkeye@hotmail.com \nMy name is Tony. Had been working in luxury brand hotel concierge division many years, now I am an qualified English speaking tour guide professional driver with a detailed knowledge of Beijing’s major tourist and business destinations. My all vehicles are clean, late model, fully equipped, comfortable and fully insured professional vehicles. I can transport 12 passengers or less for 59.00 USD per pick-up. Please call me directly on my mobile telephone or email me for any questions. I can meet you or your guests at the airport. I can also transport you to and from meetings, conventions, or tourist attractions.<br/>\nEmail: zhangkeye@hotmail.com<br/>\nbeijing Benz van airport pick up service, Tianjin xingang cruise port drop off service. To diamond princess cruise car transfer service.\nbeijing airport benz van pick up service, to the Hilton Marriott Ritz Carlton hotel only charging $59, with private tour guide service.\nMobile: +86 1362 104 2428\nhttp://www.beijing-tour-car.com \nemail:  zhangkeye@hotmail.com</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0020/0691/200691v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0020/0691/200691v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0020/0691/200691v2-max-450x450.jpg"]],"attribution":"<p>http://www.beijing-tour-car.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}