{"first_name":"Tony","last_name":"van Marken","permalink":"tony-van-marken","crunchbase_url":"http://www.crunchbase.com/person/tony-van-marken","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue May 20 02:31:13 UTC 2008","updated_at":"Thu Nov 27 09:53:17 UTC 2008","overview":"<p>Tony van Marken has had a successful career as a high-tech entrepreneur, management consultant and venture capitalist. Mr. van Marken has been a General Partner of XDL Intervest since 1999 where he managed investments in the telecommunications, wireless and software industries.  Prior to XDL, he was CEO of Architel Systems Corporation (NASDAQ:ASYC, TSE:ASY). Mr. van Marken helped establish Architel as a global leader in telecommunications software development. From 1994 through 1999, he helped Architel achieve a compound annual growth rate of 85 percent, while transforming the company into a leading supplier of Operational Support Systems (OSS) software products to telecommunications service providers worldwide. As president and CEO, he led Architel through its initial public offering on the Toronto Stock Exchange in 1996; fielded its successful expansion into the U.S., European and Asian markets; oversaw the acquisition of Accugraph Corporation and successfully completed a NASDAQ listing in 1998. Architel had annualised revenues of over $50 million (US) and more than 400 employees world-wide. Architel was listed by the Branham Group as the 13th largest independent software company in Canada prior to the sale of the company for $400 million (US) to Nortel on April 19, 2000.</p>\n\n<p>Prior to Architel, Mr. van Marken worked for Andersen Consulting from 1988 through 1994, in South Africa and the United Kingdom, managing and implementing complex systems integration projects in a variety of industries, including government, transportation and telecommunications. Whilst in the United Kingdom, Mr. van Marken worked in Andersen Consulting&#8217;s Telecommunications Industry Group where he was responsible for selling and implementing Billing and Operational Support Systems across Europe. In the earlier stages of his career, Mr. van Marken worked in software development. Mr. van Marken has acted as a director and advisor to numerous public and private venture backed, high technology companies in Canada, the United States and Europe. Recognized as a leader in his field, Mr. van Marken was honoured in 1998 as one of Canada&#8217;s Top 40 Under 40 and was awarded the 1996 Canadian Venture Capital Associations Entrepreneur of the Year Award Mr. van Marken graduated with a B.Sc. (Computer Science) from the University of Cape Town and with a B.Comm. (Economics/Business Economics) from the University of South Africa.   Mr. van Marken is based in Cape Town, South Africa. He is currently Executive Chairman of DataPro Group Limited, South Africa’s leading alternative telecom operator (www.dataprogroup.co.za). He is married with two sons and is an avid runner, cyclist, mountaineer and skier. In June 2005 he completed his quest to climb the world’s seven continental summits becoming the first South African to complete this challenge. </p>","image":{"available_sizes":[[[150,115],"assets/images/resized/0002/9781/29781v1-max-150x150.jpg"],[[216,166],"assets/images/resized/0002/9781/29781v1-max-250x250.jpg"],[[216,166],"assets/images/resized/0002/9781/29781v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}