{"first_name":"Tony","last_name":"Fle-Danijelovich","permalink":"tony-fle-danijelovich","crunchbase_url":"http://www.crunchbase.com/person/tony-fle-danijelovich","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"gTrade","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Sep 24 10:02:20 UTC 2008","updated_at":"Thu Sep 25 20:14:33 UTC 2008","overview":"<p>Tony Fle-Danijelovich is from a financing and banking background, with strong skills and exposure to the Information Technology industry.  Tony has a Bachelor of Business, majoring in Finance and a sub-major in Banking from the University of Technology, Sydney.  During his studies at UTS, Tony completed computer engineering subjects, giving him technical and project management skills to help facilitate the bridge between the financial and technical worlds.  Tony was admitted to the Deans List during his studies at UTS.</p>\n\n<p>Tony has technical work experience from working at CNET Networks Australia and Cashcard Australia Ltd.  Cashcard Australia gave Tony exposure to financial transactions with a technical view point.  His skills were furthered through CNET Networks Australia, giving him extensive knowledge of online marketing, advertising and the emerging Web 2.0 businesses.</p>\n\n<p>Currently Tony holds a position at a prestigious financial institution, Westpac Banking Corporation, Australia.  In this role, Tony is exposed to high level financial transactions and is in an advisory and audit rotational position among the Finance/Accounting department. This role develops Tony&#8217;s knowledge in high level corporate dealings, in addition to strengthening his skills with financial calculations, accounting practices and models.</p>","image":null,"degrees":[{"degree_type":"B. Business","subject":"Finance, Banking","institution":"University of Technology, Sydney","graduated_year":2008,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Financial Director","firm":{"name":"gTrade","permalink":"gtrade","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0002/5596/25596v6-max-150x150.png"],[[250,74],"assets/images/resized/0002/5596/25596v6-max-250x250.png"],[[290,86],"assets/images/resized/0002/5596/25596v6-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}