{"first_name":"Tony","last_name":"Blair","permalink":"tony-blair","crunchbase_url":"http://www.crunchbase.com/person/tony-blair","homepage_url":"http://www.tonyblairoffice.org","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Mon May 24 18:24:52 UTC 2010","updated_at":"Mon May 24 20:04:21 UTC 2010","overview":"<p>Since leaving Downing Street, Tony Blair has served as the Quartet Representative to the Middle East. He represents the USA, UN, Russia and the EU, working with the Palestinians to prepare for statehood as part of the international community&#8217;s effort to secure peace.</p>\n\n<p>The Tony Blair Faith Foundation promotes respect and understanding between the major religions and makes the case for faith as a force for good in the modern world. Faith is vitally important to hundreds of millions of people. But religious faith can also be used to divide. The Tony Blair Faith Foundation is a response to these opportunities and challenges.</p>\n\n<p>The Africa Governance Inititiative delivers projects in Rwanda, Sierra Leone and Liberia, advising President Kagame, President Koroma and President Johnson-Sirleaf respectively on policy delivery and attracting investmen, with a team of his staff working full time at the centre of all three governments. </p>\n\n<p>As the first major head of government to bring climate change to the top of the international political agenda at the 2005 Gleneagles G8 summit, Tony Blair now leads the Breaking the Climate Deadlock initiative, working with world leaders to build consensus on a new comprehensive international climate policy framework.</p>\n\n<p>In recognition of his debt to the North East of England, he has launched the Tony Blair Sports Foundation, to increase opportunities for young people to participate in sport. </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0008/8326/88326v1-max-150x150.jpg"],[[166,250],"assets/images/resized/0008/8326/88326v1-max-250x250.jpg"],[[300,450],"assets/images/resized/0008/8326/88326v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Senior Adviser","firm":{"name":"Khosla Ventures","permalink":"khosla-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,36],"assets/images/resized/0000/1507/1507v1-max-150x150.jpg"],[[250,60],"assets/images/resized/0000/1507/1507v1-max-250x250.jpg"],[[300,73],"assets/images/resized/0000/1507/1507v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}