{"first_name":"Tony","last_name":"Perez","permalink":"tony-perez","crunchbase_url":"http://www.crunchbase.com/person/tony-perez","homepage_url":"http://sucuri.net","birthplace":"Miami","twitter_username":"perezbox","blog_url":"http://perezbox.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1982,"born_month":11,"born_day":16,"tag_list":"web-security, web-malware, information-security, sucuri","alias_list":null,"created_at":"Sun Apr 22 03:54:21 UTC 2012","updated_at":"Thu Apr 26 00:40:46 UTC 2012","overview":"<p>I am the COO / CFO for Sucuri Security. I am part of a dedicated management team whom dedicate countless hours to perfecting our trade and supporting our clients within the web malware market. </p>\n\n<p>In this capacity, as is with many startups, my role is multi-faceted. You will find me working with clients, consumers and businesses, everyday. I will roam the virtual halls of our support system, performing spot checks to ensuring that the quality of our client engagement is in accordance with our company expectations. Along with my peers, we&#8217;ll fight daily fires that can arise when the crux of your business is built around support. </p>\n\n<p>Organizationally, my focus is ensuring our corporate foundation is set. In other words: our attorney&#8217;s have what they need, our bookkeeping is in accordance with GAAP, our vendors are paid on time, our employees are taken care of and training / personal growth is in an everyday occurrence. </p>\n\n<p>Additionally, if you partner with Sucuri you will find me at the back-end of the engagement. Once everyone is happy and go lucky with the idea, the honeymoon phase, I then come in and ensure the paper-work and financial agreements are in order. </p>\n\n<p>Personally, I am very pleased and excited to be part of the Sucuri team. It is by far one of the fastest growing web-malware companies in the world not currently backed by a VC or Angel investor. We are organic, very pragmatic in the decisions we make and based on the performances over the past year have nothing but grand expectations and goals for 2012 and beyond.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"COO/CFO","firm":{"name":"Sucuri LLC","permalink":"sucuri-llc","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0009/1085/91085v5-max-150x150.png"],[[250,100],"assets/images/resized/0009/1085/91085v5-max-250x250.png"],[[400,160],"assets/images/resized/0009/1085/91085v5-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"","firm":{"name":"Sucuri LLC","permalink":"sucuri-llc","type_of_entity":"company","image":{"available_sizes":[[[150,60],"assets/images/resized/0009/1085/91085v5-max-150x150.png"],[[250,100],"assets/images/resized/0009/1085/91085v5-max-250x250.png"],[[400,160],"assets/images/resized/0009/1085/91085v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}