{"first_name":"Tori","last_name":"Donovan","permalink":"tori-donovan","crunchbase_url":"http://www.crunchbase.com/person/tori-donovan","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"T3Media","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jul 11 19:25:42 UTC 2012","updated_at":"Wed Jul 11 19:34:26 UTC 2012","overview":"<p>As Vice President and General Counsel of T3Media, Tori Donovan is responsible for the legal affairs of the company, including licensing, intellectual property, general corporate matters and compliance. Prior to T3Media, Tori was an attorney with Holland &amp; Hart LLP in the firm’s business department where she served as counsel to the company and numerous other emerging companies in various stages of growth and development. Tori brings several years of experience counseling public and private technology companies to T3Media, including extensive expertise in public and private financing, mergers and acquisitions, corporate governance, and securities law disclosure and compliance matters. Prior to joining Holland &amp; Hart, Tori was an attorney with Cooley Godward LLP with their corporate securities practice. Tori earned her law degree from the University of Denver School of Law and received her Bachelor of Arts degree in Economics from the University of Colorado at Boulder. Prior to law school, Tori worked at Janus Funds.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Vice President and General Counsel","firm":{"name":"T3Media","permalink":"thought-equity-motion","type_of_entity":"company","image":{"available_sizes":[[[150,35],"assets/images/resized/0007/3413/73413v5-max-150x150.jpg"],[[250,59],"assets/images/resized/0007/3413/73413v5-max-250x250.jpg"],[[250,59],"assets/images/resized/0007/3413/73413v5-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}