{"first_name":"totally","last_name":"cool","permalink":"totally-cool","crunchbase_url":"http://www.crunchbase.com/person/totally-cool","homepage_url":"http://www.totallycoolliving.com.au","birthplace":"","twitter_username":"","blog_url":"http://www.totallycoolliving.com.au","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"skylight-brisbane","alias_list":null,"created_at":"Mon Jun 06 07:43:39 UTC 2011","updated_at":"Tue Jun 07 14:21:36 UTC 2011","overview":"<p>Whirlybirds are very essential for every home during the summer and when it is a Gold Coast whirly bird from totally cool living, it is the best. During the summer, the temperatures can go as high as 50°C causing discomfort in the living areas and forcing your air conditioners to work harder. The rescue to such a situation can be the Gold Coast whirlybirds. It is designed in a way to remove the hot air and moisture from the roof causing comfort in the living area. It gives you a soothing winter effect with fresh air in the boiling summer. Gold Coast whirlybirds gives you a more effective insulation. By installing a Gold Coast whirly bird you dont only get comfort at your home but also save power and money.</p>\n\n<p>The Benefits of a Gold Coast Whirlybirds are as follows:</p>\n\n<p>Removes hot air trapped in summer\nRemoves moisture build up in winter\nSmooth and quiet operation\nReplaceable bearings for extended lifetime\n10 yr warranty\nLarge range of colours to suit every roof\nAdd a whirly mate ventilation grille to ventilate living areas, garages or sheds</p>\n\n<p>Installing the Cellulose Fibre via the roof to a depth of 100mm providing you with a minimum R2.5/R3 rating, giving you an insulation solution above recommended levels. Our installers are trained for all situations and pride themselves on doing a quality job on all different roofs types and handle them with care and expertise including: Tile, Tin, Clip Lock and Decrotile. Cellulose fibre can also be installed at varying depths enabling it to provide a wide range of R-values across a wider scope of applications that any other insulation product on the market.</p>\n\n<p>Warm in Winter and Cool In Summer</p>\n\n<p>Thickness for thickness, Cellulose Fibre insulation keeps your home warm in winter and cool in summer offering up to 8 degrees difference. This is because Cellulose Fibre is based on paper which is a natural insulation material, and it forms a complete blanket over the roof leaving no gaps, unlike other types of insulation materials. \nTo be technical, Cellulose Fibre has an impressive thermal conductivity value of only 0.036 w/mk. The loose fill installation method ensures a complete seal, eliminating gaps, cracks and other cold bridges. All from recycled newspaper! </p>\n\n<p>Fire Safety \nPeople are often concerned that Cellulose Fibre, being made from newspaper, might not be safe because of the risk of fire. In fact Cellulose Fibre is extremely resistant to fire, as illustrated. </p>\n\n<p>Econotube Flexible Shaft - Natural Light without breaking the budget</p>\n\n<p>At a Glance..\nFlexible foil shaft to accommodate even the most congested of roof cavities\nLeak proof profiles to suit all roof types\nHail resistant dome for those unpredictable Queensland Summers\nSavings on power for a small investment\nRange of sizes - 250mm (bathrooms), 400mm (hallways, kitchens)\nEasy Install Process  - no structural modifications required for the home handyman</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}