{"first_name":"Trae","last_name":"Vassallo","permalink":"trae-vassallo","crunchbase_url":"http://www.crunchbase.com/person/trae-vassallo","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 28 17:13:52 UTC 2008","updated_at":"Thu May 29 02:29:30 UTC 2008","overview":"<p>Trae Vassallo is a Partner at Kleiner Perkins Caufield and Byers. Since joining the firm in 2002, Trae has put her technical and entrepreneurial background to work with companies in two main areas of focus: Greentech and Consumer Internet. Trae works closely with the management teams of Ausra, utility grade solar provider; Altarock Energy, geothermal development company; Fisker Automotive, extended electric luxury automotive company; Terralliance, technology driven O&amp;G exploration; GloriOil, enhanced oil extraction using biotechnology; Aggregate Knowledge, a platform for online discovery; and Cooliris, an incubation focused on a new browsing UI with several recent Stanford grads. Trae is currently focusing on opportunities where Green and Consumer intersect. Her most recent investment is RecycleBank, an incentive program that rewards consumers for recycling.</p>\n\n<p>Prior to KPCB, Trae was a co-founder of Good Technology, a KPCB portfolio company (acquired by Motorola) that provides an end-to-end wireless corporate email solution. While at Good, Trae helped orchestrate the development of the G100 handheld device. Prior to Good Technology, Trae worked as a design engineer at IDEO Product Development where she developed a range of products including the PalmV, the Dell Latitude Docking station and many others. Trae holds 13 patents.</p>\n\n<p>Trae earned a Bachelor&#8217;s and Master&#8217;s in Mechanical Engineering with honors from Stanford University and an MBA from the Stanford Graduate School of Business. Trae is passionate about new technology, good design and spending time with her husband, Steve, and two children.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Kleiner Perkins Caufield & Byers","permalink":"kleiner-perkins-caufield-byers","type_of_entity":"financial_org","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/0998/10998v8-max-150x150.jpg"],[[250,250],"assets/images/resized/0001/0998/10998v8-max-250x250.jpg"],[[450,450],"assets/images/resized/0001/0998/10998v8-max-450x450.jpg"]],"attribution":null}}},{"is_past":false,"title":"Board Observer","firm":{"name":"Opower","permalink":"opower","type_of_entity":"company","image":{"available_sizes":[[[150,27],"assets/images/resized/0005/6342/56342v6-max-150x150.png"],[[250,45],"assets/images/resized/0005/6342/56342v6-max-250x250.png"],[[379,69],"assets/images/resized/0005/6342/56342v6-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}