{"first_name":"Travis","last_name":"Stewart","permalink":"travis-stewart","crunchbase_url":"http://www.crunchbase.com/person/travis-stewart","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Future Ads","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jul 03 22:07:33 UTC 2012","updated_at":"Tue Jul 10 08:26:55 UTC 2012","overview":"<p>A wide spectrum of creative design work goes on at Future Ads, and Travis oversees it all: working closely with the marketing and game departments to execute high-performing marketing creative, Web design and game art. Prior to joining the company in 2005, Travis worked as a freelance designer on a range of 3D, Animation, Illustration, Branding and Web Design projects for major entertainment and Internet companies, including American Express, Sony Pictures, and Konami. At RockIt! Promotions and Media, he created ads and print design for big real estate clients like Prudential. He studied Illustration and Animation at Cal State University, Fullerton.</p>\n\n<p>Obsessed with all things visual, Travis constantly studies (and is inspired by) the universe of design, logos, and illustration (whether in games, movies, magazines, comic books, billboards, etc.) - and loves being able to put in play everything he’s eternally ingesting about design on a daily basis at Future Ads. He also enjoys spending time with his family and golfing. A long-time trumpet player (and former concert soloist), he’s crazy about jazz and big band music.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Vice President, Creative Services","firm":{"name":"Future Ads","permalink":"future-ads","type_of_entity":"company","image":{"available_sizes":[[[150,150],"assets/images/resized/0011/0205/110205v8-max-150x150.png"],[[180,180],"assets/images/resized/0011/0205/110205v8-max-250x250.png"],[[180,180],"assets/images/resized/0011/0205/110205v8-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}