{"first_name":"Travis","last_name":"Luther","permalink":"travis-luther","crunchbase_url":"http://www.crunchbase.com/person/travis-luther","homepage_url":"http://www.crowdshares.com","birthplace":"Los Angeles","twitter_username":"travisluther","blog_url":"http://www.travisluther.com","blog_feed_url":"http://travisluther.com/feed/","affiliation_name":"Law Father","born_year":1978,"born_month":4,"born_day":25,"tag_list":"","alias_list":null,"created_at":"Thu May 24 21:50:28 UTC 2012","updated_at":"Fri May 25 03:17:10 UTC 2012","overview":"<p>I was born in Los Angeles, California. My family moved to rural Washington shortly there after. I grew up in Pullman, Washington. While in Pullman, I owned a skateboard and snowboard shop (TnT Skate and Snow) and two coffee shops (Java Llamas &amp; Pony Espresso). I left Pullman in 1999 and moved back to Los Angeles. After about a year of managing a coffee shop in Hollywood I decided to move to Seattle. In Seattle I held numerous part-time jobs, but my primary interest was music. I started a small record label (Humble Rocks! Records), put out a number of records, and toured the country as the singer/songwriter/guitar player for the band Ultra Find (iTunes link). In 2004 I moved to Denver to return to college – thinking I might become an entertainment lawyer. In school I became very interested in the social sciences. I received a BA in Behavioral Science and then a MA in Sociology. During my undergraduate and graduate studies I started a web marketing and graphic design company called Luther Media. I also worked as a valet in the evenings. One night I got the idea to sell advertising on the blank side of valet tickets. It was then that I formed the company ValetAds. Also while working as a valet I met a very attractive attorney who I would soon marry. Through hanging out with her and her attorney friends I realized there was a huge need for a company that could address the web and media needs of lawyers. So in 2007 I formed a company called Law Father.  Today, as my companies hum along I am working on a new business – CrowdShares.com. The promise of CrowdShares.com is to connect start-ups and small businesses to investors all over the country.</p>","image":{"available_sizes":[[[150,44],"assets/images/resized/0019/1638/191638v2-max-150x150.png"],[[250,74],"assets/images/resized/0019/1638/191638v2-max-250x250.png"],[[295,88],"assets/images/resized/0019/1638/191638v2-max-450x450.png"]],"attribution":"<p>crowd funding crowd sourcing</p>"},"degrees":[{"degree_type":"MA","subject":"Sociology","institution":"University of Colorado Denver","graduated_year":2011,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"President","firm":{"name":"Law Father","permalink":"law-father","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.lawfather.net","title":"Attorney SEO"}],"web_presences":[]}