{"first_name":"Trevor","last_name":"Sumner","permalink":"trevor-sumner","crunchbase_url":"http://www.crunchbase.com/person/trevor-sumner","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"LocalVox Media","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Jun 14 18:34:59 UTC 2011","updated_at":"Sat Nov 03 03:28:19 UTC 2012","overview":"<p>Trevor Sumner is a technology executive with over 15 years of experience in startups with a focus on product and marketing for cutting edge solutions from eCommerce and eBusiness in the late 90s to wireless Internet and messaging solutions in the early 2000s to most recently local, social and mobile marketing platforms. </p>\n\n<p>Trevor is the President and Co-founder of LocalVox Media, a social, local and mobile marketing platform for small and medium businesses founded in early 2010.  LocalVox raised a $7.4m series A in Q3 2012, has over 50 employees and thousands of local business clients including Whole Foods, Buffalo Wild Wings, Sushi Samba, Pizza Hut and All State.</p>\n\n<p>He started his early career at Trilogy Development Group where he was a product manager and department head for secondary sales for their subsidiary pcOrder. During his period there, he closed over $6 million in sales, exceeding his sales targets by over 100%. </p>\n\n<p>He then went on to be the Technical Business Development lead for Tantau Software, growing OEM business unit revenue from $0 to $10m in one year.  Tantau was acquired by 724 Solutions, where he became the Director of Product marketing for all carrier scale products (WAP Gateways, SMS products, billing and user mgmt).</p>\n\n<p>He has since worked in leadership roles for several startups in their early growth stages in product and marketing capacities including Lombardi Software, which was purchased by IBM for $177 million; Narrowstep, a leading Internet video platform; and WePlay, a social network for youth sports with a million members that was invested in by LeBron James, Derek Jeter, Peyton Manning, CAA and MLB.com. </p>\n\n<p>He is an avid fisherman and has caught a 9 ft Black Marlin, is a native New Yorker, and has scuba dived in all seven continents, including Antarctica.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0021/8484/218484v2-max-150x150.jpg"],[[150,150],"assets/images/resized/0021/8484/218484v2-max-250x250.jpg"],[[150,150],"assets/images/resized/0021/8484/218484v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BSE","subject":"Computer Science","institution":"Princeton University","graduated_year":1998,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"President and Co-Founder","firm":{"name":"LocalVox Media","permalink":"localvox-media-nearsay","type_of_entity":"company","image":{"available_sizes":[[[150,127],"assets/images/resized/0013/9187/139187v8-max-150x150.jpg"],[[250,211],"assets/images/resized/0013/9187/139187v8-max-250x250.jpg"],[[450,381],"assets/images/resized/0013/9187/139187v8-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://localvox.com","title":"LocalVox Media Inc."}]}