{"first_name":"Trevor","last_name":"Heritage","permalink":"trevor-heritage","crunchbase_url":"http://www.crunchbase.com/person/trevor-heritage","homepage_url":"http://www.appistry.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Apr 23 16:01:54 UTC 2012","updated_at":"Mon Apr 30 00:56:46 UTC 2012","overview":"<p>Trevor Heritage brings an influential and diverse background in areas such as pharmaceuticals, chemicals, computer science and sales to his role as Appistry’s Vice President of Sales and Marketing. In this role, Heritage effectively combines innate creativity with a results-driven approach to building and developing strategic customer, partner and executive-level relationships. In addition to overseeing the company’s sales and marketing initiatives, he oversees technical positioning and alliance building strategies for Appistry’s life sciences-focused solutions in order to differentiate the company’s innovative solutions from competitors. </p>\n\n<p>Heritage has held a number of high-profile positions in the pharmaceutical, biotechnology, chemicals and software sectors. As comfortable in the boardroom as he is in the laboratory, Heritage has developed a proven track record for transitioning emerging technology companies through successful acquisitions. Prior to his post at Appistry, Heritage served as Executive Vice President, Software Products for San Diego, California-based life science software provider, Accelrys Inc. (Nasdaq: ACCL), where he oversaw business strategy and orchestrated a transformational merger with his former employer, the recently acquired Symyx Software (Nasdaq: SMMX). At Symyx, Heritage served as President with responsibility for software business operations. Heritage assumed this position after serving as the Senior Vice President Operations &amp; Chief Science Officer for Elsevier MDL (acquired by Symyx in 2007). Prior to that, he managed the life science informatics business unit and professional services for St. Louis-based Tripos Inc. for several years. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"VP Sales","firm":{"name":"Appistry","permalink":"appistry-inc","type_of_entity":"company","image":{"available_sizes":[[[82,99],"assets/images/resized/0003/5354/35354v2-max-150x150.png"],[[82,99],"assets/images/resized/0003/5354/35354v2-max-250x250.png"],[[82,99],"assets/images/resized/0003/5354/35354v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}