{"first_name":"Trevor","last_name":"Edwards","permalink":"trevor-edwards","crunchbase_url":"http://www.crunchbase.com/person/trevor-edwards","homepage_url":"http://www.ukfreebingosites.co.uk","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"http://www.ukfreebingosites.co.uk/RSS_Feed-UKFREEBINGOSITES.XML","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"free-bingo, free-online-bingo, play-free-bingo, play-free-bingo-online, no-deposit-bingo, no-deposit-free-bingo, no-deposit-bingo-sites, no-deposit-bingo-uk, new-bingo-sites, new-online-bingo, new-online-bingo-sites, new-bingo-uk, bingo-reviews, online-bi","alias_list":null,"created_at":"Thu Sep 29 09:19:16 UTC 2011","updated_at":"Sat Nov 19 06:31:47 UTC 2011","overview":"<p>UK Bingo, New Bingo Sites</p>\n\n<p>UK Free Bingo Sites offers a huge selection of online bingo sites. They also offer reviews about the wide list of bingo sites. You can also explore their bingo promotions section to know more about the fancy promotional offers offered by other bingo sites.</p>\n\n<p>Company Overview: </p>\n\n<p>Everyone is looking for ways to stretch their budget and save some money. UK Free bingo sites realize that their customers might be having a hard time and are helping out with many more low cost and no deposit bingo bonuses. In many cases, the prizes are just as high in these games so you still have a chance to win some spectacular prizes in the free games and the low cost games.</p>\n\n<p>All you have to do is search for UK free bingo sites and you will find a number of sites to choose from for all your bingo needs. Keep an eye on the UK bingo sites that offer a good mix of free and low cost games for you to play. Don’t forget to look for the sites that are offering you great prizes as well.</p>\n\n<p>Almost all of the new bingo sites will offer you a deposit bonus when you make your first deposit and that is just like playing online bingo for free. You may also get some free bingo games just for signing up to out featured Bingo Sites</p>","image":{"available_sizes":[[[150,22],"assets/images/resized/0015/6069/156069v2-max-150x150.jpg"],[[250,38],"assets/images/resized/0015/6069/156069v2-max-250x250.jpg"],[[407,62],"assets/images/resized/0015/6069/156069v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}