{"first_name":"Triangle","last_name":"Pools Inc.","permalink":"triangle-pools-inc","crunchbase_url":"http://www.crunchbase.com/person/triangle-pools-inc","homepage_url":"http://www.triangle-pool.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"pool-service, swimming-pool-cleaning, pool-filter-repair, swimming-pool-service","alias_list":null,"created_at":"Mon Apr 30 04:37:06 UTC 2012","updated_at":"Wed May 09 03:15:28 UTC 2012","overview":"<p>“Triangle Pools has been providing the best commercial pool repair and residential pool repair services for home owners and commercial pools in Tampa Bay since 1959. Our goal is to provide you the highest quality products and services at the lowest prices. Through the years we have stayed on top of the latest technological advances in the swimming pool service industry earning us a solid reputation for providing true value to our customers.  This in turn has developed into long-lasting relationships with our clients. By utilizing the latest technologies in the swimming pool industry we are able to provide our customers with the best levels of water quality and savings in the maintenance of their swimming pools. We love providing pool service to the Bay Area and you deserve the best!  Triangle Pool Service earned its spot as a local leader due to our friendly and personalized service.  When we service your home or business you will get more than just one of our certified professionals providing the work, you will get a human being that actually wants to help you.  Our pool company was built on the foundation that this business is all about helping people.  We have pioneered the latest advances in pool service like remote commercial pool management systems and residential automated swimming pool service making care and management of your swimming pool easy and hassle-free. Some of our approaches include HRR Control systems and ORP, salt, PPG Accu-tab or ozone purification systems and liquid chlorine. If you are a home owner with a swimming pool in Pinellas or Hillsborough county or the owner of a commercial pool in St Pete, Clearwater, Tampa, Palm Harbor, Largo or Seminole and would like a better way to maintain your swimming pool call Triangle Pool Service for the best pool service in Pinellas county and Hillsborough county.  We also have built a solid reputation for having the best commercial pool management systems in Florida.  We specialize in pool cleaning, pool filters, pool repairs, pool parts and accessories, along with professional residential and commercial pool maintenance and management.“</p>\n\n<p>Triangle Pools Inc.</p>\n\n<p>12801 Belcher Rd S,\nLargo, FL 33773\n(727) 531-0473\nWebsite: http://www.triangle-pool.com </p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0018/7136/187136v2-max-150x150.png"],[[200,200],"assets/images/resized/0018/7136/187136v2-max-250x250.png"],[[200,200],"assets/images/resized/0018/7136/187136v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.triangle-pool.com","title":"Triangle Pools Inc."}]}