{"first_name":"Trip","last_name":"Davis","permalink":"trip-davis","crunchbase_url":"http://www.crunchbase.com/person/trip-davis","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"VibeAgent","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Jul 21 02:08:48 UTC 2007","updated_at":"Thu Aug 05 17:00:58 UTC 2010","overview":"<p>Trip is the Co-Founder and Chairman of travel technology and data services provider TRX (travel technology and data services) and the non-executive Chairman and lead investor in hotelicopter (hotel distribution technology platform).</p>\n\n<p>As an entrepreneur and executive in travel technology and data services over the past 16 years, Trip is a visionary and driving force in the travel industry. He built two successful technology services firms which have been enablers of online travel, now the largest ecommerce category, and fundamental changes in travel marketing and distribution.</p>\n\n<p>He is the Co-Founder and Chairman of TRX, a global leader in travel technology and data services. TRX delivers its technologies in an online, on-demand environment to travel agencies, travel web sites, corporations, travel suppliers, government agencies, credit card associations, credit card issuing banks, and third-party administrators. TRX processes over $400 billion per year in travel volume on behalf of its clients, including transaction data from over 400 sources in 50 countries. Clients include American Airlines, American Express, BCD Travel, British Airways, Carlson Wagonlit, Expedia, MasterCard, Orbitz, the US Government, as well as hundreds of major corporations. Based in Atlanta, TRX is publicly traded and employs 800 people in the United States, United Kingdom, Germany, and India.</p>\n\n<p>Trip co-founded TRX in December 1999. As the CEO and a Board member for nine years, he led the company from start-up to revenue of $110 million in five years and raised over $100 million from strategic investors in November 2001 and an IPO in September 2005. He was named Chairman of the Board in December 2008.</p>\n\n<p>In 2007 and 2002, Business Travel News recognized Trip as one of the Top 25 most influential executives in the travel industry. He is the six-time Chairman of the Masters Program, the premier executive forum for corporate travel industry leaders. In 2005, the National Business Travel Association (NBTA) voted Trip its Member of the Year. Three times, Travel Agent Magazine has listed him as one of the 100 Rising Stars in the travel industry.</p>\n\n<p>Prior to co-founding TRX, Trip was the Senior Vice President and General Manager of the Travel Industry Practice Group at iXL and CEO and Co-Founder of Green Room Productions, a San Francisco-based Internet travel technology company, which he sold to iXL in February 1998.</p>\n\n<p>Trip is also an Adjunct Faculty member and Lecturer at the McIntire School of Commerce at the University of Virginia where as Co-Faculty Director of the Galant Center for Entrepreneurship, he is coordinating the new curriculum in Entrepreneurship.</p>\n\n<p>Trip serves on the Board of Directors of the Riverstone Group, a private holding company with significant assets under management and portfolio companies in financial services, IT services, real estate, hotels, resorts, golf, boating, and consumer brands. He also serves on the Board of Trustees of the Darden School Foundation at the University of Virginia.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0009/6157/96157v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0009/6157/96157v2-max-250x250.jpg"],[[288,288],"assets/images/resized/0009/6157/96157v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"English","institution":"Dartmouth College","graduated_year":1990,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"University of Virginia, Darden School of Business","graduated_year":1994,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Co-Founder & Chairman","firm":{"name":"TRX","permalink":"trx","type_of_entity":"company","image":{"available_sizes":[[[91,43],"assets/images/resized/0008/7116/87116v1-max-150x150.png"],[[91,43],"assets/images/resized/0008/7116/87116v1-max-250x250.png"],[[91,43],"assets/images/resized/0008/7116/87116v1-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"Chairman (non-executive)","firm":{"name":"Hotelicopter","permalink":"hotelicopter","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0000/3547/3547v4-max-150x150.png"],[[221,71],"assets/images/resized/0000/3547/3547v4-max-250x250.png"],[[221,71],"assets/images/resized/0000/3547/3547v4-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"President & CEO","firm":{"name":"TRX","permalink":"trx","type_of_entity":"company","image":{"available_sizes":[[[91,43],"assets/images/resized/0008/7116/87116v1-max-150x150.png"],[[91,43],"assets/images/resized/0008/7116/87116v1-max-250x250.png"],[[91,43],"assets/images/resized/0008/7116/87116v1-max-450x450.png"]],"attribution":null}}}],"investments":[{"funding_round":{"round_code":"b","source_url":"http://www.tnooz.com/2011/03/31/news/hotelicopter-wins-new-funding-round-to-push-distribution-platform/","source_description":"hotelicopter wins new funding round to push distribution platform","raised_amount":1500000,"raised_currency_code":"USD","funded_year":2011,"funded_month":3,"funded_day":31,"company":{"name":"Hotelicopter","permalink":"hotelicopter","image":{"available_sizes":[[[150,48],"assets/images/resized/0000/3547/3547v4-max-150x150.png"],[[221,71],"assets/images/resized/0000/3547/3547v4-max-250x250.png"],[[221,71],"assets/images/resized/0000/3547/3547v4-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}