{"first_name":"Tristan","last_name":"Titeux","permalink":"tristan-titeux","crunchbase_url":"http://www.crunchbase.com/person/tristan-titeux","homepage_url":"http://www.customcarpentry.co.uk/","birthplace":"London","twitter_username":"FittedFurniture","blog_url":"http://www.customcarpentry.co.uk/blog/","blog_feed_url":"http://feeds.feedburner.com/TristanTiteuxsCustomCarpentryBlog","affiliation_name":"Unaffiliated","born_year":1976,"born_month":1,"born_day":2,"tag_list":"fitted-furniture, eco-furniture, bespoke-bookcase, bespoke-wardrobes, fitted-wardrobe, fitted-shelving, custom-shelving, floating-shelves, contemporary-furniture, upcycling, upcycled, recycled, waste, eco-materials","alias_list":null,"created_at":"Mon Apr 09 19:04:47 UTC 2012","updated_at":"Sat Apr 14 19:22:34 UTC 2012","overview":"<p>Tristan Titeux, is a Belgian Contemporary eco fitted furniture designer and eco pioneer. His company, Custom Carpentry builds bespoke fitted furniture, using eco friendly materials for people who care about their health and the planet.</p>\n\n<p>He started Custom Carpentry in 2003 riding around on his bike fixing people’s houses in Notting Hill. Now Custom Carpentry specialise in making Contemporary Fitted Furniture. Although they mainly work for private customers in London, Tristan has also designed bespoke bookcases and fitted storage on various occasions for Westminster Abbey, as well as fitted furniture for TV home makeover programmes such as “60 Minute Makeover” on ITV and “Homes for the Brave” on SKY.</p>\n\n<p>Tristan is a member of the “Organisation for Responsible Business” which puts ethics at the forefront of business. The quality and service of their work is also backed up by “The Guild of Master Crafstmen” and “The Furniture Ombudsman”.</p>\n\n<p>Tristan was born in 1976 in London, a few months later he moved to Belgium. He learned a lot about nature, witnessed the origin of where our goods come from, such as honey from their bees, eggs from their chickens, milk from their goats and heat from the trees around. He spent many hours in his dads shed playing with tools and constructing houses in the woods behind his house.</p>\n\n<p>He went back to live in London at the age of 13, turned half his bedroom into a workshop and made and dismantled many things. At college he studied photography and spent 12 years as UK’s most prolific club photographer documenting the dance scene for every dance music magazine in the UK.</p>\n\n<p>He decided he was going to build a house in France and live of the land, so he did a carpentry course. But never made it to France and instead carried on in the direction of carpentry to this day.</p>\n\n<p>Tristan says that the main practical problem he deals with the most is, that no matter what size home we live in, we never seem to have enough space for all our belongings.</p>\n\n<p>Secondly, we are losing an area of the Rainforest the size of a football pitch every single second.\nAnd many furniture manufacturers are using wood that comes from unsustainable sources.</p>\n\n<p>Finally, Modern furniture is made with of all sorts of polluting and unhealthy chemicals.</p>\n\n<p>Tristan’s solution to ensure you get the best use of your space, is to talk with you in detail, find out exactly what you want to store, then design and build beautiful fitted furniture that fits perfectly.</p>\n\n<p>To avoid the Amazon being lost forever, Tristan only uses wood that comes from sustainably managed forests and he also promotes renewable alternatives to wood.</p>\n\n<p>To create a healthier home for you he uses paints and materials that don’t contain nasty chemicals.</p>\n\n<p>Tristan’s mission is to ensure that all fitted furniture will be totally sustainable in the future.</p>\n\n<p>He says the more he talks to different people, he realises that people really care, and given the choice they would opt for an ethical eco option.</p>\n\n<p>Tristan is known as an Eco fitted furniture pioneer, for his innovative use of natural materials never seen in fitted furniture before.</p>\n\n<p>Tristan leaves people feeling deeply satisfied that by purchasing Eco Furniture they have taken an important step towards a cleaner &amp; better world for all of us &amp; our children. </p>\n\n<p>Connect with Tristan now on Twitter: @TristanTiteux or search Tristan Titeux in Google. \nHis websites are: www.CustomCarpentry.co.uk and for a more personal view: www.TristanTiteux.com</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.treehugger.com/interior-design/milo-tables-made-wood-waste-and-arent-afraid-show-it.html","title":"Tree Hugger"},{"external_url":"http://inhabitat.com/tristan-titeux-colorful-re-cut-furniture-is-made-from-recycled-wood/","title":"Inhabitat"},{"external_url":"http://www.ukhandmade.co.uk/","title":"Uk Handmade"},{"external_url":"http://www.lyndseyyoung.co.uk/small-businesses-that-green-our-world-milo/?utm_source=twitterfeed&utm_medium=twitter","title":"Queen of Easy Green"},{"external_url":"http://www.mygreendirectory.info/article/the-milo-table-the-new-first-baby-from-the-re-cut-series-using-waste-off-cuts.html","title":"My Green Directory"},{"external_url":"http://myzerowaste.com/2011/10/recycled-table/","title":"My Zero Waste"}],"web_presences":[{"external_url":"http://twitter.com/TristanTiteux","title":"Twitter Tristan Titeux"},{"external_url":"http://twitter.com/FittedFurniture","title":"Twitter Custom Carpentry"},{"external_url":"http://twitter.com/EcoDesignerHome","title":"Twitter Eco Designer Home"},{"external_url":"https://www.facebook.com/CustomCarpentry","title":"Facebook Tristan Titeux"},{"external_url":"https://www.facebook.com/CustomCarpentryUK","title":"Facebook Custom Carpentry business page"},{"external_url":"http://www.linkedin.com/profile/view?id=39106199&trk=tab_pro","title":"LinkedIn Tristan Titeux"}]}