{"first_name":"Tristan","last_name":"Curry","permalink":"tristan-curry","crunchbase_url":"http://www.crunchbase.com/person/tristan-curry","homepage_url":"http://www.MonitiumMan.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1952,"born_month":12,"born_day":16,"tag_list":"monitium, direct-sales","alias_list":null,"created_at":"Sun Nov 28 01:21:37 UTC 2010","updated_at":"Wed Dec 01 21:29:28 UTC 2010","overview":"<p>My Curry is a Marketer for Moitium Max</p>\n\n<p>MonitiumSystemSuccess</p>\n\n<p>Written by tristancurry 2 hours ago</p>\n\n<p>http://www.monitiummax.com A new platform in direct sales</p>\n\n<p>http://www.squidoo.com/monitium-health VIDEO</p>\n\n<p>http://bit.ly/hTybW6 Doc   on     eBay flyer you can custom for YOU!  to advertise</p>\n\n<p>http://tristancurry.posterous.com/pages/life-without-fear-worry-or-rules</p>\n\n<p>I like to say Imagine The Possibilities If you can dream it-God has already provided it. Discover Your Purpose, Sharpen Your Focus, Define Your Niche</p>\n\n<p>Monitium is the most powerful paradigm shift to ever hit the network marketing industry, and how this revolutionary new platform will change your financial future. You will learn about the challenges that most leaders in this industry face, and how Monitium&#8217;s new business model addresses these challenges, protects the business that you grow, and enables a level of income that was never before possible in multi-level marketing.</p>\n\n<p>WOW GREEN     IS Monitium&#8217;s FIRST Company of Choice</p>\n\n<p>http://www.divshare.com/download/13140058-73b</p>\n\n<p>MonitiumMan </p>\n\n<p>The state of our economy is calling for new ideas like Monitium. The Network Marketing Industry is ready for – in fact, dying for – Monitium’s new business model. And now, more than ever, men and women around the world need to take their financial future in their own hands. The timing is critical — it’s A Perfect Storm!</p>\n\n<p>We are already live in the top 18 Direct Sales countries in the world, and we are just entering the Pre-Launch of Monitium. Our actual Official Launch will not take place for several months. Secure your place NOW! There’s going to be an avalanche!</p>\n\n<p>The Key To Creating Wealth Is Timing. You are right now among the first few thousand people to learn about Monitium. Massive numbers of people around the globe will join Monitium over the next 12-18 months. More importantly, you have the chance to be in front of the wave that is about to hit. You can position yourself in Monitium for a level of success that nobody else will ever have again. Whatever you do — don’t let this pass you by, not this time!</p>\n\n<p>Your Monitium Partner in Success, http://www.MonitiumMan.com</p>\n\n<p>tristan curry\ntristan@monitium.com 301 336 7871</p>\n\n<p>new platform in direct sales</p>","image":{"available_sizes":[[[150,64],"assets/images/resized/0011/1979/111979v2-max-150x150.jpg"],[[250,106],"assets/images/resized/0011/1979/111979v2-max-250x250.jpg"],[[450,192],"assets/images/resized/0011/1979/111979v2-max-450x450.jpg"]],"attribution":"<p>Mentor Coach</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}