{"first_name":"Troy Allen","last_name":"Dyer","permalink":"troy-allen-dyer","crunchbase_url":"http://www.crunchbase.com/person/troy-allen-dyer","homepage_url":"http://www.prlog.org/11907710","birthplace":"","twitter_username":"TROYALLENDYER","blog_url":"http://www.imdb.com/name/nm3606414/resume","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1977,"born_month":1,"born_day":1,"tag_list":"geneva, media, holdings, troyallendyer","alias_list":null,"created_at":"Tue Dec 06 17:47:42 UTC 2011","updated_at":"Tue Jul 10 16:52:26 UTC 2012","overview":"<p>Mr. Dyer specializes in tax, estate planning, charitable giving, and trust and estate administration for wealthy individuals and families in American media, film and television industries. His experience includes advising corporate and individual fiduciaries of trusts and estates, and senior executives of family offices. He has a particular expertise with founders of successful business ventures, and with executives of public corporations.</p>\n\n<p>CURRENT WORK</p>\n\n<p>Founder of Geneva Media Holdings, LLC.  A new funding vehicle for feature film slates that offers a proprietary structure designed to protect pension, foundation, hedge fund, private bank, family office and direct equity investors from potential losses when investing in Hollywood feature films. The fund is principal protected, asset backed, tax favored and fully insured. It provides high yields and lossless returns. The function of Geneva Media&#8217;s fund is to never lose a single penny of our client&#8217;s assets by providing superior risk mitigation, while also providing substantial profits in a low-level, capital gains tax environment.</p>\n\n<p>BUSINESS BACKGROUND</p>\n\n<p>Prior to 1999, Mr. Dyer was with Harris Trust / Nesbitt Burns / Bank of Montreal as Director and Senior Manager of financial verticals. He has worked at AXA, AMEX and Transamerica Financial as a professional advisor, and provided personal and corporate financial solutions for successful writers, directors, and producers. </p>\n\n<p>EDUCATION </p>\n\n<p>Troy was accepted to the University of Southern California and secured a personal recommendation letter from then USC Board Member William Wrigley, the chewing gum magnate. He attended USCinema and received the school&#8217;s Cinema Circulus Scholarship &#8211;graduating with a professional degree in screenwriting and film production.  He has held numerous certifications, licenses and accredations for insurance, investment and tax advisory matters, and is a member of First Financial Resources (the only &#8220;producer owned&#8221; group currently practicing advanced insurance planning in the USA).</p>\n\n<p>CHARITABLE WORK</p>\n\n<p>Mr. Dyer has been involved in venture philanthropy and has raised funds and donated to The Time is Now to Help the Children, The Maple Counseling Center, Willow Creek Community Church and to hospitals, colleges and environmental outreach groups.</p>\n\n<p>STORY DEVELOPMENT </p>\n\n<p>During his studies in Los Angeles, he worked for manager-writer-lawyer, Samantha Shad (during the first of the large spec script sales, started by David Chappe&#8217;s &#8220;Gale Force&#8221; script). He interned at the leading daytime dramatic serial (Bell-Philip), as a production assistant for The Young And The Restless (the historically highest rated dramatic serial). </p>\n\n<p>SPECIALTIES</p>\n\n<p>Mr. Dyer specializes in tax, estate planning, charitable giving, and trust and estate administration for wealthy individuals and families in American media, film and television industries. His experience includes advising corporate and individual fiduciaries of trusts and estates, and senior executives of family offices. He has a particular expertise with founders of successful business ventures, and with executives of public corporations.  His specialties include: Risk Management, Principal Protection, Film Financing, Asset Protection, Advanced Estate Planning, Weath Management.</p>","image":{"available_sizes":[[[94,150],"assets/images/resized/0016/5428/165428v4-max-150x150.jpg"],[[158,250],"assets/images/resized/0016/5428/165428v4-max-250x250.jpg"],[[181,286],"assets/images/resized/0016/5428/165428v4-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}