{"first_name":"Troy","last_name":"Dayton","permalink":"troy-dayton","crunchbase_url":"http://www.crunchbase.com/person/troy-dayton","homepage_url":"","birthplace":"","twitter_username":"tdazzl","blog_url":"","blog_feed_url":"","affiliation_name":"ArcView Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Mon Aug 01 02:17:58 UTC 2011","updated_at":"Wed Aug 03 23:48:47 UTC 2011","overview":"<p>Troy Dayton is a veteran of the &#8220;.com&#8221; boom of the late 90&#8217;s, the green tech boom of the 00&#8217;s, and now the legal medical marijuana boom of the 10&#8217;s.  And throughout it all, he has been playing key roles in the effort to reform U.S. drug policies.  </p>\n\n<p>From 2007-2010 he was the top fundraiser for the Marijuana Policy Project (MPP) and was MPP’s lead liaison to the new legal cannabis industry. CNN profiled Troy as part of a special on the science of happiness, in which he discussed how his responsible drug use supports his ongoing mental well-being. Most recently, Troy became a founding board member of the National Cannabis Industry Association.</p>\n\n<p>While in college at American University in Washington, DC, Troy co-founded the national Students for Sensible Drug Policy, now active on over 200 college campuses. After meeting a host of other adventurous entrepreneurs selling books door-to-door with the Southwestern Company in college, he teamed up with them in beginning phases of the launch of Zoom Culture (a now defunct digital video media company that was a few years too early on banking on the power of online communities and video sharing).  A few of the top people from Zoom Culture, including Troy, teamed up again to start Renewable Choice Energy in 2001.  Troy created their residential and fortune 500 sales programs. They were recently named the #1 Green Power Provider by the EPA.  He later helped found the Interfaith Drug Policy Initiative and made national headlines by gathering support from Nevada religious leaders to support a ballot initiative to make marijuana legal. He was the promotional director and a script consultant for the film, BUSTED: The Citizens Guide to Surviving Police Encounters, narrated by former ACLU executive director Ira Glasser and seen by millions. </p>","image":{"available_sizes":[[[150,135],"assets/images/resized/0014/7172/147172v1-max-150x150.jpg"],[[250,225],"assets/images/resized/0014/7172/147172v1-max-250x250.jpg"],[[282,254],"assets/images/resized/0014/7172/147172v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"ArcView Group","permalink":"arcview-group","type_of_entity":"company","image":{"available_sizes":[[[150,65],"assets/images/resized/0014/7171/147171v1-max-150x150.png"],[[250,108],"assets/images/resized/0014/7171/147171v1-max-250x250.png"],[[292,127],"assets/images/resized/0014/7171/147171v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"https://www.facebook.com/profile.php?id=537418535","title":"Facebook"},{"external_url":"http://www.linkedin.com/pub/troy-dayton/21/a0a/850","title":"LinkedIn"}]}