{"first_name":"Trummell","last_name":"Valdera","permalink":"trummell-valdera","crunchbase_url":"http://www.crunchbase.com/person/trummell-valdera","homepage_url":"http://www.trummellvaldera.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jun 01 16:31:24 UTC 2012","updated_at":"Sat Jun 09 15:15:00 UTC 2012","overview":"<p>Trummell Valdera has had a long successful career in human resources. She was one of the first people in the country to earn the certification of Senior Professional in Human Resources from the HR Certification Institute in the mid-1980s. SPHR certification means many things. It means that Valdera has spent at least 6 years in the field and has continually worked to advance the field of HR. And because an SPHR creates HR policy for an organization, she does not simply follow instructions given to her.</p>\n\n<p>Raised in Philadelphia, PA, Trummell Valdera attended Penn State University, where she received a BA in psychology. Her original goal was to become a psychologist, but that changed after she found a job recruiting for a health consortium. Her career in HR has taken her up and down the Eastern seaboard. She has worked for hospitals and medical centers including Johns Hopkins and Children&#8217;s Hospital of Philadelphia. </p>\n\n<p>In 2004, the CEO of Jackson Health System in Miami, FL, brought Valdera on staff as the senior vice president and chief human resources officer. The CEO, Marvin O&#8217;Quinn sought Valdera out specifically for her experience in dealing with labor unions and her unparalleled human resource expertise. The hospital was undergoing major restructuring and the team needed a HR professional who could hit the ground running. Valdera proved to be just that, as she improved the efficiency of the department, increased productivity and changed the organizational structure to better make use of each person&#8217;s skills.</p>\n\n<p>While her career is important, family is just as important, if not more, to Trummell Valdera. In 2001, she resigned from her position at CHOP to care for her ailing mother. While some would question that as a career move, it proved to be a blessing. In 2004, when she was ready to return to work, the perfect position was open for her at Jackson.</p>\n\n<p>In addition to her love and devotion to family, Valdera is devoted to helping others around her. She is an ardent supporter of the arts. She financially supports the Kimmel Center in Philadelphia, PA and enjoys attending plays and visiting museums.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}