{"first_name":"Tucker","last_name":"Max","permalink":"tucker-max","crunchbase_url":"http://www.crunchbase.com/person/tucker-max","homepage_url":"http://tuckermax.com","birthplace":"","twitter_username":"TuckerMax","blog_url":"","blog_feed_url":"http://feeds.feedburner.com/TuckerMaxcom","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Tue Nov 06 16:56:50 UTC 2012","updated_at":"Tue Nov 06 17:06:21 UTC 2012","overview":"<p>My name is Tucker Max and I am an asshole. </p>\n\n<p>I get excessively drunk at inappropriate times, disregard social norms, indulge every whim, ignore the consequences of my actions, mock idiots and posers, sleep with more women than is safe or reasonable, and just generally act like a raging dickhead.</p>\n\n<p>But, I do contribute to humanity in one very important way. I share my adventures with the world. </p>\n\n<p>Tucker Max received his BA from the University of Chicago in 1998, and his JD from Duke Law School in 2001. He even attended Duke Law School on an academic scholarship, where he neglected to buy any of his textbooks for his final two years and spent part of one semester–while still enrolled in classes–living in Cancun.</p>\n\n<p>His first book, I Hope They Serve Beer In Hell, is a #1 New York Times Best Seller, spent five years on the list, and has over 2 million copies in print. His second book, Assholes Finish First, and his third book, Hilarity Ensues, are also NY Times Best Sellers. He co-wrote and produced the movie based on his life/book, also titled “I Hope They Serve Beer In Hell.” He has also been credited with being the originator and leader of a new literary genre, “fratire,” is only the third writer (after Malcolm Gladwell and Michael Lewis) to ever have three books on the NY Times Nonfiction Best Seller List at one time, and was nominated to the Time Magazine 100 Most Influential List in 2009. He currently lives in Austin, Texas.</p>","image":{"available_sizes":[[[150,107],"assets/images/resized/0021/9066/219066v1-max-150x150.png"],[[210,151],"assets/images/resized/0021/9066/219066v1-max-250x250.png"],[[210,151],"assets/images/resized/0021/9066/219066v1-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"","institution":"University of Chicago","graduated_year":1998,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}