{"first_name":"Tushar","last_name":"Mahajan","permalink":"tushar-mahajan","crunchbase_url":"http://www.crunchbase.com/person/tushar-mahajan","homepage_url":"http://www.multitechdevices.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"piston-operated-flow-switch, insertion-type-flow-switches, sight-flow-indicator--for-visual-flow-indication-manufacturer, flow-transmitter-exporter","alias_list":null,"created_at":"Tue Apr 17 10:38:54 UTC 2012","updated_at":"Sun Apr 22 07:22:27 UTC 2012","overview":"<p>Multi - Tech Devices</p>\n\n<p>Established in the year 1992, we “Multi - Tech Devices” are one of the leading manufacturers and exporters of Industrial Switches and other Electronic Process Systems. With an expertise in offering superior quality switches to our clients, we have built our business based on perfection, passion and trust we have gained from our customers.</p>\n\n<p>We can provide the solutions exacting your requirement after carefully understanding your applications, to provide you prompt and efficient services. It has been our continuous endeavor to offer innovative product line, which are simple to use.</p>\n\n<p>Empowered by the expertise of our competent team of professionals, we are able to offer an exhaustive gamut of precision engineered flow switches, flow meter, flow indicators and other machine tools instruments. The entire assortment is manufactured at par with various international standards and industry norms. Our spectrum has found a wide usage as it address to the requirements of various engineering industries. The entire range is manufactured using premium sheet metal sourced from reliable vendors.</p>\n\n<p>Features:</p>\n\n<p>• Durable\n• Sturdy construction</p>\n\n<p>Telephone:  +(91)-(22)-65247315 </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}