{"first_name":"Tyler","last_name":"Tysdal","permalink":"tyler-tysdal","crunchbase_url":"http://www.crunchbase.com/person/tyler-tysdal","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 08 10:49:09 UTC 2009","updated_at":"Mon Jun 08 10:54:28 UTC 2009","overview":"<p>Tyler is a Managing Director of BrandJourney Capital and Mantucket Capital. His investment background includes venture capital, buyouts, restructurings, hedge funds, real estate, public financings and several entrepreneurial ventures.</p>\n\n<p>Prior to joining Mantucket Capital, Tyler was the founder of TIVIS Capital, a private equity fund primarily focused on healthcare and media &amp; entertainment and secondarily on real estate and construction services. At TIVIS Capital, Tyler was the co-founder and/or President of portfolio companies Sports Shares (www.sportsshares.com), National Sports Services, SmartCare Family Medical Centers and BridgeHealth International.</p>\n\n<p>Prior to founding TIVIS Capital, Tyler was the CFO of a company building U.S.-standard healthcare facilities in China and CFO of one of the nation’s largest compounding pharmacies. In addition, he financed the early stages of the first business-to-business e-commerce marketplace to go public, and later he became active in making several venture capital and buyout investments.</p>\n\n<p>Early in his career, Tyler was CEO of EduNation, a mall-based &#8220;edutainment&#8221; retail company, and CEO for a 30-person business development group that created an e-commerce business-to-business marketplace in the lumber and building materials industry for a publicly traded partner. He began his career as an investment banking financial analyst with Alex Brown &amp; Sons, conducting merger,acquisition and corporate finance engagements. He also served as a director and in various roles for a family-owned holding company of several McDonald&#8217;s restaurants.</p>\n\n<p>Tyler has served on non-profit boards such as the National Multiple Sclerosis Society – Colorado and the Special U.S. Committee for the United Nations Global Compact.</p>","image":{"available_sizes":[[[104,150],"assets/images/resized/0004/7341/47341v1-max-150x150.jpg"],[[152,219],"assets/images/resized/0004/7341/47341v1-max-250x250.jpg"],[[152,219],"assets/images/resized/0004/7341/47341v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Brand Journey Capital","permalink":"brand-journey-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,34],"assets/images/resized/0004/7339/47339v2-max-150x150.jpg"],[[250,56],"assets/images/resized/0004/7339/47339v2-max-250x250.jpg"],[[281,64],"assets/images/resized/0004/7339/47339v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}