{"first_name":"Uday","last_name":"Kumar, MD","permalink":"uday-kumar-md","crunchbase_url":"http://www.crunchbase.com/person/uday-kumar-md","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat May 30 06:49:09 UTC 2009","updated_at":"Sat May 30 06:49:50 UTC 2009","overview":"<p>Dr. Uday N. Kumar, a cardiologist and cardiac electrophysiologist by training, is the Founder and Chief Medical Officer of iRhythm Technologies, Inc., He has also served as an Adjunct Clinical Instructor of Cardiovascular Medicine and Lecturer in Bioengineering at Stanford University, where he previously was a Biodesign Cardiovascular Innovation Fellow (’05-’06).  As a Fellow there, he focused on identifying and developing solutions to unmet needs in the field of cardiac electrophysiology (EP); one of these ideas formed the basis for iRhythm Technologies, Inc., which he founded in late 2006. </p>\n\n<p>Prior to coming to Stanford, Uday completed fellowships in cardiac EP and cardiology at the University of California, San Francisco (UCSF) in 2005 and 2003, respectively.  He previously completed his training in internal medicine in 2001 at Columbia-Presbyterian Hospital of Columbia University.  From 1998-1999, he helped launch Biomedical Modeling Inc., a company that created models from imaging data using rapid prototyping techniques for use in numerous medical areas.  He started work on this project when he was a student at Harvard Medical School, from which he received his M.D. in June 1998.  Prior to this, he received his B.A. magna cum laude in Biochemistry from Harvard College in 1994.  Uday grew up in Rhode Island and is originally from Bangalore, India.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder","firm":{"name":"iRhythm Technologies","permalink":"irhythm","type_of_entity":"company","image":{"available_sizes":[[[122,68],"assets/images/resized/0004/6028/46028v1-max-150x150.png"],[[122,68],"assets/images/resized/0004/6028/46028v1-max-250x250.png"],[[122,68],"assets/images/resized/0004/6028/46028v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}