{"first_name":"Ulrich","last_name":"Gallizzi","permalink":"ulrich-gallizzi","crunchbase_url":"http://www.crunchbase.com/person/ulrich-gallizzi","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Gaikai","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 11 20:34:53 UTC 2010","updated_at":"Tue Apr 12 01:03:53 UTC 2011","overview":"<p>Ueli is Vice President of Cloud Computing at Gaikai. Ueli was previously Lead Architect at UPC Broadband. In this position Ueli was the design authority in complex integration projects with over 30 integrated systems. As CIO of DataCore, he was responsible for the implementation of a highly available server infrastructure project.</p>\n\n<p>In 2004 Ueli became a team lead in J2EE engineering at Cablecom. During his time at Cablecom he was architect and development lead of the first web-based, fully automated real time provisioning system. When Cablecom was purchased by Liberty Global, Ueli was promoted to Integration Architect. In this position he was responsible for Web and OSS integration for all of Europe. Ueli initiated the UPC Canonical Data Model initiative, which is a shared information model for all UPC entities, now utilized across all UPC countries.</p>\n\n<p>Ueli studied Information Technology at the Zurich University of Applied Sciences, where he graduated with honors with a specialization in System Communications and Distributed Systems.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CIO","firm":{"name":"Gaikai","permalink":"gaikai","type_of_entity":"company","image":{"available_sizes":[[[150,84],"assets/images/resized/0009/7953/97953v12-max-150x150.jpg"],[[250,140],"assets/images/resized/0009/7953/97953v12-max-250x250.jpg"],[[450,253],"assets/images/resized/0009/7953/97953v12-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}