{"first_name":"Ultimate","last_name":"Videotronics","permalink":"ultimate-videotronics","crunchbase_url":"http://www.crunchbase.com/person/ultimate-videotronics","homepage_url":"http://www.indiamart.com/ultimatevideotronicsindia/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed May 11 06:57:59 UTC 2011","updated_at":"Fri May 13 14:27:46 UTC 2011","overview":"<p>Ultimate Videotronics India Limited is a creative production company specializing in the making of corporate films, documentary films, training videos, multimedia presentations, office presentations, tailor made programs.</p>\n\n<p>Our creativity in our domain has helped us develop a comprehensive spectrum of services that are provided to our clients to their complete satisfaction. Our services encompasses </p>\n\n<p>Public Relation Activity, Corporate Films, Documentary Film, Training Film, Multimedia, Public Relation, Website Designing, 3D Animations.</p>\n\n<p>We are garnered with all the resources right from a dedicated team of professionals to a well equipped studio and all other inventories that help us deliver our services to the core competence. Our modern and technologically abreast studio is installed with an in-house pre and post production facility wherein we have non-linear editing setup with latest cameras and light equipments.</p>\n\n<p>Our belief has always been in delivering quality work with the best of our capabilities, and to achieve that, we foray into every bit of our tasks to ensure that there is no compromise on quality.</p>\n\n<p>Phone:+(91)-(11)-65666214</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0013/4118/134118v2-max-150x150.jpg"],[[200,200],"assets/images/resized/0013/4118/134118v2-max-250x250.jpg"],[[200,200],"assets/images/resized/0013/4118/134118v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}