{"first_name":"Umair","last_name":"Shah","permalink":"umair-shah","crunchbase_url":"http://www.crunchbase.com/person/umair-shah","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Aug 23 05:46:29 UTC 2011","updated_at":"Tue Aug 23 05:49:41 UTC 2011","overview":"<p>Umair Shah is an experienced computer scientist and software engineer with a deep passion for product development. During his PhD track he worked on a range of scalable internet services projects at Carnegie Mellon University (CMU) including Active Networks, Darwin, Sensor Networks and Pervasive Computing. He also worked at IBM TJ Watson Research Lab where his work on Storage Area Networks led to the filing of two patents for his algorithms. Parting ways from PhD, he started his career in developing product ideas at startup businesses. He led a team of developers at Varcore Systems to design and develop their enterprise software suite. Then he led a team of developers at NextFrequency to design an innovative RFID sensor network based Patient Tracking software system for the Health care industry. Eventually his passion for computing and research challenges landed him in the financial industry of Chicago where he works on developing high performance scalable applications for the real time processing of massive volumes of market data. A UNIX guru and a programmer par excellence, Umair provides the strategic direction and objectives for Arbisoft.</p>","image":null,"degrees":[{"degree_type":"MS","subject":"","institution":"Carnegie Mellon University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Co-founder","firm":{"name":"Arbisoft","permalink":"arbisoft","type_of_entity":"company","image":{"available_sizes":[[[150,47],"assets/images/resized/0015/0645/150645v1-max-150x150.jpg"],[[250,79],"assets/images/resized/0015/0645/150645v1-max-250x250.jpg"],[[259,82],"assets/images/resized/0015/0645/150645v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}