{"first_name":"Umer","last_name":"Saeed","permalink":"umer-saeed","crunchbase_url":"http://www.crunchbase.com/person/umer-saeed","homepage_url":"http://www.umersaeed.com","birthplace":"Pakistan","twitter_username":"umergpx","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1992,"born_month":9,"born_day":2,"tag_list":"web-design, web-development, graphic-design, front-end-development","alias_list":null,"created_at":"Mon Jun 25 20:33:28 UTC 2012","updated_at":"Tue Jun 26 00:14:37 UTC 2012","overview":"<p>I am Umer Saeed, have several years of experience in Web Industry. Undoubtedly, there are lots of freelancers available on internet but in fact only small numbers are skillful, reputable, reliable and affordable. If you are searching freelancer for your work which is best at affordable price, you are at the right place.</p>\n\n<p>I am passionate about my work and always try hard to do my projects as perfect as possible. I have many trusted customers who admire me because of my abilities to grasp new concepts and to develop innovative ideas. My projects show my dedication and professionalism towards work. People love to work with me because my designs have international standards, and browser compatibility. Moreover, I always work hard to get new and up-to-date ideas which facilitate me in my new campaigns.</p>\n\n<p>Whether you are a site producer, a designer, a company owner or an in-house webmaster, trying to move your web presence, this website is helpful for you. If you&#8217;re immersed in any of the following fields like educational, governmental, or corporate worlds and need an easy-to-read and up-to-date web site, Please feel free to contact. </p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0019/7235/197235v2-max-150x150.jpg"],[[167,250],"assets/images/resized/0019/7235/197235v2-max-250x250.jpg"],[[208,310],"assets/images/resized/0019/7235/197235v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}