{"first_name":"Upkar","last_name":"Dhaliwal","permalink":"upkar-dhaliwal","crunchbase_url":"http://www.crunchbase.com/person/upkar-dhaliwal","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Invisitrack","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Oct 20 13:07:18 UTC 2010","updated_at":"Mon Oct 25 01:11:04 UTC 2010","overview":"<p>Upkar Dhaliwal is Founder &amp; CEO at Future Wireless Technologies; a Consultancy with over 20 years of hands-on wireless and internet experience. A Professional Chartered Engineer of Engineering Council UK, he is a Senior Wireless &amp; RF System Architect/Executive industry expert serving on numerous industrial/technical bodies like IEEE 802.16, .15, IEEE IMS MTT-S, IEEE RWS and IEEE ICUWB, with specialized knowledge and technical leadership in the design and development of state of the art wireless circuits and systems doing technical business developments for Start-up and the investment community. Key is a collaborative partnering contacts in a huge network.</p>\n\n<p>At present he has been undertaking Application, Intellectual Property, Business Development and Technical advisor support for Present and Future Wireless Technologies and product development for Start-ups, OEMs, private equity and Market Leaders customers. He has been building up HSPA, LTE, WIMAX, WRAN, MSS and UWB- BAN network and knowledge in business solutions which have included 802 WG Voting status and industry activities for 4G and Cognitive radios for 5G, All this involves very close customer engagements for architect strategies &amp; specifications.</p>\n\n<p>In general, for the past 15 years, his focus has been on understanding and applying system requirements and specifications in State of the Art Wireless Communications. He has worked for STMicroelectronics on a joint design team with NOKIA Mobile, for QUALCOMM for 8 years thru the 3G –CDMA/UMTS era, and for SAMSUNG Telecom for early 2G – GSM. At present, working on 4G with leading WiMAX Forum Founding member on 802.16e MIMO with 802.11n MIMO chipset using Intel Atom ecosystem. Also charting towards 5G in terms of Cognitive Radios.  </p>\n\n<p>Major accomplishments are world-class first’s early call in 3Gx1 CDMA, UMTS &amp; Dual Mode UMTS+GSM chipset development – which is the complete design cycle of HW &amp; SW integration from product definition to High Level definition thru to chipset verification, customer sampling/support, Type Approvals, GCF/CCF Certification Forum into production of the First single chip transceiver, single SW stack &amp; integrated modem, At present, working with application teams to develop on x86 and ARM-Cortex platform for Android, MeeGo and Chrome OS in terms of LBS Location based Services, Multi-party Cloud based Gaming, Hybrid Cloud Servcies and M2M communication.</p>\n\n<p>Until most recently, he has led and defined Worldwide, multi-site (including Europe, US and India) RF R&amp;D activities for ST’s Cellular Digital Radio Project’s Front End Solutions with Digital PA, Tunable Front-End and Adaptive Receiver at UCSD CWC and other centers. Undertaking some Course Instructor-ship for UCSD Extension on Body Area Wireless Medical Device Technologies.\nHe grew up in West London England and studied for a Bachelors &amp; Masters Degrees in Engineering from Leeds and University College London Universities respectively, leading to early career experiences &amp; contributions in device modeling, circuit design and subsystem developments where he led World wide engineering teams in Two World Class Firsts – First Commercial Active Antenna for Space for ESA and First Active Antenna for Battlefield Radar using MMIC/RFIC. Some new Firsts are still being implemented in Connected devices and Hybrid Cloud Services. He is married with two children settled and with working practices in San Diego and London.</p>\n\n<p>He enjoys cooking, Red Wines, Whiskey and Bhangra Dances and Music. He has travelled, lived and worked in over 20 countries worldwide on 4 continents.</p>","image":{"available_sizes":[[[87,150],"assets/images/resized/0010/6873/106873v2-max-150x150.jpg"],[[145,250],"assets/images/resized/0010/6873/106873v2-max-250x250.jpg"],[[262,450],"assets/images/resized/0010/6873/106873v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Master of Science","subject":"RF, Microwaves, Modern Optics","institution":"University College London","graduated_year":1990,"graduated_month":null,"graduated_day":null},{"degree_type":"Bachelor of Science with Honours","subject":"Electrical & Electronics Engineering","institution":"Univeristy of Leeds","graduated_year":1984,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Business & Technical Board Advisor","firm":{"name":"Namazu Studios","permalink":"namazu-studios","type_of_entity":"company","image":null}},{"is_past":true,"title":"Chief Strategy Officer","firm":{"name":"Invisitrack Inc","permalink":"invisitrack","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.recruitingblogs.com/profiles/blog/show?id=502551:BlogPost:49185","title":"Coffee with Upkar Dhaliwal"}],"web_presences":[{"external_url":"http://www.linkedin.com/in/upkar","title":"Linkedin in Upkar"},{"external_url":"http://www.mtt-archives.org/~mtt20/","title":"IEEE MTT-20 Wireless Communication Chair"},{"external_url":"http://www.sdieee.org/cgi-bin/WebObjects/ieee.woa/wa/sectioninfo","title":"IEEE Policy - Legislative Affairs"}]}