{"first_name":"V. A.","last_name":"Shiva","permalink":"v-a-shiva","crunchbase_url":"http://www.crunchbase.com/person/v-a-shiva","homepage_url":"http://www.vashiva.com","birthplace":"Bombay","twitter_username":"va_shiva","blog_url":"http://www.vashiva.com","blog_feed_url":"http://vashiva.com/vashiva-rss-feed.xml","affiliation_name":"Unaffiliated","born_year":1963,"born_month":12,"born_day":2,"tag_list":"inventor-of-email, educator, scientist, cytosolve, fulbright-scholar, east-west-medicine, faculty-lecturer-mit","alias_list":null,"created_at":"Thu Sep 15 18:32:33 UTC 2011","updated_at":"Sat Mar 03 21:25:22 UTC 2012","overview":"<p>Dr. V. A. Shiva Ayyadurai, Ph.D., is a Lecturer in the Dept. of Biological Engineering and Visiting Lecturer in Comparative Media Studies (CMS) at M.I.T.  He holds four degrees from M.I.T. and is inventor of world’s first E-MAIL system for which he received the first U.S. Copyright on E-MAIL.</p>\n\n<p>V. A. Shiva is a scientist-technologist, entrepreneur, inventor and educator, is a Fulbright Scholar, Lemelson-MIT Awards Finalist, Westinghouse Science Talent Search award recipient and developer of multiple large-scale systems.</p>\n\n<p>In 1983, V. A. Shiva was selected by the Clinton White House as the winner of  solution that could automatically categorize emails utilizing his &#8216;Pattern Recognition&#8217; techniques.  He went on to start his own company in 1985 developing world&#8217;s first email management and email marketing platform called EchoMail, winning AT&amp;T was EchoMail&#8217;s first customer.  EchoMail platform became the solution of choice for many Fortune-1000 and small/medium businesses.</p>\n\n<p>In 2007, V. A. Shiva earned his doctorate in computational systems biology under the supervision of Prof. Forbes Dewey, Dept. of Biological Engineering in M.I.T.  As part of the doctoral thesis work, he architected Cytosolve, a scalable computational platform for dynamic integration of quantitative molecular pathways.  Cytosolve offers great potential in the study of causes of diseases such as cancer, heart disease, diabetes etc. as well as for drug development.</p>\n\n<p>In 2007, V. A. Shiva was awarded Fulbright scholarship to study Eastern system of medicines including Traditional Chinese Medicine (TCM), Ayurveda etc. for which he traveled across South East Asian countries.  Since his return to the US in 2010, he has been giving lectures on East-West Medicine.</p>\n\n<p>Most recently V. A. Shiva has been teaching a course in Systems Visualization in the Dept. of Biological Engineering in M.I.T.  He is also the founder of International Center for Integrative Systems, a non-profit organization based in Cambridge, Massachusetts.  The center aims to pioneer scientific research by integrating principles of traditional medicines &amp; modern systems biology while offering tangible programs in health, nutrition &amp; sustainability to the local community.</p>","image":{"available_sizes":[[[122,150],"assets/images/resized/0015/4378/154378v2-max-150x150.png"],[[153,188],"assets/images/resized/0015/4378/154378v2-max-250x250.png"],[[153,188],"assets/images/resized/0015/4378/154378v2-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"Bachelors of Science","subject":"Electrical Engineering & Computer Science","institution":"Massachusetts Institute of Technology","graduated_year":1987,"graduated_month":null,"graduated_day":null},{"degree_type":"Master of Science","subject":"Visual Studies","institution":"Media Lab, Massachusetts Institute of Technology","graduated_year":1989,"graduated_month":null,"graduated_day":null},{"degree_type":"Master of Science","subject":"Mechanical Engineering","institution":"Massachusetts Institute of Technology","graduated_year":1990,"graduated_month":null,"graduated_day":null},{"degree_type":"Doctorate","subject":"Systems Biology, Biological Engineering","institution":"Massachusetts Institute of Technology","graduated_year":2007,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}