{"first_name":"V.J.","last_name":"Jain","permalink":"v-j-jain","crunchbase_url":"http://www.crunchbase.com/person/v-j-jain","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Bonzobox","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Feb 09 20:33:38 UTC 2009","updated_at":"Mon Jun 08 22:45:25 UTC 2009","overview":"<p>V.J. Jain is an Oracle Database and Applications consultant with over 13 years of experience in database and ERP systems. He specializes in E-Business implementations, upgrades, interfaces, database performance, development and high-performance solutions. V.J. actively evaluates Oracle&#8217;s newest technologies and is a member of the Oracle Partner Network and Beta program. He has a book which can be viewed on Amazon and has published several articles on SearchOracle, OraFaq, OTN and is the owner of www.oracle-developer.com.</p>\n\n<p>V.J. Jain has spent the last 7 years working on Oracle Applications projects and has vast experience with many modules including Financials, Distribution, and Manufacturing. His functional specialty is the implementation and upgrade of the Finance modules and his technical specialty is the design and development of Oracle Applications interfaces. As a skilled DBA/developer with a strong functional and technical background in Oracle Applications, he has led many successful projects and has an impressive list of satisfied clients.</p>\n\n<p>V.J. received his B.S. in Information and Computer Science from the University of California Irvine and is a veteran of the U.S. Army National Guard who was in military intelligence and held a TS/SCI security clearance.  V.J. is the owner of Varun Jain, Inc a Southern California based, Oracle Applications consulting firm that focuses on customer advocacy. His company sponsors annual scholarships to promising students with a financial need and is an active member of the Irvine and South County chambers of commerce.  Varun Jain, Inc. is a Certified Small Business (California) and an A-rated member of the BBB. V.J. Jain has been awarded recognition as an upcoming executive in Madison Who&#8217;s Who 2007-2008 Edition.</p>\n\n<p>In 2008, V.J. Jain joined the highly exclusive, Southern California based consulting firm, Abaris, Inc. as the Senior Financials Consultant.</p>","image":null,"degrees":[{"degree_type":"B.S.","subject":"Information and Computer Science","institution":"University of California, Irvine","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"AAS","subject":"Intelligence Operations","institution":"Cochise College (U.S. Army Accreditation)","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.oracle-developer.com/about.html","title":"Profile"}],"web_presences":[{"external_url":"http://www.linkedin.com/profile?viewProfile=&key=10936244","title":"LinkedIn"}]}