{"first_name":"Vahid","last_name":"Manian","permalink":"vahid-manian","crunchbase_url":"http://www.crunchbase.com/person/vahid-manian","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"icanbuy","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Mar 01 23:22:58 UTC 2010","updated_at":"Tue Mar 16 07:02:25 UTC 2010","overview":"<p>Vahid Manian served as Senior Vice President of Global Manufacturing Operations at Broadcom Corp., from April 2005 to December 3, 2008. Mr. Manian was responsible for all manufacturing activities, including foundry operations and process technology direction. He has 25 years of experience and is considered by many the most accomplished Operations executive in the entire semiconductor industry. Mr. Manian joined Broadcom Corp. in January 1996 as its Director of Operations until December 1997 and then served as Vice President of Manufacturing Operations since December 1997. Mr. Manian served in a number of positions for approximately 12 years at Silicon Systems Inc., a semiconductor manufacturer, including over six years as Director of Operations, where he led the implementation, production ramp and qualification of advanced PRML-read channel integrated circuits. Mr. Manian serves as a Director of Fabless Semiconductor Association. He has been Member of Technical Advisory Board at Symwave, Inc. since January 2009. He served as an Independent Director of STEC, Inc. (formerly Simpletech Inc.), from February 2007 to December 31, 2008. He served as a Director of Volterra Semiconductor Corporation from November 14, 2007 to December 2008. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Director","firm":{"name":"icanbuy","permalink":"icanbuy","type_of_entity":"company","image":{"available_sizes":[[[150,39],"assets/images/resized/0008/0265/80265v1-max-150x150.png"],[[250,66],"assets/images/resized/0008/0265/80265v1-max-250x250.png"],[[446,118],"assets/images/resized/0008/0265/80265v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}