{"first_name":"Van","last_name":"E. Staggs Jr","permalink":"van-e-staggs-jr","crunchbase_url":"http://www.crunchbase.com/person/van-e-staggs-jr","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"DBL LLC","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Dec 30 04:01:31 UTC 2008","updated_at":"Wed Dec 31 19:07:34 UTC 2008","overview":"<p>Mr. Van E. Staggs Jr., is vice president of Public Relations for Delta Beta Lambda Fraternity, the first online video gaming fraternity that provides mentoring and full academic scholarships in the fields of video game design and technology to disadvantaged and deserving youths throughout the United States and abroad. At an early age growing up in Norwalk Connecticut, Mr. Staggs found the love for video gaming. He and his friends would meet every morning at the local arcade before classes, after school, and on weekends; not to mention playing at home on the Atari 2600. Twenty-five years later, he still has the same love for video gaming.</p>\n\n<p>Mr. Staggs is a cum laude graduate of Benedict College where he earned a Bachelor of Arts in Political Science. While at Benedict, Mr. Staggs was active in Benedict&#8217;s upward bound program whose activities were to all designed to provide holistic experiences to enhance academic, social, and cultural development while establishing and cultivating partnerships and relations within the community. Over the past 12 years, he has held various upper management positions in several corporations. He is very active within his community volunteering his time to various social service organizations. He has also been very successful in the field of Real Estate as an investor and Commercial Real Estate consultant. Prior to his current position, he was employed as a loan officer with SunTrust Bank and Blue Ridge Savings Bank respectfully. He is the loving husband of Michele and decided father of two girls Abriella 5 years, and Aavyn 1year.</p>","image":null,"degrees":[],"relationships":[{"is_past":true,"title":"Media Relations","firm":{"name":"DBL LLC","permalink":"dbl-llc","type_of_entity":"company","image":{"available_sizes":[[[150,66],"assets/images/resized/0003/2681/32681v2-max-150x150.png"],[[250,110],"assets/images/resized/0003/2681/32681v2-max-250x250.png"],[[450,199],"assets/images/resized/0003/2681/32681v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}