{"first_name":"Venetia","last_name":"Kontogouris","permalink":"venetia-kontogouris","crunchbase_url":"http://www.crunchbase.com/person/venetia-kontogouris","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Apr 04 19:52:45 UTC 2008","updated_at":"Thu Jun 04 11:12:16 UTC 2009","overview":"<p>Venetia Kontogouris has been associated with Trident Capital since 1995. She joined Trident Capital in 1999 as a Managing Director. Prior to Trident, Venetia was an executive from 1983 to 1995 of Dun &amp; Bradstreet Corporation and related entities including IMS Health Incorporated and Cognizant Corporation. She was also President of Enterprise Associates, LLC, the venture capital division of IMS Health Incorporated, where she represented Enterprise Associates in respect of its partnership interest in Information Associates and Information Associates-II (Trident’s Fund II and Fund III). Prior to that, Venetia was Senior Vice President, Venture Development, at Cognizant Corporation, where she represented Cognizant in the Information Partners Capital Fund formed by Dun &amp; Bradstreet and Bain Capital. Venetia has held executive positions in new product development and marketing at D&amp;B and sales management positions at AT&amp;T and IBM. She has also launched her own start-up telecommunications company.</p>\n\n<p>Venetia’s current directorships include Advantec, DepotPoint, Elucido, Infotrieve, Invention Machine Corporation, Lifesnapz, Microland, MingleBox, Neilsoft, Outsource Partners International, Odyssey Logistics &amp; Technologies and Teranode.</p>\n\n<p>Her past directorships include Avesta Technologies, Inc. (acquired by Visual Networks), Berkeley Enterprise Partners, Inc. (acquired by Extraprise, Inc.), C-7 Group, Inc., Cognizant Technology Solutions (CTSH), CrossMedia Services (acquired by a consortium of major national newspaper groups), Customer Analytics, Inc. (acquired by Exchange Applications), Dataware, eCredit.com, Inc. (acquired by Internet Capital Group), eData Resources, Inc. (acquired by The Daily Mail), Event Zero, Internet Profiles Corporation (acquired by CMGI), OneSource Information Services, Inc. (ONES), PBN (acquired by Vurv/Taleo), Jostens Learning Corporation, Sphere (acquired by AOL), T.R.A.D.E., Inc., Vality Technology, Inc. (acquired by Ascential Software (ASCL)), Viant Corporation (acquired by Divine), Vidavee (acquired by Vignette) and Wharton Econometric Forecasting Associates.</p>\n\n<p>Venetia earned her B.A. from Northeastern University and her M.B.A. from the University of Chicago Graduate School of Business. Venetia serves as a member of the Board of Overseers at Northeastern University.</p>","image":{"available_sizes":[[[80,94],"assets/images/resized/0004/6646/46646v1-max-150x150.jpg"],[[80,94],"assets/images/resized/0004/6646/46646v1-max-250x250.jpg"],[[80,94],"assets/images/resized/0004/6646/46646v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"B.A.","subject":"","institution":"Northeastern University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"M.B.A.","subject":"","institution":"University of Chicago Graduate School of Business","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Managing Director","firm":{"name":"Trident Capital","permalink":"trident-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[121,100],"assets/images/resized/0000/1891/1891v1-max-150x150.png"],[[121,100],"assets/images/resized/0000/1891/1891v1-max-250x250.png"],[[121,100],"assets/images/resized/0000/1891/1891v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}