{"first_name":"Vernon","last_name":"Lun","permalink":"vernon-lun","crunchbase_url":"http://www.crunchbase.com/person/vernon-lun","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue May 20 02:31:13 UTC 2008","updated_at":"Thu Nov 27 09:51:08 UTC 2008","overview":"<p>Vernon Lun&#8217;s interest lies in assisting companies in defining and executing their business vision using Internet and wireless technologies and infrastructure. His experience in both technology and business development areas puts him in a unique position of being able to define technology roadmaps as well as work closely with the executive team, investors and customers.</p>\n\n<p>In 1994, Vernon joined Delrina Inc. As Principal Software Engineer, he was instrumental in moving their flagship Winfax to a 32-bit platform. He then joined Lanacom, a pioneer in Push technology, as Principal Developer and founding member in 1996. After Lanacom was acquired by BackWeb Technologies, His primary role as Chief Architect was to develop next-generation enterprise push-technology products. In 1999, he joined Balisoft Technologies as VP of Engineering responsible for all development of their eService CRM suite. Following their merger with Servicesoft, Vernon was promoted to Chief Technology Officer and worked closely with the business development group on assignments covering North America, Asia and Europe. In 2001, he took on the role of Chief Technology Officer at CompanyDNA where he had overall responsibility for research and development, IT and product management. Since joining XDL Capital Group in 2003, , Vernon has been involved in evaluating new business and assisting companies within its portfolio. Most recently, Vernon co-founded TheGoodBlogs, a Web 2.0 community to promote, discover and connect bloggers.</p>\n\n<p>Vernon holds a B.Sc., M.Sc. and Ph.D. from the University of the Witwatersrand, South Africa. In his Ph.D. thesis, he formulated a framework for distributed real-time intelligence. Early in his career, in the 1980s, he was involved in the design and management of large industrial and automation projects. Subsequently, he was been engaged as a consultant in areas including expert systems, computer-aided design systems, computer control of batch and continuous processes, software development, distributed computing and retail banking. He has also conducted postgraduate and industrial courses on expert systems and neural networks. </p>","image":{"available_sizes":[[[150,115],"assets/images/resized/0002/9780/29780v1-max-150x150.jpg"],[[216,166],"assets/images/resized/0002/9780/29780v1-max-250x250.jpg"],[[216,166],"assets/images/resized/0002/9780/29780v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}