{"first_name":"Vertex","last_name":"Websolutions","permalink":"vertex-websolutions","crunchbase_url":"http://www.crunchbase.com/person/vertex-websolutions","homepage_url":"http://www.vertex.net.pk/","birthplace":"Karachi","twitter_username":"vertexweb","blog_url":"http://blog.vertex.net.pk/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1990,"born_month":1,"born_day":15,"tag_list":"web-designing-company, web-hosting-company, website-designing","alias_list":null,"created_at":"Mon Dec 27 13:15:22 UTC 2010","updated_at":"Thu Dec 30 17:56:20 UTC 2010","overview":"<p>Vertex Web Solutions are a web designing company located in Karachi, Pakistan; established and in operation since 2000. We are serving local and global clients with our high quality services. We offer website designing, web application development, multimedia designing, e-commerce solutions, search engine optimization, web hosting, domain name registration, logo designing, digital Imaging and more. You can view our work by clicking on the portfolio.</p>\n\n<p>We believe in listening to our customers, building long-term relationships and providing continuous customer care.</p>\n\n<p>We have seen a lot of web design companies come and go over the years. Because we possess extensive experience with an array of tools and programs, and we understand the importance of project management, and we treat each client and project with great care and attention, Vertex has established itself as a truly innovative force. For all of these reasons, Vertex has become the design firm of choice for small businesses and large corporations alike. Vertex today stands as one of the most competent and experienced web organization in Pakistan, delivering service quality that matches with the best in the world.</p>\n\n<p>Vertex combines strategy, design, and technology into successful business initiatives. Since its inception, in 2000, vertex has earned and cultivated an admirable and respected reputation.\nOur knowledge and experience with the new media assures that you will receive state of the art solutions with professional services. From designing a site to marketing it efficiently, Vertex team of knowledgeable professionals understand what needs to be done and are willing to go the extra mile to make it happen.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0011/5505/115505v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0011/5505/115505v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0011/5505/115505v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.vertex.net.pk","title":"Web Designing Company"},{"external_url":"http://www.vertexwebspace.com","title":"Web Hosting Company"},{"external_url":"http://www.vertexemarketing.com","title":"Web Promotion Company"}],"web_presences":[{"external_url":"http://twitter.com/vertexweb","title":"Twitter"}]}