{"first_name":"Vicky","last_name":"Trend","permalink":"vicky-trend","crunchbase_url":"http://www.crunchbase.com/person/vicky-trend","homepage_url":"http://www.goiit.com/","birthplace":"Kanpur","twitter_username":"","blog_url":"http://www.goiit.com/forums/showByForumName/community_shelf.htm","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1981,"born_month":4,"born_day":4,"tag_list":"goiit-com, jee-preparation-plateform, take-iit-aieee-mock-tests","alias_list":null,"created_at":"Mon Dec 05 12:55:11 UTC 2011","updated_at":"Thu Dec 08 17:59:50 UTC 2011","overview":"<p>GoIIT.com, a premier online educational portal, has recently revamped to cater quality education to the aspirants preparing for top engineering entrance exams such as IIT JEE  2012  AIEEE, WBJEE , KCET, BITSAT etc. The portal is the one-stop destination to access superb engineering study materials, course chapters, ask &amp; discuss doubts from an elite panel of experts comprising of IIT alumni, top coaching professionals, engineering graduates etc. Free online tests, sample practice papers &amp; more. This online educational portal helps engineering aspirants to win laurels in entrance exam by raising their confidence level and by fostering quality education. </p>\n\n<p>goIIT.com&#8217;s intention to provides IIT/AIEEE engineering study material, entrance preparation tips, admission notifications,sample test papers, model papers, previous years test papers, mock tests subject-wise for reputed exams BITS, MHT CET, WBJEE, syllabus, pattern, experts advice, online coaching &amp; solve JEE entrance queries at our education forum.</p>\n\n<p>Founded in 2006, GoIIT.com, a pioneer online education platform in education industry, comprises of IIT alumni, top coaching institutes and engineering graduates. The aim of this initiative is to provide a huge advantage to engineering aspirants by offering a distinctive platform for them. This online platform has given an outstanding contribution to gauge their performance.</p>","image":{"available_sizes":[[[105,71],"assets/images/resized/0016/5179/165179v2-max-150x150.png"],[[105,71],"assets/images/resized/0016/5179/165179v2-max-250x250.png"],[[105,71],"assets/images/resized/0016/5179/165179v2-max-450x450.png"]],"attribution":"<p>GOIIT- An Engineering Entrance Preparation &amp; Online Tests Assessment Center</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}