{"first_name":"Vicky","last_name":"J. Sharpe","permalink":"vicky-j-sharpe","crunchbase_url":"http://www.crunchbase.com/person/vicky-j-sharpe","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jul 27 20:46:32 UTC 2010","updated_at":"Tue Jul 27 20:48:18 UTC 2010","overview":"<p>Vicky Sharpe is President and CEO of Sustainable Development Technology Canada, a Government of Canada initiative whose mission is to help develop and commercialize clean technologies that will strengthen economic and environmental performance in Canada. </p>\n\n<p>Clean technologies contribute to the economy by increasing the productivity and competitiveness of industry while simultaneously reducing environmental impact. Recognizing this, SDTC is committed to supporting technologies that contribute to clean air, climate change, clean water and clean land.  As founding CEO, Dr. Sharpe has increased the investment pool from $100M to over $1B and mobilized private sector capital resulting in $1.5B of cleantech projects currently under SDTC management.</p>\n\n<p>With over 25 years of experience in the energy industry, Dr. Sharpe has successfully integrated sustainable development into business practices. As President of GRI Canada and Astral Group, she demonstrated leadership and vision in the use of innovative technologies across Canada’s primary economic sectors. As Vice President of Ontario Hydro International Inc., Dr. Sharpe created new global revenue streams for environmental and energy utilization practices.  Prior to that, she held management positions in marketing, business development and technology innovation.</p>\n\n<p>Dr. Sharpe has served on numerous technology and industry association committees, in particular as an international advisor on sustainability issues; has represented the Canadian energy sector at the Asia-Pacific Economic Cooperation (APEC) Business Forum; and has chaired both the National Advisory Board on Energy, Science and Technology, and the Board of Directors of Clean Air Canada Inc. Her efforts were recognized with the National Energy Conservation Association’s inaugural Energy Efficiency Award for outstanding contributions to the energy industry.</p>\n\n<p>Dr. Sharpe is a founding member of the Board of Directors of the Alberta Enterprise Corporation, whose mandate is to finance and build new knowledge-based industries.  As part of her leadership in building a cleantech infrastructure, Dr. Sharpe is a founding member of the Steering Committee of the UNEP SEF Alliance, an international coalition of public and publicly-backed clean energy funding organizations, operating under the remit of the UN’s Sustainable Energy Finance Initiative.  Dr. Sharpe is helping to shape the Canadian cleantech landscape through the provision of strategic advice including her role on the Ontario Premier’s Climate Change Advisory Panel. She is also a Director for the International Institute for Sustainable Development (IISD).</p>\n\n<p>As a widely recognized expert and advocate for sustainable development and technology innovation, she has addressed both national and international audiences to promote an understanding of the culture shift in values society must make to secure a sustainable future.</p>\n\n<p>Dr. Sharpe holds a B.Sc. Honours in Applied Biology from Bath University, UK, and a Ph.D. in Microbiology and Chemistry, as applied to water pollution control, from Trent University, UK.</p>","image":{"available_sizes":[[[90,90],"assets/images/resized/0009/5141/95141v1-max-150x150.jpg"],[[90,90],"assets/images/resized/0009/5141/95141v1-max-250x250.jpg"],[[90,90],"assets/images/resized/0009/5141/95141v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President & CEO","firm":{"name":"Sustainable Development Technology","permalink":"sustainable-development-technology","type_of_entity":"financial_org","image":{"available_sizes":[[[150,83],"assets/images/resized/0005/2982/52982v1-max-150x150.jpg"],[[172,96],"assets/images/resized/0005/2982/52982v1-max-250x250.jpg"],[[172,96],"assets/images/resized/0005/2982/52982v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}