{"first_name":"Victor","last_name":"Warren","permalink":"victor-warren","crunchbase_url":"http://www.crunchbase.com/person/victor-warren","homepage_url":"http://www.Glydascope.com","birthplace":"Hollywood CA","twitter_username":"Glydascope","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1965,"born_month":2,"born_day":11,"tag_list":"award-winner, actor, writer, director, producer","alias_list":null,"created_at":"Fri Aug 03 21:21:55 UTC 2012","updated_at":"Mon Aug 06 20:06:32 UTC 2012","overview":"<p>Victor Warren is the CEO for a recently created film production company called Glydascope.  Victor, a native Californian, has been acting since the age of ten. He is a graduate of Carnegie-Mellon University where he majored in Acting and Directing. After graduation, Victor worked in California for over fifteen years for Universal Studios as a director, camera operator, technical director, announcer and stunt show performer. In 1993, Victor moved to the east coast where he owned a very successful retail business. He also worked successfully as a director and actor in Boston and New York doing commercials, print work, voice-overs, regional theatre, films and television for 14 years. He won Best Independent short film at the CANADIAN INTERNATIONAL FILM FESTIVAL. He was awarded First Prize at both the MASSACHUSETS FILM OFFICE SCREEN WRITING COMPETITION and RHODE ISLAND INTERNATIONAL FILM FESTIVAL. As a director, THE REGISTER voted Victor Warren’s production of Woyzeck one of the BEST plays of 2002. He directed a successful run of A MIDSUMMER NIGHT’S DREAM for Shakespeare by the Shore. He has been involved in eight different productions of THE COMPLETE WORKS OF WILLIAM SHAKSPEARE ABRIDGED. He acted and directed in a wildly popular run which was voted “CRITIC’S CHOICE FOR 2003”. Other directing projects include WALT WHITMAN SPEAKS for the Matrix Theatre in Los Angeles and the world premiere of BETTERLAND for the Theatre Studio in New York. He recently received both LA DRAMA CRITIQUES AWARD and LA WEEKLY AWARD for his work on the production of STRANGER for the Bootleg Theatre. He has directed over 50 projects and acted in over 70 roles. He moved back to LA in 2008 to create greater opportunities to self generate projects. In 2010, he Stunt Coordinated WHO KILLED CHANDRA LEVY for TLC while he was the artistic director at the NoHo Arts Center. With the creation of Glydascope, he will apply his 30 years of experience and proven expertise to realize his vision of offering specialty projects to targeted audiences.</p>","image":null,"degrees":[{"degree_type":"BFA","subject":"Acting/Directing","institution":"Carnegie Mellon University","graduated_year":1981,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[{"embed_code":"http://glydascope.com/whyglydascope.html","description":"<p>Why Glydascope</p>"},{"embed_code":"http://glydascope.com/project.html","description":"<p>Current Projects</p>"}],"external_links":[{"external_url":"http://www.youtube.com/user/glydascope?feature=results_main","title":"YouTube channel"}],"web_presences":[{"external_url":"http://www.Glydascope.com","title":"Company Web Site"}]}