{"first_name":"Victor","last_name":"Jalencas","permalink":"victor-jalencas","crunchbase_url":"http://www.crunchbase.com/person/victor-jalencas","homepage_url":"http://carotena.net/","birthplace":"Vinaros","twitter_username":null,"blog_url":"http://principia.info/","blog_feed_url":"http://feeds.feedburner.com/syntactic","affiliation_name":"Unaffiliated","born_year":1975,"born_month":9,"born_day":15,"tag_list":"developer, problem-solver, early-adopter","alias_list":"","created_at":"Tue Apr 28 12:52:29 UTC 2009","updated_at":"Thu Dec 17 17:51:42 UTC 2009","overview":"<p>Victor Jalencas is a software developer whose specialty is building web applications, though he has a wide range of interests and likes to develop anything as long as is innovative.</p>\n\n<p>Victor&#8217;s career in computing began working as a tech support jockey at ServicioHelpDesk.com, a helpdesk company that other firms outsourced to. He fielded sysadmin and network support requests.</p>\n\n<p>He spent almost a year there before jumping to Planeta Actimedia, one company from Grupo Planeta (the largest publisher in Spanish language). He was the first developer hired for the electronic book initiative the Group had just started, which comprised both transformation and distribution. He also took charge of the web hosting platform of the Group &#8211; becoming effectively the first webmaster as such of the Group &#8211;.</p>\n\n<p>Even before the e-book store was deadpooled (only a year after the launch), Victor had already become a member of the web development team. He was unsuccessful getting buy-in from the management team to fully embrace open standards and table-less design, mostly because of re-training costs and the effort associated. Victor realized that he would not get too far in the megalithic corporate world, so he decided to abandon web development for a while and try other waters.</p>\n\n<p>He ended up joining Pivetal Ltd., a company from Southampton, UK, that specializes in Expert Systems for the Telco giants. Their software helps reducing the number of trivial human decisions that have to be taken care daily, freeing talent to work on the actually difficult problems.</p>\n\n<p>While working on AI was certainly stimulating, Victor missed the quick pace at which the web industry moves, so he joined Polymita Technologies, where he actually works, an award winning startup from Barcelona, whose integrated BPM-ECM (Business Process Management - Enterprise Content Management) product helps companies to save money by speeding lengthy bureaucratic workflows. At first, he was a Solutions Engineer (surprisingly enough, not an R&amp;D one), but it was soon discovered that his knack for troubleshooting would be better put to use in the support department, so although a less creative position, he was happy to help the customers have a positive opinion of the company products.</p>\n\n<p>Not happy to be just another developer, Victor has always strived to keep abreast of the latest development tools and methodologies, as well as a declared open standards advocate. Though a bit of a linux zealot at first, he is now comfortable in any operating system and working with any development framework, since after all, most of them are general-purpose enough for most kinds of work (though he prefers the Mac ecosystem). This wide array of tools at his disposal, and his open outlook to changes, makes of him a welcome input both on high-level design meetings, and low-level troubleshooting sessions as well.</p>\n\n<p>To that end, Victor is always self-teaching himself new techniques and tools, and finds rather surprising that his co-workers don&#8217;t do the same, as it is widely accepted that in the Internet industry, one must adopt continuous education.</p>\n\n<p>While Victor has a head full of ideas, the lack of time and his lack of interest for the inner workings of accounting have prevented him from being an entrepreneur, being happy instead just tinkering with ideas and short-lived projects. But he is bidding his time&#8230;</p>","image":{"available_sizes":[[[98,150],"assets/images/resized/0004/3129/43129v2-max-150x150.png"],[[163,250],"assets/images/resized/0004/3129/43129v2-max-250x250.png"],[[295,450],"assets/images/resized/0004/3129/43129v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/jalencas","title":"@jalencas"}]}