{"first_name":"Victor","last_name":"Scelba","permalink":"victor-scelba","crunchbase_url":"http://www.crunchbase.com/person/victor-scelba","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sun May 09 22:24:08 UTC 2010","updated_at":"Mon May 10 15:59:39 UTC 2010","overview":"<p>Job Description:\nMaintenance of vendor relations for corporate nationwide product offerings for both voice and data services. \nManagement of Leased Cost Routing Tools, creation and analysis of monthly COGS reporting to identify trending and cost savings initiatives. \nTracking of ICB requests from Sales to ensure target rates and response time intervals are met. \nCoordinate and document Vendor meetings \nEstablish processes in an effort to streamline vendor management functions, trouble reporting procedures, and the collection of current data from vendors including Contact and Escalation lists.\nCreation and maintenance of contract database</p>\n\n<p>Company Description\nBroadview Networks is a network-based business communications provider serving customers nationwide. Broadview provides the total solution for business communications including local and long distance voice communications; premises-based and patented hosted VoIP systems; data services encompassing VPN- and MPLS-enabled applications; traditional telephone hardware; high-speed Internet services; a full suite of managed services; and a range of professional services. Broadview customers benefit from award-winning customer service including a web-based account management tool and a primary point-of-contact for real-time, personal customer care.</p>","image":null,"degrees":[{"degree_type":"MBA","subject":"Business Administration","institution":"Wilkes Univeristy","graduated_year":2003,"graduated_month":null,"graduated_day":null},{"degree_type":"Bachelor of Science ","subject":"Network Communication Management","institution":"DeVry University","graduated_year":2009,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}