{"first_name":"Vijay","last_name":"C Bose","permalink":"vijay-c-bose","crunchbase_url":"http://www.crunchbase.com/person/vijay-c-bose","homepage_url":"http://www.hipresurfacingindia.com","birthplace":"","twitter_username":"hipresurface","blog_url":"http://hipresurfacingindia.blogspot.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"vijay-c-bose, hip-resurfacing, hip-surgery","alias_list":null,"created_at":"Wed Aug 05 23:25:06 UTC 2009","updated_at":"Thu Mar 04 18:52:02 UTC 2010","overview":"<p>Dr. Vijay C. Bose, Hip Resurfacing Surgeon from India. </p>\n\n<p>Dr. Vijay C. Bose graduated from Madras Medical College in 1990, having secured the  Lt. Col. Thayumunusamy Gold Medal in orthopaedics from the college during the final year. After completion of postgraduate studies (M.S Orthopaedics) from the university of Mangalore and D.NB (Orth) from the national board of examination, he gained practical experience in orthopaedics by working in various private institutions in India. He worked as Registrar in Apollo Hospital, Chennai and in Ganga Hospital, Coimbatore.  In 1995, he commenced subspecialty training in hip surgery at Birmingham United Kingdom(UK) where he worked closely with Dr.Derek McMinn and Dr.Ronan Treacy the inventors of the Metal on Metal Hip Resurfacing prosthesis for young people with Hip Arthritis. During his training in Birmingham he completed the M.Med.Sci trauma course from the University of Birmingham.</p>\n\n<pre><code>Later he did advanced training atLiverpool in Shoulder Surgery with Prof. Simon Frostick and Dr.Peter Brownson.During his stay there, he secured the MCh (Orth) qualification from theUniversity of Liverpool and the FRCS (Orth) qualification from the JointUniversity Examination board of the United Kingdom(UK).   He successfullybrought the new orthopaedic innovation of  Hip Resurfacing Surgery to southAsia for the first time in may 2000. He has also brought expertise in thenascent field of Arthroscopic Shoulder Surgery to south India.\n\nDr. Vijay C. Bose presently works as consultant hip and shoulder surgeon at Apollo speciality Hospital in Chennai and provides a referral-based service for complex joint problems. He has delivered numerous guest lectures and performed live surgical demonstrations in hip and Shoulder Surgery all over India. He is part of the Asia Pacific Hip Resurfacing lead group and travels frequently to the Asia pacific countries to help local surgeons in Hip Resurfacing.\n\nDr. Vijay C Bose conducted the first Asia-pacific conference on Birmingham Metal on Metal Hip Resurfacing in March 2003 at Apollo speciality Hospital. In addition, he frequently conducts many Hip and Shoulder CME programmes at Chennai. Recently he has introduced the Bone Conserving Shoulder Resurfacing Procedure again for the First Time in India at Apollo Speciality Hospital, Chennai.\n</code></pre>","image":{"available_sizes":[[[122,107],"assets/images/resized/0005/5459/55459v2-max-150x150.png"],[[122,107],"assets/images/resized/0005/5459/55459v2-max-250x250.png"],[[122,107],"assets/images/resized/0005/5459/55459v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.hipkneeshoulderindia.com/","title":"Launched new site for Hip Knee Shoulder Site"}],"web_presences":[]}