{"first_name":"Viki","last_name":"Forrest","permalink":"viki-forrest-2","crunchbase_url":"http://www.crunchbase.com/person/viki-forrest-2","homepage_url":"http://www.anzatechnet.com/","birthplace":"","twitter_username":"anzatechnet","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"anza-technology-network, business-accelerator, new-market-entry, globalization, network","alias_list":null,"created_at":"Thu Feb 09 23:25:42 UTC 2012","updated_at":"Sat Feb 11 02:34:55 UTC 2012","overview":"<p>Viki Forrest is the CEO of ANZA Technology Network, a global business accelerator headquartered in San Francisco, CA.</p>\n\n<p>Viki brings 20 years&#8217; experience in the tech industry from both corporate and startup perspectives. She began her career as a programmer in Sydney, Australia and held a variety of senior executive sales and marketing roles in Australia, Asia and the United States before becoming the CEO of ANZA Technology Network in 2006.</p>\n\n<p>ANZA was originally started to help Australian and New Zealand tech companies enter the US market through Silicon Valley. Under Viki&#8217;s leadership, the organization has grown to more than 5,000 network members primarily in the US and China who will assist companies from any location access and accelerate in these markets. </p>\n\n<p>Viki specializes in evaluating early-stage companies and helping them identify what they need to grow globally. This includes matching them with an appropriate mentor from the ANZA network or providing market research and business matching in addition to business acceleration services. Viki has personally worked with more than 200 companies at various stages of new market exploration, entry and acceleration. </p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0017/3695/173695v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0017/3695/173695v2-max-250x250.jpg"],[[450,300],"assets/images/resized/0017/3695/173695v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/vikiforrest","title":"LinkedIn"}]}