{"first_name":"Vikram","last_name":"Marathe","permalink":"vikram-marathe","crunchbase_url":"http://www.crunchbase.com/person/vikram-marathe","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Oulixeus Ltd","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Sat Oct 23 09:54:09 UTC 2010","updated_at":"Fri Oct 29 17:28:05 UTC 2010","overview":"<p>Vikram Marathe has held progressive leadership positions in information technology departments across various industry verticals such as health-care, telecommunications, media, internet technologies and social media.  The main theme of his career has been managing large amounts of data and making it available to business entities. Vikram, through his calm and balanced demeanor brings order to chaotic projects and situations; empowers his teams to achieve their potential and enables them to deliver solutions that solve real world business problems.  Vikram is currently working with the managing partners at Oulixeus Ltd. to shape the strategy and model for engagements and is working particularly on the data management practice.</p>\n\n<p>Previously, Vikram was brought in at INgage Networks as a Senior Director of Information Technology to lead the first Data Warehouse implementation of its kind in the Enterprise Social Networking space. After joining INgage, Vikram was given additional responsibilities of managing the newly created Shared Services group. This group comprised of the Business Intelligence, Quality Assurance, Database Administration and Technology Vendor management groups. Vikram was instrumental in selecting a vendor who could assist the company in various areas. This allowed INgage to create a flexible workforce and have a ‘follow the sun’ model, which turned out to be a huge win with INgage’s largest customer.  Vikram also shaped the Quality Assurance team into a professionally managed team that allowed it to be a partner in the development process. Later, Vikram was also given the responsibility to manage the product development and architecture team. Here, he brought in the discipline to have standards, best practices and a review process that would improve the quality of the products.</p>\n\n<p>During his career, while working with offshore vendors, Vikram was intrigued by the rise of the Outsourced delivery model. While working at AOL, Vikram learnt that there were a lot of practices and processes that the outsourcing companies followed that were very important in managing globally dispersed development teams. He also found areas that needed improvement and certain cultural differences that were holding back the optimal utilization of this model. In order to learn more and to contribute on solutions to things that did not work, Vikram took on a couple of challenging opportunities in India. First he worked at AOL’s development center in Bangalore where he managed the technology team and worked as a consultant and a partner to the AOL Business group in charge of launching AOL business (www.aol.in) in India. He also worked with the executive management (CTO, CIO) at AOL UK and AOL Europe to help them insource work to the Bangalore Development Center. Later, when an opportunity to lead a brand new development center for Kosmix Corp. (Mountain View, CA) came along, Vikram took on that challenge. These experiences helped Vikram understand global delivery models on both sides of the ocean.</p>\n\n<p>Prior to this, Vikram led the Enterprise Data Warehouse (EDW) implementation at AOL. This was a multimillion dollar, multi year project with globally dispersed teams made up of AOL and vendor resources. Vikram managed the technical development and program management of the EDW as well as vendor selection and vendor management for Business Technologies group at AOL. During this time he worked on creating an architecture group that helped in successful implementation of the EDW using resources that were spread out. There were a lot of lessons learned along the way on how to make dispersed teams productive and work towards the same end goal. The EDW was implemented using new technologies such as Ab Initio and Netezza. Vikram taught classes in Dulles VA; Dublin, Ireland and Kolkata, India on how to write optimal ETL programs using Ab Initio. As a program manager his duties involved reporting the program status to the AOL Business Information Officers and AOL CIO. </p>\n\n<p>Earlier he worked at MCI in various roles across the technology departments. Initially, he managed a team of DBAs, SAs and developers with the Business Information and Reporting systems group. Later, he took on the responsibility as a development lead at MCI’s Local Billing Profile group, which managed the master data for the local business. Following this role he moved to the group that managed all databases and servers for the Local technologies at MCI. </p>\n\n<p>Vikram started his career at Georgetown University Hospital’s Information Systems group as a DBA and application developer. He was part of the team that developed one of the first bedside order entry and Electronic Medical Records (EMR) systems. Vikram developed the Clinical and Financial Database (CFD), a repository of all lab, radiology and financial data. The technology implemented here being one of the first of its kind had various patents.</p>\n\n<p>Vikram was offered the above position while still a student, working on applying Operations Research to solving Query Optimization problems for Database management systems. Vikram obtained a Master of Science degree in Operations Research from Virginia Tech under the able guidance of Dr. Sherali, one of the most distinguished and accomplished Operations Research practitioner of our times. He also holds Bachelors in Mechanical Engineering from the Indian Institute of Technology (IIT) Bombay (Mumbai, India).</p>","image":null,"degrees":[{"degree_type":"Master of Science","subject":"Operations Research","institution":"Virginia Tech","graduated_year":1992,"graduated_month":null,"graduated_day":null},{"degree_type":"Bachelor of Technology","subject":"Mechanical Engineering","institution":"Indian Institute of Technology (IIT), Bombay","graduated_year":1988,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Principal","firm":{"name":"Oulixeus Ltd","permalink":"oulixeus-ltd","type_of_entity":"company","image":{"available_sizes":[[[150,35],"assets/images/resized/0006/1022/61022v2-max-150x150.png"],[[250,59],"assets/images/resized/0006/1022/61022v2-max-250x250.png"],[[389,93],"assets/images/resized/0006/1022/61022v2-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Sr. Director","firm":{"name":"INgage Networks","permalink":"ingage-networks","type_of_entity":"company","image":{"available_sizes":[[[150,100],"assets/images/resized/0000/4189/4189v10-max-150x150.jpg"],[[250,167],"assets/images/resized/0000/4189/4189v10-max-250x250.jpg"],[[250,167],"assets/images/resized/0000/4189/4189v10-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"Program Director","firm":{"name":"AOL","permalink":"aol","type_of_entity":"company","image":{"available_sizes":[[[150,84],"assets/images/resized/0000/4003/4003v5-max-150x150.png"],[[174,98],"assets/images/resized/0000/4003/4003v5-max-250x250.png"],[[174,98],"assets/images/resized/0000/4003/4003v5-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Country Head","firm":{"name":"Kosmix","permalink":"kosmix","type_of_entity":"company","image":{"available_sizes":[[[150,42],"assets/images/resized/0004/0291/40291v1-max-150x150.png"],[[192,54],"assets/images/resized/0004/0291/40291v1-max-250x250.png"],[[192,54],"assets/images/resized/0004/0291/40291v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}