{"first_name":"Viktor","last_name":"Vekselberg","permalink":"viktor-vekselberg-2","crunchbase_url":"http://www.crunchbase.com/person/viktor-vekselberg-2","homepage_url":"http://www.sk.ru/en/","birthplace":"Drohobych, Ukraine","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1957,"born_month":null,"born_day":null,"tag_list":"skolkovo-foundation","alias_list":null,"created_at":"Thu Apr 05 17:06:48 UTC 2012","updated_at":"Wed Apr 11 21:04:57 UTC 2012","overview":"<p>Viktor Vekselberg is President of the Skolkovo Foundation, appointed in March 2010 by Dmitry Medvedev, President of the Russian Federation.   </p>\n\n<p>A leading industrialist, Mr Vekselberg has given up a number of senior corporate positions in order to devote his full attention to the Skolkovo project which he considers key to Russia’s modernisation process.</p>\n\n<p>Viktor Vekselberg remains however a member of the Management Bureau of the Russian Union of Industrialists and Entrepreneurs and is Chairman of the Committee for International Cooperation of the Russian Union of Industrialists and Entrepreneurs. He has also retained his activities as a member of the Board of Directors of TNK-BP, Chairman of the Renova Group which he founded in 1990 and is also currently Chairman of the Board of Directors of UC Rusal.  </p>\n\n<p>Earlier in his career, Mr Vekselberg founded Renova, the asset management company (initially a Russian-American joint venture); co-founded the SUAL Group and acted as Chairman of Tyumen Oil (TNK) until 2003. </p>\n\n<p>Born in 1957 in the city of Drohobych, Lvov Region, Ukraine, Mr Vekselberg graduated with honours from the Moscow Transportation Engineering Institute and did post-graduate studies at the computing centre of the Russian Academy of Sciences. </p>","image":{"available_sizes":[[[1,1],"assets/images/resized/0018/2850/182850v2-max-150x150.png"],[[1,1],"assets/images/resized/0018/2850/182850v2-max-250x250.png"],[[1,1],"assets/images/resized/0018/2850/182850v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}