{"first_name":"Vincent","last_name":"Tchenguiz","permalink":"vincent-tchenguiz","crunchbase_url":"http://www.crunchbase.com/person/vincent-tchenguiz","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Nov 13 10:16:06 UTC 2008","updated_at":"Wed Jun 17 12:45:55 UTC 2009","overview":"<p>Vincent Tchenguiz has a strong track record of innovation and, based on his experiences in radically changing the ways in which UK commercial and residential property is financed, he has applied his knowledge to develop a diversified portfolio of business interests.</p>\n\n<p>Vincent is an entrepreneur with insight, vision and inspiration and, consequently, the Group maintains a vigorous, entrepreneurial culture throughout.</p>\n\n<p>After completing his schooling in Tehran in 1973, Vincent attended Business Administration course at Boston University before obtaining a BSc Honours in Economics and a BSc in Commerce at McGill University, Montreal, in 1978. Vincent also has a Masters Degree in Business Administration (MBA) from New York University, which he completed in 1980.</p>\n\n<p>Prior to establishing Rotch Property and Consensus, Vincent worked for Prudential Bache, in London as Senior Vice President within their fund management division, trading financial instruments. In 1986 Vincent joined Shearson Lehman Brothers, London also as Senior Vice President in a similar role, trading financial instruments. In 1988 Vincent and his brother Robert set up Rotch Property Group, now a £4bn commercial property business where he is joint chairman and joint managing director. In 2001 Vincent established Consensus Business Group to focus on his business interests outside commercial property. </p>","image":{"available_sizes":[[[131,150],"assets/images/resized/0004/9102/49102v1-max-150x150.jpg"],[[150,171],"assets/images/resized/0004/9102/49102v1-max-250x250.jpg"],[[150,171],"assets/images/resized/0004/9102/49102v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"","firm":{"name":"Masdar Clean Tech Fund","permalink":"masdar-clean-tech-fund","type_of_entity":"financial_org","image":{"available_sizes":[[[150,41],"assets/images/resized/0002/8525/28525v1-max-150x150.png"],[[250,69],"assets/images/resized/0002/8525/28525v1-max-250x250.png"],[[308,86],"assets/images/resized/0002/8525/28525v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}