{"first_name":"Vincent","last_name":"Ducrey","permalink":"vincent-ducrey","crunchbase_url":"http://www.crunchbase.com/person/vincent-ducrey","homepage_url":"http://www.guide-influence.com/the-guide-of-influence/","birthplace":"Paris","twitter_username":"vincent_ducrey","blog_url":"http://www.hub-management.org/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1977,"born_month":null,"born_day":null,"tag_list":"vincent-ducrey-guide-influence-france-paris","alias_list":"","created_at":"Sun May 02 18:04:48 UTC 2010","updated_at":"Sun Jul 15 11:24:22 UTC 2012","overview":"<p>Vincent Ducrey is an expert in information management, specializing in the study of real time information spread. Vincent expertise stems from his ten year career in all areas of marketing and communications: entrepreneurship, strategy consultanting, manager communities, and finally new media adviser at the French Government.\nThroughout his career, Vincent has collected a large number of observations and insights into the mechanisms of influence and new information channels, that he formulated into a method he calls The Hub management. Hub theorizes all its research on global influence, including all types of media. It also models the power of relationships and their impact on the ability to respond in the media sphere. From this simple and unique formula, Vincent identified actions, tools, and profiles to optimize real time communication.</p>\n\n<p>Vincent spent several months enriching the approach by experience and by the exchange of ideas with third parties. By experiencing the system and practicing it everyday in both the private and the public sphere, he has adapted it to the largest number of industries and situations. By exchanging ideas with other parties, he has adjusted, refined, and validated the approach.</p>\n\n<p>This book is the result of this methodology that Vincent wishes to share. The Guide of influence is the first book on real time information management. In addition to being an author, Vincent is a regular speaker at conventions and international symposiums in Europe, Africa and the United States.</p>","image":{"available_sizes":[[[104,150],"assets/images/resized/0009/3917/93917v4-max-150x150.jpg"],[[173,250],"assets/images/resized/0009/3917/93917v4-max-250x250.jpg"],[[313,450],"assets/images/resized/0009/3917/93917v4-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/vincent_ducrey","title":"Twitter Vincent DUCREY"},{"external_url":"http://www.facebook.com/vincent.ducrey","title":"Facebook Vincent DUCREY"},{"external_url":"http://www.linkedin.com/profile?9215606","title":"LinkedIn Vincent DUCREY"}]}