{"first_name":"Vincent","last_name":"Chun","permalink":"vincent-chun","crunchbase_url":"http://www.crunchbase.com/person/vincent-chun","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Allied Minds","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Oct 25 05:22:01 UTC 2011","updated_at":"Fri Oct 28 07:35:57 UTC 2011","overview":"<p>Vincent Chun is a Vice President at Allied Minds, Inc. Previously, Dr. Chun was senior manager in finance and operations at EMC, a large data storage company, managing projects to improve revenue performance by developing and collecting operational metrics, by standardizing global structure and processes, and by streamlining and enhancing IT infrastructure. His business experience includes several years as a consultant with A.T. Kearney where he participated and led strategic and market analyses, operational improvements and performance optimization efforts. Dr. Chun spent seven years as Vice President and Chief Technical Officer at a biotech subsidiary of Photon Research Associates, Inc., developing and commercializing molecular modeling software and services, through collaborations with academic and industry researchers and liaison with a major software distributor. Prior to that, he spent nine years in aerospace engineering, performing dynamics and controls modeling, simulation, and assessment for spacecraft and aircraft. Vincent&#8217;s education includes a PhD from Massachusetts Institute of Technology, and an MBA from Kellogg School of Management. He has published 18 journal articles, and has served as peer reviewer for several professional publications.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Vice President","firm":{"name":"Allied Minds","permalink":"allied-minds","type_of_entity":"financial_org","image":{"available_sizes":[[[150,65],"assets/images/resized/0012/8369/128369v5-max-150x150.png"],[[250,108],"assets/images/resized/0012/8369/128369v5-max-250x250.png"],[[450,195],"assets/images/resized/0012/8369/128369v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}