{"first_name":"JP","last_name":"Bewley","permalink":"vinny-olmstead","crunchbase_url":"http://www.crunchbase.com/person/vinny-olmstead","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Bridgevine, Inc.","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Apr 29 13:06:12 UTC 2008","updated_at":"Sat Oct 20 03:29:07 UTC 2012","overview":"<p>Prior to joining Bridgevine, Bewley was the Global Org leader for Consulting and Agency Services at Acxiom, a $1.13 billion-a-year marketing technology and services company. In just four years, he built Acxiom’s marketing strategy practice from inception into a $100 million business unit adding an additional $219 million in booked revenue. His team of over 450 employees, including 100 analytic professionals delivered client engagements in 27 countries and helped lead Acxiom to earn top recognition for Strategy, Market Presence and Current Offering in Forrester Research’s most recent Database Marketing Service Provider Wave Report.</p>\n\n<p>Prior to Acxiom, Bewley was the incubator and president of Silicon Valley-based Raine Media, transforming the West Coast’s then largest privately held printing company into an organization that provides SaaS technology platform and analytically derived marketing strategies to Fortune 500 clients in financial services, healthcare, high-technology and insurance.</p>\n\n<p>Previously, Bewley was the Chief Information Officer for LSC Marketing of Little Rock, Arkansas, where he was responsible for the company’s database marketing team and led the migration of the company’s data management capabilities to the Internet. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Bridgevine, Inc.","permalink":"bridgevine","type_of_entity":"company","image":{"available_sizes":[[[150,40],"assets/images/resized/0001/7794/17794v13-max-150x150.jpg"],[[250,67],"assets/images/resized/0001/7794/17794v13-max-250x250.jpg"],[[450,121],"assets/images/resized/0001/7794/17794v13-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}