{"first_name":"Vinod","last_name":"K Kala","permalink":"vinod-k-kala","crunchbase_url":"http://www.crunchbase.com/person/vinod-k-kala","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Emergent Ventures India","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jun 10 17:49:11 UTC 2009","updated_at":"Tue Jun 05 02:37:37 UTC 2012","overview":"<p>Vinod created EVI in 2004 to fight climate change in commercially sustainable ways. Under his stewardship, the company evolved from a CDM consultancy for clients in India and the developing world, into a broad spectrum enterprise specializing in energy technology, financing and project development. Today, Vinod is widely recognized as an influential leader in this space, thanks to the pioneering work he and EVI have done in climate mitigation, emission reductions, financial structuring, and generation of additional revenue streams for clients. As a testament to Vinod’s prescience and leadership, as well as the potent business model he established with EVI, IDFC Private Equity invested $10 million in the company in March 2008. While driving EVI’s growth, Vinod has simultaneously promoted a host of related Clean Technology Initiatives. They include Green Infra, a joint venture with IDFC Private Equity that owns and operates renewable energy assets in India; Kalpan Hydro, a developer of run-of-the-river hydro projects ranging from 5 to 200 MW; DSTL, an incubator of cutting edge technology with a focus on nanotechnology-based semiconductors; and WindForce Management, a provider of turnkey services for wind-based power projects. He also helped build Creative EcoWorks, a non-profit that promotes grass-roots entrepreneurship in rural areas. Prior to founding EVI, Vinod promoted software products for the telecom and financial sectors. He also spent 10 years as a consultant in such assignments as cross border mergers and acquisitions, large-scale financial re-engineering, and the launching of new products and ventures. Vinod has a Post Graduate Diploma in Management from IIM Ahmedabad (1986), where he ranked amongst the top of his graduating class. He also has a B. Tech in Mechanical Engineering from Malaviya Regional Engineering College (1983), where again he topped amongst all branches of engineering</p>","image":{"available_sizes":[[[128,145],"assets/images/resized/0004/7874/47874v1-max-150x150.jpg"],[[128,145],"assets/images/resized/0004/7874/47874v1-max-250x250.jpg"],[[128,145],"assets/images/resized/0004/7874/47874v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Post Graduate Diploma","subject":"Management","institution":"IIM Ahmedabad","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder & Managing Director","firm":{"name":"Emergent Ventures India","permalink":"emergent-ventures-india","type_of_entity":"company","image":{"available_sizes":[[[150,62],"assets/images/resized/0004/6414/46414v1-max-150x150.png"],[[153,64],"assets/images/resized/0004/6414/46414v1-max-250x250.png"],[[153,64],"assets/images/resized/0004/6414/46414v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}