{"first_name":"Vinton","last_name":"Cerf","permalink":"vinton-cerf","crunchbase_url":"http://www.crunchbase.com/person/vinton-cerf","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Google","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Mon Apr 12 18:03:37 UTC 2010","updated_at":"Mon Apr 12 18:03:37 UTC 2010","overview":"<p>Vinton G. Cerf is vice president and Chief Internet Evangelist for Google. He is responsible for identifying new enabling technologies and applications on the Internet and other platforms for the company.</p>\n\n<p>Widely known as a &#8220;Father of the Internet,&#8221; Vint is the co-designer with Robert Kahn of TCP/IP protocols and basic architecture of the Internet. In 1997, President Clinton recognized their work with the U.S. National Medal of Technology. In 2005, Vint and Bob received the highest civilian honor bestowed in the U.S., the Presidential Medal of Freedom. It recognizes the fact that their work on the software code used to transmit data across the Internet has put them &#8220;at the forefront of a digital revolution that has transformed global commerce, communication, and entertainment.&#8221;</p>\n\n<p>From 1994-2005, Vint served as Senior Vice President at MCI. Prior to that, he was Vice President of the Corporation for National Research Initiatives (CNRI), and from 1982-86 he served as Vice President of MCI. During his tenure with the U.S. Department of Defense&#8217;s Advanced Research Projects Agency (DARPA) from 1976-1982, Vint played a key role leading the development of Internet and Internet-related data packet and security technologies.</p>\n\n<p>Since 2000, Vint has served as chairman of the board of the Internet Corporation for Assigned Names and Numbers (ICANN) and he has been a Visiting Scientist at the Jet Propulsion Laboratory since 1998. He served as founding president of the Internet Society (ISOC) from 1992-1995 and was on the ISOC board until 2000. Vint is a Fellow of the IEEE, ACM, AAAS, the American Academy of Arts and Sciences, the International Engineering Consortium, the Computer History Museum and the National Academy of Engineering.</p>\n\n<p>Vint has received numerous awards and commendations in connection with his work on the Internet, including the Marconi Fellowship, Charles Stark Draper award of the National Academy of Engineering, the Prince of Asturias award for science and technology, the Alexander Graham Bell Award presented by the Alexander Graham Bell Association for the Deaf, the A.M. Turing Award from the Association for Computer Machinery, the Silver Medal of the International Telecommunications Union, and the IEEE Alexander Graham Bell Medal, among many others.</p>\n\n<p>He holds a Ph.D. in Computer Science from UCLA and more than a dozen honorary degrees.</p>","image":{"available_sizes":[[[119,150],"assets/images/resized/0008/3516/83516v1-max-150x150.jpg"],[[142,178],"assets/images/resized/0008/3516/83516v1-max-250x250.jpg"],[[142,178],"assets/images/resized/0008/3516/83516v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Vice President & Chief Internet Evangelist ","firm":{"name":"Google","permalink":"google","type_of_entity":"company","image":{"available_sizes":[[[150,51],"assets/images/resized/0002/9578/29578v31-max-150x150.png"],[[250,85],"assets/images/resized/0002/9578/29578v31-max-250x250.png"],[[450,154],"assets/images/resized/0002/9578/29578v31-max-450x450.png"]],"attribution":null}}}],"investments":[{"funding_round":{"round_code":"seed","source_url":"http://techcrunch.com/2011/11/09/glooko-iphones-diabetes/","source_description":"TechCrunch","raised_amount":1000000,"raised_currency_code":"USD","funded_year":2010,"funded_month":11,"funded_day":1,"company":{"name":"Glooko","permalink":"glooko","image":{"available_sizes":[[[150,64],"assets/images/resized/0016/1693/161693v1-max-150x150.png"],[[192,83],"assets/images/resized/0016/1693/161693v1-max-250x250.png"],[[192,83],"assets/images/resized/0016/1693/161693v1-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}