{"first_name":"vipeak","last_name":"William","permalink":"vipeak-william","crunchbase_url":"http://www.crunchbase.com/person/vipeak-william","homepage_url":"http://www.vipeakgroup.com/","birthplace":"China","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1986,"born_month":10,"born_day":16,"tag_list":"","alias_list":null,"created_at":"Sat Jul 24 05:49:02 UTC 2010","updated_at":"Mon Jul 26 19:59:44 UTC 2010","overview":"<p>Being a leading company in industrial powder processing, engineering stone crushing and construction sand making, Vipeak Heavy Industry Machinery Group Company is a high-tech mining machinery company in China. Our service has expanded to the entire world, almost including 75 countries. From engineering stone, construction sand to engineering powder. All equipments from VIPEAK exert great productivity and stability on working sites, make the customers satisfied. We strongly feel that customers do not only need equipments with good performance, but in the hope of their efficiency, their benefit and their competitive power. So high value added equipments have been produced. We have never been satisfied; our customer&#8217;s satisfaction is our utmost objective. Vipeak Declaration is made of Vipeak Spirit, Vipeak Aim, Vipeak Concept, Vipeak Brand Concept and Vipeak Service Concept. </p>\n\n<p>Vipeak: Technology is source, perseverance makes success\nVipeak Aim: Eligible quality is the obligation for society, and good quality is the contribution for society\nVipeak Concept: To be your satisfied partner(all the customers and partners of our company and the staff in our company are satisfied). \nVipeak Spirit: Efficiency, Communication, Service, Study</p>\n\n<p>If you are interested, please click our website.\nour english website is http://www.vipeakgroup.com/\nour chinese website is http://www.wkmjw.com</p>","image":{"available_sizes":[[[150,101],"assets/images/resized/0009/4768/94768v2-max-150x150.jpg"],[[250,169],"assets/images/resized/0009/4768/94768v2-max-250x250.jpg"],[[282,191],"assets/images/resized/0009/4768/94768v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}