{"first_name":"Vishnu","last_name":"Amble","permalink":"vishnu-amble","crunchbase_url":"http://www.crunchbase.com/person/vishnu-amble","homepage_url":"","birthplace":"Chicago, IL","twitter_username":"VishnuAmble","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1981,"born_month":7,"born_day":18,"tag_list":"vishnu-amble, global-cleantech-capital","alias_list":null,"created_at":"Wed Jan 12 10:56:11 UTC 2011","updated_at":"Wed Mar 07 02:54:23 UTC 2012","overview":"<p>Vishnu Amble is an Investment Professional with Global Cleantech Capital (GCC), based in Europe.  Prior to GCC, he focused on India private equity investments for Dubai-based Abraaj Capital, the Middle East&#8217;s largest private equity firm with over $6.5 billion in assets under management.  His responsibilities included the execution and management of four private equity investments in India, with a focus on the power, energy, and infrastructure sectors.  Prior to Abraaj, Vishnu was with The Carlyle Group, a global alternative asset manager with more than $140 billion under management, focusing on private equity investments, including buyout and growth equity, in companies in the software, software-enabled services, power and clean technology, and semiconductors and related supply chain businesses across the globe.  Vishnu started his career with Lehman Brothers in the Global Power and Energy Investment Banking Group based in New York and London, focusing on mergers and acquisitions, equity and debt financings, and strategic advisory mandates for electric utilities, thermal and renewable power producers, and cleantech and power technology companies.  He received his undergraduate degrees in Economics and Computer Science from the University of Michigan-Ann Arbor. </p>","image":{"available_sizes":[[[103,150],"assets/images/resized/0011/8214/118214v2-max-150x150.jpg"],[[142,205],"assets/images/resized/0011/8214/118214v2-max-250x250.jpg"],[[142,205],"assets/images/resized/0011/8214/118214v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://in.linkedin.com/in/vishnuamble","title":""}]}