{"first_name":"Vivek","last_name":"Lath","permalink":"vivek-lath","crunchbase_url":"http://www.crunchbase.com/person/vivek-lath","homepage_url":"","birthplace":"India","twitter_username":"viveklath","blog_url":"http://www.rightsguru.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1980,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue May 15 06:43:12 UTC 2012","updated_at":"Wed May 23 15:51:19 UTC 2012","overview":"<p>Vivek is a general management profile with experience in Business Consulting, Retail, Media/Entertainment &amp; FMCG/CPG industry and passionate about developing new ventures/businesses, evaluating businesses and strategy in Digital Media.</p>\n\n<p>Vivek started his career with Cannondale Associates (Now Kantar Retail), a business consulting firm based in CT, USA . He assisted Retail and FMCG/CPG clients with their various growth plans, marketing plans, sales programs and new to market strategies. List of clients included fortune 50 Retail and FMCG/CPG companies in US. </p>\n\n<p>He then moved to India and worked in a mid management role, developing new businesses and managing content acquisition for Tata Sky, a satellite television platform in India. This engagement involved building relations and negotiations with pay channel broadcasters, movie distributors, movie producers and other content providers. </p>\n\n<p>From Oct 2008 - Jan- 2010 He went through the sweet experience of starting his own venture. He took care of everything from building technology to raising capital, business development, marketing and sales. Ran a successful pilot and signed up some of the largest CPG companies in India as his clients.</p>\n\n<p>Vivek is currently setting up an online video platform for distribution of Indian content in international markets in addition to running a content syndication business. \nPrior to this he helped setting up the worldwide film distribution venture of Cinergy Group, a movie production and distribution house in India. He was also heading their business planning and fund raising efforts. He worked closely with content buyers and sellers from across the world and developed expertise in licensing entertainment content across all platforms.</p>","image":{"available_sizes":[[[125,150],"assets/images/resized/0018/9797/189797v2-max-150x150.jpg"],[[209,250],"assets/images/resized/0018/9797/189797v2-max-250x250.jpg"],[[377,450],"assets/images/resized/0018/9797/189797v2-max-450x450.jpg"]],"attribution":"<p>Vivek Lath</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://in.linkedin.com/in/viveklath","title":""}]}