{"first_name":"Vmukti","last_name":"Solutions","permalink":"vmukti-solution","crunchbase_url":"http://www.crunchbase.com/person/vmukti-solution","homepage_url":"http://www.vmukti.com","birthplace":"Ahmedabad","twitter_username":"vmukti_events","blog_url":"http://www.vmukti.com/blog/blog.html","blog_feed_url":"http://www.vmukti.com/blog/blog.html","affiliation_name":"VMukti Solutions Pvt. Ltd.","born_year":1987,"born_month":11,"born_day":10,"tag_list":"live-video-streaming, online-virtual-classroom, live-event-webcasting","alias_list":null,"created_at":"Tue Jul 13 10:19:37 UTC 2010","updated_at":"Sat Jul 17 22:42:08 UTC 2010","overview":"<p>Vmukti provide facility for teachers and students to connect and meet live in the Virtual Classroom for an online interactive class. The shared web conferencing environment enables you to communicate synchronously using video and audio streaming or through text chat, and to share presentations, documents and images on an interactive whiteboard. Join us now, to conduct your online live class and experience the next best alternative to web based classroom teaching. </p>\n\n<p>VMukti e-learning services are an open-source, cloud-based HD video communication platform, conceptualized in September 2005, with proof-of-concept launch in April 2006. VMukti is an emerging product-related broadcasting software company targeting the US$50 billion video communications industry, with the potential to save clients 80% on bandwidth and storage infrastructure via state-of-the-art client and server-less, broadband-ready platform features. Two of VMukti’s existing pilots are with Fortune 500 companies. We have Corporate Offices at Ahmedabad and Delhi and going to open our new office at Mumbai very shortly.</p>\n\n<p>VMukti streaming video platform is completely flexible, extendible and cost effective which enhance organization’s productivity. Live streaming gives you the opportunity to broadcast an event in real time to your selected audience over the internet. Live Virtual classroom education is a term describing online webinar education using the Live Video broadcasting on internet.. This term is primarily used in higher education where so-called Virtual Universities have been established.</p>\n\n<p>We bring Live streaming, Online Video streaming, Virtual Classroom, Live event streaming, event broadcast, web streaming, live webcasting software, web streaming with masses only for you at very cheap rate.Vmukti Deliver Live Events for any purpose, for any number of audiences with flawlessly at the best possible quality of audio &amp; video over the web.You can get the facilities of virtual training solutions, video webcasting, live video webcast easily in India, USA, UK, Australia and all over the world.</p>\n\n<p>Vmukti provides students with a stimulating, positive and enjoyable environment along with the opportunity to develop skills that are essential in the 21st century: cross-cultural communication, collaboration through teamwork. </p>\n\n<p>VMukti e learning solution empower dynamic, interactive education/training to students, employees, customers and partners, anywhere in the world, in their own customizable web-based interactive virtual classroom. Share visual content over the web in real time - so everyone sees and hears the same thing at the same time. You&#8217;ll reach more learners in less time and you&#8217;ll save the travel and costs associated with traditional on-site e learning training.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0009/3187/93187v2-max-150x150.png"],[[167,250],"assets/images/resized/0009/3187/93187v2-max-250x250.png"],[[201,300],"assets/images/resized/0009/3187/93187v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"SEO","firm":{"name":"VMukti Solutions Pvt. Ltd.","permalink":"vmukti-solutions-pvt-ltd","type_of_entity":"company","image":{"available_sizes":[[[150,37],"assets/images/resized/0005/2239/52239v2-max-150x150.png"],[[250,62],"assets/images/resized/0005/2239/52239v2-max-250x250.png"],[[450,111],"assets/images/resized/0005/2239/52239v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}