{"first_name":"vouchers","last_name":"mate","permalink":"vouchers-mate","crunchbase_url":"http://www.crunchbase.com/person/vouchers-mate","homepage_url":"http://www.giftvouchersmate.com","birthplace":"New Delhi","twitter_username":"vouchersmate","blog_url":"http://vouchersmate.com/blog.aspx","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1977,"born_month":8,"born_day":1,"tag_list":"gift-to-india, gift-vouchers-india, online-gifts, vouchersmate, birthday-gift, anniversary, wedding, fathers-day, mothers-day, spa, salon, restaurants, pubs-","alias_list":null,"created_at":"Sat Jun 25 08:04:35 UTC 2011","updated_at":"Wed Oct 19 22:49:04 UTC 2011","overview":"<p>Vouchers Mate gives you a wide variety of gift vouchers to choose from, be it the fashion accessories and apparel gift vouchers, bookstores, Hobbies and entertainment like bowling, dance studios, go karting and much more to pamper them with Beauty salon and studio, Spa and wellness center, Health club, Gyms, kravmaga, martial arts, or even a nice travel vacation to the dream destination. A lot of restaurants, pubs and bars, cafe&#8217;s of the city to choose from and maybe even gift a birthday party with an exclusive gift voucher.Gift vouchers are perfectly apt and sweet for occasions like birthdays, anniversaries, wedding, Diwali, Holi or any normal day you&#8217;d want to make special, so be it that you want to show your love to your beloved or say sorry to any of your friends or family in form of a nice gifting experience with a gift voucher from vouchersmate. </p>\n\n<p>Gift vouchers are simple and easy to redeem and are suitable for almost all occasions that make life sweet and beautiful. Gift vouchers are also available for your parents, for that special him or for that magical her of your life to make it special for them and for you.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.dealpals.com/blog/online-gift-vouchers-india","title":"Online gift vouchers"}],"web_presences":[]}