{"first_name":"Vxpose","last_name":"Vxpose","permalink":"vxpose-vxpose","crunchbase_url":"http://www.crunchbase.com/person/vxpose-vxpose","homepage_url":"http://www.vxpose.com","birthplace":"Philadelphia, PA","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1980,"born_month":1,"born_day":1,"tag_list":"philadelphia-seo-company, best-seo-company, professional-seo-company, affordable-seo-services, philadelphia-web-optimization, increase-web-traffic, increase-google-ranking-internet-marketing, professional-web-design-and-development, online-reputation-mana","alias_list":null,"created_at":"Thu Mar 10 03:17:00 UTC 2011","updated_at":"Tue Mar 15 00:09:35 UTC 2011","overview":"<p>Vxpose is a group of young and talented experts with experience in Website Optimization, Internet Marketing, Content Writing, and SEO (search engine optimization). Our goal is to EXPOSE your business to all potential clients and to the world. Our team has always been successful in building organic rankings, traffic, and increasing ROI (return on investment) for all business, small, large, personal, and corporate.</p>\n\n<p>Vxpose was founded in 2007 by two young men that came from two different backgrounds. Combined we had Marketing, Business, Computer programming, and extensive training in all aspects of the viral market. We made a great team because we are always eager to be up to date with the latest trends and always performed extensive research on all of the updates for our industry. In today&#8217;s world of technology there are always updates and innovations that are released especially pertaining to search algorithm, research and analytics, search engine optimization, marketing, and web metric, just to name a few. We never fall behind, we move with the market.</p>\n\n<p>We are very well known in our community and have achieved the business goal that we were set out to accomplish much faster than ever presumed. Since we experienced rapid growth, we needed to be sure we had enough time to give each business the attention it not only needed but also deserved. To ensure this we employed dedicated individuals who have experience in many aspects of the web and its impact on the business world. Together we expose our combined experience and dedication to the world of web and this is how Vxpose was originated and continues to follow its success in business.</p>","image":{"available_sizes":[[[150,84],"assets/images/resized/0012/5721/125721v2-max-150x150.png"],[[207,116],"assets/images/resized/0012/5721/125721v2-max-250x250.png"],[[207,116],"assets/images/resized/0012/5721/125721v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}