{"first_name":"W.","last_name":"Merrette Moore","permalink":"w-merrette-moore","crunchbase_url":"http://www.crunchbase.com/person/w-merrette-moore","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 05 11:56:48 UTC 2009","updated_at":"Fri Jun 05 12:03:32 UTC 2009","overview":"<p>Merrette Moore, relies on a wide range of experience in commercial banking, investment banking, portfolio management and private equity in North Carolina-based organizations to source investment opportunities, review business plans, lead investment due diligence and provide strategic advice to prospective and existing portfolio companies. Merrette&#8217;s background includes working closely with a variety of start-up and small companies, as he has developed many of the tools used by NC IDEA in its due diligence process, including financial analysis models and investment memorandum formats.</p>\n\n<p>Merrette started working with MCNC in February 2002 to assist in the organization&#8217;s restructuring into two companies, MCNC-RDI and MCNC-GCNS, as well as to help launch MCNC Ventures, the venture capital predecessor of NC IDEA. He currently serves as a Vice President of NC IDEA.</p>\n\n<p>Merrette has previous venture capital investment experience via Franklin Street Capital, a private equity investment firm in Chapel Hill, where he conducted due diligence and financial analysis on information technology and life sciences companies. He also gained exposure to later stage private equity through an internship in business school with Fairview Capital, where he assisted with the firm&#8217;s investment process as well.</p>","image":null,"degrees":[{"degree_type":"MBA ","subject":"","institution":"University of North Carolina","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Partner ","firm":{"name":"IDEA Fund Partners","permalink":"idea-fund-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,55],"assets/images/resized/0002/9206/29206v5-max-150x150.png"],[[250,92],"assets/images/resized/0002/9206/29206v5-max-250x250.png"],[[450,166],"assets/images/resized/0002/9206/29206v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}