{"first_name":"W.","last_name":"Thomas Smith, Jr.","permalink":"w-thomas-smith-jr","crunchbase_url":"http://www.crunchbase.com/person/w-thomas-smith-jr","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri May 29 19:19:42 UTC 2009","updated_at":"Fri May 29 19:20:25 UTC 2009","overview":"<p>Mr. Smith is a founder of Total Technology Ventures. He retired from IBM in 2000 after 30 years of service. From 1996 to his retirement, Mr. Smith served as Vice President, Small and Medium Business, IBM Americas. Prior to that, he was the Southern Area General Manager appointed in 1986, with responsibility for IBM&#8217;s sales, marketing, and services business for thirteen states. His community affiliations include the United Way of Metropolitan Atlanta as Board Chairman for 1998-99, Central Atlanta Progress, the Carter Center, and the Woodruff Arts Center. He received the Armin Maier citizenship award from the Atlanta Downtown Rotary Club in 1998. Mr. Smith earned a B. S. Degree in industrial management from The Georgia Institute of Technology in 1969 and completed the executive program at Dartmouth&#8217;s Amos Tuck School of Business in 1986. In addition, he received his &#8220;Certificate in Data Processing&#8221; from the Institute for Certification of Computer Professionals. Mr. Smith is currently on the Board of Directors of Austin Logistics, Inc., E-Duction, e-Wise Systems, Green Dot Corporation, IP Commerce Company, Microbilt, Serious, Inc. Silverpop Systems, Inc. and a Board Observer of PayCycle, Inc. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing partner","firm":{"name":"Total Technology Ventures","permalink":"total-technology-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,7],"assets/images/resized/0004/5967/45967v1-max-150x150.png"],[[250,13],"assets/images/resized/0004/5967/45967v1-max-250x250.png"],[[450,23],"assets/images/resized/0004/5967/45967v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}