{"first_name":"Wadooah","last_name":"Wali","permalink":"wadooah-wali","crunchbase_url":"http://www.crunchbase.com/person/wadooah-wali","homepage_url":"http://about.me/Wadooah","birthplace":"","twitter_username":"dubya2","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Feb 22 02:10:57 UTC 2011","updated_at":"Tue Aug 21 09:39:44 UTC 2012","overview":"<p>Blending resourcefulness with her passion for bridging conversations, Wadooah shapes perceptions and drives awareness with strategic and effect &#8220;story-telling&#8221; aka content creation with a purpose.</p>\n\n<p>Wadooah Wali, now a freelance professional previously served as Demand Media&#8217;s Senior Director of Corporate Communications. In this role, she works with Demand Media&#8217;s in-house communications team and its corporate and trade public relations agencies, managing internal and external communications. </p>\n\n<p>A communications executive with more than 15 years of diverse experience, Wadooah joined Demand Media in 2006 as one of the two original founding communications team members and lead many of the company&#8217;s communications activities including the launch LIVESTRONG.COM with Lance Armstrong and the LAF, Demand Media Studios (the company&#8217;s disruptive, content creation model) and Demand Media&#8217;s brands like eHow and Cracked.com. In addition to other business initiatives and corporate issues, she also worked closely with the executive team in taking the company public in January 2011.</p>\n\n<p>Prior to joining Demand Media, Wadooah drove marketing and media relations activities for a private clients, nonprofit organizations, as well as consumer and technology brands like WUSF-FM (NPR affiliate), the American Cancer Society, The Tampa Bay Buccaneers, Z. Cavaricci, Brightmail (now Symantec) HP, Hitachi Data Systems, Telephia (now Nielsen) and others. Wadooah ads a unique blend of business planning, strategic PR, message creation and development, media relations, technology assessment, marketing communications, go-to-market planning, strategy consulting and executive coaching - all with an entrepreneurial spirit and a unique flair.</p>\n\n<p>Wadooah earned a Bachelor of Arts degree in Mass Communications from the University of South Florida. She currently resides in Los Angeles.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0012/3315/123315v2-max-150x150.tiff"],[[166,250],"assets/images/resized/0012/3315/123315v2-max-250x250.tiff"],[[299,450],"assets/images/resized/0012/3315/123315v2-max-450x450.tiff"]],"attribution":"<p>Laurie Steiner-Halperin</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/profile/view?id=6066466&trk=tab_pro","title":"LinkedIn"},{"external_url":"http://www.twitter.com/dubya2","title":"Twitter"}]}