{"first_name":"Dr. Wal","last_name":"Van Lierop","permalink":"wal-van-lierop","crunchbase_url":"http://www.crunchbase.com/person/wal-van-lierop","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":"","created_at":"Wed May 13 05:51:14 UTC 2009","updated_at":"Thu May 21 11:36:41 UTC 2009","overview":"<p>As co-founder, President and Chief Executive Officer of Chrysalix Energy Management Inc., Dr. Wal van Lierop oversees the firm’s operations and investments. He currently works with Angstrom Power, HydroPoint Data Systems, Inc., H2Gen Innovations, and –until 2008 Day4 Energy, as well as a number of other early stage companies. Dr. van Lierop is a Consultant and member of the Investment Committee for Chrysalix’ affiliated fund in Europe: SET VP.</p>\n\n<p>Dr. van Lierop holds a part-time adjunct professorship: Sauder School of Business, University of British Columbia in Entrepreneurial Finance and Venture Capital. He is also the initiator and a current Director of New Ventures BC the successful new ventures and business plan competition in the province of British Columbia. Dr. van Lierop is a frequently invited speaker on topics related to new energy, venture financing and global business and provides ongoing support to a series of national and international cleantech organizations. He is heavily involved in the community and is a proud supporter of the arts. He is an avid jogger and likes to enjoy the outdoors of British Columbia.</p>\n\n<p>Prior to joining Chrysalix, Dr. van Lierop was Vice President of Strategic Planning at Westcoast Energy, Inc. headquartered in Vancouver, Canada. Dr. van Lierop was with McKinsey &amp; Co for 7 years, prior to which he worked for almost 10 years in various positions at the Vrije University of Amsterdam, the Netherlands. From that base he consulted to business, government, and major international institutions such as the European Community and the World Bank.</p>","image":{"available_sizes":[[[90,110],"assets/images/resized/0004/5010/45010v1-max-150x150.jpg"],[[90,110],"assets/images/resized/0004/5010/45010v1-max-250x250.jpg"],[[90,110],"assets/images/resized/0004/5010/45010v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President & CEO","firm":{"name":"Chrysalix Energy","permalink":"chrysalix-energy","type_of_entity":"financial_org","image":{"available_sizes":[[[150,53],"assets/images/resized/0004/3880/43880v6-max-150x150.jpg"],[[250,89],"assets/images/resized/0004/3880/43880v6-max-250x250.jpg"],[[450,160],"assets/images/resized/0004/3880/43880v6-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}