{"first_name":"Walter","last_name":"C. Liss","permalink":"walter-c-liss","crunchbase_url":"http://www.crunchbase.com/person/walter-c-liss","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 21 02:33:58 UTC 2008","updated_at":"Wed May 21 02:53:40 UTC 2008","overview":"<p>Walter C. Liss has been President, ABC Owned Television Stations, since May 1999. He has chief management responsibility for the 10 ABC owned television stations, ABC&#8217;s National Television Sales rep firm, and a number of far-reaching content and technology initiatives.</p>\n\n<p>Under Mr. Liss&#8217;s direction, the ABC Owned Television Stations division continues to build upon its long-time leadership in the broadcasting industry &#8211; combining award-winning community service with top news and entertainment programming to produce outstanding ratings and financial performance.</p>\n\n<p>The ABC owned group, reaching about 23.5% of the nation&#8217;s television households, includes WABC-TV in New York; KABC-TV in Los Angeles; WLS-TV in Chicago; WPVI-TV in Philadelphia; KGO-TV in San Francisco; and KTRK-TV in Houston (all six among Nielsen&#8217;s top 10 markets) and WTVD-TV in Raleigh-Durham, NC; KFSN-TV in Fresno, CA; WJRT-TV in Flint, MI; and WTVG-TV in Toledo.</p>\n\n<p>Mr. Liss has overseen the expansion of the division beyond traditional broadcast service with ABC owned TV stations now offering additional digital channels that individually focus on high definition programming, extensive weather reporting and continuous news coverage. The NTVS rep firm has also expanded beyond its work on behalf of the ABC owned stations to now also include a client roster of regional sports networks including the YES Network (Yankees Entertainment and Sports Network). In addition, local websites have become a fast developing platform for owned station content.</p>\n\n<p>A long-time company executive, Mr. Liss previously had been responsible for Buena Vista Television and its pay television unit (like ABC, also owned by The Walt Disney Company). He also has served as President and General Manager of WABC-TV in New York.</p>\n\n<p>After early career experience with John Blair and Company and with Triangle Stations, Mr. Liss in 1971 joined Capital Cities Communications (which years later merged with ABC). He advanced at Capital Cities from Promotion Manager at WPVI-TV in Philadelphia to Program Director at WKBW-TV in Buffalo, NY and Vice President and General Manager at KFSN-TV in Fresno.</p>\n\n<p>He subsequently moved to Miami, where he became Vice President/General Manager at WPLG-TV, a Post-Newsweek Television station. Mr. Liss moved into station group management as President of the broadcasting division of Cox Enterprises where he directed the operations of eight television stations, 12 radio stations and a national sales rep firm.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/8995/18995v1-max-150x150.jpg"],[[200,200],"assets/images/resized/0001/8995/18995v1-max-250x250.jpg"],[[200,200],"assets/images/resized/0001/8995/18995v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://corporate.disney.go.com/corporate/management_team.html\" title=\"Disney\" rel=\"nofollow\">Disney</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"President, ABC Owned Television Stations","firm":{"name":"The Walt Disney Company","permalink":"the-walt-disney-company","type_of_entity":"company","image":{"available_sizes":[[[150,73],"assets/images/resized/0001/0929/10929v1-max-150x150.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-250x250.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}