{"first_name":"Walter","last_name":"Isaacson","permalink":"walter-isaacson","crunchbase_url":"http://www.crunchbase.com/person/walter-isaacson","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"The Aspen Institute","born_year":1952,"born_month":5,"born_day":20,"tag_list":"","alias_list":null,"created_at":"Wed Dec 14 18:24:37 UTC 2011","updated_at":"Thu Dec 15 18:33:09 UTC 2011","overview":"<p>Walter Isaacson is the president and CEO of the Aspen Institute, a nonpartisan educational and policy studies institute based in Washington, DC. He has been the chairman and CEO of CNN and the editor of TIME magazine.</p>\n\n<p>He is the author of Steve Jobs (2011), Einstein: His Life and Universe (2007), Benjamin Franklin: An American Life (2003), and Kissinger: A Biography (1992), and coauthor of The Wise Men: Six Friends and the World They Made (1986).</p>\n\n<p>Isaacson was born on May 20, 1952, in New Orleans. He is a graduate of Harvard College and of Pembroke College of Oxford University, where he was a Rhodes Scholar. He began his career at The Sunday Times of London and then the New Orleans Times-Picayune/States-Item.  He joined TIME in 1978 and served as a political correspondent, national editor, and editor of new media before becoming the magazine’s 14th editor in 1996. He became chairman and CEO of CNN in 2001, and then president and CEO of the Aspen Institute in 2003.</p>\n\n<p>He is the chairman of the board of Teach for America, which recruits recent college graduates to teach in underserved communities. He was appointed by President Barack Obama and confirmed by the Senate to serve as the chairman of the Broadcasting Board of Governors, which oversees Voice of America, Radio Free Europe, and other international broadcasts of the United States. He is vice-chair of Partners for a New Beginning, a public-private group tasked with forging ties between the United States and the Muslim world.  He is on the board of United Airlines, Tulane University, and the Overseers of Harvard University.  From 2005-2007, after Hurricane Katrina, he was the vice-chair of the Louisiana Recovery Authority.</p>\n\n<p>He lives with his wife and daughter in Washington, DC.</p>","image":{"available_sizes":[[[100,100],"assets/images/resized/0016/6410/166410v1-max-150x150.jpg"],[[100,100],"assets/images/resized/0016/6410/166410v1-max-250x250.jpg"],[[100,100],"assets/images/resized/0016/6410/166410v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President & CEO","firm":{"name":"The Aspen Institute","permalink":"the-aspen-institute","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}