{"first_name":"Walter","last_name":"P. Havenstein","permalink":"walter-p-havenstein","crunchbase_url":"http://www.crunchbase.com/person/walter-p-havenstein","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed Mar 09 07:37:55 UTC 2011","updated_at":"Wed Mar 09 07:40:17 UTC 2011","overview":"<p>Walter P. Havenstein joined Science Applications International Corporation (SAIC) as chief executive officer on September 21, 2009. He is also a member of SAIC’s board of directors.\nHe is also chairman of the board of directors of FIRST® (For Inspiration and Recognition of Science and Technology), a not-for-profit organization founded to inspire young people&#8217;s interest and participation in science and technology. He serves on the board of advisors for the Whittemore School of Business, University of New Hampshire.\nPrior to joining SAIC, Havenstein served as chief operating officer and member of the board of directors for BAE Systems plc, a $34 billion global aerospace and defense company; and as president and chief executive officer of BAE Systems Inc., the company’s wholly owned U.S. subsidiary, which employs 53,000 employees and generates annual sales in excess of $20 billion. Havenstein previously served as president of the Electronics &amp; Integrated Solutions Operating Group within BAE Systems. Before that, he was president of BAE Systems’ Information and Electronic Warfare Systems business unit. Havenstein was president of the Sanders defense electronics business prior to it being acquired by BAE from Lockheed Martin in 2000. Before joining Sanders in 1999, he had been vice president and general manager of the Strategic Systems Division for Raytheon. He began his defense industry career at the ITT Aerospace and Communications Division in business development and program management roles.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0012/5591/125591v1-max-150x150.jpg"],[[192,192],"assets/images/resized/0012/5591/125591v1-max-250x250.jpg"],[[192,192],"assets/images/resized/0012/5591/125591v1-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Master’s degree","subject":"Electrical engineering","institution":"Naval Postgraduate School","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"SAIC","permalink":"saic","type_of_entity":"company","image":{"available_sizes":[[[100,43],"assets/images/resized/0005/7955/57955v1-max-150x150.png"],[[100,43],"assets/images/resized/0005/7955/57955v1-max-250x250.png"],[[100,43],"assets/images/resized/0005/7955/57955v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}