{"first_name":"Walter","last_name":"Wright","permalink":"walter-wright","crunchbase_url":"http://www.crunchbase.com/person/walter-wright","homepage_url":"http://www.trinitylg.com","birthplace":"Newton MA","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1957,"born_month":2,"born_day":9,"tag_list":"law, legal, contracts, entrepreneurs, startups, emerging-companies, venture-capital, technology, digital-media, attorney, lawyer, negotiations, finance, licensing, merger, acquisition, stock","alias_list":null,"created_at":"Mon May 12 14:15:26 UTC 2008","updated_at":"Thu May 24 01:59:40 UTC 2012","overview":"<p>Walter Wright, a business law attorney, has represented and counseled a broad spectrum of companies, investors, entrepreneurs and executives, including  Pure Volume, Virb, Uniross, Cognition, Rage Frameworks, Credit Pointe, Candy.com, Brightleaf, Sustainable Real Estate Solutions, Dropfire, Health Enterprises,  Congress,  Larry Weber, Mary Lou Jepson, Pixel Qi, Third Screen Media, TotSpot, Trident Capital, Bain Capital Ventures, EDR, Lightship and others. Walt Wright was named by Massachusetts Super Lawyers in Boston magazine as one of the top 100 attorneys in Massachusetts in 2008. The list compiled the 100 lawyers who received the highest total of points in the Massachusetts Super Lawyers nomination, research and blue ribbon review process based on surveys of over 35,000 lawyers across the state.\nWalt Wright specializes in business and corporate law; leads a law and strategic counseling practice intensely focused on the organizational, venture financing, operational and transactional requirements of entrepreneurs, emerging technology, marketing and information companies as well as representing major venture capital funds and angel groups in investment transactions and executives. \nTrinity Law Group (TLG) is a greater Boston corporate law firm which practices the broad range of business law throughout Massachusetts, the United States and the world with well-recognized attorneys of stellar academic and professional accomplishment. Trinity Law Group is founded on the three pillars of strategy, technology and relationships that are transforming the practice of business law. </p>\n\n<p>Trinity Law Group was founded by Walt Wright and Dan Clark, formerly Managing Directors of Rich May to continue their practice specializing in business and corporate law in a setting that maximizes results to clients; Walt Wright’s law and strategic counseling practice intensely focuses on the organizational, venture financing, operational and transactional requirements of entrepreneurs, emerging technology and information companies as well as representing venture capital funds and angel groups in investment transactions and executives.</p>","image":{"available_sizes":[[[102,63],"assets/images/resized/0003/2297/32297v2-max-150x150.png"],[[102,63],"assets/images/resized/0003/2297/32297v2-max-250x250.png"],[[102,63],"assets/images/resized/0003/2297/32297v2-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"JD","subject":"Law Magna Cum Laude","institution":"Boston College Law School","graduated_year":1983,"graduated_month":null,"graduated_day":null},{"degree_type":"BA","subject":"Political Science Magna Cum Laude","institution":"Tufts University","graduated_year":1979,"graduated_month":null,"graduated_day":null},{"degree_type":"MA","subject":"American Government & Public Policy","institution":"Tufts University","graduated_year":1980,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.trinitylg.com/waw.html","title":"Trinity Law Group"},{"external_url":"http://www.linkedin.com/in/walterwright","title":"Walter Wright LinkedIn"},{"external_url":"http://www.trinitylg.com/waw.html","title":"Walter Wright Bio "},{"external_url":"http://vcexperts.com/vce/about_us/contributing_editors_view.asp?editor_id=6","title":"VC Experts Walter Wright CV"},{"external_url":"http://twitter.com/trinitylg","title":"Trinity Law Twitter"}],"web_presences":[]}