{"first_name":"Wanda","last_name":"Dorosz","permalink":"wanda-dorosz","crunchbase_url":"http://www.crunchbase.com/person/wanda-dorosz","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Jun 02 18:28:51 UTC 2009","updated_at":"Tue Jun 02 18:38:27 UTC 2009","overview":"<p>Wanda Dorosz is a founder, Managing Partner and CEO of Quorum, a private equity boutique that has managed over $800 million (Cdn) in growth capital and real estate since inception. Wanda is responsible for overall strategy and has reviewed over 20 thousand technology companies in her career.  </p>\n\n<p>She is a director of numerous private, public and not-for-profit organisations including the Quorum Group of Companies, York University Schulich Business School and Top 40 Under 40.  She was a national judge of the Canadian E&amp;Y Entrepreneur of the Year Program for a number of years. Some of her prior directorships include Investors Group, Canada’s lagest mutual fund company with 80 billion dollars in assets, Residential Equities REIT, the University of Toronto Governing Council, Toronto Stock Exchange Advisory Committee and the Abitibi-Price Office Products Advisory Board. Wanda was appointed by the Prime Minister of Canada to the National Advisory Board on Science and Technology (NABST) and to Harbourfront Corporation.  Other prior directorships include Anderson Consulting (now Accenture)’s Canadian Advisory Board and Ontario Centre for Microelectronics. She is also currently a member of the Investment Committee of the Canadian Federal Government’s $600 million Sustainable Development Technology Fund.  Wanda received a Bachelor of Education with distinction from the University of Regina and an LLB first Quartile from the University of British Columbia.</p>","image":{"available_sizes":[[[150,141],"assets/images/resized/0004/6339/46339v1-max-150x150.jpg"],[[187,177],"assets/images/resized/0004/6339/46339v1-max-250x250.jpg"],[[187,177],"assets/images/resized/0004/6339/46339v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"CEO & Managing Partner","firm":{"name":"Quorum Group","permalink":"quorum-group","type_of_entity":"financial_org","image":{"available_sizes":[[[150,39],"assets/images/resized/0004/5274/45274v1-max-150x150.jpg"],[[199,52],"assets/images/resized/0004/5274/45274v1-max-250x250.jpg"],[[199,52],"assets/images/resized/0004/5274/45274v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}