{"first_name":"Warren","last_name":"Smith","permalink":"warren-smith","crunchbase_url":"http://www.crunchbase.com/person/warren-smith","homepage_url":"http://www.warrendsmith.com","birthplace":"","twitter_username":"warrensmithd","blog_url":"http://warrendsmith.wordpress.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1972,"born_month":12,"born_day":28,"tag_list":"product-management, product-marketing, strategy, financial-analysis, business-modeling, startup, roi, html-design, flash-design, mobile-application-development, ajax, java, asp, ecommerce, social-media-campaign-management, senior-level-executive-managemen","alias_list":null,"created_at":"Thu Apr 29 14:30:37 UTC 2010","updated_at":"Fri Sep 07 07:41:48 UTC 2012","overview":"<p>Have a vision but no idea how to get there? Call me, I can probably implement it or at least improve it. </p>\n\n<p>I focus on early stage investments and provide services including product, marketing, strategic business development and incubation for startup companies.</p>\n\n<p>I am currently the General Manager for GoodChime, a consumer product enabling celebrities to cultivate their charities by engaging with consumers to improve their personal health using mobile applications and engaging challenges. Prior to GoodChime, I managed a startup incubation firm developing software, marketing plans and finding seed funders for exciting new online ventures, primarily in the healthcare space. </p>\n\n<p>For close to 5 years, I was the Director of Product Management for the nsWebsite, Website Builder tool, web professional and design product suites at Network Solutions. Prior to joining Network Solutions, I managed the strategy for $400M worth of new advertising, lead generation and sales programs utilizing cross-vertical relationships and OEM partnerships at America Online. In 1998, I joined the launch team for CareerBuilder, where I managed marketing and product for the startup, managing the creation, organization, pricing structure, and technical design of the Employer &#8220;Post a Job&#8221; section, the company&#8217;s lead product, taking it from idea to IPO in under 2 years, working with such leading companies as MSN, Bloomberg, NBC, Business Week and USA Today.</p>\n\n<p>In my free time, I try to keep current on the latest design tools, mobile application platforms and intellectual property law and am an avid runner. I am a graduate of the University of Maryland and live in Northern Virginia with my wife and son.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0008/5342/85342v4-max-150x150.jpg"],[[125,156],"assets/images/resized/0008/5342/85342v4-max-250x250.jpg"],[[125,156],"assets/images/resized/0008/5342/85342v4-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.warrendsmith.com","title":"Personal Website"},{"external_url":"http://www.forestisland.com","title":"Forest Island"}]}