{"first_name":"Warren","last_name":"Knight","permalink":"warren-knight","crunchbase_url":"http://www.crunchbase.com/person/warren-knight","homepage_url":"http://www.warrenknight.co.uk","birthplace":"UK","twitter_username":"wvrknight","blog_url":"http://warrenknight.co.uk/blog/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1970,"born_month":6,"born_day":27,"tag_list":"warren-knight, social-commerce, sales, international-business, social-media","alias_list":null,"created_at":"Fri Apr 30 08:53:01 UTC 2010","updated_at":"Fri Apr 30 19:00:37 UTC 2010","overview":"<p>Warren Knight is a Social Commerce Expert and specialises in the global expansion of products, through ecommerce and direct to retail with 18 years experience. Warren&#8217;s entrepreneurial skills started in the music industry at the early age of 19. After receiving a grant from the Princess Youth Business Trust by the age of 22, he started his own music and clothing European Distribution Company. Focusing on sales Warren became the Sales Director of a global stationary and accessory business and for the last 5 years has specialised in consulting for companies that have licenses, patents and branded trademark products.</p>\n\n<p>Warren has worked with the global brands Disney and Nickelodeon, growing a licensee from $5Million to $30Million selling to over 30 countries in a 5-year period achieving $1 Million sales in 1 month. Warren has managed teams of sales and administrational staff, liasing with the factories in China and shipping globally. Warren&#8217;s experience expands further than this, working with products such as Rubik&#8217;s Cube, educational stickers and most recently organic products for human, animal and plant and luxury swimwear.\nSpecialties</p>\n\n<p>Warren is a Social Commerce Expert and specialises in Affiliate Marketing, Ecommerce, Social Media for Business, Global Business growth - The importance of relationships, Cultural buying patterns and breaking down International barriers, Brand recognition - Importance of continuity from a consumers perspective, Sales support and building a strong sales team.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.warrenknight.co.uk","title":""}]}