{"first_name":"Warren","last_name":"Buffett","permalink":"warren-buffett","crunchbase_url":"http://www.crunchbase.com/person/warren-buffett","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Fri Jan 14 21:58:03 UTC 2011","updated_at":"Sat Jan 15 02:43:39 UTC 2011","overview":"<p>Businessman and investor. Born Warren Edward Buffett on August 30,1930, in Omaha, Nebraska. Buffett&#8217;s father Howard worked as stockbroker and served as U.S. Congressman. His mother, Leila Stahl Buffett, was a homemaker. Buffett was the second of three children and the only boy.</p>\n\n<p>Buffett demonstrated a knack for financial and business matters early on in his childhood. Friends and acquaintances have said the young boy was a mathematical prodigy, and was able to add large columns of numbers in his head-a talent he still occasionally shows off to friends and business associates.</p>\n\n<p>Warren often visited his father&#8217;s stockbrokerage shop as a child, and chalked in the stock prices on the blackboard in the office. At 11 years old he made his first investment; he bought three shares of Cities Service Preferred at $38 per share. The stock quickly dropped to only $27, but Buffett held on tenaciously until they reached $40. He sold his shares at a small profit, but regretted the decision when Cities Service shot up to nearly $200 a share. He later cited this experience as an early lesson in patience in investing.</p>\n\n<p>By the age of 13, Buffett was running his own businesses as a paperboy and selling his own horseracing tip sheet. That same year, he filed his first tax return, claiming his bike as a $35 tax deduction.</p>\n\n<p>In 1942, Buffett&#8217;s father was elected to the U.S. House of Representatives, and his family moved to Fredricksburg, Virginia, to be closer to the congressman&#8217;s new post. Buffett attended Woodrow Wilson High School in Washington, D.C., where he continued plotting new ways to make money. During his high school tenure, he and a friend purchased a used pinball machine for $25. They installed it in a Washington, D.C. barbershop and, within a few months, the profits of the machine allowed Buffett and his friend to buy other machines. Buffett owned three machines in three different locations before he sold the business to a War Veteran for $1,200.</p>\n\n<p>Buffett enrolled at the University of Pennsylvania at the age of 16 to study business. He stayed two years, moved to the University of Nebraska to finish up his degree, and emerged from college at age 20 with nearly $10,000 from his childhood businesses.</p>\n\n<p>Buffett attended Columbia University for his advanced degree and in 1956, shortly after graduation, he formed the firm Buffett Partnership in his hometown of Omaha. His investment successes, particularly in buying undervalued companies whose stocks shortly began to rise, made him extremely rich and gained him the sobriquet, &#8220;Oracle of Omaha.&#8221; Other notable career succeses include helping rescue Salomon Brothers from corporate raiders (1987) and taking charge of the New York City house (1992) in the wake of an insider trading scandal.</p>\n\n<p>In June 2006, Buffett made an announcement that he would be giving his entire fortune away to charity, committing 85 percent of it to the Bill and Melinda Gates Foundation. This donation became the largest act of charitable giving in United States history.</p>\n\n<p>The majority of Buffett&#8217;s considerable fortune was amassed through Berkshire Hathaway, a company for which he is the largest shareholder and CEO. Ranked as Forbes&#8217; wealthiest man in 2008, his net worth is estimated at more than $62 billion.</p>","image":{"available_sizes":[[[136,150],"assets/images/resized/0011/7374/117374v1-max-150x150.jpg"],[[226,250],"assets/images/resized/0011/7374/117374v1-max-250x250.jpg"],[[408,450],"assets/images/resized/0011/7374/117374v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}