{"first_name":"Warren","last_name":"Simpson","permalink":"warren-simpson","crunchbase_url":"http://www.crunchbase.com/person/warren-simpson","homepage_url":"","birthplace":"Belfast","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Bytemobile","born_year":1966,"born_month":12,"born_day":25,"tag_list":"","alias_list":null,"created_at":"Mon Oct 20 20:54:43 UTC 2008","updated_at":"Fri Nov 27 22:50:20 UTC 2009","overview":"<p>Warren Simpson is an innovative Telecoms Customer Services veteran who builds and manages large global technical teams, with a unique ability to drive customer satisfaction while producing world class support and delivering on every business metric set for him.</p>\n\n<p>Warren Simpson is responsible for serving and supporting Bytemobile’s worldwide customer base of network operators. He has over 20 years of technical customer support experience in the enterprise hardware, application software and telecommunications sectors, including 10 years of management and team leadership experience in mobile solutions and communications networks. </p>\n\n<p>Since joining Bytemobile he has transformed the Global Support team into an industry and sector leading unit. Customer satisfaction and service excellence has jumped to all time highs at Bytemobile with a global average customer satisfaction score of 4.26 out of 5 with 98% of all customers satisfied with all aspects of support provided.</p>\n\n<p>Before joining Bytemobile in 2008, he spent eight years at Openwave Systems, where he was director of Technical Support for mobile and messaging product lines in Europe, Middle East and Africa; mobile products worldwide; and third-party stack technologies worldwide. At Openwave, he was responsible for more than $20 million in maintenance and support revenue and a staff of over 35 engineers, architects and customer support managers in eight countries. Simpson achieved industry best-in-class customer satisfaction levels regionally, built close customer relationships at the senior management level, negotiated all maintenance and support contracts and renewals, and created value-added services to develop new revenue streams. Prior to Openwave, he held technical support team leadership positions at Northgate Information Systems and McDonnell Douglas. He is based near Belfast, Northern Ireland and directs Bytemobile’s global customer support team in Europe, Asia and North America. Educated in the U.K., he holds a diploma in Technology and Engineering with distinction in Mathematics </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Vice President, Worldwide Customer Support","firm":{"name":"Bytemobile","permalink":"bytemobile","type_of_entity":"company","image":{"available_sizes":[[[150,18],"assets/images/resized/0002/7026/27026v2-max-150x150.png"],[[180,22],"assets/images/resized/0002/7026/27026v2-max-250x250.png"],[[180,22],"assets/images/resized/0002/7026/27026v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}