{"first_name":"Wayne","last_name":"B. Weisman","permalink":"wayne-b-weisman","crunchbase_url":"http://www.crunchbase.com/person/wayne-b-weisman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jun 20 05:44:41 UTC 2009","updated_at":"Sat Jun 20 05:45:13 UTC 2009","overview":"<p>Mr. Weisman has been a member of the investment committee of Vitalife Life Sciences Fund since its inception, and has worked closely with Vitalife since SCP Partners became Vitalife’s U.S. sponsor in 2002. He has extensive experience in venture capital investing, particularly in the life sciences area, dating back to 1990. </p>\n\n<p>Mr. Weisman has been a partner of SCP, a multistage venture capital manager, since its inception in 1996.  He has led SCP’s efforts in the life sciences area, which include investments in Auxilium Pharmaceuticals, Inc. (NASDAQ: AUXL), in which SCP was the first investor, and investments in Deep Breeze Ltd. and Trig Medical, both of which are also Vitalife portfolio companies.  He has also led several other technology investments for SCP.</p>\n\n<p>In 1990, Mr. Weisman joined Churchill Investment Partners, Inc. as a managing director, and later that year became vice president and a member of the board of directors of CIP Capital L.P., a Small Business Investment Company licensed by the SBA in 1991.  Mr. Weisman led many of the successful life science investments made by CIP.</p>\n\n<p>From 1992 to 1994, Mr. Weisman served as executive vice president of Affinity Biotech, Inc., a life science company with drug delivery and pharmaceutical formulation technology.  At Affinity, he was responsible for strategic alliances, financial strategy, and mergers and acquisitions.  Mr. Weisman completed several strategic partnerships for the company, and he ultimately oversaw its IPO and merger into the company that subsequently became IBAH, Inc., a leading clinical research organization, which was then successfully sold to Omnicare Inc.</p>\n\n<p>From 1987 to 1990, Mr. Weisman operated a management and financial advisory firm focusing on the reorganization and turnaround of troubled companies.  He began his career in 1982 at the Philadelphia law firm of Saul, Ewing, Remick &amp; Saul.</p>\n\n<p>Mr. Weisman is a director or chairman of several companies, including CinemaStar, Inc., Gigared S.A., Anystream, Inc., Deep Breeze, Ltd. and Trig Medical, Inc.</p>\n\n<p>Mr. Weisman received his B.A. cum laude from the University of Pennsylvania in 1978 and his J.D. from the University of Michigan Law School in 1982.  He is a former board member of the Greater Philadelphia Venture Group, and he currently serves on the board of the Young Scholars Charter School.</p>","image":{"available_sizes":[[[108,150],"assets/images/resized/0004/9812/49812v1-max-150x150.png"],[[132,183],"assets/images/resized/0004/9812/49812v1-max-250x250.png"],[[132,183],"assets/images/resized/0004/9812/49812v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"SCP Vitalife Partners","permalink":"scp-vitalife-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,70],"assets/images/resized/0004/9810/49810v1-max-150x150.jpg"],[[210,99],"assets/images/resized/0004/9810/49810v1-max-250x250.jpg"],[[210,99],"assets/images/resized/0004/9810/49810v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}