{"first_name":"Web","last_name":"Vastu","permalink":"web-vastu","crunchbase_url":"http://www.crunchbase.com/person/web-vastu","homepage_url":"http://www.webvastu.com/","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"web-vastu, web-vaastu-consultants, webvastu, vastu-website-designing, webvaastu-in-india, website-designing-according-to-vastu, webvastu-consultants, web-vaastu, vastu-shastra-for-websites, vaastu-shastra-for-websites, webvaastu","alias_list":null,"created_at":"Tue May 29 07:24:58 UTC 2012","updated_at":"Sat Jun 02 03:50:00 UTC 2012","overview":"<p>Web Vastu</p>\n\n<p>A website is the image of a person&#8217;s attitude, his perception and about his business too and Vastu is the science of orientation that combines all the five elements of nature and balances them with man and materials.</p>\n\n<p>In the websites, the element in each quadrant must be honored and they should be kept in balance as this creates powerful and beneficial conditions. I have tried to find out that how the orientations, layout, colours, HTML, graphic, fonts, name, Vastu for Website, Answers of Web Vastu, date and time have an effect on the success of any website. </p>\n\n<p>Vaastu is the science of direction that combines all the five elements of nature and balances them with man and materials. It is all about the interaction of various forms of best effect on a living person. It aims to create a subtle conducive atmosphere in a structure in which we can bring the best in ourselves, thereby paving the way for enhanced health, wealth, prosperity and happiness in an enlightened environment. Like any other science, vaastu is universal, rational, practical and utilitarian. It is not a religion but a science. </p>\n\n<p>What is Vastu Shastra? - Vaastu Shastra, Vastu Shastra based on Ancient Science, Indian Vastu Shastra according to The directions - The importance of orientation of a building is not only for saving energy but also to have a better healthy house design, which not only gives comfortable living but also gives good health, prosperity and wealth to the house owners/occupiers and these families. There lies a co-relation between the rotational scenario of the planets and the house design and their different directions with respect of NORTH. The building of any type and its construction meets the purpose if proper orientation has been given using suitable local building material. It increases not only its life span but also improves the condition of occupants. There are instances where buildings are not planned according to required local orientation were lost or deteriorated much faster then the buildings having built with proper studies of orientation. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}