{"first_name":"Wen","last_name":"Hsieh","permalink":"wen-hsieh","crunchbase_url":"http://www.crunchbase.com/person/wen-hsieh","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 28 17:13:44 UTC 2008","updated_at":"Thu May 29 00:09:25 UTC 2008","overview":"<p>Wen Hsieh joined Kleiner Perkins Caufield &amp; Byers in February 2006. His focus areas of investment include Greentech, applications and products enabled by novel materials, and semiconductor technologies.</p>\n\n<p>Prior to KPCB, Wen was an Associate Principal at McKinsey &amp; Co San Francisco and a leader of McKinsey’s Asia Semiconductor Practice. During his 5 years at McKinsey, Wen’s primary focus was on serving leading companies across the global semiconductor value chain. His clients included EDA companies, design houses, wafer fab equipment vendors, automated test equipment vendors, test solution providers, wafer foundries, logic &amp; memory IDMs, PC/server OEMs and component distributors.</p>\n\n<p>At McKinsey, Wen’s secondary focus was on serving small companies in the North America biopharma sector. His clients included companies in the anti-viral, generics and specialty pharma segments.</p>\n\n<p>Wen’s consulting experiences have been in the functional areas of alliance &amp; JV strategies, new business building, growth strategy, low-cost region outsourcing, manufacturing strategy &amp; operations, M&amp;A due-diligence, pre- &amp; post-merger management, pricing &amp; sales programs and R&amp;D strategies.</p>\n\n<p>Before McKinsey, Wen founded OnChip Technologies, a startup developing MEMS microfluidic-based protein chips. The target market was high-sensitivity and high-throughput protein separation and identification applications.</p>\n\n<p>Wen earned a Ph.D. in Electrical Engineering and a Ph.D. Minor in Biology from the California Institute of Technology. He also received a B.S. with Honors and a M.S. in Electrical Engineering from the California Institute of Technology.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Kleiner Perkins Caufield & Byers","permalink":"kleiner-perkins-caufield-byers","type_of_entity":"financial_org","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/0998/10998v8-max-150x150.jpg"],[[250,250],"assets/images/resized/0001/0998/10998v8-max-250x250.jpg"],[[450,450],"assets/images/resized/0001/0998/10998v8-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}