{"first_name":"Werner","last_name":"Breitfuss","permalink":"werner-breitfuss","crunchbase_url":"http://www.crunchbase.com/person/werner-breitfuss","homepage_url":"http://www.wernerbreitfuss.com","birthplace":"Salzburg","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1981,"born_month":4,"born_day":null,"tag_list":"information-retrieval-artificial-intelligence-hypios-phd-paris-director-product-management","alias_list":null,"created_at":"Tue Aug 02 12:00:02 UTC 2011","updated_at":"Fri Oct 12 13:13:27 UTC 2012","overview":"<p>Dr. Werner Breitfuss is the director of product managment at Hypios SAS. After overseeing the development of core technologies at Hypios in the research department  focuses on integrating the developed technologies into new products and manage their product life cycle.</p>\n\n<p>As head of research he was working on Natural Semantic Technologies,Language Processing, Data Mining and Information Retrieval. He oversaw the development of the proprietary technology,  built partnerships with other cooperations and universities, participated in several EU Project consortiums and managed the day-to-day work of the research department.  </p>\n\n<p>Prior to joining Hypios, Werner received a masters in Business Informatics at the University of Vienna and  a PhD in Information Sciences at the University of Tokyo , where he worked on artificial intelligence specializing on embodied virtual agents and human non-verbal behavior . He was also working at the National Institute of Informatics in Tokyo and the University of Tokyo as a joint researcher founded by the Ministry of Sports, Education, Technology and Research.</p>","image":null,"degrees":[{"degree_type":"PhD","subject":"Information Technologies","institution":"The University of Tokyo","graduated_year":2010,"graduated_month":null,"graduated_day":null},{"degree_type":"MSc","subject":"Business Informatics","institution":"Technical University of Vienna","graduated_year":2005,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}