{"first_name":"Wes","last_name":"Mahler","permalink":"wes-mahler","crunchbase_url":"http://www.crunchbase.com/person/wes-mahler","homepage_url":"http://wesmahler.com","birthplace":"Portland, OR","twitter_username":"wesmahler","blog_url":"http://wesmahler.com","blog_feed_url":"http://feeds.feedburner.com/GreatWesNowWhatTheHeckAreYouDoing","affiliation_name":"Tracking202","born_year":null,"born_month":null,"born_day":null,"tag_list":"affiliate","alias_list":null,"created_at":"Fri Jul 18 07:18:52 UTC 2008","updated_at":"Fri Aug 17 14:55:22 UTC 2012","overview":"<p>Wes Mahler is the co-founder of Tracking202, an affiliate pay-per-click (PPC) marketing analytics platform. Mr. Mahler developed Tracking202 as a way to improve his ability to track his own PPC marketing campaigns. After having considerable success with Tracking202, Mr. Mahler released the program to the public at large in early 2008.</p>\n\n<p>Building any kind of business is not an easy task, and the same holds true in the case of affiliate marketing. Wes Mahler, better known as the creator of Tracking 202, knows this about as well as anyone. Mr. Mahler regularly spends over 70 hours per week in his effort to grow Tracking202 into a profitable enterprise. However, his road to successful entrepreneur had many fits and starts.</p>\n\n<p>Mr. Mahler&#8217;s first entrepreneurial enterprise was selling items on eBay when he was in high school which gave him his first taste of being in business online. Around the same time, he also began a car audio installation business which he ran during his spare time. This continued until Mr. Mahler went to college at which point he began to become more engrossed in Internet-based businesses.</p>\n\n<p>Initially, he began by just building websites for other people as a consultant. He was able to earn some extra cash, pick up valuable lessons along the way and then continue to expand into other areas. His next venture was something he calls a &#8220;Craigslist for colleges&#8221; which was designed to be a user centered website. He worked on this project for approximately 9 months until the project had failed.</p>\n\n<p>Moving on from there, Mr. Mahler began to dabble in multilevel marketing. Although not terribly profitable, Mr. Mahler does credit this time period with giving him the ability to improve his personal development, sales, presentation and communication skills. The next logical step, according to him, was to take his newly found personal development ability and use that to sell real state. He pursued this path for approximately 3 to 6 months which led him to working with a friend developing a rental site for college campuses. It was around this time that Mr. Mahler was introduced to the world of affiliate marketing and from that point on he has not looked back.</p>\n\n<p>In 2008, Mr. Mahler released Tracking202, which is one of the most widely used affiliate marketing platforms in the world. The original version is completely free, and recently, they have also introduced a paid version which includes many more robust features than the original one. He continues to grow this business on a daily basis, and what began as a partnership with one other person has mushroomed into a successful small enterprise. This vision is to continue to scale the reach of Tracking202 and expanded beyond simple affiliate marketing to other industries as well.</p>\n\n<p>Wes Mahler is the creator of Tracking202 which is a browser-based, free pay per click tracking platform. It supports all three major search engines (Google, Yahoo and MSN) and is widely used by many very successful affiliate marketers. In addition to his role as Tracking202&#8217;s CEO, Mr. Mahler helps other affiliate marketers grow their own businesses via his support forum on the Tracking202 website and on his personal blog.</p>\n\n<p>In 2009 Tracking202 was acquired by Bloosky Interactive. </p>","image":{"available_sizes":[[[150,113],"assets/images/resized/0004/8547/48547v4-max-150x150.jpg"],[[250,189],"assets/images/resized/0004/8547/48547v4-max-250x250.jpg"],[[450,341],"assets/images/resized/0004/8547/48547v4-max-450x450.jpg"]],"attribution":"<p>Meetup202 ASW 2010</p>"},"degrees":[],"relationships":[{"is_past":true,"title":"CEO, Founder","firm":{"name":"Tracking202","permalink":"prosper202","type_of_entity":"company","image":{"available_sizes":[[[150,26],"assets/images/resized/0002/2345/22345v4-max-150x150.jpg"],[[250,44],"assets/images/resized/0002/2345/22345v4-max-250x250.jpg"],[[287,51],"assets/images/resized/0002/2345/22345v4-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[{"description":"tracking202 was purchased by bloosky\r\n\r\n","stoned_year":2009,"stoned_month":11,"stoned_day":22,"source_url":"http://www.washingtonpost.com/wp-dyn/content/article/2009/11/21/AR2009112101689.html","source_text":null,"source_description":"Bloosky Acquires Tracking202","stoneable_type":"Person","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"first_name":"Wes","last_name":"Mahler","permalink":"wes-mahler"}}],"video_embeds":[],"external_links":[],"web_presences":[]}