{"first_name":"Wijnand","last_name":"van de Calseijde","permalink":"wijnand-van-de-calseijde","crunchbase_url":"http://www.crunchbase.com/person/wijnand-van-de-calseijde","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"eBuddy","born_year":null,"born_month":null,"born_day":null,"tag_list":"ebuddy, instant-messaging, messenger, mobile-messenger, mobile","alias_list":null,"created_at":"Thu Jun 26 21:29:25 UTC 2008","updated_at":"Fri Dec 04 19:24:26 UTC 2009","overview":"<p>Wijnand van de Calseijde joined eBuddy in February 2008 and brings extensive finance, mobile telecommunications and management consulting experience in corporate finance, venture capital and private equity to his role as CFO. Van de Calseijde’s role at eBuddy encompasses the management of all financial activities, internal controls and commercial matters from pricing strategy to negotiation of customer-specific terms and conditions. He also plays a significant role in driving organic growth and acquisitions.</p>\n\n<p>Prior to joining eBuddy, Van de Calseijde was a self-employed management consultant in the United Kingdom with clients including Nomad Digital Ltd, an Amadeus Capital portfolio company, and Arquiva Ltd, where he consulted on Mobile Media Solutions and WIMAX strategy. </p>\n\n<p>Van de Calseijde served as Financial Services Project Manager at Unisys in the Netherlands from 2003-2005, where he developed and presented IT/business strategy and successfully managed a team of insurance specialists, software designers and developers to deliver a re-useable faultless back office data migration solution to ING thereby allowing them to substantially lower their costs.</p>\n\n<p>From 2000 to 2003, Van de Calseijde was an Early Stage Venture Capital Investor and Investment Manager at Twinning in the Netherlands. His responsibilities there included the management portfolio of 6 early stage companies – Bibit Global Payment Services, Knowledge eXchange, Oratrix, in2sports, SemLab and Tryllian – which he supported in areas of cash flow monitoring, financial reporting, technology development and competitive market analysis.\nHe was also charged with business plan assessment, the structure, negotiation and execution of software and e-commerce investment deals, and relationship management of lawyers, shareholders, company management and non-executive directors.</p>\n\n<p>Van de Calseijde’s experience also includes three years spent as a Consultant with Deloitte &amp; Touche, and two years as an Analyst with Andersen Consulting (now Accenture), both in the Netherlands. </p>\n\n<p>Wijnand van de Calseijde has a Masters degree in Finance from the London Business School, specializing in Private Equity and Corporate Finance, and a Masters degree in Computer Science from the Delft University of Technology in the Netherlands. </p>","image":{"available_sizes":[[[150,142],"assets/images/resized/0006/8553/68553v2-max-150x150.jpg"],[[250,238],"assets/images/resized/0006/8553/68553v2-max-250x250.jpg"],[[450,428],"assets/images/resized/0006/8553/68553v2-max-450x450.jpg"]],"attribution":"<p>Mercury Global Partners for eBuddy</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"CFO","firm":{"name":"eBuddy","permalink":"ebuddy","type_of_entity":"company","image":{"available_sizes":[[[150,58],"assets/images/resized/0000/3781/3781v2-max-150x150.jpg"],[[250,98],"assets/images/resized/0000/3781/3781v2-max-250x250.jpg"],[[450,176],"assets/images/resized/0000/3781/3781v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}