{"first_name":"William","last_name":"H. Stover, Jr.","permalink":"william-h-stover-jr","crunchbase_url":"http://www.crunchbase.com/person/william-h-stover-jr","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"YourMembership.com","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Mar 25 20:10:41 UTC 2011","updated_at":"Fri Apr 08 02:15:09 UTC 2011","overview":"<p>As YourMembership.com&#8217;s CEO, president and co-founder, Bill drives the overall direction of the company.</p>\n\n<p>During the mid-1990s Bill served as senior project manager at New Media Publishing (NMP) in Washington, D.C. NMP was a leading developer of websites and applications for major non-profits and corporations around the globe including: The World Wildlife Fund, C.S. Mott Foundation, National Trust for Historic Preservation, The Nature Conservancy, MCI WorldCom and UNICEF. </p>\n\n<p>In 1998 Bill co-founded DataGlyphics Inc., a custom web application and development company with customers that included: Nokia Mobile Phones, Florida Fish &amp; Wildlife Conservation Commission, The Poynter Institute and The Institute for Business &amp; Home Safety. In addition to managing the growth of DataGlyphics&#8217; custom development customers, he focused on in-house product development including the creation and sale of FlashPhotos.com to BPS/Kodak. In 2000 Bill and Hutch Craig organized the spin off of another of DataGlyphics&#8217; creation, called YourAlumni.com, into its own corporation - YourMembership.com Inc.</p>\n\n<p>Today, Bill serves as the CEO and president of YourMembership.com, and his responsibilities include driving the overall direction of the organization and managing the global expansion of YourMembership.com.</p>\n\n<p>Bill earned a bachelor&#8217;s degree in mass media and a minor in economics from Denison University and has been listed in the Who&#8217;s Who in Technology in Tampa Bay 2004, 40 under 40 Rising Stars of 2002, and lead DataGlyphics to winning the 2004 Thomas R. Connolly Technology Company of the Year Award, along with numerous WebAwards and W3 Awards. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO + President","firm":{"name":"YourMembership.com","permalink":"yourmembership-com","type_of_entity":"company","image":{"available_sizes":[[[150,24],"assets/images/resized/0012/9200/129200v2-max-150x150.tiff"],[[250,41],"assets/images/resized/0012/9200/129200v2-max-250x250.tiff"],[[450,74],"assets/images/resized/0012/9200/129200v2-max-450x450.tiff"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}