{"first_name":"Will","last_name":"Coleman","permalink":"will-coleman","crunchbase_url":"http://www.crunchbase.com/person/will-coleman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Nov 06 14:51:16 UTC 2008","updated_at":"Thu Nov 06 16:00:28 UTC 2008","overview":"<p>Will Coleman brings a background in energy-related technology, development, and policy to the MDV team. He focuses on cleantech investments. In addition to investing, Will supports MDV portfolio companies.</p>\n\n<p>Prior to MDV, Will worked in Washington, DC as an advisor to private equity and project finance clients focusing on the energy sector. Will also worked as the legislative director for the New Fuels Alliance (Formerly the Renewable Energy Action Project) where he built state and federal level coalitions to support renewable energy legislation. In 2004, Will was invited to sit on the California Energy Commission&#8217;s Biofuels Working Groups to formulate strategies for reducing California&#8217;s dependence on petroleum. Will has also worked for GE Wind in the commercial operations group, Xseed Capital, and on a variety of renewable energy projects in China, West Africa, and India.</p>\n\n<p>Will is on the Venture Fund Advisory Board for the ASE, which operates the National Renewable Energy Laboratory, and is on the advisory committee for the California Energy Commission&#8217;s Alternative and Renewable Fuel and Vehicle Technology Program, an $840m fund to stimulate deployment of low carbon transportation technologies. Will has also served on the advisory committee for the Western Governors&#8217; Association.</p>\n\n<p>Will has an MBA and an MS in Energy &amp; Resources from the University of California, Berkeley. While at Berkeley Will founded the Berkeley Energy &amp; Resources Collaborative (BERC) and the new Center for Energy &amp; Environmental Innovation (CEEI). Will also earned an AB magna cum laude in Social Studies from Harvard University.</p>","image":{"available_sizes":[[[102,150],"assets/images/resized/0002/7925/27925v4-max-150x150.jpg"],[[166,242],"assets/images/resized/0002/7925/27925v4-max-250x250.jpg"],[[166,242],"assets/images/resized/0002/7925/27925v4-max-450x450.jpg"]],"attribution":"<p>Will Coleman / <a href=\"http://www.mdv.com\" title=\"MDV\" rel=\"nofollow\">MDV</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Partner","firm":{"name":"Mohr Davidow Ventures","permalink":"mohr-davidow-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,58],"assets/images/resized/0001/9292/19292v3-max-150x150.jpg"],[[250,97],"assets/images/resized/0001/9292/19292v3-max-250x250.jpg"],[[450,176],"assets/images/resized/0001/9292/19292v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}