{"first_name":"William","last_name":"Powers","permalink":"william-powers","crunchbase_url":"http://www.crunchbase.com/person/william-powers","homepage_url":"http://williampowers.com","birthplace":"Arizona, US","twitter_username":"HamletsBB","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Tue Sep 25 17:35:18 UTC 2012","updated_at":"Tue Sep 25 17:42:13 UTC 2012","overview":"<p>William Powers was born in Arizona and grew up in Rhode Island. He graduated from Harvard University magna cum laude with a degree in U. S. history and literature, and did graduate study in Spain as a Rotary International Scholar. He began his career as a U.S. Senate staff member working on foreign relations, intelligence and military affairs.\nHe then joined The Washington Post, working initially for Bob Woodward in the investigative unit. He did reporting and research for The Commanders, Woodward’s international bestseller about the first Gulf War.</p>\n\n<p>As a Post staff writer and columnist in the 1990s, Powers covered business, media, politics, popular culture and ideas. His writing has appeared in The Atlantic, The New York Times and many other publications. He created The New Republic’s first media column, and for ten years wrote an influential column on the intersection of media and politics for National Journal.</p>\n\n<p>He has been featured in dozens of major news outlets, including interviews with Katie Couric, NPR, Good Morning America, the PBS NewsHour, CNBC and the BBC, and coverage in The New Yorker, The Wall Street Journal, USA Today, Wired,and The Guardian.</p>\n\n<p>Powers has been a speaker at such high-profile venues as South By Southwest, the Aspen Festival of Ideas, Google and Facebook. Reporting on one of his dynamic presentations, The New York Times called him an “apostle” of the next wave of digital thinking.</p>\n\n<p>He is the author of the New York Times bestseller, Hamlet’s BlackBerry. Widely praised for its insights on the digital future, the book grew out of research he did as a fellow at Harvard’s Shorenstein Center. It has been selected as the Common Read for 2011-2012 at a number of U.S. colleges and universities, and is being translated into many foreign languages.\nPowers is a two-time winner of the National Press Club’s Rowse Award for best American media commentary. He has been a resident fellow at the MacDowell Colony, and studied the technology culture of Japan on a fellowship from the Japan Society of New York.</p>\n\n<p>He lives in Massachusetts with his wife, author Martha Sherrill, and their son.</p>","image":{"available_sizes":[[[150,145],"assets/images/resized/0021/3019/213019v1-max-150x150.png"],[[215,208],"assets/images/resized/0021/3019/213019v1-max-250x250.png"],[[215,208],"assets/images/resized/0021/3019/213019v1-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"BA","subject":"History and Literature","institution":"Harvard","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}