{"first_name":"Will","last_name":"West","permalink":"will-west","crunchbase_url":"http://www.crunchbase.com/person/will-west","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 07 17:18:25 UTC 2008","updated_at":"Wed May 07 17:18:55 UTC 2008","overview":"<p>Will West is chief executive officer of Control4. Since co-founding the company in March of 2003, he has led the Company&#8217;s efforts to create a revolutionary new line of affordable home automation solutions.</p>\n\n<p>Will has raised more than $300 million in private capital to start his last three companies. In 1998, he co-founded STSN (now iBAHN), the worldwide leader in broadband services for business travelers serving millions of customer in thousands of hotels. Prior to founding STSN, Will was CEO, and co-founder of PHAST Corporation. Under his leadership, PHAST became the leading manufacturer of high-end home automation equipment.</p>\n\n<p>Will&#8217;s other professional experience includes Proctor &amp; Gamble, the FSLIC, and Wasatch Advisors. He holds a degree in Finance from the University of Utah, and an MBA from the Wharton School at the University of Pennsylvania. He also holds the CFA designation.</p>\n\n<p>Will serves as chairman of the board of the Utah Capital Investment Corporation (the State of Utah&#8217;s &#8220;Fund of Funds&#8221;). He also served as chairman of the board for Utah Technology Council (UTC). Will is currently on Utah Business Magazine&#8217;s list of the 100 Most Influential People in the state, and on Connect Magazine&#8217;s Top 25. He was named Utah Valley Entrepreneur of the year in 2004 and in 2006 he was named the Ernst &amp; Young Master Entrepreneur Of The Year® in the region. In 2008 he was named the Utah CEO of the Year by the Utah Technology Council.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"Control4","permalink":"control4","type_of_entity":"company","image":{"available_sizes":[[[150,29],"assets/images/resized/0001/8092/18092v1-max-150x150.png"],[[250,49],"assets/images/resized/0001/8092/18092v1-max-250x250.png"],[[251,50],"assets/images/resized/0001/8092/18092v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}