{"first_name":"Will","last_name":"Scully-Power","permalink":"will-scully-power","crunchbase_url":"http://www.crunchbase.com/person/will-scully-power","homepage_url":"http://www.marksydney.com","birthplace":"New London, Connecticut","twitter_username":null,"blog_url":"http://willscullypower.wordpress.com","blog_feed_url":"http://willscullypower.wordpress.com/feed/","affiliation_name":"Unaffiliated","born_year":1980,"born_month":11,"born_day":1,"tag_list":"will-scully-power, william-scully-power, mc-saatchi, mark-agency, mark-sydney","alias_list":null,"created_at":"Sun Nov 30 22:47:30 UTC 2008","updated_at":"Mon Dec 01 06:30:34 UTC 2008","overview":"<p>In only its fifth year of operation, M&amp;C Saatchi’s Digital unit experienced phenomenal growth. This growth has resulted in M&amp;C Saatchi Sydney launching a new agency (Mark.) that merges direct and digital media - and introduces, for the first time for the agency, the discipline of data.</p>\n\n<p>Will is the Data Director at Mark. He focuses on the confluence of data, analytics and optimisation in the World of Advertising!</p>\n\n<p>Will helps his clients navigate the ever-changing marketing technology landscape and develops data-driven marketing, testing and optimisation strategies. Clients include: Optus, Qantas, Woolworths, Westfield, and IAG.</p>\n\n<p>Will is a member of the Australian Direct Marketing Association&#8217;s (ADMA) Data Council, a member of the NSW Council of the Australian Marketing Institute (AMI), a member of the Institute of Analytics Professionals of Australia and is a member of the Australian Interactive Advertising Bureau (IAB) Awards judging panel. Will also is a frequent contributor to Australia&#8217;s top selling advertising magazine, AdNews.</p>\n\n<p>Prior to joining Mark. in 2008, Will spent two years as the General Manager of agency On-Demand. At agency On-Demand, he successfully led the implementation of over 150 customer relationship management (CRM) and Marketing Automation projects. Clients included: Telstra, Vodafone, AAPT, Commonwealth Bank and NRMA.</p>\n\n<p>Prior to agency On-Demand, Will founded and became Managing Partner at MarketingFX, Australia&#8217;s leading boutique agency specialising in outsourced marketing and PR services for hi-tech companies. MarketingFX represented over 50 hi-tech companies and was a member of GlobalFluency, a global alliance of independent technology marketing and public relations firms. GlobalFluency represented more than $60 million in annual billings.</p>\n\n<p>MarketingFX was acquired in 2006. </p>","image":{"available_sizes":[[[150,145],"assets/images/resized/0003/0316/30316v2-max-150x150.jpg"],[[250,242],"assets/images/resized/0003/0316/30316v2-max-250x250.jpg"],[[450,437],"assets/images/resized/0003/0316/30316v2-max-450x450.jpg"]],"attribution":"<p>Will Scully-Power, Data Director, M&amp;C Saatchi / Mark</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/willscullypower","title":"Twitter"},{"external_url":"http://www.linkedin.com/in/willscullypower","title":"LinkedIn"},{"external_url":"http://www.mcsaatchi.com","title":"M&C Saatchi"},{"external_url":"http://www.marksydney.com","title":"Mark Agency"}]}