{"first_name":"William","last_name":"J. Turner","permalink":"william-j-turner","crunchbase_url":"http://www.crunchbase.com/person/william-j-turner","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Nov 30 20:27:25 UTC 2008","updated_at":"Sun Nov 30 20:30:46 UTC 2008","overview":"<p>William Turner co-founded Signature Capital, LLC in 1997 and currently serves as the managing director of the firm. He also serves as a director of multiple private companies including Acoustic Technologies, NetNumber, VIRxSYS, Zounds, Tango Networks, Helium and OurStage. He was formerly chairman of Faroudja, Additech and McCabe &amp; Associates, a director at Handtech.com, and also served as a director of Freddie Mac from 1990 to 2006. Over the last 15 years, he has been involved with management, acquisition, merger or &#8220;hands-on&#8221; investment management of over 75 business units in over 20 different industries.   For most of the 1980&#8217;s, Mr. Turner was president, COO, and a director of Automatic Data Processing (&#8220;ADP&#8221;), which at the time had over $2.0 billion in sales and was the industry leader in the diversified computing and information services industry. At ADP, he personally managed each of the key business units including: Insurance Services, Brokerage Services, Employer Services, Automotive Services, Banking Services, and Accounting Services.   In the late 1980&#8217;s to the mid 1990&#8217;s, Mr. Turner, through Turner &amp; Partners, provided investment banking, strategy and interim operating management services while also serving as a board member, as non-executive chairman, or as temporary chairman and CEO for over 40 diversified private investor-owned business units with combined revenues of over $4 billion in over 20 different market niches. Turner &amp; Partners maintained a key business-affiliation with the leading LBO firm, Forstmann &amp; Little.   Earlier in his career, Mr. Turner held senior positions at Texas Instruments (president of Consumer Electronics) and Digital Equipment (product line manager for computer system products for the commercial markets). He began his career at Sylvania Electronics Systems in 1965, as a scientific systems programmer, working on the Minuteman Missile Training System.   The common thread throughout Mr. Turner&#8217;s career has been his exceptionally high entrepreneurial energy, perseverance and vision. He has focused his considerable skills and insight on developing successful strategies for businesses built around powerful new ideas or discoveries. He charted a career path that brought him ever more challenging business opportunities, more entrepreneurial assignments, and successive opportunities to turn significant new ideas into highly profitable business. Mr. Turner&#8217;s ability to work with the founders of early stage development businesses to guide them to achieve their full potential has led to the recognition of the corresponding financial rewards that come with bringing these industry altering ideas successfully to market.   Mr. Turner received a Bachelors of Arts in mathematics, with honors, from the University of Maine in 1965, and received a Masters of Business Administration from Northeastern in 1969. He lives with his wife, Persis Strong, in Naples, Florida. His two children, Jay and Jennifer, are pursuing careers in San Francisco and Phoenix.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder & Managing Director","firm":{"name":"Signature Capital","permalink":"signature-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,83],"assets/images/resized/0003/0281/30281v1-max-150x150.jpg"],[[250,139],"assets/images/resized/0003/0281/30281v1-max-250x250.jpg"],[[261,146],"assets/images/resized/0003/0281/30281v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}