{"first_name":"Will","last_name":"Hodgman","permalink":"will-hodgman","crunchbase_url":"http://www.crunchbase.com/person/will-hodgman","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 28 21:36:22 UTC 2008","updated_at":"Wed May 28 21:39:28 UTC 2008","overview":"<p>Hodgman co-founded M:Metrics in early 2004. Already, the company represents the industry standard for measurement of consumer consumption of mobile content and applications. As co-founder, president, CEO and director, Hodgman is responsible for the strategic direction of the company.</p>\n\n<p>Prior to M:Metrics, Hodgman was president and CEO of Sightward, Inc., a predictive analytics company. At Sightward he radically shifted the company&#8217;s direction from an enterprise offering to a hosted service, resulting in a profitable sale to Digital Connexxions, a deal Hodgman brokered. Before Sightward, Hodgman was executive vice president of NetRatings, provider of the Nielsen//NetRatings services, where he was responsible for the company&#8217;s product offerings, sales, marketing, measurement science and business development. He came to NetRatings by way of Jupiter Media Metrix, where he served as president of measurement after Jupiter Media Metrix acquired AdRelevance, a company he founded. Today, AdRelevance represents the global standard for online advertising measurement.</p>\n\n<p>Early in his career, Hodgman held executive positions at the largest global marketing communication company, Interpublic Group of Companies. There, he managed advertising for some of the world&#8217;s most well-known brands.</p>\n\n<p>Hodgman is a nationally recognized speaker on the subjects of marketing, advertising, and new media measurement. He is also a director of Hitwise, Inc., a global audience measurement company for the Web, and a member of the Board of Advisors for the Masters Program in Digital Media at the University of Washington.</p>\n\n<p>Hodgman received a bachelor&#8217;s degree in English literature from Williams College. </p>","image":{"available_sizes":[[[97,118],"assets/images/resized/0001/9583/19583v1-max-150x150.png"],[[97,118],"assets/images/resized/0001/9583/19583v1-max-250x250.png"],[[97,118],"assets/images/resized/0001/9583/19583v1-max-450x450.png"]],"attribution":"<p><a href=\"http://mmetrics.com/about/executives.aspx\" title=\"M:Metrics\" rel=\"nofollow\">M:Metrics</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"President & CEO","firm":{"name":"M:Metrics","permalink":"m-metrics","type_of_entity":"company","image":{"available_sizes":[[[150,42],"assets/images/resized/0001/9582/19582v1-max-150x150.png"],[[155,44],"assets/images/resized/0001/9582/19582v1-max-250x250.png"],[[155,44],"assets/images/resized/0001/9582/19582v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}