{"first_name":"William","last_name":"Link","permalink":"william-link","crunchbase_url":"http://www.crunchbase.com/person/william-link","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Feb 02 19:16:44 UTC 2010","updated_at":"Tue Feb 02 19:18:54 UTC 2010","overview":"<p>Bill Link specializes in early-stage investing in medical devices at Versant. Prior to co-founding Versant Ventures, Bill was a general partner at Brentwood Venture Capital. He has a proven record of building and operating large, successful medical product companies. With extensive knowledge of medical devices, particularly in ophthalmology, his operating experience spans more than 23 years in general management in the healthcare industry. </p>\n\n<p>Perhaps Bill’s greatest operational success was as founder, chairman and CEO of Chiron Vision, a subsidiary of Chiron Corporation specializing in ophthalmic surgical products, which was sold to Bausch and Lomb in 1997. Prior to Chiron Vision, Bill founded and served as President of American Medical Optics (AMO), a division of American Hospital Supply Corporation, which was sold to Allergan in 1986. Later Bill served on the Board of AMO’s successor company, Advanced Medical Optics. AMO was acquired by Abbott in 2009. </p>\n\n<p>While at Brentwood, Bill invested in a number of early-stage companies, including eyeonics (sold), Genyx (sold), IntraLase (sold), Intra Therapeutics (sold), and OraMetrix (private). His Versant investments include the following private companies: AcuFocus, Cameron Health, ForSight, Glaukos, Inogen, LenSx, NeoVista, Neurotech Pharmaceuticals, Rox Medical, Second Sight and Wavetec. Bill also serves as a Director of Edwards Lifesciences. </p>\n\n<p>Before entering the healthcare industry, Bill was an Assistant Professor in the Department of Surgery at the Indiana University School of Medicine. Bill earned his Bachelor&#8217;s, Master&#8217;s, and Doctorate degrees in Mechanical Engineering from Purdue University.</p>","image":{"available_sizes":[[[150,34],"assets/images/resized/0007/5810/75810v1-max-150x150.png"],[[250,57],"assets/images/resized/0007/5810/75810v1-max-250x250.png"],[[450,104],"assets/images/resized/0007/5810/75810v1-max-450x450.png"]],"attribution":"<p>Versant Ventures</p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director, Co-Founder","firm":{"name":"Versant Ventures","permalink":"versant-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,90],"assets/images/resized/0004/6455/46455v1-max-150x150.png"],[[161,97],"assets/images/resized/0004/6455/46455v1-max-250x250.png"],[[161,97],"assets/images/resized/0004/6455/46455v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}