{"first_name":"William","last_name":"S. Marshall","permalink":"william-s-marshall","crunchbase_url":"http://www.crunchbase.com/person/william-s-marshall","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Jun 08 07:48:32 UTC 2009","updated_at":"Mon Jun 08 07:50:13 UTC 2009","overview":"<p>William S. Marshall, Ph.D., is miRagen’s President, Chief Executive Officer, Co-Founder and Director. Prior to establishing miRagen, Dr. Marshall was Vice President of Technology and Business Development for Bioscience at Thermo Fisher Scientific. In this role, he was responsible for leading technology assessment and strategic planning for the Thermo Fisher Biosciences Division, a unit with revenues of approximately $1 billion that manufactures and supplies a wide range of products and services across the general-chemistry and life-sciences arenas.</p>\n\n<p>Dr. Marshall was one of the scientific founders of Dharmacon, Inc., which was acquired by Fisher Scientific International, serving as the Executive Vice President for Research and Operations and General Manager. Prior to joining Dharmacon, Dr. Marshall served in many capacities at Amgen, Inc., most recently as Associate Director of Research, Site Head for Research and Head of the Nucleic Acid and Peptide Technology Department. In these positions, he participated in a wide variety of therapeutic development approaches throughout the drug discovery process leading to the development of clinical candidates.</p>\n\n<p>Dr. Marshall received his B.S. in Biochemistry from the University of Wisconsin-Madison and his Ph.D. in Chemistry from the University of Colorado at Boulder in the laboratory of Professor Marvin Caruthers. He is author and co-author of over 50 research papers and 30 patents.</p>","image":{"available_sizes":[[[116,150],"assets/images/resized/0004/7292/47292v1-max-150x150.jpg"],[[136,175],"assets/images/resized/0004/7292/47292v1-max-250x250.jpg"],[[136,175],"assets/images/resized/0004/7292/47292v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President & CEO","firm":{"name":"Miragen Therapeutics","permalink":"miragen-therapeutics","type_of_entity":"company","image":{"available_sizes":[[[150,79],"assets/images/resized/0004/7290/47290v1-max-150x150.jpg"],[[243,129],"assets/images/resized/0004/7290/47290v1-max-250x250.jpg"],[[243,129],"assets/images/resized/0004/7290/47290v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}