{"first_name":"William","last_name":"W. Brooke","permalink":"william-w-brooke-2","crunchbase_url":"http://www.crunchbase.com/person/william-w-brooke-2","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Jun 05 09:07:12 UTC 2009","updated_at":"Fri Jun 05 09:08:30 UTC 2009","overview":"<p>Mr. Brooke is one of the founders of HMC. He serves on the boards of Innovative Biosensors, Maxcyte, Novamin and Optimal Readings, as well as Southeast BIO, Atlanta Venture Forum, Biotechnology Association of Alabama, TechBirmingham and Innovation Depot. Mr. Brooke is also a board observer at nContact Surgical. He has been advising early-stage companies for more than twenty years and previously served on the boards of AV Holdings (Atherotech), Visador, Nationwide Homes and Emageon (NASDAQ: EMAG). He is also a Partner of the Harbinger/Aurora Venture Funds and serves on their Investment Committee and Members’ Advisory Committee. An Executive Vice President and Board member of HMC since its inception, Mr. Brooke initially served as the firm’s General Counsel and later as its Chief Operating Officer. Before joining HMC, Mr. Brooke served as General Counsel of Harbert Corporation. Prior to that role, he was a founder and managing partner of Wallace, Jordan, Ratliff and Brandt, a law firm in Birmingham, AL. He is a guest lecturer on venture capital for the MBA programs at the University of Alabama and the University of Alabama-Birmingham, and he previously served as Chairman of Southeast BIO. He holds a degree in law (J.D.) and a Bachelor of Science degree in Business Management from the University of Alabama, where he currently is a member of the President’s Cabinet and is Chairman of the Board of Visitors of the College of Commerce and Business Administration.</p>","image":{"available_sizes":[[[101,141],"assets/images/resized/0004/6869/46869v1-max-150x150.jpg"],[[101,141],"assets/images/resized/0004/6869/46869v1-max-250x250.jpg"],[[101,141],"assets/images/resized/0004/6869/46869v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Partner","firm":{"name":"Harbert Venture Partners","permalink":"harbert-venture-partners-2","type_of_entity":"financial_org","image":{"available_sizes":[[[50,56],"assets/images/resized/0003/2776/32776v1-max-150x150.png"],[[50,56],"assets/images/resized/0003/2776/32776v1-max-250x250.png"],[[50,56],"assets/images/resized/0003/2776/32776v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}