{"first_name":"Willie","last_name":"Oxendine","permalink":"willie-oxendine","crunchbase_url":"http://www.crunchbase.com/person/willie-oxendine","homepage_url":"http://www.asgaonline.com","birthplace":"Dunedin","twitter_username":"butchoxendine","blog_url":"http://asgaonline.blogspot.com/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1963,"born_month":4,"born_day":9,"tag_list":"butch-oxendine, student-government, asga, sga, asb, asg, student-government-association, national-student-government","alias_list":null,"created_at":"Tue Jul 07 03:00:40 UTC 2009","updated_at":"Fri Jul 10 22:54:59 UTC 2009","overview":"<p>Butch can help with any question you have about Student Government, period. He is the nation&#8217;s #1 Student Government consultant and expert. He&#8217;s executive director of ASGA, publisher and editor in chief of Student Leader, has written three SG-related books, and speaks frequently at the SG conventions nationwide.</p>\n\n<p>Butch was SGA vice president and editor-in-chief of the college newspaper (serving at the same time) at Lake City Community College, then served as SG press secretary and editor of The Campus Leader at the University of Florida.</p>\n\n<p>Named in 1992 as one of the nation&#8217;s top 100 entrepreneurs under age 30 by the Association for Collegiate Entrepreneurs, Butch, 45, has been publishing student-oriented magazines, books, and web sites for more than 25 years. He studied journalism at the University of Florida, but left school in 1984 to work full-time on his first magazine, Florida Leader.</p>\n\n<p>Since then he has launched four other publications, including the national magazine Student Leader. He travels frequently to speak and present leadership seminars and has written three books on student-leadership issues, including So You Want to Be President&#8230;How to Get Elected on Your Campus, Poster Secrets: How &amp; Where to Hang Flyers on Your Campus, and Inspiration for Student Leaders.</p>\n\n<p>Butch is married to Kathy, and they have a daughter, Leah, son Will, twins Adam and Andrew, and also have toddler Luke. Butch enjoys being a Trekker, Firefly, working outdoors, wrestling with the young-&#8216;uns, and cheering for the Florida Gators. </p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0005/2281/52281v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0005/2281/52281v2-max-250x250.jpg"],[[450,298],"assets/images/resized/0005/2281/52281v2-max-450x450.jpg"]],"attribution":"<p>Butch Oxendine</p>"},"degrees":[{"degree_type":"associates of art","subject":"journalism","institution":"Lake City Community College","graduated_year":1983,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/myprofile?trk=hb_side_pro","title":"LinkedIn"}]}