{"first_name":"William","last_name":"Sluss","permalink":"william-sluss","crunchbase_url":"http://www.crunchbase.com/person/william-sluss","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Jan 20 18:41:01 UTC 2011","updated_at":"Thu Jan 20 18:42:31 UTC 2011","overview":"<p>Bill has 20 years experience providing financial, operational and managerial expertise for companies in both the private and public sectors. His background includes experience in the banking, manufacturing, nuclear and logistics industries. Throughout his career he has held various executive positions including Chief Financial Officer (CFO). He has extensive SEC experience including the successful IPO of Heritage Federal Bank, FSB (NYSE) located in Kingsport TN. Bill joined the bank immediately after graduating college in 1990 as an internal auditor. Bill’s hard work and attention to detail quickly caught the attention of senior management at the bank who promoted him to Director of Internal Audit and later to Controller and Treasurer. Bill and the executive team took the bank public and later successfully sold the bank to a larger regional bank which resulted in a significant return for the company’s shareholders.</p>\n\n<p>Bill’s experience after the sale of the bank includes 4 years with Quebecor Printing, one of the world’s largest printers of bibles and text books, and 2 years with Flour City International, a publically traded (Nasdaq) construction/manufacturing company.</p>\n\n<p>In 2002, Bill joined Studsvik, Inc. as its Chief Financial Officer for the US operations. Studsvik is a publically traded nuclear service company (Stockholm Exchange) headquartered in Stockholm, Sweden. In 2006, Bill added to his M&amp;A experience by leading the Studsvik M&amp;A team in the successful acquisition of R.A.C.E., another nuclear service company located in Memphis TN. After the acquisition of R.A.C.E. Bill successfully integrated the Memphis operations with the corporate offices located in Erwin, TN. Bill also served on the Board of Directors of Studsvik Logistics.</p>\n\n<p>Bill has gained extensive experience with IFRS over his career while working for several international companies. In addition, he has worked closely with the world&#8217;s largest accounting firms KPMG and Price Waterhouse Coopers, throughout his career serving as the main contact with these firms. Bill also has extensive experience with the COSO framework and SOX compliance.</p>\n\n<p>Bill received a Bachelor of Science Degree in Accounting from the University of Virginia’s College at Wise in 1990 and became a licensed Certified Public Accountant (CPA) in the same year.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CFO","firm":{"name":"Digital Development Partners","permalink":"digital-development-partners","type_of_entity":"company","image":{"available_sizes":[[[150,41],"assets/images/resized/0011/8238/118238v1-max-150x150.jpg"],[[250,68],"assets/images/resized/0011/8238/118238v1-max-250x250.jpg"],[[385,106],"assets/images/resized/0011/8238/118238v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}