{"first_name":"William","last_name":"D. Lese","permalink":"william-d-lese","crunchbase_url":"http://www.crunchbase.com/person/william-d-lese","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jan 10 12:25:34 UTC 2009","updated_at":"Wed Jun 03 11:16:39 UTC 2009","overview":"<p>William D. Lese has more than 24 years of research, operating and venture capital experience in the energy and environmental businesses. Prior to co-founding Braemar, Mr. Lese was a partner with Mantis Holdings, Inc., a venture capital firm focused on investing in environmental and energy efficiency companies where he concentrated on emerging technologies for converting industrial waste streams into value added products. Prior to Mantis Holdings, he was the Director of Business Development for NPS Industries, Inc., an international manufacturer of engineered equipment for the power industry. Mr. Lese’s business development activities included managing a joint venture with Consolidated Edison Co., and managing other key customer relationships. Prior to joining NPS Industries, he was one of the original employees of Sithe Energies, Inc. (an affiliate of Vivendi, SA), which became one of the world&#8217;s largest independent power producers. At Sithe Energies, Mr. Lese had project and technical oversight responsibilities, including managing several power projects.</p>\n\n<p>Mr. Lese has both chaired and participated on numerous panels focusing on energy technology investment opportunities and major energy issues. He currently serves on the board of directors of Coaltek, Utility Associates, CIRIS Energy, OPX Biotechnologies, Proterro, Solazyme, Renewable Energy Development, Inc., CRB and is Chairman of the Board of Solicore.  He serves as a board observer for Stion, Enerkem and Fractal Systems. Mr. Lese has both a B.A. in Physics and an M.S. in Energy Science from New York University. </p>","image":null,"degrees":[{"degree_type":"M.S.","subject":"Energy Science","institution":"New York University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Braemar Energy Ventures","permalink":"braemar-energy-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,34],"assets/images/resized/0005/1049/51049v1-max-150x150.png"],[[250,57],"assets/images/resized/0005/1049/51049v1-max-250x250.png"],[[262,60],"assets/images/resized/0005/1049/51049v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}