{"first_name":"William","last_name":"B. Witte","permalink":"william-b-witte","crunchbase_url":"http://www.crunchbase.com/person/william-b-witte","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Oct 26 03:23:25 UTC 2012","updated_at":"Fri Oct 26 03:24:42 UTC 2012","overview":"<p>With over 25 years of experience in the financial and capital markets, Mr.  William B. Witte oversees Salem Partners Wealth Management.  Prior to joining the firm, Mr. Witte was the Chief Investment Officer for Caruso Affiliated, managing the investment matters of this private company and three generations of family members.  For approximately 15 years at Caruso, Mr. Witte was in charge of all capital decisions for the company, including strategic and tactical asset allocation, budgeting, forecasting, tax planning, and manager due diligence.  He was also an integral factor in the development of Caruso’s multi-billion dollar real estate portfolio.  Before joining Caruso, Mr. Witte worked in investment banking, corporate banking, private banking, and investment management for UBS, Bankers Trust Company, and Shearson Lehman Brothers.  Mr. Witte has been a long-standing member of the Board of Trustees and has chaired many committees for the House Research Institute (hearing science).  Mr. Witte also serves on the Board of Directors for Front Porch Communities and Services (senior housing), and he has been a guest speaker and panelist at numerous conferences, including ones sponsored by Cal State Northridge and UCLA.  Mr. Witte graduated with top honors (“With Distinction”) from Stanford University with a Bachelor of Science Degree in Petroleum Engineering.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0021/7319/217319v1-max-150x150.jpg"],[[120,150],"assets/images/resized/0021/7319/217319v1-max-250x250.jpg"],[[120,150],"assets/images/resized/0021/7319/217319v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"President","firm":{"name":"Salem Partners","permalink":"salem-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,24],"assets/images/resized/0021/7318/217318v1-max-150x150.jpg"],[[250,40],"assets/images/resized/0021/7318/217318v1-max-250x250.jpg"],[[337,55],"assets/images/resized/0021/7318/217318v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}