{"first_name":"William","last_name":"Almon","permalink":"william-almon","crunchbase_url":"http://www.crunchbase.com/person/william-almon","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Rollbase","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Feb 05 22:41:55 UTC 2008","updated_at":"Sun Oct 21 07:03:48 UTC 2012","overview":"<p>Mr. Almon was the initial angel investor in Rollbase and has served as a board member since August 2007. He also worked with the Rollbase team as Chairman of the Board of Recruitforce.com from 2002 to 2005 until its acquisition by Taleo, which has since been acquired by Oracle. From May 2002 to June 2006 Mr. Almon served as the President, Chief Executive Officer and Chairman of the Board of Grandis, Inc., a solid-state memory company acquired by Samsung Electronics in August 2011. Prior to Grandis, Mr. Almon was Managing Director of Netfish Technology from 1999 to May 2001 when it was acquired by Iona Technologies PLC which has since been acquired by Progress Software. He was Chairman of the Board of Internet Image, an internet software company in 1999 when it merged with Intraware, Inc. In May 1994, Mr. Almon founded and served as Chairman of the Board and Chief Executive Officer of StorMedia, Inc., a manufacturer of thin film disks. From December 1989 until February 1993, Mr. Almon served as President and Chief Operating Officer of Conner Peripherals, Inc., a manufacturer of computer disk drives and storage management devices that was acquired by Seagate in 1996. In 1990 Conner set a record by reaching $1.3 billion in sales in four years, without acquisitions, making it the fastest growing manufacturing start-up in United States history. Prior to Conner Mr. Almon retired from IBM in 1987 after 30 years of service, most recently as Vice President Low End Storage.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Director","firm":{"name":"Rollbase","permalink":"rollbase","type_of_entity":"company","image":{"available_sizes":[[[150,48],"assets/images/resized/0000/1498/1498v5-max-150x150.png"],[[222,72],"assets/images/resized/0000/1498/1498v5-max-250x250.png"],[[222,72],"assets/images/resized/0000/1498/1498v5-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}