{"first_name":"wim","last_name":"tv","permalink":"wim-tv","crunchbase_url":"http://www.crunchbase.com/person/wim-tv","homepage_url":"http://www.wim.tv","birthplace":"","twitter_username":"wim_tv","blog_url":"http://www.wimtvblog.blogspot.com/","blog_feed_url":"http://www.wimtvblog.blogspot.com/","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"wim-tv, create-your-own-web-tv, video-sharing, creare-una-web-tv, web-tv, innovazione, internet, web, piattaforma-video, earn-money, revenues, televisione, internet-television, comunicazione, media, social-media, scambio, videomakers, video-on-demand, fil","alias_list":null,"created_at":"Mon Nov 22 16:11:33 UTC 2010","updated_at":"Wed Dec 08 10:24:00 UTC 2010","overview":"<p>Ever thought of how much the world would change if only you could…? \nwim.tv lets you do exactly that in the world of digital media! </p>\n\n<p>Everybody needs video these days and many companies try to use them to their advantage, but each company has its own needs.</p>\n\n<p>By joining the wim.tv marketplace you become part of a community of entrepreneurs who team up with others like them playing complementary Roles to build innovative value chains that exploit the power of digital technology to implement the business models they have in mind efficiently and profitably. </p>\n\n<p>wim.tv supports the most important media business activities: content creation, advertisement, syndication, agency, TV on the web, media event monitor and transactions, and enables each type of users to do business alone or in conjunction with others in accordance with their own business models.\nProviding customised solutions to companies’ plans to use video for their business is the mission of wim.tv, a startup that offers an innovative platform that can be customised to serve the needs of different players, not just content providers or end users.</p>\n\n<p>Users of the wim.tv platform, each with their own business agendas, work synergistically and efficiently with the platform operator to maximise everybody’s returns.</p>\n\n<p>Registering is easy and for free on www.wim.tv</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0011/1188/111188v2-max-150x150.jpg"],[[250,250],"assets/images/resized/0011/1188/111188v2-max-250x250.jpg"],[[250,250],"assets/images/resized/0011/1188/111188v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.facebook.com/wim.tv","title":"wim.tv fan page"},{"external_url":"http://www.twitter.com/wim_tv","title":"wim.tv on twitter"},{"external_url":"http://www.linkedin.com/groups?mostPopular=&gid=3208822","title":"wim.tv on linkedIn"}]}