{"first_name":"Wojciech","last_name":"Rolecki","permalink":"wojciech-rolecki","crunchbase_url":"http://www.crunchbase.com/person/wojciech-rolecki","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Jan 10 00:46:52 UTC 2010","updated_at":"Fri Aug 05 04:13:05 UTC 2011","overview":"<p>Wojtek is an experienced IT technician, who has been involved deeply in both IT and telecommunication projects. He has been in the IT business since his late high-school years, beginning with networking and setting up Linux servers for small networks and companies. He enrolled in The University of Warsaw (Comp-Sci) and at the same time, started working full-time for a local telecommunications company. During that period, Wojtek was exposed to a very interesting environment, demanding IT knowledge, programming skills and the ability to bring them together in the conservative world of telecommunications. He managed to implement many cost-effective in-house solutions, therefore reducing the amount of company expenditure. Parallel to his university duties, he has been involved in spare-time projects, often with Zbigniew, early before his involvement in blip.pl. Like Robert, he wanted to start creating Mac software since he got his first Mac (proud owner of PowerBook G4). A UNIX philosophy follower, a fast-learner, and a music lover. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Founder and Member of the Board","firm":{"name":"Macoscope","permalink":"macoscope","type_of_entity":"company","image":{"available_sizes":[[[150,75],"assets/images/resized/0007/2795/72795v2-max-150x150.png"],[[158,79],"assets/images/resized/0007/2795/72795v2-max-250x250.png"],[[158,79],"assets/images/resized/0007/2795/72795v2-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}