{"first_name":"Wolf","last_name":"D. Busse","permalink":"wolf-d-busse","crunchbase_url":"http://www.crunchbase.com/person/wolf-d-busse","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Jun 06 14:27:11 UTC 2009","updated_at":"Sat Jun 06 14:51:52 UTC 2009","overview":"<p>Dr. Busse is Venture Partner of NGN Capital since the beginning of 2006. Prior to these positions he was CEO and founder of Aerovance, a spin-out from Bayer Corporation in Berkeley, CA. Dr. Busse complements 20+ years of experience in drug development and discovery including biologics. He served as Senior Vice President in several global functions of Bayer Health Care and subsequently served as General Manager of the Biotechnology Unit of Bayer Healthcare in Berkeley, CA. He was Bayer’s first Pharmaceutical Research Director at West Haven, CT and launched its US Pharma R&amp;D division. During this time he founded Molecular Diagnostics and Molecular Therapeutics, majority owned by Bayer. His organization brought more than 50 clinical drug candidates into development and several important drugs to the market. Dr. Busse has been a global leader for Biotechnology at Bayer, interacting with VC-funded Biotechnology Companies and closing many deals for Bayer including partnerships with Onyx, Arris, Scios, Morphosys and Incyte. Dr. Busse graduated as Chemist and Biochemist at the Technical University of Aachen, Germany, followed by a postdoctoral fellowship in the Biochemistry Department at UC Berkeley. He was appointed Honorary Professor at the German University of Cologne in the Department of Human Genetics teaching Industrial Biotechnology. He was a Board member of Onyx Pharmaceuticals, BIO, CHI and Aerovance.  </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"CEO","firm":{"name":"ACT Biotech","permalink":"act-biotech","type_of_entity":"company","image":{"available_sizes":[[[100,25],"assets/images/resized/0004/7119/47119v1-max-150x150.png"],[[100,25],"assets/images/resized/0004/7119/47119v1-max-250x250.png"],[[100,25],"assets/images/resized/0004/7119/47119v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}