{"first_name":"Wordpress Outsourcin","last_name":"India","permalink":"wordpress-outsourcin-india","crunchbase_url":"http://www.crunchbase.com/person/wordpress-outsourcin-india","homepage_url":"http://www.wordpressoutsourcingindia.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri May 25 13:12:03 UTC 2012","updated_at":"Thu May 31 01:42:44 UTC 2012","overview":"<p>WordPress Outsourcing India is a specialized division of ORB Solutions Pvt. Ltd. (www.orbsystems.com) a leading Open Source Web Development Company headquarter located in New Delhi, India. It has been more then 10 years now and continue to help our clients worldwide in Open Source Development Work, ranging from established companies to SME’s, NGO’s, government organizations etc.</p>\n\n<p>We aim in providing high quality WordPress solutions under one roof, to get your website customized according to your needs. Our sole objective is to provide your business with the most advanced WordPress technologies, to help grow your business leaps and bounds. We cater to all sorts of businesses across the world. Our aim is to offer our clients world class services at an affordable price. Starting from a blogging website speaking volumes about your business to developing larger websites we excel in executing all within no time.</p>\n\n<p>WordPress Outsourcing India has a team of WordPress experts, who have created numerous custom plugin. Our WordPress designers not only design a site but also optimize in accordance with WordPress layout &amp; SEO friendly website. Excellent quality of work is our major USP. Accomplishing every task originates from our eagerness towards the client satisfaction. We value our clients as well as their precious time. We offer a range of WordPress application services of world class quality and at a reasonable price. Timely delivery and high quality are two key elements that motivate us to offer the best in the industry. You can now expand your online business with peace of mind.</p>\n\n<p>WordPress Outsourcing India is specialized in developing custom web development, custom web design solutions, web application development and WordPress design development solution.</p>\n\n<p>Any problem for Contact </p>\n\n<p>Manager Business Development </p>\n\n<p>ORB Solutions Pvt Ltd</p>\n\n<p>Skype:  sanjivkumarsethi; </p>\n\n<p>Yahoo: sanju1522; MSN: sanjiv.gc@hotmail.com</p>\n\n<p>Phone: US 1-646-915-0454 UK 44-208-099-7523 IND +91 11 45141952 </p>\n\n<p>Mobile: +91 9873109260,  </p>\n\n<p>sanjiv@orbsystems.com, www.orbsystems.com </p>\n\n<p>Name : Sanjiv Sethi</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}