{"first_name":"Wu-Fu","last_name":"Chen","permalink":"wu-fu-chen","crunchbase_url":"http://www.crunchbase.com/person/wu-fu-chen","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Genesis Campus","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Jan 21 21:42:48 UTC 2009","updated_at":"Fri May 08 17:49:05 UTC 2009","overview":"<p>Wu-Fu Chen is a renowned serial entrepreneur and top ranked venture capital investor. He is a founding Partner of Acorn Campus (Silicon Valley), Genesis Campus (Dallas Texas) and IdSoft Capital (Taipei, Taiwan). Wu-Fu Chen has also founded more than a dozen high-tech companies that range from optical switching to high-end ATM chip technology. He is perhaps best known as co-founder and VP of Engineering of Cascade Communications, where he steered Cascade through its IPO, being instrumental in the company&#8217;s acquiring more than $10 billion in capitalization. Wu-Fu Chen also co-founded and acted as chairman and CEO of Arris Networks (acquired by Cascade), Ardent (acquired by Cisco) and Shasta (acquired by Nortel). He was also previously Vice President of Technologies at Cisco Systems. </p>\n\n<p>The industry has recognized Wu-Fu Chen&#8217;s operational and entrepreneurial excellence with numerous awards; he has been described as a &#8220;Legend in Silicon Valley&#8221; and was recognized by &#8220;Red Herring&#8221; magazine as one of the &#8220;Top Ten Entrepreneurs of 2000.&#8221; Forbes Magazine consistently ranks him as one of the Top 100 Venture Investors in the U.S. He has been featured on the front page of the &#8220;Wall Street Journal,&#8221; and &#8220;Light Reading&#8221; Magazine once called Wu-Fu Chen the &#8220;most influential person&#8221; in optical networking. </p>\n\n<p>Wu-Fu Chen has a proven track record in identifying key niches, commercializing new technologies, attracting experienced management teams, securing key customers, accessing financing, and executing successful exits. He has early access to a proprietary deal flow based on his long-standing and established industry relationships and reputation. Wu-Fu Chen is actively involved in the development of portfolio companies and plays an important role in attracting deals as well as top talent to Genesis Campus and its portfolio companies. </p>\n\n<p>Wu-Fu Chen is a commanding speaker and university guest lecturer who has delivered keynote speeches to industry associations, conferences and universities worldwide. He is also frequently interviewed by leading publications and media on entrepreneurship and emerging telecom technologies. </p>\n\n<p>Wu-Fu Chen is a member of the Board of Directors in over a dozen companies and public and private institutions. Wu-Fu Chen received an MSEE from the University of Florida in 1976 and a BSEE from National Taiwan University in 1972. From 1976 to 1977 he was in the doctoral program in computer science at UC Berkeley. </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"General Partner","firm":{"name":"Genesis Campus","permalink":"genesis-campus","type_of_entity":"financial_org","image":{"available_sizes":[[[150,52],"assets/images/resized/0003/4738/34738v2-max-150x150.jpg"],[[250,87],"assets/images/resized/0003/4738/34738v2-max-250x250.jpg"],[[450,156],"assets/images/resized/0003/4738/34738v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}