{"first_name":"Xavier","last_name":"Court","permalink":"xavier-court","crunchbase_url":"http://www.crunchbase.com/person/xavier-court","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jan 29 23:41:19 UTC 2009","updated_at":"Thu Jan 29 23:41:19 UTC 2009","overview":"<p>Born in Saint Etienne in 1966, Xavier Court is currently Marketing Director at vente-privee.com. As the head of an international team comprising 30 staff, Xavier coordinates all website activity related to Customer Marketing, Marketing Intelligence, Website Marketing, Press Relations and Advertising Management.</p>\n\n<p>Having graduated from the ESLSCA (Paris) in 1989, Xavier started his career with the Danone group. After 2 years in New York as a marketing manager for Maille mustard, Xavier moved to Paris to become Sales Manager at LU for a 2 year period before becoming the Customer Services Manager at LU for a further 2 years. He finally became the national Key Account Manager for Belin/LU again for 2 years.</p>\n\n<p>In 1997, Xavier helped to form D2i, specializing in major brands destocking. He then co-founded vente-privee.com with his partners in France in 2001. The website is now active in France, Germany, Spain, Italy and the United Kingdom. With a net turnover of 510 million Euros in 2008 and more than 900 employees (with 250 new recruits predicted for 2009) this online shopping club is one of the great success stories of the internet in France and across Europe.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0003/5286/35286v1-max-150x150.jpg"],[[166,250],"assets/images/resized/0003/5286/35286v1-max-250x250.jpg"],[[240,360],"assets/images/resized/0003/5286/35286v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}