{"first_name":"Xiaoming","last_name":"Shao","permalink":"xiaoming-shao","crunchbase_url":"http://www.crunchbase.com/person/xiaoming-shao","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Apr 09 20:31:46 UTC 2010","updated_at":"Fri Apr 09 20:34:09 UTC 2010","overview":"<p>Shao will be reporting in to the recently recruited Denise Colella who has become the company&#8217;s new Chief Revenue Officer and is responsible for all of AudienceScience&#8217;s revenue producing external facing groups, both in the US and globally.</p>\n\n<p>AudienceScience is already working with a number of clients in Japan and Australia and is in the process of establishing a subsidiary in Japan. With online advertising revenues anticipated to grow by 20.1% across Asia Pacific in 2010*, Shao is tasked with driving the adoption and growth of audience-based targeting across the region. </p>\n\n<p>Shao joins from Yahoo! Inc. owned Right Media where, as Director, Strategic Account Management, he was responsible for establishing and managing teams in Hong Kong, London, Singapore and Tokyo to support Yahoo!&#8217;s global adoption of the advertising exchange platform technology and help drive its exchange strategy. </p>\n\n<p>Prior to Right Media, Shao was Manager of Partner Professional Services at Overture Japan (Yahoo! Search Marketing), helping both Yahoo! and its publisher clients monetize their inventory via paid search strategies. </p>\n\n<p>Shao has also worked at DoubleClick Japan as Manager of Sales Engineering.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director, Asia Pacific","firm":{"name":"AudienceScience","permalink":"audiencescience-inc","type_of_entity":"company","image":{"available_sizes":[[[150,36],"assets/images/resized/0003/6811/36811v9-max-150x150.jpg"],[[250,60],"assets/images/resized/0003/6811/36811v9-max-250x250.jpg"],[[450,109],"assets/images/resized/0003/6811/36811v9-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}