{"first_name":"Y","last_name":"Crane","permalink":"y-crane","crunchbase_url":"http://www.crunchbase.com/person/y-crane","homepage_url":"http://www.linkedin.com/in/cleantechglobal","birthplace":"","twitter_username":"cleantechglobal","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"clean-tech, renewable-energy, carbon, vc, pe, china, asia, hong-kong, solar, geothermal, wind, energy-efficiency, methane, css","alias_list":null,"created_at":"Sat Jun 25 07:27:18 UTC 2011","updated_at":"Mon Jun 27 03:22:41 UTC 2011","overview":"<p>Driven, Dynamic, Entrepreneurial, and Asia Focused</p>\n\n<p>Clean Tech, Renewable Energy, Energy Efficiency, Water Treatment, Desalination, Solar/Wind/Geothermal/Hydro, Carbon Credit, Carbon Trading, VC, PE, M&amp;A, investment banking, hedge funds, private placements, securities listing, infrastructure/project financing, FDI &#8211; CHINA Specialist/Focus on Greater China region including Hong Kong and Taiwan</p>\n\n<p>Next Global Stage (NGS) partners with established and respected private investors, lenders and reputable advisors, to provide innovative financial solutions on a global scale. We build relationships across borders and service clients in a variety of industries, and during all stages of development, from startup/ early stage &gt;&gt;&gt; private equity, trade finance, and strategic partnerships for private firms &gt;&gt;&gt; M&amp;A and IPOs in the US, London, Hong Kong, and Singapore.</p>\n\n<p>Direct contacts and experience in the U.S., China, Hong Kong, Taiwan, Israel, Mexico, Canada, Vietnam, Philippines, EU, Thailand, Chile, Brazil, Costa Rica, Dominican Republic, Australia, New Zealand, Argentina, India, Sri Lanka, Cambodia, S. Korea, S. Africa, Morocco, France, UK, Japan, Malaysia, Indonesia and Singapore.\nSpecialties</p>\n\n<p>CleanTech, International finance, private investments, cross-border transactions, M&amp;A, capital raising, and fund raising. China, Hong Kong, Taiwan focus, Asia oriented.</p>","image":{"available_sizes":[[[150,100],"assets/images/resized/0014/0984/140984v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0014/0984/140984v2-max-250x250.jpg"],[[450,300],"assets/images/resized/0014/0984/140984v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}