{"first_name":"Yale","last_name":"R. Brown","permalink":"yale-r-brown","crunchbase_url":"http://www.crunchbase.com/person/yale-r-brown","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Nov 29 21:28:51 UTC 2008","updated_at":"Sat Nov 29 21:29:45 UTC 2008","overview":"<p>Yale assists our portfolio companies with overall strategy, marketing and sales development. Yale has over 25 years of experience in marketing, strategic planning and information technology. Yale is also President of IMS Ventures, a sister company that invests in more developed entrapreneurial enterprises. Yale also founded Intelligent Interactions Corporation in 1995, an Internet direct marketing technology company. He was the President and CEO until Intelligent Interactions was merged with 24/7 Media in 1998. After the merger, Yale served as Executive Vice President of Operations for 24/7 Media and was a member of the board of directors. Prior to founding Intelligent Interactions, Yale held several senior executive positions at Oracle Corporation. Most recently, he served as vice president of Oracle&#8217;s Emerging Technologies Group, where he was responsible for systems integration and implementation of Oracle&#8217;s interactive media technologies worldwide.</p>\n\n<p>Prior to joining Oracle, Yale held senior positions at Price Waterhouse Coopers, and Booz·Allen &amp; Hamilton Inc. and was appointed a Federal Reserve Examiner for the Federal Reserve System. He holds a Masters in Business Administration and Bachelor of Arts in Political Science, both from the George Washington University.</p>\n\n<p>Yale is the co-inventor of U.S. Patent No. 6,026,368, &#8220;An On-Line Interactive System and Method for Providing Content and Advertising Information to a Targeted Set of Viewers.&#8221; </p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Columbus Venture Capital","permalink":"columbus-venture-capital","type_of_entity":"financial_org","image":{"available_sizes":[[[150,10],"assets/images/resized/0003/0184/30184v1-max-150x150.jpg"],[[250,17],"assets/images/resized/0003/0184/30184v1-max-250x250.jpg"],[[450,31],"assets/images/resized/0003/0184/30184v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}