{"first_name":"Yariv","last_name":"Robinson","permalink":"yariv-robinson","crunchbase_url":"http://www.crunchbase.com/person/yariv-robinson","homepage_url":"http://www.ebexchangefunds.com","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"SVB Financial Group","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Aug 05 17:25:04 UTC 2010","updated_at":"Sat Sep 08 12:07:13 UTC 2012","overview":"<p>Mr. Robinson is a partner at EB Financial Group responsible for deal sourcing and investment due diligence.  Yariv brings over 15 years of venture capital, corporate development, and management consulting experience.  Most recently, Yariv was with SVB Financial Group, the leading financial institution serving innovative technology and life sciences companies.  As an integral part of the bank’s Corporate Development team, he worked closely with senior leadership on evaluating domestic and international growth opportunities.  In this capacity, he was involved with the firm’s secondary investment in a €200 million European venture debt fund, and the bank’s investment in SecondMarket, a New-York based broker of illiquid assets.</p>\n\n<p>Prior to joining SVB, Yariv was a Manager with A.T. Kearney, a global management consulting firm.  During his tenure at the firm, his teams tackled a wide range of C-Level issues including growth strategy, supply chain optimization, and corporate sustainability.</p>\n\n<p>Previously, Yariv was a Manager of Proprietary Research at J.D. Power and Associates, a global Market Research firm.  In this position, he led three research teams in defining, translating, and integrating customer requirements into products and services.  Before starting his business career, Yariv was a Counter Intelligence Specialist in the Israeli Air Force.</p>\n\n<p>Mr. Robinson earned his MBA from UCLA, where he was an MDE scholar with the Price Center for Entrepreneurial Studies.  Yariv also holds a bachelor’s degree with a double major in Economics and Political Science from the University of Tel-Aviv.  Yariv also holds a FINRA Series 7 and 63 licenses.</p>","image":{"available_sizes":[[[99,150],"assets/images/resized/0009/6191/96191v2-max-150x150.jpg"],[[165,250],"assets/images/resized/0009/6191/96191v2-max-250x250.jpg"],[[297,450],"assets/images/resized/0009/6191/96191v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":true,"title":"Corporate Development","firm":{"name":"SVB Financial Group","permalink":"svb-financial-group","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}