{"first_name":"Yasir","last_name":"Ballal","permalink":"yasir-ballal","crunchbase_url":"http://www.crunchbase.com/person/yasir-ballal","homepage_url":"","birthplace":"London, UK","twitter_username":"yasir_ballal","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Feb 17 11:57:03 UTC 2011","updated_at":"Tue Jan 10 07:44:11 UTC 2012","overview":"<p>Yasir is arguably the Middle East most qualified guru when it comes to Newsgathering content creation and associated delivery operations in particular within the broadcast enviroment.</p>\n\n<p>This historically stems from the fact that he was the first Arabic speaking to have set up a stellite based contribution network at the advent of the MBC TV in 1996 and has moved to the region when based at the Emirates Media Inc. the corporate body that owns and manages the Abu Dhabi TV. Since then he was instrumental in their acclaimed coverage of the War in Afghanistan when he led a small coverage team into Afghanistan and at times they were the only source of TV footage out of Afghanistan during the US strikes there. If you watched the news then, you would have certainly seen some of the footages his team was bringing out because it was the only source which all newsagency like Reuters and Associated Press were relying on.</p>\n\n<p>Yasir quickly developed in to a new breed of War coverage architects and that was again evident during the war in Iraq where his coverage team at the Abu Dhabi TV had brought about to the world the scale of the war right to their seats and has evidently been instrumental in reflecting the magnitude of the devistation such a might war machine can inflict.</p>\n\n<p>It was rather odd that duing the Iraq war in the winter of 2003 Yasir was simultaneously running both the Newsgatheirng operations at Abu Dhabi TV and that of a then newly set up Al Arabyia News Channel run by the MBC group based at the Dubai MEdia City when he was charged with setting up a newsgathering operation for it.</p>\n\n<p>His work at Al Arabyia was pivotal in its&#8217; speedy branding as a challenger to Aljazeera and the channel during 2003 has run on more than 80% of it&#8217;s airtime purely reliant on content created by his operation which has given Al Arabyia a strong footing among its&#8217; charge as a new competitors namely Aljazeera. It was suffice to say that major news network were subscribing to a feed carrying Alarabyia into the USA and China merely as a news source for them to follow the magnitude of the footage barrage that Al Arabyia was bringing out to its&#8217; viewers.\nYasir Later has set up the Middle East first homegrown newsagency. Middle East News wa owned by the MBC group and it was instrumental in growth of TV platforms in particular in the Gulf and South Asian region. </p>\n\n<p>Yasir has developed unique blend of skills in both content creation and broadcast technology which sets him a bar in the Middle East when it comes to setting up new or re-vamping existing broadcast platforms and has since 2003 been involoved in too many projects to list here.</p>\n\n<p>Yasir was one of the few experts in the region who was selected in 2007 as a board member by the BBC World Service to assist in laying down the foundations for the establishment of the TV platforms within the sevrice.</p>\n\n<p>in 2009 Yasir became the first from the region to be commissioned by the giant european conglormate Mediapro to establish a permenant network of content production and delivery in the MENA region with a core role in producing and delivering content for the groups&#8217; rights holders in particular in sports.</p>\n\n<p>Yasir inclination to lead from the front was also evident in his attempts to empower young talent and adopt new media platforms when he launched in september 2009 the MENA regions&#8217; first web tv, www.daba.tv from Morocco which has proven contrary to his critics a success story. An approach which is recently been adopted by traditional platforms trying to gain audience footing in a region where youth make up more than 50% of the population. </p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com","title":"yasir.ballal"}]}