{"first_name":"Yasmine","last_name":"Mustafa","permalink":"yasmine-mustafa","crunchbase_url":"http://www.crunchbase.com/person/yasmine-mustafa","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Team and a Dream","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Mar 16 20:51:20 UTC 2009","updated_at":"Fri Mar 26 21:25:23 UTC 2010","overview":"<p>Yasmine Mustafa is currently the founder of 123LinkIt.com, a service that creates online tools to help bloggers monetize their blogs through affiliate marketing.</p>\n\n<p>Yasmine graduated from the Temple University Fox School of Business on December of 2006 where she received her Bachelor&#8217;s Degree in Business Administration as an Entrepreneurship major. Besides graduating Magna Cum Laude from Temple, Yasmine is a three-time winner of Temple’s Innovative Idea Competition. She also received &#8220;The Entrepreneurship Award&#8221; - an award given out to one graduate per year to honor the student with the highest GPA in that major. Yasmine left Team and a Dream where she was partner on April 2009. Team and a Dream is a consulting company that provides early-stage Internet companies with virtual teams in a number of areas and shifted to providing online marketing services to small and medium businesses. In addition to running internal operations, she worked with more than two dozen startups amongst varying roles - from strategy to product/brand workshops. In client projects, she focused on online marketing strategy and execution. This included SEO, PPC, social media, blogging, affiliate marketing, etc.</p>\n\n<p>Yasmine also ran the Team and a Dream blog and turned it into one of the top 100k blogs – her blog entries were on the front page of Digg, Delicious and Stumbleupon, some of the most popular social bookmarking online. She also initiated the company’s affiliate marketing program which still generates monthly passive income.</p>\n\n<p>Yasmine was also involved in DreamIT Ventures inaugural year. She served as strategist for Trendient, a sales intelligence and automated promotions tool geared towards online retailers. She also wore many hats at this company ranging from business development, marketing and overall company strategy and direction.  </p>","image":null,"degrees":[{"degree_type":"Bachelor's","subject":"Entrepreneurship & Business Management","institution":"Temple University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder and CEO","firm":{"name":"123LinkIt.com","permalink":"123linkit-com","type_of_entity":"company","image":{"available_sizes":[[[150,31],"assets/images/resized/0008/1973/81973v2-max-150x150.png"],[[250,52],"assets/images/resized/0008/1973/81973v2-max-250x250.png"],[[450,93],"assets/images/resized/0008/1973/81973v2-max-450x450.png"]],"attribution":null}}},{"is_past":false,"title":"","firm":{"name":"Team and a Dream","permalink":"team-and-a-dream","type_of_entity":"company","image":{"available_sizes":[[[150,83],"assets/images/resized/0003/8277/38277v2-max-150x150.jpg"],[[167,93],"assets/images/resized/0003/8277/38277v2-max-250x250.jpg"],[[167,93],"assets/images/resized/0003/8277/38277v2-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}