{"first_name":"Yasunori","last_name":"Kaneko","permalink":"yasunori-kaneko","crunchbase_url":"http://www.crunchbase.com/person/yasunori-kaneko","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Dec 01 06:27:48 UTC 2008","updated_at":"Mon Dec 01 06:30:13 UTC 2008","overview":"<p>Yasunori has been involved in managing and financing US life sciences companies since 1981. He began his career at Genentech (NYSE: DNA), where he spearheaded its business development activities for the first several years. He was then Project Manager for the launch of Protropin® (human growth hormone), the first product marketed by Genentech. In 1987, he became head of corporate finance in the investment banking division of Paribas Capital Markets LTD in Tokyo, where he helped finance Japanese government agencies, municipalities and corporations in the Euro market. He also helped numerous life sciences companies raise capital. He then became Senior Vice President and CFO of Isis Pharmaceuticals (NASDAQ: ISIS), which went public during his tenure there. In 1992, he was recruited to be the original business executive at Tularik (acquired by Amgen in 2004), where at various times he was CFO and VP-Business Development until its public offering in 1999. He served on the board of LeukoSite until its merger with Millennium Pharmaceuticals (NASDAQ: MLNM) in 1999. He received an undergraduate degree from Keio University in Tokyo, a medical degree from Keio University School of Medicine, and an M.B.A. from Stanford Business School. He joined Skyline in 1999. He committed to golf several years ago after an unfortunate heading incident at a team reunion for his junior All-Star soccer team.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0003/0372/30372v1-max-150x150.jpg"],[[240,240],"assets/images/resized/0003/0372/30372v1-max-250x250.jpg"],[[240,240],"assets/images/resized/0003/0372/30372v1-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Managing Director","firm":{"name":"Skyline Ventures","permalink":"skyline-ventures","type_of_entity":"financial_org","image":{"available_sizes":[[[150,32],"assets/images/resized/0003/0323/30323v1-max-150x150.jpg"],[[250,54],"assets/images/resized/0003/0323/30323v1-max-250x250.jpg"],[[450,97],"assets/images/resized/0003/0323/30323v1-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}