{"first_name":"Yo","last_name":"Koga","permalink":"yo-koga","crunchbase_url":"http://www.crunchbase.com/person/yo-koga","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Globespan Capital Partners","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Feb 03 17:26:39 UTC 2010","updated_at":"Mon Jan 30 19:14:37 UTC 2012","overview":"<p>As a Director of Business Development in Globespan&#8217;s Boston office, Yo supports Globespan&#8217;s portfolio companies by expanding their business domain in Asia. Yo, who is passionate about the potential power of disruptive technology and innovation for small companies and entrepreneurs, brings a skillful combination of start-up and management consulting experiences in both Japan and in the US.</p>\n\n<p>Prior to Globespan, Yo was a Marketing Director at scanR, a mobile application start-up in Palo Alto, where he led marketing, product management and Japanese business development. During his time there, he was able to drastically improve the marketing ROI for the product.</p>\n\n<p>While in Japan, Yo was a strategy consultant at Accenture where he helped 16 leading companies, including most of the major Japanese consumer electronics and telecom companies, develop corporate, marketing, and business launch strategies. Working on 21 projects for those companies, often simultaneously, gave Yo a unique exposure to formulating complex business strategies suitable for the Japanese market, and provided important insights for helping US entrepreneurs enter the Asian markets.</p>\n\n<p>An entrepreneur himself, Yo has personally wrestled with the challenges entrepreneurs face and can analyze issues with their perspective in mind. Prior to working with Accenture, Yo co-founded Altovision, a Tokyo-based e-mail marketing startup. He served as both a product manager and engineer.</p>\n\n<p>Yo&#8217;s philosophy is let&#8217;s be disruptive and change the world. The thrill of creating value by starting with nothing is what drives him. &#8220;Creating the unprecedented is fun, because white canvases offer no established rules, no restrictions and exciting chances to create something of value for others.&#8221; It can be difficult to expand into the Japanese market without heavy resource allocation; Yo&#8217;s experiences and pragmatic approach as a management consultant and an entrepreneur in both Japan and the United States is the additional edge that benefits Globespan portfolio companies.</p>\n\n<p>Yo earned a BA in Economics at Meiji University, and holds an MBA from Harvard Business School.</p>","image":{"available_sizes":[[[100,150],"assets/images/resized/0007/6227/76227v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0007/6227/76227v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0007/6227/76227v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"MBA","subject":"Business","institution":"Harvard Business School","graduated_year":2008,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Director","firm":{"name":"Globespan Capital Partners","permalink":"globespan-capital-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,47],"assets/images/resized/0001/9343/19343v8-max-150x150.jpg"],[[250,79],"assets/images/resized/0001/9343/19343v8-max-250x250.jpg"],[[450,142],"assets/images/resized/0001/9343/19343v8-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}