{"first_name":"Yoana","last_name":"Petit","permalink":"yoana-petit","crunchbase_url":"http://www.crunchbase.com/person/yoana-petit","homepage_url":"http://www.CouProm.com","birthplace":"Venezuela","twitter_username":"yoanapetit","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1979,"born_month":5,"born_day":15,"tag_list":"","alias_list":null,"created_at":"Mon Apr 16 17:03:43 UTC 2012","updated_at":"Thu Jul 19 07:44:31 UTC 2012","overview":"<p>Yoana Petit\nCouProm Founder/CEO\nMs. Petit is the conceiver of CouProm, a new financial technology start-up.  CouProm is the natural evolution of a career that has developed and deepened incrementally.  It is the culmination of professional endeavors and interests - the intersection of passion and expertise.  Ms. Petit is an innovative and accomplished serial entrepreneur who has conceived, incubated and led several businesses ranging from food and services provision and real-estate development companies to innovative venture banking and technology start-up companies.  In her capacity as Founder &amp; CEO of CouProm, she leads the conceptual and strategic direction of the company.  She leads operations at the company, as well as the administration of the Board of Directors by advising and informing its members.  She oversees design, technology, marketing, promotion, delivery and quality of programs, products and services; recommends the yearly budget for Board approval and prudently manages the company&#8217;s resources within those budget guidelines; effectively manages the human capital of the company; and assures the company and its mission, programs, products and services are consistently presented in a strong, positive image to relevant stakeholders.  Ms. Petit is also CEO of BP Capital Investment Corp, where she manages a portfolio in real-estate holdings.  Prior to this, she was the Founder and CEO of The Purest Café, where she was responsible for creating and expanding the provision of mobile café’s to public institutions including hospitals, shopping malls and private medical centers.  In 2011, Ms. Petit was recognized by BETABEAT as one of the Top 25 Women in Tech in New York.  Her philanthropic activities include supporting the Memorial Sloan-Kettering Cancer Center, and St. Jude Hospital at which she is a member of the Leadership and Commitment Circle.  Born and raised in Venezuela, Ms. Petit is bi-lingual in English and Spanish.  Ms. Petit obtained her M.B.A. in Financial Logistics in 2007 at Harvard Business School.</p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0018/4434/184434v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0018/4434/184434v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0018/4434/184434v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://Www.couprom.com","title":""}],"web_presences":[]}