{"first_name":"Antonio","last_name":"Benjamin","permalink":"yobie-benjamin","crunchbase_url":"http://www.crunchbase.com/person/yobie-benjamin","homepage_url":"http://www.transactionservices.citigroup.com/transactionservices/home/","birthplace":"","twitter_username":"afbenjamin","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"antonio-benjamin, goodstorm, innovation, social-economic-ecosystems, user-data-concepts-and-theories, gulf-coast-oil-spill, management-consulting, cto, ernst--young, csc, art-for-amnesty","alias_list":null,"created_at":"Sat Jan 24 03:14:25 UTC 2009","updated_at":"Thu Feb 17 05:15:27 UTC 2011","overview":"<p>Antonio Benjamin is an innovator and entrepreneur with deep expertise in web technologies, cloud computing, security and professional services consulting.  Benjamin has led complex transformation and technology initiatives in large finance, health care and government agencies.  Benjamin provides advise to numerous technology start-ups.</p>\n\n<p>Benjamin deeply believes in the power of technology to do good.  He joined an advisory group to NASA AMES Center Director.  Calling himself &#8220;a late comer to the environmental movement&#8221;,  Benjamin developed a deep commitment to helping find solutions to climate change when he saw the science and facts of the global warming from the eyes of NASA&#8217;s data and satellites.  As a Board Trustee to the University of California at Merced, he provides advice and counsel on how to commercialize UCM&#8217;s vast intellectual property portfolio. </p>\n\n<p>Benjamin is recognized expert in information security with a long history of providing professional consulting services on the Internet, INFOSEC, regulatory compliance, application level security, infrastructural and architectural security and privacy matters to large companies and government agencies.</p>\n\n<p>Currently, Antonio Benjamin is the Global Chief Technology Officer for Citigroup / Global Transaction Services / Institutional Clients Group.  Benjamin is also the Chairman of Citi GTS Research Innovation and Development Labs and is a member of the Citi GTS Executive Committee.  </p>\n\n<p>Prior to becoming Citigroup Global Transaction Services Chief Technology Officer, Benjamin was a contract CTO for a significant client of Deloitte (Canada).  Benjamin provided engagement leadership, technology and business consulting services in the development of a customer loyalty program (similar to frequent flier programs).  The project involved a complete review and redesign of cloud-based customer facing and back office/operations experience.  The project integrated Salesforce, Amazon EC2, Amazon Relational Database Service, Amazon S3 and Google Apps development tools, recasting the application architecture, selection of the appropriate cloud computing platform architectures, cloud computing vendor selection, contract negotiation, Internet site security and risk mitigation.  </p>\n\n<p>Benjamin&#8217;s current interests include algorithmically curated software, user data theories and models, analytics software, social economic ecosystems and social network business models.</p>\n\n<p>Benjamin was SVP of Business Development at Zazzle.com, the leading on-demand retail platform for consumers and major brands, offering billions of retail quality, one-of-a-kind products produced within 24 hours. Benjamin was Founder &amp; CEO of a progressive ecommerce company GoodStorm.com which was acquired by Zazzle.com.</p>\n\n<p>Antonio Benjamin was Partner at Ernst and Young, LLP where he was Chief of Strategy, Distinguished Fellow, Chief Technology Officer  Security and Technology Services. After E&amp;Y, Benjamin was Managing Director and Partner of the Business and Technology Risk Management group at Computer Sciences Corporation. Benjamin was also Chief Knowledge Officer and Director of Enterprise Security services at Cambridge Technology Partners&#8217; Management Labs.  Benjamin started his technology career as an Engineer at Lotus Development Corporation.</p>\n\n<p>Antonio Benjamin sits on the Board of Trustees for the University of California at Merced. He is a member of the San Francisco Appreciation Society and the Mariposa Hunters Point Yacht Club. Benjamin speaks English, Filipino, Thai, Lao, Spanish and has a Bachelor of Arts degree from the University of the Philippines.</p>","image":null,"degrees":[{"degree_type":"BA","subject":"Communications","institution":"University of the Philippines","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/in/afbenjamin","title":"LinkedIn Profile Antonio Benjamin"}]}