{"first_name":"Yomi","last_name":"Kastro","permalink":"yomi-kastro","crunchbase_url":"http://www.crunchbase.com/person/yomi-kastro","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Inveon","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Wed May 12 14:09:30 UTC 2010","updated_at":"Thu Dec 29 05:36:22 UTC 2011","overview":"<p>Yomi Kastro is the Managing Partner of Inventures. He was born in 1981 in İzmir. He has been an Internet user, ever since Internet was introduced to Turkey. He developed his first lines of code when he was 11 and has dedicated himself to software and web technologies. Yomi has completed his Bachelors and Masters Degree in Computer Engineering in Bogaziçi University with an honor degree by his performance on software quality.</p>\n\n<p>Wireless networks, electronic security, software engineering and artificial intelligence are among his research topics. His articles about these topics are published in international academic journals. He still continues his academic career pursuing a PhD at Bogazici University in Computer Engineering. His achievements took place in “Who’s Who in the World 2010“ book. In 2011, Yomi Kastro attended the Harvard Business School Executive Education Program for “Private Equity and Venture Capital”. Yomi Kastro has worked in several international firms, including Pfizer. He could not hide the passion of entrepreneurship inside and established Inveon in 2006.</p>\n\n<p>Inveon still holds leadership and uniqueness in various internet ventures and it was selected as “The Most Successful Entrepreneur of The Year” in 2008. Also, one of the most esteemed association of business world and entrepreneurship JCI selected Yomi Kastro as “The Most Successful Young Entrepreneur of the Year” in 2009.</p>\n\n<p>Yomi holds membership in various business and philosophical associations and he mentors students in Bogazici through BUMED. He likes to explore different places in the world by his motorcycle, solve brainteasers and listen to new Age music in his spare time.</p>","image":{"available_sizes":[[[114,150],"assets/images/resized/0016/7910/167910v2-max-150x150.jpg"],[[190,250],"assets/images/resized/0016/7910/167910v2-max-250x250.jpg"],[[268,351],"assets/images/resized/0016/7910/167910v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Co-Founder","firm":{"name":"Inveon","permalink":"inveon","type_of_entity":"company","image":{"available_sizes":[[[150,69],"assets/images/resized/0008/7519/87519v10-max-150x150.jpg"],[[208,96],"assets/images/resized/0008/7519/87519v10-max-250x250.jpg"],[[208,96],"assets/images/resized/0008/7519/87519v10-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}