{"first_name":"Yoram","last_name":"Eliyahu","permalink":"yoram-eliyahu","crunchbase_url":"http://www.crunchbase.com/person/yoram-eliyahu","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1982,"born_month":3,"born_day":15,"tag_list":"","alias_list":null,"created_at":"Tue Aug 14 09:28:28 UTC 2012","updated_at":"Fri Aug 17 09:52:23 UTC 2012","overview":"<p>Yoram Eliyahu</p>\n\n<p>Real estate developer Yoram Eliyahu has come a long way from his roots. And yet, he has never fully abandoned them. Eliyahu was born in a small northern town, Kirat-Shmona, in Israel. Kirat-Shmona lies on the border of the country with Lebanon. While a youth in Israel, Eliyahu learned the values of hard work and dedication from his family. </p>\n\n<p>After high school at a technology and electronics boarding school, two years of post-secondary study and three years of service with the Israel Defense Forces, Eliyahu made his way to the United States. He found himself visiting Crown Heights, a neighborhood in Brooklyn, NY with a large Orthodox Jewish community. There, he met the Rabbi Lubavitch Menachem Mendel Schneerson during a wine ceremony. The Rabbi had a profound impact on him, as did encountering members of the Chabad movement years earlier, during his service with the Israeli army.</p>\n\n<p>When he first came to New York, Yoram Eliyahu took a series of entry-level positions. One of those positions set him on the right career path. He began working with a real estate company in an entry-level sales position. Today, he is a very successful commercial real estate developer. Eliyahu credits his success to the influence of his parents, his upbringing and the Rabbi and Chabad movement.</p>\n\n<p>Though he now calls the United States home, Eliyahu has not forgotten about his native country. Since Kirat-Shmona shares the border with Lebanon, it felt the effects of the Lebanon War particularly heavily. Missile attacks in the town were common. One missile attack destroyed a synagogue and the Torah inside. Eliyahu contributed money to help rebuild the synagogue. But he also realized that re-building was not enough. The Torah needed to be rewritten, by hand, on special parchment. Eliyahu found the person to write the Torah and ensured that it safely arrived at the rebuilt synagogue.</p>\n\n<p>Eliyahu&#8217;s reaches out to those in his new country too. He and his family are members of the Kings Point Chabad. They also work with Chabad of Flushing to provide food to hungry families. Eliyahu and his children personally deliver meals to families so that they have food to put on the table during the holidays.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0020/5934/205934v2-max-150x150.png"],[[250,153],"assets/images/resized/0020/5934/205934v2-max-250x250.png"],[[260,160],"assets/images/resized/0020/5934/205934v2-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}