{"first_name":"YouMint","last_name":"Media Pvt. Ltd.","permalink":"youmint-media-pvt-ltd","crunchbase_url":"http://www.crunchbase.com/person/youmint-media-pvt-ltd","homepage_url":"http://www.youmint.com","birthplace":"","twitter_username":"","blog_url":"http://sendfreesmsinindia.wordpress.com/2012/08/28/33/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"free-sms, send-free-sms, love-sms, free-love-sms, sms","alias_list":null,"created_at":"Wed Aug 29 11:02:08 UTC 2012","updated_at":"Tue Oct 09 21:17:45 UTC 2012","overview":"<p>YouMint.com  is India’s largest online rewards program!</p>\n\n<p>With over 6 million members and growing phenomenally, YouMint is India’s No.1 online rewards program. YouMint was founded in 2008 and has since won several awards including the coveted HSBC SME innovation award, presented to us by Mrs. Naina Lal Kidwai herself.</p>\n\n<p>HSBC YOUMINT AWARD</p>\n\n<p>YouMint is funded by Lloyds Ventures, a multinational investment company with investments in Telecoms and Media across Europe and Asia. Lloyds ventures owns 3 telecom related businesses and works closely with over 400 mobile operators globally i.e more than 60% of all mobile operators in the world!</p>\n\n<p>When you want customers, we want You !</p>\n\n<p>YouMint is a rewards program that delivers. To you, our partners and clients, we deliver quality returns on your investment, unmatched targeting capabilities, and the Internet’s most responsive consumer database: over 6 million emailable members. To our members, we deliver a long-term relationship, reliable customer service, and high-quality offers.</p>\n\n<p>Our dependable, loyal customer base expects to hear about great offers from you. We can target our base using data points and lead-gen offers, so that the only people who see your offer are the ones most likely to respond.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://www.squidoo.com/free-sms-service","title":"Free SMS"}],"web_presences":[{"external_url":"http://www.twitter.com/umint","title":"Free SMS"}]}