{"first_name":"Young","last_name":"Hollywood","permalink":"young-hollywood-3","crunchbase_url":"http://www.crunchbase.com/person/young-hollywood-3","homepage_url":"http://www.younghollywood.com","birthplace":"","twitter_username":"YoungHollywood","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri May 21 20:44:21 UTC 2010","updated_at":"Sun May 23 13:28:39 UTC 2010","overview":"<p>Young Hollywood LLC is a brand-driven, international multimedia entertainment company, founded by R.J. Williams, that creates and distributes celebrity and lifestyle programming globally; owns YoungHollywood.com, a leading entertainment web site; and licenses the Young Hollywood trademark internationally for a range of consumer products and services.</p>\n\n<p>With unprecedented access to the world beyond the velvet rope, Young Hollywood connects audiences with their favorite celebrities on an intimate, personal level that has yet to be captured by any other network. The network boasts a guest list of today’s hottest, most relevant stars. YH has its finger on the pulse and vibe of the next generation. Instead of following trends, Young Hollywood has a reputation for creating them.</p>\n\n<p>The network has created co-branded programming for top tier entities including: Yahoo, Hulu, TV Guide, MySpace and Entertainment Tonight. </p>\n\n<p>In addition, Young Hollywood also works very closely with some of the most well respected brands in the advertising world. YH helps them find innovative ways to touch consumers by creating one of a kind brand integrations and viral marketing campaigns. Through dynamic marketing and aggressive protection of its trademarks, the brand&#8217;s popularity has grown exponentially in a short time.</p>\n\n<p>Additionally, the Young Hollywood brand will soon span licensing, apparel, events, and television with an aggressive push into new lifestyle segments and product offerings.</p>\n\n<p>What Young Hollywood has achieved up to this point in time makes for a compelling story, but even more interesting is where the company and the brand are headed today.</p>","image":{"available_sizes":[[[150,116],"assets/images/resized/0008/8103/88103v2-max-150x150.jpg"],[[250,194],"assets/images/resized/0008/8103/88103v2-max-250x250.jpg"],[[450,350],"assets/images/resized/0008/8103/88103v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.twitter.com/younghollywood","title":"Twitter"},{"external_url":"http://www.facebook.com/younghollywood","title":"Facebook"},{"external_url":"http://www.linkedin.com/pub/young-hollywood/21/6b3/47","title":"LinkedIn"}]}