{"first_name":"Yrsa","last_name":"Nordlicht","permalink":"yrsa-nordlicht","crunchbase_url":"http://www.crunchbase.com/person/yrsa-nordlicht","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Tue Dec 02 04:37:50 UTC 2008","updated_at":"Thu Jun 04 13:57:05 UTC 2009","overview":"<p>Yrsa Nordlicht is the controller for Enterprise Partners. As a CPA with twelve years of finance, accounting and human resource experience in venture capital, public accounting and manufacturing, Yrsa oversees all such functions for the firm. In addition to running the internal operations of the firm, she also conducts financial due diligence on prospective investments, oversees relations with preferred vendors, becomes the acting Controller of incubator companies, and provides various resources to portfolio companies from temporary part-time CFO placement to finding office space. She is also responsible for the quarterly and annual reporting to the Limited Partners. </p>\n\n<p>Before joining Enterprise in February 2000, Yrsa was an audit senior for Deloitte &amp; Touche LLP where she was the recipient of the Best Practices award for advancing the firm’s audit practices. She conducted audits, managed and trained staff, researched complex accounting issues and provided value-added recommendations to improve client operations and efficiency. While at Deloitte &amp; Touche, Yrsa conducted audit work on such companies as Rockwell International, Toshiba America Electronic Components, Cendant Title and Settlement Services, and Cox Communications. </p>\n\n<p>Yrsa earned a B.A. in Industrial Organizational Psychology from Pepperdine University, and completed an emphasis in Accounting at California State University of Long Beach where she was an officer of the Beta Alpha Psi accounting honors society and member of the Beta Gamma Sigma business honors society. </p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0004/6700/46700v1-max-150x150.png"],[[201,201],"assets/images/resized/0004/6700/46700v1-max-250x250.png"],[[201,201],"assets/images/resized/0004/6700/46700v1-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"B.A.","subject":"","institution":"Pepperdine University","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Controller","firm":{"name":"Enterprise Partners","permalink":"enterprise-partners","type_of_entity":"financial_org","image":{"available_sizes":[[[150,50],"assets/images/resized/0003/0632/30632v1-max-150x150.png"],[[225,75],"assets/images/resized/0003/0632/30632v1-max-250x250.png"],[[225,75],"assets/images/resized/0003/0632/30632v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}