{"first_name":"Yurij","last_name":"Riphyak","permalink":"yurij-riphyak","crunchbase_url":"http://www.crunchbase.com/person/yurij-riphyak","homepage_url":"http://www.hubbub.fm","birthplace":"Lviv","twitter_username":"Chumakway","blog_url":"http://blog.hubbub.fm/","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1984,"born_month":4,"born_day":25,"tag_list":"entrepreneur, startup, social-media, innovation, management","alias_list":null,"created_at":"Fri Jul 20 15:35:04 UTC 2012","updated_at":"Mon Jul 23 23:37:45 UTC 2012","overview":"<p>Yurij Riphyak is an economist and innovation entrepreneur with experience in spheres ranging from the organic food industry and public sector to ICT and the highest level political consultancy.</p>\n\n<p>Yurij Riphyak was born in Lviv (Ukraine) in 1984. He has gained master’s degree in pharmacy in Lviv National Medical University in 2007, an international NGO manager certificate at NGO Management School Switzerland in Geneva in 2008, diploma of advisor at Agricultural Consulting in National University of Life and Environmental Sciences in Kyiv in 2009, a certificate in marketing at London School of Economics and Political Sciences in 2009 and a Diploma in Economics, also from LSE in 2012.</p>\n\n<p>Starting his career as a designer in 2000, he has worked as an art-director for an advertising agency in between 2002 and 2004 and as a marketing director for ‘ZIP technologies Ukraine’ between 2006 and 2010. He serviced in an advisory to Ukraine’s President Yushchenko since 2005 till 2010, focusing on agricultural issues and projects in third sector. On 24 February 2010 he has been awarded with Ukrainian national &#8220;Order of Merit Class III&#8221;. Same year Yurij received Chevening scholarship from UK Foreign and Commonwealth Office. In 2009 he has set up “Chumak Way” – a consultancy providing services for NGO and small business. </p>\n\n<p>Besides that Yurij Riphyak is a Communication coordinator of XXXXIII Apimondia International Apicultural Congress to be held in Kyiv in September-October 2013. Since 2010 he works as a secretary for the 40 Foundation. </p>\n\n<p>Yurij joined Hubbub as co-founder and CEO in January 2012.</p>","image":{"available_sizes":[[[144,150],"assets/images/resized/0020/2097/202097v2-max-150x150.jpg"],[[240,250],"assets/images/resized/0020/2097/202097v2-max-250x250.jpg"],[[432,450],"assets/images/resized/0020/2097/202097v2-max-450x450.jpg"]],"attribution":""},"degrees":[{"degree_type":"Diploma","subject":"Economics","institution":"London School of Economics and Political Science","graduated_year":2012,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/pub/yurij-riphyak/18/845/a41","title":"LinkedIn profile"}]}