{"first_name":"Yusuf","last_name":"Uqdah","permalink":"yusuf-uqdah-2","crunchbase_url":"http://www.crunchbase.com/person/yusuf-uqdah-2","homepage_url":"http://tribesandfashion.com","birthplace":"United States","twitter_username":"","blog_url":"http://eaaasyusuf.blogspot.com","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"tribesandfashion-com, yusuf-uqdah, custom-apparel","alias_list":null,"created_at":"Tue May 22 21:24:26 UTC 2012","updated_at":"Thu May 24 14:16:35 UTC 2012","overview":"<p>An alumnus of University of California, Berkeley, Yusuf Uqdah founded Butler Sourcing in 2006. At the age of 25 with less than $1000 in capital, he opened an office in South Pasadena, California as well as Shenzhen, China. Yusuf later led the company in opening an office in Manila, Philippines.\nDespite having opened offices in the Philippines and China, Yusuf still remains committed to the United States as both a market and a source for vendors and employees. </p>\n\n<p>Butler Sourcing primarily focuses in embroidered products and is one of the leading suppliers in the United States for custom embroidered apparel and accessories. In 2011, after gaining remarkable revenue for Butler Sourcing, Yusuf Uqdah began working on Tribes &amp; Fashion which is a new Internet start-up that aims to revolutionize the fashion industry by using his experience in working with highly customized apparel projects with Butler. </p>\n\n<p>Yusuf led a small team of programmers and designers to create a truly unique experience where anyone with an idea has the ability to create their own fashion brand. Tribes &amp; Fashion aims to empower non – designers to create high quality fashion apparels, clothing and accessories. With its early success, Yusuf made a bold move by moving Butler Sourcing under Tribes &amp; Fashion. Starting July 2012, Butler Sourcing’s core business will be completely rebranded and will simply function as a product and service line under Tribes &amp; Fashion.</p>\n\n<p>Key Strengths</p>\n\n<p>Multi-cultural experience with hands on Business experience in the United States, China and the Philippines. Strong Global network with access to local networks and industry experts. Strong knowledge in the Tech Industry, with over 7 successful years of practice.</p>","image":null,"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}