{"first_name":"Yusuf","last_name":"Mehdi","permalink":"yusuf-mehdi","crunchbase_url":"http://www.crunchbase.com/person/yusuf-mehdi","homepage_url":"","birthplace":"","twitter_username":"","blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":"","created_at":"Wed Jul 29 21:26:49 UTC 2009","updated_at":"Tue Feb 08 00:25:19 UTC 2011","overview":"<p>As senior vice president of the Online Audience Business Group at Microsoft Corp., Yusuf Mehdi oversees the team charged with building Microsoft&#8217;s online audience of approximately 500 million unique users through MSN and Microsoft Live Search. The team is responsible for global product management, U.S. marketing execution, strategic partnerships and business development.</p>\n\n<p>Before his current role, Mehdi served as Microsoft&#8217;s chief advertising strategist and senior vice president of Strategic Partnerships. In these capacities, Mehdi led Microsoft&#8217;s advertising strategy for its advertising platforms and negotiated strategic partnerships and large-scale mergers and acquisitions, including the $6 billion (U.S.) purchase of aQuantive Inc.</p>\n\n<p>Previously, Mehdi was responsible for the worldwide online business of MSN, during which time he grew the MSN network to become the most popular destination on the Internet and in turn led the business to its first profitability as a division with U.S. revenues of more than $1.5 billion. He also led an engineering and programming team of 1,800, which released a number of innovative Web services, among them Microsoft&#8217;s first ever Web search offering, Microsoft&#8217;s adCenter advertising platform and the MSN.com publishing platform.</p>\n\n<p>Mehdi was responsible for the marketing of Microsoft Internet Explorer versions 1.0 through 5.0, and under his direction Internet Explorer became the world&#8217;s most popular software for browsing the Web. Mehdi began his career at Microsoft, playing key roles in the launch and marketing of Microsoft Windows, including the notable releases of Windows 3.1 and Windows 95.</p>\n\n<p>Before joining Microsoft in 1992, Mehdi was a product manager at Reuters Group PLC, where he helped roll out the first PC-based Reuters Terminal, which became the standard computing platform for the company.</p>\n\n<p>A native of Washington, Mehdi earned a bachelor&#8217;s degree in economics from Princeton University and an MBA from the University of Washington. He and his wife and three children live in Washington.</p>","image":{"available_sizes":[[[150,115],"assets/images/resized/0005/4673/54673v1-max-150x150.png"],[[215,165],"assets/images/resized/0005/4673/54673v1-max-250x250.png"],[[215,165],"assets/images/resized/0005/4673/54673v1-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"Bachelors","subject":"Economics","institution":"Princeton University","graduated_year":null,"graduated_month":null,"graduated_day":null},{"degree_type":"MBA","subject":"","institution":"University of Washington","graduated_year":null,"graduated_month":null,"graduated_day":null}],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}