{"first_name":"Yuval","last_name":"Tal","permalink":"yuval-tal","crunchbase_url":"http://www.crunchbase.com/person/yuval-tal","homepage_url":"http://www.yuvaltal.us","birthplace":"Israel","twitter_username":"Tal_Yuval","blog_url":"http://www.yuvaltalblog.com/","blog_feed_url":"","affiliation_name":"Payoneer","born_year":null,"born_month":null,"born_day":null,"tag_list":"yuval-tal, ceo, founder, payoneer, payment, business, e-commerce, finance, debit-card, tal-yuval","alias_list":null,"created_at":"Mon Oct 22 12:55:58 UTC 2007","updated_at":"Sat Oct 13 03:44:46 UTC 2012","overview":"<p>Yuval Tal has made quite a difference in the world of business online thanks to the creation of various e-commerce companies, many of which have successfully developed through his co-creation or his additional expertise. He has over 20 years of experience in technological startups, prepaid card applications, and security technology. </p>\n\n<p>Current Work Experience:  </p>\n\n<p>Yuval Tal is the president of the NYC-based Payoneer, the private company he founded in 2005 an served as CEO during 2005-2010. Payoneer establishes viable solutions for payments in prepaid MasterCard® credit cards through the Internet via their prepaid Payoneer credit card.  Instead of using typical banking services, Payoneer allows its members (including many online businesses) to sell products, but pay for their own supplies through an online service. Their technology system is secure, but assures privacy for its customers.  The company is composed of over100 technology and finance expert employees. While based in NY, it also has research and development locations in Israel.</p>\n\n<p>Tal also provides consultation to Payments-r-us, a company started by four e-commerce experts who provide payment processing, merchandising and assorted payment solutions to their customers. The company helps their members find appropriate and free payments solutions.</p>\n\n<p>Past Work Experience: </p>\n\n<p>Before the creation of Payoneer, Tal was a co-founder for E4X Inc., technology and e-commerce payments provider worldwide.  The company was established in 1999 but later changed its name to FiftyOne as it became a global market and e-commerce leader. The company allows its businesses to develop their online sales, marketing, delivery, stock, and transaction capabilities. Its current value is upwards of $500 million. Tal was the acting vice president as part of the business and development sector.  </p>\n\n<p>FiftyOne is an innovative e-commerce solution because it&#8217;s one of the pioneers of the e-commerce movement, allowing online retailers from the US to promote, market, and sell their merchandise using the monetary means of their native country.  This is still significant today in terms of global money orders, payment processes and the international flow of goods from one point to the other.  It&#8217;s no wonder that market retailers like the Anthropologie clothing store, luxury and electronic gift store Brookstone, and Overstock.com have worked with the company.  The company is based in New York, with its research and development operations unit in Israel.</p>\n\n<p>Tal also shined in leadership positions for companies such as R-U-Sure, where he was the chief executive officer, and vice president of business development at Radware, a publically traded company on NASDAQ.</p>\n\n<p>Summits and Conferences:</p>\n\n<p>Yuval Tal has participated in a plethora of affiliate, marketing, and digital-related conferences connected to his kind of work.  At many of the conferences, he was featured as a speaker. The most recent conference is the impressive October 2012 “Apps World”, which he will attend in London. As one of the invited guest speakers, he will tell about the newest technologies in the field of and e-wallets. He will introduce the Payoneer concept, in which companies can issue branded cards and send payments directly into the accounts of the recipients. He also will answer general industry questions and share his thoughts on the future shape of the mobile industry. When he was invited to participate in a panel discussion at Israel&#8217;s Afeka College, he had the opportunity to address many issues that were unclear to the attendees. Among others, the subjects ranged from discussions on the topic of Israel as a “hotbed” in the area of financial innovation, how web based financial start-ups differs from the more traditional start-ups on the web, as in social and media networks, and how the mobile will shape the future. He also dealt head-on with such questions as to the leaders in fintech space, the coming big trends that will take place in the financial tech space, how government and foreign regulations affect business and how to manage the pace of change without being snowed under. Since Tal works with clients at online affiliate networks as part of Payoneer, it&#8217;s no surprise that the hi-tech head shared his knowledge and experience at both the 2009 and 2012 Affiliate Summit conferences. The Affiliate Summit established by Affiliate marketing experts is recognized as the most important event in affiliate marketing. The 2012 Affiliate Summit West Conference event was held last January in Las Vegas. The 2009 Affiliate Summit East Conference was held in New York. At that conference Tal spoke about his affiliate experience working with affiliate agents, heightening Payoneer&#8217;s prowess in e-commerce, and establishing various payment methods through the company.<br/>\nTal was a keynote speaker at two important e-commerce conferences in Israel.  First, he spoke at the one-day Take Charge 2011 Digital Commerce Summit in September 2011, which offers innovative ecommerce concepts for digital companies, vendors and affiliates.  He also spoke at the Track N&#8217; Pay Summit in Tel Aviv, which was hosted by Payoneer.  This one-day conference is based on concepts in Internet and mobile affiliate tracking and payment services.  For both conferences, Tal spoke on behalf of his veteran online, selling, affiliate marketing, and e-commerce work at Payoneer as related to the concepts of each conference. </p>\n\n<p>Personal Experience: </p>\n\n<p>Yuval Tal was born in August 1965 in Israel and still resides there in his home country in a suburb called Ramat HaSharon, located about 20 minutes from the country&#8217;s central city Tel Aviv. It was in Tel Aviv where he received university education after serving in an elite unit in the Israeli Defense Forces.  He received his Bachelor of Science degree in mechanical engineering at Tel Aviv University in 1992. He went on to earn his Masters at Tel Aviv University where he studied biomedical engineering, minor in business administration.</p>\n\n<p>Tal has many hobbies outside the business and e-commerce realm. He likes photography and took five courses in it at the New School for General Studies and the Parsons School of Design, both in New York City. He has also been active in the Tel Aviv Nike Run, a 10 kilometer marathon throughout the city and has participated in a triathlon, which included running, biking, and swimming. </p>","image":{"available_sizes":[[[150,103],"assets/images/resized/0014/5493/145493v2-max-150x150.jpg"],[[250,172],"assets/images/resized/0014/5493/145493v2-max-250x250.jpg"],[[450,310],"assets/images/resized/0014/5493/145493v2-max-450x450.jpg"]],"attribution":"<p>Yuval Tal</p>"},"degrees":[{"degree_type":"BSc","subject":"mechanical engineering","institution":"Tel Aviv University","graduated_year":1992,"graduated_month":null,"graduated_day":null},{"degree_type":"MSc","subject":"biomedical engineering","institution":"Tel Aviv University","graduated_year":1996,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Founder & President","firm":{"name":"Payoneer","permalink":"payoneer","type_of_entity":"company","image":{"available_sizes":[[[150,56],"assets/images/resized/0000/1414/1414v7-max-150x150.jpg"],[[250,94],"assets/images/resized/0000/1414/1414v7-max-250x250.jpg"],[[450,170],"assets/images/resized/0000/1414/1414v7-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"CEO & Founder","firm":{"name":"FiftyOne","permalink":"fiftyone-global-ecommerce","type_of_entity":"company","image":{"available_sizes":[[[150,44],"assets/images/resized/0011/7736/117736v1-max-150x150.jpg"],[[178,53],"assets/images/resized/0011/7736/117736v1-max-250x250.jpg"],[[178,53],"assets/images/resized/0011/7736/117736v1-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"CEO","firm":{"name":"Payments-R-Us Inc.","permalink":"payments-r-us-inc","type_of_entity":"company","image":{"available_sizes":[[[150,29],"assets/images/resized/0006/7599/67599v2-max-150x150.jpg"],[[250,48],"assets/images/resized/0006/7599/67599v2-max-250x250.jpg"],[[283,55],"assets/images/resized/0006/7599/67599v2-max-450x450.jpg"]],"attribution":null}}},{"is_past":true,"title":"vice president of business development","firm":{"name":"Radware","permalink":"radware","type_of_entity":"company","image":null}}],"investments":[{"funding_round":{"round_code":"seed","source_url":"http://www.techcrunch.com/2007/10/22/payoneer-collects-3m-from-greylock-signs-up-istockphoto/","source_description":"TechCrunch","raised_amount":2000000,"raised_currency_code":"USD","funded_year":2005,"funded_month":1,"funded_day":1,"company":{"name":"Payoneer","permalink":"payoneer","image":{"available_sizes":[[[150,56],"assets/images/resized/0000/1414/1414v7-max-150x150.jpg"],[[250,94],"assets/images/resized/0000/1414/1414v7-max-250x250.jpg"],[[450,170],"assets/images/resized/0000/1414/1414v7-max-450x450.jpg"]],"attribution":null}}}},{"funding_round":{"round_code":"seed","source_url":"http://techcrunch.com/2011/11/16/zooz-lands-1-5-million-for-in-app-mobile-payments-solution/","source_description":"ZooZ Lands $1.5 Million For In-App Mobile Payments Solution","raised_amount":1500000,"raised_currency_code":"USD","funded_year":2011,"funded_month":11,"funded_day":1,"company":{"name":"ZooZ","permalink":"zooz","image":{"available_sizes":[[[150,66],"assets/images/resized/0016/2716/162716v1-max-150x150.png"],[[155,69],"assets/images/resized/0016/2716/162716v1-max-250x250.png"],[[155,69],"assets/images/resized/0016/2716/162716v1-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"video_embeds":[{"embed_code":"<iframe width=\"425\" height=\"349\" src=\"http://www.youtube.com/embed/Vpi1BBHzQyI\" frameborder=\"0\" allowfullscreen></iframe>","description":"<p>Yuval Tal in an interview to the news</p>"},{"embed_code":"<iframe width=\"560\" height=\"349\" src=\"http://www.youtube.com/embed/CHfM9VY5BWs\" frameborder=\"0\" allowfullscreen></iframe>","description":"<p>Yuval Tal in an interview about Payoneer</p>"},{"embed_code":"<iframe width=\"420\" height=\"315\" src=\"http://www.youtube.com/embed/VSB_PzGYcxo\" frameborder=\"0\" allowfullscreen></iframe>","description":"<p>Yuval Tal speaks about winning the Paybefore</p>"}],"external_links":[],"web_presences":[{"external_url":"http://www.affiliatesummit.com/yuval-tal/","title":"Yuval Tal - Affilate Summit Speaker"},{"external_url":"http://www.yuvaltal.org/","title":"Yuval Tal On Lookuppage"},{"external_url":"http://eurocheddar.com/2011/05/09/profiles-in-business-yuval-tal-and-the-payment-revolution/","title":"Yuval Tal and the Payment Revolution Article"},{"external_url":"http://www.yuvaltal.biz/","title":"Yuval Tal Businessman"}]}