{"first_name":"Zachary","last_name":"Smulski","permalink":"zachary-smulski","crunchbase_url":"http://www.crunchbase.com/person/zachary-smulski","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Zale Transitions","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Fri Jun 15 00:39:49 UTC 2012","updated_at":"Thu Aug 23 19:20:03 UTC 2012","overview":"<p>Zac is a numbers guy with an MBA and a love for business design.  Business design looks to solve very complex market place and social environmental problems with elegant solutions.  At various times, Zac has been a trainer, writer, researcher, health care macro-economist, and strategic thought leader in Designomics (Sustainable Design Economics).  His area of expertise is health, technology, and wellness, with a focus on start-ups and mid-size companies in transition.  Over the past 20 years, he has helped small and large organizations alike grow organically, compete in rapidly changing marketplaces, deal with difficult economic environments, and manage financial complexities.  As a designer, Zac helps companies enhance market adaptation and customer adoption by crafting innovative ideas, processes, and services through Design Thinking and Designomics. </p>\n\n<p>His professional experience includes providing leadership and strategic thought in the areas of business designs, business plans, medical and clinical administration, health care financing, marketing, and implementation of transformative health care and technology solutions.  He has led successful projects for health care providers, third party payers, government health care programs, and non-profit organizations.  Management experience includes organizational development, strategic planning, Lean implementation, and system application development.</p>\n\n<p>Zac has a MBA from the University of Washington and completed the Hasso Plattner Institute of Design Executive program at Stanford University’s Graduate School of Business. Through involvement on various boards, Zac continue to provide leadership in improving access to health care for all people regardless of income and insurance coverage.</p>","image":null,"degrees":[{"degree_type":"MBA","subject":"Business","institution":"University of Washington","graduated_year":2003,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":false,"title":"Chief Design Officer","firm":{"name":"Zale Transitions","permalink":"zale-transitions","type_of_entity":"company","image":{"available_sizes":[[[141,138],"assets/images/resized/0019/6266/196266v3-max-150x150.jpg"],[[141,138],"assets/images/resized/0019/6266/196266v3-max-250x250.jpg"],[[141,138],"assets/images/resized/0019/6266/196266v3-max-450x450.jpg"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.zaletransitions.com","title":"Zale Transitions"}]}