{"first_name":"Zain","last_name":"Suharwardy","permalink":"zain-suharwardy","crunchbase_url":"http://www.crunchbase.com/person/zain-suharwardy","homepage_url":"http://zalora.com.my","birthplace":"","twitter_username":"zainsuh","blog_url":"","blog_feed_url":"","affiliation_name":"IGI Investment Bank Ltd. ","born_year":1984,"born_month":9,"born_day":1,"tag_list":"zalora, rocket-internet, south-east-asia, malaysia, e-commerce, buying, business-development, operations, start-up","alias_list":null,"created_at":"Fri Oct 05 07:56:05 UTC 2012","updated_at":"Sat Oct 20 03:45:32 UTC 2012","overview":"<p>Entrepreneur-in-Residence at Rocket Internet GmBh&#8217;s South-East Asia venture Zalora.com.my. Part of the senior management involved in buying, business development and operations. </p>\n\n<p>BUYING\n• Leading the Private Label manufacturing efforts for Zalora South East Asia, by coordinating between Zalora teams in the region and manufacturers across the globe. \n• Leading two of the buying teams to increase the number of brands that Zalora Malaysia has on its website.\n• Helping cut costs by sourcing local suppliers to provide products which Zalora Malaysia was initially buying from other countries.\n• Building the Home &amp; Lifestyle category of Zalora Malaysia from scratch by sourcing supplier for various products ranging from Towels to small appliances, lighting products and coffee machines.\n• Negotiating business/payment terms and margins with suppliers, manufacturers and other business partners for Zalora Malaysia.\n• Establishing new relationships with clients and suppliers for Zalora to help built the brand image.\n• Working closely with the brand and marketing teams at Zalora to help negotiate brand partnerships, successfully negotiated partnerships with Nestle, Coffee Bean and Tea Leaf, Samsonite and American Tourister to name a few.\n• Working with the marketing team to promote the visibility of the lifestyle products online</p>\n\n<p>OPERATIONS\n• Interim head of the inbound logistics team and customer returns team at Zalora Malaysia.\n• Redesigning logistics, customer service and operational processes in the Warehouse and helping with the transition to the new Warehouse Management System.\n• Quantitative analysis on customer returns data and inventory data.\n• Recruiting and training new business analysts for the operations department\n• Creating new reporting structures and efficient processes to improve productivity of the WH work force.\n• Managing international orders that Zalora Malaysia placed for buying goods and seeing that they arrive at the WH and subsequently online in a timely manner.</p>","image":{"available_sizes":[[[136,150],"assets/images/resized/0021/4360/214360v2-max-150x150.jpg"],[[227,250],"assets/images/resized/0021/4360/214360v2-max-250x250.jpg"],[[409,450],"assets/images/resized/0021/4360/214360v2-max-450x450.jpg"]],"attribution":"<p>Zain Suharwardy</p>"},"degrees":[{"degree_type":"Masters","subject":"Finance and Investment","institution":"University of Nottingham","graduated_year":2012,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Assistant Vice President","firm":{"name":"IGI Investment Bank Ltd. ","permalink":"igi-investment-bank-ltd","type_of_entity":"financial_org","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://www.linkedin.com/profile/view?id=78795189&trk=tab_pro","title":"Linkedin"},{"external_url":"http://twitter.com/zainsuh","title":"Twitter"}]}