{"first_name":"Zameer","last_name":"Upadhya","permalink":"zameer-upadhya","crunchbase_url":"http://www.crunchbase.com/person/zameer-upadhya","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Mar 03 20:44:04 UTC 2008","updated_at":"Fri Mar 21 07:01:47 UTC 2008","overview":"<p>Prior to BabySpot.com Zameer was Founder and Chief Executive Officer of AMR Consulting Services (AMR). AMR provided CFO services for small businesses and leadership development for professionals and students. Prior to building AMR Zameer was an Auditor with BDO Seidman, LLP where he handled the financial audit for public clientele such as Mastec and Equity One. Zameer began his career with Johnson &amp; Johnson as a Financial Analyst in their prestigious Financial Leadership Development Program. While at Johnson &amp; Johnson he had increasing responsibilities including support of a $120MM Research and Development budget, $180MM Regulatory Affairs Budget, Sales Forecasting for a $3.2B Biotechnology Operating Company, and License and Acquisition due diligence for the Biotechnology sector.</p>\n\n<p>Zameer is a graduate of Florida International University (FIU) and Barry University, both in Miami, Florida, where he earned a Bachelor of Accounting and Bachelor of Biology respectively. While at Barry University, Zameer displayed his leadership as President of the American Medical Students Association. Zameer was also inducted into the prestigious Sigma Xi Scientific Research Honors Society and Tri-Beta, the Biology Research Honors Society. After successful internships at Rice University, the Baylor College of Medicine, Johns Hopkins School of Medicine, and the National Institutes of Health, Zameer made a career change towards accounting.</p>\n\n<p>While at FIU, Zameer founded the student chapter of the Association of Latino Professionals in Finance and Accounting (ALPFA). Under his leadership Zameer grew the student chapter into the largest in the nation. Zameer’s success in this role earned him a position on the National Board as student director and recognition as the National Student of the Year. He was also identified as one of &#8220;Florida&#8217;s Finest&#8221; by Florida Leader magazine. Zameer was also President of Beta Gamma Sigma, the National Business Honors Fraternity - reserved for students graduating in the top 10% of their class . While at FIU, Zameer kept busy with internships at Rachlin, Cohen &amp; Holtz C.P.A.s (Tax), PricewaterhouseCoopers, LLP (Audit) and by operating his own bookkeeping service.</p>\n\n<p>Zameer serves as Chair of the FIU Accounting Association Corporate Advisory Board and charter member of the FIU School of Accounting Executive Affinity Council. His commitment to the University was recognized in the Spring of 2005, Fall 2006, and Spring 2007 as the Most Supportive Business Professional. Previously, Zameer served as President of the ALPFA Miami Chapter and grew the organization from 250 to 700 members, making it the 2nd largest chapter. For his efforts Zameer was recognized as the National Most Promising Business Professional of the Year, the youngest recipient of this award. This continued success enabled Zameer to earn a second tour of duty on the ALPFA National Board as South Region Director. As South Region Director, he is responsible for the Atlanta, Charlotte, Miami, Orlando, Puerto Rico, and Tampa Chapters. Zameer is also a charter member of the Business Advisory Board for Miami Edison Senior High School (an inner-city high school in Miami).</p>","image":{"available_sizes":[[[126,150],"assets/images/resized/0001/4337/14337v1-max-150x150.png"],[[211,250],"assets/images/resized/0001/4337/14337v1-max-250x250.png"],[[253,299],"assets/images/resized/0001/4337/14337v1-max-450x450.png"]],"attribution":""},"degrees":[],"relationships":[{"is_past":null,"title":"Co-Founder and CEO","firm":{"name":"BabySpot","permalink":"babyspot","type_of_entity":"company","image":{"available_sizes":[[[150,28],"assets/images/resized/0001/4331/14331v1-max-150x150.png"],[[223,42],"assets/images/resized/0001/4331/14331v1-max-250x250.png"],[[223,42],"assets/images/resized/0001/4331/14331v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}