{"first_name":"Zander","last_name":"Freund","permalink":"zander-freund","crunchbase_url":"http://www.crunchbase.com/person/zander-freund","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Bleacher Report","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Mar 25 19:40:19 UTC 2008","updated_at":"Thu Jun 14 19:13:23 UTC 2012","overview":"<p>I am a Co-Founder and former Community GM of Bleacher Report, the web&#8217;s 4th largest online sports media property and the first ever fan-generated sports network.</p>\n\n<p>The website currently attracts over 27 million monthly readers, publishes over 1000 DAILY pieces of thoroughly filtered, insightful editorials from a variety of increasingly notable sports writers and bloggers, has raised over $40M in venture financing, and as of May 2012 is on pace to generate annual revenues vastly exceeding all expectation.</p>\n\n<p>For my work at Bleacher Report, BusinessWeek named me one of their Top Young Entrepreneurs of the Year in both 2008 and 2009:</p>\n\n<p>http://images.businessweek.com/ss/09/10/1009<em>alums</em>roundup/7.htm</p>\n\n<p>http://images.businessweek.com/ss/09/04/0421<em>best</em>young_entrepreneurs/10.htm</p>\n\n<p>The company meanwhile was recently named by Business Insider as one of &#8220;11 Startups That Could Get Bought for $1 Billion Tomorrow&#8221;:</p>\n\n<p>http://www.businessinsider.com/startups-with-billion-dollar-valuations-2012-4#bleacher-report-would-be-a-good-addition-to-yahoo-sports-aol-could-also-use-a-sports-section-8</p>\n\n<p>&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8211;</p>\n\n<p>Starting work on the company with three childhood friends in the summer of 2005, I left Bleacher Report as a full-time employee in November of 2009 to pursue other personal and professional interests.  </p>\n\n<p>I of course retain my rights as a major stockholder of the company—but more importantly, I have also maintained strong personal relationships to date with the rest of the founding team, as well as early employees who have stuck around for the long haul, loyal value-add investors, and even more recently hired executives.  I am also available to the company as an Advisor on a need-be basis.</p>\n\n<p>During my tenture as Bleacher Report&#8217;s Community GM, my goal was to &#8220;humanize&#8221; the product for an initially insecure and unproven group of sports fans—whom in the Founders eyes clearly demonstrated vast insight into their favorite teams and sports and a talent for the written word.  </p>\n\n<p>What they lacked was the rolodex, work experience, or educational degree to effectively break into a declining world of traditional sports media whereby paid writing gigs were increasingly more difficult to come by.  What sports readers meanwhile lacked was daily editorial coverage of their favorite teams and players that by nature conventional media sources were incapable of generating through more traditional, non-scalable content models.</p>\n\n<p>As such, the dream of Bleacher Report was born—a life-changing mission and journey which continues to this day despite no longer being involved operationally. </p>\n\n<p>The single contribution I remain most proud of is leveraging my leadership position as one of the network&#8217;s Co-Founders to establish, and consistently re-enforce, a common set of values into a community that could not afford to leave a single user beyond but which has consistently grown virally in both membership and readership throughout its long history.</p>\n\n<p>Emerging as the &#8220;face&#8221; of the initial Bleacher Report membership, I worked tirelessly to lead by example in humanizing the product and and setting the parameters for engagement on the network.  In this role I learned numerous invaluable lessons as to which circumstances dictate a style of leadership best served by displaying credibility as a knowledgeable, passionate source within the medium of the product—and which circumstances demand a leader who can rise above the noise and be respective by the connoisseur of the medium at large as charismatic, fair, and objective.</p>\n\n<p>The Bleacher Report Community ethos which can be seen throughout the network today (despite my absence) continues to foster respectful and intelligent debate, constructive peer criticism, and a pay-it-forward attitude in showing new users the ropes.  This serves as a unique and desirable destination for aspiring contributors who simply want to talk sports straight up, 24/7—especially when compared to the sense of disillusionment and discouragement one often feels after investing time expressing their sporting opinions, allegiances, and identity via traditional forums and undergoing the miserable process of scrolling through comments filled with fan hatred based purely on geography, and needless personal attacks towards a contributor.</p>\n\n<p>&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8211;</p>\n\n<p>My experience as a first-time entrepreneur and leader of the Bleacher Report Community let to me starting Dart Frog Advisors in October 2010, whereby I play the role of Advisor, Consultant, Mentor, and Part-Time Co-Founder to other young entrepreneurs, leaders, and artists.  </p>\n\n<p>I served extensively as a Consultant and Advisor to Pinchit.com, helping to shape the long-term vision of the company&#8217;s product and develop of an execution plan for bringing that long-term vision to life.</p>\n\n<p>I also worked with a contracted developer/designer as lead Product Manager in architecting and launching a website dedicated to launching my mother&#8217;s recently published memoir and serving as a hub for general fans of her writing:</p>\n\n<p>http://www.lindagraysexton.com</p>\n\n<p>More recently I have shifted gears to music, signing aboard as a Founding Advisor and angel investor to Spins.FM, a social media based platform that makes it fun and easy to request songs on the radio.  The Founder of the website is a natural born leader and innovator and I am in the process of helping him raise a large seed/small Series A round.  </p>\n\n<p>Current advertising revenues for artists still show that FM radio is king, but also suggest that streaming services will continue to cut into their market.  Thus it is my belief that SpinsFM can be for FM radio what Itunes was for online music sharing.</p>\n\n<p>Radio companies may naturally have negative feelings towards social media products, but we&#8217;ve had great success thus far in converting major station syndicators to adapt our products.  We believe that FM radio is here to stay—but that Spins.FM is needed to allow the medium to adapt to a world increasingly based on the web.</p>\n\n<p>Thus please feel free to reach out to me should you have any potential interested in investing in this great company.   </p>\n\n<p>Finally, I had the recent pleasure a few months ago of participating in the recent acquisition of of the Staten Island Yankees minor league ball club in New York:</p>\n\n<p>http://www.silive.com/siyankees/index.ssf/2011/10/staten<em>island</em>yankees<em>sold</em>to.html</p>\n\n<p>The team just so happened to win the World Series immediately after the purchase, and thus I now can accompany my casual attire at parties with a piece of jewelry that looks virtually identical to that of a New York Yankees MLB World Series ring.  Definitely a great conversation starter :)  </p>\n\n<p>Much more importantly, as a limited partner I would love to show any of you baseball fans in the New York Area around the ball park—or owners box—the next time I&#8217;m in town! </p>\n\n<p>&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8211;</p>\n\n<p>Before Bleacher Report, I produced and wrote screenplays for two feature length, independent documentaries. </p>\n\n<p>Originally hoping to be involved in politics and law, I graduated Cum Laude from Connecticut College in 2006 with a B.A. in Government, and was inducted as a member of Pi Sigma Alpha, the National Political Science Honors Society.</p>","image":{"available_sizes":[[[111,150],"assets/images/resized/0019/1656/191656v2-max-150x150.png"],[[186,250],"assets/images/resized/0019/1656/191656v2-max-250x250.png"],[[335,450],"assets/images/resized/0019/1656/191656v2-max-450x450.png"]],"attribution":""},"degrees":[{"degree_type":"High School","subject":"","institution":"Menlo School","graduated_year":2001,"graduated_month":null,"graduated_day":null},{"degree_type":"Cum Laude; Distinction in Major Field of Study; Pi Sigma Alpha (Political Science Honors Society) ","subject":"B.A. in Government","institution":"Connecticut College","graduated_year":2006,"graduated_month":null,"graduated_day":null}],"relationships":[{"is_past":true,"title":"Co-Founder & Community GM","firm":{"name":"Bleacher Report","permalink":"bleacher-report","type_of_entity":"company","image":{"available_sizes":[[[150,32],"assets/images/resized/0001/4181/14181v5-max-150x150.png"],[[250,54],"assets/images/resized/0001/4181/14181v5-max-250x250.png"],[[250,54],"assets/images/resized/0001/4181/14181v5-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Entrepreneurial Mentor","firm":{"name":"Dart Frog Advisors","permalink":"dart-frog-advisors","type_of_entity":"company","image":null}},{"is_past":true,"title":"Consultant & Advisor","firm":{"name":"Pinchit.com","permalink":"pinchit-com","type_of_entity":"company","image":null}},{"is_past":true,"title":"Product Manager","firm":{"name":"LindaGraySexton.com","permalink":"lindagraysexton-com","type_of_entity":"company","image":null}},{"is_past":true,"title":"Founding Advisor & Angel Investor","firm":{"name":"Spins.FM","permalink":"spins-fm","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}