{"first_name":"Ze'Ev","last_name":"Drori","permalink":"ze-ev-drori","crunchbase_url":"http://www.crunchbase.com/person/ze-ev-drori","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Tesla Motors","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Mon Dec 24 05:42:10 UTC 2007","updated_at":"Thu Oct 16 01:29:33 UTC 2008","overview":"<p>As of October 2008 Ze&#8217;ev Drori is on the board of directors and Vice Chairman of Tesla. Prior to this position, he was the President and CEO.</p>\n\n<p>He is a successful high-tech entrepreneur and an experienced chief executive with the proven ability to create and manage companies with innovative products in both the high-tech and automotive sectors. He has more than 30 years of continual success and has demonstrated the ability to lead a company from conception to profitability and public offering.</p>\n\n<p>The first company he founded was Monolithic Memories, a Silicon Valley semiconductor firm that pioneered fundamental advances in memory and logic technology, before being acquired by Advanced Micro Devices in 1987. Under his leadership, Monolithic introduced programmable read-only memory (PROM) and programmable array logic (PAL), which revolutionized many aspects of computer and electronic systems technology. As CEO through 1981, Ze’ev was responsible for R&amp;D, manufacturing, marketing, finance, worldwide sales and overseas operations for product assembly. Ze’ev served as chairman of the board from 1981 through 1987.</p>\n\n<p>After the sale of Monolithic Memories, Ze’ev purchased a controlling interest in Clifford Electronics, then a small start-up in auto security systems and the perfect combination of his twin passions for technology and automobiles. As chairman and CEO, he rapidly developed Clifford into the world’s leading automobile security company through significant innovations, such as remote control alarms and distribution relationships with domestic and international car manufacturers as well as a network of thousands of retail dealers. In 1999, Ze’ev sold Clifford Electronics to Allstate Insurance.</p>\n\n<p>Competitive and focused, Ze’ev has taken up racing Formula cars, pitting his skills against young drivers aspiring to become professional racers. In his every pursuit, Ze’ev brings his passion and commitment, with an eye on the finish line, and translates that focus into a winning formula for technology companies. </p>","image":{"available_sizes":[[[150,113],"assets/images/resized/0001/0264/10264v1-max-150x150.jpg"],[[165,125],"assets/images/resized/0001/0264/10264v1-max-250x250.jpg"],[[165,125],"assets/images/resized/0001/0264/10264v1-max-450x450.jpg"]],"attribution":null},"degrees":[],"relationships":[{"is_past":false,"title":"Board of Directors, Vice Chairman","firm":{"name":"Tesla Motors","permalink":"tesla-motors","type_of_entity":"company","image":{"available_sizes":[[[80,116],"assets/images/resized/0000/2887/2887v3-max-150x150.png"],[[80,116],"assets/images/resized/0000/2887/2887v3-max-250x250.png"],[[80,116],"assets/images/resized/0000/2887/2887v3-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"President & CEO","firm":{"name":"Tesla Motors","permalink":"tesla-motors","type_of_entity":"company","image":{"available_sizes":[[[80,116],"assets/images/resized/0000/2887/2887v3-max-150x150.png"],[[80,116],"assets/images/resized/0000/2887/2887v3-max-250x250.png"],[[80,116],"assets/images/resized/0000/2887/2887v3-max-450x450.png"]],"attribution":null}}},{"is_past":true,"title":"Founder","firm":{"name":"Monolithic Memories","permalink":"monolithic-memories","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}