{"first_name":"Zeke","last_name":"Camusio","permalink":"zeke-camusio","crunchbase_url":"http://www.crunchbase.com/person/zeke-camusio","homepage_url":"http://www.DigitalAptitude.com","birthplace":"","twitter_username":"","blog_url":"http://www.DigitalAptitude.com/blog","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":1982,"born_month":null,"born_day":null,"tag_list":"internet-marketing-agency","alias_list":null,"created_at":"Thu May 06 21:59:48 UTC 2010","updated_at":"Mon Oct 08 07:03:24 UTC 2012","overview":"<p>His Career as an Entrepreneur</p>\n\n<p>Zeke Camusio is a serial entrepreneur. At the age of 18 he started ElectroLife, his first online business. It was a great first experience for Zeke but the market was very competitive and he had a hard time keeping his business profitable, so he decided to move on to his next project.</p>\n\n<p>Six months later, Zeke founded Data Systems, an educational software venture. Things went really well and the company became extremely successful. Zeke realized that Data Systems became something bigger than he could handle at his very young age and decided to sell it.</p>\n\n<p>When Zeke turned 20 he decided to start his third company, iSales, which sold cool infomercial gadgets over the Internet. This was the first time Zeke started getting really serious about online marketing. He didn’t know at the time that he would later become one of the most respected experts in this field.</p>\n\n<p>Proxies Online was Zeke’s fourth company. It was an identity-protection system for those who wanted to surf the Internet anonymously. Then came Lux Leathers, a designer leather goods e-store.</p>\n\n<p>The Outsourcing Company is Zeke’s sixth company. It’s an Internet Marketing Agency with offices in Aspen, Colorado and New York.</p>\n\n<p>Some Facts About Zeke:</p>\n\n<p>• He loves traveling, reading and playing sports.</p>\n\n<p>• Zeke’s ultimate goal is to start an entrepreneurship school to give people the tools they need to start successful businesses, grow their economies and give other people jobs.</p>\n\n<p>• Zeke lives in Aspen, Colorado, with his wife Tiana.</p>\n\n<p>• Zeke is a columnist and Internet Marketing expert at major publications such as StartupNation, Entrepreneur.com, PartnerUp and Toilet Paper Entrepreneur.</p>\n\n<p>• Zeke is the founder of Let’s Do It!, one of the most popular Internet marketing blogs.</p>\n\n<p>You can contact Zeke at zeke@TheOutsourcingCompany.com</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0008/6278/86278v2-max-150x150.jpg"],[[160,200],"assets/images/resized/0008/6278/86278v2-max-250x250.jpg"],[[160,200],"assets/images/resized/0008/6278/86278v2-max-450x450.jpg"]],"attribution":"<p>Zeke Camusio</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[{"external_url":"http://twitter.com/ZekeCamusio","title":""}]}