{"first_name":"Zenia","last_name":"Mucha","permalink":"zenia-mucha","crunchbase_url":"http://www.crunchbase.com/person/zenia-mucha","homepage_url":null,"birthplace":null,"twitter_username":null,"blog_url":null,"blog_feed_url":null,"affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":null,"alias_list":null,"created_at":"Wed May 21 02:33:58 UTC 2008","updated_at":"Wed May 21 02:49:30 UTC 2008","overview":"<p>Zenia Mucha is the executive vice president, Corporate Communications, The Walt Disney Company. In this capacity, Ms. Mucha has overall responsibility for both the communications policies and strategic positioning of The Walt Disney Company and its diverse global business segments, which include Media Networks, Parks and Resorts, Studio Entertainment and Consumer Products. She serves as the chief spokesperson for The Walt Disney Company and oversees media relations and communications strategy. Before assuming her current position, Zenia Mucha was senior vice president, The Walt Disney Company, Corporate Communications, since May 2002.</p>\n\n<p>Previously, Ms. Mucha was senior vice president, Communications, for the ABC Broadcast Group and the ABC Television Network since joining the Company. Serving in that capacity beginning in February, 2001, Ms. Mucha oversaw the development, implementation and oversight of internal and external communications for the ABC Broadcast Group, the ABC Television Network and other ABC divisions. She also supervised various other activities, such as public service campaigns, audience information, internal publications and the ABC Foundation.</p>\n\n<p>Earlier in her career Ms. Mucha served first as director of communications and then as senior policy advisor to Governor George Pataki of New York State, where she earned a national reputation for her expert communications and political skills. She joined Governor Pataki in 1994 and is widely credited with helping the former State Senator achieve the recognition necessary to win the gubernatorial election. Ms. Mucha counseled Governor Pataki on a broad range of public policy and other issues. She also successfully positioned him for his first re-election campaign as Governor.</p>\n\n<p>The New York Times observed: &#8220;Ms. Mucha&#8217;s official responsibilities were defined as press relations, scheduling and correspondence. But her portfolio has expanded to include virtually every major decision made by the Governor.&#8221; Upon her departure from New York State government to join ABC, The New York Times added that Ms. Mucha&#8217;s absence &#8220;deprives Mr. Pataki of someone who was not only the most influential member of his inner circle, but also his most forceful advocate before the press and with leaders of the State Legislature, as well as other politicians.&#8221;</p>\n\n<p>Prior to joining the Pataki administration, Ms. Mucha served as press representative and then communications director to former United States Senator Alfonse D&#8217;Amato. Ms. Mucha managed Senator D&#8217;Amato&#8217;s two successful re-election campaigns, in 1986 and 1992. </p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0001/8989/18989v1-max-150x150.jpg"],[[200,200],"assets/images/resized/0001/8989/18989v1-max-250x250.jpg"],[[200,200],"assets/images/resized/0001/8989/18989v1-max-450x450.jpg"]],"attribution":"<p><a href=\"http://corporate.disney.go.com/corporate/management_team.html\" title=\"Disney\" rel=\"nofollow\">Disney</a></p>"},"degrees":[],"relationships":[{"is_past":false,"title":"Executive Vice President, Corporate Communications, The Walt Disney Company","firm":{"name":"The Walt Disney Company","permalink":"the-walt-disney-company","type_of_entity":"company","image":{"available_sizes":[[[150,73],"assets/images/resized/0001/0929/10929v1-max-150x150.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-250x250.png"],[[165,81],"assets/images/resized/0001/0929/10929v1-max-450x450.png"]],"attribution":null}}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}