{"first_name":"Ziaul","last_name":"Haque","permalink":"ziaul-haque","crunchbase_url":"http://www.crunchbase.com/person/ziaul-haque","homepage_url":"http://www.peoplesinnovation.com","birthplace":"","twitter_username":"peoplesinnovasn","blog_url":"http://www.peoplesinnovatioin.blogspot.com","blog_feed_url":"","affiliation_name":"Peoples Innovation Pvt. Ltd.","born_year":null,"born_month":null,"born_day":null,"tag_list":"web-designing-company, web-development-company, hire-designers","alias_list":null,"created_at":"Sat Jan 28 11:22:06 UTC 2012","updated_at":"Wed Jul 18 20:30:55 UTC 2012","overview":"<p>PeoplesInnovation.com is team of well qualified &amp; skilled web designers in India. All Our web designing and development team is having 5+ years of experience. Pioneers in rendering dynamic and bespoke web based solutions for small and large enterprises; our diverse team of web designers holds rich experience in building latest trendy and catchy designing as per your business module. </p>\n\n<p>We have Web Designers and Flash Designers having great strength in - Simple, Clean and Fresh Website Layouts and coding in HTML, Strong creative design skills, Sound HTML knowledge, PSD to XHTML, Open source Template, Open source customization, Graphical user interface (GUI) design using HTML/XHTML/CSS, CSS &amp; HTML slicing, Ability to incorporate pre-written JavaScript into web pages, Logo Design with Corporate Identity Design, Brochures Corporate identity, HTML Email Template Design and Modification, Good experience in web design, Designing and re-designing of professional websites, High Quality, Elegant and Aesthetic Web 2.0 Layouts and coding in HTML/CSS or XHTML/CSS with W3C Validation.</p>\n\n<p>Our Skills include - Professional in Photoshop, Skilled in Corel Draw, Expert in Dream Weaver, DHTML/JavaScript/jQuery, DIV/CSS Master, Professional in HTML &amp; XHTML, Professional in CSS, Website Designing in PHP programming, Skilled in DHTML/JavaScript.</p>\n\n<p>Hire dedicated designing teams as per your project requirements and they work exclusively for you from our offshore development center as your own virtual employee. Hiring on hourly/weekly/monthly contract basis allows you to conveniently supervise and manage your project remotely and hold optimal control over the entire web designing team. PeoplesInnovation.com is the most acceptable website designing company in India, UK, USA, Canada, Europe, Gulf etc., for its after sales support. We provide 2 years of free after sales support for any type of technical issues in your site.</p>","image":{"available_sizes":[[[136,150],"assets/images/resized/0017/2007/172007v2-max-150x150.jpg"],[[185,203],"assets/images/resized/0017/2007/172007v2-max-250x250.jpg"],[[185,203],"assets/images/resized/0017/2007/172007v2-max-450x450.jpg"]],"attribution":""},"degrees":[],"relationships":[{"is_past":false,"title":"Director","firm":{"name":"Peoples Innovation Pvt. Ltd.","permalink":"peoples-innovation-pvt-ltd","type_of_entity":"company","image":null}},{"is_past":false,"title":"Director","firm":{"name":"Job Portal Script","permalink":"job-portal-script","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[{"external_url":"http://b2b-alibaba-clone.com","title":" Alibaba Clone Script Best B2B Software"}],"web_presences":[]}