{"first_name":"Zirk","last_name":"Engelbrecht","permalink":"zirk-engelbrecht","crunchbase_url":"http://www.crunchbase.com/person/zirk-engelbrecht","homepage_url":"http://zirkengelbrecht.com","birthplace":"","twitter_username":"","blog_url":"http://zirkengelbrecht1.blog.com","blog_feed_url":"","affiliation_name":"Casablanca Mining, Ltd.","born_year":null,"born_month":null,"born_day":null,"tag_list":"zirk-engelbrecht, izak-engelbrecht","alias_list":null,"created_at":"Tue Jun 28 08:39:22 UTC 2011","updated_at":"Wed Jun 29 00:22:11 UTC 2011","overview":"<p>Zirk Engelbrecht is the current President and Director of Casablanca Mining, Ltd. since January 20, 2011.  Mr. Engelbrecht has extensive experience in the formation, capital-raising, and registration stages of numerous public companies.  In 1994 Mr. Engelbrecht formed Suprafin, Inc. and Suprafin Partners, LLC and managed a $50 million private equity fund that oversaw the venture-to-public phase of 4 public companies in the healthcare and internet fields.  Since 2002 Mr. Engelbrecht has succeeded in assisting the development and capital formation stage of six publicly traded companies, with a combined market value of over $500 million.  Mr. Engelbrecht is the co-founder of WealthMakers, Ltd., a private web-based research technology company that connects members to automated trading platforms for stocks, indexes, bonds, options, commodities and currencies for up to 80 markets around the world.  From February 2006 through April 2009, he served as Director of Mobi Com Corporation, a pink sheet traded company engaged in the business of development and sale of proprietary, interactive applications and services for the mobile telephone industry that generate transaction based revenue and aggregate end user data.  From 2007 through January 2008, he served as the principal executive officer and principal financial officer of Sovereign Wealth Corp., a company trading on the over the counter bulletin board which is engaged in the business of developing, owning and operating mobile telephone and Internet advertising platforms that are used by mobile telephone network operators and manufacturers, retailers and commercial enterprises to attract and monetize relationships with consumers.  From April through October of 2006, he served as the President of Safari Associates, Inc., now known as Power Save Energy Company, a company trading on the over-the-counter bulletin board which is engaged in the manufacture, marketing and sale of electricity saving devices for homeowners.  Mr. Engelbrecht holds a degree in Mechanical Engineering.</p>","image":null,"degrees":[],"relationships":[{"is_past":false,"title":"President","firm":{"name":"Casablanca Mining","permalink":"casablanca-mining-ltd","type_of_entity":"company","image":null}}],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}