{"first_name":"Zoltan","last_name":"Kovacs","permalink":"zoltan-kovacs","crunchbase_url":"http://www.crunchbase.com/person/zoltan-kovacs","homepage_url":"","birthplace":"","twitter_username":null,"blog_url":"","blog_feed_url":"","affiliation_name":"Unaffiliated","born_year":null,"born_month":null,"born_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jan 29 23:42:25 UTC 2009","updated_at":"Thu Jan 29 23:42:25 UTC 2009","overview":"<p>Zoltán Kovács was the co-founder and director of the first internet consulting firms, Carnation Consulting in 1997. After selling his stake in the company, he invested in Kirowski, a digital communication agency, focusing on online media, digital creative and technology services, and became the CEO in 2000. The company has grown from a 12-people shop to a 90-people agency leading the Hungarian market, and one of the largest in Central Estern Europe. The company has won a large number of awards, for instance was 25th fastest growing technology company in Europe by Deloitte in 2002 and won many local and international creative awards.</p>\n\n<p>Zoltán Kovács was selected as „Enterpreneur of the Year&#8221; in 2007, by Ernst and Young in the „rising star&#8221; category. He served as Chairman for the Hungarian IT and Telecommunication Association from 2005-2008, and is now the chairman in honour. Has has served on the Board of the European ICT Association Eicta for 3 years. Having sold Kirowski to Aegis Media in 2005, Zoltan retained his position as CEO of Kirowski and became one of the CEOs of Isobar Global in London in 2007. He has been on various boards in Hungary consulting the government regarding technology development, R&amp;D, tax and economic issues. He is also a (non-active) member of EO (Entrepreneurs&#8217; Organization) and YPO (Young President&#8217; s Organization).</p>","image":{"available_sizes":[[[96,150],"assets/images/resized/0003/5287/35287v1-max-150x150.jpg"],[[160,250],"assets/images/resized/0003/5287/35287v1-max-250x250.jpg"],[[240,373],"assets/images/resized/0003/5287/35287v1-max-450x450.jpg"]],"attribution":"<p>www.dld-conference.com</p>"},"degrees":[],"relationships":[],"investments":[],"milestones":[],"video_embeds":[],"external_links":[],"web_presences":[]}