{"name":"1to1tutor","permalink":"1to1tutor","crunchbase_url":"http://www.crunchbase.com/company/1to1tutor","homepage_url":"http://www.1to1tutor.org","blog_url":"","blog_feed_url":"","twitter_username":"","category_code":"education","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"online-tutor, math-tutor, online-math-tutor, online-tutoring","alias_list":null,"email_address":"1to1tutor001@gmail.com","phone_number":"404-549-7063","description":"Online Tutor, Math Tutor","created_at":"Tue May 22 10:21:20 UTC 2012","updated_at":"Wed Aug 01 08:31:13 UTC 2012","overview":"<pre><code>    Georgia based 1to1Tutor.org is an online tutoring company that has laid its foundation in year 2005, having worked experience with over 500 schools districts, utilizing Multiple Intelligence methodology to understand specific needs and learning styles of a student. With smart online tutoring system we help students to get measurable result. We provide an easy online process to get registered and use the advantage of online tutoring from your home according to your comfort time. \n         1to1Tutor.org provides highly skilled and trained teachers who cater to students of different abilities, making sure the latter&amp;amp;#8217;s needs are met with. Latest technology used for tutoring like the interactive Whiteboard tool, interactive chat rooms and an e-mail and message board. 24/7 services provided by us, so you can choose a time slot most convenient to you.\n      Our Online Math tutoring is for the students between grades 1 to 8. Our math tutors are very talented, they use simple and easy-to-learn pedagogic techniques to inculcate in-depth knowledge and understanding of basic mathematical ideas and concepts of numbers &amp;amp; operations, decimals, fractions, measurements, etc., with a stress on problem solving abilities.\n       Register for pre-calculus and calculus tutoring for all students from grades 9 to 11. 1to1Tutor.org calculus tutors are very skilled who make learning calculus enjoyable by using state-of-the-art interactive technology. \n        1to1Tutor.org Algebra tutors are skilled in explaining the concepts, furnishing examples, and they spend enough time with the students to make them confident. Good concepts in algebra helps students confidently take on advanced math courses in high school &amp;amp; college. \n          1to1Tutor.org got an excellent experience, they has tutored over 15,000 students in Math, Algebra, Geometry, Calculus, Statistics and Trigonometry throughout United States.\n          1to1Tutor.org provides such beautiful learning environment based in Georgia which is full of fun and it is also very economical. We invite you to join our list of satisfied students and are always here to answer your queries.\n         Well, it’s an onerous task to say anything about the Bermuda Triangle, till today it’s a mystery; even I am quite curious to learn more about the Bermuda Triangle.\n</code></pre>","image":null,"products":[],"relationships":[],"competitions":[{"competitor":{"name":"The Academic Advantage","permalink":"the-academic-advantage","image":{"available_sizes":[[[150,62],"assets/images/resized/0020/0583/200583v2-max-150x150.jpg"],[[202,84],"assets/images/resized/0020/0583/200583v2-max-250x250.jpg"],[[202,84],"assets/images/resized/0020/0583/200583v2-max-450x450.jpg"]],"attribution":null}}}],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[{"external_url":"http://www.1to1tutor.org","title":"1to1tutor.org"}]}