{"name":"AbilTo","permalink":"abilto","crunchbase_url":"http://www.crunchbase.com/company/abilto","homepage_url":"http://www.abilto.com","blog_url":"http://abilto.com/blog/","blog_feed_url":"http://abilto.com/blog/feed","twitter_username":"","category_code":"web","number_of_employees":null,"founded_year":2008,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"healthcare, behavioral-health, mental-health, add, adhd, panic, anxiety, therapy, cbt, cognitive-behavioral-therapy, psychotherapy, online, web-based, technology, voip, psychology, health, social-worker, coach, internet-based","alias_list":null,"email_address":"information@abilto.com","phone_number":"","description":"Face-to-face video therapy","created_at":"Tue Jul 06 21:10:28 UTC 2010","updated_at":"Mon Jul 12 17:22:26 UTC 2010","overview":"<p>AbilTo started in 2008 with the mission of providing a better option for millions of people seeking to overcome the difficulties resulting from commonplace behavioral disorders and life transitions. Their programs include solutions for those who live with ADD/ADHD, panic/anxiety disorders and more.  </p>\n\n<p>Almost universally, it’s hard to find, purchase and benefit from quality care: the result is needless hardship and suffering. So in 2008, AbilTo wanted to do better.</p>\n\n<p>AbilTo is extremely client focused. They make it easy for them by removing common obstacles and making therapy accessible to all by providing programs via web-based videoconferencing. </p>\n\n<p>AbilTo is also results focused. They base all of their manualized programs on empirically validated approaches, Cognitive Behavioral Therapy and coaching, that reliably produce real-world results. </p>\n\n<p>AbilTo is quality obsessed. They train, supervise and integrate the work of all their professionals, as well as strive for continuous quality improvements.</p>\n\n<p>Most importantly, AbilTo does the right thing. They make sure to meet with every prospective client in an initial consultation prior to accepting him/her into any program. If it is deemed that AbilTo&#8217;s programs cannot help, they refer the individual to better resources for them.</p>\n\n<p>AbilTo&#8217;s approach is effective, private, convenient and cost-effective. It is truly therapy reinvented. </p>","image":{"available_sizes":[[[150,51],"assets/images/resized/0009/2583/92583v2-max-150x150.png"],[[179,62],"assets/images/resized/0009/2583/92583v2-max-250x250.png"],[[179,62],"assets/images/resized/0009/2583/92583v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}