{"name":"Acculynk","permalink":"acculynk","crunchbase_url":"http://www.crunchbase.com/company/acculynk","homepage_url":"http://www.acculynk.com","blog_url":"http://www.acculynk.com/2012/","blog_feed_url":"","twitter_username":"PaySecure","category_code":"ecommerce","number_of_employees":null,"founded_year":2008,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"internet-pin-debit, pin-debit, e-tailer, p2p","alias_list":null,"email_address":"sales@acculynk.com","phone_number":"678.894.7013","description":"Payments Technology Provider","created_at":"Wed Jul 18 19:25:29 UTC 2012","updated_at":"Tue Aug 21 08:25:58 UTC 2012","overview":"<p>Acculynk is a leading technology provider with a suite of software-only services that secure online payments, such as PIN debit for e-commerce and mobile commerce and person to person (P2P) payments via debit cards.</p>\n\n<p>Until PaySecure, the only way to use a debit card on the internet was as signature debit. Acculynk is the first company in the U.S. to offer a software-only service for internet PIN debit payments, PaySecure®. Acculynk’s technology platform utilizes a graphical, scrambling PIN-pad for the secure entry of sensitive cardholder information.  Unlike other authentication methods that require hardware, redirection or enrollment, PaySecure is unique in that it provides a simple consumer checkout experience that mimics the consumer experience using PIN debit at the grocery store. Acculynk’s PIN debit solution is enabled for mobile and touch screen (iOS, Android, Blackberry).  Acculynk has leveraged its patents, technology and partnership advantages to deliver a debit-driven P2P solution that solves two key issues that have hampered adoption in the P2P space:  real time transfer of funds and enrollment. Acculynk currently has a 100MM cardholder base within the internet PIN debit network, 7000 debit card issuers and 3000+ online merchants.</p>\n\n<p>While PIN debit is used extensively at the retail POS, before PaySecure consumers have never been given the opportunity to use PIN debit online.  Since the introduction of PaySecure consumers have shown a clear preference for PIN debit online &#8211;  when the PaySecure PIN pad is displayed consumers choose to enter their PIN up to 70% of the time.  PIN debit drives merchant acceptance cost down due to lower fraud and chargebacks.  Post-Durbin, Issuers are abandoning signature debit for PIN debit based the higher profitability of PIN. The problem of securely and simply authenticating consumers is becoming more widespread as EMV, mobile and P2P become available to consumers.  Acculynk’s patented authentication has a play in these markets as well.</p>\n\n<p>Backed by a powerful encryption and authentication technology platform protected by a family of issued and pending patents, Acculynk’s services provide greater security, reliability and return on investment for merchants, issuers and EFT networks. </p>","image":{"available_sizes":[[[150,31],"assets/images/resized/0020/1760/201760v2-max-150x150.png"],[[250,52],"assets/images/resized/0020/1760/201760v2-max-250x250.png"],[[450,93],"assets/images/resized/0020/1760/201760v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"ss","address1":"s984","address2":"88","zip_code":"995958","city":"sss","state_code":"IA","country_code":"USA","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}