{"name":"Advanced Visual Technology","permalink":"advanced-visual-technology","crunchbase_url":"http://www.crunchbase.com/company/advanced-visual-technology","homepage_url":"http://www.avtretail.com/","blog_url":"","blog_feed_url":"","twitter_username":"","category_code":"software","number_of_employees":null,"founded_year":1997,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"","alias_list":"","email_address":"","phone_number":"44 8452 003425","description":"3D visual macro space planning software","created_at":"Wed Aug 12 15:48:51 UTC 2009","updated_at":"Wed Aug 12 15:55:23 UTC 2009","overview":"<p>Advanced Visual Technology, Ltd. provides visual space planning solution to the retail industry. It offers Retail FOCUS, a visual merchandising solution that unites merchandising, store planning, construction, operation, and inventory management into CAD-based floor plans to produce a flow of store-specific merchandising information, and capture and analyze fixture data, allocated space, and adjacencies. The company also offers eViewer, which offers store level personnel a store-specific graphical view of pending merchandising changes and allows for detailed inquiry and reporting based on user-specified metrics; eMaintenance that facilitates communication between head office and local store merchandising teams of store specific graphical views of pending merchandising changes; eMerchandiser, which links store and field personnel with central store plans, fixturing, planograms, and product data; and eDesigner, which offers store and field personnel the ability to create and maintain AutoCAD compliant store plans. Its products have applications in various areas, including store-specific floor plan management, planogram development and publishing, store category space analysis, drawing automation, 3D store plan visualization and maintenance, single common relational database, Web-based store plan collaboration, Web-based merchandising collaboration, electronic store survey, and integrated fixture takeoff and ordering. The company serves retailers that range from drug chains to department stores, book sellers to banks, and mass merchandisers to music stores. It provides its services in Europe, North America, Central and South America, Africa, the Middle East, and Australasia. Advanced Visual Technology Ltd. was formerly known as Visual Technology Ltd. and changed its name to Advanced Visual Technology Ltd. in October 1997. The company was incorporated in 1997 and is based in St. Albans, United Kingdom. As of October 2008, Advanced Visual Technology Ltd. operates as a subsidiary of Oracle Corp.</p>","image":null,"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":{"price_amount":null,"price_currency_code":"USD","term_code":null,"source_url":"http://www.reuters.com/article/pressRelease/idUS112374+01-Oct-2008+PRN20081001","source_description":"Oracle Buys Advanced Visual Technology","acquired_year":2008,"acquired_month":10,"acquired_day":1,"acquiring_company":{"name":"Oracle Corporation","permalink":"oracle","image":{"available_sizes":[[[150,51],"assets/images/resized/0001/7825/17825v1-max-150x150.png"],[[158,54],"assets/images/resized/0001/7825/17825v1-max-250x250.png"],[[158,54],"assets/images/resized/0001/7825/17825v1-max-450x450.png"]],"attribution":null}}},"acquisitions":[],"offices":[{"description":"HQ","address1":"Tyttenhanger House","address2":"Coursers Road","zip_code":"AL4 0PG","city":"St. Albans","state_code":null,"country_code":"GBR","latitude":51.765479,"longitude":-0.292111}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}