{"name":"AlphaNation","permalink":"alphanation","crunchbase_url":"http://www.crunchbase.com/company/alphanation","homepage_url":"http://www.alphanation.com","blog_url":"","blog_feed_url":"","twitter_username":"alpha_nation","category_code":"web","number_of_employees":12,"founded_year":2010,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"social-finance, social-finance-community, financial-information, online-finance, investor-personality, investing, online-investing, investing-behavior","alias_list":null,"email_address":"jeff@alphanation.com","phone_number":"","description":"Online investing community","created_at":"Thu Jul 14 16:20:47 UTC 2011","updated_at":"Fri Dec 23 06:40:52 UTC 2011","overview":"<p>AlphaNation is part of a growing movement to educate, empower and liberate the individual investor.  At a time when the level of public trust in Wall Street has reached an all-time low investors are seeking alternatives to traditional approaches to investing.  The Wall Street Journal recently reported that more than a quarter of investors under age 50 have switched advisors in the past year.  Additionally, more than two-thirds of the investors polled also said they were interested in joining online investing communities.  </p>\n\n<p>And while it is true that the Internet provides real-time access to the same financial data once limited to Wall Street analysts and executives, how is the individual investor to make sense of it all?  Even more daunting, where does the first time investor go to find relevant, trustworthy information and network and learn from like-minded investors?  AlphaNation was formed to address these problems and provide a safe, easy to use, and learning-focused environment to help make your online investing experience more profitable.</p>\n\n<p>Whether a novice or a veteran trader, AlphaNation’s open information platform helps ensure that timely, accurate and relevant information is at investors’ fingertips.  By filtering content, both mainstream and social (user-generated), for relevance and accuracy AlphaNation allows investors quickly to make sense of the dizzying array of online investing resources.  AlphaNation’s investor community also benefits from a proprietary methodology to link like-minded investors&#8211;a proven behavioral finance approach to learning. </p>\n\n<p>AlphaNation offers an open and individually-controlled alternative to the traditionally closed, often intimidating, approach to investing.  The result: AlphaNation allows anyone interested in investing to access and to benefit from the growing social finance community online.  </p>\n\n<p>No longer does Wall Street control your financial future.  You do. </p>","image":{"available_sizes":[[[150,82],"assets/images/resized/0014/4236/144236v4-max-150x150.png"],[[185,102],"assets/images/resized/0014/4236/144236v4-max-250x250.png"],[[185,102],"assets/images/resized/0014/4236/144236v4-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$650k","funding_rounds":[{"round_code":"seed","source_url":"","source_description":"","raised_amount":150000,"raised_currency_code":"USD","funded_year":2011,"funded_month":3,"funded_day":1,"investments":[]},{"round_code":"angel","source_url":"","source_description":"","raised_amount":250000,"raised_currency_code":"USD","funded_year":2011,"funded_month":8,"funded_day":1,"investments":[]},{"round_code":"seed","source_url":"","source_description":"","raised_amount":250000,"raised_currency_code":"USD","funded_year":2011,"funded_month":10,"funded_day":1,"investments":[]}],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"NYC Office","address1":"32 W 40th Street","address2":"","zip_code":"10018","city":"New York","state_code":"NY","country_code":"USA","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}