{"name":"Alumnay","permalink":"alumnay","crunchbase_url":"http://www.crunchbase.com/company/alumnay","homepage_url":"http://www.alumnay.com","blog_url":"http://alumnay.com/article/","blog_feed_url":"","twitter_username":"alumnaycrew","category_code":"web","number_of_employees":null,"founded_year":2012,"founded_month":5,"founded_day":1,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"south-africa, social-network, e-commerce, social-commerce, shopping-online, online-stores, auctions, business-directory","alias_list":null,"email_address":"info@alumnay.com","phone_number":"","description":"South Africa's networking platform","created_at":"Thu Jul 19 17:28:14 UTC 2012","updated_at":"Thu Jul 19 19:30:21 UTC 2012","overview":"<p>Alumnay is a South African based networking site with the state-of-the-art e-commerce tools.  It is the next generation of social commerce; the use of social network(s) in the context of e-commerce transactions.</p>\n\n<p>Alumnay networking platform combines world-class social networking utilities, best-of-breed user-friendly e-commerce tools, robust mobile and desktop page management services, real-time charting and messaging system in one complete platform. Alumnay’s powerful and intuitive platform allows registered users to meet acquittances and build stronger relationship(s) by associating with them. </p>\n\n<p>Throughout the site, upon mutual associations, individuals will have a relationship map of associated users, known as Associates, forming a network. Acquaintanceship is a feature that helps users find and associate with other members via current associates. On the other hand, “Shortest Connection Path” allows users to view the shortest path to associate with other users. In addition, users can also find out about associates whom they are likely to associate with via 2nd level, 3rd level, 4th level acquaintances. </p>\n\n<p>From this relationship map, users can then upload and share documents, petition towards a single cause, discuss meaningful topics through blogs and forums, create awareness through articles, upload and share photo and videos, send private messages to other associates.</p>\n\n<p>Alumnay has a stringent code of conduct and privacy policy wherein all associations made are mutually confirmed by others users and individuals only appear in the relationship map with their explicit consent. To minimise fake profiles, users also have to be verified by a minimum of 10 associates and finally by the site administrators to gain “Verified” status, indicated by green tick on their avatars. The status is also revocable when users are in contravention with the requirements.</p>\n\n<p>Alumnay also serves as an effective medium by which its high-tech e-commerce utilities can be utilized by merchants to drive business online to an already existing community of registered users. With these utilities, users will be able to auction, create and manage their own online stores within a Virtual Mall, post online classifieds on the marketplace, create discount vouchers through the daily deals tool and create an in-depth business profile through the business directory.</p>","image":{"available_sizes":[[[150,58],"assets/images/resized/0020/1933/201933v2-max-150x150.jpg"],[[250,97],"assets/images/resized/0020/1933/201933v2-max-250x250.jpg"],[[450,175],"assets/images/resized/0020/1933/201933v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"Founder","person":{"first_name":"Bandela","last_name":"B. Mgoqi","permalink":"bandela-b-mgoqi","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Headquarters","address1":"Boundary Road","address2":"Houghton","zip_code":"2198","city":"Johannesburg","state_code":null,"country_code":"ZAF","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[{"available_sizes":[[[150,100],"assets/images/resized/0020/1932/201932v2-max-150x150.jpg"],[[250,166],"assets/images/resized/0020/1932/201932v2-max-250x250.jpg"],[[450,300],"assets/images/resized/0020/1932/201932v2-max-450x450.jpg"]],"attribution":null}],"external_links":[]}