{"name":"amaysim","permalink":"amaysim","crunchbase_url":"http://www.crunchbase.com/company/amaysim","homepage_url":"http://www.amaysim.com.au","blog_url":"","blog_feed_url":"","twitter_username":"","category_code":"mobile","number_of_employees":null,"founded_year":2010,"founded_month":11,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"mvno, australia, amaysim","alias_list":null,"email_address":"","phone_number":"","description":"Mobile Service company in Australia","created_at":"Fri Dec 03 11:52:06 UTC 2010","updated_at":"Tue Dec 07 10:02:29 UTC 2010","overview":"<p>At amaysim, we’re striving to change the way Australians think about mobiles - forever. We’re committed to bringing you simple, fair, low-cost mobile services.</p>\n\n<p>At the same time, we’re not going to skimp where it counts. We listen to our customers and have developed an outstanding Australian call centre, with a team that’s determined to put the focus back where it belongs: on the customer.</p>\n\n<p>So who are we and why are we here? amaysim was introduced to Australia in November 2010 by a group of successful entrepreneurs with a proven international track record in Australia, Europe, the United States, South America and Asia. The founders are Australian telecommunications investor and advisor, Peter O’Connell (Chairman) and German e-commerce and telecommunication entrepreneurs Rolf Hansen (Chief Executive Officer), Christian Magel (Chief Marketing Officer), Thomas Enge (Chief Financial Officer) and Andreas Perreiter (Chief Operating Officer).</p>\n\n<p>amaysim&#8217;s European Founders previously launched a similar business, simyo, a mobile company that grew quickly to become a market leader in its category in Germany, Spain, France, Belgium and the Netherlands.</p>\n\n<p>Now we’ve taken this experience and combined it with our Australian partner’s expert knowledge of the Australian mobile market, to build a new company that brings simiplicity and purity to Australian mobile customers. In building this company, we’re committed to delivering a ground-breaking mobile service that offers rates and a new standard of customer service that all Australians will enjoy.</p>","image":{"available_sizes":[[[150,48],"assets/images/resized/0011/2744/112744v2-max-150x150.jpg"],[[250,80],"assets/images/resized/0011/2744/112744v2-max-250x250.jpg"],[[312,101],"assets/images/resized/0011/2744/112744v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}