{"name":"AtNight","permalink":"atnight","crunchbase_url":"http://www.crunchbase.com/company/atnight","homepage_url":"http://www.atnight.com","blog_url":"","blog_feed_url":"","twitter_username":"atnight","category_code":"advertising","number_of_employees":15,"founded_year":2011,"founded_month":8,"founded_day":24,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"nightlife, party, event-photography, tickets, club, dj, entertainment, party-pictures","alias_list":null,"email_address":"info@atnight.com","phone_number":"305-403-0180","description":"Nightlife photos, events, clubs, bars, ","created_at":"Thu Sep 06 22:21:26 UTC 2012","updated_at":"Sun Sep 09 19:37:25 UTC 2012","overview":"<p>You make it happen at night, one picture at a time!</p>\n\n<p>Atnight.com is a website dedicated to bringing you the best nightlife events from all around the world right onto your PC. Our teams of photographers capture the most memorable moments at the greatest events in Miami. The photos are edited and posted on Atnight.com for anyone around the world to enjoy. These photos give our viewers a glimpse at what takes place inside these amazing parties and events. Visitors are able to see who was at what parties and use our Facebook features to tag photos, share comments, recommend the albums to other viewers, and use other fun features to interact with other people on the site. On most albums, you may also enjoy video clips to experience the atmosphere created at each of those events.</p>\n\n<p>This site is the long thought-out vision of veterans of Miami nightlife. Each step of the way, it was designed and built with our viewers and clients in mind. Our goal is to provide our viewers and clients with the most complete social/nightlife entertainment website in the world. Our viewers can use our services to plan for the upcoming events, RSVP to any of our clients&#8217; events, and even enjoy benefits for using our site to reserve your spot at the hottest parties anywhere in the globe. You can buy tickets to the hottest parties in town, or book your VIP table, or get on the VIP guestlists to the best clubs and skip the long general admission lines. We are your one stop shopping place for nightlife.</p>\n\n<p>Atnight.com allows you to experience the nightlife and the best events in town, without ever having to set foot in any of the venues. The website was built to give you the closest possible experience to feeling as though you were at a party, but instead you are in the comfort of home (or office, we won&#8217;t tell anyone!). At the same time, you can party like the jetsetters do thanks to all of our services and connections. After all, if you are watching this website, you must live your life &#8220;Atnight&#8221;! Thanks for visiting us.</p>","image":null,"products":[],"relationships":[{"is_past":false,"title":"Founder / CEO","person":{"first_name":"Luis","last_name":"Martinez","permalink":"luis-martinez-2","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Miami Main Office","address1":"265 NE 24th Street ","address2":"Suite #108","zip_code":"33137","city":"Miami","state_code":"FL","country_code":"USA","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}