{"name":"BidsList.com ","permalink":"bidslist-com","crunchbase_url":"http://www.crunchbase.com/company/bidslist-com","homepage_url":null,"blog_url":null,"blog_feed_url":null,"twitter_username":null,"category_code":null,"number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"construction, california, verification, contracts, services, bid, bids, bid-list","alias_list":null,"email_address":null,"phone_number":null,"description":null,"created_at":"Fri Jun 01 13:44:55 UTC 2012","updated_at":"Mon Jul 02 22:13:04 UTC 2012","overview":"<p>Finally a solution for all Home Owners, Property Managers, Real Estate Agents, Small Businesses, Single Parents, Contractors , Sub- Contractor’s and online freelancers.</p>\n\n<p>We know that in today’s economy most individuals, businesses owners, and contractors need help finding trusted verified professionals to provide them with quality services at a safe, reliable, and affordable price. However there are some questions that you need to consider when deciding who you want to hire for your service related project.</p>\n\n<p>How do you know that the worker you hired really is who they say they are?\nHow can you make sure the professional you hire doesn’t have a criminal background?\nHow do you know you’re not going to get ripped off?\nWhat happens when a problem arises?\nHow do you find those verified trusted contractors?\nHow much time and energy is it going to take out of my life?\nIf any of those questions are a concern to you then your answer is BidsList.</p>\n\n<p>BidsList provides assurance and peace of mind for both parties in any service related project. They manage to do this by only allowing experienced professionals with current license’s and insurance to be a BidsList Verified Professional. Bidslist does extensive background checks and research needed to verify the information provided is accurate. Once a contractor is approved then Bidslist will send them projects to bid on in their area once they are posted via E-mail. Bidslist makes sure to do extensive background checks making it a privilege for licensed contractors and professionals to be a member of the Bidslist Community.</p>\n\n<p>What happens if a problem happens during the project? Bidslist allows both parties to utilize a neutral 3rd party mediation through the AAA (Americans Arbitration Association) in case any disputes or problems should occur. Bidslist offers insurance packages, similar to a rental car companies, in case of incidental damages that may arise. Bidslist makes it the ideal situation for anybody who is going to spend a good amount of money on their service needs. With the way Bidslist operates, your money is safe in your BidsList account until you confirm that your project has been completed as you wanted and agreed to with the professional of your choice.</p>\n\n<p>This makes it the ideal platform for both parties in ANY service related project.</p>","image":{"available_sizes":[[[150,41],"assets/images/resized/0019/6319/196319v2-max-150x150.png"],[[250,69],"assets/images/resized/0019/6319/196319v2-max-250x250.png"],[[420,117],"assets/images/resized/0019/6319/196319v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"BidsList Corporate Office","address1":"10531 4S Commons Drive #512","address2":"","zip_code":"92127","city":"San Diego","state_code":"CA","country_code":"USA","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}