{"name":"BigLittleDiscount","permalink":"biglittlediscount","crunchbase_url":"http://www.crunchbase.com/company/biglittlediscount","homepage_url":"http://biglittlediscount.com/","blog_url":"http://biglittlediscount.blogspot.com/","blog_feed_url":"","twitter_username":"ESXDistribution","category_code":"advertising","number_of_employees":10,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"essex-distributions, big-discounts, biglittlediscount, vouchers, coupons, discounts, money-off-coupons, promotional-codes, voucher-codes, savings, essex, leaflet-distribution, big-discounts-essex, big-little-discount-in-essex, basildon","alias_list":null,"email_address":"talk2us@biglittlediscount.com","phone_number":"01269 287505","description":"Vouchers, Discount, Coupons and Savings ","created_at":"Thu Feb 24 08:38:06 UTC 2011","updated_at":"Mon Sep 12 00:17:27 UTC 2011","overview":"<p>Introducing! The Big Little Discount – Website and Booklet</p>\n\n<p>The Big Little Discount – Website and Booklet</p>\n\n<p>Website - www.biglittlediscount.com\nBIG DISCOUNTS, little effort! Big Little Discount is the UK’s fastest-growing voucher code provider. We help you instantly save cash by providing FREE easy-to-use money saving vouchers, discounts, coupons, promotional codes and more.</p>\n\n<p>BIG BRANDS! We feature the latest offers on hot products and fabulous services from thousands of leading retailers and companies. Big Little Discount has fantastic discounts from the UK’s best stores and biggest brands, including Argos, Asda, Boots, Comet, PC World, Pizza Hut, Subway, Tesco and many more!</p>\n\n<p>BIG DEALS! Vouchers are valid for a limited period. But with super new deals added daily to the Big Little Discount website, be sure to bookmark us. Sign up to our weekly newsletter now for exclusive deals and we’ll also keep you updated on all our other massive savings and special offers. We’re also on Facebook and Twitter, so join us there and be the first to hear about our latest vouchers and exciting competitions.</p>\n\n<p>BIG IDEA? If you can’t see the voucher or deal you’re looking for, or if you want to contact us, drop us an e-mail at info@biglittlediscount.com and our dedicated team of bargain hunters will do their very best to add it to the thousands of incredible offers already available at Big Little Discount.</p>\n\n<p>Thanks to Big Little Discount, you’ll never miss a great bargain again. Start making those savings today!</p>\n\n<p>Big Little Discount Booklet\nBig Little Discount’s free voucher booklet is distributed every two months to over 205,000 homes and businesses across Essex. Each booklet is filled with a huge selection of savings on the best products and services from leading global brands and local businesses.</p>\n\n<p>Massive discounts, massive savings, all for FREE! Look out for the Big Little Discount Booklet in your area.</p>\n\n<p>Advertise in the Big Little Discount</p>\n\n<p>Advertise in the Big little Discount Booklet. Its as easy as 1-2-3! </p>\n\n<ol>\n<li>Decide how much discount you want to give our customers. </li>\n<li>Supply your ad artwork to us or talk to our graphic designers to ensure a professional promotional design. </li>\n<li>Watch your sales rocket as the booklet is distributed to 200,000 homes and businesses in Essex! </li>\n</ol>\n\n<p>Areas covered: Barking, Basildon, Battlesbridge, Benfleet, Billericay, Braintree, Brentwood, Canvey Island, Castle Point, Chelmsford, Chigwell, Clacton, Clacton-on-Sea, Colchester, Dagenham, Eastwood, Epping Forest, Grays, Great Baddow, Great Wakering, Hadleigh, Harlow, Hawkwell, Hockley, Hornchurch, Hullbridge, Ingatestone, Maldon, Leigh, Leigh-on-Sea, Loughton, Prittlewell, Rayleigh, Rochford, Romford, Runwell, Shenfield, Shoebury, Southend, Southend-on-Sea, Thorpe Bay, Thundersley, Thurrock, Tilbury, Upminster, Westcliff, Westcliff-on-Sea, Witham, and many more.</p>\n\n<p>You can also add your advertisement in our website! \nOur website covers the biggest brands and the best stores in UK. </p>\n\n<p>Never miss a deal! Add us!\nFacebook - http://www.facebook.com/biglittlediscount\nTwitter - http://twitter.com/BLDiscount\nSubscribe to our YouTube channel - http://www.youtube.com/biglittlediscount</p>","image":{"available_sizes":[[[150,136],"assets/images/resized/0012/3729/123729v7-max-150x150.jpg"],[[180,164],"assets/images/resized/0012/3729/123729v7-max-250x250.jpg"],[[180,164],"assets/images/resized/0012/3729/123729v7-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[{"is_past":true,"title":"Online Marketing Executive","person":{"first_name":"Pallavi","last_name":"Prasad","permalink":"pallavi-prasad","image":{"available_sizes":[[[99,150],"assets/images/resized/0015/6357/156357v5-max-150x150.jpg"],[[166,250],"assets/images/resized/0015/6357/156357v5-max-250x250.jpg"],[[299,450],"assets/images/resized/0015/6357/156357v5-max-450x450.jpg"]],"attribution":""}}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}