{"name":"Bimagofr","permalink":"bimagofr","crunchbase_url":"http://www.crunchbase.com/company/bimagofr","homepage_url":"http://bimago.fr/","blog_url":"http://blog.bimago.fr/","blog_feed_url":"","twitter_username":"Bimagofr","category_code":"other","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"tableaux-peinture, stickers-muraux, photo-sur-toile, parchoirs, art-numerique","alias_list":null,"email_address":"","phone_number":"","description":"Tableaux peinture à vendre","created_at":"Mon Aug 30 07:58:20 UTC 2010","updated_at":"Tue Aug 31 19:54:30 UTC 2010","overview":"<p>La boutique bimago s&#8217;occupe de la vente de tableaux et d&#8217;éléments de la décoration d&#8217;intérieur. Dans notre offre vous trouverez plus de 3000 motifs originaux que vous pouvez commander en tant que le tableau peinture ou l&#8217;impression numérique de haute qualité sur le support de votre choix - toile ou plexiglas (tableau fleurs, tableau abstrait, tableau africain, tableau paysage, tableau New York&#8230;). Dans notre collection vous trouverez également de nombreux stickers muraux (adhésifs décoratifs) pour la décoration originale et tendance. Nous envisageons d&#8217;introduire très prochainement dans notre offre les nouveaux produits : les pochoirs pour la décoration murale et les réproductions de tableaux de grands peintres.</p>\n\n<p>Notre société fonctionne sur le marché européen déjà depuis cinq années. La coopération de quelques jeunes artistes peintres ambitieux a commancé notre activité. Pendant ces quelques années de travail nous avons réussi à élargir notre sphère d&#8217;activité et à produire nos articles en grosse quantité. Actuellement, nous sommes une très grande société de production professionnelle de profil artistique de plus de 100 salariés : non pas seulement des artistes peintres et graphistes talentueux, mais aussi des techniciens, imprimeurs, employés de production et d&#8217;administration. Nos bureaux et ateliers occupent déjà plus de 3000 m² de surface et on envisage toujours la suite de développement de notre société.</p>\n\n<p>La boutique bimago vend ses produits non pas seulement en France, mais aussi en Suisse, en Luxembourg, en Allemagne, en Espagne, en Suède, en Pologne et en Italie. Il y a des milliers de clients satisfaits de nos services et produits dans toute l&#8217;Europe – on vous invite à les rejoindre !</p>","image":{"available_sizes":[[[143,52],"assets/images/resized/0009/9857/99857v2-max-150x150.png"],[[143,52],"assets/images/resized/0009/9857/99857v2-max-250x250.png"],[[143,52],"assets/images/resized/0009/9857/99857v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[{"available_sizes":[[[150,82],"assets/images/resized/0009/9856/99856v2-max-150x150.png"],[[250,137],"assets/images/resized/0009/9856/99856v2-max-250x250.png"],[[450,248],"assets/images/resized/0009/9856/99856v2-max-450x450.png"]],"attribution":null}],"external_links":[]}