{"name":"blogface","permalink":"blogface","crunchbase_url":"http://www.crunchbase.com/company/blogface","homepage_url":"http://www.blogface.fr","blog_url":"http://blog.blogface.fr","blog_feed_url":"","twitter_username":"myblogface","category_code":"web","number_of_employees":17,"founded_year":2010,"founded_month":7,"founded_day":1,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"blogface, gagner-argent, internet, vendre, acheter","alias_list":"","email_address":"contact@blogface.fr","phone_number":"","description":"Crowdsourced work","created_at":"Fri Jul 16 07:14:26 UTC 2010","updated_at":"Fri Sep 03 21:41:25 UTC 2010","overview":"<p>C’est dingue ce qu’on peut faire pour 5 euros</p>\n\n<p>« J’écris une chanson de rap personnalisée sur n’importe-quel sujet et n’importe-quelle personne »\n« Je fais une chirurgie esthétique virtuelle des seins de votre femme ou de votre petite amie »\n« Je porte votre t-shirt pendant une journée au travail, et je le prouve avec des photos ou des vidéos »\n« Je refais votre CV pour le rendre époustouflant »\n« Je vous montre comment extraire votre ADN »…</p>\n\n<p>Makeos ou comment adresser un marché de particuliers en leur permettant d’échanger des services et des compétences et de se rémunérer à l’aide de micro-paiements. C’est ce que propose Makeos, ici la limite n’est pas dans le nombre de caractères mais dans les sommes échangées : Makeos est une sorte de place de marché où n’importe-qui peut proposer ou acheter un service à n’importe-qui pour cinq euros. Le slogan est clair : « Que seriez-vous capable de faire pour 5 euros ».</p>\n\n<p>Nous avons tous une ou des compétences qui peuvent profiter à d’autres, pourquoi ne pas essayer de se faire un peu d’argent de poche avec ? Il existe déjà des sites qui permettent d’échanger des coups de mains entre particuliers, mais il manquait un endroit qui permette de diffuser et de vendre son savoir-faire très simplement. Makeos propose cette nouvelle façon de faire de petites affaires entre personnes, en prenant au passage sa dîme de 1 euros sur chaque prestation, ce qui fait quand même une commission de 20%.</p>\n\n<p>Makeos ne permet d’échanger et de vendre que des prestations dématérialisées, il n&#8217;installe aucune relation mercantile entre les gens pour des petits coups de main qui normalement participent bénévolement et naturellement au lien social. </p>\n\n<p>Les plus malins trouveront ici l’opportunité d’arrondir leurs fins de mois en proposant fréquemment des prestations.</p>\n\n<p>Makeos, un mélange astucieux entre un réseau social du style de Twitter et un marché de prestations entre particuliers, permet simplement l’achat ou la vente de services, allant de la correction de devoirs de mathématiques à la création de sites web pour mobile, en passant par les cours de russe sur Skype. La seule restriction est que les prix doivent toujours être de 5 euros, là où d’autres en demanderait des centaines.</p>\n\n<p>« L’endroit où tout le monde peut partager ce qu’ils seraient prêts à faire pour 5 euros », Makeos est un site avec beaucoup d’avenir et très ouvert à tout public, grâce à de nombreuses catégories.</p>\n\n<p>sans même connaître les références de la personne proposant un service pour les plus professionnels, certains ont l’air tout à fait intéressant (création de sites web, référencement,etc…). Évidemment, d’autres ont trouvés des moyens astucieux pour se faire un peu d’argent facile, en vendant des biens non-matériels qui valent moins que 5 euros, des noms de domaines, par exemple.</p>","image":{"available_sizes":[[[150,120],"assets/images/resized/0009/3765/93765v2-max-150x150.jpg"],[[250,201],"assets/images/resized/0009/3765/93765v2-max-250x250.jpg"],[[450,362],"assets/images/resized/0009/3765/93765v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}