{"name":"Bolsa de Mulher Group","permalink":"bolsa-de-mulher-group","crunchbase_url":"http://www.crunchbase.com/company/bolsa-de-mulher-group","homepage_url":"http://www.bolsacorp.com","blog_url":"","blog_feed_url":"","twitter_username":"bolsacorp","category_code":"enterprise","number_of_employees":70,"founded_year":2006,"founded_month":3,"founded_day":8,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"digital-media, internet, social-networking, women, research","alias_list":null,"email_address":"info@bolsacorp.com","phone_number":"+55 21 20049200","description":"Digital media group","created_at":"Thu Dec 17 18:08:07 UTC 2009","updated_at":"Tue Jun 21 15:56:45 UTC 2011","overview":"<p>Bolsa de Mulher Group is a digital media group for women in Latin America. The company owns 16 properties delivering multiplatform content, social networking and service to women over the internet, mobile and paid-tv.</p>\n\n<p>In 2008, Bolsa de Mulher Group consolidated its leadership in the Brazilian online women’s segment, acquiring competitors and website focused on the female audience to strengthen its audience and e-commerce model. </p>\n\n<p>After consolidating its leadership in Brazil, the company began its international expansion to Mexico, Chile, Argentina and the US. </p>\n\n<p>Properties:</p>\n\n<p>Bolsa de Mulher.com - Content and women’s social network</p>\n\n<p>The portal includes editorial content, interactive tools, videos, and a social network. Millions of women access Bolsa de Mulher every month, exchanging experiences, creating groups, and purchasing products and services.</p>\n\n<p>www.bolsademulher.com</p>\n\n<p>Sophia Mind - Market Research</p>\n\n<p>Sophia Mind is a market intelligence and research company of the women’s communication group Bolsa de Mulher S.A., which belongs to Ideiasnet. Sophia Mind is 100% focused on understanding the female public and developing Business Intelligence models, market research, competitive intelligence and relationship strategies geared toward women. Sophia Mind seeks to reveal what women want, when they want it and how they want it.</p>\n\n<p>Estrela Guia – Content and services in astrology</p>\n\n<p>The leader in the segments of astrology, esotericism and self help for the Brazilian internet, this portal offers free services, including personalized horoscopes and predictions, as well as products that users pay for, such as Astral Maps, Tarot and Numerology readings, and qualified content. Estrela Guia received three iBest awards in the category of Religion and Esotericism.</p>\n\n<p>www.estrelaguia.com.br</p>\n\n<p>Te Contei –News, celebrities and you</p>\n\n<p>Focused on the life styles of national and international celebrities, it brings our users news and exclusive interviews with famous artists. At Te Contei, these artists have their own personal pages, with biographies and important facts about their lives. The portal even presents its own webTV – Te Contei TV – with a guide to its daily programming. In addition to content, Te Contei offers a social network, making the space a meeting point for fans.</p>\n\n<p>www.tecontei.com.br</p>\n\n<p>Feminice – Social network and content for teens</p>\n\n<p>A space for information and exchanging experiences for girls from the age of 12 until adulthood. At Feminice, adolescents find all kinds of information and help from specialists for questions about their bodies, hearts and minds, in addition to subjects like fashion and celebrities. The portal has a girls’ editorial board, that decides what they would like to read and write.</p>\n\n<p>www.feminice.com.br</p>\n\n<p>Bolsa de Bebê –Content and tools for mothers and expectant mothers.</p>\n\n<p>Offers information, tools and communities aimed at the exchange of experiences between women that have been through or are preparing for maternity. The site addresses everything from planning for pregnancy to a baby’s third year.</p>\n\n<p>www.bolsadebebe.com</p>\n\n<p>Bem Leve – Diet, nutrition and well-being</p>\n\n<p>Content and services oriented toward quality of life, well-being, diet and nutrition. Information on health, beauty and fitness is offered in this portal through articles by specialists and reports. The goal is to give users the right orientation to help them attain their objectives in regard to fitness.</p>\n\n<p>www.bemleve.com.br</p>\n\n<p>Universidade Feminina – E-learning center for women</p>\n\n<p>A pioneer in the market, this e-learning center totally focused on women was created with their needs, desires and particularities in mind. In a modern well-structured platform, practical, interactive courses are made available online and are generally free. In a one-year period, more than 100 thousand people registered. Universidade Feminina is a space where women can learn and teach.</p>\n\n<p>www.universidadefeminina.com</p>\n\n<p>Bolsa TV –TV for web and mobile</p>\n\n<p>A pioneer in exclusively feminine content for new media in Brazil, it provides videos produced specifically for the internet and cellular phones. With a diverse daily programming guide, Bolsa TV includes talk-shows, special reports, fashion programming, gastronomy, behavior and video horoscopes.</p>\n\n<p>Bolsa Mobile –The first women’s mobile social network in Brazil</p>\n\n<p>Bolsa Mobile allows users to interact with all of the content of the Bolsa de Mulher network by cellular phone, in a complete and dynamic way. A pioneer in Brazil with content for WAP/Smartphones, it offers services, tools, and a social network exclusively for a female audience.</p>\n\n<p>Bolsa Gourmet –Gastronomy, recipes and user-generated content</p>\n\n<p>A gastronomy portal that concentrates on user-generated content. Bolsa Gourmet is a space for exchanging experiences and recipes with tools to facilitate daily life. At this site users can have their own book of recipes, create menus, generate shopping lists, and watch videos with step-by-step instructions for dishes created by famous chefs.</p>\n\n<p>Pink Ad Network –A women’s network for affiliates</p>\n\n<p>Pink Ad is a network of Bolsa de Mulher partners. Organized according to subjects of interest, the Pink Ad Network allows advertisers to speak to their target markets in a direct and efficient manner and gives their network sites access to the major feminine brands in the market. Made up of sites with pertinent content, qualified and directed to a female audience, the network reaches a large number of users interested in a variety of subjects such as fashion, maternity and gastronomy.</p>\n\n<p>www.pinkadnetwork.com</p>\n\n<p>Bolso de Mujer – Content and the first female social network in Latin America</p>\n\n<p>Editorial content and tools for beauty and fashion, like Make Up and Mostre seu Estilo. The portal focuses on the three largest markets in Latin America – Mexico, Chile and Argentina, which adds up to 30 million internet users.</p>\n\n<p>www.bolsodemujer.com</p>\n\n<p>Bolso de Bebé - Content and social network for mothers and expectant mothers in Latin America</p>\n\n<p>Editorial content and tools for women who have lived and who want to live maternity. The portal focuses on the three largest markets in Latin America – Mexico, Chile and Argentina, which adds up to 30 million internet users.\nwww.bolsodebebe.com</p>\n\n<p>Netcard –Virtual cards and applications</p>\n\n<p>Netcard is a portal for entertainment and fun featuring the delivery of personalized virtual cards free of charge. The site offers thousands of cards for all occasions.</p>\n\n<p>www.netcard.com.br</p>","image":{"available_sizes":[[[150,49],"assets/images/resized/0007/0239/70239v2-max-150x150.png"],[[250,82],"assets/images/resized/0007/0239/70239v2-max-250x250.png"],[[302,100],"assets/images/resized/0007/0239/70239v2-max-450x450.png"]],"attribution":null},"products":[{"name":"Bolso de Mujer.com","permalink":"bolso-de-mujer-com","image":{"available_sizes":[[[150,64],"assets/images/resized/0007/0252/70252v2-max-150x150.png"],[[232,99],"assets/images/resized/0007/0252/70252v2-max-250x250.png"],[[232,99],"assets/images/resized/0007/0252/70252v2-max-450x450.png"]],"attribution":null}},{"name":"Bolsa de Mulher.com","permalink":"bolsa-de-mulher-com","image":null},{"name":"Pink Ad Network","permalink":"pink-ad-network","image":null},{"name":"iTodas","permalink":"itodas","image":null},{"name":"Estrela Guia","permalink":"estrela-guia","image":null},{"name":"TeContei","permalink":"tecontei","image":null},{"name":"Feminice","permalink":"feminice","image":null},{"name":"Sophia Mind","permalink":"sophia-mind","image":null},{"name":"Bem Leve","permalink":"bem-leve","image":null},{"name":"Bolsa de Bebê","permalink":"bolsa-de-beb","image":null},{"name":"Bolso de Bebé","permalink":"bolso-de-beb","image":null},{"name":"Bolsa Gourmet","permalink":"bolsa-gourmet","image":null},{"name":"Netcard","permalink":"netcard","image":null},{"name":"Bolsa Mobile","permalink":"bolsa-mobile","image":null},{"name":"BolsaTV","permalink":"bolsatv","image":null},{"name":"Universidade Feminina","permalink":"universidade-feminina","image":null},{"name":"Bolsa de Mulher","permalink":"bolsa-de-mulher","image":null}],"relationships":[{"is_past":false,"title":"CEO","person":{"first_name":"Carla","last_name":"Esteves","permalink":"carla-esteves","image":null}},{"is_past":false,"title":"CMO","person":{"first_name":"Ciça","last_name":"Mattos","permalink":"cia-mattos","image":null}},{"is_past":false,"title":"Board Member","person":{"first_name":"Everson","last_name":"Lopes","permalink":"everson-lopes","image":{"available_sizes":[[[150,100],"assets/images/resized/0014/0008/140008v5-max-150x150.jpg"],[[250,166],"assets/images/resized/0014/0008/140008v5-max-250x250.jpg"],[[450,300],"assets/images/resized/0014/0008/140008v5-max-450x450.jpg"]],"attribution":"<p>Fundacao Estudar</p>"}}},{"is_past":true,"title":"CEO","person":{"first_name":"Andiara","last_name":"Petterle","permalink":"andiara-petterle","image":null}},{"is_past":true,"title":"CTO","person":{"first_name":"Carlos","last_name":"Rios","permalink":"carlos-rios","image":null}}],"competitions":[{"competitor":{"name":"Vila Mulher","permalink":"vila-mulher","image":null}}],"providerships":[],"total_money_raised":"$0","funding_rounds":[{"round_code":"a","source_url":"","source_description":"","raised_amount":null,"raised_currency_code":"USD","funded_year":1000,"funded_month":1,"funded_day":1,"investments":[{"company":null,"financial_org":{"name":"Ideiasnet","permalink":"ideiasnet","image":{"available_sizes":[[[150,28],"assets/images/resized/0003/2821/32821v5-max-150x150.jpg"],[[250,47],"assets/images/resized/0003/2821/32821v5-max-250x250.jpg"],[[450,85],"assets/images/resized/0003/2821/32821v5-max-450x450.jpg"]],"attribution":null}},"person":null}]}],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Rio de Janeiro HQ","address1":"Visconde de Piraja","address2":"547 801","zip_code":"22410900","city":"Rio de Janeiro","state_code":null,"country_code":"BRA","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[{"available_sizes":[[[150,97],"assets/images/resized/0007/0242/70242v2-max-150x150.jpg"],[[250,162],"assets/images/resized/0007/0242/70242v2-max-250x250.jpg"],[[450,292],"assets/images/resized/0007/0242/70242v2-max-450x450.jpg"]],"attribution":null}],"external_links":[{"external_url":"http://www.ideiasnet.com.br","title":"Ideasnet - Investor"}]}