{"name":"Borrell Associates Inc.","permalink":"borrell-associates-inc","crunchbase_url":"http://www.crunchbase.com/company/borrell-associates-inc","homepage_url":"http://www.borrellassociates.com","blog_url":"http://www.borrellassociates.com/wordpress","blog_feed_url":"","twitter_username":"goborrell","category_code":"advertising","number_of_employees":17,"founded_year":2001,"founded_month":4,"founded_day":2,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"local-advertising, online-advertising, smbs, local-marketing, gordon-borrell, kip-cassino, newspapers, radio, tv, outdoor, cable","alias_list":null,"email_address":"info@borrellassociates.com","phone_number":"757-221-6641","description":"Local advertising research firm","created_at":"Sun Sep 09 13:44:20 UTC 2012","updated_at":"Sun Sep 09 20:09:37 UTC 2012","overview":"<p>Borrell Associates is a Virginia-based research and consulting firm that provides local advertising data for more than 1,000 companies across North America and the U.K. </p>\n\n<p>Through an interactive online service called Compass (www.adspending.com), Borrell provides detailed advertising data and publishes written analysis monthly on trends in local marketing expenditures. Borrell&#8217;s data is derived through a unique methodology that tracks advertising from the bottom up.  Instead of estimating ad spending by collecting revenue data from media companies, Borrell&#8217;s methodology starts at the bottom &#8211; with advertisers &#8211; and collects spending from more than 20 million businesses, across more than 3,000 counties and provinces.  The data consists of ad-spending estimates for any of 12 media categories (newspapers, online, TV, radio, outdoor, etc.) for each of 100 business categories (furniture stores, auto dealers, hospitals, real estate, etc.).  Its Compass report, for instance, can estimate what a car dealer in Dubuque is spending on TV advertising, or what a florist in Carson City is spending on search advertising.</p>\n\n<p>Borrell also holds an conference each spring in New York City that attracts 500 top local media executives to hear about dynamic changes on the local digital marketing landscape.</p>\n\n<p>The company is the creator of Digital Marketing Regions (DMRs), which are 513 geographic areas across the U.S. where local businesses tend to concentrate their digital advertising. </p>\n\n<p>Borrell Associates is based in Williamsburg, Va., with offices in Seattle and Toronto.  For more information, visit http://www.borrellassociates.com. </p>","image":{"available_sizes":[[[150,23],"assets/images/resized/0021/0522/210522v2-max-150x150.jpg"],[[250,39],"assets/images/resized/0021/0522/210522v2-max-250x250.jpg"],[[450,70],"assets/images/resized/0021/0522/210522v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}