{"name":"Box Office Capsule","permalink":"box-office-capsule","crunchbase_url":"http://www.crunchbase.com/company/box-office-capsule","homepage_url":"http://www.boxofficecapsule.com/","blog_url":"http://boxofficecapsule.blogspot.in/","blog_feed_url":"","twitter_username":"boxofficecapsul","category_code":"games_video","number_of_employees":null,"founded_year":2011,"founded_month":12,"founded_day":3,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"box-office-collection, latest-movies-reviews, movies-preview, top-bollywood-news, wallpapers, hot-videos","alias_list":null,"email_address":"seo.boxoffice@mae.net.in","phone_number":"","description":"Bollywood News, Movies Reviews","created_at":"Sat Mar 03 14:50:43 UTC 2012","updated_at":"Sat Mar 10 22:32:32 UTC 2012","overview":"<p>Box Office Capsule is a website owned by Khyati Entertainment Pvt. Ltd. which provides movies review, previews, box office collections, analysis, predictions, rate critics, bollywood news, sexy wallpapers, hot videos, south news, hollywood movies review, movies rating and My ADDA. The site was formed in December 2011.</p>\n\n<p>This is first of its kind platform for bollywood/film buffs to get connected and share their views.</p>\n\n<p>There is a unique property called ‘My Adda&#8217; where members can login and enjoy the first social network kind of experience dedicated to Bollywood.</p>\n\n<p>Another unique proposition is ‘Rate the Critics&#8217; where audience can express their views and rate critics on the basis of the quality and honesty of reviews.</p>\n\n<p>We also have a unique scientific model that can be used to predict the business of Hindi films. This model has been developed by an IIM Graduate who developed it after extensive research all over the world. This model claims an accuracy of 95%. This model has been very popular among many film celebrities, producers, exhibitors and distributors. It was extensively covered by media all over.</p>\n\n<p>In addition to all this, the website also focuses on latest box office collections, analysis, news, etc. We make sure that we present box office in completely unbiased manner and give readers a complete new scientific approach to the analysis that currently does not exist in India.</p>\n\n<p>All Latest Bollywood News can be read here with new and latest images. Hot and sexy models and actresses pictures are also available on this website. Audience can give his ratings here on any movie without hesitation.</p>\n\n<p>He can express his views, upload his images and videos through My ADDA and after login everybody can see the posts, images and videos.</p>\n\n<p>In &#8220;Unreliable News&#8221;, those movies who did the worst business in the year comes.</p>\n\n<p>&#8220;Expert Views&#8221; Section gives us the experts advice on the hot topics related to Bollywood, Hollywood and South Movies, that what&#8217;s new is going on in Industry?</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0017/6813/176813v2-max-150x150.jpg"],[[241,241],"assets/images/resized/0017/6813/176813v2-max-250x250.jpg"],[[241,241],"assets/images/resized/0017/6813/176813v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[{"external_url":"http://delicious.com/stacks/view/H0J2t0","title":"Box Office Capsule is a complete Entertainment site for Bollywood, Hollywood and South Movies Lovers."}]}