{"name":"bright.com","permalink":"bright-com","crunchbase_url":"http://www.crunchbase.com/company/bright-com","homepage_url":null,"blog_url":null,"blog_feed_url":null,"twitter_username":null,"category_code":null,"number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"jobs-network","alias_list":null,"email_address":null,"phone_number":null,"description":null,"created_at":"Thu Apr 19 18:30:50 UTC 2012","updated_at":"Fri Jun 01 20:57:53 UTC 2012","overview":"<p>Bright is a new approach to your online job search, using your social network to make important connections. Bright makes these connections using its own proprietary technology (the Opportunity Algorithm™) and the power of your existing social network! Start with a simple job search on Bright and expose personal connections to jobs, companies, and friends who hold the key to your next great job! </p>\n\n<p>How it works \nAs an example, let&#8217;s say you were looking for a job in nursing. A typical approach would be to search online job boards for &#8220;nursing&#8221;, which would return a simple list of jobs for you to pick from. On Bright, the Opportunity Algorithm™ will not only return postings from job listings, but it will also pull social connections that you may already have in the nursing field as well as those in related fields like healthcare. These connections may be working at hospitals currently looking for nurses. They can then put in a good word for you, thus increasing your chances of getting a job! </p>\n\n<p>What is the Opportunity Algorithm™ \nUsing advanced principles in data management, the engineers at Bright have developed a proprietary technology known as the Opportunity Algorithm™, which effectively manipulates and stores user and social data. This algorithm makes distinct connections between the thousands of jobs and companies available in our database, and the friends you already have who can vouch for you to get those jobs!</p>","image":null,"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}