{"name":"calls9","permalink":"calls9","crunchbase_url":"http://www.crunchbase.com/company/calls9","homepage_url":"http://www.calls9.com","blog_url":"","blog_feed_url":"","twitter_username":"calls9","category_code":"other","number_of_employees":5,"founded_year":2009,"founded_month":12,"founded_day":1,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"digital-marketing, marketing, online, pr, seo, ppc, social-media, facebook, twitter, linkedin, email","alias_list":null,"email_address":"hello@calls9.com","phone_number":"","description":"Digital Consultancy ","created_at":"Tue Jul 27 10:07:17 UTC 2010","updated_at":"Mon Dec 12 22:11:21 UTC 2011","overview":"<p>Based in Leeds, Calls9 is a leading independent marketing and PR Agency. Specialising in Social Media, SEO, PPC Management, Email Marketing and bespoke PR services, Calls9 take control of your businesses marketing needs to deliver excellent results.</p>\n\n<p>Whatever your aim whether it be brand promotion, pushing sales, or even developing customer relationships, we can develop the perfect solution for your business.</p>\n\n<p>Our full service social media package can incorporate:</p>\n\n<p>•Social Network Advertising – Targeted advertising on the top 10 social network sites including Facebook, Twitter, Myspace, Linkedin and Bebo.\n•Social Network Presence – The development of pages across Facebook, Twitter, Myspace, Linkedin and Bebo.\n•Blog, Posting and viral video marketing\n•Online PR – Spreading your company news and Press releases online\n•Social Bookmarking\n•Full Media Management – Full controlled management of all social media accounts\n•Comprehensive reporting on Social Media Activities </p>\n\n<p>Here at Calls9 we provide the necessary services to ensure that your business is found first on the major search engines.</p>\n\n<p>Our bespoke services include:</p>\n\n<p>•Search Engine Optimisation (SEO)\n•Pay Per Click (PPC) </p>\n\n<p>Search engine optimisation (SEO) is a method of online marketing to increase a website&#8217;s visibility on search engines via organic search results for targeted keywords. Natural search engine optimisation is a process applied to a website to increase the number of visitors by gaining high rankings on the leading search engines.</p>\n\n<p>Our Search Engine Optimisation Service Includes:</p>\n\n<p>•A fully managed search engine optimisation service\n•A dedicated SEO account manager\n•A monthly progress report on some SEM services\n•Fully researched keywords\n•Analytics package\n•Full on-page optimisation\n•Ongoing link building campaign with regular reporting</p>\n\n<p>The Calls9 PR team is made-up of expert copywriters and PR professionals and creates and distributes keyword-rich, highly optimised:</p>\n\n<p>•news articles\n•press releases\n•blogs\n•podcasts\n•video podcasts\n•downloads.</p>","image":null,"products":[],"relationships":[{"is_past":false,"title":"Director","person":{"first_name":"Andrea","last_name":"Taylor","permalink":"andrea-taylor","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}