{"name":"Catch_Digital","permalink":"catch-digital-2","crunchbase_url":"http://www.crunchbase.com/company/catch-digital-2","homepage_url":"http://www.catchdigital.com","blog_url":"http://blog.catchdigital.com/","blog_feed_url":"http://feeds.feedburner.com/feedburner/catchdigital","twitter_username":"catch_digital","category_code":"web","number_of_employees":8,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"digital-production-partner, open-source-development, drupal, wordpress, design, ecommerce, mobile-applications, search-engine-optimisation, social-media-campaigns","alias_list":null,"email_address":"hello@catchdigital.com","phone_number":"020 7494 3554","description":"Digital Production Partner","created_at":"Tue Sep 28 12:05:10 UTC 2010","updated_at":"Fri Oct 08 18:53:18 UTC 2010","overview":"<p>Catch is a full service digital production partner.</p>\n\n<p>We specialise in partnering with traditional agencies, digital agencies and directly with brands themselves to provide the design and technical production of websites, web and mobile applications.</p>\n\n<p>We understand what it takes to partner with some of the UKs leading agencies that need specialist outsourced skills or an additional resource to deliver a project through both the pitch and delivery phase.</p>\n\n<p>Adept at working on a white label basis or shoulder-to-shoulder, we bring our knowledge of open- source development and our skills in design when you need a trusted partner that gets the job done.</p>\n\n<p>Our team of creatives, developers, producers and account managers all contribute to our wide ranging skill set which includes content management, eCommerce, mobile applications, search engine optimisation and social media campaigns.</p>\n\n<p>Having a client roster that includes top agencies, FSA regulated City firms and FMCG brands we offer a no-nonsense transparent approach that underpins everything we do from strategy to design and technology.</p>\n\n<p>Take the time to view our case studies. If you like what you see and would like to find out more please call Jonathan us 0207 494 3554 or get in touch online. We look forward to talking to you.</p>","image":{"available_sizes":[[[150,63],"assets/images/resized/0010/3417/103417v2-max-150x150.jpg"],[[250,105],"assets/images/resized/0010/3417/103417v2-max-250x250.jpg"],[[296,125],"assets/images/resized/0010/3417/103417v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}