{"name":"challngr app","permalink":"challngr-app","crunchbase_url":"http://www.crunchbase.com/company/challngr-app","homepage_url":"http://www.challngr.com","blog_url":"http://blog.challngr.com","blog_feed_url":"","twitter_username":"thechallngr","category_code":"mobile","number_of_employees":15,"founded_year":2011,"founded_month":6,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"social-network, social, social-media, users, promotions, brands, products, companies, online, online-marketing, online-strategy, qr, ar","alias_list":null,"email_address":"info@codishare.com","phone_number":"0034938795050","description":"Brands & Users social network","created_at":"Tue Jul 31 10:30:20 UTC 2012","updated_at":"Sat Aug 04 13:46:04 UTC 2012","overview":"<p>challngr is a mobile social network that connects people with their favorite brands.</p>\n\n<p>challngr allows any brand or product to receive suggestions, ideas and wishes from users and create promotions and experiences based on their preferences.</p>\n\n<p>challngr is a direct marketing platform that offers solutions to any business or professional interested in interaction with their online audiences through their smartphones using promotions and experiences.</p>\n\n<p>challngr provides an automated, self-manageable tool for businesses and professionals interested in creating medium and long term experiences and promotions.</p>\n\n<p>Users can find stores, websites, brands and products, show their preferences, interact with them and participate in promotions and experiences.</p>\n\n<p>challngr uses AR, QR codes, Social Media sharing, and other smartphone features to provide experiences to any user. </p>\n\n<p>Promotions on demand social network, where Users create their brands map and Brands create their users network.</p>","image":null,"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}