{"name":"CloudCheckr","permalink":"cloudcheckr","crunchbase_url":"http://www.crunchbase.com/company/cloudcheckr","homepage_url":"http://www.cloudcheckr.com","blog_url":"http://cloudcheckr.com/blog/","blog_feed_url":"","twitter_username":"cloudcheckr","category_code":"software","number_of_employees":null,"founded_year":2011,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"aws, cloud, cost-management","alias_list":null,"email_address":"sales@cloudcheckr.com","phone_number":"(585)413-0869","description":"public cloud software","created_at":"Wed Oct 10 14:18:57 UTC 2012","updated_at":"Fri Oct 26 00:54:22 UTC 2012","overview":"<p>CloudCheckr provides a management solution for AWS users. </p>\n\n<p>Cloudcheckr is a knowledge tool for AWS users. It picks up where the AWS management console and reports leave off. CloudCheckr uses read-only credentials to compile a complete inventory of a user’s deployment. Cloudcheckr then analyzes and reports on that environment. It distills the information into usable actionable intelligence.</p>\n\n<p>First, Cloudcheckr serves as a cost analysis solution. From a pure cost perspective, Cloudcheckr analyzes usage from both a &#8220;right-sizing&#8221; and a &#8220;right-purchasing&#8221; perspective. It benchmarks usage against peer groups, makes recommendations, and quantifies the costs associated with present choices. CloudCheckr provides insight into the savings possible from alternate choices.</p>\n\n<p>Second, CloudCheckr serves as a managerial information tool. It offers a granular look into an AWS deployment. CloudCheckr identifies resources by type, region, usage, and more. It provides a graphical map of resources. CloudCheckr performs a comprehensive analysis of S3 files. CloudCheckr also provides a change monitoring function. </p>\n\n<p>Third, CloudCheckr also assists in security and compliance. Beyond change monitoring, CloudCheckr compares a deployment against a proprietary list of best security and compliance practices. It notifies the user and prioritizes variances.</p>","image":null,"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}