{"name":"Club Mahindra","permalink":"club-mahindra","crunchbase_url":"http://www.crunchbase.com/company/club-mahindra","homepage_url":"http://www.clubmahindra.com","blog_url":"http://www.clubmahindrablog.com/","blog_feed_url":"http://www.clubmahindrablog.com/feed","twitter_username":"clubmahindra","category_code":"other","number_of_employees":null,"founded_year":1996,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"hotels","alias_list":null,"email_address":"feedback@clubmahindra.com","phone_number":"39880000","description":"Jiyo Life","created_at":"Tue Dec 04 08:16:44 UTC 2012","updated_at":"Thu Dec 06 05:44:08 UTC 2012","overview":"<p>Deemed as the No 1 Vacation Provider, it caters to the leisure and hospitality sector of the Mahindra Group accounting for USD 15.9 billion of the Mahindra group. Since 1996 when the company originated, it has reinforced to become the market leader in the family holiday business. Attending to the varied needs of individuals, it has varied brands with a variety of services including Club Mahindra Holidays, Zest, Club Mahindra Fundays, Club Mahindra Homestays and clubmahindra.travel.\nWith a consumer base of around 150,000 members and 43 resorts covering varied incredible places across the country, it has accomplished to be the greatest leisure provider in the country. It is a  proud receiver of a number of accolades including the CSI  2011 Award for Excellence in IT for the Travel and Philosophy Sector, Best Socially Responsible Resort  for Club Mahindra Snowpeaks, Manali, President’s Club Award from RCI,  Superbrand 09 and Business Standard  08, etc. It is the world’s first hospitality company to be assessed with the PCMM Level 3 and the first vacation ownership company to have received a COPC certified Members Relation Center. It envisions to be one of the TOP 5 VO companies of the world with respect to its member base by FY2016.\nIts secret sauce has been its approach towards creating and managing holiday experience. It comprehends with the varied holiday needs and experiences of people and provides services that gratify the members at every point of their vacationing. The mission has been “Good Living. Happy Families.” The parent company, Mahindra Group, is among the country’s top ten industrial houses and has over 14,000 employees in over 100 countries. \nThey have changed the face of vacationing in India by rendering a new range of services including furnished infrastructure like apartments and cottages, a rejuvenating experience via resort specific amenities including restaurants, kids clubs, and Ayurvedic spas. Besides, Club Mahindra also proficiently reached out to the masses and made vacationing affordable via its membership schemes through easy EMI options. They have made travelling across the globe accessible for around 6000 resorts across 90 countries making it possible for Indians to fulfill their dream of vacationing abroad by levying a minimal exchange fee in Indian rupees.\nMahindra Holidays And Resorts Limited intends to design and formulate new products and services to foray into new segments and meet the needs of individuals belonging to different age groups.</p>","image":{"available_sizes":[[[150,83],"assets/images/resized/0022/3723/223723v2-max-150x150.jpg"],[[186,104],"assets/images/resized/0022/3723/223723v2-max-250x250.jpg"],[[186,104],"assets/images/resized/0022/3723/223723v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"Managing Director & CEO","person":{"first_name":"Mr.","last_name":"Rajiv Sawhney","permalink":"mr-rajiv-sawhney","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Corporate Office","address1":"Mahindra Towers, 2nd Floor, 17/18, Patullos Road, Mount Road","address2":"Tamil Nadu","zip_code":"600 002","city":"Chennai","state_code":null,"country_code":"IND","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}