{"name":"Condor Software & Logística","permalink":"condor-software-logstica","crunchbase_url":"http://www.crunchbase.com/company/condor-software-logstica","homepage_url":"http://www.condorsoftware.com.br","blog_url":"","blog_feed_url":"","twitter_username":"condorlogistica","category_code":"consulting","number_of_employees":5,"founded_year":1994,"founded_month":12,"founded_day":8,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"","alias_list":null,"email_address":"jose.siqueira@condorsoftware.com.br","phone_number":"551232045601","description":"Logistic Consulting","created_at":"Thu Mar 17 22:19:55 UTC 2011","updated_at":"Wed Mar 23 22:34:15 UTC 2011","overview":"<p>A Condor Software &amp; Logística acredita que conhecimento e desempenho são desafios impostos, cada vez mais, a pessoas, organizações, governos e à sociedade em geral. Novos processos de criação e condução de negócios surgiram, ancorados, principalmente, na tecnologia da informação. </p>\n\n<p>A racionalização de processos, com a conseqüente agregação de valor (e redução de custos) a produtos e serviços, tornou-se ponto vital para o desenvolvimento de empresas e de nações. A Logística deixou de exercer apenas os papeis tradicionais de transportar, armazenar e disponibilizar bens para transformação e consumo. </p>\n\n<p>Sob o conceito de gestão da cadeia de suprimentos (supply chain management) a Logística Empresarial assumiu responsabilidades crescentes na estratégia das organizações. </p>\n\n<p>Profissionais devem estar preparados para identificar e utilizar recursos e processos que contribuam para o enfrentamento da concorrência na sociedade capitalista. Para sobreviverem nesse mercado de acirrada competição, e serem bem-sucedidas, as organizações precisam desenvolver &#8220;vantagens competitivas&#8221; e implementar relações colaborativas na cadeia de suprimentos por meio de negociações produtivas. O resultado esperado deverá privilegiar o trinômio qualidade / produtividade / custos. </p>\n\n<p>A Logística Empresarial é responsável pelo fluxo de produtos, serviços e informações inter-relacionadas, e alinhados com os objetivos de uma Empresa, é um segmento crítico em termos de atendimento às necessidades do cliente, otimização operacional e redução de custos. </p>\n\n<p>Assim, tais recursos, quando geridos no seu limite de integração, podem levar aos resultados esperados.</p>\n\n<p>ção deste conceito, direcionamos a &#8220;Condição Logística&#8221; da empresa para um novo processo com ganhos de aprimoramento, aumentando a produtividade, dirimindo custos alternativos, impactos negativos na produção e na estocagem, considerando um novo pacote reestruturado.</p>\n\n<p>Pensamos em melhorar os custos passivos oriundos da cadeia logística, transformando os fornecedores em parceiros produtivos, responsáveis não só pela matéria prima, mas também pela nova formação dos preços, visto que são peças chaves na formação do novo custo.</p>","image":{"available_sizes":[[[150,77],"assets/images/resized/0012/6740/126740v2-max-150x150.jpg"],[[250,128],"assets/images/resized/0012/6740/126740v2-max-250x250.jpg"],[[382,197],"assets/images/resized/0012/6740/126740v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}