{"name":"Culture Unplugged Studios","permalink":"culture-unplugged-studios","crunchbase_url":"http://www.crunchbase.com/company/culture-unplugged-studios","homepage_url":"http://www.cultureunplugged.com","blog_url":"http://www.cultureunplugged.com/filmedia/truthSeekers.php","blog_feed_url":"","twitter_username":"","category_code":"games_video","number_of_employees":45,"founded_year":2008,"founded_month":1,"founded_day":7,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"film, film-festival, documentaries, hulu, sundance, ipad-tv, mobile-tv","alias_list":"","email_address":"contact@cultureunplugged.com","phone_number":"+912065002520","description":"Documentary, Indie Films, Shorts","created_at":"Sun Feb 22 18:16:52 UTC 2009","updated_at":"Mon Jan 16 22:57:10 UTC 2012","overview":"<p>&#8220;Culture Unplugged&#8221; is not just a name of a studio, it is a mission - a vision and aspiration to integrate disparate parts of the self and the global human society. It aims to achieve this, primarily by leveraging the power of new media and extending the effort to offline events and actions. But above all, achieve the mission by being the seeker of truth &#8220;herself&#8221; on the journey her vision charts ahead - not just be an organization, but be the way of being - as referred here as &#8220;She&#8221;.</p>\n\n<p>At present, Culture Unplugged efforts are focused on enabling networks of socially &amp; spiritually conscious content and its creators. With presence in India, USA, UK, Indonesia and New Zealand, we are dedicated to bring authentic/independent voices of diverse cultures to global audiences. We are committed to contemplate and contribute to our personal as well as collective spiritual need of the time. Our focus is on the inner+inter cultural expression. Our aim is to work toward unity &amp; harmony through all kinds of man-made divisions.</p>\n\n<p>In brief, Culture Unplugged, by and for global community of conscious storytellers, culture explorers and world citizens to reflect on issues and life experiences in contemporary world - a new media studio focused on producing as well as promoting socially &amp; spiritually sensitive stories/films that does not merely express but pulsate to energize, enchant, enlighten, engage or embrace the humanity in us all.\nFestivals :</p>\n\n<p>We debuted in May 2008 with our first online film festival. Till date, we have launched 9 festivals. At present, our plan is to sponsor 4 themes for these festivals: 1. We Speak, Here. 2. Humanity Explored, 3. Green Uplugged, 4. Spirit Enlightened. They focus to observe our external world, social issues prevalent today, and meditate on the spiritual state of the human consciousness at present - influencing our culture and nature, within and without, at present and of future.</p>\n\n<p>Content Production :</p>\n\n<p>We are focusing on producing digital/HD content. Our productions aspire to be low Cost &amp; global without any preconceived limits on form or length of the content which presents creative spirituality at work. We also invite collaborations across borders on documentary productions on specific social issues. We believe in innovation through peaceful subversion of the proverbial precepts. We DO NOT wish to produce to fill the spaces in media channel, but fill spaces within us.</p>\n\n<p>filMedia network :</p>\n\n<p>We have also launched another online platform recently, that caters to upcoming as well as established film-makers, looking to reach out to wider audience for social mission and/or find new markets &amp; connect with global producers. With this platform, we wish to facilitate cross-pollination of ideas, spirit and knowledge among storytellers, content producers, professionals from social/scientific arena and global audiences.</p>\n\n<p>Distribution :</p>\n\n<p>Our studio wishes to distribute films/media which shares Culture Unplugged&#8217;s vision &amp; mission, from willing independent artists and filmmakers primarily from Asia, MiddleEast, Africa but certainly not limited to these regional borders only. As our efforts are non-commerical at present, for distribution, we work with our partner distributor who is global and shares our mission, vision and understands our intention to offer transparent, fair and just partnership to film-makers/producers.</p>\n\n<p>It is our intent to promote the content inspired by true events/stories or those innate cultural expression by storyteller touched by local life experience (in all forms : short films, shows/pilots, features, documentaries and music videos). At present, we promote &amp; distribute the talent + content from the participants of the Culture Unplugged festivals to television &amp; alternative distribution channels across the globe. If you wish to distribute with us but haven&#8217;t participated in festival, please send us your screener copy. Our distribution model is designed to provide a fair and democratized platform that is transparent and open.\nPartners :</p>\n\n<p>International organizations such as Link TV, IRIN, NDTV, UNDP(India), MTV EXIT, USAID are our core partners. Other partners include TERI, WWF(India), MINUSTAH, UNICEF(Hait), Pop!Tech Institute, University of Michigan, The Aspen Institute, UNODC, UN.GIFT, AFO, Oxfam Hong Kong. </p>","image":{"available_sizes":[[[150,103],"assets/images/resized/0003/6726/36726v6-max-150x150.png"],[[200,138],"assets/images/resized/0003/6726/36726v6-max-250x250.png"],[[200,138],"assets/images/resized/0003/6726/36726v6-max-450x450.png"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"Founder","person":{"first_name":"Anaal","last_name":"Udaybabu","permalink":"anaal-udaybabu","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Culture Unplugged Studios","address1":"Clover Centrum, 2nd Floor","address2":"Galaxy Society","zip_code":"","city":"Pune","state_code":null,"country_code":"IND","latitude":null,"longitude":null},{"description":"Culture Unplugged Ltd.","address1":"23 minnie street","address2":"eden terace","zip_code":"","city":"auckland","state_code":null,"country_code":"NZL","latitude":null,"longitude":null},{"description":"Culture Unplugged Ltd.","address1":"901 Battery St. Suite 308","address2":"c/o LinktTV","zip_code":"94111","city":"san francisco","state_code":"CA","country_code":"USA","latitude":null,"longitude":null}],"milestones":[{"description":"Launched 7th Online Film Festival with films from over 110 countries.","stoned_year":2011,"stoned_month":6,"stoned_day":10,"source_url":"http://www.cultureunplugged.com","source_text":null,"source_description":"","stoneable_type":"Company","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"name":"Culture Unplugged Studios","permalink":"culture-unplugged-studios"}},{"description":"Launched first ipad Documentary channel. ","stoned_year":2011,"stoned_month":6,"stoned_day":16,"source_url":"http://www.cultureunplugged.com/film_festival_TV/documentary_ipad/","source_text":null,"source_description":"Film Festival TV","stoneable_type":"Company","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"name":"Culture Unplugged Studios","permalink":"culture-unplugged-studios"}}],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}