{"name":"Cyber-Duck","permalink":"cyber-duck","crunchbase_url":"http://www.crunchbase.com/company/cyber-duck","homepage_url":"http://www.cyber-duck.co.uk","blog_url":"http://www.cyber-duck.co.uk/#duck(6)","blog_feed_url":"http://www.cyber-duck.co.uk/blog/index.php/feed","twitter_username":"Cyberduck_uk","category_code":"other","number_of_employees":20,"founded_year":2005,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"london-web-design, award-winning-web-production, web-design-london","alias_list":null,"email_address":"info@cyber-duck.co.uk","phone_number":"+44 (0)20 8736 0920","description":"Digital Agency","created_at":"Thu Jun 11 17:21:35 UTC 2009","updated_at":"Mon Apr 02 01:52:45 UTC 2012","overview":"<p>Cyber-Duck is a leading digital agency delivering award winning corporate websites, SaaS applications and mobile apps whilst offering UX consultancy and marketing services. </p>\n\n<p>The company, established in 2005, has worked with over 100 corporate enterprises, start-ups, governments and NGOs such as the European Union, NordicBet, BAM, Jewson, Halcyon Gallery and Arsenal FC.</p>\n\n<p>Utilising a UCD (user centred design) methodology and an agile (Scrum) philosophy for project management and development, Cyber-Duck provides comprehensive solutions that streamline business processes and drive conversions. Cyber-Duck’s five core divisions are:</p>\n\n<p>Web &amp; Mobile – At the forefront of web &amp; mobile innovation, Cyber-Duck offers UCD services, copywriting &amp;, art direction, best -in-class technology and extensive digital marketing expertise to produce corporate websites, ecommerce, mobile apps and bespoke web platforms.</p>\n\n<p>UX Consultancy – The UX (user experience) consultancy division uses eye tracking and user testing services incorporating focus groups to formulate and sharpen your business strategy. This methodology also includes competitor analysis, web analytics, stakeholder interviews and web surveys.</p>\n\n<p>SaaS Technology – Cyber-Duck leverage the latest frameworks to provide scalable SaaS solutions including ecommerce, ERP, CRM and CMS platforms. By implementing web analytics, Business Intelligence and cloud hosting project productivity and conversions are increased.</p>\n\n<p>Branding – The creative award-winning team of in-house brand strategists, copywriters, designers and animators work alongside clients to ensure that brands make the right impression both online and offline. Cyber-Duck is an expert at aligning branding with client’s strategic objectives.</p>\n\n<p>Marketing – Cyber-Duck help clients to establish marketing plans to increase customer engagement and brand visibility via monthly retainers which include SEO, social media services, PPC, A/B Tests, viral marketing, email marketing and ongoing UX optimisation.</p>\n\n<p>Cyber-Duck’s ethos and breadth of expertise have resulted in the company being internationally recognised as a leader in the digital field appearing on Channel 5’s The Gadget Show, Autodesk annual conference, SXSW and Ad:Tech London.  Cyber-Duck have won Webby Awards, Horizon Interactive Awards, the Davey Awards, the Interactive Media Awards, the W3 Awards, the Europrix Top Talent Awards and the Construction Marketing Awards in recognition of its work.</p>","image":{"available_sizes":[[[150,70],"assets/images/resized/0004/8059/48059v2-max-150x150.jpg"],[[250,118],"assets/images/resized/0004/8059/48059v2-max-250x250.jpg"],[[450,212],"assets/images/resized/0004/8059/48059v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"Managing Director","person":{"first_name":"Danny","last_name":"Bluestone","permalink":"danny-bluestone","image":{"available_sizes":[[[150,112],"assets/images/resized/0005/3337/53337v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0005/3337/53337v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0005/3337/53337v2-max-450x450.jpg"]],"attribution":""}}},{"is_past":false,"title":"Development Director","person":{"first_name":"Sylvain","last_name":"Reiter","permalink":"sylvain-reiter","image":null}},{"is_past":false,"title":"Production Director","person":{"first_name":"Matt","last_name":"Gibson","permalink":"matt-gibson","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Head Office","address1":"12 High Street","address2":"","zip_code":"WD6 3EP","city":"Elstree","state_code":null,"country_code":"GBR","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}