{"name":"dealsfive","permalink":"dealsfive","crunchbase_url":"http://www.crunchbase.com/company/dealsfive","homepage_url":"http://www.dealsfive.com","blog_url":"","blog_feed_url":"","twitter_username":"dealsfive","category_code":"ecommerce","number_of_employees":10,"founded_year":2010,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"deals, offers, e-commerce, discount, coupons, deals-in-delhi, deals-in-your-area, dealsfive, dealsfive-com, dealsfive-company","alias_list":null,"email_address":"info@dealsfive.com","phone_number":"","description":"Deals and Discounts","created_at":"Mon Nov 14 10:31:48 UTC 2011","updated_at":"Tue Nov 29 23:04:24 UTC 2011","overview":"<p>Deals Five is e-commerce Marketing firm having Head office at L-2, 192 B, Kalkaji, New Delhi -110019 and sole owner of website dealsfive.com. We provide Marketing services in the fields of Hotels, Restaurant, Clothing, Fashion &amp; Beauty and Lifestyle etc. In our website Information is listed attractively by product categories localities – making it easy for retail buyers to pick best deals in their neighborhood. We work 24 x 7 to bring the best deals all across the Delhi NCR Region and deals which are specific to your Area (Locality) at the best negotiated price. </p>\n\n<p>Our team has highly qualified team of designers, developers, marketing professionals and customer service team working to make the user&#8217;s experience a delightful one. </p>\n\n<p>Deals Five Meaning: We bring the Top five deals every week and 5th deal offers the maximum discount. </p>\n\n<p>Mission: Our mission is to allow masses enjoy luxury. </p>\n\n<p>We at Deals Five believe that in business you get what you want by giving other people what they want. Here we would like to join hands as alone we can do so little, but together we can do so much.</p>\n\n<p>DealsFive ™ is a product of dealsfive and is based on a strong eCommerce and mCommerce technology foundation. </p>\n\n<p>Dealsfive Solutions is a young &amp; exciting New technology firm with an impressive professional experience spanning marketing, business development and technology in some of the Most reputable firms like Infosys, Wipro, Aricent, CSC,RAMCO,Cognizant and Subex.</p>\n\n<p>Team Dealsfive carries strong academic backgrounds of Engineering and MBA from some of the Most premier institutes like the Indian Institute of Science, Indian Institute of Management &amp; Wharton Business School. Dealsfive incorporates a credible entrepreneurial experience that involves setting-up and running successful firms.</p>","image":{"available_sizes":[[[150,71],"assets/images/resized/0016/4501/164501v1-max-150x150.png"],[[184,88],"assets/images/resized/0016/4501/164501v1-max-250x250.png"],[[184,88],"assets/images/resized/0016/4501/164501v1-max-450x450.png"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"Mr.","person":{"first_name":"Vishal","last_name":"Mehra","permalink":"vishal-mehra","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Dealsfive","address1":"L-2 192 ","address2":"Kalkaji","zip_code":"110019","city":"New Delhi","state_code":null,"country_code":"IND","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}