{"name":"Delivery ","permalink":"delivery","crunchbase_url":"http://www.crunchbase.com/company/delivery","homepage_url":"http://Delivery.com","blog_url":"http://blog.delivery.com/","blog_feed_url":"","twitter_username":"Deliverydotcom","category_code":"ecommerce","number_of_employees":null,"founded_year":2004,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"","alias_list":null,"email_address":"fertile@sunshinesachs.com","phone_number":"212.691.2800","description":"Delivery.com is a leading destination fo","created_at":"Thu Apr 19 17:01:41 UTC 2012","updated_at":"Tue Apr 24 22:33:22 UTC 2012","overview":"<p>Delivery.com is at the forefront of the rapidly expanding market of online to offline, hyper-local e-commerce and a major player amongst their competitors, grubhub and seamless.  Since 2004, Delivery.com&#8217;s mission has been to provide consumers and companies with fast, convenient delivery and pickup from all of their favorite local businesses while at home, at work, or on the go. Today, Delivery.com has over half a million users and a network of nearly 10,000 restaurants, caterers, grocers, and other businesses in over 50 cities nationwide - and is growing every day.</p>\n\n<p>They’re not just restaurants, but grocers, flower, spirits and pet stores.  Delivery.com recently expanded their e-commerce platform to include online grocery shopping. This new initiative offers grocery stores the ability to bring their inventories online and receive online orders from Delivery.com’s user base.</p>\n\n<p>Delivery.com has always put great value in helping those in need, and now with more Americans understanding the importance of contributing to their community, they make sure users know how easy it is to use Delivery.com for good and offer users various ways to get involved with charities on their site.</p>\n\n<p>Particularly as this economy is hitting the small business owner hardest, Delivery.com has focused entirely on e-commerce and supporting the local brick-and-mortar merchant by providing an open source platform that can be leveraged towards the creation of innovative applications and services. More than 10,000 delis, florists, pet shop owners and more are seeing incredible business from partnerships with Delivery.  In addition they Delivery.com  is creating jobs and helping people earn money with their Partner Program. Members of the Partner Program refer local merchants and/or new users, and then earn commissions on orders placed to merchants they sign up, as well as orders placed by users they refer.  There are currently thousands of people across the country enrolled in Delivery.com&#8217;s Partner Program - stay-at-home parents, college students, and those just looking to make some extra cash.</p>\n\n<p>Delivery.com continues to bring it users innovations that differentiate it from its competitors. The chance to review and check-in to our favorite restaurant, corner deli or florist without physically going, but still experiencing their product!  To this point, Delivery.com has teamed up with foursquare to offer its users an experience that no other delivery service has and introduced check -in with foursquare on Delivery.com as well as other features.</p>","image":{"available_sizes":[[[150,42],"assets/images/resized/0018/5068/185068v2-max-150x150.jpg"],[[250,71],"assets/images/resized/0018/5068/185068v2-max-250x250.jpg"],[[353,101],"assets/images/resized/0018/5068/185068v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}