{"name":"Devart","permalink":"devart","crunchbase_url":"http://www.crunchbase.com/company/devart","homepage_url":"http://www.devart.com","blog_url":"http://www.devart.com/blogs/dbforge/","blog_feed_url":"","twitter_username":"DevartSoftware","category_code":"software","number_of_employees":null,"founded_year":1998,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"","alias_list":null,"email_address":"sergii852@gmail.com","phone_number":"","description":"software development company","created_at":"Wed Mar 02 09:42:30 UTC 2011","updated_at":"Tue Sep 04 04:34:32 UTC 2012","overview":"<p>Devart (formerly known as Core Lab) is a software development company specializing in native connectivity solutions and development tools for the most popular databases, including Oracle, SQL Server, MySQL, PostgreSQL, InterBase, Firebird, and SQLite.</p>\n\n<p>Devart is dedicated to providing the fastest available data access and the broadest database support to industry professionals. </p>\n\n<p>Our Product Lines</p>\n\n<p>Since 1998, Devart has developed product lines specialized on native connectivity solutions and development tools. We try to provide high-end products to let you have the fastest data access and the broadest database support. Our products are designed for working with Oracle, Microsoft SQL Server, MySQL, PostgreSQL, InterBase, Firebird, and SQLite servers.</p>\n\n<ul>\n<li>Database Power Tools is a product line consisting of standalone applications and IDE add-ins, that can be integrated with the DAC and ADO.NET product line component editors, giving advanced design-time support for database application development, includes:\n<ul>\n<li>Database Tools for MySQL</li>\n<li>Database Tools for SQL Server</li>\n<li>Database Tools for Oracle</li>\n</ul></li>\n<li>The line of products that provide direct data access for application developers who work with Visual Studio and Delphi includes:\n<ul>\n<li>ADO.NET Data Providers - enhanced data providers for database servers that build on ADO.NET technology to present a complete solution for developing applications based on different database servers.</li>\n<li>VCL/CLX Direct Access Components - powerful tools for developing client/server applications. The fastest and the most flexible data access technologies for Delphi, C++Builder, and Kylix.</li>\n<li>dbExpress Drivers - a database-independent layer that defines common interface to provide fast access to SQL database servers.</li>\n</ul></li>\n<li>SecureBridge is a security-oriented solution designed to help you protect the network connections in your projects from unauthorized access. SecureBridge can be used as a standalone library and in conjunction with our VCL/CLX Direct Access Components.</li>\n</ul>","image":{"available_sizes":[[[150,150],"assets/images/resized/0012/4560/124560v4-max-150x150.jpg"],[[200,200],"assets/images/resized/0012/4560/124560v4-max-250x250.jpg"],[[200,200],"assets/images/resized/0012/4560/124560v4-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}