{"name":"Downhill Publishing","permalink":"downhill-publishing","crunchbase_url":"http://www.crunchbase.com/company/downhill-publishing","homepage_url":"http://www.Fonts4Teachers.com","blog_url":"http://www.Fonts4teachersblog.com","blog_feed_url":"","twitter_username":"Fonts4teachers","category_code":"ecommerce","number_of_employees":5,"founded_year":1998,"founded_month":1,"founded_day":29,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"school-fonts, handwriting-fonts, fonts-4-teachers, fonts-for-teachers, educational-software, downhill-publishing, box-fonts","alias_list":null,"email_address":"duribe@fonts4teachers.com","phone_number":"3104304154","description":"Educational Software","created_at":"Tue Nov 02 22:19:35 UTC 2010","updated_at":"Thu Nov 04 17:40:00 UTC 2010","overview":"<p>Downhill Publishing - Our Company</p>\n\n<p>About the company</p>\n\n<p>DownHill Publishing was founded in 1998 in Los Angeles, California. It was created to provide teachers, administrators, parents and students with innovative, high-quality, and timesaving classroom resources.</p>\n\n<p>About the founder</p>\n\n<p>The executive software designer, Ramón Abajo, worked as a classroom teacher for almost 20 years. Ramón has worked in bilingual and English-only classrooms at the elementary and secondary levels. He has received many awards, including &#8220;Teacher of the Year&#8221; in 1990 (Desert Sands Unified School District, CA). He worked as a high school technology coordinator, and played a key role in the &#8220;New Media Academy&#8221; in conjunction with the Los Angeles Workforce. He is an artist and free spirit, who finds pleasure and satisfaction in fulfilling educational needs. He is a frequent speaker at educational conferences such as CABE (California Bilingual Education), and more recently at Techno-Caribe, Puerto Rico. Ramón brings a fresh approach to today&#8217;s educational challenges.</p>\n\n<p>As a result of his nearly 20 year teaching career (In Spain, The United Kingdom, and Los Angeles County, California), Ramón experienced a need for uniform, easy-to-use computer software, which was both effective and affordable for teachers. He assembled a team of colleagues who joined the effort to make his vision a reality, and thus DownHill Publishing was founded.</p>\n\n<p>Primary projects</p>\n\n<p>Ramón spends his time working on three innovative projects: developing high quality educational software, manufacturing revolutionary rear projection screens, and creating amusing Illuminated Manuscripts.</p>\n\n<ol>\n<li>Software</li>\n</ol>\n\n<p>DownHill Publishing&#8217;s primary focus is on developing educational software for teachers. In accordance with the demands of the education system, we have developed programs that fulfill those needs. Our seven best-selling programs are as follows:</p>\n\n<ol>\n<li>Fonts 4 Teachers</li>\n<li>10-Minute Teachers Planner</li>\n<li>ClipArt 4 Teachers</li>\n<li>Handwriting 4 Teachers</li>\n<li>Amazing Worksheet Maker 4Teachers</li>\n<li>Nameplate maker 4 Teachers</li>\n<li>Award Maker 4 Teachers</li>\n<li>Vocabulary Builder 4 Teachers (in progress)</li>\n</ol>\n\n<p>All of seven programs are extremely useful and very cost efficient. We have donated the licensing of Fonts4Teachers to the ICON Group, who work in conjunction with the &#8220;Bill and Melinda Gates Foundation&#8221; to create educational texts and circulate them throughout the countries of the world.</p>\n\n<ol>\n<li>Lucera Projections</li>\n</ol>\n\n<p>Lucera Projection Display (LPD) is a high-end rear projection screen. Lucera&#8217;s stunning design and unparalleled quality attracted the attention of Dr. Gadget at the International Consumer Electronics Show (CES) in Las Vegas on 2006. Lucera Projection Display was shown on ABC&#8217;s &#8220;Tony Danza Show&#8221; as one of &#8220;the revolutionary ways to enjoy the Super-Bowl&#8221;.</p>\n\n<ol>\n<li>Illuminated Manuscripts</li>\n</ol>\n\n<p>Among his other endeavors, Ramón has decided to revive the lost art of creating stunning Illuminated Manuscripts on vellum, using medieval methods and techniques. The first unique manuscript is currently in the making, and will be released in two years, after a total of 4 years of hands-on production. These books are completely unique and are unequaled in beauty and elegance.</p>\n\n<p>News Flash</p>\n\n<p>We are very happy to announce that DownHill Publishing has licensed its acclaimed Fonts4Teachers program to ICON Group International to develop e-books in Africa, Asia, and Latin America. The project was created by Professor Philip M. Parker, INSEAD Chair Professor of Management Science, who is the inventor of the &#8220;smart-writing machine&#8221;, an amazing device that has allowed ICON Group to publish more than 200,000. His &#8220;K to 12 +2&#8221; project aims to create educational texts (e-book and print) in all the world&#8217;s languages, especially for the smaller languages ignored by traditional publishers. Mr. Parker is presently involved in a number of multilingual rural education projects around the world funded, in part, by the &#8220;Bill and Melinda Gates Foundation.&#8221;</p>\n\n<p>DownHill Publishing commitment to social responsibility</p>\n\n<p>DownHill Publishing is committed to creating exceptional products to help change the way people across the world teach, learn, communicate, and enjoy the beauty of culture. DownHill Publishing is dedicated to providing innovative technologies and teaching resources. We are extremely devoted to ensuring that our products, employees, sites, and suppliers follow the commitments we have made to socially responsible business practices. We have donated the licensing of Fonts4Teachers to ICON Group International.</p>\n\n<p>Membership and Professional Organizations</p>\n\n<p>DownHill Publishing is a member of a large number of Professional Associations and publications such as: The Book Business, The Art Book, The Fine Books and Collections, The New York Public Library, The Piermont Morgan Library, The NY Center of the Book Arts, The NY Society of Calligraphers, The Society of Guilders, The Jewish Museum, and AFEDA (Association of Book-Binders), IAMPETH (International Association of Master Penmen, Engrossers and Teachers of Handwriting)</p>\n\n<p>Location</p>\n\n<p>DownHill Publishing is already in two locations\n36 Clover St.\nNewark, NJ 07105\nAnd\n541 E. 20th St. Ste. 7H\nNew York, NY 10010</p>\n\n<p>Phone: (800)203 0612 • www.downhillpublishing.com • info@downhillpublishing.com</p>\n\n<p>DownHill Publishing is committed to quality projects and good design. </p>","image":{"available_sizes":[[[150,110],"assets/images/resized/0010/8392/108392v2-max-150x150.jpg"],[[250,183],"assets/images/resized/0010/8392/108392v2-max-250x250.jpg"],[[450,330],"assets/images/resized/0010/8392/108392v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}