{"name":"EQUISO","permalink":"equiso","crunchbase_url":"http://www.crunchbase.com/company/equiso","homepage_url":"http://www.equiso.com","blog_url":"http://www.kickstarter.com/projects/2028163448/equiso-smart-tv-turn-any-tv-into-a-smart-tv","blog_feed_url":"","twitter_username":"equisoSmartTV","category_code":"hardware","number_of_employees":5,"founded_year":2012,"founded_month":6,"founded_day":15,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"technology, smart-tv, gaming, content, streaming, device, video","alias_list":null,"email_address":"jeanineheller@gmail.com","phone_number":"508.930.6232","description":"We make your dumb tv, smart","created_at":"Tue Oct 09 19:42:32 UTC 2012","updated_at":"Thu Dec 06 07:57:30 UTC 2012","overview":"<p>Equiso Smart TV - Make your dumb tv&#8230; smart.</p>\n\n<p>Turn any TV into a Smart TV. Android 4.0. Control it with the wave of a hand, using our revolutionary gesture remote. </p>\n\n<p>Equiso puts the Power of an Android tablet on your TV.  Combined with our interactive remote, Equiso will truly refine your TV experience.</p>\n\n<p>Watch stunning 1080p HD content from Netflix, Hulu Plus, YouTube and many more! Send emails, update your facebook status, play Angry Birds or Fruit Ninja like never before. Download new apps, create and display a powerpoint, listen to music, read books, and play most all those interactive games you love so much on your phone or tablet.</p>\n\n<p>Imagine showing up to do a presentation, and all you had to do, was plug it in, grab your remote, and you&#8217;re ready to go. Game night with your buddies is now easier than ever.  Bring your device with you in your pocket, plug in and play. Our 1.4 HDMI 1080p port allows for direct plugin to any TV, Monitor, or Projector. This enables any of these devices to instantly become a Smart TV and eliminates the need for extra cables. </p>\n\n<p>A Remote like no other</p>\n\n<p>This remote is like nothing you have ever experienced before. Advanced accelerometers and gyros sense your gestures, turning them into life like interaction with your Smart TV. Soft touch buttons on top add to your Smart TV experience. Simply flip the remote over and it becomes a full keyboard, no pain staking tasks of typing letter by letter on the screen. Flip it back over and your gesture remote is back in full action to conquer that next level of Angry Birds or Tower Defense. Don&#8217;t worry about accidentally pressing the buttons on the keyboard. Our gyros sense the remotes position and turn off the keyboard as you glide your way around. This is truly the next step into a Smart TV.</p>\n\n<p>Under the Hood</p>\n\n<p>We wanted to created a device that was affordable for everyone without sacrificing performance.</p>\n\n<p>Equiso is equipped with a new, powerful, redesigned 1Ghz Arm Cortex A5 Processor. Using the lastest technology in memory it features 512MB of DDR3 memory that compliments the performance of the system. Graphics was very important as we wanted to include 3D gaming. To achieve this we installed a Mali 400 graphics processor. High Definition Streaming of movies, gaming, and music was a must, so we added a Wireless N radio that is capable of speeds up 250 megabits, to ensure blazing fast downloads. Our 1.4 HDMI plug n play interface allows for direct plugin to any TV, Monitor, or Projector and supports 3D Video. Included is 8GB of internal storage for storing music, movies, documents, games and more. We put a USB port on the back for a keyboard, a mouse, external hard drives and anything else you can plug in. Heat was a major concern for a form factor this small. For this reason we chose the most energy efficient Arm CPU per watt. We worked tirelessly on a case that would disperse the heat but handle the dust. Equiso is very quiet as there are no moving parts. We truly hope your enjoy our product.</p>","image":{"available_sizes":[[[150,29],"assets/images/resized/0021/4921/214921v2-max-150x150.jpg"],[[250,49],"assets/images/resized/0021/4921/214921v2-max-250x250.jpg"],[[450,89],"assets/images/resized/0021/4921/214921v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"Co-founder / VP of DIstribution","person":{"first_name":"Jeffry","last_name":"Waye","permalink":"jeffry-waye","image":null}},{"is_past":false,"title":"Co-founder / VP Business Dev & Growth Strategy","person":{"first_name":"Jeanine","last_name":"Heller","permalink":"jeanine-heller-2","image":{"available_sizes":[[[100,150],"assets/images/resized/0014/7705/147705v2-max-150x150.jpg"],[[140,210],"assets/images/resized/0014/7705/147705v2-max-250x250.jpg"],[[140,210],"assets/images/resized/0014/7705/147705v2-max-450x450.jpg"]],"attribution":""}}},{"is_past":false,"title":"Founder & CEO","person":{"first_name":"Adam","last_name":"McBride","permalink":"adam-mcbride","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$250k","funding_rounds":[{"round_code":"seed","source_url":"http://www.kickstarter.com/projects/2028163448/equiso-smart-tv-turn-any-tv-into-a-smart-tv","source_description":"Kickstarter","raised_amount":250000,"raised_currency_code":"USD","funded_year":2012,"funded_month":7,"funded_day":28,"investments":[]}],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"EQUISO HQ","address1":"One Broadway","address2":"14th Fl","zip_code":"02142","city":"Cambridge","state_code":"MA","country_code":"USA","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[{"available_sizes":[[[150,95],"assets/images/resized/0021/4920/214920v2-max-150x150.jpg"],[[250,159],"assets/images/resized/0021/4920/214920v2-max-250x250.jpg"],[[450,286],"assets/images/resized/0021/4920/214920v2-max-450x450.jpg"]],"attribution":null}],"external_links":[]}