{"name":"ETS Worx","permalink":"ets-worx","crunchbase_url":"http://www.crunchbase.com/company/ets-worx","homepage_url":"http://www.euroteamservices.biz","blog_url":"","blog_feed_url":"http://www.euroteamservices.biz/feed/","twitter_username":"","category_code":"public_relations","number_of_employees":4,"founded_year":2007,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"market-research, research, automated-audience-measurement, shopper-research, gender-recognition, digital-signage, dooh, targeted-media, instore-communications","alias_list":null,"email_address":"info@euroteamservices.biz","phone_number":"31 499 577 663","description":"Automated audience research","created_at":"Thu Aug 05 13:32:43 UTC 2010","updated_at":"Mon Aug 23 18:04:39 UTC 2010","overview":"<p>ETS Retail Lab© provides the most complete infrastructure for unmanned, automatic and objective audience measurement and analysis of in-store shopper behavior.</p>\n\n<p>Businesses now have the choice of a huge diversity of in-store communication tools where the choice is not always made on the most profitable or efficient onces. Furthermore, there is an increasing pressure on the creation of an optimal budget effort. ETS Retail Lab © transforms the tombola of selecting instore communication tools into a balanced and measured palette of instore marketing tools where the selection is based on reliable and insightful statistics rather than gut-feeling, the cheapest or most expensive ones or even random choices!</p>\n\n<p>Current research methods are intrusive to the shopper who doesn’t want to wear sensors, give interviews or being stalked otherwise. Besides the fact that the intrusiveness of these methods skews the results – which shopper will purchase or even look at hammeroid creme when being observed? – the methods also fail in terms of sample size, precision, scalability and lead time. In addition, they are typically very expensive. ETS Retail Lab © drastically change the parameters here.</p>\n\n<p>Shopper research with ETS Retail Lab © is, relatively cheap, provides huge sample sizes, typically hundreds of thousands of samples, is highly scaleable to any number of stores and delivers accurate measurements. Moreover the method is completely un-intrusive while fully protecting the privacy of shoppers going beyond the Esomar Guidelines.</p>\n\n<p>Our methodology consists of placing tiny sensors, built-in or stand-alone, which measure attention, viewing quality, age, gender and even interaction with products. This is done with a variety of sensors, most of which operate on the basis of real-time video. In addition we can measure shoppers taking and putting back products.</p>\n\n<p>Data is measured directly, 24/7 and uploaded to a sophisticated data warehouse with a variety of reports and analytics tools. From the “dynamic dashboard reporting and in-depth analyses are carried out. ETS Retail Lab © allows crossing behavioral statistics with a host of dimensions such as message, display-type, position in the store, sex, age, day of the week, distance to the object. We also allow relevant data files from other sources to be uploaded and compared to behavioral data, such as cash register transactions, weather conditions and costs of POS Tools or messages on a digital signage network.</p>\n\n<p>What is the profile of your audience?\nBasic indicators that are registered by default:</p>\n\n<ul>\n<li>Presence in terms of volume and duration</li>\n<li>gender * Age categories: a senior, adults, young adults and children.</li>\n<li>Distance from viewer to object</li>\n<li>awareness and viewing with a resolution of 100ms intervals</li>\n<li>taking and putting back products</li>\n</ul>\n\n<p>When the costs of the POS materials, messages or instore communication tools are known, ETS Retail Lab © reveals</p>\n\n<ul>\n<li>what is the ROI of each POS display or ad on a digital signage network?</li>\n<li>which POS materials score in which target groups (are you reaching the right audience?)</li>\n<li>the ideal position of POS tools in terms of position in the store and distance to the viewers</li>\n<li>the lifetime/ aging curve of attention, when do shoppers get accustomed to- and filter out the message or display?</li>\n<li>what are the ideal days and time ranges to buy advertising space (for digital content)?</li>\n<li>what is the profile of your shoppers in terms of age and gender?</li>\n<li>which ad works best, get’s most attention of the right audience?</li>\n</ul>\n\n<p>Knowing these performance indicators instore marketing managers can easily compile the ideal combination of instore communication tools that deliver the highest ROI and that hit the right audience. They can even predict it before rolling it out!</p>\n\n<p>No privacy issues! Faces of shoppers are not stored and no personally identifyable information is stored in any way. ETS Retail Lab © goes beyond the Esomar Guidelines with regard to respecting shoppers’privacy.</p>\n\n<p>ETS Retail Lab © is ideal for:</p>\n\n<ul>\n<li>a/b testing,</li>\n<li>pre-testing</li>\n<li>continuous research</li>\n<li>intelligent aggregation of data across different measuring methods (sensors)</li>\n</ul>\n\n<p>ETS Retail Lab © is offered through a hardware/ software as a service model preventing huge upfront investments and costly learning curves while providing high availability and service levels. In terms of both the price and approach it is suitable for small temporary projects of a few days to large-scale permanent set-ups. Projects are rolled out quickly while the installation can also be performed by third parties.</p>","image":{"available_sizes":[[[150,149],"assets/images/resized/0009/6143/96143v2-max-150x150.jpg"],[[250,249],"assets/images/resized/0009/6143/96143v2-max-250x250.jpg"],[[337,336],"assets/images/resized/0009/6143/96143v2-max-450x450.jpg"]],"attribution":null},"products":[{"name":"ETS RetailLab","permalink":"ets-retaillab","image":null},{"name":"ETS Quividi to Ryarc Integrator","permalink":"ets-quividi-to-ryarc-integrator","image":null}],"relationships":[{"is_past":false,"title":"CEO","person":{"first_name":"Frank","last_name":"Engelman","permalink":"frank-engelman","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Main office","address1":"De Scheper 312-314","address2":"","zip_code":"5688 HP ","city":"Oirschot","state_code":null,"country_code":"NLD","latitude":null,"longitude":null}],"milestones":[{"description":"Concluded a major market research project having 500.000 viewing moments generated by 20.000 shoppers to naalyse their shopping behaviour","stoned_year":2010,"stoned_month":8,"stoned_day":21,"source_url":"http://www.euroteamservices.biz/ets-in-the-media/fmcg-brand-takes-the-lead-in-in-store-marketing-research/","source_text":null,"source_description":"Press release","stoneable_type":"Company","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"name":"ETS Worx","permalink":"ets-worx"}}],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[{"external_url":"http://www.euroteamservices.biz/ets-in-the-media/fmcg-brand-takes-the-lead-in-in-store-marketing-research/","title":"press article for a major project"}]}