{"name":"ALIVE","permalink":"everyman-alive","crunchbase_url":"http://www.crunchbase.com/company/everyman-alive","homepage_url":"","blog_url":"","blog_feed_url":"","twitter_username":"","category_code":null,"number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"","alias_list":null,"email_address":"","phone_number":"","description":"","created_at":"Sat Feb 13 23:48:54 UTC 2010","updated_at":"Thu Aug 02 20:17:23 UTC 2012","overview":"<p>Since 2009, Founders of ALIVE, Simon Salter and Andrew Salter have been spearheading what has now become a global awareness campaign and live broadcasted entertainment event to eliminate male cancer as a cause of death and which has been recognized by Simon Fuller, Universal Music Group and Google as having the potential to become one of the largest grassroots campaigns of our generation, saving untold lives. </p>\n\n<p>They have pioneered a world’s-fist campaign that uses a new technology and the power of entertainment to unite the World behind the cause to breakdown the taboo and removing the internal barriers associated with embarrassment, fear and naivety causing the needless deaths of men from testicular and prostate cancer and which culminates in a broadcasted entertainment event to celebrate the campaign.</p>\n\n<p>They have attracted the committed support from the industries creative and business leaders. from record labels (Universal Music Group, Sony Music Entertainment, Warner Music Group), entertainment brands (American Idol), entertainment corporations (William Morris Endeavor, CAA, Independent Talent Group), motion picture directors (Richard Curtis, Ridley Scott Associates) sporting leagues (NFL) and major TV networks (ABC and MTV Networks), as well as leading marketers (Richard Edelman) and marketeers (AMV BBDO) and they have formed a core executive and production team made up of the driving forces and creators of the world’s most successful annual award shows and TV events which include The Grammy Awards, MTV Video Music Awards, The Super Bowl Half Time Show, 2012 Olympics Opening Ceromony and The Academy Awards.</p>\n\n<p>In 2010 they partnered with the Prostate Cancer Foundation and joined forces with the pioneers responsible for revolutionizing the media and entertainment business creating the Founding Fathers board to maximize the campaigns success through the power of media and entertainment. The Founding Father’s include Simon Fuller creator of the most successful girl group of all time (Spice Girls), the world’s biggest TV franchise (American Idol) and developing the world’s most iconic talent brand (Beckhams), Joel A. Katz the world’s leading media and entertainment lawyer, Harold Tillman CBE, Chairman of the British Fashion Council and Michael Milken the most important financier since J. P. Morgan.</p>","image":{"available_sizes":[[[150,120],"assets/images/resized/0014/9284/149284v2-max-150x150.jpg"],[[250,200],"assets/images/resized/0014/9284/149284v2-max-250x250.jpg"],[[450,360],"assets/images/resized/0014/9284/149284v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"Co-Founder and President","person":{"first_name":"Andrew","last_name":"Salter","permalink":"andrew-salter","image":{"available_sizes":[[[150,128],"assets/images/resized/0007/6998/76998v6-max-150x150.jpg"],[[250,214],"assets/images/resized/0007/6998/76998v6-max-250x250.jpg"],[[450,385],"assets/images/resized/0007/6998/76998v6-max-450x450.jpg"]],"attribution":""}}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"ALIVE (US)","address1":"9200 Sunset Blvd.","address2":"","zip_code":"90069","city":"Los Angeles","state_code":"CA","country_code":"USA","latitude":null,"longitude":null},{"description":"ALIVE (UK)","address1":"16 Stratford Place","address2":"Mayfair","zip_code":"W1C 1BF","city":"London","state_code":null,"country_code":"GBR","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[{"external_url":"http://www.alivecampaigns.com","title":""},{"external_url":"http://www.facebook.com/alivecampaigns","title":"Facebook"}]}