{"name":"Exhibia","permalink":"exhibia","crunchbase_url":"http://www.crunchbase.com/company/exhibia","homepage_url":"http://www.exhibia.com","blog_url":"","blog_feed_url":"","twitter_username":"","category_code":"ecommerce","number_of_employees":10,"founded_year":2011,"founded_month":4,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"group-shopping, social-shopping, penny-auctions","alias_list":null,"email_address":"","phone_number":"","description":"Group Shopping","created_at":"Fri May 25 16:47:30 UTC 2012","updated_at":"Wed Jul 18 23:01:49 UTC 2012","overview":"<p>Exhibia group shopping was invented in the minds of entrepreneur Mike Furlong and computer  scientist Victor Salazar. Victor and Mike started developing Exhibia in April of 2011 in a hostal style setting in Medellin, Colombia. The goal and mission of Exhibia was clear: to develop a penny auction style shopping environment, where all bids are by verified users, and items are to be  fully paid to eliminate any financial loss for the company.</p>\n\n<p>The combined experience of Victor and Mike in the field of online shopping and auctions surpasses 7 years. The team had worked together on a similar project and both agreed on the  weaknesses of the current penny auction model, mainly the lack of transparency.</p>\n\n<p>The major breakthrough in the developement of Exhibia came when Victor presented  a concept previously familiar to him, called “crowd funding”. In crowd funding a  group of poeple pool their money together to support efforts initiated by the parent company. </p>\n\n<p>The idea of combining “crowd funding” and “penny auctions” was born. The term “auction” has been used and abused by multiple internet startups so much, that the term “auction” has a bad reputation or brings out negative mental images on many. The new concept would need to be defined without the word auction. By doing some keyword and search term research, Mike came up with the term “group shopping” which successfully describes the new concept.</p>\n\n<p>In group shopping each item  for sale would need to go through 2 phases. In the first phase the item needs to be fully funded by the method of crowd funding for it to be moved on to the next phase. In the second phase the item is opened for a penny auction style bidding competition. The only way for users to obtain bids is to fund an item.</p>\n\n<p>An international patent application for group shopping was soon filed by Mike. This revolutionary new way to shop has not yet been tested with live bidders, but based out of his previous experience Mike realized that the concept will bring many copycats if it was to work.</p>\n\n<p>Exhibia Group Shopping is expected to be launched in Fall of 2012.</p>","image":{"available_sizes":[[[150,27],"assets/images/resized/0019/1798/191798v2-max-150x150.png"],[[207,38],"assets/images/resized/0019/1798/191798v2-max-250x250.png"],[[207,38],"assets/images/resized/0019/1798/191798v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}