{"name":"fabianas.com","permalink":"fabianas-com","crunchbase_url":"http://www.crunchbase.com/company/fabianas-com","homepage_url":"http://fabianas.com","blog_url":"http://blog.fabianas.com","blog_feed_url":"","twitter_username":"","category_code":"public_relations","number_of_employees":54,"founded_year":2012,"founded_month":11,"founded_day":25,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"match, date, pof, fabiana, fabianas-com, flippa","alias_list":null,"email_address":"support@fabianas.com","phone_number":"8433853870","description":"date online","created_at":"Sun Nov 25 22:48:58 UTC 2012","updated_at":"Sun Nov 25 23:55:00 UTC 2012","overview":"<p>Instant chat is a fun and quick way to chat to members. Instant chat on fabiannas in very similar to other instant messaging service, such as MSN messenger or Skype, so the process will probably be familiar to you. Don’t worry if it’s not – it’s so easy to use and our online site tour and help facilities will tell you all you need to know.The chat facilities available on fabiannas have special features to help you express your emotions online, and you can also you use our audio-video chat facilities to see and hear your online dates.Our chat facilities store your new friends’ contact details – so they are easy to find and contact, and you can see who is and isn’t online.You can use the instant chat to get to know someone, flirt and have fun! You are in complete control over the direction your chat takes and also whether or not you wish to continue the chat. You can add your new found buddies to your friends list and have an ongoing chats whenever you are online. Our instant chat can help you find your match quickly and you can meet a lot of interesting people.When someone sends you an instant chat you can start chatting to them straight away, or you might want to view their profile first. Quick links from the chat facility takes you straight into their profile, so you can find out more about them as or before you respond. Instant chat is private between you and the member you are chatting to – so you can tell as much or as little as you want, and flirt as much as you like.Your chat history will be automatically saved, so if you haven’t chatted for a few days you can look back over your history and pick up where you left off.With our easy to use chat facilities – you will be chatting to people of hours on fabiannas . Register now and get our chat facilities.</p>","image":null,"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}