{"name":"Fidelis","permalink":"fidelis","crunchbase_url":"http://www.crunchbase.com/company/fidelis","homepage_url":"http://www.fideliseducation.com","blog_url":"http://www.fideliseducation.com/blog","blog_feed_url":"","twitter_username":"fidelised","category_code":"education","number_of_employees":15,"founded_year":2011,"founded_month":4,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"higher-education, education-technology, military","alias_list":null,"email_address":"info@fidelis-inc.com","phone_number":"1-800-379-3004","description":"Higher Education Technology Company","created_at":"Thu Feb 02 01:29:43 UTC 2012","updated_at":"Fri Feb 03 23:04:52 UTC 2012","overview":"<p>About Us</p>\n\n<p>Fidelis is a venture funded technology company backed by Accel Partners, Novak Biddle, OATV, and Kapor Capital.  </p>\n\n<p>The company was established and funded in 2011 to solve a complex and persistent problem:  the military to civilian career transition is harder than it should be.  As of this writing, veteran unemployment stood at 20% for vets of Iraq and Afghanistan, underemployment for that group stood at 50% and approximately 75% of veterans who begin some kind of post secondary education don&#8217;t graduate.  </p>\n\n<p>Fidelis was founded by a former military officer and our employees come from the ranks of the military so we understand the problem more acutely than most.  We believe that the military does a phenomenal job of preparing its labor force for its needs, but that soldiers need to retool to succeed in a civilian industrial context.  We need to learn to work in networks in addition to a chains of command.  We need to build new skills.  And we need to recast our talents towards new objectives.</p>\n\n<p>We think that the military turns out great raw material that has qualities that civilian industry needs:  leadership, teamwork, grit, and decision making.  But we need to reinvent ourselves for civilian industry.</p>\n\n<p>Mission</p>\n\n<p>“Fidelis provides an end-to-end education solution for the military-to-civilian career transition.”</p>\n\n<p>Core Beliefs</p>\n\n<p>Focus on student objectives and all else will fall into place.</p>\n\n<p>Learning is fundamentally a social experience.</p>\n\n<p>Technology is not the sole solution to improving education, it’s a means to an end.</p>\n\n<p>Design is crucial to human connection.</p>\n\n<p>Talent matters.  Hard work matters more.</p>\n\n<p>Diversity is essential to innovation.</p>\n\n<p>People are happiest when they’re doing worthwhile work with people they respect.</p>\n\n<p>Core Values</p>\n\n<p>Transparency, Accountability, Quality, Humor, Data Driven Decision Making, Simplicity</p>\n\n<p>Entrepreneurship </p>\n\n<p>Who owns Fidelis&#8217;s data?</p>\n\n<p>Fidelis is completely transparent in all aspects of our business.  We think that soldiers and others are frequently taken advantage of by poor quality colleges.  We focus on trying to steer students to institutions that will be meaningful to their career aspirations.</p>\n\n<p>Our promise to students:</p>\n\n<p>Fidelis is 100% focused on your objectives\nYour data is yours and only yours.  It will never be sold to any third parties, nor will it be used to advertise to you.\nFidelis Business Model </p>\n\n<p>We earn revenues in three ways.</p>\n\n<p>We build the technology, provide transition coaching services, place students into companies, and deliver remial and supplementary education.  This allows our teaching partners to develope and deliver world-class courses.  Teaching partners and Fidelis share tuition revenue.\nColleges outsourcing coaching, mentoring, and placement services to Fidelis in order to allow them to better serve the population\nCompanies outsource mentoring, transition coaching and industry specific training services to Fidelis to reduce their risks and drive their competitiveness\nWe are a venture-backed technology company because our corporate status enables us to tap into excellent engineering talent and provides us access to capital markets.  We have to invent, and have found that for this mission, the C-Corporation is the best form of organization.  The light bulb, the automobile, Google, Facebook, and the iPod, were all built by C-Corps.  In our greatest aspirations, we aspire to build technology that is as meaningful.</p>","image":{"available_sizes":[[[150,108],"assets/images/resized/0017/2567/172567v2-max-150x150.png"],[[250,180],"assets/images/resized/0017/2567/172567v2-max-250x250.png"],[[318,230],"assets/images/resized/0017/2567/172567v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"Founder & CEO","person":{"first_name":"Gunnar","last_name":"Counselman","permalink":"gunnar-counselman","image":null}},{"is_past":false,"title":"CoFounder & CTO","person":{"first_name":"Anoop","last_name":"Jayadevan","permalink":"anoop-jayadevan","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Head Quarters","address1":"116 New Montgomery #237","address2":"#207","zip_code":"94105","city":"San Francisco","state_code":"CA","country_code":"USA","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[{"external_url":"http://techcrunch.com/2011/04/24/fidelis-college-raises-money-to-actually-support-our-troops/","title":"Fidelis College Raises Money to Actually Support Our Troops"},{"external_url":"http://chronicle.com/blogs/wiredcampus/startup-fidelis-college-to-offer-hybrid-college-experience-to-veterans/33314","title":"Startup to Offer Hybrid College Experience to Veterans"},{"external_url":"http://tedxtalks.ted.com/video/Gunnar-Counselman-TEDxSF-Moving","title":"Gunnar Counselman - TEDxSF - Moving Beyond the Diploma"}]}