{"name":"Floodlight Investing","permalink":"floodlight-investing","crunchbase_url":"http://www.crunchbase.com/company/floodlight-investing","homepage_url":"http://www.floodlightinvesting.com","blog_url":"","blog_feed_url":"","twitter_username":"","category_code":"software","number_of_employees":5,"founded_year":2009,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"asset-allocation, portfolio-construction, investment, financial-adviser, ifa","alias_list":null,"email_address":"info@floodlightinvesting.com","phone_number":"","description":"Investment and portfolio construction","created_at":"Sun Jan 09 16:08:30 UTC 2011","updated_at":"Thu Jan 20 02:15:55 UTC 2011","overview":"<p>Floodlight is a portfolio construction and investment planning tool for financial advisers.</p>\n\n<p>We believe that portfolios should be built on the basis of long-term asset allocations that are customized to individuals’ unique needs. We also believe that thorough analysis and understanding of the portfolio is essential for long-term investing success. By examining how a potential portfolio would have performed in the past and how it might perform in the future, you’ll be in a better position to tweak the portfolio so that it’s optimally suited to your clients’ needs, and so that it’s got a better chance of helping them achieve their goals. And, we believe that by helping your clients develop realistic expectations and a rational understanding of how their portfolios should perform, they’ll be in a better position to stay the course with confidence, through the inevitable market cycles.</p>\n\n<p>Floodlight is built with these goals in mind:</p>\n\n<ul>\n<li>Help advisers build better portfolios for their clients. A firm belief of ours is that portfolios that are customized to individuals’ unique needs are more likely to achieve their goals and objectives.</li>\n<li>Help advisers communicate more effectively with clients. Through the use of one-click reports that communicate advanced topics clearly and simply, advisers are able to have more meaningful conversations with their clients that should increase the client’s confidence and the strength of the relationship.</li>\n<li>Help advisers expand their client base and build business. Floodlight is a unique service offering that enables advisers to serve and interact with clients in a way not possible using other services.</li>\n</ul>","image":{"available_sizes":[[[150,40],"assets/images/resized/0011/6607/116607v2-max-150x150.png"],[[209,56],"assets/images/resized/0011/6607/116607v2-max-250x250.png"],[[209,56],"assets/images/resized/0011/6607/116607v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}