{"name":"GetWellNetwork, Inc.","permalink":"getwellnetwork-inc","crunchbase_url":"http://www.crunchbase.com/company/getwellnetwork-inc","homepage_url":"http://www.getwellnetwork.com/","blog_url":"","blog_feed_url":"","twitter_username":"GetWellNetwork","category_code":"other","number_of_employees":100,"founded_year":1999,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"interactive-patient-care, hospital-television, tv-in-hospital, hospital-tv-system","alias_list":null,"email_address":"info@getwellnetwork.com","phone_number":"(240)482-3200","description":"Interactive Patient Care provider","created_at":"Fri Jul 22 15:21:58 UTC 2011","updated_at":"Mon Jul 25 20:49:42 UTC 2011","overview":"<p>GetWellNetwork, Inc. develops interactive software to help hospitals get patients more involved in their care process. Using the bedside TV, the GetWellNetwork system enables patients to view movies, access the Internet, play games and get health information on the television. Using technology in this way to achieve a more patient centered care experience is often referred to as, Interactive Patient Care (IPC).</p>\n\n<p>GetWellNetwork was founded in 1999 by CEO Michael O’Neil Jr., based on his experience with his own hospital experience during his 1999 battle with cancer. Over the next several years, the company deployed GetWellNetwork systems in hospitals around the country. In 2009 the company launched GetWell Town, an interactive patient care system designed for pediatric patients.</p>\n\n<p>The GetWellNetwork system, formerly named PatientLife, provides hospital patients with an assortment of entertainment amenities such as access to cable/satellite television, on-demand movies, email, web browsing, music and video games. In addition to entertainment, the GetWellNetwork system offers educational resources tailored for the patient&#8217;s specific condition. The system includes a library of educational videos and content on specific health conditions, medications, tests and procedures. The patient education library offers material from content providers like, Milner-Fenwick, KidsHealth, Blausen Medical, Swank Motion Pictures, Wired.MD and others. Patients also have access to information about the hospital including visiting hours, staff profiles and patient care initiatives.</p>\n\n<p>The GetWellNetwork system delivers educational content relevant to patient diagnosis, prescribed medication, and overall health. Patient education is delivered to the patient using pre-defined workflows referred to as Patient Pathways®.</p>\n\n<p>Patient Pathways utilize best practice templates that enable hospitals to automatically customize a patient’s hospital experience based on a variety of data inputs from existing hospital information systems. Data inputs trigger Patient Pathways to begin engaging patients in their own care. Prompts that appear on the patient’s TV proactively engage each patient to learn more about their care, condition, safety and other aspects of their hospital stay. Patients proceed at their own pace through the multiple phases of each Patient Pathway. The patient’s progress is recorded for reporting and to allow Nurses and staff to monitor the patient’s real-time progress. Progress can also be automatically documented to the patient’s EMR.</p>","image":{"available_sizes":[[[150,18],"assets/images/resized/0014/5665/145665v2-max-150x150.jpg"],[[250,31],"assets/images/resized/0014/5665/145665v2-max-250x250.jpg"],[[450,56],"assets/images/resized/0014/5665/145665v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"Board Observer","person":{"first_name":"David","last_name":"Martirano","permalink":"david-martirano","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Headquarters","address1":"7920 Norfolk Ave. 10th Floor","address2":"","zip_code":"20814","city":"Bethesda","state_code":"MD","country_code":"USA","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[{"available_sizes":[[[150,122],"assets/images/resized/0014/5664/145664v2-max-150x150.jpg"],[[250,204],"assets/images/resized/0014/5664/145664v2-max-250x250.jpg"],[[450,367],"assets/images/resized/0014/5664/145664v2-max-450x450.jpg"]],"attribution":null}],"external_links":[{"external_url":"http://www.washingtonpost.com/wp-dyn/content/article/2010/04/09/AR2010040905133.html","title":"GetWellNetwork offers hospital patients interactive care"}]}