{"name":"Globe Icons Interactive","permalink":"globe-icons-interactive","crunchbase_url":"http://www.crunchbase.com/company/globe-icons-interactive","homepage_url":"http://www.globeicons.com/","blog_url":"","blog_feed_url":"","twitter_username":"globe_icons","category_code":"advertising","number_of_employees":3,"founded_year":2010,"founded_month":1,"founded_day":1,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"interactive, mobile-marketing, coupon, qr, barcode, advertising, marketing, strategy, campaign, startup, print, scan, coffee-cup, beverage-cup, technology, ad-space, space, advertising-space, gree, green-technology, sustainable, creative, medium, cup","alias_list":null,"email_address":"ronaldsimons@globeicons.com","phone_number":"267-357-3856","description":"Interactive Advertising Mobile Marketing","created_at":"Wed Dec 07 18:51:44 UTC 2011","updated_at":"Mon Aug 20 09:01:14 UTC 2012","overview":"<p>Globe Icons Interactive is a full service advertising company that provides solutions for distributors of consumables, manufacturers and service providers who need to advertise.</p>\n\n<p>Our focus is on Ready-To-Drink (RTD) coffee distributors, businesses and events that use coffee cups as a bi-product to sell coffee.</p>\n\n<p>Coffee cups cost coffee distributors millions of dollars each year in expenses. Our economic Corporate Barter Solution relieves this expense by acquiring the coffee cup they distribute, for half of its advertising space, on a contingent sales basis. This makes the cups expense virtually free, without any change in cup manufacturer, brand or supply chain for fulfillment; as the cups are ordered by the distributor. The advertising space is sold by Globe Icons Interactive to third party manufacturers and service providers the distributor approves for a profit. The cups can be re-sold by the distributor to its vendors for additional profits. A win/win situation for all.</p>\n\n<p>We also sell and license our proprietary mechanisms; solutions for manufacturers and service providers who need to advertise. Advertisers lose of millions of dollars due to the lack in-ability to effectively measure their promotional ad campaign progress. Due to a sea change in digital online communication, point of sale (POS) technology and the birth of mobile technology, our solution mechanisms combine these stakeholder groups to one another with traditional print advertising to make a machine. A solution that offers a new way to geographically, demographically and psycho-graphically target the advertisers chosen audience and accurately measure their marketing and advertising spending through sales driven results.</p>\n\n<p>&#8220;Put your brand in their hand&#8221;</p>\n\n<p>Our mechanisms begin with the design of a Call-To-Action (CTA) ad, printed on coffee cups that instruct the consumer to send a text message from a device, to receive a mobile coupon offer by the advertiser. They can also scan a (QR/SnapTag) embedded in the ad, to connect the consumer to the advertiser’s online website for redemption and/or offer more information. The consumer can also connect to the advertiser’s social-media website(s) or blog via QR/SnapTag technology, to receive further offers and/or exchange further communication. </p>\n\n<p>The consumer can carry the coupon with them to a store, where the coupon can be scanned and redeemed directly from the device at the point of sale (POS).  All consumer interaction, sales and marketing data are recorded and delivered to the advertiser for measuring and monetization.</p>\n\n<p>www.globeicons.com</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0016/5610/165610v8-max-150x150.jpg"],[[250,250],"assets/images/resized/0016/5610/165610v8-max-250x250.jpg"],[[400,400],"assets/images/resized/0016/5610/165610v8-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}