{"name":"Go Daddy","permalink":"go-daddy","crunchbase_url":"http://www.crunchbase.com/company/go-daddy","homepage_url":"http://www.godaddy.com","blog_url":"","blog_feed_url":"","twitter_username":"","category_code":"network_hosting","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"endeavor","alias_list":null,"email_address":"","phone_number":"","description":"domain registrar","created_at":"Wed Jan 04 11:33:17 UTC 2012","updated_at":"Thu Jan 05 10:50:46 UTC 2012","overview":"<p>The Go Daddy Group offers everything you need to make a name for yourself on the Web, from domain names and website builders to complete eCommerce solutions. We’ve earned our place as the world’s # ICANN-accredited domain registrar by delivering world-class products at competitive prices and supporting them with industry-best service, delivered 24/7/365. We’re proud to serve our customers from locations around the world, including Arizona, Iowa, Colorado, Washington D.C., Singapore and The Netherlands.</p>\n\n<p>Go Daddy is the world&#8217;s largest domain name registrar and Web hosting provider *\nMore than 51 million domain names under management\nGo Daddy registers, renews or transfers more than one domain name every second of every day\nOne-third of the Internet runs through Go Daddy&#8217;s servers\nGo Daddy is larger than the next 8 closest registrar competitors combined\nGo Daddy is the largest hosting provider of secure websites in the world\nMore than 9.8 million customers\nGo Daddy is the world&#8217;s largest provider of net-new SSL certificates\nThe Go Daddy Group has more than 40 product offerings\nFounded in 1997 by Bob Parsons as Jomax Technologies\nThe Go Daddy Group includes three ICANN-accredited domain name registrars: flagship registrar GoDaddy.com, LLC, membership-based Blue Razor Domains, LLC, and reseller Wild West Domains, LLC\nPrivate domain name registration services through Domains By Proxy, LLC\nMore than 3,341 employees and 500 in-house developers with no outsourcing.\n24/7, 365 Round-the-clock Customer Care operations with no outsourcing\nEight facilities, maintaining operations in Arizona, Iowa, Colorado and Washington, D.C.</p>","image":null,"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}