{"name":"Goodway Group","permalink":"goodway-group","crunchbase_url":"http://www.crunchbase.com/company/goodway-group","homepage_url":"http://www.goodwaygroup.com/","blog_url":"http://www.goodwaygroup.com/blog","blog_feed_url":"http://www.goodwayblog.com/?feed=rss2","twitter_username":"goodwaygroup","category_code":"advertising","number_of_employees":200,"founded_year":1954,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"digital, online, marketing, advertising","alias_list":null,"email_address":"melissa@goodwaygroup.com","phone_number":"215-887-5700","description":"Custom Audience Platform","created_at":"Mon Dec 13 14:55:38 UTC 2010","updated_at":"Mon Nov 14 00:13:10 UTC 2011","overview":"<p>Goodway’s Custom Audience Platform applies best-in-class technology and intelligence to client campaigns. Our clients consistently rave that they have yet to find another digital partner who delivers the successful blend of campaign performance, customer service, and report analysis on such a high level and consistent basis.</p>\n\n<p>We offer several powerful branded solutions to make our clients a hero.</p>\n\n<p>Full Service Agencies</p>\n\n<p>Goodway is integrated with industry-leading and best in class partners across the digital media ecosystem. Goodway offers the only fully-integrated platform with Compete data to provide custom site lists for each client. Additionally, Goodway is integrated with Collective Media’s AMP platform to enable data segment analysis and discovery among more than 300,000 segments to ensure only the best performing segments are purchased.  </p>\n\n<p>Goodway also partners with Polk, Digital Element, DoubleClick, and Adometry, and has also developed D2D™ (Direct To Dealer) and GoLive as proprietary technology to be a leader in online campaign performance. Our market knowledge has brought real, measurable results to Fortune 500 companies including nearly every automotive manufacturer, high-profile political campaigns, and other burgeoning verticals such as healthcare, restaurants, and education.</p>\n\n<p>Regional Agencies and Second Wind Partners</p>\n\n<p>Goodway partners with regional agencies and Second Wind agency members to provide instant local market knowledge digital media expertise, and scale for campaigns. Our managed services ensure agencies are covered in every aspect, such as Evidon privacy compliance, industry-best DoubleClick third-party ad serving and reporting, advanced geo-targeting, campaign analysis/data providing key insights to your campaigns, and even Adobe Flash production on existing creative concepts.  Our robust support-team of media buying, ad operations, and campaign performance is focused solely on our client’s success. </p>\n\n<p>Goodway Group is a third-generation, family-owned company. Backed by more than 30 years of national and local retail marketing, Goodway underwent a complete transformation in 2006 to bring its expertise to the digital media and ad network space. The company is headquartered in Jenkintown, PA, right outside of Philadelphia, with offices and great talent also located in every region, and nearly every major market in the U.S.</p>","image":{"available_sizes":[[[150,42],"assets/images/resized/0014/2916/142916v2-max-150x150.jpg"],[[250,71],"assets/images/resized/0014/2916/142916v2-max-250x250.jpg"],[[450,128],"assets/images/resized/0014/2916/142916v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"COO","person":{"first_name":"Jay","last_name":"Friedman","permalink":"jay-friedman","image":{"available_sizes":[[[100,150],"assets/images/resized/0002/8012/28012v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0002/8012/28012v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0002/8012/28012v2-max-450x450.jpg"]],"attribution":"<p>Jay Friedman, Goodway Group</p>"}}},{"is_past":false,"title":"Vice President","person":{"first_name":"Dan","last_name":"Mauch","permalink":"dan-mauch","image":null}},{"is_past":false,"title":"President","person":{"first_name":"David","last_name":"Wolk","permalink":"david-wolk","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}