{"name":"Groop Swoop, LLC.","permalink":"groop-swoop-llc","crunchbase_url":"http://www.crunchbase.com/company/groop-swoop-llc","homepage_url":"http://www.groopswoop.com","blog_url":"","blog_feed_url":"","twitter_username":"groopswoop","category_code":"advertising","number_of_employees":null,"founded_year":2009,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"","alias_list":null,"email_address":"info@groopswoop.com","phone_number":"(510) 250-7989","description":"Local San Francisco Deals","created_at":"Mon Jul 12 21:05:30 UTC 2010","updated_at":"Thu Jul 15 23:58:07 UTC 2010","overview":"<p>Groop Swoop is an Internet based promotional company headquartered in the San Francisco Bay Area. Each day we offer an opportunity to experience something new. By leveraging the city’s combined purchasing power, Groop Swoop can offer you the best deals at the hottest places in the city. Each deal will have its own threshold that when met, will make the offer valid. By doing this we are able to offer local merchants the opportunity to gain new customers in large numbers and promote an awesome deal only for our members. We go to great lengths to seek out the finer things and unique experiences the city has to offer and present them to you for an incredible value. The best part is that bringing a group of customers to a business not only boosts their sales, but helps the economy overall and allows us to find you even more things to try! </p>\n\n<p>Groop Swoop was founded in 2009 by a group of Bay Area natives that were hit by the recession like most of the other people in the country. We were thinking of creative ways to still do the things we liked, but without having to pay full price. Figuring that tons of places offer group discounts, why not find a way to get individuals together to leverage a group discount? The concept of finding a way to help a group &#8220;swoop&#8221; on a deal became the mission. </p>\n\n<p>At Groop Swoop, we understand that even though times are tough, people still like to go out and have fun. The problem is, why risk trying something new that you may not like at full price, right? Well now you don&#8217;t have to! We work hard so that you can have a great time at your local hot spots and go home with some cash left in your pocket. You do your part to boost the economy without breaking the bank and everyone is happy! </p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0009/3081/93081v2-max-150x150.png"],[[250,250],"assets/images/resized/0009/3081/93081v2-max-250x250.png"],[[270,270],"assets/images/resized/0009/3081/93081v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Groop Swoop, LLC.","address1":"1027 62nd Street","address2":"","zip_code":"94608","city":"Emeryville","state_code":"CA","country_code":"USA","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}