{"name":"HealthLeaders","permalink":"healthleaders","crunchbase_url":"http://www.crunchbase.com/company/healthleaders","homepage_url":"","blog_url":"","blog_feed_url":"","twitter_username":"","category_code":null,"number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"","alias_list":"","email_address":"","phone_number":"(615) 385-4131 ","description":"Healthcare","created_at":"Sun Feb 27 15:23:56 UTC 2011","updated_at":"Mon Mar 28 21:51:28 UTC 2011","overview":"<p>Healthleaders, Inc in Nashville, TN is a private company categorized under Insurance Information and Consulting Services.</p>\n\n<p>Who we are\nHealthLeaders-InterStudy is a healthcare business information company. We analyze health plans, specific geographic healthcare markets, and the managed Medicare and Medicaid markets and produce databases and reports that give healthcare businesses ready access to the data and analysis. Our analysts and researchers are long-term specialists in their healthcare markets.</p>\n\n<p>What we cover\nHealth Plan Enrollment -We give you health plan enrollment data at the level of granularity most appropriate for you: national, state, MSA, or county, including HMOs and PPOs. These are the most complete numbers available, covering 98 percent of the enrolled population of the United States.</p>\n\n<p>Health Plan and Market Analysis - We give you a range of health plan data, at national, state, MSA, and county levels, including HMOs and PPOs.</p>\n\n<p>Enrollment\nMarket share\nFinancials\nPharmacy benefit structure\nIn addition, we provide extensive analysis of all market drivers that affect health plan operations in significant state and regional markets across the country.</p>\n\n<p>We also give you analysis of specific geographic healthcare markets, including:</p>\n\n<p>Health systems and hospitals\nPhysicians\nHealth plans\nMedicaid/Medicare\nPharmacy\nLegislation\nEmployers\nMedicare/Medicaid Insight -We give you detailed analysis of all changes resulting from the Medicare Modernization Act, including:</p>\n\n<p>Prescription Drug Plans\nMedicare Advantage Plans\nLegislative and market changes\nDual eligible enrollment\nWhat we help you do\nHealthLeaders-InterStudy provides healthcare market information that replaces or supplements:</p>\n\n<p>Market analysis when entering a new geographic market, or expanding in an old one\nOpportunity analysis when selling into the managed care market\nTraining materials for sales and business development staff\nTracking and post-implementation analysis to measure the success of market initiatives\nHealthLeaders-InterStudy is a Decision Resources Company\nDecision Resources, Inc., is a world leader in market research publications, advisory services, and consulting designed to help clients shape strategy, allocate resources, and master their chosen markets.</p>","image":{"available_sizes":[[[150,47],"assets/images/resized/0012/8011/128011v2-max-150x150.png"],[[209,66],"assets/images/resized/0012/8011/128011v2-max-250x250.png"],[[209,66],"assets/images/resized/0012/8011/128011v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"HQ","address1":"1 Vantage Way # B300 ","address2":"","zip_code":"37228-1563","city":"Nashville","state_code":"TN","country_code":"USA","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}