{"name":"Home Ideaz Consulting","permalink":"home-ideaz-consulting","crunchbase_url":"http://www.crunchbase.com/company/home-ideaz-consulting","homepage_url":"http://www.homeideaz.com","blog_url":"http://blog.homeideaz.com","blog_feed_url":"","twitter_username":"homeideaz","category_code":"ecommerce","number_of_employees":25,"founded_year":2010,"founded_month":7,"founded_day":1,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"home-decor, interior-design","alias_list":null,"email_address":"contact@homeideaz.com","phone_number":"00919819726629","description":"Largest Home Decor Portal","created_at":"Fri Sep 24 10:36:21 UTC 2010","updated_at":"Thu Oct 07 18:45:35 UTC 2010","overview":"<p>Our Vision:\nHome Ideaz.com has been created with a singular focus &amp; vision~ to make it easier for ‘our users’ across the globe, to harness power of the Internet &amp; make it easier to look for home décor ideas, products and resources …and in the process we help you build a happy &amp; beautiful home. </p>\n\n<p>For way too long, the world of Interior Décor has been too fragmented and too diverse and one has had to source all over the place to look for interesting information, resources or ideas or Retailers &amp; spend countless hours.  Whether you are a Home Decor Enthusiast, a Home Lover, or an Interior Decorator, we are sure some time you would have wondered&#8230;’Why isn’t there an online place where I can find everything I need, research it well before I buy it? Well…we’ve created one, and are sure our users will love it say the Founders of Home Ideaz! Home Ideaz.com has been founded by an extremely talented Team, with a deep passion &amp; love for Interiors &amp; Home Décor. </p>\n\n<p>The Preferred Online Home Décor Destination:\nWith the help of advanced, in-house sophisticated technology &amp; algorithms specific to the Home Décor Business, the HomeIdeaz.com proposes to make it extremely easy for users to search, research,  ideate &amp; shop ~ the  aim is to bring all the best Home Décor Resources on the Internet, one common platform for the convenience of  users.  At HomeIdeaz.com users get free direct access to over 1,000 of the best Home Décor Retailers,  750 plus of the best Home Décor Brands &amp; shop at the Shopping Section which brings together over 750,000 of the best selected Home Décor Products on one common platform…all available at just a click of the mouse!</p>\n\n<p>Partners Overstock, Target, Walmart, Homedepot, Macy&#8217;s and many more.</p>\n\n<p>In addition to an incredible, hassle free online shopping experience, the Portal also offers Home Lovers a variety of Value Added Services, tools and features that empowers Home Lovers to simplify their Home Décor Decisions &amp; take the right decision from the convenience of their desk. Home Lovers can spend countless inspiring hours reading through thousands of the ‘best selected’ Home Décor Links &amp; Blogs on the Internet, read over 25,000 of the best Home Décor Articles, read the best online Home Décor magazines at the Virtual Library, view over 15,000 Inspiring Images, Home Deco Videos, use the several Home Deco Online Tools &amp; also get free access to over 500,000 of the best Home Décor Vendors &amp; Consultants all in one place, &amp; on one platform&amp; all absolutely free with no charges at all!</p>\n\n<p>About us:\nHome Ideaz.Com has been founded in April 2009 &amp; is well on its way to be one of the largest &amp; most comprehensive online resources for the Home &amp; Interior Décor &amp; is aiming to be one of the fastest growing Home Décor Portals online, with the simple goal of revolutionizing the way users research and buy Home Décor Products. The Portal aims to be the preferred one &amp; ONLY home décor online resource that Home Lovers will need, to go ahead &amp; create a home that reflects their dreams, what their life is all about…&amp; a home that truly inspires both the people who come to visit and the people who live in it!  </p>","image":{"available_sizes":[[[114,49],"assets/images/resized/0010/2969/102969v2-max-150x150.jpg"],[[114,49],"assets/images/resized/0010/2969/102969v2-max-250x250.jpg"],[[114,49],"assets/images/resized/0010/2969/102969v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[{"available_sizes":[[[150,93],"assets/images/resized/0010/2967/102967v2-max-150x150.jpg"],[[250,156],"assets/images/resized/0010/2967/102967v2-max-250x250.jpg"],[[450,281],"assets/images/resized/0010/2967/102967v2-max-450x450.jpg"]],"attribution":null},{"available_sizes":[[[150,93],"assets/images/resized/0010/2968/102968v2-max-150x150.jpg"],[[250,156],"assets/images/resized/0010/2968/102968v2-max-250x250.jpg"],[[450,281],"assets/images/resized/0010/2968/102968v2-max-450x450.jpg"]],"attribution":null}],"external_links":[{"external_url":"http://www.free-press-release.com/news-homeideaz-com-launches-operations-in-us-with-a-home-d-cor-portal-that-promises-to-transform-the-way-us-home-owners-research-shop-home-decor-produc-1282293128.html","title":"HomeIdeaz.Com launches Operations in US, with a Home Décor Portal that promises to transform the way US Home Owners Research & Shop Home Decor Products. "}]}