{"name":"Imobilien","permalink":"imobilien","crunchbase_url":"http://www.crunchbase.com/company/imobilien","homepage_url":"http://imobilien.com.br","blog_url":"http://blog.imobilien.com.br","blog_feed_url":"http://blog.imobilien.com.br/feed/","twitter_username":null,"category_code":"public_relations","number_of_employees":10,"founded_year":2007,"founded_month":11,"founded_day":1,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"imoveis, real-estate, property","alias_list":null,"email_address":"contato@imobilien.com.br","phone_number":"+55 41 30298650","description":null,"created_at":"Mon Dec 15 20:09:20 UTC 2008","updated_at":"Tue Dec 20 11:03:17 UTC 2011","overview":"<p>O Imobox nasce com propósitos inovadores e com o pioneirismo da escolha do imóvel pelo mapa. Ação que proporciona para quem busca o imóvel ideal, a experiência única de escolher e conhecer melhor o local que procura sua moradia. Além disso, o Imobox traz também novas ferramentas como salvar suas opções de compra, venda ou locação, e compará-las com suas avaliações para fazer o melhor negócio.</p>\n\n<p>Com mais de 350 mil ofertas em todo o território brasileiro, o Imobox além de gerar oportunidades de compra, venda, locação e imóveis de temporada, também traz notícias especializadas sobre casa e serviços. Nosso site mudou o conceito de classificados para uma ferramenta mais completa que fornece informações sobre o mercado, flutuação dos preços em diversas regiões do país, auxílio ao corretor na promoção dos imóveis, e orientação do cliente na procura pelo imóvel ideal.\nHistórico</p>\n\n<p>O portal de imóveis Imobox nasceu em 2007, sob o nome de Imobilien, e vem conquistando cada vez mais espaço nos negócios imobiliários da internet.</p>\n\n<p>Em 2010, o Imobox passou a contar com a qualidade do Apontador – maior site de geolocalização e busca local da América Latina com mais de 12 milhões de visitantes únicos, 18 milhões de visitas e quase 45 milhões de pageviews. Ou seja, toda a visibilidade que seu negócio precisa está aqui.</p>\n\n<p>O Imbox também está nas redes sociais, mantendo sempre uma comunicação melhor com seus usuários. Siga-nos no Twitter e nos curta no Facebook – canais de comunicação de novidades, informações e ofertas de imóveis.</p>\n\n<p>Imobox: Simplicidade para quem busca, resultados para quem anuncia! </p>","image":{"available_sizes":[[[150,40],"assets/images/resized/0003/1778/31778v2-max-150x150.jpg"],[[220,59],"assets/images/resized/0003/1778/31778v2-max-250x250.jpg"],[[220,59],"assets/images/resized/0003/1778/31778v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"","address1":"Rua Funchal, 129, 1° Andar","address2":"","zip_code":"04551-060","city":"São Paulo","state_code":null,"country_code":"BRA","latitude":-25.4343563,"longitude":-49.2832886}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}