{"name":"IN-Q-TEL","permalink":"in-q-tel","crunchbase_url":"http://www.crunchbase.com/company/in-q-tel","homepage_url":"http://www.iqt.org/","blog_url":"","blog_feed_url":"","twitter_username":"","category_code":"legal","number_of_employees":null,"founded_year":1999,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":null,"alias_list":"","email_address":"info@iqt.org","phone_number":"703-248-3000","description":"private equity","created_at":"Wed Jan 13 13:40:40 UTC 2010","updated_at":"Mon May 17 15:25:24 UTC 2010","overview":"<p>In-Q-Tel, Inc. is a non-profit private equity and venture capital firm specializing in venture and bridge investments. It engages in start-ups, early venture, mid venture, late-stage investments; research and development programs, emerging and established companies, universities and research labs. The firm makes investments in application software and analytics including software applications for enterprise, departmental, and individual users; software-based analytics to automate and support human analysis; tools to exploit text, multimedia, and geospatial-based data in native language and format; knowledge management and collaboration; search; categorization and publishing; application integration; visualization; translation; geospatial design; and simulation and modeling. Within bio, nano, and chemical technologies, it seeks to invest in the extraction and characterization of trace materials from the environment, the characterization of unknown bulk materials, the on-site determination of individual human traits for IC purposes, point-of-care medical technologies outside of a laboratory or clinical environment, tracking and/or authentication of both individuals and objects, and the enablement of new IC capabilities from advances in material science. For communications and infrastructure, the firm invests in data services and capabilities; information lifecycle management; systems support for facilities; connectivity and communications; and computing architectures. Within digital identity and security sector, it focuses on identity management, access control, risk analysis capabilities, system design and analysis tools, and policy definition and management. For embedded systems and power sector, the firm makes investments in power generation, transmission, and storage; power management, conservation and conversion; RF, electronic, optic, power and other components; sensor networks and embedded communications; embedded sensing, computing, and communicating platforms; embedded communications components, protocols, and software; basic energy and component materials, science, and technology; and rapid design, prototyping and low rate production. In the infrastructure sector, it prefers wireless, IT security, and semiconductors. For the physical and biological materials sector, the firm prefers to invest in power and sensors. It may also invest in companies based outside United States. The firm typically, makes investments in the information technology businesses that serve United States national security interests. It operates by providing development funding and taking small equity stakes in companies and also takes an observer seat with the boards of its portfolio companies. The firm is funded by the Central Intelligence Agency. </p>\n\n<p>In-Q-Tel, Inc. was founded in 1999 and is headquartered in Arlington, Virginia with additional offices in Arlington, Virginia; Boston, Massachusetts; and Menlo Park, California.</p>","image":{"available_sizes":[[[114,92],"assets/images/resized/0008/7429/87429v1-max-150x150.jpg"],[[114,92],"assets/images/resized/0008/7429/87429v1-max-250x250.jpg"],[[114,92],"assets/images/resized/0008/7429/87429v1-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[{"funding_round":{"round_code":"unattributed","source_url":"http://www.iqt.org/news-and-press/press-releases/2009/VSee_10-19-09.html","source_description":"VSEE LABS SECURES STRATEGIC PARTNERSHIP AND TECHNOLOGY DEVELOPMENT AGREEMENT WITH IN-Q-TEL","raised_amount":null,"raised_currency_code":"USD","funded_year":2009,"funded_month":10,"funded_day":19,"company":{"name":"VSee Lab, Inc","permalink":"vsee-lab","image":{"available_sizes":[[[150,48],"assets/images/resized/0007/3209/73209v3-max-150x150.png"],[[216,70],"assets/images/resized/0007/3209/73209v3-max-250x250.png"],[[216,70],"assets/images/resized/0007/3209/73209v3-max-450x450.png"]],"attribution":null}}}},{"funding_round":{"round_code":"a","source_url":"http://www.iqt.org/technology-portfolio/quantum4d.html","source_description":"In-Q-Tel Invests in Quantum4D","raised_amount":200000,"raised_currency_code":"USD","funded_year":2007,"funded_month":12,"funded_day":11,"company":{"name":"Quantum4D","permalink":"quantum4d","image":null}}}],"acquisition":null,"acquisitions":[],"offices":[{"description":"HQ","address1":"P.O Box 749","address2":"","zip_code":"22216","city":"Arlington","state_code":"VA","country_code":"USA","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[{"available_sizes":[[[150,110],"assets/images/resized/0008/7431/87431v1-max-150x150.jpg"],[[250,184],"assets/images/resized/0008/7431/87431v1-max-250x250.jpg"],[[450,332],"assets/images/resized/0008/7431/87431v1-max-450x450.jpg"]],"attribution":null}],"external_links":[]}