{"name":"InAuth","permalink":"inauth","crunchbase_url":"http://www.crunchbase.com/company/inauth","homepage_url":"http://www.inauth.com/","blog_url":"http://blog.inauth.com/","blog_feed_url":"","twitter_username":"InAuth","category_code":"mobile","number_of_employees":null,"founded_year":2010,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"security-response, ios, android, mobile-malware","alias_list":null,"email_address":"mwp@inauth.com","phone_number":"(571) 255-6100","description":"Mobile transaction security","created_at":"Fri Jul 20 20:04:08 UTC 2012","updated_at":"Wed Aug 29 11:07:43 UTC 2012","overview":"<p>The company creates the most complete mobile authentication and anti-fraud solutions which offer multiple security options to financial institutions and for the mobile transaction market. </p>\n\n<p>The company&#8217;s solutions have been developed from the ground up for mobile devices rather than as an adaption of desktop computer solutions. This approach offers the most agile software as it is clean and crafted exclusively for mobile devices rather than an adaption of solutions developed for a completely different computing technology.</p>\n\n<p>The company delivers the ONLY dynamic and complete fraud solution which includes the following methods: Fraud Detection, Root Detection and Protection from Malware via a device installed Active Engine which receives definition updates on new threats as soon as they are available.</p>\n\n<p>The company’s authentication technology implements device identification, computed number, heuristics, browser intelligence and location detection simultaneously. The Fraud/Anomaly technology includes an endpoint engine, a script engine, micro/macro fraudulent pattern analysis, criminal browser detection, malware, and root detection.</p>\n\n<p>Layered Mobile Security\nThe company’s patent pending integrated mobile security technology provides invisible mobile authentication and mobile fraud protection for mobile financial transactions. The technology delivers scoring indicators or may produce a Confidence Rating per customer policy on each mobile device that has access to the host system and identifies high-risk and suspicious devices. This delivery of multi-layer security and rapid fraud detection is easy to use and transparent to the end-user, the account holder. Moreover, fraud detection rate sensitivity is much higher while the detection of fraudulent activity time frame is reduced from days to hours.</p>\n\n<p>Service Delivery Model\nThe company’s mobile security is delivered through mobile application integration. The Platform is built upon three core elements: (1) Scoring Engine: A dynamic self-learning engine that produces an actionable risk score that may be utilized in multiple fashions. The Scoring Engine may be hosted by the customer or by the company and provisioned via SaaS offering a comprehensive authentication and risk management solution that privately affords protection for an entire user base. (2) Security Modules provides security SDKs to deliver the required security services and communicate with the scoring engine and Mobile Device ID (Invisible Username &amp; Password). Behavorial Heuristics (things we know about the device), Calculated Device Authentication Numbers, Root and Anomaly Detection, Fraud and Malware Detection Modules and Multiple Location authentication. (3) Mobile Fraud Data Exchange (MFDE): The MFDE utilizes a dedicated network of financial institutions working with the company&#8217;s staff to fastidiously identify mobile threats and create a knowledge base for sharing.</p>\n\n<p>U.S. Federal Banking Compliance\nThe compan’s mobile transaction solutions are compliant with the security standards set for U.S. financial institutions by the Federal Financial Institutions Examination Council. The mobile commerce solutions provide the means to authorize, authenticate, confirm integrity and maintain confidentiality of mobile users throughout the financial transaction for both the financial institutions and their customers as governed by the following ruling bodies:</p>\n\n<pre><code>Board of Governors of the Federal Reserve System (FRB)\nFederal Deposit Insurance Corporation (FDIC)\nNational Credit Union Administration (NCUA)\nOffice of the Comptroller of the Currency (OCC)\nConsumer Financial Protection Bureau (CFPB)\n</code></pre>","image":null,"products":[],"relationships":[{"is_past":false,"title":"CEO, Co-Founder","person":{"first_name":"Mike","last_name":"Patterson","permalink":"mike-patterson","image":null}},{"is_past":false,"title":"CTO, Co-Founder","person":{"first_name":"Paul","last_name":"Marsolan","permalink":"paul-marsolan","image":null}},{"is_past":false,"title":"CFO","person":{"first_name":"Paul","last_name":"Garrett","permalink":"paul-garrett","image":null}},{"is_past":true,"title":"COO","person":{"first_name":"Joe","last_name":"Tedesco","permalink":"joe-tedesco","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"West Coast Office","address1":"615 Hampton Drive","address2":"C101","zip_code":"90291-2790","city":"Venice","state_code":"CA","country_code":"USA","latitude":null,"longitude":null},{"description":"East Coast Office","address1":"950 Glebe Road","address2":"Suite 2400","zip_code":"22203-1824","city":"Arlington","state_code":"VA","country_code":"USA","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}