{"name":"infocus Web Solutions","permalink":"infocus-web-solutions","crunchbase_url":"http://www.crunchbase.com/company/infocus-web-solutions","homepage_url":null,"blog_url":null,"blog_feed_url":null,"twitter_username":null,"category_code":null,"number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"infocus-web-solutions, infocus-web-solution, infocus-web-solutions-pvt-ltd, web-designing, web-development, search-engine-optimization, seo-services-company, hire-php-programmers, hire-php-developer, internet-marketing, online-marketing, website-designing","alias_list":null,"email_address":null,"phone_number":null,"description":null,"created_at":"Tue Sep 07 07:08:07 UTC 2010","updated_at":"Wed Oct 27 18:21:19 UTC 2010","overview":"<p>Infocus Web Solutions Pvt. Ltd. : Offshore Web Development Company India, Asia.</p>\n\n<p>We are Offshore Web Development Outsourcing Company based on Ahmedabad, India. Since 2009 we provide Web Solution services in E-Commerce, Web Application Development, Internet Marketing and SEO. We are having team of high skilled professional experts who will be taking care of our client’s valuable business services with online reputation. </p>\n\n<p>Services We Offer :\n                              PHP Development, AJAX Development, Drupal Development, Joomla Development, Magneto Development, OsCommerce Development, Java Development, Virtumart Development, Wordpress Development, Internet Marketing, Search Engine Optimization, Social Media Optimization.</p>\n\n<p>We (Infocus Web Solutions) offer our services to the countries like United States, Canada, Australia, European countries (United Kingdom, Ireland, Germany, France, Netherland, Italy, Spain) and even across the world.</p>\n\n<p>Infocus Web Solutions Pvt. Ltd. is a corporation that provides specialized bespoke solutions in web designing and software development. We convey quality solutions for an extensive range of business around the globe. We work with a wide range of customers in our enterprise to offer them cost effective and profitable solutions.</p>\n\n<p>We also use high performance server with high bandwidth and reliable back end support. The company is backed by an experienced team of Graphic designers, Information architects, Copy writers, Creative writers, Marketing specialists, SEO Specialists, Industry-specific specialists and Advisors, who will work with you towards creating the most effective solutions for your target audience.</p>\n\n<p>Our creative designs and customized look-n-feel attracts the flow of new clients towards us. Our customer-friendly IT Solutions helps our valuable clients to achieve their end target-to increase customer base and profit margins- through catchy and attractive Web Sites, B2B and B2C Web Portals, Advanced Ecommerce Shopping Carts, Online Web Stores, Web-Based Elearning Programs, Online Information Management Systems, Database Driven Portals, Customized Web Applications, etc.</p>\n\n<p>Our mission is fully powered with innovative ideas and state-of-art technologies, to provide easy access to worldwide clientele and to promote business entities to tap new world of potential customers and improve their profit margins with timely interaction with clients and world recognized best services, aiming to capture all sectors of biz world. &#8220;Infocus Web Solutions aspires to develop into a progressive web solutions business that offers bright and cutting edge technical solutions to an assorted array of customers with the best integration of professionalism and originality&#8221;</p>","image":{"available_sizes":[[[150,147],"assets/images/resized/0010/0940/100940v2-max-150x150.jpg"],[[250,245],"assets/images/resized/0010/0940/100940v2-max-250x250.jpg"],[[450,442],"assets/images/resized/0010/0940/100940v2-max-450x450.jpg"]],"attribution":null},"products":[{"name":"Web Designing India","permalink":"web-designing-india","image":null}],"relationships":[{"is_past":false,"title":"Infocus Web Solutions Pvt. Ltd.","person":{"first_name":"Mitesh","last_name":"Soni","permalink":"mitesh-soni","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[{"embed_code":"<object width=\"580\" height=\"360\"><param name=\"movie\" value=\"http://www.youtube.com/v/Z_ACyQUPeOo?fs=1&amp;hl=en_US&amp;color1=0x2b405b&amp;color2=0x6b8ab6&amp;border=1\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://www.youtube.com/v/Z_ACyQUPeOo?fs=1&amp;hl=en_US&amp;color1=0x2b405b&amp;color2=0x6b8ab6&amp;border=1\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"580\" height=\"360\"></embed></object>","description":"<p>Infocus Web Solutions Pvt. Ltd. Introduction</p>"}],"screenshots":[],"external_links":[{"external_url":"http://twitter.com/infocuswebsolu","title":"Follow Infocus Web Solutions on Twitter"}]}