{"name":"Interxion","permalink":"interxion","crunchbase_url":"http://www.crunchbase.com/company/interxion","homepage_url":"http://www.interxion.com","blog_url":"","blog_feed_url":"","twitter_username":"interxion","category_code":"network_hosting","number_of_employees":326,"founded_year":1998,"founded_month":4,"founded_day":6,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"carrier-neutral-colocation, data-centre, colocation","alias_list":null,"email_address":"saleshq@interxion.com","phone_number":"+800 4687 9466","description":"Data Centre Services","created_at":"Mon May 09 16:16:53 UTC 2011","updated_at":"Fri May 13 14:09:16 UTC 2011","overview":"<p>Interxion NYSE: INXN is a European provider of carrier-neutral colocation data centre services. </p>\n\n<p>Founded in 1998 in the Netherlands, the firm was publicly listed on the New York Stock Exchange on January 28, 2011. Interxion is headquartered in Schiphol-Rijk, the Netherlands, and delivers its services through 28 data centres in 11 countries located in major metropolitan areas, including London, Frankfurt, Paris, Amsterdam and Madrid, the main data centre markets in Europe.</p>\n\n<p>The company’s core offering is carrier-neutral colocation, which includes provision of space, power and a secure environment in which to house customers’ computing, network, storage and IT infrastructure. Interxion’s carrier-neutral colocation services enable customers to reduce operational and capital expenses while improving application performance and flexibility. Interxion also supplements its core colocation offering with a number of additional services, including systems monitoring, systems management, engineering support services, data back-up and storage.</p>\n\n<p>Within its data centres, Interxion enables approximately 1,100 customers to house their equipment and connect to a broad range of telecommunications carriers, ISPs and other customers. The data centres act as content and connectivity hubs that facilitate the processing, storage, sharing and distribution of data, content, applications and media among carriers and customers.</p>\n\n<p>Interxion’s customer base is in high-growth market segments, including financial services, cloud and managed services providers, digital media and carriers. Customers in these target markets enable expansion of existing communities of interest and build new, high-value communities of interest within the data center. Communities of interest are particularly important to customers in each of these market segments. For example, customers in the digital media segment benefit from the close proximity to content delivery network providers and Internet exchanges in order to rapidly deliver content to consumers. Interxion expects the high-value and reduced-cost benefits of communities of interest to continue to attract new customers.</p>\n\n<p>Interxion’s data centres enable its customers to connect to more than 350 carriers and ISPs and 19 European Internet exchanges, allowing them to lower telecommunications costs and reduce latency times.</p>","image":{"available_sizes":[[[150,41],"assets/images/resized/0013/3831/133831v2-max-150x150.png"],[[250,68],"assets/images/resized/0013/3831/133831v2-max-250x250.png"],[[450,123],"assets/images/resized/0013/3831/133831v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[{"competitor":{"name":"Equinix","permalink":"equinix","image":{"available_sizes":[[[114,61],"assets/images/resized/0002/8568/28568v7-max-150x150.png"],[[114,61],"assets/images/resized/0002/8568/28568v7-max-250x250.png"],[[114,61],"assets/images/resized/0002/8568/28568v7-max-450x450.png"]],"attribution":null}}},{"competitor":{"name":"Global Switch","permalink":"global-switch","image":{"available_sizes":[[[145,69],"assets/images/resized/0012/0188/120188v1-max-150x150.jpg"],[[145,69],"assets/images/resized/0012/0188/120188v1-max-250x250.jpg"],[[145,69],"assets/images/resized/0012/0188/120188v1-max-450x450.jpg"]],"attribution":null}}}],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[{"external_url":"http://en.wikipedia.org/wiki/Interxion","title":""}]}