{"name":"IT Sales Leads","permalink":"it-sales-leads","crunchbase_url":"http://www.crunchbase.com/company/it-sales-leads","homepage_url":"http://www.it-sales-leads.com","blog_url":"http://blog.it-sales-leads.com/","blog_feed_url":"http://feeds.feedburner.com/ItLeadsGeneration","twitter_username":"","category_code":"other","number_of_employees":300,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"it-telemarketing, it-lead-generation, it-leads, it-sales-leads, it-appointment-setting-company, voip-leads, it-consulting-leads","alias_list":null,"email_address":"sales.info@it-sales-leads.com","phone_number":"888.529.0871","description":"IT Lead Generation and Appointment Setti","created_at":"Mon Oct 22 00:39:47 UTC 2012","updated_at":"Fri Oct 26 18:10:57 UTC 2012","overview":"<p>ITSalesLeads.Com (ITSL) is a privately-owned company established in 2004, specializing in appointment setting, lead generation, lead nurturing, and telemarketing business list building for IT products and services providers.</p>\n\n<p>Unlike other lead generation companies, our industry-focused and highly targeted market coverage ensure our clients access to top IT decision makers in the industry including IT Directors, Chief technology Officers, and Chief Information Officers, making us the most efficient IT lead generation services provider in the world.</p>\n\n<p>Our telemarketing lead generation strategy is built on a time-tested business model which is clearly differentiated and economically attractive. Our customers get sales leads that are relevant to their marketing campaign and nothing else.</p>\n\n<p>ITSL callers and lead quality analysts are highly experienced senior-level telemarketing professionals with intensive understanding of IT business drivers, problems, and enterprise buying decisions. Our lead nurturing strategy, which is one of its kind in the marketplace, is purposely cut out to execute multi-level marketing campaigns and complex sales flow.</p>\n\n<p>ITSL is a subsidiary of Callbox Inc. and is based in California USA, with sales offices in Singapore and Australia.</p>","image":null,"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"","address1":"4924 Balboa Blvd., #353 Encino, CA 91316","address2":"","zip_code":"91316","city":"Encino","state_code":"CA","country_code":"USA","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}