{"name":"JobsFor10.com","permalink":"jobsfor10-com","crunchbase_url":"http://www.crunchbase.com/company/jobsfor10-com","homepage_url":null,"blog_url":null,"blog_feed_url":null,"twitter_username":null,"category_code":null,"number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"","alias_list":null,"email_address":null,"phone_number":null,"description":null,"created_at":"Tue Oct 05 08:45:49 UTC 2010","updated_at":"Tue Jan 11 02:40:57 UTC 2011","overview":"<p>JobsFor10 is a unique site where anyone can buy and sell services for $10 (also known as micro-outsourcing).</p>\n\n<p>Ever find yourself in a situation where you need to have something small done quickly but just couldn’t find the right person for the job?</p>\n\n<p>Such situations happen to thousands of us each day, and JobsFor10 has become just the place to go to when looking to have your tasks done now – quickly, efficiently, and in high quality.</p>\n\n<p>You no longer have to worry about feeling uncomfortable asking a colleague or acquaintance to help you out or pay $60 hourly rate for everage professional, when you can get a pro to do exactly what you need for just $10!</p>\n\n<p>The sellers are professional in there field of experty, that fact gives them an adventage which translate into making quality jobs for an effordable rates.</p>\n\n<p>$10 is just the amount of money most buyers could afford and on the same time sellers are able to put efforts to ensure quality service.</p>\n\n<p>The win-win situation between the sellers and the buyers enabled by automated ranking system where buyers and sellers closing deals by the hours.</p>","image":null,"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}