{"name":"Kextil","permalink":"kextil","crunchbase_url":"http://www.crunchbase.com/company/kextil","homepage_url":"http://www.kextil.com","blog_url":"","blog_feed_url":"","twitter_username":"","category_code":"software","number_of_employees":3,"founded_year":2010,"founded_month":4,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"software, enterprise, speech-recognition, industrial, field-service, knowledge-management, mobility","alias_list":null,"email_address":"jberman@kextil.com","phone_number":"412-398-0789","description":"speech recognition for field services","created_at":"Fri Feb 10 22:51:42 UTC 2012","updated_at":"Sat Feb 11 23:25:46 UTC 2012","overview":"<p>Transforming the field service industry </p>\n\n<p>Summary  </p>\n\n<p>Kextil will generate a $100 million in revenue with 35% net margins within 5 years by simultaneously attacking the related problems of workforce efficiency and customer satisfaction in the global field service industry. Our business and target market result in a highly capital efficient opportunity in terms of both technology development, go-to-market approach, and scalability. This opportunity will require $6 million of investment capital to reach profitability.</p>\n\n<p>Customer problem</p>\n\n<p>The problem is one of information flow. It costs 15-30% of a workforces time to capture and access the information required to create the optimal service outcome. The ability to capture/access data in the field is severly constrained by keyboard/screen interfaces so the quality of data use is poor.</p>\n\n<p>The Solution</p>\n\n<p>Kextil is an enterprise software company.  Our advanced speech recognition technology enables a field service engineer to collect information directly into back end systems and seamlessly access mission critical service related information. This is done without stopping the hands/eyes busy field service work being performend. From the user&#8217;s perspective Kextil provides a virtual secretary and virtual supervisor on their shoulders. We drive high ROimprovements in workforce efficiency, knowl. dev., customer sat., and competitive differentiation.</p>\n\n<p>The Market</p>\n\n<p>Globally 9 million field technicians use automation representing a current $18 billion opportunity. There is an additional $12 billion as technology adoption continues. 4 primary sectors utilities, telecom, industrial, technology. Kextil segments by opertational attributes with an initial focus on processes that require large amount of data collection and utilization, medium volume of service events, high cost of error. This is 40% of the market.</p>\n\n<p>Customers</p>\n\n<p>Customers are primarily global enterprises. Prospective customers include: Applied Materials, EMC, Varian Medical, Siemens, Aramark Healthcare, Emerson, First Energy, Dell, British Telecom, Ericcson, Virgin, Cox Communications, Tyco, Pitney Bowes, Toshiba Medical, Abbott Labs, Atos, and Exxon.</p>\n\n<p>Management</p>\n\n<p>The CEO has 7 years experience evaluating new business opportunities in the speech recognition industry. Co-CTOs are Alex Rudnicky (world renowned thought leader in spoken dialog systems), Jordan Cohen (former CTO Voice Signal which sold for $290 million). Board of Directors includes Jack LeVan (former CEO Vocollect which sold for $190 million) and Leo Colborne former SVP Global Services at EMC. </p>\n\n<p>Sales and Marketing</p>\n\n<p>Kextil’s marketing strategy is focused on driving revenue growth along three paths: Selling multiple software modules to customers; Building capabilities by serving our initial target markets that enable Kextil to target larger segments; Leveraging our customer’s global field service organizations to establish footholds in markets outside of the US. Kextil will reach its customer base via 1:1 communications centered around industry conferences.</p>\n\n<p>Barriers</p>\n\n<p>Creating a voice interface for field service is a big technological hurdle and competitive barrier. Our provisional patent filing calls out numerous IP opportunities for spoken dialog systems, multimodal interface, content creation, and workflow tracking. We will augment IP with domain experience and direct interfaces to field service ERP modules.</p>","image":null,"products":[],"relationships":[{"is_past":true,"title":"CEO","person":{"first_name":"Jonathan","last_name":"Berman","permalink":"jonathan-berman","image":null}},{"is_past":true,"title":"co-CTO","person":{"first_name":"Jordan","last_name":"Cohen","permalink":"jordan-cohen","image":null}},{"is_past":true,"title":"Board of Directors","person":{"first_name":"Leo","last_name":"Colborne","permalink":"leo-colborne","image":null}}],"competitions":[{"competitor":{"name":"Nuance","permalink":"nuance-2","image":{"available_sizes":[[[150,96],"assets/images/resized/0021/1406/211406v2-max-150x150.jpg"],[[250,160],"assets/images/resized/0021/1406/211406v2-max-250x250.jpg"],[[450,288],"assets/images/resized/0021/1406/211406v2-max-450x450.jpg"]],"attribution":null}}}],"providerships":[{"title":"Legal representation","is_past":false,"provider":{"name":"Reed Smith","permalink":"reed-smith","image":null}},{"title":"Legal IP representation","is_past":false,"provider":{"name":"GTC Law Gropu","permalink":"gtc-law-gropu","image":null}}],"total_money_raised":"$370k","funding_rounds":[{"round_code":"seed","source_url":"","source_description":"","raised_amount":120000,"raised_currency_code":"USD","funded_year":2010,"funded_month":6,"funded_day":1,"investments":[]},{"round_code":"angel","source_url":"","source_description":"","raised_amount":250000,"raised_currency_code":"USD","funded_year":2011,"funded_month":4,"funded_day":1,"investments":[]}],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Pittsburgh","address1":"","address2":"","zip_code":"","city":"","state_code":null,"country_code":"USA","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[{"available_sizes":[[[150,97],"assets/images/resized/0017/3805/173805v2-max-150x150.png"],[[250,162],"assets/images/resized/0017/3805/173805v2-max-250x250.png"],[[450,291],"assets/images/resized/0017/3805/173805v2-max-450x450.png"]],"attribution":null}],"external_links":[]}