{"name":"Linxo","permalink":"linxo-s-a","crunchbase_url":"http://www.crunchbase.com/company/linxo-s-a","homepage_url":"http://www.linxo.com","blog_url":"","blog_feed_url":"","twitter_username":"linxos","category_code":null,"number_of_employees":null,"founded_year":2010,"founded_month":4,"founded_day":30,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"","alias_list":null,"email_address":"","phone_number":"","description":"","created_at":"Sun May 23 11:42:01 UTC 2010","updated_at":"Mon Dec 06 19:23:12 UTC 2010","overview":"<p>La gestion des finances personnelles gratuite, simple, rapide et vraiment automatique.</p>\n\n<p>En Septembre 2010, LINXO lance en France sa plateforme de gestion des finances personnelles : solution facile, rapide et vraiment automatique pour suivre ses finances jours après jours. La plateforme LINXO est la première en France à automatiser entièrement la récupération des transactions bancaires.</p>\n\n<p>LINXO permet à ses utilisateurs d’avoir le tableau de bord de leurs finances sans effort en 5 minutes. L&#8217;usage de l&#8217;e-banking s&#8217;est complètement banalisé dans les dix dernières années. Mais les fonctionnalités offertes par les sites des banques ont très peu évolué depuis leurs lancements. Pourtant la grande majorité des consommateurs européens souhaite pouvoir utiliser des fonctionnalités de gestion des finances personnelles plus élaborées.</p>\n\n<p>A plus long terme, LINXO permettra à l&#8217;utilisateur de gérer l&#8217;ensemble de sa problématique financière en modélisant les différentes composantes de son patrimoine et en agrégeant l&#8217;information relative a ses fournisseurs de services financiers, télécommunication, énergie, santé, retraite.</p>\n\n<p>LINXO est une SAS cofondée en 2010 par deux ingénieurs Telecom Paris, Hugues Pisapia (ex Wimba et initiateur du projet fin 2008) et Bruno Van Haetsdaele (ex CTO et cofondateur de Wimba  et Ingénieur au Stanford Research Institute).   Le conseil de surveillance est présidé par Tommaso Trionfi (CEO d&#8217;IXTENS ex CEO de Wimba et Président de l&#8217;association des anciens élèves de l&#8217;INSEAD aux Etats Unis). Luc Hardy (Président de Sagax,  participation en 2006 à la création de Lending Club, leader mondial du peer-to-peer lending et Advisory Board member de Prêt d&#8217;Union, première plateforme Internet de crédit entre particuliers en France) et Francois Mazon (Directeur du Développement de Linagora, Administrateur du groupe NRJ, ex Président de Cap Gemini France) font partie de l&#8217;Advisory Board.</p>","image":{"available_sizes":[[[150,127],"assets/images/resized/0010/9144/109144v2-max-150x150.jpg"],[[250,212],"assets/images/resized/0010/9144/109144v2-max-250x250.jpg"],[[269,229],"assets/images/resized/0010/9144/109144v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"CEO","person":{"first_name":"Bruno","last_name":"Van Haetsdaele","permalink":"bruno-van-haetsdaele","image":null}},{"is_past":false,"title":"Chairman","person":{"first_name":"Tommaso","last_name":"Trionfi","permalink":"tommaso-trionfi","image":null}},{"is_past":false,"title":"CTO","person":{"first_name":"Hugues","last_name":"Pisapia","permalink":"hugues-pisapia","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}