{"name":"Makeos","permalink":"makeos","crunchbase_url":"http://www.crunchbase.com/company/makeos","homepage_url":"http://www.makeos.com","blog_url":"http://blog.makeos.com","blog_feed_url":"","twitter_username":"","category_code":"ecommerce","number_of_employees":5,"founded_year":2010,"founded_month":9,"founded_day":1,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"petites-annonces-gratuites--petites-annonces-gratuites-fiverr-makeos","alias_list":null,"email_address":"","phone_number":"","description":"Makeos.com, un site de petites annonces ","created_at":"Wed Sep 01 17:50:26 UTC 2010","updated_at":"Wed Sep 01 18:25:53 UTC 2010","overview":"<p>Makeos.com, un site de petites annonces anti-crise de services à 5 €uros</p>\n\n<p>Avec Makeos.com le modèle de petites annonces à la Fiverr arrive en France</p>\n\n<p>Le marché de petites annonces en ligne est très concurrentiel et on peut citer plein d’exemples de sites à la sauce Ebay en France : LeBonCoin, VivaStreet, Kijiji, etc. Mais une nouvelle place de marché, Makeos, vient d’apparaître en France, où toutes les offres sur le site n’ont qu’une valeur de 5€.</p>\n\n<p>Inspirée du modèle employé par Fiverr aux Etats-Unis, qui permet aux internautes de proposer des services uniquement à 5$, la jeune start-up basée à Angers intègre aussi des modules de communautés avec une interface qui ressemble à Twitter. Bon, évidement ce concept ne garantit pas forcément une bonne qualité pour chaque  service proposé sur le site, mais en même temps il s’agit d’un prix négligeable.</p>\n\n<p>Les internautes deviennent assez inventifs quand il s’agit de proposer quelque chose pour 5$ ou 5€. Par exemple, certaines offres sur le site américain de micro-freelance sont assez originales : un cours pour apprendre à parler à son perroquet,  la chanson Joyeux Anniversaire chantée comme Marilyn Monroe pour offrir à n’importe qui, ou encore quelqu’un pour écouter vos insultes pendant 30  minutes au téléphone quand vous avez besoin de vous lâcher. Par contre, la communauté de Makeos n’est pas encore aussi développée que celle de Fiverr et manque peut-être un peu d’inspiration. Pourtant, on y trouve quand même quelques idées intéressantes, comme vous livrer une e-boutique clé en mains pour 5€ ou encore vous créer un arrière plan personnalisé pour votre page Twitter pour 5€</p>\n\n<p>N’y a-t-il pas quelqu’un avec quelque chose de plus créatif à proposer pour 5€ ?</p>","image":{"available_sizes":[[[150,38],"assets/images/resized/0010/0244/100244v2-max-150x150.png"],[[152,39],"assets/images/resized/0010/0244/100244v2-max-250x250.png"],[[152,39],"assets/images/resized/0010/0244/100244v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}