{"name":"Marcas e Patentes","permalink":"marcas-e-patentes","crunchbase_url":"http://www.crunchbase.com/company/marcas-e-patentes","homepage_url":"http://www.certficamarcasepatentes.com.br","blog_url":"http://blog.certfica.com.br/","blog_feed_url":"http://blog.certfica.com.br/feed/","twitter_username":"certficamarcas","category_code":"security","number_of_employees":null,"founded_year":1995,"founded_month":5,"founded_day":14,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"registro-de-marcas, marcas-e-patentes","alias_list":null,"email_address":"certfica@certfica.com.br","phone_number":"+55 (11) 3443-7769","description":"Registro de Marcas","created_at":"Sat Oct 22 15:14:22 UTC 2011","updated_at":"Mon Oct 31 02:20:21 UTC 2011","overview":"<p>A Certfica trabalha com registro de marcas, registro de patentes, registro de direitos autorais. Marca sem registro é marca sem dono! Registro de marcas em todo o Brasil!\nA Certfica é constituída por advogados devidamente cadastrados junto a Ordem dos Advogados do Brasil, atuantes na área há mais de 16 (dezesseis) anos e, portanto está apta a realizar o trabalho de registro de marcas e patentes, podendo representar seus clientes junto ao INPI, como também na esfera judicial.\nTodas as empresas que são constituídas por agentes da propriedade industrial (não advogados), necessitam serem credenciadas junto ao INPI, para realizarem o trabalho de registro de marcas e patentes mas não estão aptas a realizarem serviços jurídicos.\nO objetivo da Certfica é oferecer segurança em todas as esferas de atuação. Nosso compromisso com a ética, é também no sentido de manter sigilo absoluto das informações que nos são confidenciadas, e da mesma forma as informações aos clientes são sempre pontuais e esclarecedoras, visando a garantia de segurança do seu patrimônio.\nDispomos de modernos equipamentos de comunicação e infra-estrutura especializada, utilizando de todas as ferramentas de comunicação disponíveis no mercado, tais como chat, msn e skype, de forma a facilitar os contatos. Temos compromisso com a transparência e agilidade na execução dos serviços, e nosso eficiente sistema de acompanhamento permite localizar em todo território nacional, empresas ou marcas colidentes com as de nossos clientes.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0015/9157/159157v2-max-150x150.png"],[[250,250],"assets/images/resized/0015/9157/159157v2-max-250x250.png"],[[300,300],"assets/images/resized/0015/9157/159157v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}