{"name":"maurisource","permalink":"maurisource","crunchbase_url":"http://www.crunchbase.com/company/maurisource","homepage_url":"http://www.maurisource.com","blog_url":"http://www.maurisource.com/blog/","blog_feed_url":"http://feeds.feedburner.com/maurisource","twitter_username":"maurisource_web","category_code":"advertising","number_of_employees":null,"founded_year":2009,"founded_month":1,"founded_day":1,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"web-agency, website-creation, web-development, iphone-applicaiton, search-engine-optimization, south-shore, montreal, quebec, canada","alias_list":null,"email_address":"info@maurisource.com","phone_number":"","description":"Web agency, website creation Montreal","created_at":"Thu Sep 08 23:54:36 UTC 2011","updated_at":"Fri Nov 11 20:21:38 UTC 2011","overview":"<p>Maurisource is a web agency on the South Shore of Montreal. Website design is the chosen field of this agency. Their website design are made with high efficiency tools which provide high quality graphics and passes through many validation criteria before being presented to the client. The agency uses advanced technologies and programming languages never seen before. Reliability without prior agency can meet the needs of its customers seeking to take their first steps into the exciting world of internet.\nMaurisource is responsible for creating website, virtual catalog highlighting your core products or even e-commerce site that is manageable by yourself. Whatever package you choose you will be able to change to the infinity and as much as you want the content of your website, thanks to its integrated CMS, it allows you to update your website via an administration page. Log in and you may add images or text of your choice.\nOur services include support, virtual assistance at all time. A 3-hour training course is included in all our web packages, which facilitates your familiarity with your new website and tools up with.\nContact the agency today for a quote. Maurisource is listening to all your projects, big or small.</p>","image":{"available_sizes":[[[81,150],"assets/images/resized/0015/3335/153335v2-max-150x150.jpg"],[[136,250],"assets/images/resized/0015/3335/153335v2-max-250x250.jpg"],[[180,330],"assets/images/resized/0015/3335/153335v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}