{"name":"MBAProjectSearch.com","permalink":"mbaprojectsearch-com","crunchbase_url":"http://www.crunchbase.com/company/mbaprojectsearch-com","homepage_url":"http://mbaprojectsearch.com","blog_url":"","blog_feed_url":"","twitter_username":"mullaneydan","category_code":"consulting","number_of_employees":6,"founded_year":2012,"founded_month":8,"founded_day":7,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"mba-startup-smallbusiness-freelance-internship-jobs-consulting","alias_list":null,"email_address":"mullaneydan@mbaprojectsearch.com","phone_number":"202-480-1252","description":"Freelance MBA Site","created_at":"Fri Nov 30 15:07:08 UTC 2012","updated_at":"Mon Dec 03 07:41:39 UTC 2012","overview":"<p>On the startup side, MBA Project Search is great for startups that need MBA caliber talent but don’t want to hire someone on full time or do some kind of equity for work scenario.</p>\n\n<p>We’ve reported on several job and recruitment based startups. Most of these startups are attacking problems with hiring and recruiting with technology like video and social media. Some employment based startups, like  Memphis startup Work For Pie, are honed in on specific markets like developers. A new Washington DC startup, MBA Project Search, is connecting businesses of any size with MBA students or alumni. MBA Project Search is getting it’s start out of the Washington DC area and is tapped into the MBA scene at Georgetown University. They’ve also secured relationships with every Ivy institution as well as MBA equivalents internationally. On the startup side, MBA Project Search is great for startups that need MBA caliber talent but don’t want to hire someone on full time or do some kind of equity for work scenario.  With MBA Project Search startups can hire MBAs for short term projects at an affordable rate. Currently MBA Project Search is free for both businesses that need to hire an MBA and for MBAs to apply for projects and positions.  There are no other hidden costs involved either. The MBA Project Search team says that for students, it gives them the kind of hands on experience a doctor would get from a $100/hr residency or a lawyer would get from a $50,000 internship.  They’re giving MBA students and graduates another resource to find post graduate work that encompasses the degree they studied long and hard for. read more at http://markerly.com/p/_v8P1rP</p>","image":{"available_sizes":[[[150,52],"assets/images/resized/0022/3188/223188v2-max-150x150.jpg"],[[150,52],"assets/images/resized/0022/3188/223188v2-max-250x250.jpg"],[[150,52],"assets/images/resized/0022/3188/223188v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"Founder","person":{"first_name":"Dan","last_name":"Mullaney","permalink":"dan-mullaney","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}