{"name":"MedTel.com","permalink":"medtel-com","crunchbase_url":"http://www.crunchbase.com/company/medtel-com","homepage_url":"http://www.medtel.com","blog_url":"","blog_feed_url":"","twitter_username":"Medtel_com","category_code":"search","number_of_employees":7,"founded_year":2011,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"medical-devices, pharmaceuticals-sales-reps, medical-app, medical-marketing, healthcare-search-directory, drug-rep-directory, sales-rep-doctor-communication, healthcare-app, doctor-app, physician-practice-platform, hospital-administration, practice-admini","alias_list":"","email_address":"info@medtel.com","phone_number":"1.866.246.5303","description":"Search and communication platform","created_at":"Fri Jan 13 06:04:58 UTC 2012","updated_at":"Thu Oct 18 16:48:31 UTC 2012","overview":"<p>Medtel.com Inc. (“Medtel”) is a search directory and communication platform that enables hospitals, practices, doctors, office managers, and administrators to locate global medical device and pharmaceutical companies and their respective sales reps efficiently online. </p>\n\n<p>Traditionally, doctors and sales reps have had to rely on all-purpose search engines or word-of-mouth to try to find one another, with typically subpar results. Coordinating meetings has also been a stumbling block, with impromptu visits, buried email messages, and phone tag scenarios representing the normal course of business. </p>\n\n<p>The Medtel platform simplifies such doctor-sales rep interactions by making the process of communicating much more accessible and convenient. The service uses a directory that connects users with the appropriate sales reps in a few clicks.  The proprietary database features a verticalized search directory, which organizes products according to an array of discrete and hierarchical medical categories.  In addition to company affiliation and sales rep names and contact info, the directory provides direct links to extensive product information as well as the telephone numbers and email addresses for local sales reps.  This type of specialized search, with direct-connect capabilities, is not readily available from other conventional sources.  On other search engines, in contrast, one would have to perform several iterations of queries across multiple platforms to generate the same information that MedTel can deliver in a single search.</p>\n\n<p>In terms of communication, the site enables doctors to connect with sales reps instantly with direct messaging, a dedicated email inbox, or via telephone, thereby freeing up physicians to spend more time with their patients and staff.  As an added benefit, the web service allows doctors to post their availability online for sales calls, which makes scheduling meetings easier for both the doctors and their reps.  </p>\n\n<p>By directing their reps to the Medtel platform, doctors experience a significant decrease in unexpected and potentially inconvenient drop-in visits.  With MedTel, doctors have the discretion to engage in either asynchronous or synchronous forms of communication with their reps, again providing the flexibility they require to attend to their busy practices and patient loads. </p>\n\n<p>In sum, Medtel’s communication tools enable a hospital or practice to enhance, monitor and manage doctors’, medical staffs’, and administrators’ relationships with sales reps.</p>","image":{"available_sizes":[[[150,57],"assets/images/resized/0016/9991/169991v3-max-150x150.jpg"],[[250,96],"assets/images/resized/0016/9991/169991v3-max-250x250.jpg"],[[450,173],"assets/images/resized/0016/9991/169991v3-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"","address1":"","address2":"","zip_code":"","city":"New York City","state_code":"NY","country_code":"USA","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}