{"name":"Mindurge Technologies","permalink":"mindurge-technologies","crunchbase_url":"http://www.crunchbase.com/company/mindurge-technologies","homepage_url":"http://www.mindurge.com","blog_url":"http://www.mindurge.com/blog","blog_feed_url":"","twitter_username":"mindurge","category_code":"software","number_of_employees":25,"founded_year":2005,"founded_month":8,"founded_day":15,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"website-development, php-development, php-developer, software-development-company, php-web-development, web-application-development, web-development-company, php-project-development, php-website-development, ecommerce-web-development, offshore-it-company","alias_list":null,"email_address":"sales@mindurge.com","phone_number":"00911412370981","description":"Offshore Web Development & SEO Company","created_at":"Mon Jul 19 02:52:18 UTC 2010","updated_at":"Fri Apr 15 00:02:15 UTC 2011","overview":"<p>Mindurge is a leading global provider of business consulting and technology solutions firm to Fortune 1000 corporations and SMEs companies. Mindurge provides clients with the right solutions in software and web development, business process analysis, user experience, content design and IP Video monitoring. Contact us to see what we can do for your company. \nMindurge strives to establish beneficial, long-term relationships with clients. This allows us to better understand their business, culture, goals, and challenges. Our strong client relationships allow us to become a pro-active partner by looking out for our client’s interests with recommendations that will facilitate their success.</p>\n\n<p>Our clients can be assured that their projects are completed in accordance with our rigorous research and development process while maintaining strong usability design for their users. Ideally, technology should be transparent. \nWe pioneered a collaborative way of working with clients using an optimal blend of co-located teams both on-site and offshore which delivers immediate business benefits. Our world-class offshore development and support centers have helped our global clients realize millions of dollars in IT related cost savings. Our consultants have executed over 5,000 person years of projects for clients in the manufacturing, high tech, insurance, financial services, utilities, &amp; services industry segment in the last 10 years that we have been in business. \nMINDURGE provides business process analysis and solutions; information systems development such as custom applications, E-Commerce, Online Marketing Services  like e-marketing, SEO/PPC and complete IT solutions viz. Web Design and Application Development with a focus on Quality, Cost Effectiveness and Customer Satisfaction to premier organizations worldwide. We specialize in &#8220;end-to-end&#8221; business solutions including, but not limited to: </p>\n\n<ul>\n<li>Web Development &amp; Design </li>\n<li>E-commerce </li>\n<li>E-marketing</li>\n<li>Search Engine Optimization (SEO) </li>\n<li>Pay-per-click/Cost per click campaign management</li>\n<li>Custom Software </li>\n<li>Affiliate Marketing</li>\n<li>Managerial Consulting </li>\n<li>Marketing Solutions </li>\n<li>Corporate Identity</li>\n<li>Product Branding </li>\n<li>Competition Analysis </li>\n<li>Product Analysis </li>\n<li>Strength / Weakness Analysis </li>\n<li>Public Relations </li>\n<li>Uncovering internal potential and external opportunities. and support</li>\n</ul>\n\n<p>Our innovative solutions and aggressive use of the latest technologies help clients address challenging business decisions and improve their bottom line through positive returns on their IT investments.</p>","image":{"available_sizes":[[[150,52],"assets/images/resized/0009/4281/94281v1-max-150x150.jpg"],[[243,85],"assets/images/resized/0009/4281/94281v1-max-250x250.jpg"],[[243,85],"assets/images/resized/0009/4281/94281v1-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"CEO","person":{"first_name":"Adeel","last_name":"Khan","permalink":"adeel-khan","image":null}},{"is_past":false,"title":"CTO","person":{"first_name":"Pradeep","last_name":"Saini","permalink":"pradeep-saini","image":null}},{"is_past":false,"title":"President","person":{"first_name":"Sikander","last_name":"Ali","permalink":"sikander-ali","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}