{"name":"mnatives","permalink":"mnatives","crunchbase_url":"http://www.crunchbase.com/company/mnatives","homepage_url":"http://www.mnatives.com","blog_url":"","blog_feed_url":"","twitter_username":"","category_code":"public_relations","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"bulk-sms--send-bulk-sms--bulk-sms-service--bulk-sms-alert--bulk-text-messages","alias_list":null,"email_address":"facebook.mnatives@gmail.com","phone_number":"","description":"Bulk sms Gateway , service provider","created_at":"Fri Mar 02 12:31:32 UTC 2012","updated_at":"Thu Jul 05 17:04:21 UTC 2012","overview":"<p>Mnatives Axiom launched Voice Messaging Services</p>\n\n<p>Every business desires to Grow their sales and that they are continuously seeking for brand spanking new ways that of selling. Axiom has launched voice broadcasting services as a solution to their wants. Voice broadcasting will tremendously increase your productivity by providing you with the flexibility to succeed in lots of, thousands, or maybe uncountable folks instantly, with ONE perfectly-recorded voice broadcasting message. Our voice broadcast systems will send phone messages and announcements to your purchasers and community. Phone messages are often laptop generated from your systems or sites and delivered to your purchasersVoice-broadcasting-services.com is your selling partner for all of your voice broadcasting wants. 0ur voice broadcast method will place decision or uncountable calls. A Pre-recorded message are often played to either a personal answering the phone or to an answering machine. Messages are often primarily a warning to people informing them of emergency alerts, community events, upcoming appointments, or primarily advertisements.</p>\n\n<p>SOLUTIONS OFFERS</p>\n\n<p>• Administration, that provides Service supplier management - Enable/ Disable a Connectivity, Load Distribution, Barring of submission based mostly on Service supplier moreover as Operator/circle for a specific service supplier and DND implementation.\n• Intelligent Routing for Load balancing, capability Allocation, Submission management for economical and most throughput and different Routing in case of failures.\n• Buffer Scheduling and Delivery Report handling.\n• Monitoring Service supplier performance over a time-frame, Connectivity potency, Delivery performance, Real Time Counters and Downtime report.</p>\n\n<p>FEATURES</p>\n\n<p>• Incoming message support for XML, Binary Message content, Regional Messages\n• High throughput (25000 to 30000 messages/ minute).\n• Message Categorization for Promotional, Real Time Transactions, Priority routing based mostly on class, National / International (with time zone support) messaging.\n• Supports multiple connectivity per service supplier. Connects through universally accepted protocols : HTTP / HTTPS / SMPP3.4 / CIMD2.0.\n• Highly scalable platform with Input Modulations of Alert acceptance and Distributed part.\n• Secure Platform with HTTPS/SSH/SFTP, Password authentication and Audit path.</p>\n\n<p>To know more details please visit or contact us: www.mnatives.com </p>\n\n<p>ACL Wireless Limited \nFirst Floor, Tower D \nLogix Technopark 5 - Expressway, \nSec-127 Noida - 201301, India \nTel:  +91.120.4069400 \nMobile:  +919654958361 \nFax: +91.120.4069599\nEmail: sales@acl-wireless.com</p>","image":null,"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}