{"name":"Netagent GmbH","permalink":"netagent-gmbh","crunchbase_url":"http://www.crunchbase.com/company/netagent-gmbh","homepage_url":"http://www.netagent.ch","blog_url":"","blog_feed_url":"","twitter_username":"","category_code":"consulting","number_of_employees":2,"founded_year":2006,"founded_month":3,"founded_day":24,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"management-consulting, reengineering, reporting, crm, salesforce, netsuite, selligent, hyperion, cognos, excel, sap","alias_list":null,"email_address":"elmar.artho@netagent.ch","phone_number":"+41 79 507 3464","description":"Business Development Consulting","created_at":"Wed Jul 21 07:40:49 UTC 2010","updated_at":"Wed Jul 21 20:59:17 UTC 2010","overview":"<p>Netagent GmbH ist ein Management Consulting-Unternehmen spezialisiert auf die Umsetzung strategischer Initiativen im Spannungsfeld von Business-Prozessen, Finanzen und IT. </p>\n\n<p>(A) Strategische Planung und Projektleitung Ihrer strategischen Initiativen\nNetagent unterstützt Sie im Setzen von realistischen, erreichbaren und messbaren kurz- und langfristigen Zielen.\nWir bringen Ihre strategischen Initiativen zum Erfolg, um die gesteckten Ziele zu erreichen. Wir leiten komplexe Projekte im Spannungsfeld von IT, Finanzen und Business. </p>\n\n<p>(B) Business Engineering</p>\n\n<p>Netagent betrachtet den ganzen Prozess, um Verbesserungspotentiale zu sehen. Ein klassisches Vorgehen bedeutet Prozessanalyse und Dokumentation der Schritte und Schnittstellen, Reorganisation der Prozesse, Ausarbeitung einer pragmatischen Lösung und Know-how Transfer.</p>\n\n<p>(C) Research und Analyse\nNetagent schafft Ihnen Transparenz und unterstützt Sie bei der Entscheidungsfindung, bei der Marktanalyse oder bei der Auswahl eines geeigneten Partners oder Produkts. Wir begleiten Sie oder leiten Offertanfragen (RfP) oder erarbeiten eine Marktübersicht mit detaillierten Herstellerinformationen (RfI). Dabei nützen wir unser breites Kriterienspektrum. </p>\n\n<p>(D) Merger &amp; Acquisition Planung und PMI Unterstützung\nNetagent leitet die M&amp;A Strategie aus Ihrer Unternehmensstrategie ab und unterstützt Sie beim Screening möglicher Kandidaten. Wir planen die Integration (PMI) und definieren Ziele, um Synergien zu nutzen. Dabei betrachten wir die Möglichkeiten ganzheitlich, aber mit Fokus auf kombinierte Kundenbasis, Shared Services (Finanzen, Reporting und IT) und Logistik.\nWir realisieren Ihre geplanten Synergien und unterstützen Sie mit voller Kraft in den Wellen des PMI.</p>\n\n<p>(E) CRM und Sales Force Automation\nWir bringen Ihre CRM Implementierung durch massgeschneiderte Roadmaps, stringentes Projektmanagement und Brückenfunktion zu Implementierungs-Drittpartnern zum Erfolg.\nWir standardisieren Ihr Angebot und entwickeln ein Sales Force Tool, damit Ihre Verkäufer standardisiert Offerten anbieten können.\nWir haben Erfahrung mit Absatzfinanzierungen und evaluieren für Sie diese innovative Möglichkeit zur Umsatzverstärkung.</p>\n\n<p>(F) Reporting in Finanzen und Logistik</p>\n\n<p>Messen Sie, um nicht im Blindflug führen zu müssen. Unser Vorgehen ist die Definition von Zielen, das Ableiten von messbaren KPI&#8217;s, die Umsetzung in der Systemlandschaft sowie die Übergabe der Verantwortung an einen Business Owner des Kunden. Wir kreieren für Sie mit Reports Transparenz im Bereich Operations und Finance.</p>","image":{"available_sizes":[[[134,71],"assets/images/resized/0009/4419/94419v2-max-150x150.png"],[[134,71],"assets/images/resized/0009/4419/94419v2-max-250x250.png"],[[134,71],"assets/images/resized/0009/4419/94419v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}