{"name":"Netmar Web marketing","permalink":"netmar-web-marketing","crunchbase_url":"http://www.crunchbase.com/company/netmar-web-marketing","homepage_url":"http://www.netmar.it","blog_url":"http://webmarketing.netmar.it","blog_feed_url":"http://webmarketing.netmar.it/?feed=rss2","twitter_username":"netmar_seo","category_code":"public_relations","number_of_employees":2,"founded_year":1970,"founded_month":8,"founded_day":24,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"marketing, web, internet, agency","alias_list":null,"email_address":"web_market@yahoo.it","phone_number":"","description":"Web marketing agency","created_at":"Thu Sep 10 14:04:18 UTC 2009","updated_at":"Mon Nov 16 19:35:25 UTC 2009","overview":"<p>NetMar is an SEO and web marketing company based in Italy. </p>\n\n<p>NETMAR.IT</p>\n\n<p>Il SEO (search engine optimization) è il processo di miglioramento della quantità e qualità del traffico verso un sito web proveniente da motori di ricerca attraverso risultati di ricerca ‘naturali’ (ovvero ‘organici’ o ‘algoritmici’) secondo parole chiave ben mirate. Solitamente, più in alto il sito appare nei risultati di ricerca, più visitatori avrà. Il SEO può anche indirizzarsi verso altri tipi di ricerca, come quella per immagini o locale. Come strategia di marketing atta a migliorare l’importanza del sito, il SEO prende in considerazione come lavorano gli algoritmi di ricerca e cosa le persone cercano. Le attività del SEO possono influenzare la codifica, la presentazione e la struttura del sito, così come risolvere problemi che impediscono ai programmi di indicizzazione dei motori di ricerca di spiderizzare un sito (lo spider è un software che analizza i contenuti di una rete). Altre attività ancora più visibili sono mirate ad aggiungere contenuti rilevanti al sito, assicurando che il contenuto sia facilmente indicizzato dai motori di ricerca in modo da apparire più accattivante agli utenti. Un’altra categoria di tecniche, conosciute come spamdexing, utilizzano i link farm (ovvero un gruppo di siti che si linkano a vicenda), naturalmente nocivi per l’utente. I motori d ricerca rintracciano i siti che usano questi\nmetodi e possono rimuoverli dai loro indici. La sigla SEO può anche riferirsi a ‘ottimizzatori di motori di ricerca’, termine che può essere\nadottato da un’agenzia di consulenti che svolgono progetti di ottimizzazione per conto di clienti, o usato da dipendenti che si occupano di servizi SEO. Questo servizio può essere offerto solo o come\nparte di una campagna di marketing a più ampio raggio. Visto che il SEO può comportare modifiche al codice HTML di un sito, le tattiche SEO possono essere incorporate all’interno dello sviluppo e del design del sito stesso. Il termine ‘search engine friendly’ può essere usato per\nidentificare quei design, menu, cms e url che sono facilmente ottimizzabili.</p>\n\n<p>Definizione\nIl processo che implica la scelta di espressioni chiave mirate e relative a un sito, in modo daassicurare che il sito si piazzi bene quando le suddette espressioni sono parte di una ricerca nel web.</p>\n\n<p>Informazione\nC’è molta confusione riguardo al SEO e alla sua relazione con lo spam dei motori di ricerca. In generale, un uso legittimo del SEO è un valore aggiunto all’esperienza dell’utente, mentre lo spam è naturalmente negativo, anche se tra questi due poli ci sono ampi margini di manovra.\nL’ottimizzazione implica la realizzazione di pagine leggibili dai motori di ricerca e la messa in evidenza di argomenti chiave relativi al contenuto. L’ottimizzazione base può voler semplicemente dire che il sito non finirà in quella parte invisibile del web (cioè in quella porzione del web che non è accessibile attraverso i motori di ricerca). Un’ottimizzazione più avanzata implica una ricerca significativa dentro ogni elemento del design della pagina, della struttura del sito, e dei criteri esterni alla pagina. Prima che le pagine possano essere ottimizzate, è necessario fare una ricerca per determinare a quali parole chiave è meglio indirizzarsi. Quindi bisogna trovare parole chiave rilevanti, determinarne la popolarità, valutare se siano competitive, e infine decidere quali parole siano meglio corroborate dalla qualità del contenuto.</p>\n\n<p>Fonte : Web marketing SEO Agency www.netmar.it and www.netmar.org\nnetmar.it</p>","image":{"available_sizes":[[[150,79],"assets/images/resized/0005/9350/59350v2-max-150x150.png"],[[192,102],"assets/images/resized/0005/9350/59350v2-max-250x250.png"],[[192,102],"assets/images/resized/0005/9350/59350v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Web marketing Netmar SEO","address1":"Via Mavoncello, 43","address2":"","zip_code":"47923","city":"Rimini","state_code":null,"country_code":"ITA","latitude":null,"longitude":null}],"milestones":[{"description":"Web marketing agency, SEO SEM specialist","stoned_year":2009,"stoned_month":null,"stoned_day":null,"source_url":"http://www.netmar.it","source_text":null,"source_description":"Web marketing agency, SEO SEM specialist","stoneable_type":"Company","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"name":"Netmar Web marketing","permalink":"netmar-web-marketing"}}],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[{"external_url":"http://www.netmar.it","title":"web marketing"}]}