{"name":"Newsweaver","permalink":"newsweaver","crunchbase_url":"http://www.crunchbase.com/company/newsweaver","homepage_url":"http://www.newsweaver.ie","blog_url":"","blog_feed_url":"","twitter_username":"","category_code":"software","number_of_employees":43,"founded_year":1996,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"","alias_list":null,"email_address":"info@newsweaver.com","phone_number":"+353-21-242-7277","description":"email marketing software provider ","created_at":"Fri Jan 14 13:57:05 UTC 2011","updated_at":"Wed May 25 17:16:18 UTC 2011","overview":"<p>Newsweaver is an email marketing software provider that enables more than 1,000 organisations in 26 countries to create, deliver and track meaningful email campaigns.</p>\n\n<p>Our customers use our technology to create email campaigns that will give them higher levels of engagement with their audiences than any other system in the industry today. </p>\n\n<p>The key benefit experienced by our customers is deeper customer insight. This results in higher levels of revenue and increased customer loyalty. </p>\n\n<p>Our clients come from a broad spectrum of businesses. They use Newsweaver email newsletter mailing list software for general communications, marketing, driving sales of products and services, increasing web traffic, internal communications, customer retention and customer support. </p>\n\n<p>Newsweaver milestones – find out more about the history of the company\nProfiles – find out more about the key people in our business\nPricing – find out about our pricing structure, discounted rates and tailored quotes\nWork with us – find out what Newsweaver has to offer jobseekers\nCurrent job opportunities – have a look at our current vacancies\nAbout Cork – find out about Newsweaver’s Irish base and European headquarters\n.</p>","image":null,"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}