{"name":"Outspective","permalink":"outspective","crunchbase_url":"http://www.crunchbase.com/company/outspective","homepage_url":"http://www.outspective.com/","blog_url":"http://www.outspective.com/blog/","blog_feed_url":"http://www.outspective.com/blog/feed","twitter_username":"Outspective","category_code":"consulting","number_of_employees":10,"founded_year":2012,"founded_month":11,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"outspective, digital-marketing, social-media, branding","alias_list":null,"email_address":"info@Outspective.com","phone_number":"","description":"Your Outside Perspective ","created_at":"Fri Nov 30 00:07:16 UTC 2012","updated_at":"Fri Dec 07 04:48:51 UTC 2012","overview":"<p>A digital agency with the personal service &amp; frequent interaction you’d expect of an in-house marketing team.</p>\n\n<p>Our creative and effective strategy helps our clients succeed.</p>\n\n<p>We Listen: Understanding and appreciating the needs and objectives is just as important if not more important than all the knowledge Outspective brings to your table. Before Outspective begins we want to know and understand your business and what challenges your are facing and what goals you want to achieve.</p>\n\n<p>We Analyze: With over 40 combined years of experience in digital marketing Outspective leverages that knowledge to do in depth research about your brand and it’s standing online. This, coupled with the industry resources allows us to determine your place in your unique market.</p>\n\n<p>We Create: Taking your needs, objectives, and goals as well as the in depth research made, Outspective creates a unique plan for your brand’s success, regardless of budget to present to you, and then based upon your budget advise you as what to do first to be successful. It is the ultimate determination of the client, if they wish to proceed with Outspective impleming the strategy, or to leverage the Outspective provided internally or with another agency or individual.</p>\n\n<p>We Implement: Knowing where the market was, and is currently, is only half the battle, Outspective is constantly looking at the digital ecosystem to determine what can be done today to position it’s clients ahead of the curve tomorrow, and as such we are constantly developing propritary services and software for our clients to use to become successful, not only for today, but for tomorrow as well.</p>\n\n<p>Your brand with one unified message.\nWhen people mention the term “brand,” they’re usually referring to a logo. But in reality, a brand is MUCH more than that. Yes, your logo is the cornerstone, but your messaging, your visual representation, your staff, your communication and your copy all work together to build your complete brand.</p>\n\n<p>Is your brand working for your business? Is it dated &amp; irrelevant? Is it inconsistent or not fully developed? Does it match across all platforms from print to social media, digital to real life? The Outspective team provides the outside perspective you need to answer these questions and determine if you are right where you need to be, if it’s time for a refresh, or if your business needs to develop branding in the first place.</p>\n\n<p>You never get a second chance at that first impression, so make sure your branding expresses who you are and what you are about in a way that positively impacts your bottom line.</p>","image":{"available_sizes":[[[150,51],"assets/images/resized/0022/3105/223105v5-max-150x150.png"],[[250,85],"assets/images/resized/0022/3105/223105v5-max-250x250.png"],[[450,153],"assets/images/resized/0022/3105/223105v5-max-450x450.png"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"Founding Partner","person":{"first_name":"Justin","last_name":"Brackett","permalink":"justin-brackett","image":null}},{"is_past":false,"title":"Founding Partner","person":{"first_name":"Dan","last_name":"Myer","permalink":"dan-myer","image":null}},{"is_past":false,"title":"Founding Partner","person":{"first_name":"Samantha","last_name":"Collier","permalink":"samantha-collier","image":null}},{"is_past":false,"title":"Founding Partner","person":{"first_name":"Kirk","last_name":"Holmes","permalink":"kirk-holmes","image":null}},{"is_past":false,"title":"Founding Partner","person":{"first_name":"Brittany","last_name":"Botti","permalink":"brittany-botti","image":null}},{"is_past":false,"title":"Founding Partner","person":{"first_name":"Gayla","last_name":"Myber","permalink":"gayla-myber","image":null}}],"competitions":[],"providerships":[{"title":"Branding","is_past":true,"provider":{"name":"JustInTheSouth.com","permalink":"justinthesouth-com","image":null}}],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}