{"name":"Petooz","permalink":"petooz","crunchbase_url":"http://www.crunchbase.com/company/petooz","homepage_url":"http://petooz.com","blog_url":"http://petooz.com","blog_feed_url":"feed://petooz.com/rssfeeds/channel/feed/rss/activity","twitter_username":"petoozsite","category_code":"network_hosting","number_of_employees":5,"founded_year":2011,"founded_month":4,"founded_day":20,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"social-network, social-network-for-pets, pets-social, social-pets, pets","alias_list":null,"email_address":"info@petooz.com","phone_number":"50760908087","description":"Social Network for Pets","created_at":"Wed May 11 12:29:39 UTC 2011","updated_at":"Fri May 13 14:32:00 UTC 2011","overview":"<p>Fundada en abril de 2011, Petooz es una utilidad social que ayuda a interactuar a tu mascota con otras mascotas de familiares, amigos y de todo el mundo.</p>\n\n<p>Cualquier persona puede registrarse en Petooz e establecer contacto con la gente que tiene mascotas en un entorno de confianza, formamos parte y conectamos muchos dueños de mascotas en todo el mundo. </p>\n\n<p>Petooz, el producto, se compone de las funciones principales del sitio y aplicaciones.</p>\n\n<p>Las características fundamentales de la experiencia en Petooz son la Página Principal y el Perfil de la Mascota. La página principal incluye News Feed, un feed personalizado actualizaciones de las mascotas. El perfil muestra información sobre la mascota que el dueño o la dueña ha elegido para compartir, incluyendo descripciones de sus mascotas e información relevante a ella. </p>\n\n<p>Petooz también incluye aplicaciones básicas - Fotos, eventos, videos, grupos y clasificados - que permiten a las personas a conectarse y compartir información de una manera interesante y atractiva. </p>\n\n<p>Además, las personas pueden comunicarse entre sí por medio de chat, mensajes personales, mensajes de pared, o actualizaciones de estado.</p>\n\n<p>Petooz está preparado para manejar alto tráfico a nivel mundial y ha tenido que construir la infraestructura adecuada para apoyar a este rápido crecimiento. </p>\n\n<p>Nuestra plataforma se basa en LAMP (Linux, Apache, MySQL y PHP). Utilizamos memcached, un sistema de almacenamiento en caché de fuente abierta, y bases de datos MySQL en servidores separados. El sitio es en gran parte escrito en PHP, aunque el equipo de ingeniería ha desarrollado una manera de transformar la programación de código PHP de código fuente en C++ para obtener ventajas de rendimiento. </p>\n\n<p>Petooz se ha construido un ligero pero potente marco de RPC para manejar varios idiomas a la perfección. </p>\n\n<p>La compañía ha creado un motor de búsqueda a la medida que sirve a millones de consultas al día, totalmente distribuido y completamente en la memoria, con actualizaciones en tiempo real. </p>\n\n<p>La mayoria de las estructuras de datos y los lenguajes de programación utilizados en esta plataforma de Petooz.com se basan en gran medida en el Código Abierto.</p>\n\n<p>Utilizamos Zend Framework, ZF es un framework de código abierto para desarrollar aplicaciones web y servicios web con PHP 5.</p>\n\n<p>ZF es una implementación que usa código 100% orientado a objetos. La estructura de los componentes de ZF es algo único; cada componente está construido con una baja dependencia de otros componentes. </p>\n\n<p>Esta arquitectura débilmente acoplada permite a los desarrolladores utilizar los componentes por separado. A menudo se refiere a este tipo de diseño como &#8220;use-at-will&#8221; (uso a voluntad). </p>\n\n<p>El principal patrocinador del proyecto Zend Framework es Zend Technologies, pero muchas empresas han contribuido con componentes o características importantes para el marco. </p>\n\n<p>Empresas como Google, Microsoft y StrikeIron se han asociado con Zend para proporcionar interfaces de servicios web y otras tecnologías que desean poner a disposición de los desarrolladores de Zend Framework.</p>\n\n<p>Nuestro servidor principal está ubicado en Berlín Alemania y nuestro Data Center se ubica en Palo Alto, California, USA.</p>","image":{"available_sizes":[[[150,50],"assets/images/resized/0013/4151/134151v2-max-150x150.jpg"],[[250,83],"assets/images/resized/0013/4151/134151v2-max-250x250.jpg"],[[390,131],"assets/images/resized/0013/4151/134151v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"CEO & Founder","person":{"first_name":"Gianfranco","last_name":"Mileo","permalink":"gianfranco-mileo","image":null}},{"is_past":false,"title":"CFO","person":{"first_name":"Vijey","last_name":"Perez","permalink":"vijey-perez","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Panama Office","address1":"San Francisco, Via Porras","address2":"","zip_code":"","city":"Ciudad de Panama","state_code":null,"country_code":"PAN","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[{"available_sizes":[[[135,150],"assets/images/resized/0013/4149/134149v2-max-150x150.jpg"],[[225,250],"assets/images/resized/0013/4149/134149v2-max-250x250.jpg"],[[405,450],"assets/images/resized/0013/4149/134149v2-max-450x450.jpg"]],"attribution":null},{"available_sizes":[[[100,150],"assets/images/resized/0013/4150/134150v2-max-150x150.jpg"],[[166,250],"assets/images/resized/0013/4150/134150v2-max-250x250.jpg"],[[300,450],"assets/images/resized/0013/4150/134150v2-max-450x450.jpg"]],"attribution":null}],"external_links":[{"external_url":"http://petooz.com/pages/prensa","title":"Sala de Prensa"},{"external_url":"http://petooz.com/help/contact","title":"Contact"}]}