{"name":"PhotoSpotLand™","permalink":"photospotland-2","crunchbase_url":"http://www.crunchbase.com/company/photospotland-2","homepage_url":"http://www.photospotland.com","blog_url":"http://blog.photospotland.com","blog_feed_url":"","twitter_username":"photospotland","category_code":"web","number_of_employees":3,"founded_year":2012,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"photography, photo, social, communities, marketing, data, leisure, travel","alias_list":"","email_address":"info@photospotland.com","phone_number":"","description":"how to shoot great photos in great place","created_at":"Thu Nov 29 14:56:51 UTC 2012","updated_at":"Wed Dec 05 03:25:31 UTC 2012","overview":"<p>How to shoot great photos in great places. With great people&#8230;or alone. </p>\n\n<p>New York | Catania</p>\n\n<p>Today killer app on web and mobile is sharing photos, and people now love to share great photos.</p>\n\n<p>PhotoSpotLand help them suggesting great places to do it and creating great shooting experience, with great people or&#8230;alone. We are a step above sharing photos and we don&#8217;t share photos.</p>\n\n<p>PhotoSpotLand is the essential instrument of where, how, what and with whom to take pictures around the world and to propose and aggregate photographers communities to share the experience.</p>\n\n<p>A community where people loving photography can share best locations/events where to shoot great photos, how, when and with whom to shoot.</p>\n\n<p>Are you an enthusiast or amateur or pro photographer? We will help on your journey to focus on your calling as a photographer, as you can only focus and capture the souls of your photographs.</p>\n\n<p>Our users are anyone who share the Passion for photography, anyone feeling emotions shooting a photo. No matter if they are enthusiast, amateur, semi-professional or professional, including blind photographers!</p>\n\n<p>They all have needs in common, and we the the solution in a web/mobile platform.</p>\n\n<p>A) Where to shoot great pictures</p>\n\n<p>B) How to shoot great pictures</p>\n\n<p>C) Shoot great pictures.</p>\n\n<p>Anyone loving photos use PhotoSpotLand to ask: what, where, with whom and when to shoot great photos.</p>\n\n<p>The aim of PhotoSpotLand™ is also to aggregate the micro-communities that spontaneously grow around the most popular photo-shooting Spots to share experience and knowledge.\n‘Spot’, because we are interested in whatever can create interest to our users like landscapes,  coastlines, mountain ranges, buildings or bridges, religious events cultural events, festivals, carnivals or once in a life time events such as volcano eruptions or lunar eclipses; in conclusion all the Spots where it is possible to take remarkable shots.</p>\n\n<p>Our target is not to duplicate or recreate any of the existing social networks or mobile applications, but is to produce a tool that will allow and promote different level of information sharing, by using web or mobile on the Spot.</p>\n\n<p>PhotoSpotLand™ allows photographers to plan in advance and with efficiency the best Spot with the best position, at the best time, with the right gears with advice from those who have shot there before.</p>\n\n<p>Using PhotoSpotLand™ before leaving home you can find out if any other photographer is visiting the spot at the same time as you, and how he is organizing is trip. </p>\n\n<p>And when on the spot can discover who already are around, sharing advice, gears, backup problems (battery fault, a miss tripod or flash etc). Receive immediate updates about parking spaces, wind, if there is any dangerous situations etc….by using the map you can visualize all the nearest photographers, find out which photographic equipment they have, and brand and model of the gear they use as who is available to give advice. The app will also allow the photographer to send messages to each other, so if while you are on the spot and encounter a technical problems (like a battery failure), or need a different tool for your camera you can find if anyone in the vicinity is able to help. Or only  the experience to shoot together&#8230;You also may ask a close by and more experienced photographer how to take the best shot. </p>\n\n<p>And if there are nearest blind photographers offer to advice and guide. </p>\n\n<p>So PhotoSpotLand™ solves practical problems of anyone who share the passion for photography giving them the chance to plan, to shared experience and meet others with the same passion, having fun and saving money. On a timeline base we also connecting photographers with people who&#8217;ve taken photos of that spot before!</p>\n\n<p>We want to change the way people shoot photos. We will help on users journey to focus on users calling as a photographer, as she can only focus and capture the souls of her photographs&#8230;Alone or on a shared experience.</p>\n\n<p>With a special project, we also want to help blind photographers, we are sure that blind and &#8216;normal&#8217; photographers can transmit and exchange one each other enthusiasm, new vision, and experience.</p>\n\n<p>The market is so big, we adress potentially hundreds of millions users worldwide. Think how many PhotoSpotLand user we can catch just in famous Spots like Piazza di Spagna in Rome, Piccadilly Circus in London, Time Sq in NYC etc. hundreds of thousands a day, often creating  micro-communities.</p>\n\n<p>On the biz model side ur customers are big and medium players in the photo market industry and in tourist industry. We are customers broker, as every community born to. Collecting our users/photographers deep data and information, for each user We know: Users Photographic Gears, oldest, newest, lens,\nsoftware, hardware, smartphone, tablet etc. We also know annual spending ans gears wish list. And thanks to our timeline we know travel begaviour and plans.</p>\n\n<p>The Beta will ready mid of December.</p>\n\n<p>The team include experts in marketing, communication, social media, photograohy, PR, design, professional journalist, DB management and in our advisory board we had expert in marketing and opinion research, usability, famous photographers etc.</p>\n\n<p>Our competitors are fragmented and/or not focused, mainly dediated to sharing photos or location without a clear focus point, we are a step above, we help their users.</p>\n\n<p>We plan to establish the company headquarter in NYC.</p>","image":{"available_sizes":[[[150,94],"assets/images/resized/0022/3578/223578v2-max-150x150.png"],[[250,157],"assets/images/resized/0022/3578/223578v2-max-250x250.png"],[[450,283],"assets/images/resized/0022/3578/223578v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"CEO","person":{"first_name":"Mario","last_name":"Bucolo","permalink":"mario-bucolo-2","image":null}},{"is_past":false,"title":"Strategic, PR legal and communications counsel","person":{"first_name":"Mark","last_name":"D. Fabiani","permalink":"mark-d-fabiani","image":null}}],"competitions":[{"competitor":{"name":"Flickr","permalink":"flickr","image":{"available_sizes":[[[150,25],"assets/images/resized/0021/3864/213864v1-max-150x150.png"],[[180,30],"assets/images/resized/0021/3864/213864v1-max-250x250.png"],[[180,30],"assets/images/resized/0021/3864/213864v1-max-450x450.png"]],"attribution":null}}},{"competitor":{"name":"Gogobot","permalink":"gogobot","image":{"available_sizes":[[[150,41],"assets/images/resized/0009/0466/90466v4-max-150x150.jpg"],[[250,68],"assets/images/resized/0009/0466/90466v4-max-250x250.jpg"],[[435,120],"assets/images/resized/0009/0466/90466v4-max-450x450.jpg"]],"attribution":null}}},{"competitor":{"name":"Wipolo","permalink":"actimos","image":{"available_sizes":[[[150,55],"assets/images/resized/0008/9775/89775v6-max-150x150.png"],[[250,93],"assets/images/resized/0008/9775/89775v6-max-250x250.png"],[[250,93],"assets/images/resized/0008/9775/89775v6-max-450x450.png"]],"attribution":null}}}],"providerships":[{"title":"PR & Legal","is_past":false,"provider":{"name":"Fabiani & Lehane","permalink":"fabiani-lehane","image":null}}],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"World Headquarters","address1":"","address2":"","zip_code":"10028","city":"New York","state_code":"NY","country_code":"USA","latitude":null,"longitude":null},{"description":"Technical labs","address1":"","address2":"","zip_code":"95128","city":"Catania","state_code":null,"country_code":"ITA","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[{"external_url":"http://www.ilsole24ore.com/art/tecnologie/2012-06-22/photospotland-194747.shtml?uuid=AbabjiwF","title":"Il Sole 24 Ore"}]}