{"name":"PlaceChallenge","permalink":"placechallenge","crunchbase_url":"http://www.crunchbase.com/company/placechallenge","homepage_url":"http://placechallenge.com","blog_url":"http://placechallenge.tumblr.com/","blog_feed_url":"http://placechallenge.tumblr.com/rss","twitter_username":"placechallenge","category_code":"games_video","number_of_employees":3,"founded_year":2011,"founded_month":5,"founded_day":1,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"game, mechanics, loyality, card, place, challenge, location, social, rewards, mobile, communities, places, checkin","alias_list":null,"email_address":"marcin.borecki@placechallenge.com","phone_number":"+48 503 451 438","description":"Platform for location-based games","created_at":"Mon Jun 20 10:30:50 UTC 2011","updated_at":"Sun Mar 18 01:44:17 UTC 2012","overview":"<p>PlaceChallenge, a project that Marcin Borecki and Jakub Kądziela initiated during the first Startup Weekend in Poland, shows all the young entrepreneurs that there is need to aim high - the creators are going to the U.S. for a month to present the project in front of the largest investors and potential customers. The project is a platform that focuses on geolocation games in the real world, that is using a mobile phone equipped with GPS and an Internet connection.</p>\n\n<p>&#8220;For several years my participation in the Polish Scouting Association showed me how stalking games works. The atmosphere of these games I&#8217;d like to share with all people willing to run around and rediscover the city with scenario created by us - Marcin Borecki &#8220;.</p>\n\n<p>After severals months of starting work, the creators decided to show everyone how their project look like and officially start the system. The official inauguration will take place in Silicon Valley on 7-8 March at a prestigious conference called Launch. Launch conference is created to promote the most innovative projects from around the world with hundreds of investors and business angels, lawyers and the media. During the event PlaceChallenge will have a booth where all of attendees can see how project works, preview already completed games and win coupons.</p>\n\n<p>&#8220;In addition to Silicon Valley we are going to visit other places in the U.S. For example New York, Seattle and Las Vegas, and finally Los Angeles. In each of these cities we are going to host a special game. For more information visit our website - Jakub Kądziela &#8221;</p>\n\n<p>The games prepared to show in the United States:</p>\n\n<p>UnLock City – a game used to build guides for other people based on pictures of interesting places around the world. People visiting a city such as London during sightseeing taking photos, which are automatically placed on the map. The next visitors to the city will benefit from the photos and tips to reach places of interest.</p>\n\n<p>Runaway - a game in which a specified time in the city is placed a virtual coin. Since the show the players where everyone has a chip on his two hours to find, taking it and maintain it until the end of the game. In the meantime, other people can escape the current owner of the token - just that they will be closer to him on 50 meters. First person who will have a chip at a time when time runs out the game.</p>\n\n<p>Tail - a game similar to the snake game well-known from old mobile phones but in version moved to real city. Users moving through the city are supposed to cut off the road or go around the enemy’s snake. You can play running, riding a bike or for example driving a car.</p>\n\n<p>&#8220;We are going to the United States is not only to promote our project, but also to show young people that everyone can. Today&#8217;s education system is not designed to make people able to transform their passions to successful projects. Schematic thinking and even fear of making mistakes does not help people to try creating their own business. In addition, we see that a lot of very interesting projects are focused on the local market instead of thinking globally. To all those people we dedicate the trip, showing that anyone who is not trying to could not winning. - Marcin Borecki &#8221;</p>\n\n<p>Last months of creation a PlaceChallenge we’ve been seen on the European market and with following achievements:</p>\n\n<ul>\n<li>Won the audience prize in 1st Warsaw Startup Weekend</li>\n<li>Won the New Europe Venture Contest (Stock Exchange).</li>\n<li>Was part of a school for young CEOs created by Piotr Wilam (creator of Onet.pl and Pascal)</li>\n<li>Selected as Top 20 Startups Europe selected by Seedcamp, Slovenia</li>\n<li>Selected as Top 13 Startups Europe chosen by Europe Startup Weekend Battle, United Kingdom</li>\n</ul>\n\n<p>In recent days, Microsoft has announced that is going to start cooperation with PlaceChallenge placing the project as one of the most innovative in the world, giving unlimited server infrastructure, necessary for the continued and efficient operation for free.</p>\n\n<p>All persons who are willing to keep track of what will happen the next month visit our site at: http://placechallenge.com and on the blog, to which reference can be found on the website.</p>","image":{"available_sizes":[[[150,64],"assets/images/resized/0013/9986/139986v6-max-150x150.jpg"],[[250,108],"assets/images/resized/0013/9986/139986v6-max-250x250.jpg"],[[450,194],"assets/images/resized/0013/9986/139986v6-max-450x450.jpg"]],"attribution":null},"products":[{"name":"UnLock City","permalink":"unlock-city","image":null},{"name":"Teambuilding","permalink":"teambuilding","image":null}],"relationships":[{"is_past":false,"title":"CEO","person":{"first_name":"Marcin","last_name":"Borecki","permalink":"marcin-borecki-2","image":{"available_sizes":[[[117,150],"assets/images/resized/0014/0876/140876v2-max-150x150.jpg"],[[180,229],"assets/images/resized/0014/0876/140876v2-max-250x250.jpg"],[[180,229],"assets/images/resized/0014/0876/140876v2-max-450x450.jpg"]],"attribution":""}}},{"is_past":false,"title":"CTO","person":{"first_name":"Jakub","last_name":"Kadziela","permalink":"jakub-kdziela","image":null}},{"is_past":false,"title":"Art Director","person":{"first_name":"Michał","last_name":"Kosecki","permalink":"micha-kosecki","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"PlaceChallenge HQ","address1":"","address2":"","zip_code":"","city":"Palo Alto","state_code":"CA","country_code":"POL","latitude":null,"longitude":null},{"description":"PlaceChallenge HQ 1","address1":"","address2":"","zip_code":"","city":"Palo Alto","state_code":"CA","country_code":"USA","latitude":null,"longitude":null}],"milestones":[{"description":"1st place at Audience Selection during Startup Weekend at Warsaw","stoned_year":2011,"stoned_month":5,"stoned_day":15,"source_url":"http://warsaw.startupweekend.org/","source_text":null,"source_description":"Startup Weekend and Warsaw Site","stoneable_type":"Company","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"name":"PlaceChallenge","permalink":"placechallenge"}},{"description":"1st place at Jury Selection during New Europe Venture Contest at Warsaw, Poland","stoned_year":2011,"stoned_month":6,"stoned_day":10,"source_url":"http://nevc.pl/","source_text":null,"source_description":"New Europe Venture Contest","stoneable_type":"Company","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"name":"PlaceChallenge","permalink":"placechallenge"}}],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}