{"name":"Printsasia.co.uk","permalink":"printsasia-co-uk","crunchbase_url":"http://www.crunchbase.com/company/printsasia-co-uk","homepage_url":"http://www.printsasia.co.uk","blog_url":"http://blog.printsasia.com","blog_feed_url":"http://blog.printsasia.com/feed/","twitter_username":"PrintsasiaUK","category_code":"ecommerce","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"","alias_list":null,"email_address":"web@printsasia.co.uk","phone_number":"","description":"The mega online bookshop. ","created_at":"Fri Jun 15 10:03:47 UTC 2012","updated_at":"Sat Aug 18 09:27:28 UTC 2012","overview":"<p>We are a mega online retailer of books offering over 3.5 million popular and rare books from local publications, United States and South Asian Region. We provide our service to end users, libraries, universities and booksellers worldwide. We have the extension of our network in several other countries like United States, Japan and Germany, having tie- ups with globally acknowledged publishers, distributors and vendors who explore the book industry with us. We have designed our website in such a way that offers easy and user- friendly browsing of books and we offer quite reasonable pricing on the titles available at our bookstore.\nReaders who love to read books in local languages can also search for their desired titles as our inventory does not limit itself to English language books but also Spanish, Hindi and more. We are in well- established business relationship with more than 25,000 publishers from all across the globe who provide us with daily updates on their recent publications.</p>\n\n<p>Competitive Pricing</p>\n\n<p>We encourage more reading with our honest and reasonable pricing. Most of the titles available at our bookstore are priced at its best so that customers at our bookstore can buy more with less pricing.</p>\n\n<p>Inventory with High Quality and Rich Quantity</p>\n\n<p>Apart from the best pricing, we bank on our high quality collection of book titles offering some very hard- to- find books to our intended customers. Our collection of books range from science- technology- medicine to novels and non- fictions, from photography- architecture- designing to religions- yoga and meditation and more.</p>\n\n<p>We provide user- friendly browsing of books for our diverse kinds of customers. Customers can easily search their desired book titles browsing by ISBN, title, category and author’s name. Most of the titles have all the relevant details of the book, e.g. Cover Image, Author’s Name, ISBN, Publisher’s name, Publication year, Book Binding, Weight and more. Book details pages are also supported by related searches that give further recommendations to customers to shop for titles of their interests.</p>\n\n<p>We endeavor to serve our customers at our best every time and promise to improve our service to match or exceed customers’ expectations and our own standards.</p>","image":{"available_sizes":[[[150,37],"assets/images/resized/0019/5630/195630v2-max-150x150.png"],[[200,50],"assets/images/resized/0019/5630/195630v2-max-250x250.png"],[[200,50],"assets/images/resized/0019/5630/195630v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[{"description":"No Prepayments Required\r\n \r\nAll libraries can start purchasing books without making prepayments. All that you require is setting up an account with Printsasia","stoned_year":2012,"stoned_month":6,"stoned_day":19,"source_url":"","source_text":null,"source_description":"Printsasia Online Bookshop- Your Credit Acccount ","stoneable_type":"Company","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"name":"Printsasia.co.uk","permalink":"printsasia-co-uk"}}],"ipo":null,"video_embeds":[{"embed_code":"<iframe title=\"Printsasia.co.uk video\" class=\"youtube-player\" \r\n\r\ntype=\"text/html\" \r\nwidth=\"425\" height=\"349\" \r\n\r\nsrc=\"http://www.youtube.com/embed/-SE60qU2mZqc\"\r\nframeborder=\"0\" allowFullScreen></iframe>","description":"<p>Printsasia Online Bookshop</p>"}],"screenshots":[{"available_sizes":[[[150,112],"assets/images/resized/0019/6363/196363v2-max-150x150.jpg"],[[250,187],"assets/images/resized/0019/6363/196363v2-max-250x250.jpg"],[[450,337],"assets/images/resized/0019/6363/196363v2-max-450x450.jpg"]],"attribution":null}],"external_links":[]}