{"name":"Qmato","permalink":"qmato","crunchbase_url":"http://www.crunchbase.com/company/qmato","homepage_url":"http://qmato.com","blog_url":"http://qmato.com/blog","blog_feed_url":"http://qmato.com/blog/rss","twitter_username":"qmato","category_code":"web","number_of_employees":2,"founded_year":2012,"founded_month":3,"founded_day":25,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"food, restaurants, mobile, local, recommendations, recommendation-engine, reviews","alias_list":null,"email_address":"aaron@qmato.com","phone_number":"","description":"Restaurant recommendation engine","created_at":"Sun Jun 17 19:51:29 UTC 2012","updated_at":"Sun Jun 24 06:32:50 UTC 2012","overview":"<p>Qmato provides trusted restaurant recommendations.</p>\n\n<p>Users begin by filling out a brief, one-time questionnaire about their food, atmosphere, and value preferences. From there, it&#8217;s one click to two great recommendations, tailored specifically to the user&#8217;s tastes, anywhere in the US.</p>\n\n<p>Users can always get great recommendations without any fiddling, but if they&#8217;re going on a date, planning a fancy dinner, wanting to try something unique, or just a particular cuisine, Qmato makes it easy to do that too.</p>\n\n<p>After getting the recommendations, if the user doesn&#8217;t feel like eating a particular cuisine, or doesn&#8217;t feel like paying that much or traveling so far, Qmato makes it easy to request a new recommendation that&#8217;s a better fit.</p>\n\n<p>Qmato starts by recommending the very best personalized match based on the user&#8217;s preferences, restaurant rating, and suitability for the occasion.</p>\n\n<p>If the user is staying in a place for more than one day, then variety becomes important too. So from one day to the next, Qmato gradually expands the pool from which it draws recommendations. That means users can get recommendations from Qmato every day and always end up at a new, interesting place. </p>\n\n<p>Qmato&#8217;s recommendations come with a brief explanation that explains why each restaurant is a great fit. Users can click through to see a full description of each restaurant.</p>\n\n<p>Qmato provides superb restaurant recommendations right from the start, but then goes further. As users rate restaurants, Qmato learns about their likes and dislikes and uses this information to make each user&#8217;s recommendations even better over time.</p>\n\n<p>Qmato lists over 800,000 restaurants nationwide, so users can be confident its recommendations are truly the best options available.</p>\n\n<p>Qmato provides the full menus for hundreds of thousands of restaurants, often using direct links to the menu on the restaurant&#8217;s own website - so users get the most up-to-date menu info available anywhere. Qmato also displays the business hours and other key details for hundreds of thousands of more places, so users always know what to expect.</p>\n\n<p>Qmato&#8217;s Recommended list gives users a snapshot of the most unique and recommended items at nearly every restaurant. Users can also search for menu items to find the best burrito (etc.) in town.</p>\n\n<p>Often users will run across an interesting restaurant that just doesn’t fit the bill right now. Users can easily save these restaurants for later. They can keep track of their favorite places and make and share their own lists.</p>\n\n<p>Qmato also lets users browse full search results in two different views, write restaurant reviews, and follow other Qmato users to stay updated on their ratings, reviews, and lists.</p>\n\n<p>Qmato includes a powerful keyword search that can be used to find something specific or just unusual. Users can describe what they’re looking for in natural language - for example, “bright airy lunch spot” or “cheap vegetarian dinner” - and Qmato will return the most fitting results.</p>","image":{"available_sizes":[[[120,150],"assets/images/resized/0019/5886/195886v2-max-150x150.png"],[[150,186],"assets/images/resized/0019/5886/195886v2-max-250x250.png"],[[150,186],"assets/images/resized/0019/5886/195886v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[{"available_sizes":[[[150,76],"assets/images/resized/0019/5881/195881v2-max-150x150.png"],[[250,126],"assets/images/resized/0019/5881/195881v2-max-250x250.png"],[[450,228],"assets/images/resized/0019/5881/195881v2-max-450x450.png"]],"attribution":null},{"available_sizes":[[[150,75],"assets/images/resized/0019/5882/195882v2-max-150x150.png"],[[250,126],"assets/images/resized/0019/5882/195882v2-max-250x250.png"],[[450,227],"assets/images/resized/0019/5882/195882v2-max-450x450.png"]],"attribution":null},{"available_sizes":[[[150,75],"assets/images/resized/0019/5883/195883v2-max-150x150.png"],[[250,126],"assets/images/resized/0019/5883/195883v2-max-250x250.png"],[[450,227],"assets/images/resized/0019/5883/195883v2-max-450x450.png"]],"attribution":null},{"available_sizes":[[[150,75],"assets/images/resized/0019/5884/195884v2-max-150x150.png"],[[250,126],"assets/images/resized/0019/5884/195884v2-max-250x250.png"],[[450,227],"assets/images/resized/0019/5884/195884v2-max-450x450.png"]],"attribution":null},{"available_sizes":[[[150,75],"assets/images/resized/0019/5885/195885v2-max-150x150.png"],[[250,126],"assets/images/resized/0019/5885/195885v2-max-250x250.png"],[[450,227],"assets/images/resized/0019/5885/195885v2-max-450x450.png"]],"attribution":null}],"external_links":[]}