{"name":"Quest outsourcing","permalink":"questoutsourcing","crunchbase_url":"http://www.crunchbase.com/company/questoutsourcing","homepage_url":"http://www.questoutsourcing.com","blog_url":"","blog_feed_url":"","twitter_username":null,"category_code":"ecommerce","number_of_employees":15,"founded_year":2008,"founded_month":8,"founded_day":15,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"outsourcing-projects, data-entry-work, data-entry-projects, bpo-outsourcing, b2b-market-place, software-development, web-development, call-center, data-transcription","alias_list":"","email_address":"atuls@questoutsourcing.com","phone_number":"91-9422277474","description":"We are a b2b marketplace","created_at":"Mon Mar 16 09:44:36 UTC 2009","updated_at":"Sat Mar 21 14:04:25 UTC 2009","overview":"<p>Questoutsourcing.com is an interactive innovative B2B portal which provides the world’s largest online marketplace for IT/ITES talent pool. Where hundreds of thousands of Buyers and Sellers interact with each other for their business outsourcing needs, be it web development, call centers, data entry, accounting and book keeping and more than hundred other services.</p>\n\n<p>For People / Companies (Service buyers) wishing to outsource their work / services it means a large pool of talented virtual workforce and savings in costs and time.</p>\n\n<p>For People / Companies (Service Providers) it means access to global outsourcing market with hundreds of options to show their skills and get the right kind of work they desire. Thus helping them to get their foothold in the international market.</p>\n\n<p>Quesoutsourcing.com is founded with a simple objective - to provide a superior seller-buyer matchmaking experience by expanding the opportunities available to meet potential partners. We wish to create a world renowned service that can touch the lives of millions of people all over the world.</p>\n\n<p>The mandate to ‘Team Questoutsourcing’ is very clear -</p>\n\n<ul>\n<li><p>Understand the needs of potential buyers all over the world through tireless research and analysis  </p></li>\n<li><p>Provide a platform to help businesses worldwide with satisfying, and superior experience to our service providers by bringing them quality projects / tenders.</p></li>\n<li><p>Give our members complete control through easy to use interfaces and features that can help them identify, filter and contact potential buyers.</p></li>\n</ul>","image":null,"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Questoutsourcing.com","address1":"Kranti chowk ","address2":"Jalna Road","zip_code":"431 001","city":"Aurangabad","state_code":null,"country_code":"IND","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}