{"name":"realpeoplerealstuff.com ","permalink":"realpeoplerealstuff-com","crunchbase_url":"http://www.crunchbase.com/company/realpeoplerealstuff-com","homepage_url":"http://realpeoplerealstuff.com/","blog_url":"","blog_feed_url":"","twitter_username":"","category_code":null,"number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":null,"alias_list":"","email_address":"","phone_number":"","description":"","created_at":"Tue Oct 14 07:25:43 UTC 2008","updated_at":"Fri Aug 17 09:34:12 UTC 2012","overview":"<p>Always wanted to make money on the Internet?\nWe&#8217;re starting a new web business, called realpeoplerealstuff.com. The basic idea is this: CraigsList and YouTube had a baby - a combination of entertaining videos and classifieds ads that people will email to their friends, and ones that make people want to buy your stuff.</p>\n\n<p>Realtors, car dealers, employers and real people spend more than $20 billion a year on classified advertising. This is a giant marketplace that is migrating from print to online at the same time that online is migrating to video. Our site will be ready to handle this business.</p>\n\n<p>The media landscape is changing\nAdvertising is migrating to the web in video format. Realpeoplerealstuff.com combines the hottest Internet trends in one, easy-to-use site: e-Commerce, snarky writing, funny videos, everyone&#8217;s desire to be a star and video sharing. Because it&#8217;s video, you can tell people a lot more about what you&#8217;re selling than what they can see in a couple of photographs on craigslist.com or eBay. Plus, you can be funny. And if you are, you could be semi-famous, like that weird Numa-Numa guy, who got on lots of TV talk shows by doing one incredibly stupid video of himself lip-synching on his webcam. Or like lonelygirl15, who had her own little serial show on YouTube.</p>\n\n<p>Numa-Numa and loneygirl15 were hits because viewers connected with them. One was hot and one was not, but both were engaging and entertaining. Numa-Numa has had over 2 million page views, proving you don&#8217;t the production values of Lazy Sunday to make it in the world of online video.</p>\n\n<p>Google bought YouTube for $1.65 billion last year. In its short time on the web, YouTube has grown quickly and received much attention. Online word-of-mouth has been primarily responsible for YouTube&#8217;s growth since its inception, and gave the site its first surge of publicity when it hosted the popular Saturday Night Live short Lazy Sunday.</p>\n\n<p>Lazy Sunday is a music video starring Saturday Night Live cast members Chris Parnell and Andy Samberg that aired on the December 17, 2005, episode of the show. It was the second SNL Digital Short to be aired.</p>\n\n<p>The film paired Parnell, an eight-year veteran of SNL who had performed rap several times during Weekend Update, and Samberg, a first-year featured player with little screen time. After the film aired, it was available for free download on iTunes. Additionally, it was posted to several Web sites and shared via e-mail. The film was viewed more than five million times at YouTube.</p>\n\n<p>Star in your own commercial\nYOU should be the star of your video so make sure you include yourself. People connect with people. They want to know who they&#8217;re buying from, and they&#8217;re more likely to buy if you engage them by being funny, smart, sexy, edgy or whateever.</p>\n\n<p>Make a video commercial\nOr several. You don&#8217;t even need a video camera; most digital still cameras allow you to make a 30 second- to two-minute video. More and more cell phones take video now, too. Webcams, obviously – the new Macs have an iSight camera built in. Quality doesn&#8217;t matter so much; humor, content, and clarity do.\nYou can get rid of stuff you no longer need or want and make some money in the process. Like your house or apartment. A motorcycle or car or bike. A guitar or drum set or recording equipment. Computer equipment. Hummel figurines. Vinyl. Your handbag collection. Designer jeans. Your pet anaconda. An extra microwave oven. Your velvet painting of Jesus that cries. Posters for Grateful Dead concerts. Extra tickets to a show. Your own business. Your services as a housekeeper, writer, editor, babysitter, chef, entertainer, CPA, wine-dinner-coordinator, petsitter, mural painter, and anything else you can think of. Except paid escort. No porn, and please try to limit profanity.</p>\n\n<p>Tell the viewer the following things to make your ad more effective:</p>\n\n<p>What you&#8217;re selling.\nWhy you&#8217;re selling it - have some fun with this.\nAny information that makes this item special (e.g. &#8220;the one item of clothing my cat has never thrown up on,&#8221; &#8220;George Clinton has touched this saxophone,&#8221; &#8220;I&#8217;ve changed the oil in this thing at least once every three months; maintenance records included,&#8221; &#8220;Free loaf of banana bread with purchase&#8221;</p>","image":{"available_sizes":[[[150,24],"assets/images/resized/0009/7697/97697v3-max-150x150.jpg"],[[250,40],"assets/images/resized/0009/7697/97697v3-max-250x250.jpg"],[[450,72],"assets/images/resized/0009/7697/97697v3-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[{"title":"creations","is_past":false,"provider":{"name":"floret","permalink":"floret","image":null}}],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[{"available_sizes":[[[150,112],"assets/images/resized/0009/7698/97698v1-max-150x150.jpg"],[[250,188],"assets/images/resized/0009/7698/97698v1-max-250x250.jpg"],[[450,338],"assets/images/resized/0009/7698/97698v1-max-450x450.jpg"]],"attribution":null}],"external_links":[]}