{"name":"Reflex Online","permalink":"reflex-online","crunchbase_url":"http://www.crunchbase.com/company/reflex-online","homepage_url":"http://www.reflex-online.com","blog_url":"http://reflexonlineschedulingsoftware.wordpress.com/","blog_feed_url":"http://reflexonlineschedulingsoftware.wordpress.com/feed/","twitter_username":"","category_code":"software","number_of_employees":10,"founded_year":2002,"founded_month":1,"founded_day":1,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"appointment-scheduler, online-scheduling-software, bookingsystem, scheduling-appointments, bookingsoftware, reservation-system, vacation-rental-software, online-agenda, reservation-software, online-scheduling, cloud-computing, saas-software","alias_list":null,"email_address":"info@reflex-online.com","phone_number":"0031 345630123","description":"Online scheduling software","created_at":"Thu Jul 19 10:29:29 UTC 2012","updated_at":"Wed Aug 22 09:52:44 UTC 2012","overview":"<p>Since 2002 Reflex Online has been gearing the development of online booking system and the organisation is made for opportunities presented by the internet. With the use of the online scheduling software customers can make appointments, register for events or book holiday homes, for example, all online. And the internet gives the users business ‘plug and play’ capability: no installation or maintenance, simply log in and get straight to work.</p>\n\n<p>Reflex Online is a business with international plans and an enterprising spirit. With a team of 9 employees who has been working together in the same line-up for years, and over those years Reflex has built up extensive experience in the ‘online booking arena’. The main focus is on the smart development of standard booking software.  because our software is widely applicable, easy to use and to maintain and because we use state of the art technology. To optimize marketing and sales Reflex is increasingly working in partnership with renowned companies across a variety of sectors.</p>\n\n<p>Challenges\nReflex Online is convinced that because of the internet and the Cloud based way of working the prices of software will fall even further in the coming years. Despite these constantly falling prices, customers will make ever greater demands of our functionality. Releases will follow each other more quickly. With one push of the button, all of customers are provided with the latest version.</p>\n\n<p>This approach is in line with developments in the market, and that is proved by the rapid growth we have enjoyed in recent years. </p>","image":{"available_sizes":[[[150,62],"assets/images/resized/0020/5427/205427v2-max-150x150.jpg"],[[250,104],"assets/images/resized/0020/5427/205427v2-max-250x250.jpg"],[[450,188],"assets/images/resized/0020/5427/205427v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}