{"name":"Reputation Advocate","permalink":"reputation-advocate","crunchbase_url":"http://www.crunchbase.com/company/reputation-advocate","homepage_url":"http://reputationadvocate.com/","blog_url":"http://stevenwyer.wordpress.com/","blog_feed_url":"http://stevenwyer.wordpress.com/feed/","twitter_username":"","category_code":null,"number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"","alias_list":"","email_address":"","phone_number":"1.888.229.0746","description":"service online reputation management","created_at":"Tue Aug 18 13:25:08 UTC 2009","updated_at":"Sun Mar 04 06:06:26 UTC 2012","overview":"<p>Nashville, Tennessee (PRESS RELEASE – February 3, 2010)  – Reputation Advocate (www.reputationadvocate.com) announces expanded efforts to service online reputation management and defense for businesses and individuals through its comprehensive Reputation Defense platform.</p>\n\n<p>Reputation Advocate has added a proactive reputation defense strategy to an arsenal of tools targeted towards the protection and defense of small businesses and business professionals. Reputation Defense will aid clients with critical, long-term needs for online reputation defense.</p>\n\n<p>Focusing on domain name and social media acquisition strategies, these services will meet the needs of professionals and businesses that wish to protect brand, trademark and identity intellectual properties. When coupled with monitoring online postings, slander and complaints, these tactics will add a powerful punch to Reputation Advocate’s current short and long term applications.</p>\n\n<p>Most large public companies retain creative agencies to build long-term global strategies to protect and defend clients, however many small business and individual professionals have fallen through the gap. Reputation Defense by Reputation Advocate has been designed to address the very real needs of small business in the US. For many businesses the first real thought regarding online damage to their business is only after the company is attacked by online slander. Reputation Advocate&#8217;s message is straightforward: An ounce of prevention may be worth a pound of cure.</p>\n\n<p>According to Reputation Advocate, when a typical company promotes its name or brand on the Internet this process is limited to the acquisition of a single domain name. Reputation Advocate recommends the acquisition of at least fifty URLs that cover the company name, brand, misspelled brand or company name and many negative terms that could be associated with a company. For those who need a more basic understanding, Reputation Advocate suggests simply searching the term &#8220;Dell Hell&#8221;.</p>\n\n<p>While some Reputation Advocate clients see limited need for this type of protection, most have been exposed in a painful way to the many shadow sides of the Internet. Most individuals do not think in devious and destructive ways and so they are shocked when first presented with this type of vulnerability. Steven Wyer, Managing Director of Reputation Advocate, says that a comprehensive solution for online slander can take several weeks, however the end result will give the typical small business or working professional a leg up when attempting to guard against violation by an onslaught of attacks.</p>\n\n<p>A dedicated team of experts at Reputation Advocate provides online reputation repair to individuals, professionals and companies who have been damaged by negative postings on the Internet. Reputation Advocate services include immediate and long cycle strategies that are individually structured to meet the unique needs of each situation. Reputation Advocate currently operates in North America with additional limited services provided in fifteen foreign countries. Reputation Advocate is an Accredited Business of the Better Business Bureau of Middle Tennessee and currently holds an A- rating.</p>\n\n<p>For further information on Reputation Defense, Search Engine Reputation Management (SERM) and SEO services, call 888-229-0746 or 888-229-0746 or contact Reputation Advocate at info@reputationadvocate.com. The company website can be found at reputationadvocate.com.</p>","image":{"available_sizes":[[[150,13],"assets/images/resized/0009/7946/97946v1-max-150x150.png"],[[250,23],"assets/images/resized/0009/7946/97946v1-max-250x250.png"],[[450,41],"assets/images/resized/0009/7946/97946v1-max-450x450.png"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"Managing Director","person":{"first_name":"Steven","last_name":"Wyer","permalink":"steven-wyer-steven-wyer","image":{"available_sizes":[[[103,150],"assets/images/resized/0005/6872/56872v2-max-150x150.jpg"],[[171,250],"assets/images/resized/0005/6872/56872v2-max-250x250.jpg"],[[220,320],"assets/images/resized/0005/6872/56872v2-max-450x450.jpg"]],"attribution":"<p>Steven Wyer</p>"}}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Corporate Offices","address1":"436 Main Street","address2":"Suite 200","zip_code":"37064","city":"Franklin","state_code":"TN","country_code":"USA","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[{"available_sizes":[[[150,104],"assets/images/resized/0009/7945/97945v1-max-150x150.jpg"],[[250,174],"assets/images/resized/0009/7945/97945v1-max-250x250.jpg"],[[450,313],"assets/images/resized/0009/7945/97945v1-max-450x450.jpg"]],"attribution":null}],"external_links":[]}