{"name":"Reputation Changer Complaints","permalink":"reputation-changer-complaints","crunchbase_url":"http://www.crunchbase.com/company/reputation-changer-complaints","homepage_url":"","blog_url":"","blog_feed_url":"","twitter_username":"","category_code":"other","number_of_employees":null,"founded_year":1980,"founded_month":8,"founded_day":16,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"","alias_list":null,"email_address":"","phone_number":"","description":"","created_at":"Fri Sep 07 09:55:32 UTC 2012","updated_at":"Sun Sep 09 19:43:39 UTC 2012","overview":"<p>To the team at Reputation Changer, complaints posted on the web are a major threat to most businesses and individuals. An online complaint or negative review has a much wider audience than ever before. In most cases, a business owner has no recourse or way to rebut the complaint, no matter how untrue it is. That&#8217;s what Reputation Changer is for. The online reputation management company has been helping companies and people suppress negative data online since 2010.</p>\n\n<p>Online reputation management is not a magic wand solution. Reputation Changer uses proven, effective methods to clear a client&#8217;s Google search results and to restore a client&#8217;s Google auto complete. Even after the initial, desirable results are achieved, Reputation Changer continues to work with clients to monitor their online presence and to make adjustments as needed. A clearing plan from Reputation Changer is ideal for individuals who have been attacked by a blogger or other media figure, or for people who have had a negative write up on one of the many review sites online. The clearing plan also works for people who share the same name as a person who has done bad things. </p>\n\n<p>Reputation Changer works with high profile clients, including doctors and lawyers. It has also helped maintain the reputation of political figures and famous athletes. But online reputation management isn&#8217;t just for people with famous names or careers. Anyone who runs a business or who needs to keep an online presence squeaky clean can benefit from the services offered by the company.</p>\n\n<p>As more people use the Internet for business and personal reasons, maintaining a strong and positive online reputation becomes more essential. For example, a potential employer can use social media sites and Google to perform off the cuff research on a possible hire. If that hire hasn&#8217;t taken care of her reputation, her chance of landing a job can be shot. In addition to suppressing complaints, Reputation Changer can also provide content for websites and blogs, and establish a social media presence for its clients. With Reputation Changer, clients can make a great first impression online, no matter who searches for them.</p>","image":{"available_sizes":[[[150,92],"assets/images/resized/0021/0247/210247v2-max-150x150.png"],[[250,153],"assets/images/resized/0021/0247/210247v2-max-250x250.png"],[[260,160],"assets/images/resized/0021/0247/210247v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}