{"name":"Restaurant Deals","permalink":"restaurant-deals","crunchbase_url":"http://www.crunchbase.com/company/restaurant-deals","homepage_url":"http://restaurantdeals.com.au","blog_url":"http://restaurantdeals.tumblr.com","blog_feed_url":"","twitter_username":"RestDealsOz","category_code":"web","number_of_employees":2,"founded_year":2011,"founded_month":3,"founded_day":9,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"daily-deals, restaurant-deals, scoopon, livingsocial, groupon","alias_list":null,"email_address":"admin@restaurantdeals.com.au","phone_number":"+61402471056","description":"Dining daily deals aggregator","created_at":"Fri Sep 16 07:03:24 UTC 2011","updated_at":"Sun Nov 13 23:07:13 UTC 2011","overview":"<p>What is Restaurant Deals?</p>\n\n<p>Restaurant Deals is a group buying and Daily Deals aggregator main focus in dinning deals. The entire process involves thorough search and collection of all we search and collect all existing and the latest deals found on various sources such as group buying sites and restaurant websites. All the information collected is then documented in an organized manner that will go well with daily deal hunters. Restaurant deals have ensured that they place deals that will attract and satisfy the involved parties. The information presented as earlier stated is always updated to make sure you never miss any excellent deals.</p>\n\n<p>Who do we track?\nWe collect restaurant deals from different available sources inluding restaurant and dining websites. We also track restaurant deals offered by Grouop Buying websites such as scoopon, livingsocial, Spreets, Groupon, Jumponit and many more. In addition, we consistantly add new Daily Deals websites which might not be very obvious to even the most addicted deal hunters. That’s where Restaurant Deals stands out. The best group buying sites will always be monitored by Restaurant Deals and we’re usually the first to update all the deals available!\nRestaurantDeals team does all the hard work for you so all you need to do is visiting the site or read our daily email to get up to date on the latest deals of the day.\nWe wanted restaurantdeals.com.au to be different and not just another daily deal aggregator. So we added great features to our listing page to allow users to filter the deals by price, cuisine, restaurant name and location.</p>\n\n<p>Who is RestaurantDeals?\nRestaurantDeals was created in Brisbane by a restaurant deals hunter. Rather than having to crawl through a dozen restaurant and group buying sites each day, he decided to create a platform that would bring them all together.</p>","image":null,"products":[],"relationships":[],"competitions":[{"competitor":{"name":"allthedeals.com.au","permalink":"allthedeals-com-au","image":null}},{"competitor":{"name":"buyii.com.au","permalink":"buyii-com-au","image":null}},{"competitor":{"name":"dealfetch.com.au","permalink":"dealfetch-com-au","image":null}}],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}