{"name":"ServiceTick","permalink":"servicetick","crunchbase_url":"http://www.crunchbase.com/company/servicetick","homepage_url":"http://www.servicetick.com","blog_url":"http://www.servicetick.com/Blog.aspx","blog_feed_url":"","twitter_username":"servicetick","category_code":"software","number_of_employees":18,"founded_year":2007,"founded_month":1,"founded_day":1,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"customer-experience-management, customer-feedback, ivr-surveys, web-surveys, email-surveys","alias_list":null,"email_address":"sales@servicetick.com","phone_number":"+44 1603 618326","description":"Customer Experience Management (CEM)","created_at":"Tue Aug 03 16:33:33 UTC 2010","updated_at":"Tue Aug 03 18:51:10 UTC 2010","overview":"<p>ServiceTick was set-up with a vision to develop innovative, value-generating solutions for clients seeking to maximise their investment in online and call centre channels.</p>\n\n<p>To achieve this, the company focuses on two main areas of activity:\nCustomer Feedback and Experience\nOnline Optimisation.</p>\n\n<p>Our ServiceTick product provides an advanced and sophisticated solution for gathering immediate, actionable insight from customers across web, email, SMS and call centre channels with all collected feedback reported instantly via a single web-based reporting console. </p>\n\n<p>Feedback can be segmented using a number of different reporting indexes to provide various ways of analysing the information gathered. A number of advanced reporting modules exist for performance benchmarking, cross-tabulation, measuring achievement using KPI monitors, identifying cherry picking amongst call centre agents and defining configurable business rules which trigger immediate ‘alerts’ when specific feedback is received. These can be used to pro-actively initiate customer recovery processes when negative feedback is received.</p>\n\n<p>Customer verbatim recorded via IVR can also be automatically translated into text using our market-leading voice-to-text conversion process. Once translated, text can be immediately checked for specific key words which are used as the basis for generating email alerts and taken into a detailed verbatim analysis report. </p>\n\n<p>Any complexity of customer survey can be quickly defined and set-up with the capability to define different types of question, survey logic and capture one or more customer verbatims within a survey. We also support question categorisation and random question selection.</p>\n\n<p>Our SessionCam product provides a cutting edge solution for recording and analysing the interaction and activity generated by a customer using a web site.</p>\n\n<p>SessionCam records all of the data exchanged between a web site and a visitor. This information is stored securely and can be replayed to show exactly what a visitor did during their web session. To complement the session playback capability, a number of reports are provided via a web-based interface to allow recorded sessions to be listed, organised by collections of pages or online processes, searched and analysed in significant detail.</p>\n\n<p>Reports are used to highlight any issues with online process conversion by showing drop-off within a process or collection of pages and within a page by reporting field-level analytics. </p>\n\n<p>Reports can also be generated to allow further understanding of the behavioural activity of site users. For example, customers that enter data in one or more input fields across one or more web pages could be identified for further investigation if that activity was considered to be outside of the normal, expected behaviour. </p>\n\n<p>The SessionCam Sales Optimisation module allows business rules to be defined to analyse the collected data and trigger further processes enabling an organisation to really optimise online sales activity for maximum value by creating a response across multiple channels. For example, customers that fail to complete a quotation process can be automatically identified, prioritised and their data seamlessly passed back into an outbound dial process within a cell centre.</p>\n\n<p>Lastly, SessionCam includes a Session Monitor module which uses an understanding of expected customer volumes to compare against current traffic levels. Thresholds of minimum and maximum activity can be configured to create a unique and effective tool for monitoring end-to-end performance and availability of a web site and its online processes. Email and SMS alerts are generated when actual activity tips any of the pre-defined thresholds limits.</p>\n\n<p>Both ServiceTick and SessionCam are offered as fully managed and supported solutions that can be set-up with minimal implementation effort. A small tag is required to integrate a client’s web site with ServiceTick and SessionCam whilst call centre integration can be achieved using simple call transfer. Alternative integration techniques are also available for both products to meet individual needs and requirements.</p>\n\n<p>As a business, we are delighted to be working with our current client list that includes Aviva, Standard Life, AIG, Hiscox, Swinton, Lloyds Banking Group, The RAC and Anglian Home Improvements.</p>","image":null,"products":[],"relationships":[{"is_past":false,"title":"Founder & Managing Director","person":{"first_name":"Kevin","last_name":"Goodings","permalink":"kevin-goodings","image":{"available_sizes":[[[134,150],"assets/images/resized/0017/3757/173757v2-max-150x150.jpg"],[[224,250],"assets/images/resized/0017/3757/173757v2-max-250x250.jpg"],[[404,450],"assets/images/resized/0017/3757/173757v2-max-450x450.jpg"]],"attribution":""}}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Global HQ","address1":"18-20 Thorpe Road","address2":"","zip_code":"NR1 1RY","city":"Norwich","state_code":null,"country_code":"GBR","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}