{"name":"Shevana Serviced Apartments","permalink":"shevana-serviced-apartments","crunchbase_url":"http://www.crunchbase.com/company/shevana-serviced-apartments","homepage_url":"http://shevana.com","blog_url":"http://shevana.com/publications/?list=news","blog_feed_url":"","twitter_username":"ShevanaDenmark","category_code":"web","number_of_employees":25,"founded_year":2011,"founded_month":9,"founded_day":1,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"serviced-apartments, serviced-accommodation, travel, holiday-rentals, holidays, rentals, accomodation, trip, apartments, villas, private, online","alias_list":null,"email_address":"info@shevana.com","phone_number":"+35928602425","description":"Serviced Apartments Globally","created_at":"Fri Nov 23 10:26:17 UTC 2012","updated_at":"Sun Nov 25 23:45:39 UTC 2012","overview":"<p>Shevana is the first service provider in Europe looking into sustainable accommodation solutions to improve the wellness of traveling professionals when working away from home.</p>\n\n<p>Shevana delivers real-time booking system and serviced apartments for B2B and B2C clients.</p>\n\n<p>Shevana of Denmark is the first service provider in Europe looking into sustainable accommodation solutions to improve the life quality and wellness of traveling professionals when working away from home. Serviced apartment home-feel living is a lifestyle choice that minimizes exposure to stress and yields enormous emotional rewards. The wellbeing of employees between home and host countries builds productivity and high performance at the project workplace. Being present in 85 primary and second-tier cities over 5 continents, Shevana supports multiple corporations in embracing innovative approaches to identify employees living needs with renewed focus and source apartment accommodation worldwide.</p>\n\n<p>In a recent survey 87% of HR specialists of international companies confirm that the comforts of apartment residence make employees feel happier, appreciated and less frustrated to change when working away from home. All survey respondents believe that provision of suitable accommodation to employees and their families during international assignments is essential for building performance and organizational health.</p>\n\n<p>Shevana continuously encourages companies to promote residential wellbeing as a sustainable corporate practice with the foresight to enhance the wellness of employees at the project workplace.</p>","image":null,"products":[],"relationships":[{"is_past":false,"title":"CEO","person":{"first_name":"Niels","last_name":"Nielsen","permalink":"niels-nielsen","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Main Office","address1":"Gunhilds Plads 2","address2":"","zip_code":"7100","city":"Vejle","state_code":null,"country_code":"DNK","latitude":null,"longitude":null},{"description":"Operations Office","address1":"4 Dim Hadjikocev B-fl.2 No:4","address2":"","zip_code":"1000","city":"Sofia","state_code":null,"country_code":"BGR","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[{"external_url":"http://shevana.com","title":"Shevana Serviced Apartments"}]}