{"name":"Skandiaweb","permalink":"skandiaweb","crunchbase_url":"http://www.crunchbase.com/company/skandiaweb","homepage_url":"http://www.skandiaweb.dk","blog_url":"","blog_feed_url":"","twitter_username":"","category_code":"web","number_of_employees":100,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"web","alias_list":null,"email_address":"","phone_number":"","description":"Websites for virksomheder","created_at":"Wed Jan 05 12:25:06 UTC 2011","updated_at":"Fri Jan 07 23:28:17 UTC 2011","overview":"<p>Helt tilbage i 1999 begyndte Skandiaweb at udvikle hjemmesider til erhvervslivet, og virksomheden er siden blevet en særdeles aktiv spiller på det professionelle hosting og CMS-marked. Skandiaweb har udviklet mere end 11.000 hjemmesider og hoster i dag over 15.000 domænenavne for kunder verden over. </p>\n\n<p>I foråret 2008 trådte en ny investor til, da Skandiaweb havde behov for øget know-how og kapital til at ekspandere virksomheden.  </p>\n\n<p>Det er lykkedes til fulde, og i dag har Skandiaweb kontorer i København, Århus og Malmø, og fra at starte op med 2 ansatte er der i dag over 70 medarbejdere.</p>\n\n<p>Nøgleordet har for Skandiaweb altid været udvikling, og virksomheden arbejder konstant på at optimere og videreudvikle sine kvalitetsprodukter. Netop dette fokus betyder, at Skandiaweb i dag kan producere webites på en meget effektiv facon, hvilket kommer kunderne til gode i form af meget konkurrencedygtige priser.</p>\n\n<p>Business hjemmeside</p>\n\n<p>Udover ProBasic-hjemmesiden tilbyer Skandiaweb også en lidt større\nløsning, som bl.a. omfatter flere undersider (50 mod 20), ekstra mail\nback-up og 2 helt nye funktionaliteter/services:</p>\n\n<p>Dialog-pakke\nMed simple værktøjer giver dialogpakken dig mulighed for at forbedre\ndin kommunikation med dine kunder via funktionaliteter som kampagner, nyhedsbreve, konkurrencer og udsendelse af spørgeskemaer.</p>\n\n<p>SEOmeter\nMed dette værktøj kan du selv øge hjemmesidens søgbarhed på Google\ni væsentlig grad - skridt for skridt får du hjælp til at optimere hjemmesidens enkelte sider og elementer på nem og overskuelig facon.</p>\n\n<p>Online Markedsføring (SEO)</p>\n\n<p>Søgemaskineoptimering (SEO) er et af de mest undervurderede områder i øjeblikket indenfor udvikling af websites. De fleste virksomheder fokuserer på at lave en flot og funktionel hjemme-side. Men det skaber ingen værdi for virksomheden, hvis hjemmesiden ikke kan findes via søgemaskinerne. </p>\n\n<p>Søgemaskineoptimering resulterer altså i flere besøgende - men også de rigtige besøgende. Optimerer man sit website op imod relevante søgeordskombinationer, øges muligheden for en god placering i søgemaskinerne. </p>","image":null,"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}