{"name":"SMS Poll","permalink":"sms-poll","crunchbase_url":"http://www.crunchbase.com/company/sms-poll","homepage_url":"http://www.smspoll.net","blog_url":"","blog_feed_url":"","twitter_username":"","category_code":"mobile","number_of_employees":4,"founded_year":2008,"founded_month":4,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"audience-response-systems, sms-voting, text-message-voting, audience-polling","alias_list":"","email_address":"ian@smspoll.net","phone_number":"+6180065016","description":"SMS voting application","created_at":"Sun Jul 13 06:39:48 UTC 2008","updated_at":"Sun Feb 06 20:08:53 UTC 2011","overview":"<p>SMS Poll is a text message voting application that allows its customers to quickly and easily gather in-moment data from students, fans, customers, conference attendees, employees, or any other type of live audience.</p>\n\n<p>SMS Poll works by allowing a poll organiser to use a simple web interface to quickly create, customise, and share his/her poll online. The audience votes by sending an SMS to a local phone number or by browsing to a mobile friendly webpage, and the results for the poll update in real-time, right before the audience’s eyes.  The poll organiser can then download all the results for the poll for further analysis. </p>\n\n<p>The SMS Poll service is currently available in Australia and the UK, with the company having launched its offering in early July, 2008.  A live demonstration of SMS Poll can be seen here: www.smspoll.net/demo</p>\n\n<p>SMS Poll has two features:</p>\n\n<ol>\n<li>Instead of using special hardware or clickers, audience members use their own mobile phones to vote on a poll.  </li>\n<li>Creating, customising and publishing a poll can be done 100% online in less than a few minutes without any assistance or additional software.</li>\n</ol>\n\n<p>With mobile penetration in Australia and the UK at virtually 100%, and hundreds of thousands of people unable to use traditional Audience Response Systems because they are both cost and time prohibitive, the SMS Poll market opportunity is quite substantial.  A few possible applications of the service include:</p>\n\n<p>• Teachers use SMS Poll to actively involve all students in the learning process, keeping them engaged, improving their knowledge retention, and assessing their understanding and retention of course material.</p>\n\n<p>• Promoters use SMS Poll to let the crowd select the song the band plays for its encore or the game’s Man of the Match.</p>\n\n<p>• Event Planners use SMS Poll to find out delegate opinions, encourage full attendee participation, and offer audience choice contests throughout the event.</p>\n\n<p>• Public Speakers use SMS Poll to grab the audience’s attention, tailor their presentations based on audience response, and encourage discussion and debate.</p>\n\n<p>• Market Researchers use SMS Poll to instantly gather data from a large group of people without ever having to fill-in or collate paper forms.</p>\n\n<p>• Not For Profits use SMS Poll to increase participation at charity events and silent auctions, and allow religious leaders to poll their congregation.</p>\n\n<p>• Corporations use SMS Poll to measure the effectiveness of training programs, gain open and honest feedback from anonymous responses, and gather instant feedback at product launches.</p>\n\n<p>The company&#8217;s sales focus is on educational institutions, teachers, event planners, keynote speakers, concert and sports promoters, and corporations – groups who work with large live audiences on a regular basis and for whom Audience Response Systems are desirable but impractical.</p>","image":{"available_sizes":[[[150,42],"assets/images/resized/0002/2029/22029v2-max-150x150.jpg"],[[250,70],"assets/images/resized/0002/2029/22029v2-max-250x250.jpg"],[[450,126],"assets/images/resized/0002/2029/22029v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"","person":{"first_name":"Anil","last_name":"Sabharwal","permalink":"anil-sabharwal","image":null}},{"is_past":false,"title":"Managing Director","person":{"first_name":"Ian","last_name":"McCallam","permalink":"ian-mccallam","image":null}}],"competitions":[{"competitor":{"name":"PollDaddy","permalink":"polldaddy","image":{"available_sizes":[[[150,53],"assets/images/resized/0000/2914/2914v1-max-150x150.png"],[[200,71],"assets/images/resized/0000/2914/2914v1-max-250x250.png"],[[200,71],"assets/images/resized/0000/2914/2914v1-max-450x450.png"]],"attribution":null}}},{"competitor":{"name":"Poll Everywhere","permalink":"poll-everywhere","image":{"available_sizes":[[[150,150],"assets/images/resized/0002/3802/23802v3-max-150x150.png"],[[250,250],"assets/images/resized/0002/3802/23802v3-max-250x250.png"],[[450,450],"assets/images/resized/0002/3802/23802v3-max-450x450.png"]],"attribution":null}}}],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"HQ","address1":"15 / 23 Angas Street","address2":"","zip_code":"2114","city":"Meadowbank NSW","state_code":null,"country_code":"AUS","latitude":-33.817773,"longitude":151.091193}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}