{"name":"Softengine","permalink":"softengine","crunchbase_url":"http://www.crunchbase.com/company/softengine","homepage_url":"http://www.softengineusa.com","blog_url":"","blog_feed_url":"","twitter_username":"softengineUsa","category_code":"consulting","number_of_employees":20,"founded_year":1996,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"sap-business-one, sap, sap-businessnow","alias_list":null,"email_address":"","phone_number":"","description":"","created_at":"Sat Apr 03 18:20:37 UTC 2010","updated_at":"Sat Apr 03 21:47:51 UTC 2010","overview":"<p>History</p>\n\n<p>Founded in 1996, Softengine is the recognized leader in providing collaborative business solutions to the wholesale distribution/importer and manufacturing industries.</p>\n\n<p>Nearly 20,000 mid-market wholesale distributors/importers and manufacturing companies trust their business process automation to the SAP Business One technology employed by Softengine.</p>\n\n<p>Objective</p>\n\n<p>To deliver truly flexible business solutions that improve operational efficiencies and drive competitive advantage. We accomplish this by offering you advanced technology tools that help you make better more profitable decisions</p>\n\n<p>Profile</p>\n\n<p>Softengine is a leader in truly flexible ERP (Enterprise Resource Planning) and CRM (Customer Relationship Management) business solutions. Through the company&#8217;s innovative and targeted solutions we help you win customer loyalty and control costs by helping you gain greater control of your operations. By focusing on select vertical markets, we deliver deep domain expertise to the industries that we serve.</p>\n\n<p>Services</p>\n\n<p>The services we offer are specifically focused on the needs of the wholesale distribution/importers and manufacturing industries. The average Softengine consultant has over 10 years of experience in the industry that he or she serves. We offer a deep base of best practice knowledge gained by implementing hundreds of enterprise solutions worldwide. Our consultants know your industry, understand your challenges, and have first-hand experience with solving them. In addition, we offer the services of some of the country’s most experienced SAP Business One consultants.</p>\n\n<p>Customers</p>\n\n<p>At Softengine we have an ongoing commitment to our customers success. We understand the critical role that our solutions play in the success of our customers business. We thrive on solving even the toughest business challenges with solutions that benefit our customers in ways that our competitors cannot.</p>","image":{"available_sizes":[[[150,47],"assets/images/resized/0008/2823/82823v1-max-150x150.jpg"],[[239,75],"assets/images/resized/0008/2823/82823v1-max-250x250.jpg"],[[239,75],"assets/images/resized/0008/2823/82823v1-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}