{"name":"Sportronix","permalink":"sportronix","crunchbase_url":"http://www.crunchbase.com/company/sportronix","homepage_url":"http://www.sportronix.com","blog_url":"","blog_feed_url":"","twitter_username":"","category_code":"games_video","number_of_employees":3,"founded_year":2009,"founded_month":12,"founded_day":9,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"sport, sports, motor, motorsports, racing, baseball, basketball, futbol, football, soccer, cricket, nascar, irl, f1, mlb, nba, nfl, fifa, fia, intelligent, artificial, intelligence, analytics, stats","alias_list":null,"email_address":"dave@sportronix.com","phone_number":"","description":"Intelligent Sports Technology","created_at":"Sat Aug 21 20:41:18 UTC 2010","updated_at":"Tue Jan 18 07:59:08 UTC 2011","overview":"<p>Sportronix uses next gen applied A.I. techniques to build intelligent decision systems for team performance and/or entertainment applications in the sporting world. An Atlanta based company targeting sports organizations interested in solving information overload in time sensitive environments. Interested areas of discovery are intelligent bandwidth control of sports informatics at venues, to intelligent decision analytics aiding humans in real-time, to entertainment applications that connect spectators, via mobile device, to live events though games-inside-games. Sports organizations use our software to deliver the automation needed to handle real-time (on-demand) environments. Our systems come from defense research labs and are exclusively contracted from from the inventing science team. We use expert domain knowledge, a direct representation of the decision makers preferences and knowledge, and an accruate description of the decision&#8217;s circumstances. Our systems out perform yesterdays expert systems by understanding human intention for maximum relevance. Sportronix is the worlds leader in artificial intelligence for sports. Sportronix is advised by a board of global science and sports technology leaders.  </p>","image":{"available_sizes":[[[125,41],"assets/images/resized/0009/8822/98822v2-max-150x150.jpg"],[[125,41],"assets/images/resized/0009/8822/98822v2-max-250x250.jpg"],[[125,41],"assets/images/resized/0009/8822/98822v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}