{"name":"taxi.com","permalink":"taxi-com","crunchbase_url":"http://www.crunchbase.com/company/taxi-com","homepage_url":null,"blog_url":null,"blog_feed_url":null,"twitter_username":null,"category_code":null,"number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"","alias_list":null,"email_address":null,"phone_number":null,"description":null,"created_at":"Sun Dec 20 05:26:54 UTC 2009","updated_at":"Fri Jun 17 14:37:28 UTC 2011","overview":"<p>TAXI is an Independent A&amp;R (Artist and Repertoire) company, founded in 1992. It helps independent songwriters, artists and composers get their music on the desks of key executives at major and independent record labels, music publishers, film and TV music supervisors, video game companies, and advertising agencies who need music.</p>\n\n<p>Companies contact TAXI directly to run &#8220;listings,&#8221; which are specific requests for music. TAXI publishes those requests to its member base in more than 100 countries around the globe. When TAXI members see a listing or listings they would like to pitch to, they pitch it to TAXI.</p>\n\n<p>TAXI has a team of highly credentialed industry experts in all genres of music who listen to the music submitted for each listing, and &#8220;forward&#8221; the very best to the person/company that requested the material. Thousands of TAXI members have signed deals over the last two decades.</p>\n\n<p>TAXI hosts a free music convention called the TAXI Road Rally during the first weekend of November every year. There are listening panels, one-to-one mentoring sessions, and classes in all aspects of the music industry.</p>\n\n<p>TAXI provides its members with critiques of their work so they can learn what is working, what is not, and how they can fix the problems they may have.</p>","image":null,"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}