{"name":"Topadmit","permalink":"topadmit","crunchbase_url":"http://www.crunchbase.com/company/topadmit","homepage_url":"http://www.topadmit.com/","blog_url":"http://topadmit.blogspot.com/","blog_feed_url":"","twitter_username":"topadmit","category_code":"other","number_of_employees":30,"founded_year":2009,"founded_month":8,"founded_day":1,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"essay, editing, mba, personal-statement, statement-of-purpose, college-application","alias_list":null,"email_address":"service@topadmit.com","phone_number":"","description":"Leading online essay editing company.","created_at":"Fri Jul 01 06:24:31 UTC 2011","updated_at":"Sat Jul 02 03:59:06 UTC 2011","overview":"<p>Found in 2005 by Stanford alumni, in the state of California, Top Admit.com is an American-based company with an international perspective that has become one of the premiere online college admissions and essay editing consultancy companies in the world. We have since assisted tens of thousands of students from Asia, Europe, and North America gain admissions to the schools of their choices.</p>\n\n<p>It is our mission to help applicants by providing professional English-language services including the editing and proofreading of essays, resumes, recommendation letters and other application documents. We have helped applicants gain admission to undergraduate schools, graduate schools (engineering, MBA), professional schools (law, medical), and Ph.D. programs. Our highest priority is to ensure that all of our clients are satisfied with our services. Equally important is that our client information and identity is kept strictly confidential. Lists of our former clients are never given to other marketing firms, or admissions officers of any college.</p>\n\n<p>Topadmit.com has a assembled an elite team of editors who are native-English speaking graduates of such prestigious schools as Harvard University, Stanford University, Yale University, Brown University, the University of Chicago, and Dartmouth College. Our editors have degrees in such varied fields as humanities, arts, music, business, science and technology, law, education, English and political science. Each of our consultants has over six years experience in the composition and editing of application essays, and several have served as admissions officers and scholarship judges at Ivy League schools. Our editors’ performance is reviewed regularly, and rated based on client feedback and our own internal assessment standards.</p>","image":{"available_sizes":[[[150,91],"assets/images/resized/0014/2176/142176v2-max-150x150.jpg"],[[171,104],"assets/images/resized/0014/2176/142176v2-max-250x250.jpg"],[[171,104],"assets/images/resized/0014/2176/142176v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$100k","funding_rounds":[{"round_code":"seed","source_url":"","source_description":"","raised_amount":100000,"raised_currency_code":"USD","funded_year":1000,"funded_month":1,"funded_day":1,"investments":[]}],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}