{"name":"University of Cambridge CIE","permalink":"university-of-cambridge-cie","crunchbase_url":"http://www.crunchbase.com/company/university-of-cambridge-cie","homepage_url":"http://www.cie.org.uk","blog_url":"","blog_feed_url":"","twitter_username":"","category_code":"other","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"","alias_list":null,"email_address":"","phone_number":"","description":"International Education","created_at":"Thu Oct 14 11:44:40 UTC 2010","updated_at":"Thu Oct 14 20:18:22 UTC 2010","overview":"<p>University of Cambridge International Examinations (CIE) is the world’s largest provider of international qualifications for 14–19 year olds. We are part of the University of Cambridge and a not-for-profit organisation.</p>\n\n<p>CIE is committed to its mission of extending access to the benefits of high-quality education around the globe. Our curricula and qualifications are designed to support high-quality educational performance, developing successful students and supporting the economic performance of countries where CIE works at national level.</p>\n\n<p>CIE has worked in partnership with ministries of education, qualifications authorities and examination and assessment boards around the world for over 150 years. In some countries such as Singapore Cambridge examinations are the state qualification for students in secondary school. Tens of thousands of students take Cambridge O Levels every year.</p>\n\n<p>In other parts of the world such as Botswana, Namibia and Swaziland, CIE has worked with governments to reform education systems, and helped to localise examinations by training officials, teachers, markers and examiners in curriculum development and assessment.</p>","image":null,"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}