{"name":"Vaibmu","permalink":"vaibmu","crunchbase_url":"http://www.crunchbase.com/company/vaibmu","homepage_url":"http://www.vaibmu.com","blog_url":"http://www.vaibmu.com/blog","blog_feed_url":"","twitter_username":"","category_code":"consulting","number_of_employees":2,"founded_year":2009,"founded_month":12,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"media, classifieds, internationalization, consulting, training","alias_list":null,"email_address":"info@vaibmu.com","phone_number":"+358408246841","description":"Consulting & Portfolio Development","created_at":"Sat Jan 30 16:19:45 UTC 2010","updated_at":"Tue Mar 16 21:01:21 UTC 2010","overview":"<p>Vaibmu is a strategic consulting &amp; portfolio development company. Our main business areas are consulting &amp; internationalization projects and internet services portfolio development.</p>\n\n<p>Our main expertise areas are media and internet (classifieds, advertising, directories, e-commerce) and our customers are mainly mid-sized and large media companies as well as directories, classified publishers and industrial investors.</p>\n\n<p>Our core markets are Scandinavia, Russia &amp; CIS, CEE and Southern Europe. Vaibmu’s client base is located worldwide, namely in Europe (EU), North America, Russia and the Middle East.</p>\n\n<p>We develop internet projects via joint-ventures and minority shareholding. Vaibmu’s portfolio consists of fully or partly owned assets in the above mentioned regions. Our company is headquartered in Helsinki, Finland.</p>\n\n<p>The word vaibmu means heart in the Northern Sami language.</p>\n\n<p>Consulting | Contact Vaibmu for strategic consulting in digital media projects. We cooperate with management teams worldwide bringing analytical frameworks, strategic options, winning concepts and financial planning to the table. We work on a project basis helping our customers develop and enforce strategic paths for their companies, especially in digital revenue development as well as organizational solutions to reach the new strategic goals, including sales, marketing and product development organizational design and monitoring metrics.</p>\n\n<p>Internationalization | Contact Vaibmu if you’re a media or digital player planning to enter Scandinavia, Russia &amp; CIS, CEE and Southern European markets. We provide specialized reports and insights into the competitive landscape, the fundamentals of the marketplace, the existing value propositions, the opportunities and threats in the market, and an overview of the strengths and weaknesses of existing players. Our insightful and tailored analysis is made possible via our extensive network of industry analysts on location, which makes tailoring information to each customer’s intelligence requests a reality.</p>\n\n<p>Portfolio Development | We collaborate with investors and participate investments in internet start-ups, mainly in classifieds (C2C, B2C &amp; B2B). We conduct M&amp;A prospection, due diligence and portfolio development in our core markets on behalf of institutional or industrial investors, with whom we cooperate in various models (projects, joint-ventures, minority shareholding).</p>","image":{"available_sizes":[[[150,59],"assets/images/resized/0007/5672/75672v3-max-150x150.jpg"],[[250,98],"assets/images/resized/0007/5672/75672v3-max-250x250.jpg"],[[450,177],"assets/images/resized/0007/5672/75672v3-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"Managing Partner","person":{"first_name":"Eero","last_name":"Korhonen","permalink":"eero-korhonen","image":null}},{"is_past":false,"title":"Founding Partner","person":{"first_name":"Clara","last_name":"Llamas","permalink":"clara-llamas-2","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Headquarters","address1":"Joupinkuja, 4 A5","address2":"","zip_code":"02760","city":"Espoo","state_code":null,"country_code":"FIN","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}