{"name":"VEEB DESIGN","permalink":"veeb-design","crunchbase_url":"http://www.crunchbase.com/company/veeb-design","homepage_url":"http://www.veebdesign.com","blog_url":"http://www.veebdesign.com/Newslist.html","blog_feed_url":"","twitter_username":"","category_code":"consulting","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"service, design, le-design-des-services, formation-linnovation, services-design, services, simulation-de-services, test-de-services, redesign-du-service","alias_list":null,"email_address":"vb@veebdesign.com","phone_number":"04 26 68 50 04","description":"Consultant design de service","created_at":"Mon Mar 28 10:16:08 UTC 2011","updated_at":"Fri Apr 08 23:53:21 UTC 2011","overview":"<p>VEEB (prononcez &#8220;VIB&#8221;): Nous sommes consultants en design de services et stratégie d&#8217;innovation. Nous concentrons notre expertise sur le design de services en suivant cette logique: 60 à 70% du PIB français est représenté par les services, par opposition à la fabrication et la transformation de produits. A cette fin, nous fournissons une pensée intégrative et des solutions applicables pour les entreprises qui souhaitent augmenter ou diversifier leurs revenus.</p>\n\n<p>Notre spécialité consiste à aider les entreprises à identifier, construire et lancer de nouvelles sources de revenus.\nEn outre, nous aidons nos clients à affiner et améliorer les expériences de services existant pour leurs clients et leurs personnel.</p>\n\n<p>Nous combinons des équipes multidiciplinaires uniques: designers, marketeurs, gestionnaires, chercheurs et entrepreneurs apportant une approche expérimentée, pragmatique et rigoureuse pour le développement de nouvelles propositions de services et de valeur.</p>\n\n<p>Nous travaillons pour comprendre comment les composantes tangibles et intangibles d&#8217;une entreprise (services, produits, marque, personnes, environnements&#8230;) fonctionnent ensemble pour donner forme à l&#8217;expérience du client, et inversement, comment la perception du client affecte la rentabilité.</p>\n\n<p>Nous aidons les entreprises et organismes à améliorer la qualité et l&#8217;expérience de leurs services, formuler des stratégies d&#8217;innovation, réduire l&#8217;incertitude, identifier de nouvelles opportunités et créer des cadres opérationnels pour leur mise en oeuvre.</p>\n\n<p>VEEB s&#8217;engage dans des programmes d&#8217;innovation et tire partie des technologies sociales, du design d&#8217;expérience, de la recherche ethnographique et du prototypage rapide, pour découvrir de nouvelles façons de générer des revenus et créer des concepts de services et d&#8217;expériences porteurs d&#8217;émotions et de forte valeur économique.</p>\n\n<p>Nous fournissons le conseil, l&#8217;expertise et le support nécessaire pour concevoir et lancer votre nouvelle offre de service et commencer à générer de nouvelles sources de revenus.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0012/9439/129439v2-max-150x150.jpg"],[[178,178],"assets/images/resized/0012/9439/129439v2-max-250x250.jpg"],[[178,178],"assets/images/resized/0012/9439/129439v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}