{"name":"Ventown","permalink":"ventown","crunchbase_url":"http://www.crunchbase.com/company/ventown","homepage_url":"http://www.Ventown.com","blog_url":"http://Facebook.com/Ventown","blog_feed_url":"","twitter_username":"Ventown","category_code":null,"number_of_employees":null,"founded_year":2010,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"local, social-networking, geofencing, small-businesses, medium-businesses, local-businesses, community, neighborhood","alias_list":null,"email_address":"info@ventown.com","phone_number":"","description":"","created_at":"Sat Jun 30 21:19:48 UTC 2012","updated_at":"Wed Oct 17 02:56:47 UTC 2012","overview":"<p>Ventown connects you to the communities you care about most. Our mission is to combine the power of social networking with unique community-building tools to fuel collaboration where you live, work, and play. </p>\n\n<p>Ventown makes it easy for anyone to organize a community or find one to join. \nEach and every person, interest group, school, business, police and fire department, and local agency that wants a sense of community is encouraged to use our online community platform. Ventown allows you to develop strong connections with members that impact your community and its economy, and these connections are consistent across virtually every community in the United States. </p>\n\n<p>There are six different types of Ventown communities – groups, neighborhoods, local areas, town services, shopping, and school and college campuses – and you can join as many as you like.  Each community is built using our simple mapping tools that provide customized content, including personal reviews, recommendations, alerts and messages, local news, social happenings, school activities, sports events, and great shopping and dining experiences, based on the locations you choose. No spam or trolls &#8211; the digital or living kind &#8211; here!</p>\n\n<p>Ventown makes it easy for you to create a personalized homepage for quick and easy access to everything you want to know about your area. We aggregate your information, deliver it to you, and enable you to share your own perspectives for all the communities you join. You can contribute as much as you like, or just follow along with the latest community information. You’ll get everything you need to know, at a glance, in one place.</p>\n\n<p>Ventown for Business\nDid you know that 85% of local purchases occur within 15 miles of where customers live and work? While many online community websites focus on &#8220;national&#8221; local, we are actually local &#8211; making it easy for our businesses to be the “big fish” in their pond. With Ventown, you get access to a complete self-service, location-based marketing platform that’s specifically for local businesses with smaller budgets. Our suite of perks includes easy-to-use tools to create and build strong community ties, real-time sales updates, special offers, event marketing, customer engagement, and business reputation management. With Ventown, area businesses like yours have an easy and effective way to reach local communities and the members who help them thrive. Visit Ventown For Small Businesses to learn more.</p>","image":{"available_sizes":[[[150,57],"assets/images/resized/0019/8177/198177v6-max-150x150.jpg"],[[250,95],"assets/images/resized/0019/8177/198177v6-max-250x250.jpg"],[[450,172],"assets/images/resized/0019/8177/198177v6-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"CEO","person":{"first_name":"Jay","last_name":"Rosenbluth","permalink":"jay-rosenbluth","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Ventown HQ","address1":"","address2":"","zip_code":"","city":"New York","state_code":"NY","country_code":"USA","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[{"embed_code":"<iframe width=\"420\" height=\"236\" src=\"http://www.youtube.com/embed/CZPe48rRWZQ\" frameborder=\"0\" allowfullscreen></iframe>","description":"<p>Ventown</p>"}],"screenshots":[],"external_links":[]}