{"name":"Veribo","permalink":"veribo","crunchbase_url":"http://www.crunchbase.com/company/veribo","homepage_url":"http://www.veribo.com/","blog_url":"http://www.veribo.com/blog/","blog_feed_url":"","twitter_username":"veribo_com","category_code":"search","number_of_employees":null,"founded_year":2007,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"online-reputation-management, online-visibility, corporate-reputation-management, reputation-protection, reputation-management-services","alias_list":null,"email_address":"sales@veribo.com","phone_number":"+44(0)20-8123-3262","description":"Online Reputation Management","created_at":"Wed Jan 25 15:54:34 UTC 2012","updated_at":"Thu Jan 26 22:31:10 UTC 2012","overview":"<p>Veribo, established in 2007 by the former European CEO of shopping.com, Ehud Furman, provides internet reputation management services to large and small businesses throughout the world. From offices in London and Tel Aviv, it uses its own proprietary technology  and IP to provide online reputation repair to 100,000 customers that reach across 20 countries. Through specially developed techniques, they identify negative press or posts regarding Veribo clients and take active steps to create a more positive online image. In the same way, they find positive reports regarding the client or brand and distribute them in multiple online sites for increased visibility. Experience shows that a reliable and trustworthy online image translates into more business opportunities, a greater number of business contacts and increases the chances for corporate or individual success. </p>\n\n<p>Increased Benefits Through Reputation Management</p>\n\n<p>Reputation management is accomplished by Veribo in two essential stages. The first stage is to proactively protect its clients from negative content that may be linked to their names. This involves careful monitoring to keep the company&#8217;s name or brand connected with a strong and positive image. The second stage, which can be performed in conjunction with stage one, is to promote client visibility through increased digital assets such as a properly optimized website, involvement in social media or well placed articles. Through years of experience in the field of reputation management, Veribo has developed methods that are successful in protecting and promoting a business&#8217;s interests that result in positive search results and share these tools with its partners across the globe.</p>\n\n<p>Managing the Image of Individuals</p>\n\n<p>While the majority of Veribo&#8217;s clients come from the business world, the list also includes high profile politicians, entertainers and entrepreneurs as well as those professionals working in the fields of finance and law. Following an initial overview of the person’s online status, the Veribo reputation management consultants create a tailor-made program to closely follow all Internet activity related to each individual client and take appropriate steps where necessary. Through these careful steps, a person&#8217;s positive image can be restored and maintained.</p>","image":{"available_sizes":[[[150,48],"assets/images/resized/0017/1646/171646v2-max-150x150.png"],[[250,80],"assets/images/resized/0017/1646/171646v2-max-250x250.png"],[[345,111],"assets/images/resized/0017/1646/171646v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[{"external_url":"http://www.veribo.net/","title":"Veribo's Lookuppage"},{"external_url":"https://www.facebook.com/Veribo.Reputation","title":"Veribo Facebook Page"},{"external_url":"https://twitter.com/Veribo_com","title":"Veribo Twitter Page"},{"external_url":"https://plus.google.com/114969279374879154797/","title":"Veribo Google Plus"}]}