{"name":"VitaSensis","permalink":"vitasensis","crunchbase_url":"http://www.crunchbase.com/company/vitasensis","homepage_url":"http://www.vitasensis.com","blog_url":"","blog_feed_url":"","twitter_username":"","category_code":"software","number_of_employees":2,"founded_year":2012,"founded_month":5,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"healthcare, lifestyle, senior-citizens","alias_list":null,"email_address":"info@vitasensis.com","phone_number":"","description":"Smart technologies for a better living","created_at":"Sun Jul 15 18:32:37 UTC 2012","updated_at":"Tue Oct 02 05:29:23 UTC 2012","overview":"<p>VitaSensis developed a movement sensor device (TAG), the end user carries. It can sense general movement and special motions like steps, and most important a fall. It&#8217;s technological simple, small form factor, long battery life (1+ month) and low cost (expected to retail at 10€). A lot of care went into the design to make the device look like a fashion accessory and not like a &#8220;device&#8221;.</p>\n\n<p>The target audience is senior people (&gt;65) that live alone, and have offspring. </p>\n\n<p>The main use is: If a person falls or press a &#8220;panic&#8221; button, an alarm gets issued and help will come. Also, if some of the offspring wants to get hold of the user (typically by phone) and can&#8217;t for some reason, the system provides a way for them to know the user is ok, while respecting the end user privacy. The system does not provide location or activity description, just quantity of movement description, and complementary information  like number of steps taken five minutes ago.</p>\n\n<p>The system also knows the relative position inside a home, and can distinguish from staying quiet in the bathroom for an hour or staying quiet in the living room. </p>\n\n<p>The device communicates with any android phone, so it&#8217;s portable and continues to work outside the home if the user takes the phone with him/her. There are also some nice features for the phone, like friendly user interface, photo dial, auto-answer in case of emergency, loud speaker, microphone and cameras activation, etc.</p>\n\n<p>VitaSensis is presently only targeting the senior people market, but the tag, without any hardware modification, can be useful in a variety of other markets, like pet tracking/fencing, object tracking/fencing, kids security, tracking objects inside buildings, like shopping carts route mapping, etc</p>\n\n<p>The company is looking for investors in Europe Northern region, Finland, Sweden and Norway. </p>\n\n<p>VitaSensis origins are in Oporto University, Portugal, and are already doing business in Portugal with third party, featureless, devices, but functional.</p>\n\n<p>The vitaSensis Tag device is expected to be ready for real market testing around November 2012.</p>","image":null,"products":[],"relationships":[{"is_past":false,"title":"","person":{"first_name":"Miguel","last_name":"Andrade","permalink":"miguel-andrade","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[{"round_code":"seed","source_url":"http://www.a2b.pt/portfolio.php","source_description":"","raised_amount":null,"raised_currency_code":"USD","funded_year":2012,"funded_month":5,"funded_day":1,"investments":[]}],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Main office","address1":"R. Actor Fereira da Silva N 100 ","address2":"","zip_code":"4200-298","city":"Porto","state_code":null,"country_code":"PRT","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[{"embed_code":"http://www.youtube.com/watch?v=ucHsgkbK3_c","description":"<p>VitaSensis 3min pitch and Q&amp;A</p>"}],"screenshots":[],"external_links":[]}