{"name":"Webgirisimleri.com","permalink":"webgirisimleri-com","crunchbase_url":"http://www.crunchbase.com/company/webgirisimleri-com","homepage_url":"http://www.webgirisimleri.com","blog_url":"","blog_feed_url":"","twitter_username":"webgirisimleri","category_code":"other","number_of_employees":null,"founded_year":2010,"founded_month":5,"founded_day":1,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"webgirisimleri, haberler, basn-bltenleri, ilanlar","alias_list":null,"email_address":"hsnguclu@webgirisimleri.com","phone_number":"","description":"Website Pr and News","created_at":"Thu Oct 11 11:17:18 UTC 2012","updated_at":"Mon Oct 22 19:12:25 UTC 2012","overview":"<p>Webgirisimleri.Com İnternette faaliyet gösteren firmaların haber ve basın bültenlerinin, ürün ve hizmetlerinin, kampanyalarının, ilanlarının, iletişim bilgilerinin, misyon, vizyon ve değerlerinin ve şirket profilleri hakkında her şeyin tanıtımını ve dağıtımını yapan Türkiye’nin ilk Web Siteleri rehberidir.</p>\n\n<p>Webgirisimleri.Com’a Üye olarak faydalanacağınız servisler…</p>\n\n<p>Firma Sayfası oluşturma:\nFirma profilinizi oluşturarak firma bilgilerinizi,firma yetkilinizi, kuruluş yılınızı, çalışan sayınızı, adresinizi,telefon ve faks numaralarınızı, facebook ve twitter hesaplarınızı duyurabilir, hızlı iletişim formu ile müşterileriz ile daha kolay iletişim kurabilirsiniz.</p>\n\n<p>Haber ve Basın Bülteni Ekleme:\nHaber ve Basın Bülteni ekleyerek Haberlerinin görünürlüğünü arttırabilir, haber ajanslarına, basın mensuplarına, blog yazarlarına, sosyal medyaya ve iş dünyasına haberlerinizi duyurabilir, bu sayede arama motorlarında üst sıralarda çıkmak için önemli bir adım atmış olursunuz.</p>\n\n<p>Ürün ve Hizmet Ekleme:\nÜrün ve Hizmetlerinizi ekleyerek müşterilerinizi arttırabilir, kampanyalarınızı ilgi çekici, yeni ya da indirimli  ürün ve hizmetlerinizi duyurabilir, kazançlarınızı verimli bir şekilde yükseltebilirsiniz.</p>\n\n<p>Firma Detayı Ekleme:\nFirmanıza ait kilometre taşlarından bahsedebilir, zengin bir hakkımızda bölümü oluşturabilir firmanızın misyon,vizyon ve değerlerini açıklayabilirsiniz.</p>\n\n<p>İlan Ekleme:\nİlan ekleyerek Alım-Satım İlanlarınızı, Etkinlik İlanlarınızı, İnsan Kaynakları İlanlarınızı ve İşbirliği İlanlarınızı ücretsiz ve kolay bir şekilde duyurabilirsiniz.</p>\n\n<p>Logo ve Görsel Ekleme:\nLogo ve Görsel ekleyerek sitenizin farklı boyutlardaki logolarını, basın kitlerini ve firmanıza ait diğer görselleri de paylaşabilirsiniz.</p>\n\n<p>Harita Üzerinde Adres Ekleme:\nGoogle Maps sayesinde harita üzerinden adresinizi ekleyebilir, size ulaşmak isteyen ziyaretçi ve müşterilerinizin adresinize ulaşmasını kolaylaştırabilirsiniz.</p>\n\n<p>Video Ekleme:\nVideo ekleyerek tanıtım filmlerinizi, online reklamlarınızı ekleyebilir, izlenme sayısını artırabilir, ciddi geri dönüşler kazanabilirsiniz.</p>\n\n<p>Sitemize eklediğiniz tüm içerik tarafımızdan kontrol edilerek tüm medya kuruluşlarına günlük bültenler ile mail olarak gönderilirken aynı zamanda da ziyaretçilerimize gösterilir, bu sayede online görünürlüğünüz artırılmış olur. internet üzerinden haberlerinizi yaydığınızda hem web siteniz hem de markanız daha çok ilgi toplayacaktır. Başarılar dileriz.</p>","image":{"available_sizes":[[[150,104],"assets/images/resized/0021/5164/215164v2-max-150x150.png"],[[250,174],"assets/images/resized/0021/5164/215164v2-max-250x250.png"],[[280,195],"assets/images/resized/0021/5164/215164v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[{"available_sizes":[[[150,121],"assets/images/resized/0021/5163/215163v2-max-150x150.jpg"],[[250,202],"assets/images/resized/0021/5163/215163v2-max-250x250.jpg"],[[450,364],"assets/images/resized/0021/5163/215163v2-max-450x450.jpg"]],"attribution":null}],"external_links":[]}