{"name":"Wine Club Reviews","permalink":"wine-club-reviews","crunchbase_url":"http://www.crunchbase.com/company/wine-club-reviews","homepage_url":"http://www.wineclubreviews.net","blog_url":"","blog_feed_url":"","twitter_username":"wineclubreviews","category_code":"advertising","number_of_employees":1,"founded_year":2009,"founded_month":2,"founded_day":21,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"wine-club-continuity-affiliate-ecommerce-advertising-winery","alias_list":null,"email_address":"jessyca@wineclubreviews.net","phone_number":"3104793632","description":"wine club reviews","created_at":"Fri Jan 06 16:44:20 UTC 2012","updated_at":"Sun Jan 15 01:58:35 UTC 2012","overview":"<p>We take the legwork out of buying a wine club for oneself or as a gift. Fresh editorial reviews of the experience and the wine that is delivered from each club gives consumers an easy way to find a wine club.</p>\n\n<p>Entering into 2012 we&#8217;ve sold nearly $2M in wine clubs through our aggressive but principled advertising techniques and by consistently providing quality, relevant content.</p>\n\n<p>Our wine club reviews consist of several steps to ensure the wine clubs we have on the site are well-vetted. These wine club review steps include:</p>\n\n<p>Check Out the Wines: We review the wines each wine club has sent in the past (as shown on their own website or, if needed, as requested via email). We verify awards and points, as well as size of production, and we evaluate Quality-to-Price Ratio (QPR). Whenever possible we receive shipments from the wine clubs to keep a trained eye on the quality, too.</p>\n\n<p>Scout the Deals: We look to see what kinds of discounts and perks the wine clubs offer their members. Some wine clubs have introductory offers or provide free-shipping so we want to know about that, too.</p>\n\n<p>Check for Customization: Many wine clubs offer great flexibility in the selection of wine color, frequency of shipping, and payment methods. We use this bend-over-backwards information to help us rate wine clubs.</p>\n\n<p>Read the Fine Print: We check all marketing copy, customer service information, FAQ pages, and return policies. When we find holes in the information, we contact the wine clubs to make sure we know what they will do for their customers and what they won’t.</p>\n\n<p>About our Ratings System\nWe used to rate all wine clubs based on how much value they provide. What we discovered is that many of the premium wine clubs aren’t about primarily about value (and we don’t think they need to be) and that our readers were missing opportunities to find those premium wine clubs. So&#8230; we created a new two-tiered ratings system!</p>\n\n<p>Value wine clubs are rated on these criteria:</p>\n\n<p>Quality-to-Price Ratio of the wines they’re offering\nHow the wines are selected. Are any consumers involved in the wine selection process?\nCustomization of wine color, billing frequency, and shipping frequency\nReorder discounts\nIntroductory offer\nShipping &amp; handling costs\nAre there any other extras?\nCustomer service policies</p>\n\n<p>Premium wine clubs are rated on these criteria:</p>\n\n<p>Is a professional sommelier or WSET-certified person involved in the wine selection process?\nAre the wines limited production?\nAre the wines undiscovered gems or hard-to-find?\nAre the prices justified?\nAre there allocations for reorders?\nWe invite your feedback on our wine club reviews and ratings systems both on individual wine clubs and as a whole.</p>","image":{"available_sizes":[[[150,125],"assets/images/resized/0017/0070/170070v2-max-150x150.jpg"],[[150,125],"assets/images/resized/0017/0070/170070v2-max-250x250.jpg"],[[150,125],"assets/images/resized/0017/0070/170070v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"CEO","person":{"first_name":"Jessyca","last_name":"Frederick","permalink":"jessyca-frederick","image":null}}],"competitions":[{"competitor":{"name":"wineclubguide.com","permalink":"wineclubguide-com","image":null}},{"competitor":{"name":"winedirectory.net","permalink":"winedirectory-net","image":null}}],"providerships":[{"title":"Web Development","is_past":false,"provider":{"name":"AshleyIT","permalink":"ashleyit","image":null}}],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Headquarters","address1":"","address2":"","zip_code":"","city":"Los Angeles","state_code":"CA","country_code":"USA","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}