{"name":"Woman in Leadership","permalink":"woman-in-leadership","crunchbase_url":"http://www.crunchbase.com/company/woman-in-leadership","homepage_url":"http://www.womaninleadership.com/","blog_url":"http://www.womaninleadership.com/","blog_feed_url":"http://feeds.feedburner.com/WomanInLeadership","twitter_username":"staciewalker","category_code":"consulting","number_of_employees":2,"founded_year":2006,"founded_month":3,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"leadership-development, entrepreneurship, women, blog-for-business, business-blog, business-to-business-blog, women-on-the-internet, marketing, stacie-walker, san-antonio, texas, women-in-leadership, business-women, personal-development, financial-educati","alias_list":null,"email_address":"Stacie@WomanInLeadership.com","phone_number":"2107649289","description":"Inspiration for Female Entrepreneurs","created_at":"Tue Jun 12 23:52:37 UTC 2012","updated_at":"Fri Jun 22 20:33:30 UTC 2012","overview":"<p>Woman in Leadership™ offers valuable business building advice, marketing strategies, featured success stories, financial education, and personal development to help improve your skill set as an entrepreneur in your industry. </p>\n\n<p>The Woman in Leadership community believes in the importance of encouraging you if you are on the fence about starting your own business venture or if you are stagnating with current business goals. </p>\n\n<p>The Woman in Leadership name stands for every woman who is not afraid to pursue her entrepreneurial dreams, no matter what obstacles come into play. </p>\n\n<p>This online community will help you gain the priceless knowledge that is essential for becoming a successful entrepreneur and leader. </p>\n\n<p>OUR SERVICES</p>\n\n<p>We produce publications on various subjects pertaining to women in business, businesses, personal development, and financial issues related to the home business, online business, and small business industries.</p>\n\n<p>We promote and offer business building courses, workshops, seminars, webinars, and telecourses for the Woman in Leadership community.</p>\n\n<p>We provide our online community, clients,  and customers with the best online marketing strategies, resources, and tools available.</p>\n\n<p>We promote personal development and inspirational materials to assist budding entrepreneurs with focusing on the big picture of effective business building.</p>\n\n<p>We provide a variety of success tips for home businesses, small businesses, and online businesses.</p>\n\n<p>We endorse a variety of products and services that cater to the business needs of our clients, online community, and customers.</p>\n\n<p>ABOUT THE FOUNDER</p>\n\n<p>Stacie Walker is a success-driven entrepreneur, residing with her family in the beautiful city of San Antonio, Texas.  Stacie adores working with professional leaders and entrepreneurs in the small business, home business, and online business industries. </p>","image":{"available_sizes":[[[110,99],"assets/images/resized/0019/6354/196354v2-max-150x150.jpg"],[[110,99],"assets/images/resized/0019/6354/196354v2-max-250x250.jpg"],[[110,99],"assets/images/resized/0019/6354/196354v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[{"is_past":false,"title":"Founder","person":{"first_name":"Stacie","last_name":"Walker","permalink":"stacie-walker","image":null}}],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"Woman in Leadership","address1":"21303 Encino Commons Blvd. #812","address2":"","zip_code":"78259","city":"San Antonio","state_code":"TX","country_code":"USA","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[{"external_url":"http://forms.aweber.com/form/33/1294408433.htm","title":"Woman in Leadership Newsletter - Sign Up Here"}]}