{"name":"X-Formation","permalink":"x-formation","crunchbase_url":"http://www.crunchbase.com/company/x-formation","homepage_url":"http://www.x-formation.com/","blog_url":"http://blog.x-formation.com/","blog_feed_url":"http://blog.x-formation.com/","twitter_username":"","category_code":"software","number_of_employees":null,"founded_year":2004,"founded_month":1,"founded_day":1,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"license-manager, license-manager-software, license-management-software, lm-x-license-manager, license-statistics, license-activation-center, x-formation","alias_list":null,"email_address":"info@X-Formation.com","phone_number":"+1 406 322 2614","description":"X-Formation","created_at":"Fri Jun 03 14:30:37 UTC 2011","updated_at":"Mon Sep 19 02:08:44 UTC 2011","overview":"<p>X-Formation is a dynamic and innovative company with focus on providing superior license management solutions to help companies increase revenue and cut costs. Constantly growing since 2004, we have expanded from our headquarters in Arhus, Denmark to establishing a Research &amp; Development center in 2008 in Eastern Europe’s Silicon Valley, Krakow, Poland, where we work with dedicated specialists to develop the solutions you need.</p>\n\n<p>Please see short characteristic of our products and feel free to download a free 30 days demo to confirm that our solutions will meet your needs.</p>\n\n<ol>\n<li>License Statistics will help you track license usage for FLEXlm, FlexNet, LM-X, IBM LUM and more. License Statistics gives you real-time usage, trends over time, and user-based reports to give you various and crucial views of your license usage that help you make informed decisions about your license management.</li>\n</ol>\n\n<p>Check License Statistics by following below link:\nhttp://licstat-demo.x-formation.com/</p>\n\n<ol>\n<li>LM-X License Manager, which provides independent software vendors (ISV’s) with a powerful, straightforward solution to protect their licensed applications, maximizing revenue and giving end-users worry-free, reliable access to their software. </li>\n</ol>\n\n<p>Check LM-X License Manager by following the link:\nhttp://lmx-demo.x-formation.com/</p>\n\n<ol>\n<li>License Activation Center, an advanced license fulfillment and activation system that facilitates the process of deploying your licenses and managing your product orders. License Activation Center provides you with the tools to simplify license fulfillment, streamlining license requests and deliveries.</li>\n</ol>\n\n<p>Check License Activation Center by following the link:\nhttps://license.x-formation.com/</p>\n\n<p>If you have any questions please contact X-Formation Representative:\nhttp://www.x-formation.com/about/contact.html</p>","image":{"available_sizes":[[[150,46],"assets/images/resized/0013/7597/137597v2-max-150x150.jpg"],[[250,77],"assets/images/resized/0013/7597/137597v2-max-250x250.jpg"],[[450,140],"assets/images/resized/0013/7597/137597v2-max-450x450.jpg"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[{"description":"X-Formation Head Office","address1":"Sioevaenget 18","address2":"","zip_code":"DK-8381","city":"Tilst","state_code":null,"country_code":"DNK","latitude":null,"longitude":null}],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}