{"name":"Zentrick","permalink":"zentrick","crunchbase_url":"http://www.crunchbase.com/company/zentrick","homepage_url":"http://zentrick.com","blog_url":"http://zentrick.com/blog","blog_feed_url":"","twitter_username":"zentrick","category_code":"games_video","number_of_employees":8,"founded_year":2010,"founded_month":7,"founded_day":15,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"interactive, video, advertising, analytics, cross-platform","alias_list":null,"email_address":"info@zentrick.com","phone_number":"","description":"Interactive online video","created_at":"Tue May 08 04:08:12 UTC 2012","updated_at":"Thu Oct 25 17:35:51 UTC 2012","overview":"<p>Zentrick provides ad agencies with the tools to create, the platform to deliver and the means to measure interactive video experiences. Viewers gain the ability to click on things they see and like, engage with the content, drill-down into information and make buy decisions; all without leaving the video.</p>\n\n<p>The internet as a medium is fundamentally different from traditional television. There are thousands of new ways to use video to create much more engaging online experiences that have much more value for publishers, advertisers and viewers.</p>\n\n<p>One of the most significant issues right now is that there are no good tools and platforms in place to make use of this huge opportunity. While other companies are investing heavily in the infrastructure and platforms to make video a scalable advertising solution, we work on technology to make it a significantly better advertising solution.</p>\n\n<p>Interactive experiences are built on top of existing web standards; work on devices ranging from mobile phones to television screens and across technologies like HTML5, Flash and Silverlight.</p>\n\n<p>While the creative work of defining the interactivity requires a web developer right now, we’re building and testing tools with our partners that will transform this process towards a simple drag-and-drop experience that can be quickly mastered by non-technical employees.</p>\n\n<p>We provide this as a fully-integrated platform that can scale to the largest campaigns. Pricing is flexible, based on CPV (cost per view) and goes down with campaign size.</p>","image":{"available_sizes":[[[150,150],"assets/images/resized/0018/8326/188326v3-max-150x150.png"],[[250,250],"assets/images/resized/0018/8326/188326v3-max-250x250.png"],[[450,450],"assets/images/resized/0018/8326/188326v3-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}