{"name":"Zetalog Multimedia","permalink":"zetalog-multimedia","crunchbase_url":"http://www.crunchbase.com/company/zetalog-multimedia","homepage_url":"http://www.zetalog.com","blog_url":"","blog_feed_url":"","twitter_username":null,"category_code":"software","number_of_employees":12,"founded_year":1996,"founded_month":4,"founded_day":28,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":"zetalog-multimedia-kiosk-touch-screen-italy-rome-italia-roma-apple-iphone-infopoint-information-point-reception-expo-2015-milan","alias_list":null,"email_address":"info@zetalog.com","phone_number":"+39 393 5481654","description":"New Media Agency di ROMA","created_at":"Thu Jul 17 15:55:59 UTC 2008","updated_at":"Thu Dec 01 07:51:21 UTC 2011","overview":"<p>La Zetalog Multimedia è nata a Roma come software house nel 1996. </p>\n\n<p>Ci proponiamo alle aziende come partner per progetti di investimento nelle risorse tecnologiche, nella comunicazione on-line e nelle relazioni interattive, al fine di portare l&#8217;azienda ad essere allineata e competitiva nel segmento del proprio business.</p>\n\n<p>Sempre attenti alla business intelligence la Zetalog ha fornito risposte alle esigenze del mercato che negli anni sono diventate sempre più sofisticate. Oggi grazie al CMS una azienda può gestire i contenuti del proprio sito web im maniera dinamica, semplice e veloce.</p>\n\n<p>La gestione della clientela e delle risorse sia umane che di magazzino è un compito adatto al CRM, il software che ormai adottano molte aziende e che non ne possono più farne a meno.</p>\n\n<p>Dal 2007 Zetalog Multimedia è distribuitore unico per l&#8217;Italia di una linea kiosk informativi multimediali dal design unico e innovativo. Zetalog Multimedia distribuisce all&#8217;ingrosso in Italia e in Europa ed esercita l&#8217;attività di assistenza e consulenza dei propri prodotti. </p>\n\n<p>Interpellateci nella sezione &#8220;Contatti&#8221; per conoscere la migliore risposta alle vostre esigenze di Business Intelligence.</p>\n\n<p>L&#8217;attività di sviluppo software (dai cd rom alle applicazioni web) è sempre attiva e si affianca allo sviluppo di applicativi personalizzati destinati ai punti informativi multimediali. </p>\n\n<p>A differenza di altri prodotti tecnologici passivi utilizzati in esposizioni, convegni o musei i nostri punti informativi permettono un contatto diretto con l&#8217;utente che grazie alla interattività del touch screen diventa personalizzato e coinvolto nel messaggio da trasmettere.</p>\n\n<p>La mission aziendale è associare alla Brand Identity di enti pubblici e aziende medio-grandi strumenti dal design avanzato e tecnologicamente all&#8217;avanguardia. </p>","image":{"available_sizes":[[[150,18],"assets/images/resized/0002/2264/22264v2-max-150x150.png"],[[250,31],"assets/images/resized/0002/2264/22264v2-max-250x250.png"],[[397,50],"assets/images/resized/0002/2264/22264v2-max-450x450.png"]],"attribution":null},"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}