{"name":"zicasso.com","permalink":"zicasso-com","crunchbase_url":"http://www.crunchbase.com/company/zicasso-com","homepage_url":null,"blog_url":null,"blog_feed_url":null,"twitter_username":null,"category_code":null,"number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"deadpooled_year":null,"deadpooled_month":null,"deadpooled_day":null,"deadpooled_url":null,"tag_list":null,"alias_list":null,"email_address":null,"phone_number":null,"description":null,"created_at":"Thu Jan 22 06:28:42 UTC 2009","updated_at":"Thu Sep 10 11:36:13 UTC 2009","overview":"<p>Zicasso is a free personalized online travel service that provides itinerary bids from a global network of quality travel companies. Each itinerary is handcrafted by experts and personalized to your needs. To ensure quality, the company spent thousands of hours to pre-qualify and select each tour operator and travel agent member.</p>\n\n<p>Zicasso is ideal for busy, discerning travelers who want a hassle-free experience in planning &amp; booking a complex trip.</p>\n\n<p>Why Zicasso? If you are taking a simple trip with say, one or two stops in a familiar destination, there are lots of good solutions on the Internet today, ranging from online travel agencies to travel search engines. But many trips are not so simple, resulting in many hours of research and planning and booking everything you need. Zicasso is designed to take all that hassle out. The company is built on a unique idea : Getting the vacation you want, no matter what your requirements, can be hassle free. Finding quality at the best prices can be easy. Knowing where to go for authentic experiences can be simple.</p>\n\n<p>A personalized online travel service. The company matchs travelers with relevant, quality travel companies that compete by bidding Trip Plans to meet all your trip’s needs. Just a few simple steps:</p>\n\n<p>Traveler fills out a simple form to describe the trip he or she wants. Depending on the clarity of your needs, a travel expert from Zicasso may first get back to you online. Zicasso then matches and notifies relevant pre-screened quality travel companies\nUp to three travel companies use Zicasso’s online system to submit personalized Trip Plans and prices to traveler, typically within 2 - 3 business days. Depending on your needs, these Trip Plans, manually prepared by experts, can include itineraries with expert advice on where to visit, hotels, flights, airport transfers, cruises, other forms of transportation, tour guides, etc.\nTraveler compares and refines Trip Plans with travel companies\nTraveler books the Trip Plan(s) that best meets his or her needs, paying travel company directly. Traveler enjoys the trip, then shares feedback with our community\nAll within an online Web 2.0 environment.</p>","image":null,"products":[],"relationships":[],"competitions":[],"providerships":[],"total_money_raised":"$0","funding_rounds":[],"investments":[],"acquisition":null,"acquisitions":[],"offices":[],"milestones":[],"ipo":null,"video_embeds":[],"screenshots":[],"external_links":[]}