{"name":"Accelerator Corp.","permalink":"accelerator-corp","crunchbase_url":"http://www.crunchbase.com/financial-organization/accelerator-corp","homepage_url":"http://www.acceleratorcorp.com/","blog_url":"","blog_feed_url":"","twitter_username":null,"phone_number":"206.957.7300","description":"Accelerator Corporation, founded in 2003","email_address":"info@acceleratorcorp.com","number_of_employees":6,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":"biotechnology, venture-capital, incubation, life-sciences","alias_list":null,"created_at":"Thu Feb 26 06:22:23 UTC 2009","updated_at":"Fri Feb 27 22:40:39 UTC 2009","overview":"<p>Unique and proven model for identifying and developing emerging biotechnologies.</p>\n\n<p>Accelerator Corporation, founded in 2003, is a vehicle for disciplined and efficient investment in and management of emerging biotechnology opportunities. Located in Seattle, Washington, the company identifies, evaluates, finances, and manages ground breaking emerging life sciences opportunities. The company has established and built a largely proprietary array of sources of deal flow, as well as a key set of resources to bring to bear in the development of the best opportunities emerging from those sources.  These key resources, provided by Accelerator and its Affiliates – Amgen Ventures, ARCH Venture Partners, OVP Venture Partners, WRF Capital, Alexandria Real Estate Equities, Inc., and the Institute for Systems Biology – include committed investment capital, state-of-the-art facilities, world-class scientific and technical expertise and support, and experienced start-up management. This panel of Accelerator participants will discuss the success of their business model and provide practical expertise for the next generation of biotech incubators.</p>\n\n<p>In the past five years, nine companies have been invested in through Accelerator.  Three have emerged and raised follow on financings of more than $114 million.  Four remain under management at Accelerator, having raised between them $11.3 million in initial Accelerator-based investments.  In all, Accelerator companies have raised in excess of $143.5 million in initial and follow-on financings.</p>\n\n<p>Accelerator’s investors have committed an additional $22.5 million to enable Accelerator to continue to identify, capitalize, and develop the next-generation of exciting emerging biotechnologies.  </p>\n\n<p>Accelerator Corporation relies upon a unique set of sources to fill a world-class pipeline of deal flow and has established and utilized a now proven array of resources to identify, evaluate, capitalize and manage emerging biotechnology companies. Accelerator provides this unprecedented collection of resources via a partnership between top-tiered investors, dedicated management, and a world-class research institute. These groups have come together because they recognize the potential of biotechnology both as an investment opportunity and as a critical component of the rapidly evolving future of medicine and healthcare. Moreover, these individuals and organizations have extensive experience in the difficult, complex and costly process of transforming an exciting laboratory discovery into a commercial product. By providing their expertise with companies in the Accelerator portfolio, these industry leaders provide critical knowledge and resources that can help to streamline the development and accelerate the commercialization of novel technologies.</p>\n\n<p>Accelerator, through the global activities of its affiliates, has access to exciting new technologies and commercial opportunities developed at leading research institutions, universities and biotechnology companies around the world. This enables Accelerator to select only the most compelling investments from a deep pool of promising opportunities. </p>","image":null,"offices":[{"description":"","address1":"1616 Eastlake Ave. E.","address2":"","zip_code":"98102","city":"Seattle","state_code":"WA","country_code":"USA","latitude":47.6336317,"longitude":-122.3256442}],"relationships":[{"is_past":false,"title":"Chief Scientific Officer","person":{"first_name":"David","last_name":"McElligott","permalink":"david-mcelligott","image":null}},{"is_past":false,"title":"Director","person":{"first_name":"Leroy","last_name":"Hood","permalink":"leroy-hood","image":null}},{"is_past":false,"title":"Director","person":{"first_name":"Steven","last_name":"Gillis","permalink":"steven-gillis","image":null}},{"is_past":false,"title":"Director","person":{"first_name":"Carl","last_name":"Weissman","permalink":"carl-weissman","image":null}},{"is_past":false,"title":"Director","person":{"first_name":"Thong","last_name":"Le","permalink":"thong-le","image":null}},{"is_past":false,"title":"Director","person":{"first_name":"Stu","last_name":"Mackey","permalink":"stu-mackey","image":null}},{"is_past":false,"title":"Director","person":{"first_name":"Charles","last_name":"Waite","permalink":"charles-waite","image":null}},{"is_past":false,"title":"Director","person":{"first_name":"Joel","last_name":"Marcus","permalink":"joel-marcus","image":null}},{"is_past":false,"title":"Director","person":{"first_name":"Fred","last_name":"N. Eshelman","permalink":"fred-n-eshelman","image":null}},{"is_past":true,"title":"Chief Scientific Officer","person":{"first_name":"Patrick","last_name":"Gray","permalink":"patrick-gray-2","image":null}}],"investments":[{"funding_round":{"round_code":"a","source_url":"http://onbiovc.com/oncofactor-inc-series-a-21m/","source_description":"Oncofactor, Inc.: Series A $2.1M","raised_amount":2100000,"raised_currency_code":"USD","funded_year":2011,"funded_month":8,"funded_day":2,"company":{"name":"Oncofactor Corporation","permalink":"oncofactor-corporation","image":null}}}],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[{"external_url":"http://www.acceleratorcorp.com/","title":"Accelerator Corp."}]}