{"name":"Acclaro Wealth Management","permalink":"acclaro-wealth-management","crunchbase_url":"http://www.crunchbase.com/financial-organization/acclaro-wealth-management","homepage_url":"http://www.acclarowealth.com","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"925-939-5607","description":"Independent Wealth Management Firm","email_address":"info@acclarowealth.com","number_of_employees":3,"founded_year":2007,"founded_month":2,"founded_day":10,"tag_list":"","alias_list":null,"created_at":"Thu Oct 07 19:26:31 UTC 2010","updated_at":"Fri Dec 17 21:11:27 UTC 2010","overview":"<p>When you think about it, the ultimate goal in life is not accumulating money, but achieving the happiness that comes from realizing your dreams. Financial success can certainly make that easier. That’s where we come in. Acclaro Wealth Management helps you take a disciplined approach to decisions about your money and your financial life with the goal that your dreams become reality.</p>\n\n<p>The principals of Acclaro, Belvin Doane and Ryan Wells, met back in 2007 when searching for shared office space and immediately found that they shared many of the same values. For 3 years they worked side by side within the same office suite often discussing financial strategies. In 2010 they made the decision to merge their two private practices into a single wealth management firm named Acclaro Wealth Management.</p>\n\n<p>Together, they each bring a different level of expertise to Acclaro. Belvin’s 25+ years of fiscal management experience helps him effectively counsel small business owners.  He can help by ensuring the right retirement plan is in place, creating employee benefits packages and assisting with succession planning and exit strategies.  Belvin is also a specialist in investment management, utilizing Trend Analysis as a means of tactical asset allocation.</p>\n\n<p>Ryan’s background is grounded in financial planning and risk management strategies. Starting his career with Mass Mutual Financial Group, he became an expert in designing comprehensive financial plans, life insurance tax strategies and cash flow management. In the years since, his expertises have evolved into working with clients who want a high level of personal financial coaching. He has also become very involved with working with socially responsible investments, that is, companies who focus not only on profits but the sustainability of our environment.</p>","image":{"available_sizes":[[[150,28],"assets/images/resized/0010/4607/104607v2-max-150x150.png"],[[250,47],"assets/images/resized/0010/4607/104607v2-max-250x250.png"],[[450,85],"assets/images/resized/0010/4607/104607v2-max-450x450.png"]],"attribution":null},"offices":[{"description":"Walnut Creek Office","address1":"1850 Mt. Diablo Blvd. ","address2":"Suite 401","zip_code":"94596","city":"Walnut Creek","state_code":"CA","country_code":"USA","latitude":null,"longitude":null}],"relationships":[{"is_past":false,"title":"Principal","person":{"first_name":"Ryan","last_name":"Wells","permalink":"ryan-wells","image":null}},{"is_past":false,"title":"Principal","person":{"first_name":"Belvin","last_name":"Doane","permalink":"belvin-doane","image":null}}],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}