{"name":"Ag Fund","permalink":"ag-fund","crunchbase_url":"http://www.crunchbase.com/financial-organization/ag-fund","homepage_url":"http://www.agfund.org/","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"+96614418888","description":"non-profit","email_address":"info@agfund.org","number_of_employees":null,"founded_year":1980,"founded_month":null,"founded_day":null,"tag_list":null,"alias_list":"","created_at":"Fri Jun 19 19:56:28 UTC 2009","updated_at":"Fri Jun 19 20:02:32 UTC 2009","overview":"<p>AGFUND is a non-profit regional development institution, established  in  1980  by  the  initiative  of HRM  Prince Talal Bin Abdul Aziz Al Saud, with the support of the leaders of the Arab Gulf States that constitute its membership and contribute to its budget. AGFUND is concerned with the support of sustainable human development efforts targeting the neediest in developing countries, particularly women and children, through support of the efforts strongly affecting the development process, including those aimed at improving the educational and health standards, supporting poverty combating programmes and those which support institutional structures. This is done in cooperation with national, international and regional organizations, NGOs and other institutions engaged in development, without any discrimination as to sex, creed or political affiliation.</p>\n\n<p>Since its establishment in up-till 2006, AGFUND contributed the supporting and financing of 1,045 projects in 131 countries in Asia, Africa, Latin America  and Eastern Europe, with a total worth of more than US$ 235 million. This amount was extended in cooperation with 19 national and international and regional institutions. AGFUND also established a number of Arab regional institutions, which included the Arab Council for Childhood and Development, Arab Women Centre for Research and Training, Arab Network of NGOs and the Arab Open University.\nOut of its belief in the importance of encouraging developmental and humanitarian activities in developing communities; stimulating distinguished efforts aiming at promoting sustainable human development and the positive consequences of such efforts; exploring the pioneering developmental projects, honoring them and encouraging their implementation in other developing communities, AGFUND established AGFUND International  Prize for Pioneering Development Projects. The Prize carries a financial rewards of US$ 300,000 (three-hundred thousand US dollars) distributed on three categories according to the agency implementing the project nominated for the Prize.</p>","image":{"available_sizes":[[[150,102],"assets/images/resized/0004/9714/49714v1-max-150x150.jpg"],[[192,131],"assets/images/resized/0004/9714/49714v1-max-250x250.jpg"],[[192,131],"assets/images/resized/0004/9714/49714v1-max-450x450.jpg"]],"attribution":null},"offices":[],"relationships":[],"investments":[{"funding_round":{"round_code":"c","source_url":"http://cleantech.com/news/4177/divergence-raises-118m-crop-pestici","source_description":"Divergence raises $11.8M for crop, pesticide technology","raised_amount":11800000,"raised_currency_code":"USD","funded_year":2009,"funded_month":2,"funded_day":11,"company":{"name":"Divergence","permalink":"divergence","image":{"available_sizes":[[[150,33],"assets/images/resized/0004/9707/49707v1-max-150x150.png"],[[250,55],"assets/images/resized/0004/9707/49707v1-max-250x250.png"],[[259,58],"assets/images/resized/0004/9707/49707v1-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}