{"name":"Alignment Capital Group","permalink":"alignment-capital-group","crunchbase_url":"http://www.crunchbase.com/financial-organization/alignment-capital-group","homepage_url":"http://www.alignmentcapital.com/","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"512-506-8299","description":"","email_address":"info@alignmentcapital.com","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":null,"alias_list":"","created_at":"Mon Mar 15 20:35:59 UTC 2010","updated_at":"Sun Aug 29 15:49:09 UTC 2010","overview":"<p>Alignment Capital Group (ACG) is a private equity consulting firm based in Austin, Texas. It was founded in 2000 by Austin M. Long, III, who continues to lead the firm today, and Craig J. Nickels, who is now the Director of Private Equity at Washington University in St. Louis. ACG provides strategic advisory services to institutional investors in private equity. The firm is uniquely qualified, with a growing portfolio of patents relating to proprietary analytical methods; an expanding array of original research, including publications in peer-reviewed journals; and over 20 years of experience in managing or advising the private equity portfolios of large public funds.</p>\n\n<p>Alignment Capital was founded on the fundamental principle of alignment of interests. The firm believes that private equity is an asset class in which avoiding conflicts of interest between and among investors, intermediaries and investment managers is crucial to the success of all. ACG has become a strategic consultancy, as opposed to the combination consultancy–asset management operation that is typical in the industry, in order to avoid the conflicts of interest inherent in advising plan sponsors on portfolio management issues while simultaneously managing portfolios of private equity investments.</p>\n\n<p>The firm’s advisory approach is a balance between quantitative analysis and qualitative knowledge and experience. It combines the lessons learned from managing and advising large private equity portfolios with those gleaned from studying the behavior of private equity from a portfolio management perspective to assist clients in making optimal investment decisions. In short, ACG strives to bring clarity and rigorous, repeatable analysis to an area historically known for its informality and lack of transparency.</p>\n\n<p>The firm’s professionals possess a strong commitment to intellectual honesty and integrity, innovation, pure and applied research, education and plain hard work in the service of improving the way large institutions view and implement their private equity portfolios.</p>","image":{"available_sizes":[[[150,9],"assets/images/resized/0009/9806/99806v2-max-150x150.jpg"],[[250,15],"assets/images/resized/0009/9806/99806v2-max-250x250.jpg"],[[450,27],"assets/images/resized/0009/9806/99806v2-max-450x450.jpg"]],"attribution":null},"offices":[{"description":"HQ","address1":"4500 Steiner Ranch Blvd. ","address2":"Suite #806","zip_code":"78732","city":"Austin","state_code":"TX","country_code":"USA","latitude":null,"longitude":null}],"relationships":[],"investments":[{"funding_round":{"round_code":"b","source_url":"","source_description":"Cap Funding Report","raised_amount":6700000,"raised_currency_code":"USD","funded_year":2007,"funded_month":3,"funded_day":19,"company":{"name":"Jacent Technologies","permalink":"jacent-technologies","image":null}}},{"funding_round":{"round_code":"unattributed","source_url":"","source_description":"Cap Funding Report","raised_amount":7000000,"raised_currency_code":"USD","funded_year":2005,"funded_month":6,"funded_day":15,"company":{"name":"Jacent Technologies","permalink":"jacent-technologies","image":null}}}],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}