{"name":"Altitude Capital Partners","permalink":"altitude-capital-partners","crunchbase_url":"http://www.crunchbase.com/financial-organization/altitude-capital-partners","homepage_url":"http://www.altitudecp.com/","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"(212) 584-2184","description":"","email_address":"info@altitudecp.com","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":null,"alias_list":"","created_at":"Thu Mar 04 14:26:15 UTC 2010","updated_at":"Sun Aug 29 16:27:07 UTC 2010","overview":"<p>Altitude Capital Partners is a leading private investment firm focused on investing $250 million of capital in businesses which own compelling intellectual property assets.</p>\n\n<p>We seek to invest in portfolio companies that have valuable patents, trademarks/brands, copyrights, royalty streams, trade secrets, and other intangible assets which will create a competitive advantage in creating value. We possess the investment flexibility to provide common equity, preferred stock, subordinated or secured debt which allows our portfolio companies to fund working capital for organic growth, acquisitions, strategic IP licensing / litigation activities or to facilitate distributions to existing shareholders. Our goal is to combine our private equity investment experience and our value added intellectual property expertise to be the premier investors for understanding the opportunities and risks associated with intellectual property assets.</p>\n\n<p>Altitude is well capitalized and positioned to provide a wide array of financial structures and solutions through its committed private equity fund, Altitude Capital Partners, L.P. Our investors include numerous hedge funds, family offices and other institutional and high net worth investors. Altitude approaches each transaction as a partnership/strategic relationship, with no pre-conceived economic structure or governance. We generally expect to realize value from our investments through initial public offerings, strategic sales, passive receipts of royalty streams or licensing outcomes.</p>\n\n<p>Altitude&#8217;s inter-disciplinary team has extensive intellectual property knowledge, and broad transactional, licensing, litigation and private equity investment experience. Our due diligence process utilizes our internal team and an extensive team of external economic consultants, technical experts, business/management consultants and IP lawyers to provide expert analysis of the assets and the market for those assets. This is critical for us as financial investors and can be used as a valuable tool of unbiased judgment for our partners.</p>\n\n<p>Altitude has the resources and abilities to craft solutions in all areas of Intellectual Property. Altitude has experience in a myriad of industries and technologies including communications, information technology, medical devices, pharmaceutical, manufacturing, computers, biotechnology, e-commerce, software, entertainment, media, financial, automotive, network security, wireless data communication and electronics.</p>","image":{"available_sizes":[[[150,81],"assets/images/resized/0009/9815/99815v1-max-150x150.jpg"],[[250,135],"assets/images/resized/0009/9815/99815v1-max-250x250.jpg"],[[261,141],"assets/images/resized/0009/9815/99815v1-max-450x450.jpg"]],"attribution":null},"offices":[{"description":"HQ","address1":"485 Madison Avenue","address2":"","zip_code":"10022","city":"New York","state_code":"NY","country_code":"USA","latitude":null,"longitude":null}],"relationships":[],"investments":[{"funding_round":{"round_code":"unattributed","source_url":"","source_description":"Cap Funding Report","raised_amount":9000000,"raised_currency_code":"USD","funded_year":2007,"funded_month":2,"funded_day":6,"company":{"name":"Deep Nines","permalink":"deep-nines","image":{"available_sizes":[[[150,62],"assets/images/resized/0007/9070/79070v1-max-150x150.jpg"],[[203,85],"assets/images/resized/0007/9070/79070v1-max-250x250.jpg"],[[203,85],"assets/images/resized/0007/9070/79070v1-max-450x450.jpg"]],"attribution":null}}}},{"funding_round":{"round_code":"unattributed","source_url":"http://press.abc-directory.com/press/1086","source_description":"Visto Corporation Secures $35 Million in Financing From Altitude Capital Partners","raised_amount":35000000,"raised_currency_code":"USD","funded_year":2007,"funded_month":2,"funded_day":17,"company":{"name":"Visto","permalink":"visto","image":{"available_sizes":[[[150,73],"assets/images/resized/0003/6846/36846v1-max-150x150.png"],[[250,122],"assets/images/resized/0003/6846/36846v1-max-250x250.png"],[[261,128],"assets/images/resized/0003/6846/36846v1-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}