{"name":"Alumni Capital Network","permalink":"alumni-capital-network","crunchbase_url":"http://www.crunchbase.com/financial-organization/alumni-capital-network","homepage_url":"http://www.alumnicapitalnetwork.com/equity-investment/homepage/","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"212-792-5510","description":"","email_address":"jhonohan@acnfund.com","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":null,"alias_list":"","created_at":"Thu Apr 29 19:09:42 UTC 2010","updated_at":"Sun Aug 29 16:35:28 UTC 2010","overview":"<p>Alumni Capital Network (ACN) is a unique private equity firm launched by former Accenture partners who provide equity, expertise and execution capabilities to create value for middle market companies. Collectively, we delivered billions of dollars of incremental revenues and profits for Fortune 1000 clients and participated in over one hundred PE transactions. ACN brings the same proven methodologies, industry insights and contacts to elevate the strategies, operations and financial performance of its portfolio companies to the next level.</p>\n\n<p>Our management team includes professionals who have served in executive and operational leadership roles in public and private companies as well as private equity leaders with over 20 years of experience. Most of our Managing Directors have been successful business owners who have served on several public and private boards of directors. Our core is the ACN Network, which consists of active investors with deep industry, business process and technology skills. We utilize the ACN Network to rapidly deploy highly skilled teams to evaluate investments and execute growth and performance improvement programs within our portfolio companies.</p>\n\n<p>We seek to acquire majority ownership of middle market companies where we can apply our financial and knowledge capital to improve a company’s performance. We prefer to partner with management by bringing our complementary skills and experience to support growing the business and improving profitability. We focus on business services, consumer, financial services, industrial, healthcare, high technology, outsourcing, retail and transportation &amp; logistics industries.</p>\n\n<p>The ACN advantage:</p>\n\n<p>We are an operationally-focused investor who helps companies grow and create long term sustainable value\nWe build long term relationships with management teams the same way we did with clients at Accenture\nWe quickly review opportunities and decisively complete transactions\nWe bring outstanding financial clout to support portfolio companies and can leverage close partnerships with leading institutions for supplemental capital resources\nAlumni Capital Network’s main offices are in New York City with Managing Directors based in Atlanta, Boston, Chicago, Columbus and Los Angeles. We are open to opportunities across the United States.</p>","image":{"available_sizes":[[[150,17],"assets/images/resized/0009/9817/99817v1-max-150x150.jpg"],[[250,29],"assets/images/resized/0009/9817/99817v1-max-250x250.jpg"],[[321,38],"assets/images/resized/0009/9817/99817v1-max-450x450.jpg"]],"attribution":null},"offices":[{"description":"HQ","address1":"51 East 42nd Street","address2":"Suite 1100","zip_code":"10017-5404","city":"New York","state_code":"NY","country_code":"USA","latitude":null,"longitude":null}],"relationships":[],"investments":[{"funding_round":{"round_code":"b","source_url":"","source_description":"","raised_amount":15000000,"raised_currency_code":"USD","funded_year":2010,"funded_month":3,"funded_day":24,"company":{"name":"Babyage","permalink":"babyage","image":{"available_sizes":[[[150,43],"assets/images/resized/0008/5367/85367v1-max-150x150.jpg"],[[215,62],"assets/images/resized/0008/5367/85367v1-max-250x250.jpg"],[[215,62],"assets/images/resized/0008/5367/85367v1-max-450x450.jpg"]],"attribution":null}}}}],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}