{"name":"Amerevision","permalink":"amerevision","crunchbase_url":"http://www.crunchbase.com/financial-organization/amerevision","homepage_url":null,"blog_url":null,"blog_feed_url":null,"twitter_username":null,"phone_number":null,"description":null,"email_address":null,"number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":"","alias_list":null,"created_at":"Wed Aug 29 17:49:06 UTC 2012","updated_at":"Sun Sep 02 07:05:16 UTC 2012","overview":"<p>Amerevision provides legal financing to select homeowners, investment and commercial property owners who seek to dispute the validity of their mortgage debt via the legal forum.\nThe services we provide optimize our clients’ likelihoods of obtaining meaningful restructurings of the terms of their mortgage loans, and/or significant principal reductions.   </p>\n\n<p>Amerevision applies fine-tuned underwriting, structuring and management processes to client files, enabling our  clients to resolve their disputes proactively, economically, and favorably.</p>\n\n<p>Amerevision selects cases for funding where the subject mortgage loan is defective, fraudulent or wrongfully-originated, whether the borrower is the plaintiff or defending a foreclosure.  Prior to application acceptance, Amerevision engages in a thorough analysis of a potential client’s real property and loan documentation, identifying flaws in mortgage origination, closing, servicing, securitizing and recording.</p>\n\n<p>Amerevision funds litigation by paying a client’s attorney directly for services performed.  Our funding is non-recourse, which means if a client is unsuccessful, we are not repaid the monies we have expended on their behalf.   Amerevision is paid only if a client settles their case successfully, and our fee can be paid in manageable monthly installments.</p>\n\n<p>Amerevision invests strategically in the success of our clients’ cases: our interests are entirely aligned with theirs.</p>","image":null,"offices":[],"relationships":[{"is_past":false,"title":"","person":{"first_name":"Amerevision","last_name":"Amerevision","permalink":"amerevision-amerevision","image":null}}],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}