{"name":"Argonaut Capital Management","permalink":"argonaut-capital-management","crunchbase_url":"http://www.crunchbase.com/financial-organization/argonaut-capital-management","homepage_url":"http://www.argonautcap.com/","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"","description":"","email_address":"","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Apr 25 01:27:54 UTC 2010","updated_at":"Mon Apr 26 17:59:00 UTC 2010","overview":"<p>Argonaut Capital Management is a hedge fund manager based in New York that offers investment vehicles using global macro and long/short equity investing strategies.  Argonaut was founded in August 1993 by David Gerstenhaber, the firm&#8217;s President and Portfolio Manager.  The firm&#8217;s flagship global macro fund, the Macro Partnership, LP launched in July 2000, while an off-shore clone, the Argonaut Global Macro Fund LTD, launched in August 2005.  A long/short equity fund, the Argonaut Global Equities Partnership, LP, also launched in July 2000 and the off-shore clone, the Argonaut Worldwide Equities Fund LTD, launched in December 2007.</p>\n\n<p>Argonaut&#8217;s macro offerings seek to generate high, uncorrelated, risk-controlled returns by investing in currencies, commodities, fixed income instruments and equity-linked securities (primarily index futures, but never individual equities).  Analysis of macro-economic data, central bank policy and market expectations are employed to form a top-down view of the world. This top-down approach is buttressed by micro-level research conducted through meetings with individual companies. This allows the investment team to make asset allocation decisions based upon the resulting views and creates a highly thematic portfolio. Because of the global, cross-asset class nature of our investment universe, the successful execution of this strategy results in a very low correlation with most major market indices. In addition, the fund is managed with rigid risk management rules, including daily VaR limits by asset class and total portfolio, leverage limits by asset class and total portfolio and the use of stop losses as well.</p>\n\n<p>The Global Equities Partnership, LP, invests in quality companies with strong growth profiles and attractive valuations and shorts companies where growth is slowing and earnings announcements appear likely to disappoint market expectations. Analysts use a top-down macroeconomic overlay in conjunction with a bottom-up screening process to identify global sectors, countries, and companies that are beneficiaries or casualties of structural trends. The fund&#8217;s primary focus is on high-growth companies in international markets where there is a significant and exploitable divergence between intrinsic value and market value. The portfolio team is distinguished by expertise in Asian, Latin American, and Eastern European emerging markets and the developed markets of Japan and United States.</p>","image":null,"offices":[],"relationships":[{"is_past":false,"title":"President","person":{"first_name":"David","last_name":"Gerstenhaber","permalink":"david-gerstenhaber","image":null}}],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}