{"name":"Argon Venture Partners","permalink":"argon-venture-partners","crunchbase_url":"http://www.crunchbase.com/financial-organization/argon-venture-partners","homepage_url":"http://www.argoncap.com/","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"","description":"Venture Capital Firm","email_address":"info@argoncap.com","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":null,"alias_list":"","created_at":"Fri Aug 06 05:10:19 UTC 2010","updated_at":"Wed Sep 01 18:25:01 UTC 2010","overview":"<p>Argon Venture Partners is a cross-border early-stage venture capital firm based in Silicon Valley, California, and Alberta, Canada. We partner with visionary entrepreneurs to build information technology start-ups with long term growth potential. Our comprehensive strategy is comprised of a proprietary early stage investment process, a unique cross-border model, and an extended team with deep yet balanced skill sets. </p>\n\n<p>Historically, early stage investments have produced the highest returns. Our investments commence at the earliest stages of company development, focused on seed and Series A financing. This approach allows Argon to provide frequent &#8220;hands on&#8221; portfolio management and to maximize upside for all stakeholders involved. Angel investing, the world&#8217;s largest source of early stage funding, is a critical lever for technology entrepreneurs. Argon has full ownership of Western Canada&#8217;s top angel investment group, which vastly enhances its deal flow and screening capabilities. </p>\n\n<p>Cross border funds have become increasingly attractive as human, information and financial barriers have come down. The benefits of diversification, cost/talent arbitrage and ability to infiltrate larger global markets has created an unprecedented opportunity. Western Canada is a largely untapped market and has favorable geographical, business, legal and government conditions. Argon is the only cross-border venture fund that combines senior local presence in Alberta with a Silicon-Valley investment team that has access to top technology managers and the largest information technology markets. </p>\n\n<p>Argon&#8217;s senior management team is situated in Silicon Valley (two general partners, one executive partner) and Calgary (one general partner, one associate). This balanced group of experienced professionals has extensive industry expertise, venture investing background, business relationships and entrepreneurial history.</p>","image":{"available_sizes":[[[150,23],"assets/images/resized/0010/0252/100252v1-max-150x150.png"],[[250,38],"assets/images/resized/0010/0252/100252v1-max-250x250.png"],[[285,44],"assets/images/resized/0010/0252/100252v1-max-450x450.png"]],"attribution":null},"offices":[{"description":"HQ","address1":"303 Twin Dolphin Drive 6th Floor","address2":"","zip_code":"94065 ","city":"Redwood City","state_code":"CA","country_code":"USA","latitude":null,"longitude":null}],"relationships":[],"investments":[{"funding_round":{"round_code":"b","source_url":"","source_description":"Cap Funding Report","raised_amount":14000000,"raised_currency_code":"USD","funded_year":2005,"funded_month":11,"funded_day":16,"company":{"name":"Anagran","permalink":"anagran-inc","image":{"available_sizes":[[[150,72],"assets/images/resized/0002/4584/24584v2-max-150x150.png"],[[250,120],"assets/images/resized/0002/4584/24584v2-max-250x250.png"],[[251,121],"assets/images/resized/0002/4584/24584v2-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}