{"name":"ARLAN","permalink":"arlan","crunchbase_url":"http://www.crunchbase.com/financial-organization/arlan","homepage_url":"http://en.arlan.ru/","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"","description":"","email_address":"","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Jan 18 11:24:42 UTC 2010","updated_at":"Mon Apr 26 05:23:32 UTC 2010","overview":"<p>ARLAN is a private equity management company involved in a number of key industries in Russia and its neighbouring countries. Founded in 1990, ARLAN has been steadfast in its approach and strategy in dealing with the dynamic changes of the Russian market. ARLAN has developed the ability to effectively manage investments, and a responsive and prompt decision process. This has enabled ARLAN to successfully accomplish investments in metallurgy, extraction and production of non-ferrous metals, non-metallic raw materials and real estate. Its expertise in mining and non-ferrous metals has now brought ARLAN to the management of mining investments in Africa.</p>\n\n<p>As a leading private equity manager in the region, the mission of ARLAN is to provide investors with a high internal rate of return and a diversified portfolio of investment projects. ARLAN’s experienced team have been able to effectively increase the value of portfolio companies through the enlistment of professional managers and implementation of modern management systems, disposal of non-core assets, and involvement of strategic partners. As a fund manager, ARLAN typically seeks investments in projects or companies in the range of US$20 million to US$300 million.</p>\n\n<p>Recent investments taken under management by ARLAN include the Pavlik, Shakhskoye, Burkhalinskoye, and Utinskoye gold deposits in Russia’s Magadan region; Stellar Diamonds Ltd., a diamond exploration company that operates in Western Africa; and the Smolensk Agricultural Land Project, an initiative to create a large-scale dairy production farm.</p>\n\n<p>ARLAN recently exited projects including the First Moscow Watch Factory to a strategic investor, the Balasheika Ore Mining and Processing Works project to an international strategic investor, the TDS Salt Distribution Company through a management buyout, and the Trubetskaya residential complex project through sale to a strategic investor.</p>","image":null,"offices":[],"relationships":[],"investments":[{"funding_round":{"round_code":"c","source_url":"http://eu.techcrunch.com/2011/04/14/kupivip-secures-55m-funding-to-become-the-amazon-of-russia/","source_description":"KupiVIP secures $55m funding to become the Amazon of Russia","raised_amount":55000000,"raised_currency_code":"USD","funded_year":2011,"funded_month":4,"funded_day":14,"company":{"name":"Kupivip","permalink":"kupivip","image":{"available_sizes":[[[150,43],"assets/images/resized/0004/1393/41393v3-max-150x150.png"],[[250,71],"assets/images/resized/0004/1393/41393v3-max-250x250.png"],[[254,73],"assets/images/resized/0004/1393/41393v3-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}