{"name":"ASGARD","permalink":"asgard","crunchbase_url":"http://www.crunchbase.com/financial-organization/asgard","homepage_url":null,"blog_url":null,"blog_feed_url":null,"twitter_username":null,"phone_number":null,"description":null,"email_address":null,"number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":null,"alias_list":null,"created_at":"Fri Feb 06 00:55:34 UTC 2009","updated_at":"Fri Feb 13 13:11:19 UTC 2009","overview":"<p>Asgard Financial provides services that meet the specific needs of student loan defaulters. Since the inception of our operation, Asgard&#8217;s mission has been to become one of nation&#8217;s leaders in providing real solutions to the complex problems facing defaulted student loan borrowers. Asgard currently operates out of Mableton, Georgia with a staff of very talented employees.</p>\n\n<p>Asgard was initially organized to take advantage of specific customer benefit and service needs and problems that existed in the student loan industry, specifically within the defaulted student loan arena. The experience of the founders of Asgard in both the student loan and financial markets afforded us an insider&#8217;s knowledge and a competitive edge in addressing and resolving these needs. Our industry knowledge, marketing experience, and growth have allowed us to become one of the country&#8217;s preeminent providers of real solutions to defaulted student loan borrowers.</p>\n\n<p>The Asgard Student Loan Consolidation Program® is quickly becoming one of the fastest-growing loan programs in the country. Our program, involving one of the nation&#8217;s largest lenders and personalized loan servicing, has made repaying student loans more affordable for tens of thousands of customers.</p>\n\n<p>Asgard Financial enjoys a superior reputation with our customers and business partners. Defaulted student loan borrowers across the country have used our services to stop collection agency harassment, stop loan garnishments, secure loan settlements, and get new loans.</p>","image":null,"offices":[],"relationships":[{"is_past":false,"title":"Client","person":{"first_name":"Cody James","last_name":"Miller","permalink":"cody-james-miller","image":{"available_sizes":[[[116,150],"assets/images/resized/0003/5709/35709v2-max-150x150.jpg"],[[194,250],"assets/images/resized/0003/5709/35709v2-max-250x250.jpg"],[[311,400],"assets/images/resized/0003/5709/35709v2-max-450x450.jpg"]],"attribution":""}}}],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}