{"name":"Assetton","permalink":"assetton","crunchbase_url":"http://www.crunchbase.com/financial-organization/assetton","homepage_url":"http://www.assetton.com/","blog_url":"","blog_feed_url":"","twitter_username":null,"phone_number":"","description":"","email_address":"","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":"wine, alternative, art","alias_list":null,"created_at":"Mon Mar 23 19:37:39 UTC 2009","updated_at":"Tue Mar 24 20:16:39 UTC 2009","overview":"<p>Assetton is an investment company that focuses on Real Returns from Real Assets. We offer alternative forms of investments such as Bordeaux&#8217;s (France) Blue Chip Wines, Developable Land in Canada  and Limited Works of Art from Singapore&#8217;s Baron of Batik - Sarkasi Said, to complement existing forms of investments offered by banks and financial advisories.</p>\n\n<p>In the past, alternative investments, such as those listed above, were exclusive playgrounds of the rich and noble. We at Assetton have contributed to this paradigm shift - making these investments available to the discerning investor while retaining the air of affluence and luxurious prestige these investments have come to embody. Assetton caters to investors from all walks of life - with the common goal of financial portfolio diversification and capital growth.</p>\n\n<p>Assetton prides itself on being a clean-cut business with integrity and professionalism. Assetton aims to become the preferred choice in alternative investment in the Asia continent.</p>\n\n<p>The Assetton mission is to search for the best global real assets based on sound economic principles and work with experts in their respective fields so as to assure that our clients enjoy healthy and sustainable real returns of 10-12% or higher for their investments with us.</p>","image":{"available_sizes":[[[150,94],"assets/images/resized/0003/8988/38988v2-max-150x150.png"],[[187,118],"assets/images/resized/0003/8988/38988v2-max-250x250.png"],[[187,118],"assets/images/resized/0003/8988/38988v2-max-450x450.png"]],"attribution":null},"offices":[],"relationships":[],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}