{"name":"Bioprocess Capital Ventures","permalink":"bioprocess-capital-ventures","crunchbase_url":"http://www.crunchbase.com/financial-organization/bioprocess-capital-ventures","homepage_url":"http://www.bcvf.ru/","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"+7 495 974 7401","description":"private equity","email_address":"","number_of_employees":null,"founded_year":2006,"founded_month":null,"founded_day":null,"tag_list":null,"alias_list":"","created_at":"Mon Jul 12 04:04:53 UTC 2010","updated_at":"Fri Sep 03 07:26:17 UTC 2010","overview":"<p>Limited Liability Company Management Company Bioprocess Capital Partners was established on Oct. 6, 2006 (OGRN 5067746956052) to participate in the competitive selection of legal entities (fund managers) to communicate to them in trust funds of the Russian Venture Company with a view to their subsequent investment through the mechanism venture capital funds in the domestic innovative companies, and the subsequent implementation of the management of unit investment fund in the field of biotechnology, and May 11, 2007 was recognized as one of the winners of competitive selection.</p>\n\n<p>Limited Liability Company Management Company &#8220;Bioprocess Capital Partners operates under a license from the Federal Financial Markets Service of the Russian Federation of December 14, 2006 № 21-000-1-00330 the implementation of the management of investment funds, mutual funds and state pension funds.\nOctober 6, 2009 for № 0945-94131984-2 Federal Service for Financial Markets registered the changes and additions to the rules of trust management of closed share investment funds especially risky (venture) investments Bioprocess Capital Ventures under the direction of the Limited Liability Company Management Company &#8220;Bioprocess Capital Partners, related to the fact that the investment fund units are intended for qualified investors.</p>\n\n<p>These changes came into force on October 16, 2009. Since that date the investment shares of the Closed Unit Investment Fund particularly risky (venture) investments Bioprocess Capital Ventures &#8220;are intended for qualified investors, the treatment of investment shares is restricted in accordance with federal law and is carried out according to the rules of securities intended for qualified investors.</p>\n\n<p>By virtue of article 52 paragraph 3 of the Federal Law of November 29, 2001 № 156-FZ &#8220;On Investment Funds&#8221; information about the unit investment fund, investment shares of which are limited in circulation, can be granted only to owners of investment units and other qualified investors.\nFor information on closed share investment fund particularly risky (venture) investments Bioprocess Capital Ventures under the direction of the Limited Liability Company Management Company &#8220;Bioprocess Capital Partners can be accessed at: 121069, Moscow, Table lane, 6 , p. 2, tel (495) 974-7401.</p>\n\n<p>The value of investments may increase or decrease, the results Past performance is not indicative of future results, the state does not guarantee the return on investments in mutual funds.</p>","image":null,"offices":[{"description":"HQ","address1":"Table lane, 6","address2":"","zip_code":"121061","city":"Moscow","state_code":null,"country_code":"RUS","latitude":null,"longitude":null}],"relationships":[],"investments":[{"funding_round":{"round_code":"unattributed","source_url":"http://www.marketwire.com/press-release/Cleveland-BioLabs-Announces-Launch-Incuron-Joint-Venture-Develop-Curaxin-Compounds-NASDAQ-CBLI-1162076.htm","source_description":"Cleveland BioLabs Announces Launch of Incuron Joint Venture to Develop Curaxin Compounds","raised_amount":5700000,"raised_currency_code":"USD","funded_year":2010,"funded_month":4,"funded_day":26,"company":{"name":"Incuron","permalink":"incuron","image":null}}}],"milestones":[{"description":"Bioprocess Capital Joins With Cleveland BioLabs in $18m Joint Venture\r\n","stoned_year":2010,"stoned_month":null,"stoned_day":null,"source_url":"http://www.invest-iq.com/Bioprocess-Capital-Ventures-invests-Cleveland-BioLabs","source_text":null,"source_description":"Bioprocess Capital Joins With Cleveland BioLabs in $18m Joint Venture ","stoneable_type":"FinancialOrg","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"name":"Bioprocess Capital Ventures","permalink":"bioprocess-capital-ventures"}}],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}