{"name":"BonVenture","permalink":"bonventure","crunchbase_url":"http://www.crunchbase.com/financial-organization/bonventure","homepage_url":"http://www.bonventure.de/","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"+49 (89) 2 00 01 25-30","description":"Venture Capital Firm","email_address":"info@bonventure.de","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":null,"alias_list":"","created_at":"Wed Jul 07 21:45:25 UTC 2010","updated_at":"Fri Sep 03 08:08:22 UTC 2010","overview":"<p>Fund and Foundation for Social Responsibility</p>\n\n<p>Commitments to companies and organizations with a social purpose in German-speaking countries.</p>\n\n<p>Mission of BonVenture</p>\n\n<p>In view of increasing social and ecological problems and growing public sector deficits, BonVenture was established by individuals willing to take responsibility for the community. This sense of responsibility stems from, among other reasons, the social obligations which come with prosperity. These individuals will use their available material and intellectual means to advocate efficient solutions for social and ecological problems. At the same time, they aim to encourage other citizens to contribute to and even to replicate these solutions.\nThe activities of BonVenture and its supported projects will contribute to the improvement of the efficiency of the social welfare system through new private entrepreneurial organizations and competition. In addition, BonVenture strives to improve the transparency of the social sector and, with this model, hopes to inspire other similar funds.</p>\n\n<p>Humanity and Economic Efficiency</p>\n\n<p>BonVenture&#8217;s goal is to tackle social, societal and ecological problems and to contribute to the reduction of these problems, to improve the efficiency and transparency in the social sector and to set an example for social investments by combining humanity and economic efficiency.\nTo achieve this, BonVenture applies proven Venture Capital techniques to the social sector. BonVenture provides its projects with long-term financial resources as well as a network and professional support. In addition, BonVenture develops and applies initiatives to improve the transparency and the communicability of the social impact of these projects.\nBonVenture&#8217;s main objective is to reduce social, societal and ecological problems in German-speaking countries and to promote social responsibility in a time when existing systems often fail to perform their tasks due to a lack of financial resources and innovation.\nWhile Socially Responsible Venture Capital is already established in the United States, the BonVenture Group is one of the first vehicles of its kind in the German-speaking part of the world. It provides private equity as well as active management support to social projects and is at the same time a non-profit activity for its investors.</p>","image":{"available_sizes":[[[150,35],"assets/images/resized/0010/0431/100431v1-max-150x150.jpg"],[[212,50],"assets/images/resized/0010/0431/100431v1-max-250x250.jpg"],[[212,50],"assets/images/resized/0010/0431/100431v1-max-450x450.jpg"]],"attribution":null},"offices":[{"description":"HQ","address1":"Pettenkoferstrasse 37","address2":"","zip_code":"D-80336","city":"Munich","state_code":null,"country_code":"DEU","latitude":null,"longitude":null}],"relationships":[],"investments":[{"funding_round":{"round_code":"b","source_url":"","source_description":"Cap Funding Report","raised_amount":6030000,"raised_currency_code":"USD","funded_year":2010,"funded_month":6,"funded_day":9,"company":{"name":"Bettermarks","permalink":"bettermarks","image":{"available_sizes":[[[150,55],"assets/images/resized/0009/2715/92715v2-max-150x150.jpg"],[[250,91],"assets/images/resized/0009/2715/92715v2-max-250x250.jpg"],[[397,146],"assets/images/resized/0009/2715/92715v2-max-450x450.jpg"]],"attribution":null}}}}],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}