{"name":"CIIE","permalink":"ciie","crunchbase_url":"http://www.crunchbase.com/financial-organization/ciie","homepage_url":"http://www.re-search.in","blog_url":"http://greenalpha.blogspot.com","blog_feed_url":"","twitter_username":"","phone_number":"","description":"Seed funding & mentoring for CleanTech ","email_address":"info@re-search.in","number_of_employees":20,"founded_year":2002,"founded_month":1,"founded_day":null,"tag_list":"seed-funding, clean-tech, renewable-energy, india, iim-ahmedabad, re-search, government-of-india, venture-funding","alias_list":null,"created_at":"Wed Aug 19 15:34:03 UTC 2009","updated_at":"Wed Aug 19 17:29:34 UTC 2009","overview":"<p>RE-Search is a joint initiative of IIM Ahmedabad&#8217;s Centre for Innovation Incubation and Entrepreneurship and Ministry of New and Renewable Energy, Government of India</p>\n\n<p>Renewable Energy Search is an endeavour by IIM Ahmedabad&#8217;s Centre for Innovation, Incubation and Entrepreneurship (CIIE) and Ministry of New and Renewable Energy (Government of India) to identify, encourage and incubate entrepreneurial ideas aimed at solving the energy crisis in the country through creation of viable business models around existing clean energy related technologies.</p>\n\n<p>The program aims at commercializing scalable existing technologies developed by innovators (researchers, individual inventors, start-ups and large corporations) across the world through creation of a viable business around it. The program is focused on supporting entrepreneurial ideas in the energy generation, efficiency and storage space rather than fundamental research.</p>\n\n<p>The program shall provide support recognition, licensing, seed-funding and mentoring to the following groups:</p>\n\n<p>Start-ups\nTechnology-based early stage start-ups in the area of renewable energy (even pre-revenue) with viable business model and complimentary team shall be directly eligible for incubation and funding support. The start-up should be aiming to disseminate and deploy a clean energy technology-based product in the market rather than researching a new technology from scratch.</p>\n\n<p>Entrepreneurs-in-residence\nBudding entrepreneurs interested in setting up their venture in this growing sector, but not having yet narrowed down on their business idea, shall get to spend 3-4 months with the program as an EIR to identify a proven technology around which they would like to build their venture. Having done that, the EIR shall create a business plan and build a complimentary team around the idea. EIRs with most viable plans shall be provided funding and incubation support under the program.</p>\n\n<p>Innovators\nInnovators (researchers at institutes, corporations, individual inventors etc) interested in commercializing their research work through creation of an enterprise or licensing shall be considered for the &#8220;Top Innovator Award&#8221; apart from incubation and funding or upside from licensing of the technology.</p>","image":{"available_sizes":[[[150,96],"assets/images/resized/0005/7050/57050v2-max-150x150.jpg"],[[227,146],"assets/images/resized/0005/7050/57050v2-max-250x250.jpg"],[[227,146],"assets/images/resized/0005/7050/57050v2-max-450x450.jpg"]],"attribution":null},"offices":[{"description":"Re-Search","address1":"CIIE, New Campus,","address2":"IIM Ahmedabad, Vastrapur","zip_code":"380015","city":"Ahmedabad","state_code":null,"country_code":"IND","latitude":null,"longitude":null}],"relationships":[],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[{"external_url":"http://www.indianexpress.com/news/thumbs-up-for-world-environment-day-initiatives/472138/2","title":"Article in popular Indian newspaper"}]}