{"name":"CPMI Professional Development","permalink":"cpmi-professional-development","crunchbase_url":"http://www.crunchbase.com/financial-organization/cpmi-professional-development","homepage_url":"http://www.cpmipro.com/","blog_url":"http://www.cpmipro.com/insurance-career.htm","blog_feed_url":"","twitter_username":"","phone_number":"877-601-2273","description":"CPMI Insurance License Training","email_address":"info@cpmipro.com","number_of_employees":null,"founded_year":1998,"founded_month":null,"founded_day":null,"tag_list":"securities-license, insurance-license, securities-licensing, insurance-licensing, insurance-continuing-education, insurance-school, insurance-exam, insurance-ce, insurance-training, professional-education, professional-training","alias_list":null,"created_at":"Wed Mar 30 17:04:20 UTC 2011","updated_at":"Tue Apr 05 22:56:23 UTC 2011","overview":"<p>CPMI Professional Development is a leading provider of insurance training services nationwide, offering insurance licensing and insurance continuing education training in all 50 states.</p>\n\n<p>CPMI Professional Development, Inc. has been aiding candidates organise to take and go beyond the stateProperty and Casualty License or Life and Health Insurance License exam since 1998. Our multi-media elements have been confirmed winning, appropriate, and time effective.</p>\n\n<p>Realizing the want for indemnity managers to have coaching obtainable after a maker nominated applicant presentations onvolvement in noting with a financial gathering, CPMI deduced a video seminar whole with videos, workbooks and audio CDs, letting managers to have a worth self-study, classroom-like seminar obtainable on demand. Later, we adjoined the Exam Advantage investigate imitation disc storage invention, which renders candidates rehearse replying challenge sort questions. In 2005, at the appeal of a greatest indemnity financial gathering and in an effort to get concurrently the assorted wants of certificate candidates, CPMI deduced theEnglish/Spanish on-line books program.\nRecognizing the developing onvolvement in on-line way frontwards, CPMI adjoined on-line way frontwards in 2009, which embraces our text, video, and investigate imitation programs and has promptly propagated to be our most admired study method.</p>\n\n<p>CPMI Professional Development, Inc. now bids indemnity pre-license and carrying on training study elements for more states and supplementary elements for all states. We work with and give the certificate coaching elements for several countrywide indemnity financial gatherings, indemnity schools and colleges/universities.</p>\n\n<p>Please let us recognise how we can be of help to you. Using our elements will give your candidates the Exam Advantage!</p>","image":null,"offices":[{"description":"World Headquarters","address1":"613 Countryside Drive","address2":"","zip_code":"61548","city":"Germantown Hills","state_code":"IL","country_code":"USA","latitude":null,"longitude":null}],"relationships":[],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}