{"name":"Daiwa Securities Group","permalink":"daiwa-securities-group","crunchbase_url":"http://www.crunchbase.com/financial-organization/daiwa-securities-group","homepage_url":"http://www.daiwa-grp.jp/","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"+81-3-5555-1300","description":"","email_address":"ir-section@dsgi.daiwa.co.jp","number_of_employees":300,"founded_year":1999,"founded_month":4,"founded_day":6,"tag_list":null,"alias_list":"","created_at":"Sat Jun 27 02:54:15 UTC 2009","updated_at":"Sat Sep 11 12:02:53 UTC 2010","overview":"<p>Daiwa Securities Group Inc. operates as a securities brokerdealer, providing services, including brokerage, trading, underwriting, advice, product development, and structured finance. The company provides asset and capital management, principal investment, venture capital, and research through a network in capital markets and other services. The company operates subsidiaries in three core business segments, including retail securities, wholesale securities &amp; investment, and asset management providing services that help customers in Japan and overseas to address their investment and capital procurement needs. Retail The company provides assortment of financial products and services, including face-to-face consulting and services provided over the Internet, mainly to individual investors and unlisted companies. Wholesale &amp; Investments Daiwa Securities SMBC Co Ltd.: Daiwa Securities SMBC Co Ltd. utilizes financial and capital markets to help corporations and institutional investors in Japan and overseas to identify a solution to their financing or investment needs. Daiwa Securities SMBC Principal Investments Co. Ltd.: Daiwa Securities SMBC Principal Investments Co. Ltd. is responsible for the Group’s investment activities, employing the Group’s own capital in private equity, real estate, and other investments. The company also develops and operates investment funds. Daiwa SMBC Capital Co., Ltd.: Daiwa SMBC Capital Co., Ltd. focuses on venture capital investments. Asset Management Daiwa Asset Management Co. Ltd.: Daiwa Asset Management Co. Ltd. operates as an asset management company which establishes and manages investment trusts with various investment targets or investment themes, and markets them. Daiwa SB Investments Ltd.: Daiwa SB Investments Ltd. handles asset management operations for the Daiwa Securities Group and the Sumitomo Mitsui Financial Group, providing pension fund management, and other services for institutional investors in Japan and overseas. The company also develops and manages investment trusts. Research, Consulting and Systems Daiwa Institute of Research Ltd.: Daiwa Institute of Research Ltd. provides research, consulting, and systems support operations for the Daiwa Securities Group. The company studies and provides basic information, and offers recommendations to support the Group’s business expansion, and provides systems support services. Daiwa Institute of Research Business Innovation Ltd.: Daiwa Institute of Research Business Innovation Ltd. provides systems support service to companies outside the Daiwa Securities Group. The company serves clients as a partner in IT development and support, providing industry solutions. History Daiwa Securities Group Inc. was founded in 1902.</p>","image":{"available_sizes":[[[115,63],"assets/images/resized/0005/1062/51062v2-max-150x150.jpg"],[[115,63],"assets/images/resized/0005/1062/51062v2-max-250x250.jpg"],[[115,63],"assets/images/resized/0005/1062/51062v2-max-450x450.jpg"]],"attribution":null},"offices":[{"description":"","address1":"9-1, Marunouchi 1-chome","address2":"Chiyoda-ku","zip_code":"100-6751","city":"Tokyo","state_code":null,"country_code":"JPN","latitude":null,"longitude":null}],"relationships":[{"is_past":false,"title":"Shigeharu Suzuki","person":{"first_name":"Shigeharu","last_name":"Suzuki","permalink":"shigeharu-suzuki","image":null}},{"is_past":true,"title":"CTO - Global Asset Services","person":{"first_name":"Kevin","last_name":"Magee","permalink":"kevin-magee-2","image":null}}],"investments":[{"funding_round":{"round_code":"e","source_url":"http://www.somanetworks.com/20080718.html","source_description":"SOMA Networks Secures Additional $51 Million in Financing","raised_amount":51000000,"raised_currency_code":"USD","funded_year":2008,"funded_month":7,"funded_day":18,"company":{"name":"Soma Networks","permalink":"soma-networks","image":{"available_sizes":[[[150,76],"assets/images/resized/0005/1055/51055v1-max-150x150.png"],[[183,93],"assets/images/resized/0005/1055/51055v1-max-250x250.png"],[[183,93],"assets/images/resized/0005/1055/51055v1-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}