{"name":"DeSilva+Phillips","permalink":"desilva-phillips","crunchbase_url":"http://www.crunchbase.com/financial-organization/desilva-phillips","homepage_url":"http://www.desilvaphillips.com","blog_url":"","blog_feed_url":"","twitter_username":"Mediabankers","phone_number":"212-686-9700","description":"Boutique media investment bank","email_address":"jack@desilvaphillips.com.com","number_of_employees":null,"founded_year":1996,"founded_month":null,"founded_day":null,"tag_list":"investment-bank, mergers-acquisitions, media","alias_list":"","created_at":"Fri May 04 03:13:29 UTC 2012","updated_at":"Fri May 04 03:13:29 UTC 2012","overview":"<p>DeSilva+Phillips, LLC, Media Investment Bankers (aka &#8220;DeSilva &amp; Phillips&#8221;, &#8220;D&amp;P, &#8220;D+P&#8221; or &#8220;Mediabankers&#8221;) is a New York-based M&amp;A advisory firm, specializing in the media, communications and digital media and technology industries. </p>\n\n<p>Since 1995, D+P has completed over 210 transactions for clients that have ranged from large media conglomerates to early stage entrepreneurial ventures, in addition to the full spectrum of financial sponsors (private equity groups, venture capital firms, and lender groups). </p>\n\n<p>History:\nD+P was founded in 1995 by Roland DeSilva and Reed Phillips.  Both Mr. DeSilva and Mr. Phillips had previously risen through the ranks of media companies as operators and executives.  In the earlier years, D+P focused primarily on B2B and consumer publishing M&amp;A transactions. Over the years, D+P has added new Partners and Managing Directors to expand the depth and breadth of its investment banking practice and field of expertise, particularly in digital media and technology as well as in marketing services. </p>\n\n<p>D+P now has 15 M&amp;A professionals with all but three working out of the New York office on Park Avenue South at 32nd Street.  Nearly every M&amp;A professional at D+P joined the firm after first building a career in media.  D+P&#8217;s team is now comprised of former CEOs, company owners, online entrepreneurs and executives, magazine, medical journal and book publishers, and trade show operators as well as financial, advertising and marketing executives.</p>\n\n<p>D+P provide four main services:</p>\n\n<p>1)  Sell-side and Buy-side Mergers and Acquisitions \nThe core business of D+P is providing advisory work on sell-side M&amp;A transactions.  This can take the form of the divestiture of a division or portfolio company, as well as the sale of businesses by their owners.  In addition to sell-side advisory, D+P provides buy-side counsel for a number of strategic and financial buyers.  In these instances, D+P typically seeks out the acquisition target and brokers the transaction.</p>\n\n<p>2)  Corporate Finance \nD+P provides counsel in a range of financial transactions.  These can include capital raises, refinancing, and debt restructuring.  D+P does not invest, act as a lender, advise on investments or publish securities research.  DeSilva + Phillips Corporate Finance, LLC is a member of FINRA and SIPC.</p>\n\n<p>3)  Operational Restructuring\nDeSilva+Phillips formally established its operational restructuring practice in 2009 to provide counsel on a range of organizational and structural issues that assist clients in identifying and analyzing challenging corporate performance and capital structures. </p>\n\n<p>4)  Valuations \nClients seek valuations from DeSilva+Phillips for a variety of reasons, including assessing the value of a property as part of a decision to acquire, divest, or refinance.  These services are also requested in conjunction with legal disputes.  Valuation clients have included company owners and investors, private equity firms, lenders and legal advisors. </p>","image":{"available_sizes":[[[150,112],"assets/images/resized/0018/7801/187801v1-max-150x150.png"],[[250,187],"assets/images/resized/0018/7801/187801v1-max-250x250.png"],[[250,187],"assets/images/resized/0018/7801/187801v1-max-450x450.png"]],"attribution":null},"offices":[{"description":"Headquarters","address1":"475 Park Avenue South","address2":"22nd Floor","zip_code":"10016","city":"New York","state_code":"NY","country_code":"USA","latitude":null,"longitude":null}],"relationships":[{"is_past":false,"title":"Managing Director","person":{"first_name":"Lora","last_name":"Lindsey","permalink":"lora-lindsey","image":{"available_sizes":[[[101,150],"assets/images/resized/0019/2006/192006v2-max-150x150.jpg"],[[169,250],"assets/images/resized/0019/2006/192006v2-max-250x250.jpg"],[[305,450],"assets/images/resized/0019/2006/192006v2-max-450x450.jpg"]],"attribution":""}}}],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}