{"name":"Egret Capital Partners","permalink":"egret-capital-partners","crunchbase_url":"http://www.crunchbase.com/financial-organization/egret-capital-partners","homepage_url":"http://www.egretcapital.com","blog_url":"","blog_feed_url":"","twitter_username":null,"phone_number":"(212) 673-8600","description":null,"email_address":"info@egretcapital.com","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":null,"alias_list":null,"created_at":"Thu Aug 21 05:07:11 UTC 2008","updated_at":"Mon Dec 01 10:52:20 UTC 2008","overview":"<p>Egret was formed by a team of industry veterans, nationally recognized principals from some of the most renowned investment firms in the world. With strong complimentary skill sets, Egret’s partners’ capabilities stem from their deep backgrounds in corporate strategy, operational management, financial structuring and entrepreneurial investing. These skills, combined with over a quarter of a billion dollars in personal assets, are what Egret brings to every one of its carefully chosen investments.</p>\n\n<p>Because they are a closely held partnership, they value integrity, confidentiality and discretion above all else. When they begin working on a potential relationship, there are no press releases, leaks or public announcements. They are happy to sign confidentiality agreements, and insist that all discussions are conducted out of the public glare.</p>\n\n<p>In a world of increasingly transient investment vehicles, the principals of Egret are widely known and respected, with many decades of combined experience in founding, funding, and adding value to companies. They live by their reputations, and would be pleased to refer potential partners to the executives who have done business with them. They assure you that the results of any background check will be stellar. That promise is a stark and simple indication of the respect with which they interact with others, and the experiences that they have had with them.</p>\n\n<p>Many institutions and organizations are available to provide capital for expanding businesses. What sets Egret apart is their commitment to leverage their skills for the benefit of the company through the comprehensive, structured, value-added approach they bring to their investments.</p>\n\n<p>Their process begins with a very careful selection of opportunities. Rather than go broad, they go deep. Before Egret considers an investment they look at every facet of a business, from management to markets, and from products to performance. But numbers are not the only metric they consider, because while important, they rarely tell the full story.</p>\n\n<p>Egret looks beyond a company’s recent financial statements to understand its true potential for the long term. Like their namesake, they are patient and willing to invest their capital and themselves in working with a management team to create substantial enterprise value. At the same time, they have the expertise to move quickly and decisively when the occasion warrants.</p>\n\n<p>Because they highly value strong management teams, it is their philosophy to provide significant financial incentives to a company’s leadership, so that those who contribute to the organization’s equity growth are the ones who directly benefit from it. Their experience in hundreds of deals has given them the ability to consistently deliver win-win solutions that benefit a company’s equity owners, its management, its customers and themselves.</p>\n\n<p>Once their financial investment is complete, their involvement is just beginning. They work with the managers they are backing to develop appropriate strategies for growth, to implement operational improvements, and to identify add-on acquisition opportunities. In addition, once they have closed on their investments, management may take advantage of their broad and deep base of contacts among journalists and analysts.</p>\n\n<p>They focus on the effective execution of the organization’s strategy. They have been managers themselves, in companies ranging from manufacturing and production to mobile media and financial services, and are deeply familiar with the challenges that face corporate management in the twenty-first century.</p>","image":{"available_sizes":[[[150,32],"assets/images/resized/0003/0434/30434v1-max-150x150.jpg"],[[250,53],"assets/images/resized/0003/0434/30434v1-max-250x250.jpg"],[[350,75],"assets/images/resized/0003/0434/30434v1-max-450x450.jpg"]],"attribution":null},"offices":[{"description":"","address1":"30 East 23rd Street","address2":"8th Floor","zip_code":"10010-4439","city":"New York","state_code":"NY","country_code":"USA","latitude":40.740512,"longitude":-73.987794}],"relationships":[{"is_past":false,"title":"Co-Founder & Chairman","person":{"first_name":"David S.","last_name":"Rose","permalink":"david-s-rose","image":{"available_sizes":[[[112,150],"assets/images/resized/0002/3933/23933v2-max-150x150.jpg"],[[187,250],"assets/images/resized/0002/3933/23933v2-max-250x250.jpg"],[[337,450],"assets/images/resized/0002/3933/23933v2-max-450x450.jpg"]],"attribution":"<p>Christine Cain Weidner</p>"}}},{"is_past":false,"title":"Principals","person":{"first_name":"James","last_name":"Silver","permalink":"james-silver","image":null}},{"is_past":false,"title":"Principals","person":{"first_name":"Phyllis","last_name":"Haberman","permalink":"phyllis-haberman","image":null}},{"is_past":false,"title":"Principals","person":{"first_name":"Peter","last_name":"Nager","permalink":"peter-nager","image":null}}],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}