{"name":"Gazelle Tech Ventures","permalink":"gazelle-tech-ventures","crunchbase_url":"http://www.crunchbase.com/financial-organization/gazelle-tech-ventures","homepage_url":"http://www.gazellevc.com/index.htm","blog_url":"","blog_feed_url":"","twitter_username":null,"phone_number":"","description":"Tech VC in Indiana","email_address":"","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":"","alias_list":"","created_at":"Mon Apr 20 15:09:24 UTC 2009","updated_at":"Tue Apr 21 20:59:17 UTC 2009","overview":"<p>Our objective at Gazelle TechVentures is to be the hub of venture capital activity in Indiana and one of the most respected, leading funds in the Midwest.</p>\n\n<p>The formation of the Gazelle Fund is the result of literally thousands of conversations over the past several years between entrepreneurs, government officials, University administration and faculty, private investors and business leaders about the need for more early stage and venture capital in Indiana. While the universities, local technology businesses and entrepreneurs continue to create attractive investing opportunities, Indiana lags in investing in those opportunities. The existence of a wide funding gap presents a tremendous investment opportunity for investors in the Gazelle Fund.</p>\n\n<p>Gazelle TechVentures, Inc. was created when a number of senior Indiana business leaders assembled to address the funding gap as a business opportunity. This group set out to create an aggressive and well-capitalized venture capital company based on the best national models of success. As members of the General Partner&#8217;s Executive Committee they have committed their time and their capital to the objective of making Gazelle &#8220;The hub of venture capital activity in Indiana and one of the most respected, leading funds in the Midwest.&#8221;</p>","image":null,"offices":[{"description":"","address1":"11611 N. Meridian St., Suite 310 ","address2":"","zip_code":"46032","city":"Carmel","state_code":"IN","country_code":"USA","latitude":39.957067,"longitude":-86.15631}],"relationships":[],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}