{"name":"High Street Partners","permalink":"high-street-partners","crunchbase_url":"http://www.crunchbase.com/financial-organization/high-street-partners","homepage_url":"http://www.highstreet-partners.com/","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"410-263-7400 ","description":"Venture Capital Firm","email_address":"","number_of_employees":null,"founded_year":2003,"founded_month":null,"founded_day":null,"tag_list":null,"alias_list":"","created_at":"Wed Sep 08 19:19:14 UTC 2010","updated_at":"Sat Sep 18 17:17:46 UTC 2010","overview":"<p>High Street Partners, Inc. provides cross-border finance and administrative services to companies with new or existing operations in the United Kingdom and internationally. It offers assistance with the implementation and ongoing management of international subsidiaries and other entities by providing entity set-up, payroll, accounting, tax compliance, advisory, and human resource localization services. The company recommends HSP Overseas Direct, a service for setting up and managing the normal recurring finance and administrative activities of clients with existing operations overseas or cross-border expansion plans; and offers HSP Global Assessment service for clients with existing overseas entities that are in need of a health check for compliance risks and change implementation. High Street Partners, Inc. also provides advisory services for establishing international entities and organizational structures, international logistics, employee benefits and pension plans, expatriate assignments, stock option plans, tax minimization strategies, VAT/GST, transfer pricing and inter-company agreements, and international cash management approaches, as well as develops and supports international expansion plans for companies. Its service engagements range from helping clients to establish a single overseas sales office to assisting in managing subsidiaries on various continents. The company’s clients include local service providers, venture capital companies, accounting firms, commercial banks, and law firms. High Street Partners, Inc. was incorporated in 2003 and is based in Annapolis, Maryland with additional offices in Boston, Massachusetts; Annapolis, Maryland; McLean and Arlington, Virginia; New York, New York; Austin, Texas; San Jose, San Diego, and Silicon Valley, California; and London, the United Kingdom. The company has a regional operations center in Miami, Florida.</p>","image":{"available_sizes":[[[150,27],"assets/images/resized/0010/2222/102222v1-max-150x150.jpg"],[[250,45],"assets/images/resized/0010/2222/102222v1-max-250x250.jpg"],[[350,63],"assets/images/resized/0010/2222/102222v1-max-450x450.jpg"]],"attribution":null},"offices":[{"description":"HQ","address1":"222 Severn Avenue ","address2":"Building 14 Suite 100 ","zip_code":"21403","city":"Annapolis","state_code":"MD","country_code":"USA","latitude":null,"longitude":null}],"relationships":[],"investments":[{"funding_round":{"round_code":"unattributed","source_url":"http://www.extraprise.com/company_archive/pr_08232005.htm","source_description":"Extraprise Closes Venture Financing to Support Expansion","raised_amount":5100000,"raised_currency_code":"USD","funded_year":2005,"funded_month":8,"funded_day":23,"company":{"name":"Extraprise","permalink":"extraprise","image":{"available_sizes":[[[121,145],"assets/images/resized/0010/0998/100998v1-max-150x150.png"],[[121,145],"assets/images/resized/0010/0998/100998v1-max-250x250.png"],[[121,145],"assets/images/resized/0010/0998/100998v1-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}