{"name":"Inerjys","permalink":"inerjys","crunchbase_url":"http://www.crunchbase.com/financial-organization/inerjys","homepage_url":"http://www.inerjys.com","blog_url":"","blog_feed_url":"","twitter_username":"inerjys","phone_number":"514-875-0005","description":"","email_address":"info@inerjys.com","number_of_employees":10,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":"renewable-energy, cleantech, clean-tech, clean-technology, solar, wind, tidal-energy, biofuels, wave-energy, storage, transmission, distribution, transmission-and-distribution","alias_list":null,"created_at":"Wed Jul 27 17:24:34 UTC 2011","updated_at":"Sat Jun 09 22:52:23 UTC 2012","overview":"<p>Inerjys Ventures is a $1B clean energy fund, focused on renewables; specifically, wind, solar, biofuels and marine energy as well storage and distribution technologies. We seek out companies with disruptive technologies and provide them with the growth equity financing they need to turn into game-changing companies.</p>\n\n<p>Inerjys was born out of a simple concept. Renewables represent 5% of the global energy market. We intend to push it to 85% over the next ten years. To achieve this goal, both innovation and energy deregulation must be addressed in parallel. Innovation; VCs have declining returns and are less inclined to invest in capital intensive energy markets. Corporate VCs are making strategic investments but remain systemically constrained. Energy deregulation; as in Telecoms, there is a trend towards increased competition which will lead to multi-country utilities focused on renewables. The Vodafone model. Inerjys Ventures will fund technologies that will produce 10x energy outputs for one tenth the cost. Our infrastructure arm will build projects to deploy these very same technologies. </p>\n\n<p>Inerjys is not a cleantech VC. It makes strategic investments. The ultimate value add an investor can bring beyond growth capital, is direct market validation, leading to revenues and profitability. This is less dilutive and tends to produce happier entrepreneurs and healthier companies.</p>\n\n<p>By building infrastructure, we actively seek to employ the technologies in the funds portfolio, in large-scale renewable-energy projects. This field expertise allows us to select the most valuable investments for growing the entire clean-energy value chain. By synthesizing the groundbreaking new technologies into lucrative infrastructure projects, we aim to make clean energy abundant, affordable, now.</p>","image":{"available_sizes":[[[150,99],"assets/images/resized/0014/6479/146479v2-max-150x150.png"],[[250,165],"assets/images/resized/0014/6479/146479v2-max-250x250.png"],[[320,212],"assets/images/resized/0014/6479/146479v2-max-450x450.png"]],"attribution":null},"offices":[{"description":"HQ","address1":"279 Rue Prince","address2":"","zip_code":"H3C 2N4","city":"Montreal","state_code":null,"country_code":"CAN","latitude":null,"longitude":null}],"relationships":[{"is_past":false,"title":"CEO/President/Managing Partner","person":{"first_name":"Stephan","last_name":"Ouaknine","permalink":"stephan-ouaknine","image":null}}],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[{"external_url":"http://slidesha.re/qgTPpH","title":""}]}