{"name":"Inveready Capital Advisory","permalink":"inveready-2","crunchbase_url":"http://www.crunchbase.com/financial-organization/inveready-2","homepage_url":"http://www.inveready.com","blog_url":"","blog_feed_url":"","twitter_username":"Inveready","phone_number":"","description":"","email_address":"info@inveready.com","number_of_employees":20,"founded_year":2007,"founded_month":null,"founded_day":null,"tag_list":"","alias_list":null,"created_at":"Sun Mar 20 17:12:16 UTC 2011","updated_at":"Sun May 01 06:45:48 UTC 2011","overview":"<p>Inveready Technology Investment Group is a leading provider in Spain of Corporate financial services and Capital for technology based startups.</p>\n\n<p>The group operates through three different companies: </p>\n\n<ul>\n<li>Inveredy Capital Company that provides corporate consulting services to start ups and specializes in brokering all sort of public funding instruments (mainly guarantee free debt) for technology based companies.</li>\n</ul>\n\n<p>Inveready Capital Company es una consultora con oficinas en Barcelona y Madrid que se especializa en financiación de empresas de base tecnológica. Inveready Capital ha intermediado para sus clientes un volumen de financiación en ayudas públicas y capital privado superior a los 100M€ desde su creación en 2007.</p>\n\n<p>Inveready Asset Management incluye las SCR Inveready Seed Capital e Inveready First Capital y una red propietaria de inversores privados.</p>\n\n<p>Inveready Seed Capital: Desde el inicio nos enfocamos en la aportación de nuestra experiencia en las empresas donde participamos y muy especialmente en la organización, planificación y estrategia financiera para la consecución de planes ambiciosos.</p>\n\n<p>Inveready First Capital: Especializada en inversiones en proyectos en fase pre semilla, es decir en compañías de muy reciente creación que, independientemente de su sector de actividad, cuenten con un modelo de negocio innovador, de rápido desarrollo e internacionalizable, tecnología propia o aspectos tecnológicos que las diferencien, así como una elevada capacidad de crecimiento.</p>\n\n<p>Inveready Investment Network: Red de business angels gestionada por Inveready Technology Group.</p>\n\n<p>Inveready tiene oficinas en Madrid y Barcelona.\nSpecialties</p>\n\n<p>Financiación, Start ups, Estrategia, Capital Riesgo </p>","image":{"available_sizes":[[[150,43],"assets/images/resized/0012/7001/127001v2-max-150x150.jpg"],[[250,71],"assets/images/resized/0012/7001/127001v2-max-250x250.jpg"],[[265,76],"assets/images/resized/0012/7001/127001v2-max-450x450.jpg"]],"attribution":null},"offices":[],"relationships":[],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}