{"name":"LG Innotek","permalink":"lg-innotek","crunchbase_url":"http://www.crunchbase.com/financial-organization/lg-innotek","homepage_url":"http://www.lginnotek.com/main.html","blog_url":"","blog_feed_url":"","twitter_username":null,"phone_number":"","description":"","email_address":"","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Mar 17 20:26:24 UTC 2009","updated_at":"Mon Apr 27 02:55:18 UTC 2009","overview":"<p>In the 21st-century digital era, fundamental changes in management paradigms are gathering speed, and only top-notch corporations can let their values shine through, fueling global competition. LG Innotek welcomes the relentless changes of this era as an opportunity to achieve success and innovation, driving top-tier management strategies in the world arena. In this way the company is committed to a future as a world-class digital leader.</p>\n\n<p>LG Innotek leads the drive to develop technology in cutting-edge electronics components and explore various markets. LG Innotek has eight core businesses (tuners, motors, power modules, LCD modules, camera modules, LEDs, MCMs, and Car Electronic Components) in four high-potential market categories (mobile, display, network, and car electronics).</p>\n\n<p>Notably, the company is further upgrading the technological levels of its competitive fields of digital tuners and small motors, backed by its solid market position and competitiveness. The fields of power modules and wireless telecommunications currently dominate the markets, aided by leading technological prowess. In addition, the company has boosted the competitiveness of its component device material fields of LEDs and MCMs, as well as venturing into the car electronic components market, thereby endeavoring to secure future growth engines.</p>\n\n<p>LG Innotek has been making bold R&amp;D investments to continue to pursue core digital technologies, as well as securing and nurturing superior human resources at home and abroad to lead the growth of its strategic businesses. Also, the company is proactively carrying out customized marketing efforts and customer-proposed R&amp;D activities, following the philosophy of putting customers first.</p>\n\n<p>Believing that customers are of the utmost value, LG Innotek applies faultless 6σ methods and skills to its entire business process, which involves not only products and services, but also production, R&amp;D, marketing and management. This serves to enhance the company’s global competitive edge. LG Innotek is committed to intensively driving its innovative activities to become a customer-oriented, dynamic, action-oriented, and stronger company. </p>","image":null,"offices":[],"relationships":[],"investments":[{"funding_round":{"round_code":"unattributed","source_url":"http://venturebeat.com/2009/03/04/siimpel-raises-undisclosed-round-for-low-power-micro-cameras/","source_description":"Siimpel raises undisclosed round for low-power micro-cameras","raised_amount":null,"raised_currency_code":"USD","funded_year":2009,"funded_month":3,"funded_day":4,"company":{"name":"Siimpel Corporation","permalink":"siimpel-corporation","image":{"available_sizes":[[[150,60],"assets/images/resized/0003/3303/33303v1-max-150x150.png"],[[217,87],"assets/images/resized/0003/3303/33303v1-max-250x250.png"],[[217,87],"assets/images/resized/0003/3303/33303v1-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}