{"name":"Li Ka Shing Foundation","permalink":"li-ka-shing-foundation","crunchbase_url":"http://www.crunchbase.com/financial-organization/li-ka-shing-foundation","homepage_url":"http://www.lksf.org","blog_url":"","blog_feed_url":"","twitter_username":null,"phone_number":"","description":null,"email_address":"general@lksf.org","number_of_employees":null,"founded_year":2006,"founded_month":10,"founded_day":1,"tag_list":null,"alias_list":null,"created_at":"Sat Jun 09 07:29:32 UTC 2007","updated_at":"Mon Nov 24 05:49:18 UTC 2008","overview":"<p>&#8220;To be able to contribute to society and to help those in need to build a better life, that is the ultimate meaning in life. I would gladly consider this to be my life&#8217;s work. &#8221;</p>\n\n<p>After a childhood of hardship and strife, forced to quit school at the age of 15 to provide for his family, Mr. Li Ka-shing persevered.</p>\n\n<p>Throughout his struggles, Mr. Li realized how vital quality education and healthcare are to the success of a family and society as a whole. Thereby, the twin pillars of education and health care have long been the foundation of Mr. Li’s charitable work.</p>\n\n<p>As his business blossomed, Mr. Li began to make strategic contributions to education and medical care projects in Hong Kong and mainland China. In 1980, the Li Ka Shing Foundation was set up to enhance the impact of its philanthropy through two strategic objectives: to nurture a culture of giving and to foster creativity, constructive engagement, and sustainability through supporting capacity empowerment focused projects.</p>\n\n<p>The Li Ka Shing Foundation and other private charitable foundations established by Mr. Li support numerous charitable activities with grants, sponsorships, and commitments of HK$10.7 billion (US$1.37 billion). The Cheung Kong Group of companies also makes many contributions under the procurement efforts of Mr. Li.</p>","image":{"available_sizes":[[[150,32],"assets/images/resized/0002/9374/29374v1-max-150x150.jpg"],[[250,54],"assets/images/resized/0002/9374/29374v1-max-250x250.jpg"],[[296,65],"assets/images/resized/0002/9374/29374v1-max-450x450.jpg"]],"attribution":null},"offices":[{"description":"","address1":"7/F Cheung Kong Center","address2":"2 Queen’s Road Central","zip_code":"","city":"Hong Kong","state_code":null,"country_code":"HKG","latitude":null,"longitude":null}],"relationships":[],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}