{"name":"Lone Pine Capital","permalink":"lone-pine-capital","crunchbase_url":"http://www.crunchbase.com/financial-organization/lone-pine-capital","homepage_url":"http://www.lonepinecapital.com","blog_url":"","blog_feed_url":"","twitter_username":null,"phone_number":"","description":null,"email_address":"","number_of_employees":null,"founded_year":1997,"founded_month":null,"founded_day":null,"tag_list":null,"alias_list":null,"created_at":"Sun Aug 31 03:11:49 UTC 2008","updated_at":"Tue Nov 25 03:45:21 UTC 2008","overview":"<p>Lone Pine Capital was started in 1997 by Steven Mandel, formerly a managing director and analyst at Tiger Management for a period of 7 years. According to the December 4, 2006 issue of Barron&#8217;s, Mandel now manages $8 Billion and has returned over 25% annually since his fund’s inception.</p>\n\n<p>Mandel made an appearance in Institutional Investor as one of the top paid hedge fund managers of 2005. Stephen Mandel Jr., the low-key president and founder of Greenwich, Connecticut–based Lone Pine Capital, returns a paltry 166 hits. Buying Google shares, however, has generated huge returns for many hedge fund managers, including Mandel. In 2005 the former Tiger Management Corp. retailing and consumer stock analyst made at least $500 million on his investment in the Mountain View, California–based search engine giant, his second-largest holding at year-end. That helped the 50-year-old long-short equity manager, who founded Lone Pine in 1997, break into the top ten hedge fund moneymakers.</p>\n\n<p>Mandel is arguably the most successful of the Tiger cubs who left legendary founder Julian Robertson Jr. to start their own funds. Last year his funds, which he names after trees, continued to rack up impressive returns. Lone Cypress was up 32 percent before fees, and Lone Kari surged 34 percent before fees. Mandel’s new long-only fund, Lone Cascade, was up 27 percent.</p>\n\n<p>Neither a growth nor a value investor, Mandel looks for good companies run by good people, with stock valuations below what he deems to be their intrinsic value. This search has taken him to high-fliers like Google as well as to homebuilders and foreign banks. Almost half of his assets are invested in non-U.S. stocks. Mandel has 12 investment professionals searching for ideas globally in seven broad industry groups — consumer, financial, health care, tele- communications and media, technology, business services and industrials.&#8221;</p>","image":null,"offices":[{"description":"","address1":"","address2":"","zip_code":"","city":"Greenwich","state_code":"CT","country_code":"USA","latitude":null,"longitude":null}],"relationships":[],"investments":[{"funding_round":{"round_code":"d","source_url":"http://news.cnet.com/8301-11128_3-10027510-54.html","source_description":"","raised_amount":300000000,"raised_currency_code":"USD","funded_year":2008,"funded_month":3,"funded_day":1,"company":{"name":"Nanosolar","permalink":"nanosolar","image":{"available_sizes":[[[150,30],"assets/images/resized/0000/2857/2857v1-max-150x150.png"],[[195,40],"assets/images/resized/0000/2857/2857v1-max-250x250.png"],[[195,40],"assets/images/resized/0000/2857/2857v1-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}