{"name":"Mahindra Group","permalink":"mahindra-group","crunchbase_url":"http://www.crunchbase.com/financial-organization/mahindra-group","homepage_url":"http://www.mahindra.com","blog_url":"http://mahindrauniverse.com/mahindra_universe/","blog_feed_url":"","twitter_username":"","phone_number":"91-22 -66483051 ","description":"","email_address":"customercare@mahindra.com","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":null,"alias_list":"","created_at":"Thu Jun 18 18:14:10 UTC 2009","updated_at":"Thu Jun 18 18:33:04 UTC 2009","overview":"<p>The US$ 6.3 billion Mahindra Group is among the top 10 industrial houses in India. Mahindra &amp; Mahindra is the only Indian company among the top three tractor manufacturers in the world. Mahindra&#8217;s Farm Equipment Sector has recently won the Japan Quality Medal, the only tractor company worldwide to be bestowed this honour. It also holds the distinction of being the only tractor company worldwide to win the Deming Prize. Mahindra is the market leader in multi-utility vehicles in India. It made a milestone entry into the passenger car segment with Logan.\nThe Group has a leading presence in key sectors of the Indian economy, including the financial services, trade and logistics, automotive components, information technology,infrastructure development and After-Market.\nWith over 62 years of manufacturing experience, the Mahindra Group has built a strong base in technology, engineering, marketing and distribution which are key to its evolution as a customer-centric organization. The Group employs over 50,000 people and has several state-of-the-art facilities in India and overseas.\nThe Mahindra Group has ambitious global aspirations and has a presence on five continents. Mahindra products are today available on every continent except Antarctica. M&amp;M has one tractor manufacturing plant in China, three assembly plants in the United States and one at Brisbane, Australia. It has made strategic acquisitions across the globe including Stokes Forgings (UK), Jeco Holding AG (Germany) and Schoneweiss &amp; Co GmbH (Germany). Its global subsidiaries include Mahindra Europe Srl. based in Italy, Mahindra USA Inc. and Mahindra South Africa.\nM&amp;M has entered into partnerships with international companies like Renault SA, France, and International Truck and Engine Corporation, USA. Forbes has ranked the Mahindra Group in its Top 200 list of the World&#8217;s Most Reputable Companies and in the Top 10 list of Most Reputable Indian companies. Mahindra has recently been honoured with the Bombay Chamber Good Corporate Citizen Award for 2006-07.</p>","image":{"available_sizes":[[[100,46],"assets/images/resized/0004/9480/49480v1-max-150x150.jpg"],[[100,46],"assets/images/resized/0004/9480/49480v1-max-250x250.jpg"],[[100,46],"assets/images/resized/0004/9480/49480v1-max-450x450.jpg"]],"attribution":null},"offices":[],"relationships":[],"investments":[{"funding_round":{"round_code":"a","source_url":"http://www.thealarmclock.com/mt/archives/2008/11/solar_home_ligh.html","source_description":"Solar Home Lighting's D.light Design Raises $6M","raised_amount":6000000,"raised_currency_code":"USD","funded_year":2008,"funded_month":11,"funded_day":10,"company":{"name":"D.light Design","permalink":"d-light-design","image":{"available_sizes":[[[138,91],"assets/images/resized/0004/9473/49473v1-max-150x150.png"],[[138,91],"assets/images/resized/0004/9473/49473v1-max-250x250.png"],[[138,91],"assets/images/resized/0004/9473/49473v1-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}