{"name":"Matrix-Executive","permalink":"matrix-executive","crunchbase_url":"http://www.crunchbase.com/financial-organization/matrix-executive","homepage_url":"http://www.matrix-exec.com","blog_url":"http://www.matrix-exec.com/blog.html","blog_feed_url":"","twitter_username":"philtertweets","phone_number":"+442071935756","description":"Venture Capital for recruitment business","email_address":"contact@matrix-exec.com","number_of_employees":3,"founded_year":2010,"founded_month":12,"founded_day":null,"tag_list":"venture-capital, funding, recruitment-startups, recruitment-expansion, recruitment-growth, mbo, mbi, recapitalization, acquisition, expansion, private-equity","alias_list":null,"created_at":"Tue May 03 18:23:30 UTC 2011","updated_at":"Fri May 13 13:45:16 UTC 2011","overview":"<p>Matrix-Exec Investment Partners are a specialist investment company. They provide recruitment entrepreneurs with funding, expertise and operational infrastructure, in return for an appropriate equity stake, in the following situations;</p>\n\n<p>·       Startups\n·       MBO’s &amp; MBI’s\n·       Recapitalisations\n·       Acquisitions\n·       Expansion</p>\n\n<p>Startups;\nThey provide opportunities for recruitment entrepreneurs to turn their successful personal brands and/or track records into independent growth businesses. They work closely with senior management teams to help; refine business models, company launch, support continuously and provide the entire infrastructure required to maintain a new recruitment venture. </p>\n\n<p>They bridge the gap between having the ambition and track record to start and run an independent, successful business and the financial commitment and knowledge required to make it a reality by providing investment, direction and full operational support. </p>\n\n<p>Existing Business;\nThey invest in existing recruitment businesses that require additional or alternative funding for growth and acquisition. They provide advice and expertise in strategic planning &amp; implementation, operations and process, market approach and social media. </p>","image":null,"offices":[],"relationships":[],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}