{"name":"Merchant Services Direct","permalink":"merchant-services-direct","crunchbase_url":"http://www.crunchbase.com/financial-organization/merchant-services-direct","homepage_url":"http://www.msdmerchants.com/","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"(509) 252-0282","description":"Payment Processing Company in Spokane","email_address":"shurley@msdnw.com","number_of_employees":20,"founded_year":2007,"founded_month":null,"founded_day":null,"tag_list":"merchant-services-provider, merchant-account-company, merchant-service-company","alias_list":null,"created_at":"Fri Nov 05 10:49:50 UTC 2010","updated_at":"Tue Nov 09 08:05:15 UTC 2010","overview":"<p>Headquartered in Spokane, Washington, Merchant Services Direct is a leading full service payment processing company. </p>\n\n<p>Regardless of the type and size of businesses, the merchant account company caters to a wide variety of clients. Whether it’s about financial payment processing or customer support, the service provider is continuously setting new standards for the merchant industry to follow. </p>\n\n<p>Advanced transaction equipment options at Merchant Services Direct utilize cutting edge technology. The Spokane-based company offers its clients easy-to-use administrative tools, an effective real time fraud management system, smooth account transition facilities and an effective reporting system among others. Apart from an innovative technology-based payment processing system, Merchant Services Direct offers an efficient round-the-clock customer support.</p>\n\n<p>By providing advanced transaction equipment options, Merchant Services Direct ensures that your business adheres to the strict compliance guidelines. The straightforward and fraud-proof payment processing system of the company fulfills all of your transactional requirements including credit card processing, debit card processing, check services, cash advance and ATM services among others. Through its entirely dependable payment processing services, the merchant account company aims to build long-term relationship with clients.</p>","image":null,"offices":[{"description":"Merchant Services Direct","address1":"9212 E. Montgomery","address2":"","zip_code":"99206","city":"Spokane, WA","state_code":"WA","country_code":"USA","latitude":null,"longitude":null}],"relationships":[],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[{"external_url":"http://www.prweb.com/releases/2011/8/prweb8749069.htm","title":"Inc 500"}]}