{"name":"Mobius Corporate Venture Capital","permalink":"mobius-corporate-venture-capital","crunchbase_url":"http://www.crunchbase.com/financial-organization/mobius-corporate-venture-capital","homepage_url":"http://www.mobius.es","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"+34915550069","description":"VC funds management company","email_address":"informacion@mobius.es","number_of_employees":null,"founded_year":2003,"founded_month":null,"founded_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Sep 07 15:27:58 UTC 2010","updated_at":"Tue Sep 07 23:02:15 UTC 2010","overview":"<p>Möbius Corporate Venture Capital SGECR SA is a Spanish Venture Capital Management Company fully authorised by the Spanish Minister of Economy following the recommendation made by the Spanish Securities and Exchange Commission or CNMV. It has been legally registered with the CNMV on 28th November 2003 and operates under its continuous supervision.</p>\n\n<p>Our team comprises highly qualified and experienced professionals led by Mr. Juan Soto (former CEO of Hewlett-Packard Spain and former Chairman of Hewlett-Packard Spain, Portugal and France) and Mr. José Luis Cayuela (former CEO of Cap Gemini Telecom Media Networks and former Partner of Ernst &amp; Young Consulting).</p>\n\n<p>Our goal is to achieve superior medium and long-term capital appreciation for our investors through investing in Spanish small and medium-sized companies and in a tax efficient manner. Möbius is an independent Private Equity Management Company which intends to finance the growth and development of this sector, the most dynamic of the Spanish economy, both through direct capital investments and offering continuous support and value creation services to its portfolio companies. </p>","image":null,"offices":[{"description":"Headquarters","address1":"Calle Núñez de Balboa, 120","address2":"","zip_code":"28006","city":"Madrid","state_code":null,"country_code":"ESP","latitude":null,"longitude":null}],"relationships":[],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}