{"name":"Net One Systems","permalink":"net-one-systems","crunchbase_url":"http://www.crunchbase.com/financial-organization/net-one-systems","homepage_url":"http://www.netone.co.jp/english/","blog_url":"","blog_feed_url":"","twitter_username":null,"phone_number":"","description":"","email_address":"","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Apr 20 17:59:25 UTC 2009","updated_at":"Tue Apr 28 03:44:20 UTC 2009","overview":"<p>To rapidly deliver solutions that meet the imperatives of the IT era-that&#8217;s the Net One Systems commitment. With that in mind, we have made the mainstay network integration operation in which we have amassed vast experience and expertise the core of our activities and established four integration business sectors: Network Integration, Network Computing, Service Integration, and Media Integration. Through these four business sectors and the efficient interplay of the solutions that underpin them, we will provide information systems adapted to the individual needs and activities of client companies.</p>\n\n<p>Network Integration (NI) Operation\nIn network construction, what is required above all is to implement a smooth traffic environment and deliver stable performance. Focusing on high-end router switching, the Network Integration Operation constructs and deploys efficient network infrastructure. The NI Operation capitalizes on the technological expertise and foresight cultivated since the company was founded to support clients&#8217; new business models.</p>\n\n<p>Network Computing (NC) Operation\nThe role of the Network Computing Operation is to dependably and rapidly implement applications used in the fast-developing Internet environment and e-commerce fields. Deploying solutions that make the most of leading-edge technologies such as traffic management and QoS, the NC Operation engages in such activities as installing and servicing evolving applications platforms, including security products and multimedia applications. We provide powerful support for expanding e-business environments.</p>\n\n<p>Service Integration (SI) Operation\nEverything from equipment selection at the time of network construction to design, construction, operation, maintenance and management-the Service Integration Operation provides fully integrated, end-to-end support for client networks. On the basis of providing protection around the clock, 365 days a year, we guarantee a reliable network environment by undertaking transaction monitoring, traffic management, and faulty equipment repair. What&#8217;s more, we also contribute to reducing operating costs by supporting traffic analysis and customer billing environments. The SI Operation provides services that truly meet client needs.</p>\n\n<p>Media Integration (MI) Operation\nTransmission line media are the most basic element of networks. Attendant on the rapid spread of business environments that utilize multimedia content, the construction of transmission line media tailored to client usage requirements has become an urgent task. For this reason, the Media Integration Operation provides across-the-board integration through every stage from design to installation of transmission line media that support diversifying sophisticated network infrastructure such as CATV and mobile communication devices.</p>","image":null,"offices":[],"relationships":[],"investments":[{"funding_round":{"round_code":"d","source_url":"","source_description":"","raised_amount":15000000,"raised_currency_code":"USD","funded_year":2009,"funded_month":4,"funded_day":20,"company":{"name":"Stoke","permalink":"stoke","image":{"available_sizes":[[[150,51],"assets/images/resized/0004/1935/41935v1-max-150x150.jpg"],[[208,72],"assets/images/resized/0004/1935/41935v1-max-250x250.jpg"],[[208,72],"assets/images/resized/0004/1935/41935v1-max-450x450.jpg"]],"attribution":null}}}},{"funding_round":{"round_code":"e","source_url":"http://www.finsmes.com/2011/01/stoke-raises-17m-in-series-e-funding.html","source_description":"Stoke Raises $17m in Series E Funding","raised_amount":17000000,"raised_currency_code":"USD","funded_year":2011,"funded_month":1,"funded_day":18,"company":{"name":"Stoke","permalink":"stoke","image":{"available_sizes":[[[150,51],"assets/images/resized/0004/1935/41935v1-max-150x150.jpg"],[[208,72],"assets/images/resized/0004/1935/41935v1-max-250x250.jpg"],[[208,72],"assets/images/resized/0004/1935/41935v1-max-450x450.jpg"]],"attribution":null}}}}],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}