{"name":"Place Trade Financial, Inc.","permalink":"place-trade-financial-inc","crunchbase_url":"http://www.crunchbase.com/financial-organization/place-trade-financial-inc","homepage_url":"http://www.placetrade.com","blog_url":"http://www.placetrade.com/blog","blog_feed_url":"http://www.us.placetrade.com/index.php/component/newsfeeds/newsfeed/28-joomla/2-blog","twitter_username":"PlaceTrade","phone_number":"919-719-7200","description":"Full Service & Online Trading Brokerage","email_address":"service@placetrade.com","number_of_employees":null,"founded_year":2001,"founded_month":null,"founded_day":null,"tag_list":"stocks, bonds, options, trading, investing, mutual-funds, full-service, advice, lowest-margin-rates, deep-discount-commissions, online-trading","alias_list":null,"created_at":"Sun Sep 16 20:31:53 UTC 2012","updated_at":"Mon Sep 24 16:35:23 UTC 2012","overview":"<p>Place Trade Financial, Inc., Member FINRA, SIPC, is a global full service, discount brokerage firm offering both full service financial advice and award winning online trading. (Best Online Broker, 4 Stars - Barron&#8217;s Magazine)</p>\n\n<p>Place Trade is a global full service, discount brokerage firm offering both online trading and trustworthy financial guidance. Clients may trade on their choice of over 100 market centers, 19+ countries, 17 currencies, 12 languages and a wide range of investment securities all through one account. Our unique structure allows us to offer clients as much or as little assistance as is desired.</p>\n\n<p>For clients that are looking for investment advice:</p>\n\n<p>Place Trade offers experienced financial consultants, a full range of products and services including an extensive fixed income desk, thousands of mutual funds,  ETFs, stocks, business retirement planning, voluntary group benefits and much more.</p>\n\n<p>Place Trade offers the lowest trading commissions and lowest margin rates of any national full service brokerage firm.</p>\n\n<p>For online traders, money, mutual and hedge fund managers: </p>\n\n<p>Barron&#8217;s Magazine awarded Place Trade 4 stars and a top ten ranking in their special report of the Best Online Brokers. In addition to receiving high marks from Barron&#8217;s in:</p>\n\n<p>Trading experience &amp; Tech \nPortfolio analysis &amp; Reports \nCustomer service &amp; Education, \nUsability &amp; Low cost</p>\n\n<p>Place Trade offers multiple state of the art highly customizable trading platforms, access to over 100 market centers worldwide, trading in your choice of languages and currencies as well as extensive option trading, stock yield enhancement, rebates on spreads/dark pools, VERIFIED price improvements, ultra-low margin rates and so much more.</p>\n\n<p>(API) or our for FIX CTCI connections:</p>\n\n<p>Place Trade provides alternatives for clients who prefer to access the Place Trade trading system using their own front end. Use our Place Trade Application Programming Interface (API) or our for FIX CTCI connections.</p>","image":{"available_sizes":[[[150,149],"assets/images/resized/0021/1558/211558v2-max-150x150.png"],[[176,175],"assets/images/resized/0021/1558/211558v2-max-250x250.png"],[[176,175],"assets/images/resized/0021/1558/211558v2-max-450x450.png"]],"attribution":null},"offices":[{"description":"Raleigh Branch Office","address1":"4030 Wake Forest Road","address2":"Suite 300","zip_code":"27609","city":"Raleigh","state_code":"NC","country_code":"USA","latitude":null,"longitude":null}],"relationships":[],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}