{"name":"Principal Financial Group","permalink":"principal-financial-group","crunchbase_url":"http://www.crunchbase.com/financial-organization/principal-financial-group","homepage_url":"http://www.principal.com/index.shtm","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"1.800.986.3343  ","description":"Venture Capital Firm","email_address":"","number_of_employees":null,"founded_year":1879,"founded_month":null,"founded_day":null,"tag_list":null,"alias_list":"","created_at":"Thu Aug 12 02:28:50 UTC 2010","updated_at":"Sat Sep 25 13:36:04 UTC 2010","overview":"<p>Principal Financial Group, Inc. provides retirement savings, investment, and insurance products and services worldwide. It operates in four segments: U.S. Asset Accumulation, Global Asset Management, International Asset Management and Accumulation, and Life and Health Insurance. The U.S. Asset Accumulation segment offers defined contribution pension plans, including 401(k) and 403(b) plans, defined benefit pension plans, nonqualified executive benefit plans, and employee stock ownership plan consulting services to small and medium-sized businesses; investment-only products, such as guaranteed investment contracts and funding agreements to large institutional clients; and the ability to accumulate funds for retirement and savings through mutual funds, individual annuities, and bank products to employees of businesses and other individuals. The Global Asset Management segment provides asset management services covering a range of asset classes, investment styles, and portfolio structures to its other segments and third-party institutional clients. This segment principally offers investment advisory services across three asset classes comprising equity investments, fixed income investments, and real estate investments. The International Asset Management and Accumulation segment offers long-term savings, retirement annuities, asset accumulation, mutual funds, life insurance, mortgage loans, and institutional asset management products and services. The Life and Health Insurance segment provides individual life insurance and group health insurance products and services, as well as other specialty benefits consisting of group dental and vision, group life, group long-term and short-term disability, and individual disability insurance services. The company was founded in 1879 and is based in Des Moines, Iowa.</p>","image":{"available_sizes":[[[100,64],"assets/images/resized/0010/3101/103101v1-max-150x150.png"],[[100,64],"assets/images/resized/0010/3101/103101v1-max-250x250.png"],[[100,64],"assets/images/resized/0010/3101/103101v1-max-450x450.png"]],"attribution":null},"offices":[{"description":"HQ","address1":"711 High Street ","address2":"","zip_code":"50392","city":"Des Moines","state_code":"IA","country_code":"USA","latitude":null,"longitude":null}],"relationships":[],"investments":[{"funding_round":{"round_code":"e","source_url":"http://ca.sys-con.com/node/74305","source_description":"Palisade Systems Receives $2 Million in New Funding","raised_amount":2000000,"raised_currency_code":"USD","funded_year":2005,"funded_month":4,"funded_day":11,"company":{"name":"Palisade Systems","permalink":"palisade-systems","image":{"available_sizes":[[[150,70],"assets/images/resized/0006/9113/69113v1-max-150x150.png"],[[250,117],"assets/images/resized/0006/9113/69113v1-max-250x250.png"],[[267,126],"assets/images/resized/0006/9113/69113v1-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}