{"name":"Pro Active Financial Consultants","permalink":"pro-active-financial-consultants","crunchbase_url":"http://www.crunchbase.com/financial-organization/pro-active-financial-consultants","homepage_url":"http://www.go-offshore.com","blog_url":"http://myoffshorecompany.wordpress.com","blog_feed_url":"","twitter_username":"pafconsultants","phone_number":"+34 922979057","description":"Offshore company formations, Tax Saving","email_address":"admin@proactivefinancialconsultants.com","number_of_employees":11,"founded_year":1996,"founded_month":4,"founded_day":5,"tag_list":"offshore, compnay, offshore-comapny, company-formation, tax, tax-planning, offshore-bank, offshore-bank-account, confidential, corporate, cyprus, belize, bvi, british-virgin-islands, uae","alias_list":null,"created_at":"Thu Sep 06 15:13:58 UTC 2012","updated_at":"Sun Oct 21 06:43:36 UTC 2012","overview":"<p>Offshore Companies of Belize\nCompanies looking to perform offshore company formations should take a look at the Belize nation. There are a number of distinct advantages offered to the offshore companies in Belize. Belize has streamlined process the process of incorporating the companies and made it quick and efficient. This has made the country an attractive tax heaven for business owners. These changes were made in 1990 when a law was passed by the legislature making it easier to begin offshore companies in Belize.\nGenerally Belize requires one nominee director or a shareholder meaning a single person can start a company in Belize without needing cooperation from others. Other companies or individuals can both invest in Belize as offshore companies as the framework is quite simple. Belize also offers a guaranteed confidentiality which is fantastic as financial info is never kept secure enough. In Belize the shareholder and the director of a company can be the same meaning, it is possible to setup an offshore company on your own. You maybe the director of this company you have established but at the same time you may be receiving profit for the work company performs. Belize is also a famous tourist destination and is among the very few nations working towards creating a confidential banking method. These nations appreciate the clients from Western countries such as UK or US more and as a result are willing to provide excellent banking services for keeping these clients. You may also want to keep an offshore bank account in Belize.\nSetting up international organizations for the purpose of banking is considered as an act of faith. Therefore you need to be sure that you are comfortable with the people you are giving your money for safekeeping. The Belize government has made all the efforts to guarantee the safety of your company and the information being kept confidential. The private economy of Belize has an offshore jurisdiction and the major industries include tourism, agriculture property ownership and financial services. Other companies doing business in Belize include licensing, asset leasing, copyright and commercial trades. The offshore company paradise is considered as the best of its kind.\nAnother major advantage of investing in the offshore companies in Belize is that there are no local taxes and the offshore company will be completely exempt even from stamp duty. There is no need to go through filing and account auditing as the info to be made public is quite limited and consists of registration certification, memorandum/association articles etc. Due to the fact that Belize has all the help from latest technology, the incorporation process is quite simple and doesn&#8217;t take up much time. The company administration process is also quite simple. There are no restrictions on the paid up capital and as a result you can easily create a Belize offshore company. You can use any currency for expressing the company capital and the offshore companies are free from any foreign exchange control. English is the main language in Belize so it is easy for the Americans and Britishers to operate from Belize. The procedure for the transfer of IBCs from its jurisdiction is easy. Belize is easily accessible via sea and air from Central and North America.</p>","image":null,"offices":[{"description":"Tenerife Office","address1":"Winter Gardens, Capecan","address2":"","zip_code":"10000","city":"San Miguel de Abona","state_code":null,"country_code":"ESP","latitude":null,"longitude":null}],"relationships":[],"investments":[],"milestones":[],"providerships":[{"title":"Offshore Company Formation","is_past":false,"provider":{"name":"Chris Burton","permalink":"chris-burton","image":null}}],"funds":[],"video_embeds":[],"external_links":[]}