{"name":"Quantum Pacific Investments","permalink":"quantum-pacific-investments","crunchbase_url":"http://www.crunchbase.com/financial-organization/quantum-pacific-investments","homepage_url":"http://www.quantpacific.com/","blog_url":"","blog_feed_url":"","twitter_username":null,"phone_number":"","description":"","email_address":"","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":"","alias_list":null,"created_at":"Tue Apr 28 01:27:49 UTC 2009","updated_at":"Thu Apr 30 18:13:43 UTC 2009","overview":"<p>Quantum Pacific Investments is a limited liability company designed to provide strategic investment services to families, institutions, foundations and endowments. Many of these have trusted San Francisco Sentry and its professionals with their investment dollars over the past twenty-five years. The purpose of Quantum Pacific is to bring sophisticated investors the strongest, most dynamic, academically based investment platform available anywhere.</p>\n\n<p>Quantum Pacific’s investment professionals comprise a team with over a half a century of senior level management experience in the public markets. The objective of Quantum Pacific is to provide clients with maximally efficient, customized portfolios that incorporate the majority of the practical academic theory available to top tier investment professionals today along with proprietary active management. We seek a notable reduction in risk and even higher returns over time than optimization theory alone can provide. Our ideal client is the person, family or institution that wants to know at all times, their investments are fully diversified, actively managed, risk reduced, performance optimized and clinically efficient.</p>","image":null,"offices":[{"description":"","address1":"","address2":"","zip_code":"","city":"San Francisco","state_code":"CA","country_code":"USA","latitude":37.775196,"longitude":-122.419204}],"relationships":[],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}