{"name":"Rockhill Partners","permalink":"rockhill-partners","crunchbase_url":"http://www.crunchbase.com/financial-organization/rockhill-partners","homepage_url":"http://www.rockhill-partners.com","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"","description":"Seed and early stage investors","email_address":"info@rockhill-partners.com","number_of_employees":18,"founded_year":2005,"founded_month":1,"founded_day":1,"tag_list":"early-stage---seed---venture-capital---angel-investors---entrepreneurs","alias_list":null,"created_at":"Fri Oct 09 01:05:46 UTC 2009","updated_at":"Tue Oct 20 14:53:10 UTC 2009","overview":"<p>Rockhill Partners invests nationally in exceptional, early-stage companies in the life science and technology sectors.  </p>\n\n<p>Combining more than 200 years of experience, the Rockhill Partners team understands the nature of building companies and believes that an intense entrepreneurial spirit is essential for the success of early-stage companies.   Rockhill Partners brings this same spirit along with its capital, perspective and insight to help build the next generation of great companies.</p>\n\n<p>Current and past Rockhill Partners investments include:</p>\n\n<p>&#8221;&#8217;Proteon Therapeutics&#8221;&#8217; is a biotechnology company developing novel, first-in-class pharmaceuticals to address the medical needs of patients with renal and vascular diseases.   The company’s core intellectual property was created at Johns Hopkins University.  Proteon is headquartered in Waltham, Massachusetts and has research facilities in Kansas City, Missouri.  </p>\n\n<p>Rockhill participated in Proteon’s first angel round in early 2005 and has supported it through every financing round since that time.  Co-investors: Novartis (NYSE: NVS), MPM Capital, Bessemer Ventures, TVM Capital, Skyline Ventures, Prism Venture Partners, Intersouth Partners and Vectis Healthcare. </p>\n\n<p>Orbis Biosciences is a precision particle fabrication company whose core intellectual property was created at the University of Illinois at Urbana-Champaign.  The company is headquartered in Kansas City, Kansas.  </p>\n\n<p>Rockhill Partners led Orbis’ Series A financing in late 2008.</p>\n\n<p>Infegy is the creator of SocialRadar, a powerful set of tools to monitor, manage and measure social media on the web.  The company is headquartered in Kansas City, Missouri. </p>\n\n<p>Rockhill Partners began incubating Infegy in early 2008. </p>\n\n<p>LightSpeed Genomics is developing revolutionary tools for low-cost, high speed genome sequencing based on technology licensed from the Massachusetts Institute of Technology.   The company is headquartered in Sunnyvale, California.   </p>\n\n<p>Rockhill participated in the company’s first financing round in January 2007 and later helped arrange a venture debt financing by Western Technology Ventures and a strategic equity investment by Macrogren Corporation in 2008.  LightSpeed was acquired by Macrogren Corporation and the Korea Technology Investment Corporation in February 2009. </p>","image":{"available_sizes":[[[150,65],"assets/images/resized/0006/2158/62158v2-max-150x150.jpg"],[[223,97],"assets/images/resized/0006/2158/62158v2-max-250x250.jpg"],[[223,97],"assets/images/resized/0006/2158/62158v2-max-450x450.jpg"]],"attribution":null},"offices":[{"description":"Headquarters","address1":"4151 N Mulberry Drive","address2":"Suite 240","zip_code":"64116","city":"Kansas City","state_code":"MO","country_code":"USA","latitude":null,"longitude":null}],"relationships":[],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}