{"name":"Salix Ventures","permalink":"salix-ventures","crunchbase_url":"http://www.crunchbase.com/financial-organization/salix-ventures","homepage_url":"http://www.salixventures.com/","blog_url":"","blog_feed_url":"","twitter_username":null,"phone_number":"","description":"","email_address":"","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":"","alias_list":null,"created_at":"Mon Apr 27 18:51:14 UTC 2009","updated_at":"Thu Apr 30 17:46:11 UTC 2009","overview":"<p>We invest exclusively in health care services and health care information technology companies. We are stage-agnostic, investing in companies seeking their first round of institutional venture capital as well as more mature companies seeking later-stage rounds. We do not make seed-stage investments, requiring that the companies in which we invest have some operational base already in place in an industry with a demonstrated proof of concept. We prefer investment opportunities that already have the CEO on board who is capable of guiding the company through liquidity.</p>\n\n<p>On average, we invest $5-7 million per company, and we typically invest half of that amount in the first round of funding with similar amounts reserved for future private financing rounds. When we invest at an early stage of a company&#8217;s development, we pursue a more conservative reserve policy, investing less per first round than many other comparable-sized funds. We believe that this strategy mitigates the increased risk inherent at that stage of investment and positions Salix Ventures to be a dependable participant in later rounds. We always invest with at least one other, high-quality, institutional venture investor in every investment.</p>\n\n<p>When we make later-stage investments, we seek those opportunities where an exceptional management team is in place and there are other strong investors already involved. We expect to be as active an investor in our later-stage investments as we are in our early-stage investments. </p>","image":null,"offices":[{"description":"","address1":"","address2":"","zip_code":"","city":"Nashville","state_code":"TN","country_code":"USA","latitude":36.158887,"longitude":-86.782056}],"relationships":[],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}