{"name":"SATUS","permalink":"satus","crunchbase_url":"http://www.crunchbase.com/financial-organization/satus","homepage_url":"http://www.satus.pl","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"+48 (12) 294 72 15","description":"SATUS VENTURE","email_address":"biuro@satus.pl","number_of_employees":100,"founded_year":2005,"founded_month":1,"founded_day":5,"tag_list":"","alias_list":null,"created_at":"Tue Apr 03 07:00:53 UTC 2012","updated_at":"Fri Apr 06 22:54:39 UTC 2012","overview":"<p>SATUS it was founded in 2005, the Group seed fund managers and venture capital. Together with research institutes in Poland SATUS established seed funds pursuing investment pre-incubation of innovative ideas - JCI Venture Sp. of o.o., Innovation Accelerator NOT Sp. of o.o. and a seed fund KPT Sp. of o.o. SATUS also established a new venture capital fund, to which he invited an elite group of investors from the networks of private investors SATUS, and teamed up with Accelerator Technology Innovation Centre Foundation, University of Lodz. So far SATUS invested more than EUR 20 million zł in the company, such as Han Bright, Evatronix, Bloober Team, OK System Poland, Aviator Aviation Technologies, Binary Helix, Encja.com, Controlling Online.</p>\n\n<p>SATUS a group seed fund managers and venture capital. The group was founded in 2005 by two financiers Krakow: Krzysztof Bełecha and Mariusz Borowiec. So far SATUS invested more than EUR 20 million zł in the company, such as Han Bright, Evatronix, Bloober Team, OK System Poland, Aviator Aviation Technologies, Binary Helix, Encja.com, Controlling Online. Business Profile SATUS is focused in particular on innovative companies in the early stages of development, characterized by the highest return but also the highest risk. The group combines the advantages and potential of closed-end investment funds, the traditional business angel networks and research institutions. SATUS is the organizer of the whole investment process of incubation, the commercialization, to create and exit from the investment. SATUS together with research institutes in Poland, established seed funds pursuing investment pre-incubation of innovative ideas - JCI Venture Sp. of o.o., Innovation Accelerator NOT Sp. of o.o. and a seed fund KPT Sp. of o.o. SATUS also established a new venture capital fund, to which he invited an elite group of investors from the networks of private investors SATUS. The basic idea behind the project networks of private investors is to provide innovative projects to investors participating in the network.</p>","image":{"available_sizes":[[[150,98],"assets/images/resized/0018/2362/182362v2-max-150x150.jpg"],[[250,164],"assets/images/resized/0018/2362/182362v2-max-250x250.jpg"],[[450,296],"assets/images/resized/0018/2362/182362v2-max-450x450.jpg"]],"attribution":null},"offices":[{"description":"SATUS VENTURE","address1":"ul. Oleandry 2","address2":"","zip_code":"30-063","city":"KRAKOW","state_code":null,"country_code":"POL","latitude":null,"longitude":null}],"relationships":[{"is_past":false,"title":"Financial","person":{"first_name":"Satus","last_name":"Venture","permalink":"satus-venture","image":null}}],"investments":[],"milestones":[{"description":"SATUS Takes a Ride with Taxi5 in Poland\r\n","stoned_year":2012,"stoned_month":10,"stoned_day":5,"source_url":"http://invest-iq.net/2012/10/satus-venture-taxi5-investment/","source_text":null,"source_description":"SATUS Takes a Ride with Taxi5 in Poland ","stoneable_type":"FinancialOrg","stoned_value":null,"stoned_value_type":null,"stoned_acquirer":null,"stoneable":{"name":"SATUS","permalink":"satus"}}],"providerships":[{"title":"","is_past":false,"provider":{"name":"PLANET PR","permalink":"planet-pr","image":null}}],"funds":[],"video_embeds":[],"external_links":[{"external_url":"http://satus.pl/upload/files/20120221_puls_biznesu_bloober_te_62552637.pdf","title":"Bloober Team gra o miliony "}]}