{"name":"Société Régionale d’Investissement de Wallonie","permalink":"socit-rgionale-dinvestissement-de-wallonie","crunchbase_url":"http://www.crunchbase.com/financial-organization/socit-rgionale-dinvestissement-de-wallonie","homepage_url":"http://www.sriw.be/en/intro-1.html","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"0219 919 487","description":"","email_address":"","number_of_employees":null,"founded_year":1979,"founded_month":10,"founded_day":22,"tag_list":"redeployment, modernisation, growth-of-the-companies-concerned","alias_list":"","created_at":"Wed Feb 03 03:18:15 UTC 2010","updated_at":"Tue Feb 09 12:27:36 UTC 2010","overview":"<p>The S.R.I.W. and its subsidiaries together form the S.R.I.W. Group, whose mission is to intervene financially for the long term, in companies not only in Belgium but also abroad, with the objective of promoting the economic development of the Walloon Region, either directly or indirectly. They participate in projects for redeployment, modernisation or growth of the companies concerned. The financial resources which they contribute to the companies concentrate on activities aimed at the long term. This contrasts with the conventional, short-term financing covered by traditional bankers.\nThe S.R.I.W. Group aims to support the development of activities that generate added value in the Walloon Region, while at the same time ensuring the profitability of its own resources. The S.R.I.W. Group is resolutely committed to rapid, wide-scale development in today’s economic world; it seeks to significantly intensify its international contacts, not only supporting Walloon companies in their growth abroad, but also going out to meet companies that consider setting up in the Walloon Region. \nIn addition, the S.R.I.W. Group nurtures special relationships with venture capitalists, and if appropriate may co-invest with them.\nInterventions by the S.R.I.W. Group can concern all sectors of the economic life of the region, taking the following main forms: </p>\n\n<ul>\n<li>acquisition of shareholdings, which may or not be accompanied by put and/or call options; </li>\n<li>granting of loans, which may or may not be convertible, subordinated or accompanied by warrants. \nAs a financial partner, the S.R.I.W. Group’s vocation is to team up with industrial or service operators whose administrative and financial organisation is sufficiently stable, or soon will be. In this regard, its shareholdings are never aimed at acquiring control of the enterprises concerned, and so in principle never exceed 50% of the shares. \nThe S.R.I.W. Group also supports companies in the restructuring phase, and may participate in operations aimed at renewing the shareholding structures of companies. \nAll these interventions can be aimed at a longer period than is generally practised by the market.\nThe portfolio of the S.R.I.W. Group currently includes shareholdings in numerous sectors which together make up the industrial fabric of the region. The S.R.I.W. Group intends to actively pursue its interventions in these sectors.\nIn particular, however, the S.R.I.W. Group supports the development of certain sectors, namely: </li>\n<li>environmental activities and technologies; </li>\n<li>telecommunications; </li>\n<li>new technologies; </li>\n<li>medium-priced accommodation. \nThese four strategic areas are organised into four holding companies in which the S.R.I.W. holds a majority and in which private partners can also acquire a stake. \nMoreover, the S.R.I.W. Group also contributes to the financing of specific activities such as: </li>\n<li>the social economy, </li>\n<li>aeronautics, space, </li>\n<li>agricultural products. \nIn parallel with its close and natural collaboration with the private sector, the S.R.I.W. develops relations and partnerships with the university world and financial institutions.</li>\n</ul>","image":{"available_sizes":[[[146,150],"assets/images/resized/0007/6448/76448v1-max-150x150.png"],[[244,250],"assets/images/resized/0007/6448/76448v1-max-250x250.png"],[[251,257],"assets/images/resized/0007/6448/76448v1-max-450x450.png"]],"attribution":null},"offices":[{"description":"Headquarters","address1":"13, Avenue Destenay","address2":"","zip_code":"4000","city":"Liège","state_code":null,"country_code":"BEL","latitude":null,"longitude":null}],"relationships":[{"is_past":false,"title":"Chairman","person":{"first_name":"Jean-Pascal","last_name":"LABILLE","permalink":"jean-pascal-labille","image":null}}],"investments":[{"funding_round":{"round_code":"a","source_url":"http://onbiovc.com/promethera-biosciences-sa-series-a-73m/","source_description":"Promethera Biosciences, SA: Series A $7.3M","raised_amount":7300000,"raised_currency_code":"USD","funded_year":2010,"funded_month":2,"funded_day":2,"company":{"name":"Promethera Biosciences","permalink":"promethera-biosciences","image":{"available_sizes":[[[150,42],"assets/images/resized/0007/5857/75857v1-max-150x150.jpg"],[[205,58],"assets/images/resized/0007/5857/75857v1-max-250x250.jpg"],[[205,58],"assets/images/resized/0007/5857/75857v1-max-450x450.jpg"]],"attribution":null}}}}],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}