{"name":"STOC Angel Investment Network","permalink":"stoc-angel-investment-network","crunchbase_url":"http://www.crunchbase.com/financial-organization/stoc-angel-investment-network","homepage_url":"http://www.stoc-ny.com/angel-network.asp","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"607-748-1817","description":"Angels in NY Souther Tier","email_address":"jhayek24@aol.com","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":"angel-group, upstate-ny","alias_list":null,"created_at":"Fri Aug 13 20:18:41 UTC 2010","updated_at":"Fri Aug 13 20:32:43 UTC 2010","overview":"<p>The Southern Tier Opportunity Coalition (STOC) Angel Investment Network (AIN) is a group of individuals interested in investing in early to later development stage businesses that can demonstrate potential commercial success and can present a written, high quality business plan. STOC, together with the Binghamton University (BU) School of Management, will review business plans of companies seeking Angel investment and facilitate their presentation, as appropriate, to the STOC-AIN investor network, typically at a monthly dinner meeting. As a 501(c) 3 not-for-profit entity, STOC itself will not be an investor nor will it receive any fees should any Angels invest in the presenting businesses.</p>\n\n<p>Candidates for the AIN will typically be from technology-related industries, or be a value-added manufacturing or service company that will ultimately generate jobs in the Southern Tier of New York and other communities. Generally, STOC-AIN will not consider basic service businesses unless they afford a relatively immediate opportunity for regional or national expansion.</p>","image":null,"offices":[{"description":"Binghamton University","address1":"Couper Administration Building","address2":"Room 127","zip_code":"13902-6000","city":"Binghamton","state_code":"NY","country_code":"USA","latitude":null,"longitude":null}],"relationships":[],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}