{"name":"Swiss RE","permalink":"swiss-re","crunchbase_url":"http://www.crunchbase.com/financial-organization/swiss-re","homepage_url":"http://www.swissre.com","blog_url":"","blog_feed_url":"","twitter_username":null,"phone_number":"41 43 285 2121","description":null,"email_address":"","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":null,"alias_list":null,"created_at":"Sat Dec 22 11:46:39 UTC 2007","updated_at":"Wed Dec 03 10:24:49 UTC 2008","overview":"<p>As a leading and highly diversified global reinsurer, Swiss Re offers financial services products that enable risk taking essential to enterprise and progress. The Group’s position as preferred partner in the risk transfer industry is based on value propositions that comprise risk expertise, global reach, scale, diversification, very strong capitalisation and resilience over the long term.</p>\n\n<p>Founded in Zurich, Switzerland, in 1863, Swiss Re operates in more than 25 countries and provides its expertise and services to clients throughout the world. Swiss Re’s traditional reinsurance products and related services for property and casualty as well as for life and health business are complemented by insurance-based corporate finance solutions and supplementary services for comprehensive risk management.</p>\n\n<p>Swiss Re’s core values include active engagement with stakeholders, excellence through operational efficiency, sustainability in its economic, environmental and social performance, as well as integrity through its commitment to transparency and ethical principles.</p>\n\n<p>Swiss Re fully endorses state-of-the-art corporate governance and related transparency. Corporate governance – the framework defining Swiss Re’s organisation, structure, management and assurance functions – is designed to support Swiss Re’s success, protecting the interests of shareholders and other stakeholders. Swiss Re takes a proactive approach to aligning its expectations and interests with those of its stakeholders and continues to conduct benchmarking and implementation of best practice standards.</p>\n\n<p>A company’s sustainability practice and its reputational value are increasingly perceived as important drivers of business success. Swiss Re has firmly integrated sustainability practice into its corporate framework, thus creating economic value by improving its environmental and social performance beyond mere compliance with laws and regulations. </p>","image":{"available_sizes":[[[150,53],"assets/images/resized/0003/0853/30853v1-max-150x150.png"],[[191,68],"assets/images/resized/0003/0853/30853v1-max-250x250.png"],[[191,68],"assets/images/resized/0003/0853/30853v1-max-450x450.png"]],"attribution":null},"offices":[{"description":"","address1":"Mythenquai 50/60","address2":"P.O. Box","zip_code":"8022 ","city":"Zurich","state_code":null,"country_code":"CHE","latitude":47.3592631,"longitude":8.5351676}],"relationships":[],"investments":[{"funding_round":{"round_code":"c","source_url":"http://www.nanosolar.com/pr5.htm","source_description":"","raised_amount":75000000,"raised_currency_code":"USD","funded_year":2006,"funded_month":6,"funded_day":1,"company":{"name":"Nanosolar","permalink":"nanosolar","image":{"available_sizes":[[[150,30],"assets/images/resized/0000/2857/2857v1-max-150x150.png"],[[195,40],"assets/images/resized/0000/2857/2857v1-max-250x250.png"],[[195,40],"assets/images/resized/0000/2857/2857v1-max-450x450.png"]],"attribution":null}}}}],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}