{"name":"Taxmantra.com","permalink":"taxmantra-com","crunchbase_url":"http://www.crunchbase.com/financial-organization/taxmantra-com","homepage_url":"http://taxmantra.com","blog_url":"http://taxmantra.com/ereturns/","blog_feed_url":"http://feeds.feedburner.com/taxmantra1","twitter_username":"taxmantra","phone_number":"+919470194842","description":"Complete Accounting & Financial Services","email_address":"info@taxmantra.com","number_of_employees":25,"founded_year":2009,"founded_month":null,"founded_day":null,"tag_list":"online-income-tax-filing, online-tax-returns, income-tax-return-filing, individual-tax-filing, nri-tax-filing, income-tax-planning, tax-savings, chartered-accountant-services, company-law-services, tax-returns, tax-support, tax-planning, incorporation-of-","alias_list":null,"created_at":"Fri Dec 09 13:14:47 UTC 2011","updated_at":"Tue Dec 13 23:49:18 UTC 2011","overview":"<p>Taxmantra.com consists of Chartered Accountants, Company Law and Tax experts having expertise in the field of Income Tax, NRI Taxation, Service Tax, other direct /Indirect Taxes, Company Law, Assessments, Litigations and other allied consultancy services. The sole objective of Taxmantra.com is to bring full gamut of accounting, taxation and financial service on a single online platform under three broad service heads:\n(i)           Individual Taxation Services, which includes services like Online return filing services, Tax planning and save taxes service, Tax refunds services, ITR Rectification Assistance in allotment/ Correction/ Surrender of PAN number/ Issuance of Digital signature certificates and all other services related to individual taxation, covering both Salaried and Non-Salaried Individuals ,\n(ii)         Business Incorporation Services having services such as creation of private limited company, creation of Limited Liability Partnerships (LLPs), Start-Up Counseling and all other services related to business incorporation like local registrations,  and\n(iii)       Business maintenance Services having services  such as accounting, auditing assistance, Taxation, Company Law (ROC), Service tax and all other services related to business maintenance covering both Corporate and Non Corporate Entity.</p>\n\n<p>Taxmantra.com was founded by Alok Patnia, an expert in handling taxation issues, also has great insights on the business start-up issues and has vast experience in the field of business maintenance services. The prime objective to start Taxmantra.com was to provide timely and quality solutions at the customers end in most hassle free manner to make lives of tax payers easy.</p>\n\n<p>The services offered by us are carefully tailored – blending hard-core professionalism with a dedicated client orientation.</p>","image":{"available_sizes":[[[150,40],"assets/images/resized/0016/5885/165885v6-max-150x150.jpg"],[[250,67],"assets/images/resized/0016/5885/165885v6-max-250x250.jpg"],[[254,69],"assets/images/resized/0016/5885/165885v6-max-450x450.jpg"]],"attribution":null},"offices":[{"description":"Kolkata Corporate Office","address1":"AC#147, Sector 1, Saltlake, Kolkata 700064","address2":"","zip_code":"700064","city":"Kolkata","state_code":null,"country_code":"IND","latitude":null,"longitude":null}],"relationships":[{"is_past":true,"title":"Founder and CEO","person":{"first_name":"Mr.","last_name":"Alok Patnia","permalink":"mr-alok-patnia","image":null}}],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[{"external_url":"http://www.youtube.com/watch?v=3CfJWqq5PUc","title":"Individual Taxation Services in India"},{"external_url":"http://www.youtube.com/watch?v=iLbl6t--r6Q","title":"Start-up Counseling Services India"}]}