{"name":"The March Group","permalink":"the-march-group","crunchbase_url":"http://www.crunchbase.com/financial-organization/the-march-group","homepage_url":"http://www.marchgroup.com/","blog_url":"http://blog.marchgroup.com","blog_feed_url":"","twitter_username":"TheMarchGroup","phone_number":"866-663-5806 ","description":"Mergers and Acquisitions Firm.","email_address":"Info@MarchGroup.com","number_of_employees":200,"founded_year":1986,"founded_month":null,"founded_day":null,"tag_list":"","alias_list":"","created_at":"Tue Jul 07 20:54:35 UTC 2009","updated_at":"Wed Jul 29 23:35:05 UTC 2009","overview":"<p>The March Group is a mergers and acquisitions firm serving mid-size companies. The company has been in business since 1986 and has completed thousands of transactions ranging from $1 million to $100 million. The March Group has over 2,000 employees consisting of investment bankers and support staff. Headquartered in Coral Springs, Florida, the company has 13 offices located worldwide.</p>\n\n<p>The March Group provides a hands-on approach to the valuation and sale of privately held companies. For sellers, the company offers an introductory workshop to prepare business owners for the eventual sale of their company. By attending this workshop early in the selling process, The March Group is able to help business owners realize the maximum value for their company.</p>\n\n<p>For investors, The March Group maintains a website of their available inventory on corporations4sale.com. These up-to-the-minute listings provide an overview of the companies that The March Group is representing. Investors who register online will also have access to one of the company’s seasoned acquisitions brokers.</p>\n\n<p>In addition to mergers and acquisitions, The March Group also provides a number of financial advisory services in the following areas: corporate finance, restructuring, business plan development and strategic growth consulting.</p>","image":{"available_sizes":[[[150,60],"assets/images/resized/0005/4687/54687v1-max-150x150.png"],[[232,93],"assets/images/resized/0005/4687/54687v1-max-250x250.png"],[[232,93],"assets/images/resized/0005/4687/54687v1-max-450x450.png"]],"attribution":null},"offices":[{"description":"Headquarters","address1":"1401 N. University Drive","address2":"","zip_code":"33071","city":"Coral Springs","state_code":"FL","country_code":"USA","latitude":26.2480187,"longitude":-80.2530927}],"relationships":[],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}