{"name":"The InvestLinc Group","permalink":"the-investlinc-group","crunchbase_url":"http://www.crunchbase.com/financial-organization/the-investlinc-group","homepage_url":"http://www.investlinc.com/","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"440.247.3708","description":"Capital Markets","email_address":"","number_of_employees":null,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":"","alias_list":"","created_at":"Tue Jan 26 14:21:40 UTC 2010","updated_at":"Tue Jan 26 14:21:40 UTC 2010","overview":"<p>The Investlinc Group, LLC provides private capital, wealth services, and life services for high net worth individuals, businesses, and institutions. The company offers private equity, real estate, and power optimization investment opportunities to investors and institutions, as well as capital and financing options for businesses; wealth planning and wealth management for wealthy families in the United States; and intellectual and relational opportunities, life coaching, spiritual care, and executive health services. Its services also include debt-financing consulting; recapitalization to assist management in obtaining and structuring senior and subordinated credit facilities, including lines of credit, term loans, machinery and equipment financing, and mortgage financing; assisting to secure capital for management buyouts, as well as range of related services that include valuing and evaluating offers, analyzing the impact of borrowing, negotiating and structuring transactions, and developing pre- and post-transaction operating strategies; commercial real estate financing for owner and non-owner occupied commercial real estate projects; executive coaching; strategic planning; and healthcare financing for healthcare facilities. The company was founded in 1992 and is headquartered in Hoffman Estates, Illinois. It has additional offices in Atlanta, Georgia; Cleveland, Ohio; Chicago, Illinois; Houston and Dallas, Texas; Fayetteville, Arkansas; Fort Lauderdale, Florida; Indianapolis, Indiana; Jackson, Mississippi; Los Angeles, California; and Tulsa, Oklahoma.</p>","image":{"available_sizes":[[[150,96],"assets/images/resized/0007/4904/74904v1-max-150x150.jpg"],[[189,121],"assets/images/resized/0007/4904/74904v1-max-250x250.jpg"],[[189,121],"assets/images/resized/0007/4904/74904v1-max-450x450.jpg"]],"attribution":null},"offices":[{"description":"","address1":"15 Pleasant Avenue","address2":"","zip_code":"44022","city":"Chagrin Falls","state_code":"OH","country_code":"USA","latitude":null,"longitude":null}],"relationships":[{"is_past":false,"title":"Chairman & CEO","person":{"first_name":"Richard","last_name":"M. Cott","permalink":"richard-m-cott","image":null}}],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}