{"name":"Traders Leader","permalink":"traders-leader","crunchbase_url":"http://www.crunchbase.com/financial-organization/traders-leader","homepage_url":"http://www.tradersleader.com/","blog_url":"","blog_feed_url":"","twitter_username":"TradersLeader","phone_number":"","description":"Binary Options Trading Platform","email_address":"marketing@tradersleader.com","number_of_employees":null,"founded_year":2011,"founded_month":null,"founded_day":null,"tag_list":"binary-options, digital-options, trading, forex, commodities, indices, stocks","alias_list":null,"created_at":"Mon Apr 16 10:08:15 UTC 2012","updated_at":"Thu Apr 19 01:41:05 UTC 2012","overview":"<p>Tradersleader.com is the most professional and objective platform for trading Binary Options online. </p>\n\n<p>Traders Leader is an innovative consumer trading company offering clients an easy and intuitive way to trade on leading financial markets - Forex, Commodities, Indices or Stocks. They deliver new trading solutions built for capitalizing on market rate movements that are simple to use, yet provide the value and sophistication expected from a worldwide leader.</p>\n\n<p>The trading platform is 100% web-based, allowing you to instantly trade from anywhere in the world without the need to either download or install any software.</p>\n\n<p>While in the past, speculative trading involved a thorough understanding of financial markets and its complex financial terminology – Tradersleader intuitive platform enables all consumers to trade by benefiting from a radically simplified trading procedure.</p>\n\n<p>Traders Leader trading platform is designed to provide a 100% secure and private investment experience, and to make financial trading as rewarding as possible for the customers, every time they trade.</p>","image":{"available_sizes":[[[150,40],"assets/images/resized/0018/4380/184380v2-max-150x150.png"],[[250,68],"assets/images/resized/0018/4380/184380v2-max-250x250.png"],[[400,109],"assets/images/resized/0018/4380/184380v2-max-450x450.png"]],"attribution":null},"offices":[],"relationships":[],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}