{"name":"UnitedWeb","permalink":"unitedweb","crunchbase_url":"http://www.crunchbase.com/financial-organization/unitedweb","homepage_url":"http://www.unitedweb.com","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"(800) 983-4289","description":"Our purpose is to invest in rapidly grow","email_address":"tconrad@unitedweb.com","number_of_employees":2,"founded_year":null,"founded_month":null,"founded_day":null,"tag_list":"","alias_list":null,"created_at":"Thu Jun 02 23:58:55 UTC 2011","updated_at":"Tue Jun 07 14:16:55 UTC 2011","overview":"<p>UnitedWeb invests in, owns and operates a portfolio of technology, Internet and Internet related growth companies.</p>\n\n<p>Who are we?</p>\n\n<p>We are entrepreneurs and business owners that invest our own financial and intellectual capital in growth companies that we understand. When evaluating an opportunity, we also must believe that we can add an extraordinary amount of value with our capital and expertise.</p>\n\n<p>Our Purpose</p>\n\n<p>Our purpose is to invest in rapidly growing technology and Internet companies and enable them to reach their full potential.</p>\n\n<p>What Do We Do?\nWe help our companies to grow by leveraging our assets, skills, customers, knowledge and relationships where appropriate.</p>\n\n<ul>\n<li>By deploying capital.</li>\n<li>By unlocking strategic value.</li>\n<li>By helping each company to grow.</li>\n<li>By leveraging skills sets whereas appropriate.</li>\n</ul>\n\n<p>How Are We Involved?\nWe will invest capital and lend our expertise to portfolio companies. Where a company is in its growth phase will often times determine our level of day to day involvement. We will independently and regularly evaluate each portfolio company on this decision.</p>\n\n<p>Vision\nTo become the leading capital and strategic partner for startups and growth technology and Internet businesses.</p>\n\n<p>Our Beliefs</p>\n\n<p>-People and Individuals who lead by hard work, dedication and commitment create the strengths of a company\n-Outstanding Service and Products\n-Win by being Quick and Decisive\n-Embrace Continuous Improvements\n-Reward High Performance</p>\n\n<p>Our Mission</p>\n\n<p>Unitedweb seeks to create value for people and small business customers by simplifying and improving the tools and capabilities that they rely on to use the Internet and to manage their business. We believe that most web applications in today&#8217;s market are overly complicated, ineffective or overpriced. We focus on opportunities to deliver a differentiated online experience to our customers.</p>","image":{"available_sizes":[[[150,43],"assets/images/resized/0013/7530/137530v2-max-150x150.png"],[[178,52],"assets/images/resized/0013/7530/137530v2-max-250x250.png"],[[178,52],"assets/images/resized/0013/7530/137530v2-max-450x450.png"]],"attribution":null},"offices":[],"relationships":[],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}