{"name":"XOS Capital Ltd","permalink":"xos-capital-ltd","crunchbase_url":"http://www.crunchbase.com/financial-organization/xos-capital-ltd","homepage_url":"http://www.xoscapital.com","blog_url":"","blog_feed_url":"","twitter_username":"","phone_number":"","description":"Venture Capital - Start-up - Funding","email_address":"info@xoscapital.com","number_of_employees":5,"founded_year":2009,"founded_month":null,"founded_day":null,"tag_list":"capital, funding, venture, internet, ecommerce, start-up, money, young, entrepreneur","alias_list":null,"created_at":"Fri Sep 17 02:56:30 UTC 2010","updated_at":"Thu Sep 23 03:22:42 UTC 2010","overview":"<p>The XOS team consists of successful entrepreneurs and professionals. Our venture experience is profound; we have each started and developed our own companies with many years experience in different sectors.</p>\n\n<p>Our goal is to identify and finance pioneering companies worldwide during their start-up phase. We are continually looking for entrepreneurs who are ready to turn their great business ideas into reality. We decided to put together all our resources as investors to help other entrepreneurs realise their own success stories using our own experience. We are familiar with every stage of establishing a successful company from raising money and getting started to building and growing an organisation into a very large global business and establishing exit strategies.</p>\n\n<p>When we invest in a business we’re investing much more than finance alone, we invest our time, knowledge, operational expertise and a practical ability to make things happen all these aspects are key to creating successful businesses</p>\n\n<p>We are focused on early stage investments in technology and ecommerce companies specifically software, digital media, e-commerce and other internet innovations.</p>","image":{"available_sizes":[[[150,45],"assets/images/resized/0010/2066/102066v2-max-150x150.jpg"],[[250,75],"assets/images/resized/0010/2066/102066v2-max-250x250.jpg"],[[296,89],"assets/images/resized/0010/2066/102066v2-max-450x450.jpg"]],"attribution":null},"offices":[{"description":"London Office","address1":"58-60 Berners Street","address2":"","zip_code":"W1T 3JS","city":"London","state_code":null,"country_code":"GBR","latitude":null,"longitude":null}],"relationships":[],"investments":[],"milestones":[],"providerships":[],"funds":[],"video_embeds":[],"external_links":[]}